[[{"date": "18 Mar 2023", "title": "Associate Program Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Population Services International", "Interview Descriptions": "I had an initial interview that wend pretty well. The questions were straightforward and general. The second interview was more specific to project management skills and the role in itself. The whole process was about three weeks before I was offered the position.", "Interview Questions": "Tell us about yourself. What's the highest budget you've worked on? Why do you want this position"}, {"date": "13 Mar 2023", "title": "Marketing Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Population Services International in Mar 2023", "Interview Descriptions": "It's was good. The environment was great. They made me feel comfortable before the interview began. It was a better experience compared to other interviews I have had. The interview took 30 minutes and I recommend you read the job description before going in to the interview.", "Interview Questions": "What type of consumer centered marketing activities would I do. And how would I go on to do the execusion."}, {"date": "5 Oct 2022", "title": "Financial Accountant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Population Services International", "Interview Descriptions": "Took 3 weeks from beginning to end. I was interviewed by her first then immediate boss as well as leadership for final offer. All in all it was a pleasant experience", "Interview Questions": "How to handle challenges with teams"}, {"date": "13 Sept 2022", "title": "Associate Program Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Population Services International", "Interview Descriptions": "Intense, made it through three rounds to a written and budget “exam” and then company completely ghosted me. I reached out and was told I’d receive more info about next steps and never heard anything again. ", "Interview Questions": "Budget building and editing exercise"}, {"date": "6 Jun 2023", "title": "Digital Program Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Population Services International (Nairobi) in Sept 2022", "Interview Descriptions": "The interview process has about three rounds. The first one being HR screening, then an interview with the Program Team and lastly a case study for presentation. The interviewers are professional and make you feel like your time is valued.", "Interview Questions": "What is my consideration when developing digital products?"}, {"date": "18 May 2023", "title": "Digital Health Consultant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Population Services International (Ikoyi, Lagos) in Mar 2022", "Interview Descriptions": "Winding and non transparent process and they didn't have the courtesy of providing feedback to the applicant even at the final stages where the candidates pile has been trimmed down.", "Interview Questions": "Expected salary and availability date"}, {"date": "7 Sept 2021", "title": "Associate Program Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Population Services International in Aug 2021", "Interview Descriptions": "HR screening and group interview of three panelists . I was pretty much disappointed by the process - one of panelist did not pay attention during the interview and another one was asking  4-5 questions why I applied for this position if I do not have straightforward background for it.  Not sure why I got shortlisted for interview if they search for somebody with clear cut background in project management.  Probably list of time . Never heard back despite several follow up emails. Obviously they do not care about applicants too much . Just a number", "Interview Questions": "Why do you want to work here . Why this position "}, {"date": "2 Nov 2021", "title": "Senior Consultant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at Population Services International (Abuja, Federal Capital Territory) in May 2021", "Interview Descriptions": "Virtual, two-stage personal interview, perhaps due to the ongoing pandemic. Went well, to my mind. \n\nNo reason was given for not being selected even though the role was perfectly aligned to my competencies and strength.\n\nExpected prospective employer to make an offer.", "Interview Questions": "What I had done in previous projects, which makes me suitable for the role."}, {"date": "26 Apr 2021", "title": "Associate Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Population Services International in Apr 2021", "Interview Descriptions": "I applied online and the next day, an HR Manager reached out to schedule a phone screening. We spoke for about a half hour walking through my resume, interest in the role and details about PSI. \n\nThe following day, the hiring manager for the role reached out to schedule a video call. It took a lot of back and forth but I got something on the books the following week. That call included 3 people and lasted about an hour. We spoke mostly of the same things in a little more detail. \n\nThey followed up immediately afterwards inviting me to round three. I was told round three consisted of a writing test and a final interview where I'd present what I wrote. They asked me to indicate a 48 hour period the following week in which I'd have time to complete the assignment. They scheduled the interview for noon on Wednesday and told me they'd send the assignment before noon Monday. \n\nMonday morning came and went with no email. I reached out to the hiring manager and there was some confusion on who was sending it. I received it after 2pm.  Unfortunately, over the course of 2 work days, the assignment took almost 20 hours to complete. It included 2 fleshed out communications plans and a website analysis. This is challenging for anyone with a job. The last round interview was with 2 people on the same project in a different department. I was told it came down to myself and another candidate and it ultimately went to the other candidate. \n\nThe pros were that everyone was super kind and smart. The cons were that the assignment was massively time consuming and near impossible for anyone with another job.", "Interview Questions": "Which part of the role are you most concerned about? "}, {"date": "9 Dec 2021", "title": "Technical Writer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Population Services International in Jan 2021", "Interview Descriptions": "I met with a recruiter and then a senior staff member I’d be reporting to. They were pleasant, easy to talk to and the interview went well in my opinion. Questions were standard. What I wasn’t impressed with is that it took them a month to get back to me to tell me they’d gone with someone else, despite a few emails to enquire.", "Interview Questions": "Tell me about a time you had a disagreement with a work colleague and how did you handle it?"}], [{"date": "17 Dec 2020", "title": "Senior CRA Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Population Services International", "Interview Descriptions": "3 ENTRETIENS : le premier avec les RH qui appellent de Pologne, le 2eme avec responsable de service et le troisième avec le responsable bureau France.\r\nLes entretiens se font entièrement en anglais, l est donc important de pratiquer.", "Interview Questions": "motivation,\r\nexpérience\r\nsalaire\r\nIls aiment les parcours atypiques"}, {"date": "17 Dec 2020", "title": "Research Data Scientist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Population Services International", "Interview Descriptions": "technical detailed questions about research  are very good, very comfortable interactive interview, feels like you are discussing more than asking and answering questions, technical detailed questions about research  are very good, very comfortable interactive interview, feels like you are discussing more than asking and answering questions", "Interview Questions": "technical detailed questions about research "}, {"date": "23 May 2022", "title": "Digital Marketing Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at Population Services International (Harare) in Oct 2020", "Interview Descriptions": "2 rounds of interviews. \r\n1 interview with key team members.\r\n1 interview with senior management and HR director.\r\n\r\nCarried out a presentation task and answered a fire round of questions.\r\n\r\nOverall pleasant experience with the panels, however did not hear back, called for feedback was met with disinterest. Concerned about the HR directors connection with my boss as they knew each other personally.", "Interview Questions": "What would you change about social media presence."}, {"date": "22 Jun 2021", "title": "Programmer Analyst Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 8 weeks. I interviewed at Population Services International (Johannesburg) in Jan 2020", "Interview Descriptions": "great and engaging. I went through two rounds. They wanted somebody with a clear data background. They were quite thorough. thE PANEL WAS BALANCED with a wide spread of persons with different technical backgrounds", "Interview Questions": "Tell me about yourself and what are your values?"}, {"date": "5 Dec 2019", "title": "Assistant Program Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Population Services International (Washington, DC) in Nov 2019", "Interview Descriptions": "I spent a 1.5 months  interviewing for this position for it only to be 'canceled' in the end, something I found out via an automated email from PSI. I applied in early October and a week later was emailed by a recruiter contracted out by PSI who sent me a list of questions I had (of course) already gone over in my application. He then scheduled a phone call to (again!) go over the questions and then said he'd be in touch. I then received an invitation from PSI to come in for a panel interview. It went well, 3 people from the SRH program interviewed me and it was average interview questions and they were nice. A week later I was informed that I was invited in for the final interview the next week with the director of the program and was given an assignment to complete beforehand. The final interview was odd...the director seemed far removed from this position and presented it differently that the panel did at the first interview. He asked me my career goals, why I applied, why PSI, etc.  They then asked about my qual. research experience and when I answered he replied that I seemed more excited about research than programmatic stuff and why this position and not going down a research track. This threw me because I was only responding to a specific question (and this position was first presented as a technical AND program related role!) I was unsettled by this and wondered if he just wanted to make me uncomfortable by probing. He then told me I should be hearing from then within a week. Exactly one week later I was informed by a general HR email that the position had been suspended/canceled with no explanation. I was very upset as I had spent 1.5 months interviewing and devoting my time to this to only be told with no specifics they had decided to cancel it. What a joke and a waste of everyone's time involved.", "Interview Questions": "What is your career trajectory?"}, {"date": "3 Oct 2019", "title": "Programs Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Population Services International", "Interview Descriptions": "There was a first-round interview by skype. It seemed a little unorganized and there were multiple people on the call. They transitioned to French halfway through to test languaage skills. Despite attempting to follow up, I never heard anything.", "Interview Questions": "Describe a time in a past job you had to perform the job functions listed in the job. "}, {"date": "14 Aug 2019", "title": "Program Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 3 weeks. I interviewed at Population Services International (Washington, DC)", "Interview Descriptions": "The interview process initially started as a phone screen. A little over a week later, I received an in-person second round interview. The second round interview began as an in-depth behavioral and work personality gauge. After over an hour of behavioral questions, I received a written language assessment. The entire interview process was pretty straightforward.", "Interview Questions": "Why should we choose you over an internal candidate?"}, {"date": "13 Aug 2019", "title": "Program Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Population Services International", "Interview Descriptions": "I was contacted for a phone interview for the position and asked to give the times I was available to interview the following week. I gave the times I was available to interview, but never heard from the company afterward. I sent a follow-up email, but still received no response. I was really disappointed with the lack of professionalism, and because I was very excited about the opportunity.", "Interview Questions": "N/A"}, {"date": "3 Jul 2019", "title": "Theatre Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Population Services International (Harare)", "Interview Descriptions": "They  where 3 interviewers the site manager and 2 more site managers from other sites.They took turns in asking questions.One of the interviewrs was a Doctor at the clinic.It was at least 10 mins", "Interview Questions": "N/A"}, {"date": "10 Jan 2019", "title": "IT Network Administrator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 3 weeks. I interviewed at Population Services International (Monrovia)", "Interview Descriptions": "The interview process typically includes the following steps: writing a job description, posting a job, scheduling interviews, conducting preliminary interviews, conducting in-person interviews, following up with candidates, and making a hire", "Interview Questions": "The interview process was very easy and smooth. Highly  experienced in customer service. Achieved friendliness to ensure customer satisfaction. Use of numerous skills to train and lead others. Good work ethic."}], [{"date": "22 Mar 2019", "title": "Associate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Population Services International (Washington, DC) in Jan 2019", "Interview Descriptions": "I was phone screened by a recruiter about my job description currently, why I'm looking, and then given a quick overview of the position and company. I really liked the recruiter.  After about a week, she emailed me asking me to come in ASAP for an in-person interview. I assumed they were moving fast.\r\n\r\nWhen I went into the office, the receptionist wasn't very friendly, the interviewers asked really standard questions, and mixed me up with another person -- they had all the resumes in a stack on the table, so I could see who besides me was interviewing. Weird. There was little introduction to the company or office, so I couldn't really see myself there and it felt like I was just another task on their to do list, despite them being nice enough. I interviewed with two people at once and there was a definite lack of chemistry in the room during the discussion so it was a little uncomfortable - it didn't feel a ton like a conversation. When I asked them questions, they looked at each other and laughed and said \"everyone asks this,\" which I thought was pretty off-putting and made me feel uncomfortable - maybe they could do a better job explaining that up front then?\r\n\r\nI never heard back from them after over a month and was never given contact information for the hiring managers, or any follow up from the recruiter. Overall the process seemed pretty disorganized and they do very little to sell their company or brand - I would have declined if they had extended an offer due to the interview process.", "Interview Questions": "They asked how I did with constant change and irregular responsibilities, how I stayed organized"}, {"date": "23 Jan 2019", "title": "Intern Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Population Services International in Jan 2019", "Interview Descriptions": "Phone screen, skype interview, \"test\" phase. Phone screen was brief, with only behavioral questions involved. The skype interview was with a group of three and focused mainly on behavioral questions as well.", "Interview Questions": "How does this position fit within your general career goals?"}, {"date": "10 Apr 2018", "title": "Accountant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Population Services International (New York, NY)", "Interview Descriptions": "There was an initial phone screening conducted by HR, followed up by an in office interview with a manager and senior. After this round I was contacted by HR for  a second interview with the controller.", "Interview Questions": "What do you know about PSI values and mission?"}, {"date": "3 Apr 2018", "title": "IT-Sicherheitssupportanalyst Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Population Services International", "Interview Descriptions": "Pretty typical interview process. Started with an initial HR screening, then a writing assignment, and then an hour of in person interviews with the team. The process took roughly 3 weeks.", "Interview Questions": "Why PSI, why this role, how do you prioritize, how do you manage stress "}, {"date": "15 Sept 2020", "title": "Program Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Population Services International (Washington, DC) in Apr 2018", "Interview Descriptions": "Pretty straight forward and helped me to understand the culture of the organization. Had ample opportunity to ask the questions that were important to me.  I was impressed by the people who interviewed me.", "Interview Questions": "What is the one thing you most hope to learn in this role?"}, {"date": "26 Mar 2018", "title": "Recruitment Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Population Services International", "Interview Descriptions": "The process included meeting with various members of the team as well as the recruitment lead. Overall, the process was pretty quick and decisive. After a phone interview, coming in person, and a follow-up conversation, I was hired.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "20 Jul 2018", "title": "Demand Creation Representative Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Population Services International (London, England) in Feb 2018", "Interview Descriptions": "The interview questions were related to the product I was to create a demand for. So, basically know everything you need to know about the product and national laws about the use of the product. My line was Misoprostol tablets and IUD devices.", "Interview Questions": "What does the Nigerian law say about abortion?"}, {"date": "12 Dec 2017", "title": "Assistant Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Population Services International", "Interview Descriptions": "One round of technical interview followed by HR interview. More than 10 question was asked to test my technical knowledge and suitability for the position and there were some general questions as well like what are the added advantage IT can provide for the betterment of the project etc. Then background check and police verification and document verification done before hiring.", "Interview Questions": "How can you contribute to this project?"}, {"date": "2 Nov 2017", "title": "Intern - Hourly Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Population Services International (Washington, DC)", "Interview Descriptions": "The interview went pretty smoothly. It lasted about 25-30 minutes. I was interviewed by two senior members of the team, they were warm, friendly and open to questions.  Be prepared to answer questions about your past work experience.", "Interview Questions": "Why are you interested in this position?"}, {"date": "24 Mar 2018", "title": "Assistant Program Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Population Services International (Washington, DC) in Sept 2017", "Interview Descriptions": "I applied online for the Assistant Program Manager position. During the phone screen, I was asked about my ability to manage multiple priorities, describe experience with donors, and my availability", "Interview Questions": "Talk about your experience with international donors"}], [{"date": "4 Oct 2017", "title": "Internal Audit Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Population Services International (Harare) in Aug 2017", "Interview Descriptions": "the intial stage was a Psychometric tests followed by timed session in which the interviewee had to respond to a case then prepare  presentation answering 5 question pertaining to the case in 20 minutes.  After that the  interviewee had to present the presentation to a panel of 3 explaining the reasoning behind the answers and responding to questions.", "Interview Questions": "What innovation would you bring into the audit department?"}, {"date": "17 Jul 2017", "title": "Lac Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Population Services International", "Interview Descriptions": "Applied online, got an email about a phone screening that was 15-30 minutes long. After that, they would confirm later about whether or not you got an in person interview. The person I spoke with was great, very friendly and even upon informing me that I didn't get the in person interview offered to provide me feedback (I have yet to receive the feedback, I had the screening about 1.5 weeks ago, but either way the gesture was nice)", "Interview Questions": "Tell us about yourself"}, {"date": "15 Mar 2017", "title": "Senior Technical Advisor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 1+ week. I interviewed at Population Services International (Washington, DC)", "Interview Descriptions": "Very professionally handled process;excellent response time from recruiter and even got a response of why I wasn't the successful candidate for the role which is helpful as I continue to explore", "Interview Questions": "Expand and tells us more why PSI is your career choice at this stage of your career"}, {"date": "13 Mar 2017", "title": "Program Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Population Services International (Washington, DC) in Feb 2017", "Interview Descriptions": "The interview process was pretty straightforward and simple. I had an initial phone screen with a project manager of the team. I was asked some basic questions about my background and interest in the position. A few weeks later I was asked to come in to interview in-person with a panel.", "Interview Questions": "How do you stay organized and handle competing priorities?"}, {"date": "24 Oct 2016", "title": "Communications Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Population Services International (Washington, DC) in Aug 2016", "Interview Descriptions": "I was contacted by a recruiter and had an hour long interview with her filled with standard interview questions; describe your experience, what are you looking for, what can you bring to the company. Within a week I had another interview with my potential boss via skype. The interview lasted an hour. During the interview, I couldn't tell if she was taking notes or doing something else, but I wasn't sure she was 100% listening. It also felt more like an interrogation than an interview at times. There were a lot of detailed and very specific questions. The skype interview was on a Friday and I was told Wednesday that I didn't get the position.", "Interview Questions": "If you had $500 what type of team building activity would you put on? "}, {"date": "17 Sept 2016", "title": "Marketing Communications Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Population Services International (Accra) in Aug 2016", "Interview Descriptions": "I had my first interview with an HR agency, I'm yet to meet PSI officials for my second interview. After postponing a couple of times, I've recently  been called for my second interview (which is in 2 days). I hope to update this review as soon as I'm done with my second interview at Population Services International. Thank you.", "Interview Questions": "How would you differentiate between advocacy and objectivity?"}, {"date": "29 Jul 2016", "title": "Consultant In Communication Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Population Services International (Douala)", "Interview Descriptions": "They ask you questions related to the position you applied for.\r\nFor me it was for a Consultant in Communciation so I had to demonstrate that I have the skills required for the position.\r\nIt's wasn't about experience (As I said earlier, there is a private University where you can improve your skills) but about how well you can fit in their organization.", "Interview Questions": "Give us a 5 minutes demo for a radio show with introduction, guest, topics and summary."}, {"date": "13 Jul 2016", "title": "Data Analyst Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Population Services International", "Interview Descriptions": "Applied online heard back in about a week. Completed a STATA task that took about 3 hours, had a 30 min Skype interview about a week later with both the data analysis team lead as well as the program lead and then was hired about a week after the Skype interview.", "Interview Questions": "They asked about past data analysis experience as well as my general interests in the program subject matter (malaria)."}, {"date": "5 Jul 2016", "title": "Intern - Hourly Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Population Services International in Jun 2016", "Interview Descriptions": "I was emailed to schedule a phone interview. This lasted approx 20 minutes and consisted of basic questions: tell me about yourself, why do you believe you are the best candidate, what qualifications do you have that fit this job, why this company/position. I was emailed to do an in-person interview later that week. This was three interviewers, and asked questions on the skills required for the job. In both interviews I was occasionally asked a question in another language to test the language requirement.", "Interview Questions": "What experience do you have with finance?"}, {"date": "15 Aug 2016", "title": "Program Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 8 weeks. I interviewed at Population Services International (Washington, DC) in Jun 2016", "Interview Descriptions": "I applied online and I was contacted by the HR for a telephone interview after nearly 5 weeks. organizing the in-person interview took more than two weeks due to business travel and other meetings. Even then, they asked me to get in their office at 8:00AM and it was a bit challenging", "Interview Questions": "No special question: the usual why do you want to work for us, who you are and why PSI?"}], [{"date": "20 Apr 2020", "title": "H R Operations Manager Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Population Services International (Harare) in Apr 2016", "Interview Descriptions": "They flight a position, you apply and if selected you get called for an interview which lasts from 10-30 minutes depending. After the interview they will only call successful candidates", "Interview Questions": "Previous work experience that makes you qualify for the post"}, {"date": "23 Mar 2016", "title": "APM Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at Population Services International (Washington, DC)", "Interview Descriptions": "standard questions which you can manage with a basic practice.", "Interview Questions": "basic"}, {"date": "8 Mar 2016", "title": "Program Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 days. I interviewed at Population Services International in Mar 2016", "Interview Descriptions": "The intervew was about 30 minutes long where you are screened based on the fit between your competencies and the expectations from the position. I had a great interview experience and was paired with a current employee of PSI who was knowledgeable on the organization because she had worked for the past 4 yrs. I also was given time to ask questions on the position after the screening process.", "Interview Questions": "When have I used xyz skill mentioned in the job description?"}, {"date": "19 Feb 2016", "title": "Associate Program Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Population Services International (Washington, DC) in Dec 2015", "Interview Descriptions": "I had a phone interview with HR, where they reviewed my interest for the position and how I heard about the company. We went over qualifications, salary, and next steps. I then went through a writing test and a budget test. Next, I interviewed with program manager via Skype, then had an interview with a program manager in person. I was asked for my availability for a final interview and told by HR as I left my last interview that I did very well and would hear from them soon. I never heard anything. I followed up and got no response. I thought this was very unprofessional.", "Interview Questions": "What is social marketing?"}, {"date": "10 Nov 2015", "title": "Program Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Population Services International (Washington, DC) in Oct 2015", "Interview Descriptions": "I submitted my application online and to an internal contact, which I've heard helps at PSI. Within 2 weeks, I was contacted for a phone interview by HR, which covered why I'm interested in PSI and how my recent experiences matches with the job duties. Less than a week later I was contacted for an in-person interview. The in-person interview was with 3 people--1 person had the job I was interviewing for, and the other 2 worked within the department. They were all extremely nice and professional. The first portion (about an hour) was discussing my past experiences, career goals, perceived fit for the role, and what it's like to work at PSI, and the second portion was an Excel test, a writing test, and a budget test. This part was sort of difficult, but interesting/fun to complete because they were not generic tests that companies tend to give.", "Interview Questions": "Describe your most difficult experience and the most rewarding."}, {"date": "15 Mar 2017", "title": "Human Resources Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 months. I interviewed at Population Services International in Oct 2015", "Interview Descriptions": "After filling out an extremely lengthy application, was interviewed by a recruiter who asked extremely mundane questions. Then was interviewed by multiple HR people all of whom gave positive feedback intimating that they were \"very\" positive, then radio silence for a month. I finally emailed them and received a terse reply that they decided my experience wasn't right or something but apologized because the senior HR people are so busy traveling because they are all working remotely! Seems like they do not know what it is they are looking for, so they do not know how to assess. Senior leaders are exclusively legacy employees who I would presume have been awarded these positions for staying with PSI for a long time. The result is that the whole organization is thus represented by an HR who aren't real HR people. I suspect other functions are likely same. In any case, similar to other's experience, an enormous time waster. If you really care about your mission, how about hiring HR professionals instead of transferring unqualified legacy staff.", "Interview Questions": "Q; What do you handle managing staff in multiple time zones?"}, {"date": "3 Dec 2015", "title": "Management Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Population Services International (Washington, DC) in Sept 2015", "Interview Descriptions": "Apparently they're going through a reorganization, which I should have paid more attention to. Bottom line, the have no clue what they're doing, where they're going or what they want. I probably interviewed with 10 people, all taking at least one hour, over the span of 3 months, only to be led on until finally they decided they didn't quite know what they wanted yet. Complete waste of my valuable time, very tacky and unprofessional. Whenever an HR department is in a fog, the company and brand will inevitably suffer. I'm not sure who or what the problem is, but they're clueless. \r\n\r\nI noticed many reviews are from interns, which is also telling.", "Interview Questions": "How would you handle difficult people? "}, {"date": "21 Aug 2015", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Population Services International (Washington, DC) in Aug 2015", "Interview Descriptions": "After submitting my application, I was contacted a few days later to set up a phone interview. The phone interview wasn't too long--about 20 minutes. She asked mostly about my experiences, my skills and how they contribute to the job. She had a warm personality which made it easier to talk to her. I had to complete a translation test after the phone interview. After the phone call, she told me she will notify if they decide on an in-person interview. \r\n\r\nThe following week, I was setting up an in-person interview. Two people interviewed me for about 30 minutes and then I was interviewed by one person for about 30 min. I must say it is a bright and welcoming place. Afterwards, I was emailed with a second translation test.", "Interview Questions": "What strengths you believe will help you complete your tasks?"}, {"date": "16 Jul 2015", "title": "Program Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Population Services International", "Interview Descriptions": "First, I had a phone interview with a woman from HR who was really lovely and made me feel very comortable. A week or so later I got an in person interview, I was interviewed by two people who had not worked at PSI for very long. It was okay, a little unorganized and unprofessional. I had to take an excell test and a writing test that day. Over it was fine, I definitely felt a little weird about how inexperienced my interviewer was but I guess for an entry level job that is what you get.", "Interview Questions": "They asked me what social marketing was which surprised me a little bit but probably was the only question that wasn't standard for an interview."}, {"date": "1 Jul 2015", "title": "Warehouse Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 2 weeks. I interviewed at Population Services International (Nairobi)", "Interview Descriptions": "Introductory- Entered  the  room  where  the interviewing  panel  was. I saluted  them  at  large, I  introduced  myself  and  they  welcomed  me  and  gave  a  sit. They  asked  me  where  I got  the  information  about  the  job.", "Interview Questions": "What  is  your  name?  , what  is   your  education qualifications?  Tell  us  about  yourself?"}], [{"date": "10 Aug 2015", "title": "Intern Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Population Services International (Washington, DC) in Jul 2015", "Interview Descriptions": "Invited to interview with two junior level persons for about 1 hour. Pretty streamlined process. Got decision the following week. Questions about the organization, previous experience, and a couple of \"describe a time when...\".", "Interview Questions": "Describe a stressful time and how you handled that."}, {"date": "9 Aug 2015", "title": "Senior Technical Advisor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Population Services International in Jun 2015", "Interview Descriptions": "The Sr. International Recruiter at PSI contacted me within a day of receiving my resume and organized an hour-long interview by Skype for the following day. Extremely well-informed and proactive, she then scheduled a series of interviews, keeping me appraised every step of the process in a way that was intuitive, professional and exceptionally helpful. Even though I didn't receive an offer on the job, she assisted me right down to the final two candidates and had the great courtesy to call me directly to inform of their decision. A very positive experience.", "Interview Questions": "Most questions were technically slanted, focusing on programming experience and specific global health initiatives in which PSI has a strong footprint."}, {"date": "13 Jul 2015", "title": "Communications Advisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Population Services International (Washington, DC) in Jun 2015", "Interview Descriptions": "There wasn't an initial phone interview, rather, I was given a four-hour test to dissect and summarize a 250 paged document into 4 pages. I was then called in for an in-person interview with the hiring manager. The interview was intense and afterward, I was told I would receive a phone call about next steps. I never received a call - of course, I assume it meant they were not interested in my candidacy. But considering the time and effort put into the process, some sort of e-mail \"thank you, but no thank you...\" would have sufficed.", "Interview Questions": "1) How would you come up with a communications plan?"}, {"date": "19 May 2015", "title": "Digital Marketing Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Population Services International (Washington, DC)", "Interview Descriptions": "The interview process was swift but I gained vast amounts of  information that I needed about the role and the organization. My interviewers were transparent about the position and realistic about the expectations of the role. I was able to make a well informed decision. They were incredibly amicable and knowledgeable in person and over the phone. If I had not prepared for the interview extensively, it would have been difficult, so preparation is key for anyone applying for an opportunity with this organization.", "Interview Questions": "Why do you wish to transition from your current role to this one?"}, {"date": "10 May 2015", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Population Services International (Washington, DC)", "Interview Descriptions": "Online application was simple and straight to the point. A few days later I received an email to schedule a phone interview for the following week. That interview lasted about 20-30 minutes, which then led to an in-person interview. I received the offer about a week later. \r\n\r\nThe phone interview seemed to focus on my past professional experiences. I was asked to describe my previous duties and learning curves. I was also asked to describe my response to hypothetical situations. The in-person interviews paid more attention to the duties of the internship and how I would apply my previous knowledge to the new role. I was also asked what new things I would be willing to learn during the internship opportunity.", "Interview Questions": "What assignments would you be most comfortable working on during this internship?"}, {"date": "23 Jan 2015", "title": "Program Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Population Services International", "Interview Descriptions": "One phone interview with HR; one phone interview with colleagues; one in-person interview with boss. All were pleasant and seemed like good people to work with. Pay was terrible and they warned me there was no flexibility.", "Interview Questions": "All standard, but threw in some foreign language to test ability"}, {"date": "9 Jan 2015", "title": "Associate Manager New Business Development Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Population Services International", "Interview Descriptions": "All the communications, interviews, and writing evaluations took place over a period of about 2.5 weeks. It started with a virtual writing evaluation where I was sent a document to edit. Then there were interviews with the staff I would be working with, followed by another, more comprehensive writing evaluation specific to their proposal process.\r\nEveryone was very friendly and open. The people I spoke with had been at PSI for a while and had only good things to say about the benefits and their career trajectory within the organization.", "Interview Questions": "The two writing tests were unexpected, but I thought it was a best practice that should be carried over to all similar positions."}, {"date": "30 Nov 2014", "title": "Associate Program Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Population Services International (Washington, DC)", "Interview Descriptions": "I was interviewed to fill in temporarily for an associate program manager, and the process was pretty straightforward and painless. I was first interviewed briefly over the phone by the HR for the specific department, and qualified for the in-person interview. The people interviewing me were very pleasant and friendly, and quite attentive to what I had to say. I was excited to be able to interview for PSI and would definitely seek to re-apply with them in the future.", "Interview Questions": "If you could be any kind of fruit, what would you be and why?"}, {"date": "22 Nov 2014", "title": "Technical Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Population Services International (Washington, DC)", "Interview Descriptions": "Did an HR screening first. Then a phone interview with my future supervisor. Then an in-person interview with two people on my future team and a writing test. (They asked me to write an executive summary of a project within 30 minutes.) They made the offer after that. I asked if they wanted to check my references and they said no, because I was referred by a coworker of theirs whom they trusted.", "Interview Questions": "What part of the job description excites you most? (Difficult only because I didn't have the job description with me, so I had to dig through my memory.) "}, {"date": "20 Aug 2014", "title": "Program Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Population Services International (Washington, DC)", "Interview Descriptions": "I kept track of job postings and turned in my application almost immediately. In two weeks, I got a call and had a phone interview with HR, which just went over the job, salary and benefits, and asked the regular questions like how well do you work in a team. She said over the phone that she would refer me for an in-person interview. Another person scheduled me for a two hour interview, and one day before my interview, they extended it to three hours. (In the end, it was a four-hour interview).\r\n\r\nThe in-person was with two groups of people (the two sides I would be working with), and a series of skills tests on Excel and writing. To start with, my interview with the second group (the finance people) was great---they were kind, asked good questions and responded well to my questions. They were focused on how well I could use Excel and why I wanted the job. However, the first group was a mix of good and bad. I saw one of my three interviewers text during my interview. They were nice overall, asking questions about how I worked with teams, what I felt about international development and the region I interviewed for. However, they didn't answer my questions (ie: the trouble in South Sudan was starting so I asked how they dealt with unexpected turmoil in their customer countries) well---felt like they were evading them.\r\n\r\nAfter my skills test, I was told I'd get an answer early the next week. I didn't hear back at all--not even a rejection. I ended up taking another job that next week so I didn't follow up, however.", "Interview Questions": "Define social marketing"}], [{"date": "18 Aug 2014", "title": "Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Population Services International", "Interview Descriptions": "My first interview was over the phone and I was asked all the questions I expected to be asked. The second interview was in person, and was asked much more technical questions. Overall, I felt great about the first interview and not so great about the second. Make sure to do a lot of technical research beforehand.", "Interview Questions": "I was asked about a writing sample that I had sent, a manuscript based on an evaluation I conducted, whether I would have designed it differently. Since the position was not an evaluation position, I was not expecting this question."}, {"date": "28 Jul 2014", "title": "Intern Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Population Services International", "Interview Descriptions": "One phone interview and one in-person interview before offer. Very quick process, as this team was looking to hire someone very fast. Very thorough and made me feel comfortable. I did not feel as if they were trying to intimidate me.", "Interview Questions": "What's you biggest weakness?"}, {"date": "28 Mar 2018", "title": "Systems Administrator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Population Services International (Washington, DC) in Mar 2014", "Interview Descriptions": "It is easy to start working at PSI. It really depends on the department and the need for an employee. People are nice and friendly. Questions are more based on how you can resolve problems, how can you handle professional communication with coworkers.", "Interview Questions": "What do you know about PSI? "}, {"date": "16 Sept 2015", "title": "Intern - Hourly Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Population Services International (Washington, DC) in Jan 2014", "Interview Descriptions": "Quick behavioral interview where they asked basic questions such as tell me about yourself, your interest in the company, your experience with health and health information systems, your work style, your education and how that has prepared you for this position...", "Interview Questions": "What is your work style?"}, {"date": "28 Sept 2013", "title": "Malaria and Child Survival Intern Interview", "results": "No Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Population Services International", "Interview Descriptions": "3 phone interviews stretched over a month or so. Predominantly behavioral questions with some inquiry into my resume. We did talk at length at some point about their sanitation programming.", "Interview Questions": "There wasn't anything surprising or especially difficult. I was asked to reflect on how I deal with difficult personalities in the office. "}, {"date": "2 Nov 2015", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Population Services International (Washington, DC) in May 2013", "Interview Descriptions": "Intern interviews are different for each department, but generally seem to be screened by HR and then interview conducted by department. PSI has an office environment with a lot of personality, so come confidently and prepared to geek out about international development and health. \r\nIf you like a very conservative office environment, you may be a little thrown off by the bowls of condoms all around the office or punny circumcision posters on the wall. Make sure you are prepared to explain your attention to detail", "Interview Questions": "Why are you passionate about sexual and reproductive health. "}, {"date": "14 Jan 2013", "title": "Recruiter Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at Population Services International (Washington, DC)", "Interview Descriptions": "PSI conducts a thorough and at times lengthy interview process with an average of 5-7 Interviews before offer is made.  Due to the nature of PSI's work, staff from multiple departments (technical, regional and functional) may be included as Interviewers.  Behavioral Interviewing techniques are most commonly used.  Testing for writing, excel, language skills or other technical expertise may be given.  Overall I felt it was a fair and effective process.  While the selection process can seem long from the candidate's point of view, it usually results in good hires for PSI.", "Interview Questions": "How is PSI different than other organizations? "}, {"date": "18 Feb 2013", "title": "Grants and COntacts Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. I interviewed at Population Services International (Nairobi) in Aug 2012", "Interview Descriptions": "Was invited for an oral interview by a staffing agency for PSI.The agency later called to inform me that I was shortlisted and my name forwarded to PSI.Was called by a PSI employee to schedule for a phone interview  with PSI HQ. I did a phone interview  with a PSI director and  she told me she will schedule for an oral interview.That is the last communication I had with PSI", "Interview Questions": "No difficult questions"}, {"date": "11 Jun 2012", "title": "Program Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Population Services International (Washington, DC) in May 2012", "Interview Descriptions": "I was contacted for a phone interview and one week later, offered an in person interview in DC.  I had to cover travel costs from Indiana, but decided it would be better to go to DC than to do the interview over Skype (this was offered).  Following the in person interview, I had a third interview by phone because they were having trouble making a decision.  I was asked to commit for at least 2 years to the position.  They ended up offering the job to the other finalist because she was an internal hire (already an intern there).  No tough questions- just telling about myself/my resume, why PSI, what my goals are, how I would manage work when asked to complete multiple tasks at once, etc.", "Interview Questions": "Give an example of a time that you had a disagreement with a co-worker and how you handled it."}, {"date": "28 Feb 2013", "title": "Program Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Population Services International (Belo Horizonte, Minas Gerais) in Feb 2010", "Interview Descriptions": "The interview process depends upon the hiring person. But in general takes 3 months within which the person is on board. Fortunately the hiring manager was good and quite comfortable.", "Interview Questions": "NA"}], [{"date": "21 Nov 2009", "title": "Procurement & Logistics Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Population Services International in Jul 2009", "Interview Descriptions": "This was a very frustrating experience.  After 4 Phone Interviews 1 full day Interview onsite.  References sumitted, called, all favorable results, background testing. This company called to ask if I was still intrested 4mos after the original contact & testing.  The position has been heavily advertised and marketed for 11mos. And still no follow-up or response even though all contact was professional ( wrote letters, called and was asked to still give feedback of my interest).  Either is was salary (which they mentioned I was at 30k over there highest rate) but no offer was forthcoming or they didn't want to pay relo - which I was willing to split and was more than willing to take a reduction in salary.  It would behoove them to make a decision- now the entire team they were trying to assemble is still open- 5 positions all for a great non-profit organizaton. They just need to MAKE a Decision and move forward with their business..", "Interview Questions": "What is your managment style?"}, {"date": "13 Dec 2011", "title": "Not Telling Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 4 days. I interviewed at Population Services International in Jul 2009", "Interview Descriptions": "no", "Interview Questions": "N/A"}, {"date": "24 Mar 2010", "title": "Organizational Development Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 2 days. I interviewed at Population Services International (Washington, DC) in May 2009", "Interview Descriptions": "I went to DC and through a contact that already worked there I was able to meet with the internship coordinator and learn more about the opportunities that should come available in the summer. It wasn't a formal interview but we did talk about my experience and interests. \r\nI next had two phone interviews. The first was basic behavioral interview style questions 'tell me a time when you failed to accomplish something and how you handled it.' \r\nI also learned a bit more about the department and scheduled a follow-up interview with the manager of the department the following week. When I spoke with her she mostly just wanted to get an idea of what types of things I wanted to work on within their department and when I would be available. Must more a formality and informational than the previous phone interview.", "Interview Questions": "Basic Behavioral Style: \r\n\"Describe a situation where you were stressed and how you managed it\""}, {"date": "15 Jun 2012", "title": "Program Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 5 weeks. I interviewed at Population Services International (Washington, DC) in Apr 2009", "Interview Descriptions": "Very long process with 7 interviews... it seems hard for the company to agree internally and get a consensus on candidates. HR are very tough during salary negociation so be strong !", "Interview Questions": "What is the definition of social marketing?"}]]