[[{"date": "1 Jul 2023", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Santa Clara Valley Medical Center", "Interview Descriptions": "Super chill and the interviewer is really kind and just wants to get to know you. They mainly just care if you're a good person and willing to learn how to be a good volunteer.", "Interview Questions": "Very basic questions that you could answer with not experience such as what do you like doing, do you have any medical qualifications or experience (not required), and why you want to volunteer."}, {"date": "19 Apr 2023", "title": "Clinical Nurse 1 Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at Santa Clara Valley Medical Center (San Jose, CA) in Mar 2023", "Interview Descriptions": "one on one - in person interview with unit manager (Med/Surg). Many clinical skills related questions were asked and questions that tests your knowledge. A lengthy interview that took 1.5 hour. On spot job offer", "Interview Questions": "What does scope of practice mean to you"}, {"date": "19 May 2022", "title": "Dietetic Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 3 weeks. I interviewed at Santa Clara Valley Medical Center (San Jose, CA) in May 2022", "Interview Descriptions": "Interview took 45 minutes over the computer. I think there was supposed to be three people on the call, but there was only one. Asked me a few medical nutritional therapy questions, questions pertaining to the job, and scenario questions.", "Interview Questions": "Q: What foods would you give a:\r\nRenal Patient\r\nCardiac Patient\r\nCarb Limiting Patient"}, {"date": "1 Feb 2022", "title": "Clinical Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Santa Clara Valley Medical Center", "Interview Descriptions": "taking one month long  to hear back, and email saying that ranking number, and them 3 months later get another in email for interview. then take another 12 weeks to get a offer.", "Interview Questions": "if you have a high risk fall patient, what would you do?"}, {"date": "16 Dec 2021", "title": "Health Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Santa Clara Valley Medical Center", "Interview Descriptions": "Was in a room with about 5 people and they each took a turn asking me a question on a sheet they had printed out. It took about 30-40 min for the entire interview process.", "Interview Questions": "Describe a time where you were dealing with a difficult patient and how did you solve it. "}, {"date": "20 Mar 2023", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 1 week. I interviewed at Santa Clara Valley Medical Center in Jul 2021", "Interview Descriptions": "panel with 5 interviewers (ANMs) 10-15 behavior questions and one scenario question. about 30 mins long Will go around and ask questions. may do another round of interviews depending on the situation with the head manager. Will hear back within 3 days to a week.", "Interview Questions": "tell me about yourself, your strengths and weaknesses, and one mistake you made, why nursing, where do you see yourself in 5 years"}, {"date": "25 Apr 2022", "title": "Licensed Vocational Nurse Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Santa Clara Valley Medical Center (San Jose, CA) in Mar 2021", "Interview Descriptions": "The interview process is bery straightforward. I was interviewed by phone with 10-12 questions. It actually depends on which department you are being interviewed from. I have 4-5 situational questions. Honestly the questions are very straightforward.", "Interview Questions": "What is valley medical center's mission"}, {"date": "21 Jan 2020", "title": "Medical Unit Clerk Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Santa Clara Valley Medical Center", "Interview Descriptions": "The interview process was smooth. With this position, you had to take a competency test before your name is sent to each individual unit that you are eligible for. Each unit will then reach out to you to set up an interview process; this could be done through phone or email.", "Interview Questions": "Describe a time that you used team work at your current job and how can this help you with this position."}, {"date": "2 Nov 2019", "title": "Clinical Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Santa Clara Valley Medical Center", "Interview Descriptions": "It took a while to hear back from when application was submitted to get an email with ranking # from HR to be  qualified for an interview. First, you applied online then wait several weeks up to 2 months to get an email from the HR which telling you whether you are qualified or not. If you are, in the email body there is a ranking number which will give you some ideas how close you are to be chosen for a chance of an interview. They will send you another email a few weeks later if they want you to come in for an interview. A lengthy process, some can't afford to wait that long.", "Interview Questions": "Where do you see yourself in 5 years? Tell me about yourself? Why do you want to work here? "}, {"date": "20 Sept 2019", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Santa Clara Valley Medical Center", "Interview Descriptions": "Applied online, after 4-5 months, heard back from the nurse manager for a job interview. Panel of 4 nurses, typically assistant nurse managers and some staff from the floor. Interview lasted 20-30 mins. They’ll let you know within 1-2 weeks if you’re hired. The process takes a while since it’s county.", "Interview Questions": "Situational questions"}], [{"date": "28 Aug 2019", "title": "LVN Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Santa Clara Valley Medical Center in Aug 2019", "Interview Descriptions": "Applicant Beware- Bait and Switch Tactics Utilized\r\n\r\nThe first phase of the recruitment process included a timed, written exam (a complete and utter waste of my valuable time) before you can qualify for an interview. The results become available after about 1 month.  Keep in mind that this hospital is actively recruiting for extra help positions. Next, depending on how you scored on the exam, you are ranked in order to have your information submitted to various openings throughout the hospital system. Some required a telephone screening prior to an in-person interview. I attended various interviewa for a full-time LVN position here. One in particular stood out. For one opening, I specifically asked the recruiter if it was an extra help or coded position. The rep confirmed prior to interview that it was a full-time, coded position. Upon beginning the interview, one of the hiring managers begins to explain that there is a need for an on-call \"extra-help\" employee. I immediately paused to confirm if this was the correct position or not. \r\n\r\nThe point of this is that to proceed with caution with VMC, as the recruiting staff will make you jump through various hoops in order to qualify for an interview, only to be conned into interviewing for a temporary, extra-help position. If you decide to interview for this company, please be advised to ask for full disclosure of the job position prior to attending, in order to set expectations realistically. Objective appears to utilize LVNS to do the heavy lifting of nursing tasks, while allowing the RNs to sit back and relax from behind the scenes. \r\n\r\nThis company is not one I would seriously pursue once my RN in completed, as there are more valuable hospital structures in the immediate area that know how to identify a qualified employee and compensate him/her accordingly. I did not get the job (to my benefit, because who really wants to work on-call/as needed, I would have turned them down anyway), but was offered a tremendous position with one of the best hospitals in California, which i gladly accepted.", "Interview Questions": "Explain your experience in (blank) speciality."}, {"date": "28 Jun 2019", "title": "Hospital Services Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Santa Clara Valley Medical Center (San Jose, CA)", "Interview Descriptions": "Must pass standardized test. You are ranked on how well you do on the test. They will start to hire from the top of the list. Once called for an interview I only sat with the nurse manager.", "Interview Questions": "They asked questions like\r\nWhich blood pressure is critical?\r\nWhat are universal precautions?"}, {"date": "25 Mar 2019", "title": "Manager Level Role Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at Santa Clara Valley Medical Center (San Jose, CA) in Mar 2019", "Interview Descriptions": "I usually don't write reviews like this but it's been a few days and my recent interview experience didn't sit well with me and wanted to let future applicants, specifically other veterans, be aware of how they answer questions. \r\n\r\nI've applied for the same role twice. The first time, I made it past the phone interview and went on to the in person panel interview. Although I didn't get the job, the interview experience was pleasant and when I got the rejection letter for not getting the position, I made sure to send a thank you letter to the Director, thanking them for the time and consideration. \r\n\r\nThe second and most recent time was a little different. I had a phone interview and it was pretty standard questions and I felt confident in my answers and explanation of my background. However the interviewer, although pleasant, mentioned two things that took me back and I wasn't sure how to respond. First, she made it clear to me, in my opinion, that they were specifically looking for a woman to hold one or all of the open positions(the interview was for 3 open positions). I'm not opposed to that at all but if that's the case, why would I be interviewed other than to just go through the motions? It felt like I was just a number on a list that they had to contact in order to get who they really wanted. I understand this is a common practice in recruiting I just didn't know how to respond. \r\n\r\nThe second thing that bothered me was the questions about my military experience. I typically try to down play my military experience on my resume and elsewhere because I understand that a lot of employers either don't understand the job or don't want veterans in the organization, especially here in the Bay area. However, I can't completely take it off my resume because no matter how much I try to down play it, it still takes up a  significant portion of my work history.\r\n\r\nDuring the interview, I don't remember the exact wording of the question but the interviewer asked something similar to \"The military experience is good but how does that help us?\" I can't remember exactly what else was asked but I remember fumbling around  my answers after that because I felt like I was being told that my military service wasn't good enough. Prior to this, I thought I had done a good job explaining the value I could bring and how my experience related to the position but I'm not sure if it was enough.\r\n\r\nAfter the phone interview, I felt pretty confident that I wouldn't be called back to move forward. I don't fault the interviewer necessarily but want any other veteran that applies to a similar position to be very careful about how they word and explain their service. In my humble experience, a lot of employers, including the county, aren't very military friendly and a lot of times we have to go above and beyond to prove our worth.  \r\n\r\nFrom my understanding, SCVMC is a good organization to work for but like others, it's difficult to get past the screening process with a military background.", "Interview Questions": "How does your military service help us?"}, {"date": "11 Oct 2018", "title": "Clinical Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Santa Clara Valley Medical Center (San Jose, CA) in Sept 2018", "Interview Descriptions": "Applied the job from county website and it took about 2 weeks to receive a response email to notify your qualifications ranking for this position.  Then you will receive another email in couple days asking you to contact the hiring manager with in a certain time to set up an interview. There was no recuitor call. Only email notification when I applied.  After interviewed, took the county about 2 weeks to contact you and offered position.", "Interview Questions": "What are  qualifications do you think you have for this job? "}, {"date": "16 Oct 2018", "title": "Clinical Research Assistant II Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Santa Clara Valley Medical Center (San Jose, CA) in Sept 2018", "Interview Descriptions": "Government agency interview process are standardized and very rigid. I applied through the hospital's career site, received an email two weeks after the application deadline notifying me that i have been selected for a interview. I was able to skip the phone interview process because there were very few candidates. In person interview was conducted by the program director, a future colleague and a doctor in charge of the program. Questions were the same for every candidates. Half of it were behavioral, half of it were technical. Overall took 30 minutes.", "Interview Questions": "Why SCVMC?\r\nName 3 strong skills. "}, {"date": "18 Apr 2019", "title": "Clinical I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Santa Clara Valley Medical Center (Santa Clara, CA) in Jan 2018", "Interview Descriptions": "Easy straight forward. It was a one to one interview with the unit nurse manager for a medical surgical unit. I was asked of common drugs and how to administer them. She asked what equipment I was familiar with and how to use it.", "Interview Questions": "Asked about diabetic medications\r\nPPE\r\nEpic\r\n"}, {"date": "24 Aug 2016", "title": "Radiology Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Santa Clara Valley Medical Center", "Interview Descriptions": "First your application gets ranked according to your experience.  Then if you are top 5 or so,  they will call you in for the initial interview.  If you are picked for a second interview,  then that will come shortly after.", "Interview Questions": "Please describe a difficult situation at work"}, {"date": "12 Jan 2018", "title": "Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Santa Clara Valley Medical Center in Feb 2016", "Interview Descriptions": "spent half day talking to team, spoke with manager, spoke with union, nice team, very busy workplace, nice new building, seems like a great place to help the local community. Ultimately ended up not accepting the role but the union seems great.", "Interview Questions": "N/A"}, {"date": "10 May 2017", "title": "LVN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Santa Clara Valley Medical Center (San Jose, CA) in Dec 2015", "Interview Descriptions": "Applied online took about 6 weeks to get an invitation to take LVN exam , which ranked you based on score. Once ranked your name was sent to hiring managers which emailed or called for interviews.", "Interview Questions": "Questions varied from outpatient scenarios to urgent scenario, prioritizing patients, some skills questions the usual blood draw, IV, foley and wound care. Some conflict resolution  questions with patients and staff. Also experience in the field. Availability and punctuality also"}, {"date": "18 Oct 2017", "title": "Volunteer Desk Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Santa Clara Valley Medical Center (San Jose, CA) in Jun 2014", "Interview Descriptions": "The interview wasn’t super long. Mostly questions of why I am interested to work as a volunteer and what it means for me to work for the hospital. The process was very informal, as the supervisor were really nice and not intimidating.", "Interview Questions": "Why do you want to work as a volunteer here at the Santa Clara valley medical center. "}], [{"date": "7 Jun 2015", "title": "LVN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Santa Clara Valley Medical Center in Jun 2013", "Interview Descriptions": "simple interviewing process. Applied for extra help during EMR launch, and interview was about 15 minutes long. Interiew was a structured layout, with basic questions about previous experience, and availability.I was hired on the spot.", "Interview Questions": "what is your availability?\r\nprevious experience?"}]]