[[{"date": "7 Mar 2023", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Gonzaga University in Jan 2023", "Interview Descriptions": "Not very challenges, they just asking some basic questions like introduction, then case solving and other related question. Friendly interview and most of them are open for questions and answers", "Interview Questions": "What can you contributed to the community?"}, {"date": "15 Oct 2022", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Gonzaga University in Sept 2022", "Interview Descriptions": "I had a 20 minute interview via Zoom with three or four staff. I felt comfortable talking with them and good about my responses to their questions. Glassdoor requires I enter at least 30 words in this space so I am typing more to fulfill that requirement.", "Interview Questions": "- Tell us about yourself and why you want this position - Talk about Gonzaga's mission statement and how it relates to you - Talk about a difficult professional experience and how you handled it - What are your strengths and what is something you need to work on"}, {"date": "12 May 2022", "title": "Specialist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Gonzaga University", "Interview Descriptions": "It was a typical job interview. First had a phone interview with committee and in person on campus. Day on campus with various department staff including a tour of campus and city.", "Interview Questions": "Why are you a good fit"}, {"date": "6 Dec 2022", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Gonzaga University (Spokane, WA) in May 2022", "Interview Descriptions": "Great looking to find someone who fits the community, and is able to tackle multiple projects at a time. While also having great personal skills that will help them work with students and families to create a better experience", "Interview Questions": "How do you respond when you fail?"}, {"date": "23 Sept 2021", "title": "Front Desk Receptionist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Gonzaga University", "Interview Descriptions": "The interview process was pretty simple. It was just one-panel interview with the manager and 2 other student employees. I got a call back a couple of days later with the job.", "Interview Questions": "What will you be doing in this position?"}, {"date": "6 Jul 2021", "title": "Nursing Instructor Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Gonzaga University", "Interview Descriptions": "It was long and included 6 people but they were very nice. Standard questions and they expect you to have some questions as well. read about Gonzaga and the position you are applying for as they expect you to know about it", "Interview Questions": "why should we hire you"}, {"date": "28 Jun 2021", "title": "PR and Social Media Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Gonzaga University", "Interview Descriptions": "Interview process done over Zoom. Great experience. The interviewers  asked a lot of great questions that were formulated in a professional and kind manner. I only have nice things to say about the onboarding team.", "Interview Questions": "\"What are your greatest strengths?\""}, {"date": "2 Apr 2021", "title": "Lecturer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Gonzaga University", "Interview Descriptions": "Interviewed over the phone.  Discussed job requirements and asked about my experience.  Overall, the interview was very straightforward and easy.  Nothing too surprising or out of the ordinary.  Ended up getting an offer and accepting the offer.", "Interview Questions": "Describe your teaching philosophy and examples of how you put that teaching philosophy into action."}, {"date": "20 Feb 2021", "title": "Mechanic Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Gonzaga University", "Interview Descriptions": "People was really attentive and helpful with the process. HR people was really nice I had to do some test then some others interviews with some managers for the specific ride", "Interview Questions": "Why you will like to work on Universal ? "}, {"date": "18 Mar 2021", "title": "Life Skills Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. I interviewed at Gonzaga University in Feb 2021", "Interview Descriptions": "Applied by emailing the head of the search committee. They were very communicative on how the process would go. Started out with a 30 minute phone interview with the head of the search committee and the person currently in the position.", "Interview Questions": "What makes you uniquely qualified for this position?"}], [{"date": "8 Oct 2019", "title": "Admissions Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Gonzaga University (Spokane, WA)", "Interview Descriptions": "It varies by department, but normally there will be a phone interview, group interview, and final interview with director. Getting jobs at Gonzaga is based on a skill fit but even more so a culture fit. They want to be sure that you truly understand what Gonzaga is about.", "Interview Questions": "How does the Gonzaga missions relate to you and the work you want to be doing?"}, {"date": "9 Jun 2019", "title": "Librarian Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Gonzaga University", "Interview Descriptions": "I applied online and was contacted shortly thereafter to set up an online/video face to face interview.  I was told upon the start of the interview that it would be a 20 minute interview. One of the interview team members came late to the interview.  Questions were very generic, almost rote.  It appeared that this was a \"filler\" interview, not a serious one.  After the interview, I never heard from anyone (Library or HR) again, no courtesy \"Thank you, but No thank you.\"  The way you are treated in an interview situation is a strong indicator of the culture of an institution and how you will be treated if you take the position.", "Interview Questions": "Explain how you are qualified for this position."}, {"date": "20 Feb 2019", "title": "Operations Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Gonzaga University", "Interview Descriptions": "Had a total of three interviews, each lasting at least thirty minutes. Two were in person, while the other was on the phone. Classic interview questions were asked. Helpful and welcoming staff.", "Interview Questions": "Why did you apply for this job?"}, {"date": "15 Mar 2018", "title": "Program Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Gonzaga University (New York, NY) in Jan 2018", "Interview Descriptions": "Interview panel was very friendly. They answered all my questions thoughtfully. Everyone seems to care about Gonzaga's mission, which is very important. They also asked general questions about qualifications. They described the position.", "Interview Questions": "How do you fit into the mission?"}, {"date": "9 Jul 2017", "title": "GUEST Building Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Gonzaga University (Spokane, WA) in May 2017", "Interview Descriptions": "The interview process was a two step process. The first was a group interview with 6 other people including the Assistant Director of Operations, Operations Manager, HR Talent Scout, Events Manager, and a current Building Coordinator. The second interview was just with the Assistant Director of Operations and the Director of the department.", "Interview Questions": "If you had $1,000,000 right now, what would you use it for?"}, {"date": "13 Dec 2016", "title": "Advancement Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Gonzaga University (New York, NY)", "Interview Descriptions": "There were two rounds of interviews with fairly generic questions. Focused on how the role of the position fit within the mission of Gonzaga University. Not a difficult interview process, but lengthy.", "Interview Questions": "How does the role fit within the mission?"}, {"date": "3 Jun 2019", "title": "Admissions Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at Gonzaga University (Spokane, WA) in Aug 2015", "Interview Descriptions": "2 in-person interviews - 1 small group (hiring committee) with questions about experiences focused toward my alignment with the mission. The other with a presentation focused on presentation skills. Presentation topic was a topic of my choosing.", "Interview Questions": "How would you interact with students from different geographic locations?"}, {"date": "4 Jun 2015", "title": "Crosby Info Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 3 days. I interviewed at Gonzaga University", "Interview Descriptions": "You will have to answer questions regarding customer service. Be ready for questions. The managers are friendly and it will be like a normal conversation. Don't panic you'll be fine.", "Interview Questions": "They asked me why they think Crosby needs me"}, {"date": "11 Sept 2015", "title": "Work Study Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Gonzaga University (Spokane, WA) in Jun 2015", "Interview Descriptions": "Presented resume and talked about why I wanted the job.Interviewer was very nice and friendly. The overall feel was very welcoming. They made it seem like you were wanted there right off the bat,", "Interview Questions": "N/A"}, {"date": "26 May 2015", "title": "IT Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Gonzaga University (Spokane, WA)", "Interview Descriptions": "Apply online.  Manage resume and other information online on Gonzaga's website.  HR schedules interviews usually week after posting closes or you receive call/letter in mail if you did not get one.  IT interviews are usually in IT conference room in lower level of Foley Library.  IT always interviews by committee.  Standard questions around the table about conflict resolution, problem solving etc.  Learn Gonzaga Mission Statement on website.", "Interview Questions": "What does Gonzaga's Mission Statement mean to you?"}], [{"date": "22 Sept 2014", "title": "Program Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Gonzaga University in Jun 2012", "Interview Descriptions": "The interview included a panel of people (many of whom I never saw again). The questions were pretty standard but the question on the mission statement was the most important (as expressed to me after the interview)", "Interview Questions": "Be sure to know the mission statement and how you fit into that. They may also ask you about your comfort level with diversity"}, {"date": "27 Jun 2010", "title": "Custodian Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 1 week. I interviewed at Gonzaga University (Spokane, WA) in Jun 2010", "Interview Descriptions": "Did not appear to be a good fit for their  team...", "Interview Questions": "would you apply for a promotion with in the company ?"}, {"date": "27 Mar 2012", "title": "Administrative Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Gonzaga University (Spokane, WA) in Jan 2010", "Interview Descriptions": "First set of questions were personality based, such as strengths, weaknesses. They gave a lot of situation based questions like: if a student were to ask for a confidential document, and he needed it to graduate or to sign up for a class, but your superior isn't there to authorize it, what would you do? Step by step.", "Interview Questions": "Why Admin assistant?"}]]