[[{"date": "10 May 2023", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at DESC", "Interview Descriptions": "smooth process it wasnt a formal interview however i got to know more about the company. the interviewer was respectful and optimistic l l l l l l l s", "Interview Questions": "Why did you choose desc"}, {"date": "8 Sept 2021", "title": "Coordinator Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at DESC", "Interview Descriptions": "Pre-printed questions handed to you upon entry, easy going interviewers, give you feedback if you want it. overall good experience. the head of HR is also very helpful in finding other jobs within the company", "Interview Questions": "Definition of various terms and programs "}, {"date": "18 Feb 2021", "title": "Residential Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at DESC (Seattle, WA) in Dec 2020", "Interview Descriptions": "Short but sweet--staff followed up in a timely manner and the overall process only took about 3 weeks start to finish. Questions were reasonable and relevant to the position. Overall nothing but good things to say.", "Interview Questions": "Why do you want to work for DESC?"}, {"date": "12 Jul 2020", "title": "Behavioral Health Case Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at DESC", "Interview Descriptions": "Applied in March 2020. For an invite to interview less than 12 hours later (they also asked if I had any questions prior to setting up an interview). Interviewed via phone a few days later, starting out with an intro of the org, then with 2 people alternating asking questions, and at the end let me ask questions. They check references. Didn’t hear back for about 4 months", "Interview Questions": "Describe a form of privilege you have and how do you acknowledge/reconcile it in your everyday life?"}, {"date": "7 Oct 2021", "title": "Outreach Case Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at DESC (Seattle, WA) in May 2020", "Interview Descriptions": "Answered questions about my experience, my knowledge of what they’re work is and mission. They as well asked about my comfort level to working with the homeless population and doing community outreach. \r\nNever heard back after that interview even after they let me know they would. Got ghosted.", "Interview Questions": "Comfortability with working  with the homeless population and doing community outreach / going into people’s home."}, {"date": "8 May 2020", "title": "Case Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at DESC in May 2020", "Interview Descriptions": "During COVID. Applied online on Indeed, , and after roughly 2 weeks, got a call to schedule a video chat interview.  Talked briefly over the phone, and within 10 minutes, had a skype interview date. Had the manager and 1 other person.", "Interview Questions": "Describe the signs/symptoms/treatments for: -Major depression/schizophrenia/Substance use disorder"}, {"date": "15 Aug 2018", "title": "Case Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at DESC (Seattle, WA) in Aug 2018", "Interview Descriptions": "DESC invites you to apply today to attend our hiring fair! Qualified candidates will be screened over the phone, and if selected will be given the time and location of the hiring fair.  Once at the fair, candidates will have the opportunity to tour one of our clinical locations, learn about what makes DESC unique, and participate in a Q&A with staff members during the interview process.", "Interview Questions": "Harm Reduction"}, {"date": "13 Aug 2017", "title": "Clinical Support Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at DESC (Seattle, WA) in Jul 2017", "Interview Descriptions": "Walked in and they put me in a conference room and allowed me to look at the interview questions for about 15 mins. Then two people came in and interviewed me together. They took turns answering questions.", "Interview Questions": "If a client begins questioning your legitimacy and what you could possibly know about addiction and mental health, what do you do/say?"}, {"date": "9 Jul 2018", "title": "Residential Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at DESC (Seattle, WA) in May 2016", "Interview Descriptions": "Met with the project manager and direct supervisor. We discussed my ability to set client boundaries, my understanding and thoughts on harm reduction, my goals, and my personal experience and past. I was honest about having once struggled with addiction and homelessness and was treated as a whole and worthy individual regardless. I felt comfortable and felt like their interview questions really sought a good fit for their building.", "Interview Questions": "If a resident you can relate to would like to know more about you personally, how do you redirect the conversation back to the client in order to maintain strong boundaries?"}, {"date": "29 Mar 2017", "title": "BHCM Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at DESC (Seattle, WA) in Jun 2015", "Interview Descriptions": "It was very straightforward. The hirer was nice and explained each question carefully. He was not going to set you up for failure. He wanted to see you be successful.", "Interview Questions": "What made you apply"}], [{"date": "8 Oct 2016", "title": "Residential Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at DESC (Seattle, WA) in May 2015", "Interview Descriptions": "Mostly questions about the job itself and whether I knew anything about it.  Pretty straightforward.  It does take place in their downtown location, so be prepared to deal with 3rd st.   There's no drug test, or anything like that, mostly just questions about your knowledge of who they are and what they do.", "Interview Questions": "What can you tell us about harm reduction?"}, {"date": "17 Mar 2016", "title": "Clinical Support Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 1 week. I interviewed at DESC (Seattle, WA) in Feb 2015", "Interview Descriptions": "Sat down with the project manager and her supervisor. They both talked about what their roles are in the agency and what the mission of the agency is in Seattle. Both individuals tag teamed asking questions while the other one wrote down my answers. Discussed long term goals within the agency and beyond and what an idea work environment would look like.", "Interview Questions": "Why do you think documentation is important when working with clients?"}, {"date": "20 Jul 2016", "title": "Mental Health Case Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at DESC (Seattle, WA) in Jan 2014", "Interview Descriptions": "I interviewed with one person and had an opportunity to briefly review the interview questions before the interview.  I was an internal candidate, if I hadn't been I probably would have been interviewed by multiple people.  Other people new to the agency were interviewed by a few people at once, but only had one interview I think. The company highly values promoting/ hiring within the agency.", "Interview Questions": "What is my experience in mental health?"}, {"date": "3 May 2017", "title": "CDP Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at DESC (Seattle, WA) in Aug 2013", "Interview Descriptions": "Meet up, talk, jet up out! it can get touchy feely that's for sure. Boundaries start getting crossed this early! Push the salary. Its the only chance you will ever get to squeeze out a goddamn dime.", "Interview Questions": "What are the clinical signs of depression. List 3"}, {"date": "23 Jan 2017", "title": "Residential Counselor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at DESC (Seattle, WA) in Apr 2013", "Interview Descriptions": "Mass hiring, with a dozen people in one room. HR comes in and has you sign a punch of paperwork. No real discussion. Confusing. I wasn't sure if i was being offered a position  or going through a vetting process.", "Interview Questions": "What do you think is a main cause of homelessness?"}, {"date": "6 Mar 2017", "title": "Case Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at DESC in Mar 2013", "Interview Descriptions": "I was interviewed by a panel of current employees who asked me a broad range of questions--some difficult some basic run-of-the-mill questions. Before the interview I sat waiting in the lobby at the homeless shelter.", "Interview Questions": "What would you say is the best treatment for schizophrenia?"}]]