[[{"date": "15 Mar 2021", "title": "Direct Support Professional Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Becket Family Services (Lakeville, MA) in Feb 2021", "Interview Descriptions": "Went very well. They asked questions regarding my history with the elderly and disabled individuals. They were curious about my certifications, and my ability to take care of these men in the program, as they needed constant attention.", "Interview Questions": "Why would you be a good fit for becket? "}, {"date": "14 Aug 2019", "title": "Permanecy Coach/Case Manager/Mentor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Becket Family Services", "Interview Descriptions": "It was an hour filled with thoughtful fair questions. I was interviewed by a HR personnel and a supervisor. Everyone was nice and very friendly.  After the interview I was asked if I wanted to shadow a current worker to get a feel of the job.", "Interview Questions": "What do I know about the company."}, {"date": "8 Feb 2017", "title": "Youth Counselor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Becket Family Services (Pike, NH)", "Interview Descriptions": "Applied on Indeed. Took a few days to be contacted. The interview process was rather easy, no difficult questions were asked. I met some of their students that day, and met multiple staff members. They didn't ask much about my experience working with children. The co-workers seem pretty laid back and not too professional.", "Interview Questions": "What do you do in your free time and how can you include our boys into that?"}, {"date": "24 Apr 2017", "title": "Residential Youth Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Becket Family Services (Plymouth, NH) in Jan 2017", "Interview Descriptions": "It was rather laid-back, and the hiring manager made it very clear what the setting would be like if I worked with them, as the population is comprised of at-risk and adjudicated youth. He made sure I knew what their behavioral problems were and what a typical day would be life to see if I'd still be interested.", "Interview Questions": "What type of things do you enjoy doing in your off time? "}, {"date": "19 Nov 2016", "title": "Residential Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Becket Family Services", "Interview Descriptions": "Very easy, always looking for people to employ. They ask basic question about yourself, and what you would do in certain situation. I went in and answered the questions that they asked. It lasted about half hour. At the end they will have you sign some paper so that they can run a background check.", "Interview Questions": "How would you handle a stressful situation."}, {"date": "11 Jul 2016", "title": "Program Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 3 days. I interviewed at Becket Family Services (Fitchburg, MA) in Apr 2016", "Interview Descriptions": "I had one informal interview. The hiring manager and director were there. The director was on and off their phone, people kept coming into the room, the questions were limited and most of the interview we just chatted (I didn't know them either). During the interview I wasaid told of companies future plabs", "Interview Questions": "How would you handle an employee that is not working as a team player"}, {"date": "17 Aug 2015", "title": "Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Becket Family Services (Concord, NH)", "Interview Descriptions": "The interview was fairly easy, didn't feel like they put any pressure on me during the process. Ask you what you would do in a situation type questions. Feel like this is a community based program with a good foundation. Don't feel like they're after the most qualified personnel either.", "Interview Questions": "Situational questions and at the end they ask if you can handle it."}, {"date": "25 Oct 2016", "title": "Permanency Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Becket Family Services (Campton, NH) in Jan 2015", "Interview Descriptions": "Received call to set up interview shortly after applying. Interviewed in relaxed setting by three employees. Asked some questions, had discussion then I was able to ask questions. This was followed by the negotiation phase. Very positive experience, hired at end of interview. They provided a flexible start date, as I was transitioning from another role.", "Interview Questions": "How has your prior work experience prepared you for this role?"}, {"date": "24 Jun 2017", "title": "DSP Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Becket Family Services (Plymouth, NH) in Jul 2013", "Interview Descriptions": "Was incredibly brief and over the phone. When given a chance to meet staff for the first time they bragged about how long they have been working there. This is not something to brag about.", "Interview Questions": "Have you ever worked with disabled individuals?"}, {"date": "28 Aug 2013", "title": "Youth Counselor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Becket Family Services (Plymouth, NH) in Sept 2012", "Interview Descriptions": "A brief 1 on 1 interview with Program Director. Took about 15 minutes, the questions were not very rigorous.", "Interview Questions": "Most questions pertained to \"what would you do\" situations. They discuss an average day and ask you if you think its something you can handle."}]]