[[{"date": "1 Mar 2023", "title": "Pharmacy Technician Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Beth Israel Deaconess Medical Center", "Interview Descriptions": "Applied online first and then we did phone call/zoom interview. The interview was very straight forward with introductions and brief get to know you questions. They email and update you fairly rapidly as well.", "Interview Questions": "Tell me about yourself Why did you apply to BIDMC"}, {"date": "10 Oct 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Beth Israel Deaconess Medical Center", "Interview Descriptions": "Pre screen call from HR rep. Interview with management and staff, including tour of work environment. Followed by a shadow day. It was average experience. Everyone was very warm and welcoming", "Interview Questions": "Goals in 5 years. Experience as gow it relates to the job."}, {"date": "30 Sept 2022", "title": "New Grad RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Beth Israel Deaconess Medical Center", "Interview Descriptions": "The interview process is smooth and professional. One of the highlight during the process is that they require you to shadow a RN for a few hours on the floor before offering the position. ", "Interview Questions": "Why do you want to work in cardiology department?"}, {"date": "5 Sept 2022", "title": "Unit Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Beth Israel Deaconess Medical Center (Boston, MA) in Aug 2022", "Interview Descriptions": "There was a phone interview first for about 15 minutes and then following that there was a 30 minute video call. The entire process was very quick and went very smooth.", "Interview Questions": "Why do you think you would be a good fit?"}, {"date": "8 Jun 2022", "title": "Admin Assistant Tier 2 Floater  Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Beth Israel Deaconess Medical Center (Boston, MA) in Jun 2022", "Interview Descriptions": "Was a great process, easy yet thorough. The HR agent assigned to me gave me a lot of great insight into the job and matched my profile well with the job. In the job the interview allowed me to explain my past experience and even though it did not directly relate they let me explain the relation. ", "Interview Questions": "How will your prior experience help in this job? "}, {"date": "26 May 2022", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Beth Israel Deaconess Medical Center", "Interview Descriptions": "The process was very simple and easy, but there is a disconnect between HR and the labs themselves. Took a while to get an actual offer, but it was worth it.", "Interview Questions": "What is your plan the next few years? "}, {"date": "24 Mar 2022", "title": "Data Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Beth Israel Deaconess Medical Center", "Interview Descriptions": "First round was a phone interview with the recruiter. Second round was a video call with four interviewer. After that, I had to work on a  dataset challenge within certain time.", "Interview Questions": "Why are you interested in this position?"}, {"date": "12 Apr 2022", "title": "Lab Supervisor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Beth Israel Deaconess Medical Center in Mar 2022", "Interview Descriptions": "Interview process was ok with the hiring manager and new director. Received an offer with my desired salary. Then HR made a mistake and now offered a salary 15K less than the initial offer. I accepted the lower offer to learn new skills. Next day HR informed me that this position was no longer available. I would expect much higher from this institution. I have now steered many colleagues away from applying here. This HR \"recruiter\" should find a new career.", "Interview Questions": "What interests you in working in this department?"}, {"date": "19 Feb 2022", "title": "Medical Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at Beth Israel Deaconess Medical Center in Jan 2022", "Interview Descriptions": "Interview was casual and interviewer was very nice. It mainly consisted of general information about what the job would entail and general questions to me regarding my experiences and skillset.", "Interview Questions": "Q: Why do you want this job?"}, {"date": "6 Oct 2021", "title": "Legal Practice Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Beth Israel Deaconess Medical Center", "Interview Descriptions": "The interview was well organized, and no tricky questions. We went over my previous experience and skills. Also spoke about my education and career goals. Great staff and hiring process.", "Interview Questions": "Why would you like to work here?"}], [{"date": "18 Mar 2022", "title": "Line Cook Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Beth Israel Deaconess Medical Center (Boston, MA) in Oct 2021", "Interview Descriptions": "It was fantastic, super supportive but there is a medical exam so just a heads up for that. It was a very long process so not for the faint of heart", "Interview Questions": "How do you deal with stress?"}, {"date": "12 Sept 2021", "title": "Medical Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Beth Israel Deaconess Medical Center", "Interview Descriptions": "The whole interview process is simple and everyone I interacted with was very friendly.  The experience you have in other labs is an important topic to discuss, as well as how you would work as a team member.", "Interview Questions": "What analyzers have you worked with in the past?"}, {"date": "9 Sept 2021", "title": "Patient Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Beth Israel Deaconess Medical Center", "Interview Descriptions": "Wonderful interview process. Very helpful staff and hope to get hired and work within patient care for BI. The managers seem very flexible and understanding and they offer different salaries for depending on your shift.", "Interview Questions": "What can you add to our culture and environment"}, {"date": "17 Aug 2021", "title": "Clinical RA Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Beth Israel Deaconess Medical Center", "Interview Descriptions": "I interviewed for the Clinical RA position at BIDMC Department of Anesthesia. First, the interviewer was late and they finally joined the zoom room, they said they were in a rush and only had 5 minutes to conduct the interview.", "Interview Questions": "Do you have any note-taking experience?"}, {"date": "27 Jul 2021", "title": "Patient Care Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Beth Israel Deaconess Medical Center", "Interview Descriptions": "Had my first interview with HR, which was a very nice casual conversation focused on why I  wanted the position. Also discussed the overall logistics of the position. Heard back ASAP to schedule an interview with the nurse manager.", "Interview Questions": "What was a time you went above and beyond for someone? "}, {"date": "4 Jul 2021", "title": "Patient Care Technician Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Beth Israel Deaconess Medical Center (Boston, MA)", "Interview Descriptions": "There was a short phone call with HR for an initial phone interview. Then I had a video interview with the nurse manager one on one.  I received an email from HR a few days later about getting accepted", "Interview Questions": "How did you handle a situation with a difficult patient "}, {"date": "16 Jun 2021", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Beth Israel Deaconess Medical Center", "Interview Descriptions": "The interview was on zoom , so a little awkward at first however brief and no technical questions by this specific hiring manager. Only a couple social questions. Phone interview was with a recruiter and standard nursing interview questions", "Interview Questions": "What was a time you went above and beyond for a patient? "}, {"date": "3 Jun 2021", "title": "Research Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Beth Israel Deaconess Medical Center (Boston, MA) in May 2021", "Interview Descriptions": "I received a call from BIDMC after they had found my resume online. The two interviewers were pleasant, gave me a chance to answer questions completely and answered my questions without hesitation. I did not feel rushed or pressured.", "Interview Questions": "How do you feel about having to test on mice when needed for medical research? The interviewer noted that all mice testing is done humanely and adheres to strict industry regulations."}, {"date": "28 May 2021", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Beth Israel Deaconess Medical Center in May 2021", "Interview Descriptions": "Not a typical formal interview. A friendly discussion. Technical as well as non-technical questions covered. Most importantly, they do not expect you to know everything but appreciate your enthusiasm to learn.", "Interview Questions": "How do I approach learning a new skill?"}, {"date": "16 May 2021", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Beth Israel Deaconess Medical Center (Boston, MA) in Apr 2021", "Interview Descriptions": "The whole process took about a month. I applied online, and received an email about scheduling an HR phone screening about a week later. The phone screening took place a week after that initial email, and they just asked me to talk about myself and give an example of a time I went above and beyond and a time I made a mistake (only about a 15 minute phone call). I then scheduled an interview with the hiring manager for the next week, which was just a conversation about my resume. Then I scheduled an interview for the next week with my potential supervisor, where I asked some questions about the position. I then moved onto references, and received an offer within a few days.", "Interview Questions": "Q: Tell me about yourself and why you applied for this position.\nQ: Tell me about a time when you went above and beyond.\nQ: Tell me about a time when you made a mistake.\nQ: How comfortable are you with asking for help?"}], [{"date": "19 Apr 2021", "title": "Data Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Beth Israel Deaconess Medical Center (Milton, MA) in Apr 2021", "Interview Descriptions": "Applied one week and was emailed about an interview the next. I was able to set it up a few days later. They told me I would hear back the next week. Very quick process.", "Interview Questions": "Describe a time you succeeded and a time you failed. "}, {"date": "2 Jan 2021", "title": "IT Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Beth Israel Deaconess Medical Center", "Interview Descriptions": "Great questions, very comfortable setting.     Highly engaged interview.     Really enjoyed the experience and felt valued.    I definitely want to work in such an environment.     Diversity and inclusion are highlighted.   Culture seems to be very positive", "Interview Questions": "What are your 5 year goals"}, {"date": "28 Jan 2021", "title": "PCT Patient Care Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Beth Israel Deaconess Medical Center in Jan 2021", "Interview Descriptions": "I received an email about an phone interview, which she just explained the job title, then they set me up for a zoom group interview, I hen you will move on to references", "Interview Questions": "Describe a time we’re you went above and beyond"}, {"date": "12 Dec 2020", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Beth Israel Deaconess Medical Center", "Interview Descriptions": "Easy going, average interview questions but need to prepare for them. Whole process took 2 weeks. You can tell they truly care about who they hire here. Very comfortable and positive experience.", "Interview Questions": "Talk me through your resume?\r\nWhy are you interested in this area of nursing?\r\nWhat was a time you dealt with a difficult patient?\r\nHow did you handle a time you disagreed with a coworker? \r\n"}, {"date": "5 Jan 2021", "title": "Program Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Beth Israel Deaconess Medical Center in Dec 2020", "Interview Descriptions": "The recruiter that initially called for a screening was a bit rude and also had a simple misunderstanding that she didn't clear with me so I was left confused. Their pay is very low considering the job and COL in Boston. I had three zoom interviews for only 30 min long with the previous person in the role, director, and other heads. The interviews were disorganized, non-pointed, and very low effort & interest from their end compared to other longer, professional interviews I've had with other hospitals and research centers. I was purposefully asked a few trick questions which I thought was a sign of poor management and training for recruiting.  All of the interviews were also extremely fragmented and not one fluid line of questioning as my last interview barely had any questions prepared and barely got to know me.", "Interview Questions": "What is a weakness of yours?"}, {"date": "22 Oct 2020", "title": "RN Case Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Beth Israel Deaconess Medical Center", "Interview Descriptions": "Once you get to the interview, make sure that you know how to speak to your resume.  You will speak with the HR person and then the manager and, if lucky the folks you will be working with.  But nothing moves fast.", "Interview Questions": "Don't recall it was so long ago.  But I can say that it was conversational.  There is a template of questions.  Nothing surprising."}, {"date": "20 Sept 2020", "title": "Research Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Beth Israel Deaconess Medical Center", "Interview Descriptions": "I was sent an email offering the opportunity for an interview. I was later phone screened for ~15minutes. This later followed up with a 30 minute phone interview. A week later, I had an in person interview!", "Interview Questions": "What interested you in this position? \r\nPlease tell me about your research experience. "}, {"date": "17 Sept 2020", "title": "Clinical Research Assistant I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Beth Israel Deaconess Medical Center", "Interview Descriptions": "The interview process was wonderful! I sent in my application materials, the hiring manager reached out to me within a week or two and then I spoke with three different people about the job (one of whom I was replacing as she planned to leave the position). After the very positive interviews, it took a few weeks to get everything squared away with HR. The whole process was fast and great!", "Interview Questions": "Q: How do you keep organized?\n\nQ: Sometimes patients are upset and you still have to work with them. How do you handle those situations?\n\nQ: This is a part-time position, can you still live in Boston with a part-time position?"}, {"date": "14 Oct 2020", "title": "Patient Care Technician Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Beth Israel Deaconess Medical Center in Sept 2020", "Interview Descriptions": "Was emailed for an interview, and the interview went well. Recruiter was really friendly throughout the interview. However, I didn't hear anything back though she said she'd contact back within the next few days. I even sent a follow-up email to which she replied that she'd let me know if she heard back, which I also never heard back from.", "Interview Questions": "Q: How would others describe you\nQ: Why Beth Israel?"}, {"date": "7 Aug 2020", "title": "Research Assistant I Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Beth Israel Deaconess Medical Center", "Interview Descriptions": "The interview process consisted of an interview one on one with the doctor in charge of the project and another interview with another doctor in charge of a similar project and the lab manager.", "Interview Questions": "What experience do you have with coding and biomechanics testing?"}], [{"date": "25 Mar 2020", "title": "Clinical Nurse I Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at Beth Israel Deaconess Medical Center", "Interview Descriptions": "Was called for an HR interview. They asked me why I wanted to work there and to describe a time when I had to deal with a difficult patient. After that, I scheduled an in person interview.", "Interview Questions": "Why do you want to work here?"}, {"date": "8 Mar 2020", "title": "Medical Laboratory Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Beth Israel Deaconess Medical Center (Boston, MA) in Mar 2020", "Interview Descriptions": "The whole process took a little over a week. I applied on a thursday, got an email for a phone interview the next day for the following monday, in-person Thursday, and an offer Friday. The in-person interview did not really feel like an interview, mainly just a tour, a couple of questions, and ID some petri dishes and microscope slides", "Interview Questions": "If someone else is having a bad day, how do you deal with that?"}, {"date": "13 Jan 2021", "title": "Proposals and Program Development Writer - Office of Development Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Beth Israel Deaconess Medical Center (Boston, MA) in Jan 2020", "Interview Descriptions": "Was reached out to by email and had a phone call. Interviewed in person, where I met three different people (was only expecting to meet one). People were friendly and likeable.", "Interview Questions": "What interests you about this job?"}, {"date": "22 Oct 2019", "title": "Clinical Research Associate Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Beth Israel Deaconess Medical Center", "Interview Descriptions": "Pretty standard interview, I felt like they did a great job of getting to know me. However, I do wish they did more to enlighten the current situation of their team.", "Interview Questions": "Q: How do you deal with conflict? "}, {"date": "14 Oct 2019", "title": "Lab Support Technician Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Beth Israel Deaconess Medical Center", "Interview Descriptions": "There was one interview. It was really straightforward. I don't even think they asked STAR method questions. It was an entry level position, so they didn't seem to be very selective.", "Interview Questions": "What you want to do long term?"}, {"date": "10 Jan 2022", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Beth Israel Deaconess Medical Center (Boston, MA) in Oct 2019", "Interview Descriptions": "Interviewed with three team members for 15 minutes each. Extremely thorough interview process. Asked many questions which required me to recall a difficult time, accomplishment etc. I was applying as a Co-op student", "Interview Questions": "What is your biggest weakness a former boss would say about you?"}, {"date": "30 Oct 2019", "title": "Security Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Beth Israel Deaconess Medical Center (Boston, MA) in Sept 2019", "Interview Descriptions": "Phone Interview - was definitely a courtesy call, every answer I gave was cut off and the interview was rushed through.  Got a declining email minutes after the interview.", "Interview Questions": "Why this position?"}, {"date": "14 Aug 2019", "title": "Human Resources Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. The process took 5 days. I interviewed at Beth Israel Deaconess Medical Center (Boston, MA) in Aug 2019", "Interview Descriptions": "I got the interview through an agency, I interviewed in Boston, the role was located in Woburn, MA. It was 20 minutes total and pleasant. I would have prefered they did a phone screen first as they are still looking for the right candidate for this role and it was tedious for them to bring me in for an interview (when I could have done a phone screen on a lunch hour)", "Interview Questions": "How strong are you with Excel"}, {"date": "17 May 2023", "title": "Surgical Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Beth Israel Deaconess Medical Center (Boston, MA) in Aug 2019", "Interview Descriptions": "2 phone calls with a manager & supervisor. 1 in person interview with management & current department employees. The entire group was friendly and follow-up with a tour of the department.", "Interview Questions": "where do you see yourself in 5 years"}, {"date": "5 Jun 2019", "title": "Research Assistant Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Beth Israel Deaconess Medical Center (Boston, MA)", "Interview Descriptions": "I interviewed with the Virology and Vaccine Research Department about a year ago. The process took about two weeks, however, there were several red flags that made me withdraw my application. The interview was scheduled at 1:00 PM. I got there at 12:55 PM, and the hiring manager did not show up until 1:45 PM!! And when she finally showed up, she was a bit rude and acted like the situation was normal because she is usually \"busy\". She also mentioned that the job description was changed and was not really clear about the responsibilities of the position or the qualifications that they were looking for! After a few days, I received an email from the front desk saying that the hiring manager does not feel like I am a good fit for the position, however, I was somehow invited to the second interview to meet rest of the team. I withdraw my application.", "Interview Questions": "Why do you think we should hire you?"}], [{"date": "14 May 2019", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Beth Israel Deaconess Medical Center (Boston, MA)", "Interview Descriptions": "There was an in person interview that required meeting with three different people, the research coordinator, the PI and an office administrator. The questions were not terribly difficult and the whole process was relatively simple. There was supposed to be a second round of interviews just to meet a different PI but with scheduling difficulties and vacations, this was cancelled.", "Interview Questions": "Tell me about your past research experience. "}, {"date": "15 Apr 2019", "title": "Clinical Research Associate Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Beth Israel Deaconess Medical Center", "Interview Descriptions": "Two rounds-- first with the program manager, second with a selection of MD's that I would be working with. The program manager wanted to see how you would do in a high stress environemnt. The MD's were most interested in your qualifications i.e. research background, ability to understand and follow protoocl specifics.", "Interview Questions": "Are you organized? Attention to detail? Goal oriented? Can you handle inter-personal conflict? Can you handle a high stress environment? "}, {"date": "20 Aug 2021", "title": "Patient Care Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Beth Israel Deaconess Medical Center (Boston, MA) in Apr 2019", "Interview Descriptions": "First an email, then phone interview, follow ups over the phone and email, and finally submit references. No in person interview in my case. I thought the HR team was very approachable and easy to talk to.", "Interview Questions": "Why do you want to go into nursing?"}, {"date": "27 Feb 2019", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Beth Israel Deaconess Medical Center", "Interview Descriptions": "Very straight forward, I work for a lab so the interview was very specific to that lab. Not many questions about the hospital or anything other than the research being done in the lab.", "Interview Questions": "Please tell me about your previous research."}, {"date": "1 May 2023", "title": "Clinical Research Assistant II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Beth Israel Deaconess Medical Center (Boston, MA) in Jan 2019", "Interview Descriptions": "My position called for 4 different interview. Two with the supervisors of the service, 1 with the MD of the service and one with the other coordinators in the department. They also asked similar questions but from different perspectives. The goal is really to get to know who you are and what you bring to the department,", "Interview Questions": "Tell me about yourself. What experience do you have in research?"}, {"date": "5 Jan 2019", "title": "Clinical Research Associate Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Beth Israel Deaconess Medical Center in Nov 2018", "Interview Descriptions": "They required you to provide at least five references who were emailed a survey to fill out. The interview was a semi-group interview and lasted two hours. This was a pretty laid back interview.", "Interview Questions": "Describe a time you needed to ask for help."}, {"date": "15 Oct 2018", "title": "APRN Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Beth Israel Deaconess Medical Center", "Interview Descriptions": "I applied online and had a phone interview with HR, following the phone interview I received invitation for in person interview which was the following week. It lasted an hour was an overall positive experience.", "Interview Questions": "Can you describe a time in which you took a clinical risk?"}, {"date": "18 Aug 2020", "title": "Administration Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Beth Israel Deaconess Medical Center in Sept 2018", "Interview Descriptions": "Interview was very laidback. It felt more conversational than answer and question interview style.  Although the manager was unable to provide/ explain the day to day roles or expectations of the job very well.", "Interview Questions": "Why do you want this job?"}, {"date": "15 Oct 2018", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Beth Israel Deaconess Medical Center (Needham, MA) in Sept 2018", "Interview Descriptions": "I met with an HR rep for a 30 minute  interview. She was very pleasant, professional and laid back. She made me feel at ease and was very polite.", "Interview Questions": "Tell me something about an experience you had that has made a difference in your career. "}, {"date": "21 Sept 2018", "title": "Research Lab Manager Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Beth Israel Deaconess Medical Center (Boston, MA) in Sept 2018", "Interview Descriptions": "The interview process has been fairly laid back.  They want to know about your past skill, and how you can put those skill to work in your new position.  They offer an overview of the role they are trying to fill.  They really seem to want to see if your skills fit, but also if your personality will be a good fit for their lab.  Team work is emphasized.", "Interview Questions": "What are some of your major responsibilities at your current job"}], [{"date": "6 Aug 2018", "title": "Pct Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Beth Israel Deaconess Medical Center (Boston, MA)", "Interview Descriptions": "Was asked questions by HR and the floor manager. Very straight forward. Took a tour of the floor with the floor manager and was introduced to many of the RNs and PCTs.", "Interview Questions": "What would you do if there was an emergency?\r\nAre you able to lift 25 pounds?\r\nWhat would you do incase a patient becomes agitated and aggressive towards you?"}, {"date": "29 Aug 2018", "title": "Project Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Beth Israel Deaconess Medical Center (Boston, MA) in Aug 2018", "Interview Descriptions": "Met with two directors at their office for a 45 minute conversation.  Mostly it was a review of my resume and experience.  Very conversational yet to the point. Started and ended on time.  Then there was a 15 minute meeting with HR, who gave an overview of the process.", "Interview Questions": "Nothing out of the ordinary, just follow up on resume and qualifications.  No tricks or surprises!"}, {"date": "11 Jul 2018", "title": "Patient Care Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Beth Israel Deaconess Medical Center", "Interview Descriptions": "2 interviewers asked the basic interview questions as well as a few scenario questions. The atmosphere was friendly and relaxed. I went on a tour of the unit afterwards, which was nice. It took over a month to hear back.", "Interview Questions": "They asked for my biggest strengths and weaknesses. "}, {"date": "3 Jul 2018", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Beth Israel Deaconess Medical Center", "Interview Descriptions": "First I interviewed with the Director of the unit. We went through my resume. Then I interviewed with the lead Administrative Assistant and had a tour of the office.", "Interview Questions": "If you could have any superpower, what would it be? "}, {"date": "26 Jun 2018", "title": "Systems Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Beth Israel Deaconess Medical Center", "Interview Descriptions": "real informal interview, more like a conversation, just told them my background and experience, and we had a good back and forth so I know the interviewer liked me. as long as you seem to have a good comprehension of the role and the ability to express yourself in a professional manner you'll be OK", "Interview Questions": "tell me about yourself"}, {"date": "31 May 2018", "title": "Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Beth Israel Deaconess Medical Center", "Interview Descriptions": "After applying for the role, I was contacted by a Beth Israel HR employee/recruiter for a phone interview. The call was pleasant, filled with questions fleshing out my prior experiences and the recruiter talking about the role and the department it supported. Upon conclusion of the interview, I was told the next step was an in-person interview.\r\n\r\nI touched base with the recruiter a few days after the phone screener to see how things were progressing and was told she was still trying to set up the interview(s). A few more weeks went by with no word from the recruiter and I reached out to see if I remained in contention for the role. The recruiter never responded.\r\n\r\nStated simply, the above conduct is unprofessional. If the recruiter hadn’t made any mention of next steps or added a qualifier (i.e. “If you make it to the next stage here’s what will happen…”) I would have been disappointed in not being further considered but would have understood. But to be told an interview with BI Medical Center staff was next and then never hear anything again?  Wow. Fantastic human resources skills you have there…", "Interview Questions": "What interests you about this role?"}, {"date": "27 Jun 2018", "title": "Registered Respiratory Therapist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Beth Israel Deaconess Medical Center in May 2018", "Interview Descriptions": "I applied for the position and despite being a very strong candidate, it took over a month for them to call me. At that point, I had an offer from another company and the BIDMC recruiter was so rude on the phone that I actually turned down the interview. The HR rep invited me to ask questions, but couldn't answer any of the questions I asked; he was snide and dismissive when I asked questions about the department and culture.  A colleague of mine did interview, only to have problems with the same recruiter.", "Interview Questions": "What are you looking for in a position?"}, {"date": "23 Apr 2018", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Beth Israel Deaconess Medical Center (Boston, MA)", "Interview Descriptions": "First they scheduled a screening phone interview conducted by HR.  A couple days later she contacted me to set up an in person/Skype interview. I was able to travel for an in person interview, but she did state that a Skype interview would not negatively impact my chances.", "Interview Questions": "What kind of experiences are you looking to get out of this job?"}, {"date": "16 Apr 2018", "title": "Business Operations Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Beth Israel Deaconess Medical Center (Boston, MA)", "Interview Descriptions": "Overall, this was a great interview experience! Initial outreach was done via HR and then coordinated with the hiring manager a team. I was able to meet with the entire team that I would be working with and supervising which provided a great realistic view as to the every day duties! Individuals were opens d honest about the challenges and areas for improvement as well as speaking about all of the positive areas of the department. Overall, you could feel the great culture here and how everyone truly embodies this!", "Interview Questions": "Please provide an example of a previous situation where you had to coach an employee verses discipline. "}, {"date": "14 Apr 2018", "title": "Data Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Beth Israel Deaconess Medical Center (Boston, MA) in Apr 2018", "Interview Descriptions": "Went through all of the interview processes (personality quiz, HR phone screening, 1:1 w/ hiring manager, and power point presentation) through reference checking.  Received plenty of compliments and positive feedback from other senior directors and hiring manager afterward.  The team continued to sell me the job.  The hiring director even emailed me herself to tell me I did a good job on the presentation.  HR was excited and hinted a potential offer was coming later in the week and voluntarily told me all about the hiring processes and start date, etc.   He explained that their hospital hiring process is different as in they do reference checks first before extending an offer whereas most hospitals reference checks are practical an offer.  My references diligently completed the skill survey throughout the week.  The recruiter insisted on scheduling a time later in the week to discuss a potential offer, but on that day all I received was a canned email stating they had moved forward with another candidate.  I'm certain this was about salary.  They coaxed me into revealing how much I was making by stating how there's the potential to be higher than the range they provided.  Since they're checking my reference, I caved and revealed my salary requirement, but reassured I was open to negotiating and they picked someone else.   Bully with a smile and passive aggressive snakes from hiring manager to HR.  Don't trust them! Leadership didn't even have the decency or courage to negotiate.  Worst interviewing process in all of the Boston hospitals I've been with!\r\n\r\nIn reflecting back, it was sketchy interviewing and HR practices.  The org leaders expect candidates to share their best ideas so it can be capitalized (free consulting!) and then hire someone with less money.\r\n\r\nBEWARE:\r\n- Watch out for sneaky, fake, and disingenuous culture at BIDMC.  For the department's scope of work, it is a tragedy their leadership behaves like this which explains why they're only a three star hospital\r\n-Don't believe in anything they promise you about being fair and equitable and how they're willing to pay for competitive talent - they are CHEAP.   They will choose the next candidate over you over petty cash.\r\n-Cheap talk about how desirable and competitive their position and pay is.  Hint:  most managers don't need to boast about it if it's true\r\n-HR is demanding completely disrespect candidate's time, priorities, and treat people like a number even their patients said so", "Interview Questions": "Have you thought about salary?"}], [{"date": "27 Apr 2018", "title": "Clinical Research Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Beth Israel Deaconess Medical Center (Boston, MA) in Apr 2018", "Interview Descriptions": "I was contacted by HR to set up a date and time, then I went to an in-person interview at BIDMC, they said they would contact me in 2 week regarding a 2nd interview.", "Interview Questions": "How do you stay organized?"}, {"date": "26 Mar 2018", "title": "Clinical Research Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Beth Israel Deaconess Medical Center", "Interview Descriptions": "Process was pretty straightforward. Got an email after applying online, and was asked to come in for interview. I met with various team members. After the interview, I was asked to provide my references, but I never heard back following that.", "Interview Questions": "Can you give an example of a time you dealt with conflict or criticism?"}, {"date": "31 May 2018", "title": "Digital Producer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Beth Israel Deaconess Medical Center (Boston, MA) in Mar 2018", "Interview Descriptions": "The interviewing process was pretty standard to start: 1 call with HR, a personality test, then 3 separate in-persons with members of the team. This took about a month. Shortly after the last in-person I was asked for references. I then submitted SIX. A week went by and I heard nothing. I followed up with the HR rep, who had no updates. Repeat x4 and we're a month out from the reference checks. I finally got a call from HR saying that they're moving on with other candidates who have more experience. In what world does an employer check SIX references after 3 interviews and then up and decides that the candidate does not have enough experience? Shouldn't that be determined after the interviews but PRIOR to asking a candidate for references?  Further, the HR rep tried really hard to sound empathetic but instead came across as condescending and patronizing. I see an older review that also mentioned a similar experience so this is obviously not a one-off.", "Interview Questions": "What made you decide to apply for this job?"}, {"date": "31 Jan 2018", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. I interviewed at Beth Israel Deaconess Medical Center", "Interview Descriptions": "I met with HR for a few minutes to discuss the process that could occur after the interview and then met with the manager for an interview- she was not welcoming", "Interview Questions": "What do you know about this unit"}, {"date": "3 Feb 2018", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Beth Israel Deaconess Medical Center (Boston, MA) in Feb 2018", "Interview Descriptions": "Applied online and also sent CV, cover letter to the PI. Was reached out by HR, everything went well, overall question about goal and background. Had a meeting with PI and other lab memebers", "Interview Questions": "Much about what you have been doing "}, {"date": "17 Mar 2018", "title": "Medical Interpreter Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Beth Israel Deaconess Medical Center (Boston, MA) in Feb 2018", "Interview Descriptions": "One of my best job interviews. the questions were straight forward and right to the point. very creative and welcoming directors . i am very proud and honored to join BIDMC .", "Interview Questions": "N/A"}, {"date": "12 Mar 2018", "title": "Nurse Practitioner Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Beth Israel Deaconess Medical Center (Boston, MA) in Feb 2018", "Interview Descriptions": "I applied as a new grad NP with 10 years RN experience in the same field of the position. I applied online and got a call from the manager for a phone screening. About one week later had a meeting with HR to explain benefits and hiring process and 1:1 interview with department manager. Then a week after that, a 5 hour shadowing experience with NPs. The whole process was not difficult, but it did take some time - about 2 months total from application to offer.", "Interview Questions": "Explain your professional background/experience and why you want to be a NP. "}, {"date": "19 Jan 2018", "title": "Program Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Beth Israel Deaconess Medical Center", "Interview Descriptions": "I was screening by HR over phone and in person and then I met with 3 supervisors. I had to submit references and once they were approved, I was hired. Salary was negotiated", "Interview Questions": "Past work experience"}, {"date": "7 Mar 2018", "title": "Project Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Beth Israel Deaconess Medical Center (Boston, MA) in Jan 2018", "Interview Descriptions": "I was emailed to set up a phone interview with one of the HR representatives, which took about 15 minutes. Then, I was invited to interview in person with the director. It was a straightforward interview, she asked about my current job and experience and told me about the position. It was about a half hour long and I felt comfortable.", "Interview Questions": "Describe a challenging situation that you've dealt with at your current job."}, {"date": "18 Nov 2018", "title": "Medical Technologist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Beth Israel Deaconess Medical Center (Boston, MA) in Dec 2017", "Interview Descriptions": "Directions to interview site were clear and accurate.  (The HR department is off-site.)  Interviewer was personable and asked questions appropriate to the position.  Benefits information was provided to me at the interview.", "Interview Questions": "How would I handle a difficult phone call from a provider seeking information?"}], [{"date": "22 Sept 2017", "title": "Patient Access Representative Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Beth Israel Deaconess Medical Center (Boston, MA) in Sept 2017", "Interview Descriptions": "it was easy. place was easy to find she made me comfortable, typical interview questions. it was a casual per diem so no set hrs.  they needed someone that was just on call when someone called out or wanted their shift covered the per-diem was there to cover it", "Interview Questions": "are you punctual?"}, {"date": "14 Aug 2020", "title": "Gift Shop Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 3 weeks. I interviewed at Beth Israel Deaconess Medical Center (Boston, MA) in Sept 2017", "Interview Descriptions": "It was very casual and they hire a lot of work-study students from the neighboring colleges and surrounding area. The manager is incredibly kind and accommodating. She is just getting a gist and understanding of your personality and work ethic.", "Interview Questions": "Have you worked in customer service before? "}, {"date": "19 Sept 2017", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Beth Israel Deaconess Medical Center (Boston, MA) in Aug 2017", "Interview Descriptions": "I was called initially by the HR rep and was asked some behavioral type of questions and once she was satisfied she scheduled a face to face interview with a junior investigator.  The interview process was fairly easy and straight forward. The investigator asked for my references the same day. \r\nHowever, the reference site BIDMC uses is like an online survey. By this point, my references had already been contacted a couple of times and I was already being considered at another hospital, so they did not reply to the survey email on time.", "Interview Questions": "What are the major steps to a Western Blot"}, {"date": "11 Aug 2017", "title": "Nurse Practitioner Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Beth Israel Deaconess Medical Center (Boston, MA) in Aug 2017", "Interview Descriptions": "Initial phone call where I was asked to come in for a day which included 5 hours of shadowing and three interviews. The interviews were with the NP manager, chief of neurosurgery, and HR rep.", "Interview Questions": "What are three words your references would use to describe you. "}, {"date": "27 Aug 2018", "title": "Clinical Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Beth Israel Deaconess Medical Center (Boston, MA) in Aug 2017", "Interview Descriptions": "First, you interview with group manager. This is for about 30 minutes, Afterwards you interview with a few other of the higher up team members. additionally, you Also get opportunity to meet with your (hopefully) future coworkers. Overall a pretty standard interview process", "Interview Questions": "Example of being attentive to detail"}, {"date": "26 Sept 2017", "title": "Clinical Research Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Beth Israel Deaconess Medical Center (Boston, MA) in Jun 2017", "Interview Descriptions": "There were two interviewers, the clinical research administrator and the statistician of the group. They interviewed me at the same time and process took about an hour. They asked the usual questions.", "Interview Questions": "How do you see yourself 2-3 years from now?"}, {"date": "22 Aug 2017", "title": "Administrative Assistant Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Beth Israel Deaconess Medical Center (Boston, MA) in Jun 2017", "Interview Descriptions": "I was emailed to go in for an interview within a week or two after I had applied. I met with practice coordinator, manager and chief of the department. I spent a total of an hour and a half interviewing.", "Interview Questions": "Tell me about a time when you made a mistake and what did you do to fix it?"}, {"date": "6 May 2017", "title": "Research Assistant I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Beth Israel Deaconess Medical Center (Boston, MA) in May 2017", "Interview Descriptions": "Submitted online application\r\nThey contacted me via email after 3 weeks\r\nphone interview for 20 mins\r\nPI sent me his ongoing work and ask me to present it on the interview day\r\nin person interview \r\npost interview follow up 2 weeks after interview", "Interview Questions": "Tell me about yourself"}, {"date": "9 Jun 2017", "title": "Cst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. I interviewed at Beth Israel Deaconess Medical Center (Boston, MA) in Mar 2017", "Interview Descriptions": "Very informative and in depth phone conversation. Described working conditions, job details, further expectations; along with city description, parking, and what to fully expect. Also let me know upfront that it was the night shift that needed coverage and asked if that would be okay by me to accept.", "Interview Questions": "How do you feel about working nights?"}, {"date": "15 Mar 2017", "title": "Senior Social Work Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Beth Israel Deaconess Medical Center (Boston, MA) in Mar 2017", "Interview Descriptions": "Sent application via online application and a week later was sent an online \"personality test\" to see if I was a fit for the job.  A week later was asked to set up an interview with HR which was more about going over details of the job to see if there are any dealbreakers.  10 days later received an email about an interview date with manager.", "Interview Questions": "How much I expected to be paid?"}], [{"date": "14 Apr 2017", "title": "Development Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Beth Israel Deaconess Medical Center (Boston, MA) in Feb 2017", "Interview Descriptions": "I applied online, had a phone interview about a week later, then a 2 hour in person interview with HR and 3 people within the department. I was told I would hear back within the week if I would come back for a final interview. Two and a half months later I got an email about getting 5 references together, so I was pretty confused. I emailed them back and it was an \"IT issue\" and the email was supposed to be telling me that the position was filled.", "Interview Questions": "Why do you think that you'd be good for this position?"}, {"date": "15 Jan 2018", "title": "Summer Health Corp Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Beth Israel Deaconess Medical Center (Boston, MA) in Feb 2017", "Interview Descriptions": "Tough. 120 people for 20 spots. They were very nice people and very helpful. They asked alot of question.  I thought I had a good chance since I prepared for the interview, and I ended up getting accepted. It was very competitive.", "Interview Questions": "When does the program start and end"}, {"date": "4 Jan 2017", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. I interviewed at Beth Israel Deaconess Medical Center (Boston, MA)", "Interview Descriptions": "30 years ago- Sent in resume and application by mail to HR. HR called to set up interview.1:1 interview with unit manager. HR called a couple of days later with job offer.", "Interview Questions": "Previous experience\r\nWhy BI?"}, {"date": "17 Feb 2017", "title": "Bio-Statistician Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Beth Israel Deaconess Medical Center in Jan 2017", "Interview Descriptions": "Applied online and was contacted by department's project manager after a week to set up a 20-30 phone interview for later that week. Actual phone interview lasted less than 10 minutes. Basic screening questions: tell me about yourself, how well do you know this program, and any questions for her to answer. It felt very rushed and I didn't get a good feeling from it. Next step would've been an in-person with the department director but never heard back.", "Interview Questions": "Tell me about yourself"}, {"date": "16 Oct 2019", "title": "Undergraduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at Beth Israel Deaconess Medical Center (Boston, MA) in Jan 2017", "Interview Descriptions": "I applied at the end of the year and received a notice for interview two weeks after. I scheduled the interview in late January and got accepted a few days after.", "Interview Questions": "What were my experiences in video games (since the clinical trial has something to do with video game therapy)"}, {"date": "11 Sept 2021", "title": "SPD Technician Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Beth Israel Deaconess Medical Center in Jan 2017", "Interview Descriptions": "very formal interview process. nothing out of the ordinary. everyone was friendly and welcoming. Not a very long process either. definitely would recommend this hospital for employment if you're looking", "Interview Questions": "they asked me about work experience "}, {"date": "29 Nov 2016", "title": "Medical Physicist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at Beth Israel Deaconess Medical Center", "Interview Descriptions": "Interviewer was 25 minutes late for phone interview.  Was not at desk for expected interview, and I had to call HR office to track them down. Spoke to them for five minutes and was told I was unqualified.  It was an unfavorable  inconsiderate waste of time.", "Interview Questions": "What type of institution did you work? Was it large or small and what was the patient load?"}, {"date": "25 Jan 2017", "title": "Patient Care Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Beth Israel Deaconess Medical Center (Boston, MA) in Dec 2016", "Interview Descriptions": "Applied online and heard back within a week- week and a half. Then had a short phone interview with HR and they wanted to set up an in person meeting with the nursing director. Went in for an interview and heard back a week later. Very relaxing and everyone was very delightful and nice to talk to. I immediately felt comfortable there", "Interview Questions": "Use three words to describe yourself."}, {"date": "23 Nov 2016", "title": "Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Beth Israel Deaconess Medical Center", "Interview Descriptions": "I applied online. The process took 5 weeks. I interviewed at Beth Israel Medical Center. initial interview was phone interview with HR person( She was super friendly and pleasant).  Then the following week, I interviewed with the Director and another interview on the third week with three different MDs which took a whole day. \r\nInterview was based on background, availability and management style .Very straight forward.", "Interview Questions": "Tell me about yourself? \r\nHow do you handling conflict?"}, {"date": "13 Nov 2016", "title": "Clinical Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Beth Israel Deaconess Medical Center (Boston, MA) in Nov 2016", "Interview Descriptions": "Applied on 10/15/16 and heard back 3 weeks later on 11/04/16. I first had a phone call with the Program Administrator of the lab, who told me more about the position and asked basic behavioral questions. A few days later I had a Skype interview with the PI I would be working with. Finally, I was called in 11/11/16 to meet with 4 members of the lab (Research Assistant, different PI, Research Nurse, and Administrative Director). All my interviews were very casual and relaxed. I was mostly asked about my previous research experiences, how long I would stay with the group, and my future plans. Very easy.", "Interview Questions": "Tell me about a time when you had to work as a team."}], [{"date": "27 Oct 2016", "title": "Medical Education Coordinator Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Beth Israel Deaconess Medical Center", "Interview Descriptions": "Very long, arduous process. Step 1: Phone interview with HR person. Step 2: Interview with 4 different people spread out over multiple days (created problems at my current job). Took over 2 months from when I submitted my application to receiving an offer.", "Interview Questions": "Can you commit to this job for at least 2 years?"}, {"date": "6 Oct 2016", "title": "Tech Position Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Beth Israel Deaconess Medical Center (Boston, MA) in Sept 2016", "Interview Descriptions": "I applied for the job about 6 weeks ago. I got an email for a recruiter to set up a phone interview time. The phone interview was quick and easy , pretty straight forward.  Afterwards scheduled an interview with the hiring manager. Overall it was a decent interview not too hard. Afterwards,I got a call from the hiring manager to set up another interview with the team I would be working with. She asked me to reschedule once ( even asked me to take a half a day off at my other job to accomdate their staff, like really?)  Again was pretty straightforward interview overall I would say it was a decent interview.  The staff seemed friendly. But afterwards I met with the manager asked few questions about policies,etc... She talked a little about potential salary,which didn't seemed too bad( but currently I make the same amount doing less work )   but didn't seem like too much for negotiating higher. The staff seem fine, but the whole conversation about salary with the manager turned me off. Something about the manager gave me a weird negative vibe ,( my gut is always right)The job would be a good learning experience , but I still want to be paid a decent salary, especially with the type of commitment I would have to make.", "Interview Questions": "What are your goals for the future?"}, {"date": "27 Jul 2016", "title": "Research Assistant I Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Beth Israel Deaconess Medical Center", "Interview Descriptions": "Applied online, was contacted about a week later for a phone interview. Phone interview was 20 minutes, spoke with the doctor whose lab I would be working in. It was fairly quick and easy. Just was asked about the research project listed on my resume, for a set of references, and about my goals for the future. Also was asked about if I lived in the area and if it was easy for me to commute in or not.", "Interview Questions": "What are your goals for the future?"}, {"date": "12 Jul 2016", "title": "Accountant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Beth Israel Deaconess Medical Center in Jul 2016", "Interview Descriptions": "About a week after I submit the application online, I got an email for an assessment survey.  It took me about 15 minutes to finish the survey.  It had all multiple choices questions. Then I got an email from HR for a phone interview in about 2 business days.", "Interview Questions": "Why are you leaving your current job?"}, {"date": "1 Jul 2020", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Beth Israel Deaconess Medical Center (Boston, MA) in Jul 2016", "Interview Descriptions": "Organized, well put together, simple and straightforward. I emailed them initially and then they called me in for an interview. I scheduled it, went in for the in person, shadowed a nurse for a few hours then was finished.", "Interview Questions": "Why do I want this job"}, {"date": "7 Jun 2016", "title": "Clinical Research Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Beth Israel Deaconess Medical Center (Boston, MA)", "Interview Descriptions": "Contacted by HR for initial phone screening who set up a time to come in for a one-on-one with the hiring manager. Questions were mostly about my background. Everyone was friendly and the interview was casual.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "9 May 2016", "title": "Executive Assistant Board Liaison Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. The process took 1 day. I interviewed at Beth Israel Deaconess Medical Center in Apr 2016", "Interview Descriptions": "It was a phone interview. She set it up for 1:30pm.  Didn't call until 1:44pm.  Did not have my resume and asked me to resend it to her, which I immediately did.  She said her connectivity was not good and asked me to review my resume over the phone, the highpoints.  I tried to do this, but felt she wasn't listening at all. She repeated questions and asked me to repeat my questions.  I asked 5 and she couldn't answer any.  Never heard back. Nothing. I sent an email, no response.", "Interview Questions": "How would you handle an upset doctor?"}, {"date": "25 Sept 2016", "title": "Surgical Resident Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Beth Israel Deaconess Medical Center (Boston, MA) in Mar 2016", "Interview Descriptions": "Generally friendly environment but still formal. Multiple attendings would be interviewing you. And you would be ranked against other applicants based on your performance during your interviews. And also on your resume. You get the opportunity to ask questions about the program. All the other applicants are generally very qualified as well. So, you have to bring your A game for the Interview.", "Interview Questions": "Tell me about yourself"}, {"date": "26 Feb 2016", "title": "Pulmonary Function Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Beth Israel Deaconess Medical Center (Boston, MA) in Feb 2016", "Interview Descriptions": "Very simple and comfortable interview, met with the hiring manager and the team I would be working with. Straight forward questions and a nice conversation. Toured the facilities and talked about my general background and goals for the next few years.", "Interview Questions": "Why Beth Israel?"}, {"date": "23 Jan 2020", "title": "Aide Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Beth Israel Deaconess Medical Center in Jan 2016", "Interview Descriptions": "The interview process was standard, it went over the course of a month. I had a phone screen with the human resources department, and then an in person interview with the department manager. a few weeks after the interview with department manager i received a call from HR with the offer.", "Interview Questions": "strengths and weaknesses?"}], [{"date": "9 Nov 2015", "title": "Software Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Beth Israel Deaconess Medical Center", "Interview Descriptions": "Interview process was quick and not too hard. They brought me in for an interview and asked me a couple questions about my resume. I met 3 different people and then was brought around to meet the rest of the people in the division.", "Interview Questions": "Question about arrays"}, {"date": "16 Nov 2015", "title": "Patient Care Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Beth Israel Deaconess Medical Center (Boston, MA) in Nov 2015", "Interview Descriptions": "Filled out application online, and a week later received an email requesting a phone interview. Phone interview was with an HR recruiter, very nice, casual and informative interview. Was immediately asked to come in for an in person interview. In person interview was with nursing director. Again, very nice, casual, and informative interview. Was asked for references immediately after interview, received job a week later.", "Interview Questions": "Can you recall a time you went above and beyond for the work place? \r\nCan you recall a time when you had conflict with a co-worker and what you did to solve it? "}, {"date": "9 Nov 2015", "title": "Executive Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Beth Israel Deaconess Medical Center (Boston, MA) in Oct 2015", "Interview Descriptions": "Contacted by HR for screening. \r\nEmailed after phone screening regarding initial interview face to face\r\nContacted after face to face interview about interest and told there would be a 2nd interview to keep this in mind and keep an calendar opening\r\nNever contacted again. After contacting hiring manager was informed they hired for the position and that they thought that the HR person told me this.\r\nPoor internal and external communication", "Interview Questions": "What I could bring to the position"}, {"date": "28 Sept 2015", "title": "Practice Assistant Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Beth Israel Deaconess Medical Center", "Interview Descriptions": "I applied for this job on the web.  After I got an email asking me set up an interview, we set up a time for a phone interview. A woman, probably from HR, did not call me on time, but called me a lot later with no reason or excuse. The interview questions were basic and boring.", "Interview Questions": "Salary requrirements"}, {"date": "1 Oct 2015", "title": "Clinical Research Assistant I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Beth Israel Deaconess Medical Center (Boston, MA) in Sept 2015", "Interview Descriptions": "Nice people, interesting information, meetings with the intended team. The job requires motivation to work in working in a fast-paced environment  and some special skills and education. You should be upbeat and this job.", "Interview Questions": "What is your plans?"}, {"date": "30 Sept 2015", "title": "Administrative Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Beth Israel Deaconess Medical Center (Boston, MA) in Sept 2015", "Interview Descriptions": "I applied online and received an email a month later to schedule a phone interview. I had phone interview that same week and was later scheduled for an in person interview, which took place two weeks later. I was told I was meeting with three people but out at the interview, I was only meeting with one (meeting with other two was only for people moving to the next round). Manager only asked me four questions, described the position and once he was done, told me what the next step would be and didn't give me any opportunity to ask questions!\r\n\r\nI did not get his card, so that I could send him a thank you email (my fault). I reached out to the recruiter I initially interviewed with, in order to see if I could get his email but she didn't even bother responding back. I did feel that was very rude and unprofessional. Even if not interested in me as a candidate, don't just ignore my email, especially when I am only trying to thank the interviewer. If it couldn't be given out, a simple response informing me of this would have been fine or just letting me know you would pass on the message would have been nice. I don't think it is right to just ignore the email.", "Interview Questions": "Why do you want to work here?"}, {"date": "20 Aug 2015", "title": "Clinical Nurse I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Beth Israel Deaconess Medical Center (Boston, MA) in Aug 2015", "Interview Descriptions": "Applied online, HR contacted me through email a week later to schedule a phone interview. Phone interview consisted of 15 or so questions that asked about my work and clinical experiences. After the interview I was scheduled for an in person interview with the nurse manager of the unit. The in person interview consisted of questions, a tour of the unit and a detailed explanation of the job, lasted a little over an hour. A week and a half after my interview HR called back and offered me the job.", "Interview Questions": "Goals for the next 5-10 years, Time where I worked as a team and it went well, a patient experience where I made a difference."}, {"date": "27 Aug 2015", "title": "Mystery Shopper Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Beth Israel Deaconess Medical Center (Boston, MA) in Aug 2015", "Interview Descriptions": "Applied online on 16th May 2015\r\nPhone interview on 3rd August 2015\r\nIn-person interview on 10th August 2015\r\n\r\nSTILL WAITING FOR THEM TO TELL ME MY STATUS AFETR THE IN-PERSON INTERVIEW (Its been 17 days today!)", "Interview Questions": "Mostly Situational type:\r\n1. Tell me a time when you a conveyed a complex thing in a simplified way\r\n2. time when you death with a conflict in a team "}, {"date": "16 Oct 2015", "title": "Accountant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Beth Israel Deaconess Medical Center (Boston, MA) in Aug 2015", "Interview Descriptions": "Phone screening was done by the HR, and one week later an email invitation was sent for office visit  interview. 1-1 interview was firstly done with Team Manager, and then a couple of days later was invited to meet with Team Member and Manager altogether. There was no feedback afterwards. More than one month later I found the position opening was closed on their career website.", "Interview Questions": "Very general questions."}, {"date": "16 Nov 2015", "title": "Grant Proposal Manager Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Beth Israel Deaconess Medical Center (Boston, MA) in Aug 2015", "Interview Descriptions": "Long wait time. No response. Long interview that had repeating questions. Interviewer didn't seem to have read my resume before I came in. Made no contact with me after the interview in any form even though I sent a thank you and asked for an update on the process.", "Interview Questions": "Why do you see yourself here?"}], [{"date": "23 Jul 2015", "title": "Clinical Research Assistant II Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Beth Israel Deaconess Medical Center (Boston, MA) in Jul 2015", "Interview Descriptions": "Ten days after applying online for this post, I got a interview invitation. A RN interviewed me. She just wanted to know what I had done. She did not ask me any specific questions. Instead gave me information about the position. However, I was supposed to receive another email for a follow up interview with the physician which I am still waiting for!(past 10 days)", "Interview Questions": "Tell me about yourself"}, {"date": "9 Sept 2015", "title": "Urgent Care Representative/Part Time Evenings Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Beth Israel Deaconess Medical Center (Norwood, MA) in Jul 2015", "Interview Descriptions": "I was in an interview for over an hour and a half for this part time position. I was told from the recruiter on the phone interview that the position was x,y, and z. When I went for the actual interview, the hours of the position were not what was quoted to me on the phone interview. Very disappointing and a waste of the company's time interviewing someone for that length of time for a position that is pt/time!", "Interview Questions": "What could I bring to their department?"}, {"date": "7 Jul 2015", "title": "Clinical Research Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Beth Israel Deaconess Medical Center (Boston, MA) in Jun 2015", "Interview Descriptions": "It was quite a delightful experience. the only thing is, I think I did a pretty good job at the interview (not hard at all) but the HR emailed me this morning saying that I did not got the job. I applied online and got an email interview invitation 3 or 2 weeks later. after the interview, around a week or so, I heard back from the HR.", "Interview Questions": "where do you see yourself in 5 years."}, {"date": "24 Mar 2017", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Beth Israel Deaconess Medical Center (Boston, MA) in Jun 2015", "Interview Descriptions": "Overall the interviewing experience was not negative, this is kind of how it took place:\r\n\r\n1) Applied on the BIDMC website  2) Interview screening 3) Supervisor interview 4 ) Manager interview 5) Online references 6) Received a call from Hr with an offer.", "Interview Questions": "What would you do if a patient screams at you?\r\nWhat would you do if a doctor screams at you?\r\nHow do you manage conflict?\r\n"}, {"date": "8 May 2018", "title": "HIM Clerk Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Beth Israel Deaconess Medical Center (Boston, MA) in Jun 2015", "Interview Descriptions": "Interviewed by Director and Supervisor. Asked a lot of work experience and behavioral questions. They also asked me when can I start and how will I handle certain things in different work scenarios.", "Interview Questions": "Tell me about yourself and work experience?"}, {"date": "7 Aug 2015", "title": "Clinical Research Assistant II Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Beth Israel Deaconess Medical Center (Boston, MA) in Jun 2015", "Interview Descriptions": "applied online, got interview invitation the next day. its in-person interview and got a chance to meet with the lab manager. got feedback next week saying I didn't get the job. SAD FACE.", "Interview Questions": "where do you see yourself in 5 years. why BIDMC"}, {"date": "18 Apr 2016", "title": "Receptionist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Beth Israel Deaconess Medical Center (Boston, MA) in Jun 2015", "Interview Descriptions": "My interview process was quick and thorough.  I had a phone interview with a person from HR.  I was called 1 week later to set up a 1 on 1.  I interviewed with a department manager and a coordinator.  It was a very straight forward interview.  It took about 2 months before I received  a call with an offer as they were interviewing other candidates.", "Interview Questions": "Why did I choose BIDMC?"}, {"date": "8 Aug 2016", "title": "Patient Care Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Beth Israel Deaconess Medical Center (Boston, MA) in Jun 2015", "Interview Descriptions": "it was easy quetions were ok not too difficult i applied online I received the call it took two weeks the hiring process, they require an immunization and vaccination record for the pre-hiring process", "Interview Questions": "why did you apply for this job?"}, {"date": "19 May 2015", "title": "Research Laboratory Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Beth Israel Deaconess Medical Center (Boston, MA)", "Interview Descriptions": "Interview process was through HR first via phone.  Then met with senior management and principal investigator.  Interview went well.  Had a tour of the laboratory.  Questioned on scientific techniques.  Emphasized on commitment time.", "Interview Questions": "What was my 5 year plan?"}, {"date": "13 Aug 2015", "title": "Administrative Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Beth Israel Deaconess Medical Center (Boston, MA) in May 2015", "Interview Descriptions": "I applied online, got a call 2 months later and went in for an interview. After the interview I never heard back. I contacted HR and the individual who interviewed me. No one ever responded. the position is still posted as open on their website. The follow-up was disappointing and unprofessional. It doesn't make me want to apply to other jobs at their organization.", "Interview Questions": "Have you ever created metrics before?"}], [{"date": "1 Oct 2019", "title": "Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Beth Israel Deaconess Medical Center (Boston, MA) in May 2015", "Interview Descriptions": "Phone screen with Human Resources lasted about fifteen to twenty minutes . Went over job position and salary requirements. Follow up was via email to inform me about the next step. The whole thing took about 2 weeks", "Interview Questions": "Why I applied for the position"}, {"date": "19 Apr 2015", "title": "Social Worker Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Beth Israel Deaconess Medical Center", "Interview Descriptions": "HR calls you and has a phone interview with you.  Then they call you in for a in person interview with the management.  the overall process happened pretty quickly.", "Interview Questions": "pretty normal interview questions"}, {"date": "19 Mar 2015", "title": "Research Assistant II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Beth Israel Deaconess Medical Center", "Interview Descriptions": "Informal and relaxed. Most of the discussion was on previous experience and application of the skill set. It is all dependent on the Principal investigator on how s/he wants to conduct the interview. It is mostly one phone interview with HR and hiring manager and an on-site interview with the PI and lab members.", "Interview Questions": "Describe your expereince"}, {"date": "12 Jul 2017", "title": "Administrative Assistant II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Beth Israel Deaconess Medical Center (Boston, MA) in Mar 2015", "Interview Descriptions": "2/25/15: Applied + filled out personality quiz/questionaire\r\n2/26/15: HR Email for Phone Interview with HR Rep\r\n2/27/15: Phone Interview with HR Rep + E-Mail following up with date/time to interview with the Department\r\n3/3/15: First interview w/ director of clinical operations & Practice Administrator + Was given a quick tour of the department + was sent e-mail from HR asking for references\r\n3/5/15: Was e-mailed to set up 2nd interviews\r\n3/13/15: 2nd interviews with other 3 admins & Doctor I would work with primarily (these were formalities) & the Chief Financial Officer (last screening to make sure I wasn't a psychopath?)\r\n3/18/17: Received verbal offer from HR\r\n\r\nCons: HR did not negotiate salary, unfortunately had to take offer that was $5K below market value for the position", "Interview Questions": "Asked about prior work experiences and how they would relate to this position. Asked some behavioral/situational questions about working with high strung, anxious patients and how I would handle dealing with difficult/upset patients. Asked questions about team work and whether I had issues with coworkers in the past. Asked about my ability to learn new software/technology. Are you a fast learner? What do you know about the department (GOOGLE THE DEPARTMENT BEFORE YOU INTERVIEW so you can impress them with knowledge of what the department does and such). Asked about education, future goals, and whether I could commit to the position for 2-3 years. What are your strengths + what are your weaknesses?"}, {"date": "25 Feb 2015", "title": "Clinical Research Assistant I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Beth Israel Deaconess Medical Center (Boston, MA)", "Interview Descriptions": "Fairly easy interview process, involving multiple interviewers. The interviews themselves weren't too difficult. All interviews were with various people in a wide variety of roles in the department (RNs, MDs, etc).  Dress well and do your homework.", "Interview Questions": "How would you deal with a patient's death?"}, {"date": "29 Mar 2017", "title": "Patient Care Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Beth Israel Deaconess Medical Center (Boston, MA) in Feb 2015", "Interview Descriptions": "The interviewing process was pretty standard. I was in contact with a HR rep who helped me to set up an interview with a few nurse managers who did a great job at conducting the interview.", "Interview Questions": "How will you contribute to our community?"}, {"date": "26 Jan 2015", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Beth Israel Deaconess Medical Center", "Interview Descriptions": "I applied online and was contacted via email to schedule an interview. For the first interview I was interviewed by a senior member of the lab, followed by a couple of other Research Assistants. I then was invited back for a second interview about a week later. The format of the second interview was similar to the first. I received a call a month and a half later offering me the position.", "Interview Questions": "I was asked to explain protocols for techniques on my resume."}, {"date": "4 Apr 2015", "title": "Speech-Language Pathologist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Beth Israel Deaconess Medical Center in Jan 2015", "Interview Descriptions": "The entire hiring process consisted of a formal, standardized interview with behavioral and clinical questions with the team as well as an in-person interview with the HR representative. There were no 2nd round interviews. The HR rep used an aggresive and confrontational communication style, and her ethics were questionable.", "Interview Questions": "Tell us your interpretation of the MBS video."}, {"date": "18 Nov 2017", "title": "Program Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Beth Israel Deaconess Medical Center in Jan 2015", "Interview Descriptions": "First a phone interview, about 1/2 hour, with HR. Next, one on one with future manager that I would report to. A week later, group interview with several people from the department.", "Interview Questions": "How have you handled difficult personalities?"}, {"date": "23 Oct 2015", "title": "Postdoctoral Research Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Beth Israel Deaconess Medical Center (Boston, MA) in Dec 2014", "Interview Descriptions": "I had one phone interview followed by a presentation to the lab. Phone interview was just to check if I fit the role. I presented my PhD research work and got a lot of questions on it. This was followed by a one on one interaction with the PI.", "Interview Questions": "How would you start to solve a research problem in your field when presented with it. Please tell us your thought process. "}], [{"date": "8 Nov 2014", "title": "Medical Billing and Compliance Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 1 week. I interviewed at Beth Israel Deaconess Medical Center (Boston, MA) in Oct 2014", "Interview Descriptions": "I was late for the interview despite leaving 2 hours prior but they were so understanding and I kept apologizing but they kept telling me that they understood.  They immediately made me feel better.  Katelynn in HR couldn't have been nicer, she explained the benefits and the culture of BIDMC.  Then I met with the administrative director who was impeccably dressed, but so friendly.   We actually shared a few laughs. When she explained the job to me it was far more interesting to me than how the recruiter described.   Than I met with my office mate and counterpart to the position.   Also incredibly nice!  I really wanted that position after the interview.   It seemed like an excellent fit for both of us (the department and myself).", "Interview Questions": "They asked what a typical day was like for me."}, {"date": "22 Jul 2015", "title": "Research Assistant I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Beth Israel Deaconess Medical Center (Boston, MA) in Sept 2014", "Interview Descriptions": "Very easy. They brought me in twice, each time meeting with different people in the Lab. They explained the position and then asked me a lot of questions about my lab experience.", "Interview Questions": "Have you ever had to solve a laboratory related problem? If so, what was the problem, and how did you resolve it?"}, {"date": "6 Aug 2014", "title": "Learning Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Beth Israel Deaconess Medical Center (Boston, MA)", "Interview Descriptions": "Had a phone interview with recruiter and one in-person interview with the recruiter, Director, and colleague.  Everyone was nice and welcoming and willing to answer any questions about this position.  Also gave good insight into the job duties.  Especially appreciated the information that was provided by the recruiter during the in-person interview in regards to employee benefits/costs and parking information.  It was nice to have that information to consider in advance.  Was informed by the recruiter in a timely manner that I was not selected for the position.", "Interview Questions": "N/A"}, {"date": "18 Nov 2016", "title": "Research Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Beth Israel Deaconess Medical Center in Jul 2014", "Interview Descriptions": "I applied via internet job search, and received phone call about a week later. I have received two times of direct phone call from project investigator. He asked me about research background and future plan.", "Interview Questions": "Asking about research background and future plan."}, {"date": "5 May 2014", "title": "Research Assistant I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Beth Israel Deaconess Medical Center", "Interview Descriptions": "I was contacted by HR to arrange for a phone interview with my potential boss.  I had the phone interview and then was contacted within 2 days for an interview in person.  The interview in person went well, they generally asked basic questions as to what brought me to study biology and so on.", "Interview Questions": "It was a very basic interview, they were mostly interested in what my future plans were in my career."}, {"date": "14 Apr 2015", "title": "Research Assistant I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Beth Israel Deaconess Medical Center (Boston, MA) in May 2014", "Interview Descriptions": "One phone interview, then in person interview. The process took about 2-3 weeks total. Overall it was a very easy process. I applied through their careers website and was contact within a week about a phone interview. Following the phone interview, we met in person.", "Interview Questions": "Very basic questions about my resume and past experience. Some questions on if I knew anything about the background of the research I was applying for."}, {"date": "31 Jan 2017", "title": "RN-STAFF NURSE Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Beth Israel Deaconess Medical Center (Boston, MA) in May 2014", "Interview Descriptions": "Easy interview process met with everyone same day. Met with two people an rn supervisor and manager and hr. Asked some tough clinical questions because my background was a little different.  They seemed to value my experience.  Got a response within two weeks or so I think. Everyone was really nice and I got a tour of the floor.  They recommended me to another floor after which i thought was great.", "Interview Questions": "How many days did I miss last year"}, {"date": "22 May 2015", "title": "Bio Statistician - I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Beth Israel Deaconess Medical Center (Boston, MA) in Apr 2014", "Interview Descriptions": "Phone interview with the program manager, in-person interview with the PI.  I had a good idea that I would be offered the position after the in-person interview because the PI was started to talk about training me, etc.", "Interview Questions": "Phone Interview:\r\nDo you have background with SAS, STATA, SQL\r\nWhat are your other interests outside of work?\r\n\r\nIn-Person Interview: \r\nPersonal history, family history questions\r\nHave any data collection experience?\r\nHow long can you commit to this position?\r\nFuture goals?"}, {"date": "13 Mar 2014", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 6 weeks. I interviewed at Beth Israel Deaconess Medical Center", "Interview Descriptions": "Development Office Admin. Assist- the department had me meet with about 4-5 people within a day. Basically, you meet with who will be your colleagues, who will be your supervisor, and then the head of the department. Most interview questions are basic (strengths/weaknesses, explain a time when...). It's more about personality, and if you're used to the work, or will be able to learn fast/deal with the speed of operations.", "Interview Questions": "Why do you want to work here?"}, {"date": "12 Feb 2014", "title": "Medical Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Beth Israel Deaconess Medical Center (Brookline, MA)", "Interview Descriptions": "Submitted an online application and was immediately sent back an email to fill out a questionnaire assessment that took about 15-20 min to fill out. Once that was submitted I was contacted by HR after 3 days to set up a phone interview. The phone interview took about 10 min and was a very basic interview, no hard questions, essentially just fact checking, and at that point we set up an in-person interview with the office manager. The in-person interview consisted of the office manager and the lead medical assistant, they asked standard questions while looking at my resume. After the interview they showed me around the office to get an idea of the work environment. Two days after the in-person interview I was contacted again by HR to submit 5 references on an online form and to sign and fax a form in. Unfortunately, a little after a week I was emailed again informing me that they decided to move forward with another candidate.", "Interview Questions": "Why should we hire you, as a new graduate, versus someone with experience? What will you bring to the team?"}], [{"date": "25 Jun 2015", "title": "Research Assistant II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Beth Israel Deaconess Medical Center (Boston, MA) in Feb 2014", "Interview Descriptions": "I was contacted by HR after two weeks I applied online. I had an onsite interview with the members of the lab. It was fairly simple and to know if I had scientific community. Then a few weeks later, I was contacted again to meet with the PI. Was given the offer after few days and I accepted the offer. Negotiation not possible that much", "Interview Questions": "-Explain about previous work experience\r\n- what is your future plan."}, {"date": "11 Jan 2016", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Beth Israel Deaconess Medical Center (Boston, MA) in Feb 2014", "Interview Descriptions": "Easy interview. Met 1-1 with the head of the laboratory. We chatted for 20minutes about my experience and reasons I want to work there and he kept it very friendly and down to earth.", "Interview Questions": "Why do you want to work here?"}, {"date": "7 Jan 2014", "title": "Program Analyst Intern Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Beth Israel Deaconess Medical Center", "Interview Descriptions": "I was shown some data and asked my opinion, as well as the usual resume review.", "Interview Questions": "There weren't any difficult ones"}, {"date": "9 Nov 2014", "title": "Technician Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Beth Israel Deaconess Medical Center (Boston, MA) in Jan 2014", "Interview Descriptions": "Inventory Ctrl Mgr was a moron. Asked stupid non-relative questions. He even admitted that the work was long and tedious because of current staffing levels. The pay-scale equates to the of Burger King", "Interview Questions": "What color is your car?"}, {"date": "28 Jun 2017", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Beth Israel Deaconess Medical Center (Boston, MA) in Jan 2014", "Interview Descriptions": "They have clinical advisors interview and then staff interview after. The staff told me how the day to day goes better than the advisors. It was an easy going interview.", "Interview Questions": "how do I work in a team environment"}, {"date": "2 Jan 2014", "title": "Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Beth Israel Deaconess Medical Center in Nov 2013", "Interview Descriptions": "Met with a peer and the hiring manager.  Very helpful and positive process.  The hiring manager shared both challenges and advantages of working with the program.  Most questions focused on management style and how I have solved problems in the past.  The peer interviewer share a lot of information about the clinical practice and how services were organized.  I was also impressed that they let me know that I did not get the job.  So many organizations do not communicate results.", "Interview Questions": "Nothing unexpected or weird happened.  This was a very straightforward interview."}, {"date": "20 Jan 2016", "title": "Administrative Assistant, Human Subjects Protection Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. The process took 2 weeks. I interviewed at Beth Israel Deaconess Medical Center (Boston, MA) in Oct 2013", "Interview Descriptions": "The pre-interview process was pretty quick due to the need to fill role as soon as possible. When I came in, I met with all three of the team members at once. The group was incredibly friendly and the interview itself was fairly casual, probably no longer than a half hour.", "Interview Questions": "Are you proficient with Microsoft applications, particularly Powerpoint?\r\nAre you familiar with clinical research?\r\nAre you able to help with video/slideshow preparation?"}, {"date": "26 Sept 2013", "title": "Postdoctoral Research Fellow Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Beth Israel Deaconess Medical Center", "Interview Descriptions": "I interviewed directly with my lab PI as well as some members of the lab and key collaborators.\r\n\r\nThis included both email and phone interviews before being invited for in person interviews.", "Interview Questions": "There were none"}, {"date": "27 Sept 2013", "title": "Research Assistant Interview", "results": "No Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Beth Israel Deaconess Medical Center", "Interview Descriptions": "Applied online, a few weeks later I recieved a call to set up an interview. Had to drive to Boston, no option for skype or phone interivew. It was a single interview with the direct supervisor of the team, a current research assistant on the team, and the head doctor running the team.", "Interview Questions": "Why should we hire you, you only have a few months of experience working in this type of position?"}, {"date": "28 Jul 2013", "title": "Data Coordinator Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Beth Israel Deaconess Medical Center", "Interview Descriptions": "It was easy -- people were nice and friendly. A little bit stiff and non-conversational", "Interview Questions": "N/A"}], [{"date": "3 Mar 2016", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Beth Israel Deaconess Medical Center (Boston, MA) in Jul 2013", "Interview Descriptions": "Starts meeting with HR, which is fine however, now HR is offsite so you have to travel roughly 1.5 miles to get from where HR is to the main campuses. Then you must find your way around the campus without any real direction or a map, luckily staff is friendly and will always help. Questions were easy, however, job descriptions are very out of date so beware of what you are actually getting hired for.", "Interview Questions": "Are you willing and able to work hours outside of your schedule shift?"}, {"date": "13 Sept 2013", "title": "Senior Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Beth Israel Deaconess Medical Center (Boston, MA) in Jun 2013", "Interview Descriptions": "Phone interview with HR, in person interview with interviewee. Straight forward process, not many questions asked.", "Interview Questions": "Can you use SQL?"}, {"date": "20 Dec 2013", "title": "Clinical Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Beth Israel Deaconess Medical Center (Boston, MA) in Jun 2013", "Interview Descriptions": "It was quick, informative and simple. Be specific with relatable experiences during the interview.", "Interview Questions": "Where do you see yourself in ten years?"}, {"date": "13 May 2013", "title": "Clinical Nurse I Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 months. I interviewed at Beth Israel Deaconess Medical Center", "Interview Descriptions": "Got a call 2 months after submitted the application. Met with HR and answered 5 standard questions about HIPPA, pt safety, etc. Met with Nurse manager, nurse educator, and staffing coordinator. They did most of the talking, barely asked me any questions. Then I took a telemetry test.", "Interview Questions": "Lack of interest in my background/experience. They may not think it matters with new grads."}, {"date": "17 Apr 2013", "title": "Regulatory Specialist Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Beth Israel Deaconess Medical Center", "Interview Descriptions": "The company ask me to do an online assessment first. The assessment was consisted of personality test. Then I got no reply.", "Interview Questions": "What's the trap in an online assessment?"}, {"date": "8 Feb 2017", "title": "Clinical Research Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Beth Israel Deaconess Medical Center (Boston, MA) in Mar 2013", "Interview Descriptions": "Not tough. I had an employee referral. I sat down with the PI and then was circulated around to the research nurses and staff. No one was prepared with questions, so we just had impromptu conversations.", "Interview Questions": "Why do you want this job?"}, {"date": "27 Feb 2013", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 1 day. I interviewed at Beth Israel Deaconess Medical Center (Boston, MA)", "Interview Descriptions": "I was placed through a temp agency. After six months of temping for about $13/hour, I was called in for a meeting wherein I was interviewed for a full time permanent position.", "Interview Questions": "Can you commit at least five years to this position?"}, {"date": "16 Feb 2013", "title": "RN-STAFF NURSE Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. The process took 1 day. I interviewed at Beth Israel Deaconess Medical Center", "Interview Descriptions": "Tag teamed by two managers", "Interview Questions": "N/A"}, {"date": "24 Jul 2015", "title": "Clinical Nurse II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Beth Israel Deaconess Medical Center (Boston, MA) in Feb 2013", "Interview Descriptions": "You get email inviting you to an interview. You interview first with HR then with Nurse Manger. If you get an email requesting references, then you have got the job.", "Interview Questions": "Situational questions and what you would do."}, {"date": "25 Jan 2013", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Beth Israel Deaconess Medical Center", "Interview Descriptions": "I first met with HR. She talked about the unit and went over benefits as well as pay. I was able to negotiate a little there. After that she asked me some questions: regarding my personality and work experience. Then I went over to the unit to meet with the manager. I was again interviewed by her and another nursing staff. Then walked around unit and then went returned to HR. There we had a quick touch base and made plans for the next step in the hiring process.", "Interview Questions": "none"}], [{"date": "15 Jan 2013", "title": "Clinical Research Assistant Interview", "results": "No Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I interviewed at Beth Israel Deaconess Medical Center", "Interview Descriptions": "the interview lasted for about 2 hours. I met with multiple people. They were also polite, but asked a lot of questions, especially situational questions. Overall not to bad...", "Interview Questions": "Give me an example of how you would handle dealing with a dying patient?"}, {"date": "3 Jul 2016", "title": "Research Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Beth Israel Deaconess Medical Center (Boston, MA) in Oct 2012", "Interview Descriptions": "Talking to three supervisors and colleagues for 30 min each person. Taking a tour around the hospital and lab in Center for Life Science. Giving a presentation of my past research. Having lunch with the team and introducing each other.", "Interview Questions": "Why are you interested in this position?"}, {"date": "11 Aug 2016", "title": "Research Assistant I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Beth Israel Deaconess Medical Center (Boston, MA) in Oct 2012", "Interview Descriptions": "First I got  phone interview. phone interview last about 20mins. HR questions and skill questions were asked. 2 days after they ask for reference.After having reference check, 2 weeks later I got call for in person interview. Mostly Skill questions were asked from resume. interview last about 45mins. week  later I got offer.", "Interview Questions": "detailed questions from resume.\r\nWhy you want to work here?"}, {"date": "18 Jun 2015", "title": "IS Inventory Control Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Beth Israel Deaconess Medical Center (Boston, MA) in Jul 2012", "Interview Descriptions": "Phone interview followed by an interview with HR rep then another interview with a hiring manager. Straight forward interview and the questions mainly focused on IT skills with some situational questions.", "Interview Questions": "How tech savvy would you describe yourself to be?"}, {"date": "18 Sept 2013", "title": "Research Associate II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 2 months. I interviewed at Beth Israel Deaconess Medical Center (Boston, MA) in Mar 2012", "Interview Descriptions": "Was invited to come to the lab twice and was asked to do a project.", "Interview Questions": "I had to do a project on Bioinformatics for NGS analysis"}, {"date": "8 Oct 2016", "title": "Receptionist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Beth Israel Deaconess Medical Center (Boston, MA) in Mar 2012", "Interview Descriptions": "Lots of questions, with detail to response and verbal tone. Critical thinking was also assessed. Interacting with others were one of the main focus, as how you respond to a aggravated customer.", "Interview Questions": "Why did I have to contribute different to other candidates"}, {"date": "27 Dec 2015", "title": "Pulmonary Function Technician Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Beth Israel Deaconess Medical Center (Boston, MA) in Dec 2011", "Interview Descriptions": "I applied for this job awhile ago.  But from what I remember I applied online and it basically was a matter of waiting to hear back.  It really did not take too long and they brought me in for an interview reasonably quickly.  Once meeting the manager he basically offered me the job on the spot and since it was my first job out of college I took it", "Interview Questions": "Why are you applying for this position?"}, {"date": "22 Jun 2015", "title": "Registered Dietitian Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Beth Israel Deaconess Medical Center (Boston, MA) in Sept 2011", "Interview Descriptions": "I met with the nutrition director and answered a few questions regarding my past experience and future goals. Then I met with the RDs on staff that day who also asked questions: about my hobby's, prior experience, what I was hoping to bring to the job. I was then asked to complete a short case study regarding nutrition support. I had to come up with a tube feed goal based on scenario provided and then answer follow up questions if there were tolerance issues with the tube feed regimen previously recommended.", "Interview Questions": "How many patients am I used to seeing/day. How many on nutrition support? How comfortable was I doing tube feeds? TPN? TPN electrolytes? Had a been a preceptor to a dietetic intern before?"}, {"date": "9 Sept 2014", "title": "Classified Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Beth Israel Deaconess Medical Center in Jul 2011", "Interview Descriptions": "the process was pleasant with knowledgeable people that understood the position and the skill set and requirements of the position\r\n\r\nthe process was pleasant with knowledgeable people that understood the position and the skill set and requirements of the position", "Interview Questions": "N/A"}, {"date": "28 Sept 2011", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Beth Israel Deaconess Medical Center (Boston, MA) in Apr 2011", "Interview Descriptions": "Great interview process", "Interview Questions": "Past experience"}], [{"date": "24 Feb 2011", "title": "Research Assistant Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Beth Israel Deaconess Medical Center (Boston, MA) in Feb 2011", "Interview Descriptions": "I had the first phone interview with a hiring manager at 9:40pm. I was totally unprepared as it was late at night and I was not expected the phone call. The interview last about 20 minutes. The hiring manager asked me to introduce myself, talk about my education background and my research experience, toward the end of the interview he took a little bit of time to explain his research area. Two days later, I heard from HR, they want to schedule an face to face interview. There is not much in the face to face interview. The hiring manager recapped on what we had talked on the phone and explained a little bit more on his research area. The interview only took about half an hour long.", "Interview Questions": "What is your limitation? "}, {"date": "4 Nov 2013", "title": "Administrative Coordinator Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. I interviewed at Beth Israel Deaconess Medical Center (Boston, MA) in Nov 2010", "Interview Descriptions": "Very unprofessional, director talked about previous employee rather than asking me questions", "Interview Questions": "none. I don't even recall a question about me."}, {"date": "1 Mar 2012", "title": "Finance Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 2 weeks. I interviewed at Beth Israel Deaconess Medical Center (Boston, MA) in Jun 2010", "Interview Descriptions": "Very simple. After a phone conversation with recruiter, met with hiring manager. Basic questions about background and experience. Tell me about a time...After a week I was schedule to meet with 4 managers on one-on-one sessions. Again, very basic about previous experience and how it could relate to the position. After a week of waiting I was offered the position.", "Interview Questions": "Tell me about a previous project you are proud of?"}, {"date": "10 May 2011", "title": "Clinical Research Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Beth Israel Deaconess Medical Center (Boston, MA) in Jun 2010", "Interview Descriptions": "I interviewed with five different people for one hour each.  The departments I met with were proffesional.  The human resources person I worked with was very dissapointing.  She knew nothing about research, insulted me at the interview, and then insulted me when she offered me the job.  I know other representatives of the human resources department who are excellent, but this one person is unproffesional and gives the company a bad reputation.", "Interview Questions": "N/A"}, {"date": "27 Apr 2011", "title": "Administrative Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Beth Israel Deaconess Medical Center (Boston, MA) in Jan 2010", "Interview Descriptions": "3 interviews then offer", "Interview Questions": "N/A"}, {"date": "3 Mar 2010", "title": "Technical Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Beth Israel Deaconess Medical Center (Boston, MA) in Aug 2009", "Interview Descriptions": "Recruiter contacted me for the interview process. Was interview by the application architect and the team.", "Interview Questions": "How do you rate yourself in the technology?"}, {"date": "20 Jul 2010", "title": "Research Assistant I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Beth Israel Deaconess Medical Center (Boston, MA) in Feb 2008", "Interview Descriptions": "the interviewing process was fairly simple and cordial. I met what would be my immediate supervisor for an hour, which followed meeting people I would be working with, and it concluded with meeting the uber boss. Everyone was quite honest of what the job entails, what the benefits were like, possibility of career growth, etc. I did not have at all contact with HR, minus when I actually signed the contract, so the entire interview process was done with my immediate boss.", "Interview Questions": "All questions that I was asked pertained to technical aspect of the job. I was asked about PCR, AFLP, cloning, DNA/RNA isolation, culturing - everything that was written in my resume and that one would know if he/she had done in the past."}, {"date": "22 Mar 2009", "title": "Clinical Research Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Beth Israel Deaconess Medical Center (Boston, MA) in Oct 2007", "Interview Descriptions": "I met with seven different people during the afternoon.  One was a group of three individuals. After the interview, they called me said that they wanted to hire me and put me in touch with HR, but then never made a formal offer.  The HR person later informed me that they had actually given the job to a different candidate.  My advice is to wait for a formal offer before assuming that the job is yours.", "Interview Questions": "Why do you want to work here?"}]]