[[{"date": "16 Feb 2022", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at AMITA Health", "Interview Descriptions": "Seamless. Recruiter was helpful. Ask usual questions. Follow up from recruiting to interview was quick. Interview with manager was online due to covid... but it was personal and good back and forth communication.", "Interview Questions": "Talk about a time a patient was unhappy and how did you handle it? "}, {"date": "1 Mar 2022", "title": "Behavior Technician Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at AMITA Health (Chicago, IL) in Feb 2022", "Interview Descriptions": "Did not let me finish answering her questions during interview, felt informal and rushed. Explained position thoroughly and offered multiple locations. The company itself is widely known and interviewers could vary based on location and job position", "Interview Questions": "Name a time where you were in a position to lead a group and how did you accomplish that "}, {"date": "16 Jan 2022", "title": "Phlebotomist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at AMITA Health", "Interview Descriptions": "Met directly with the Lab Manager who asked some technical questions. It was a pleasant experience. The pay scale for a new graduate, even ASCP certified displayed a lack of consideration.", "Interview Questions": "Fundamental technical questions a Technician should know along with personal questions regarding goals, other experience and personality."}, {"date": "26 Jan 2022", "title": "Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at AMITA Health (Chicago, IL) in Jan 2022", "Interview Descriptions": "Had a phone interview scheduled with a recruiter. She seemed in a hurry, or they had already decided to go with a different candidate.   She explained the positing, asked me if I was experienced enough for it or not, and what my pay expectations were. AMITA Health has an excellent reputation, but I was disappointed this time as I was well qualified for the position and didn't even get a proper chance to get interviewed by the recruiter", "Interview Questions": "I was only asked one question about what my Salary Range was. "}, {"date": "3 Nov 2021", "title": "Patient Service Representative Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at AMITA Health (Glendale Heights, IL) in Nov 2021", "Interview Descriptions": "My interview today went well with the coordinator. I didn't feel nervous at all, from her making me feel welcomed. Our conversation went fluently. And I loved that she went over all the information I needed to know about the position.", "Interview Questions": "How did you find this job position? How do you stay organized? Tell me a scenario on how you would respond to an irate customer. How did you like working in your past work experience?"}, {"date": "19 Aug 2021", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at AMITA Health", "Interview Descriptions": "The interview process went smoothly. The process from the date I submitted my application to the day I got contacted back for an interview took about five to seven days", "Interview Questions": "Tell me about yourself ?"}, {"date": "19 Oct 2021", "title": "Executive Director Tech Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at AMITA Health in Aug 2021", "Interview Descriptions": "Two days after applying, I was contacted by an HR recruiter and set up a phone interview with her.  On the phone, she clarified the position I was looking for, my availability, and mentioned the days I would need to be available for orientation.  The entire conversation lasted about fifteen minutes.", "Interview Questions": "Tell me about a time you experienced conflict with a coworker."}, {"date": "30 Jun 2021", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at AMITA Health", "Interview Descriptions": "While this was one of the most challenging interviews I've had, I really appreciated that the interviewer took the time to read my resume and tailor her questions towards my education and experience.", "Interview Questions": "Questions were specific to my resume. Very few standard questions."}, {"date": "21 Jun 2021", "title": "Sonographer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at AMITA Health", "Interview Descriptions": "Very easy. She asked traditional interview questions. Recruiter was easy to talk to and answered all the question I had. I heard from her shortly after applying. Then I had my second interview four days after.", "Interview Questions": "Tell me about yourself  and experience. "}, {"date": "2 Jun 2021", "title": "ICU RN Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. I interviewed at AMITA Health", "Interview Descriptions": "Telephone communication with recruiter and set up in person interview. I was a transfer from a different unit, very simple process. Just had to apply for role via website and interview with manager of my current floor", "Interview Questions": "Why do you want to transfer to this unit"}], [{"date": "6 Jul 2021", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at AMITA Health (Joliet, IL) in Apr 2021", "Interview Descriptions": "I had a phone interview. It was supposed to be a Google Meet, but that didn't work out so I called in. I actually talked to a recruiter first and then she set up an appointment for me to talk the hiring manager.", "Interview Questions": "Are you a team player?\nHow are you under pressure?"}, {"date": "29 Apr 2021", "title": "Radiologic Technologist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at AMITA Health (Hinsdale, IL) in Apr 2021", "Interview Descriptions": "I received an email from Amita health to schedule my phone interview. Once I received the call they were very nice and straight to the point. We went over my resume and talked about future goals.", "Interview Questions": "What were my Qualifications ?"}, {"date": "25 Feb 2021", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at AMITA Health", "Interview Descriptions": "Easy to answer questions, went prepared with resume. Discussed past experience, comfortable environment, friendly employees, very simple process does take some time to hear back though. Would recommend being prepared", "Interview Questions": "Past work experience in this industry "}, {"date": "2 Mar 2021", "title": "New Grad Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at AMITA Health (Chicago, IL) in Feb 2021", "Interview Descriptions": "I interviewed at Resurrection Medical Center for float pool. Both HR and my interviewer were very nice and made me feel comfortable. They asked me about my preferences for units and hospitals before they interviewed me.", "Interview Questions": "Tell me about yourself\r\nHow do you handle conflict?"}, {"date": "26 Jan 2021", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at AMITA Health", "Interview Descriptions": "Interviewed with the Director and Manager of the unit for about 30 minutes. I sat and spoke with the unit manager first where she asked me questions regarding my interest to the unit, my past experiences, etc. Then I was able to speak with the Director. After their given questions, i was able to ask them any questions I had. Was given a tour of the floor, introduced to the day shift charge nurse.", "Interview Questions": "Why did I choose to apply to the unit?"}, {"date": "15 Jan 2021", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at AMITA Health", "Interview Descriptions": "First I was reached out through phone by HR, that went pretty smooth. Couple of easy questions. Then the next step is interview with hiring manager. That can last anywhere between 30-1 hr.", "Interview Questions": "How your values align with Amita?"}, {"date": "8 Jan 2021", "title": "Registred Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at AMITA Health", "Interview Descriptions": "The interview process was not difficult at all, the recruiter it very easy to connect with the hiring leader and assist with moving along with the hiring process, basic questions, motivation to apply, where do you see yourself in 5 years.", "Interview Questions": "where do you see yourself in 5 years"}, {"date": "25 Jan 2021", "title": "Registered Nurse Position Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at AMITA Health (La Grange, IL) in Jan 2021", "Interview Descriptions": "Started with a general overview of the program and began asking background questions. Very laid back interview and very thoughtful questions. It was a video interview that lasted about 30 minutes.", "Interview Questions": "Why would you be a good fit to our team?"}, {"date": "3 Dec 2020", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at AMITA Health", "Interview Descriptions": "I had a great interviewer who was very knowledgeable and asked good questions! No weird curveballs, and an overall great experience. She explained so much about the job and made me feel comfortable.", "Interview Questions": "How would a coworker describe you "}, {"date": "3 Dec 2020", "title": "Physical Therapist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at AMITA Health", "Interview Descriptions": "Applied online via their web site. Received email to set up a time for a phone interview/ phone screening. On the coordinated date, HR person called and did a brief interview.", "Interview Questions": "ANITA's values. How would you incorporate them as a physical therapist?"}], [{"date": "29 Jun 2021", "title": "Managing Director of Imaging Services Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at AMITA Health (Joliet, IL) in Dec 2020", "Interview Descriptions": "I had 4 separate interviews - meeting with the radiologist was the most awkward. He wasn't prepared and thought he was interviewing someone from a different state.\nSpeaking with the COO was very enlightening and comfortable.", "Interview Questions": "How will you follow the mission and values of the organization?"}, {"date": "7 Oct 2020", "title": "Float Pool RN Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at AMITA Health (Chicago, IL)", "Interview Descriptions": "I applied online on their website in November 2019 and received an email for a phone interview with a recruiter in December 2019. Scheduled an in person interview with the manager of Float Pool in January. The manager was extremely rude and unprofessional. She spoke negatively of the school that I went to.", "Interview Questions": "What salary are you seeking?"}, {"date": "24 Sept 2020", "title": "Central Scheduler Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at AMITA Health", "Interview Descriptions": "Very nice phone interview due to covid. Told me information about amita and asked typical questions during an interview. My interviewer was super friendly and calm. Made me feel relaxed and comfortable.", "Interview Questions": "Describe a time you dealt with an upset patient?"}, {"date": "27 Oct 2020", "title": "Registered Nurse, BSN Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at AMITA Health in Oct 2020", "Interview Descriptions": "The interview started off with a description of the job. The interviewer asked a couple of questions about my background and active licenses and certifications. This was then followed by the official interview.", "Interview Questions": "Why did you apply for this facility?\nWhy did you apply for this job?\nHow would you handle a difficult patient?\nHow would you deal with a difficult coworker?"}, {"date": "30 Sept 2020", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at AMITA Health (Chicago, IL) in Aug 2020", "Interview Descriptions": "it was fast. called day before got extended the job offer a day after. HR manager was really prompt. was very on time and prompt. very accommodating, no complains here", "Interview Questions": "situational questions were the majority asked"}, {"date": "30 Nov 2021", "title": "Mental Health Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at AMITA Health (Chicago, IL) in Aug 2020", "Interview Descriptions": "Thorough, fair. Asked about previous experience, crisis situations, ability to work evening or weekend hours. Discuss importance of commitment to underserved populations. Unable to discuss salary during interview with manager", "Interview Questions": "How do you handle a crisis? "}, {"date": "13 Apr 2020", "title": "Nurse Practitioner Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at AMITA Health", "Interview Descriptions": "The interview process was formal without being intense. The questions were fairly typical for this type of position. The interview lasted about 45 minutes total including a tour of the facility.", "Interview Questions": "Why do you want to work for AMITA Health?"}, {"date": "4 May 2020", "title": "Pct Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at AMITA Health (Bolingbrook, IL) in Apr 2020", "Interview Descriptions": "Applied online. Received an email a few days later to set a phone interview with the recruiter. After the call with the recruiter, the recruiter called back a few hours later to set an interview with the hiring manager. Heard back from the recruiter 3 business days later with the offer and orientation date. All basic interview questions.", "Interview Questions": "What is the mission of AMITA and how will you carry it out in your position?"}, {"date": "29 May 2020", "title": "Registered Nurse, BSN Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at AMITA Health (Chicago, IL) in Mar 2020", "Interview Descriptions": "The interview was obtained through a partnership with my school. We signed up for interview slots and had a skype call with a unit manager (randomly). The manager was very nice and honest about the process, which she said could take weeks due to pandemic.", "Interview Questions": "Can you tell me the worst and best days in your previous roles?"}, {"date": "9 Jan 2020", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at AMITA Health in Jan 2020", "Interview Descriptions": "I applied online through glassdoor, and received an email several days later stating they'd like a phone screen/interview. I selected the phone interview 2 days from reading the email. I selected 230pm and anxiously waited by the phone.. time went by and still no call after 36 minutes. Typically a phone interviewer will call only a few minutes past the selected time but not more than 10 minutes late? This shows that the recruiters are irresponsible or unprofessional in managing interviews.", "Interview Questions": "Did not have the opportunity to be spoken to."}], [{"date": "13 Oct 2021", "title": "BHA Staff Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at AMITA Health in Jan 2020", "Interview Descriptions": "It was a lot of scenario questions, they give you a tour and you will get to meet unit staff. You interview with two people, a manger and lead staff", "Interview Questions": "How would you handle a physical altercation on the unit?"}, {"date": "24 Jan 2021", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at AMITA Health (Chicago, IL) in Oct 2019", "Interview Descriptions": "I applied on the company website. Initial interview over the phone with a recruiter. Then interview with the manager. Then interview with charge RN and a couple of staff RNs.", "Interview Questions": "Why do you want to work here?"}, {"date": "5 Oct 2019", "title": "Health Director Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at AMITA Health in Sept 2019", "Interview Descriptions": "It was the shortest interview I have ever had! A 13 minute phone interview, & quite honestly, I couldn't wait to get off the phone because Jayna, who  interviewied me had an extremely annoying interviewing voice, with a very odd, intentional pitch & condescending tone.\r\n\r\nShe didn't sell the company to me, & almost seemed annoyed at having to interview me.\r\n\r\nThe reason I know I didn't get the job is because they re-posted the add four days later.", "Interview Questions": "Something about being a christian."}, {"date": "18 Nov 2021", "title": "Customer Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at AMITA Health in Sept 2019", "Interview Descriptions": "fairly simple. If you are the right fit for the job you will be able to answer all questions they ask. It was about 30min long. I really felt like I would like working there.", "Interview Questions": "Why are you a good fit?\r\nHave you had other client facing jobs? How did you enjoy it?"}, {"date": "26 Aug 2019", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at AMITA Health", "Interview Descriptions": "Recruiter called a few weeks after I applied and asked about education, experience and license status. At the end of the call they set up my first in person interview with the nurse manager. Recruiter called again a few hours after my interview to set up a peer interview. Recruiter called the day after my peer interview to offer me the position.", "Interview Questions": "Why this department?"}, {"date": "14 Aug 2019", "title": "Registered Nurse Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at AMITA Health", "Interview Descriptions": "Was called for a phone interview. Advanced to an in person interview. They asked basic questions such as tell me about yourself, why nursing, tell me a time you went above and beyond. Atmosphere was strange", "Interview Questions": "Tell me a time you had conflict with a coworker"}, {"date": "28 Apr 2019", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at AMITA Health", "Interview Descriptions": "Got a call a week after I applied. Two phone interviews a week apart, one with the recruiter and another with the unit manager. They asked the same generic questions, and the calls lasted about 15 to 20 minutes long straight to the point.", "Interview Questions": "weakness? strengths?"}, {"date": "12 Jun 2019", "title": "Step-Down RN Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at AMITA Health (Hinsdale, IL) in Apr 2019", "Interview Descriptions": "Submitted an application online. \r\nTwo weeks later I was contacted via email by a recruiter to set up a phone interview. Pretty standard: strengths, weaknesses, mission, vision, etc. Lasted about 30 minutes. \r\n\r\nScheduled an interview with the nurse manager the following week.  I was told by the manager that there was only one position available, and unfortunately, they were making an offer to an internal candidate, who was unlikely to turn it down.", "Interview Questions": "Like the other reviews on here - Be sure to know the mission and vision of the hospital."}, {"date": "23 Mar 2019", "title": "Front Desk Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at AMITA Health", "Interview Descriptions": "Phone interview was very unfriendly, blunt, and short. It just felt like they had already picked a candidate that they already wanted before my interview was scheduled. Really pointless to call someone if you're not at all interested in actually engaging with them.", "Interview Questions": "They asked me what I thought their mission statement meant and how I would use this daily at work "}, {"date": "19 Mar 2019", "title": "Process Improvement Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 4 weeks. I interviewed at AMITA Health (Aurora, IL)", "Interview Descriptions": "Received a phone screening call from HR, quick 20-30 minute conversation with HR, invited for a onsite interview, and received offer in 1 week. Process took 3-4 weeks total. Shortly after receiving the offer background check, drug test, pre-employment related activities required before start date.", "Interview Questions": "Dealing with difficult patients"}], [{"date": "30 May 2022", "title": "Social Worker Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at AMITA Health in Feb 2019", "Interview Descriptions": "Enjoyed the process would definitely recommend applying if I saw anything that I may be qualified for in the future. I was able to meet some current staff that were friendly as well", "Interview Questions": "What is your work style?"}, {"date": "14 Dec 2018", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at AMITA Health", "Interview Descriptions": "Phone interview with HR rep is first.  Next is the face to face interview with department head, followed by a peer interview.  HR will call you with an offer if your are selected.  Upon accepting the offer, you are scheduled for your pre-employment screening.  This will include a fit test, flexibility and strength test (picking up 50 lbs off the ground using proper lifting technique), and drug screen.  This is also when you would turn in any proof of vaccinations and/or titers.", "Interview Questions": "If you could choose an animal that best describes you, which animal would it be?"}, {"date": "23 Jan 2020", "title": "Leadership & Org Dev Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at AMITA Health in Dec 2018", "Interview Descriptions": "Process lasted about two weeks between initial interview and hiring. Call with TA, phone call with hiring manager, and final in person interview with VP, hiring manager, and team member.", "Interview Questions": "What is your methodology for organization and preparation?"}, {"date": "1 Nov 2018", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 6 weeks. I interviewed at AMITA Health (Hinsdale, IL)", "Interview Descriptions": "Met a recruiter at a job fair. She took my resume, interviewed me over the phone, then scheduled an interview for me with the director of critical care at Hinsdale. Experience was pleasant. After we chatted, she sat me down with a PCU and ICU clinical coordinator for the peer evaluation. Afterwards I received a reference check and was offered a position. Pretty seamless.", "Interview Questions": "Strengths and weakness?\r\nTalk about a policy you didn’t like and what you did?\r\nTalk about a time you had difficulty with a co-worker. "}, {"date": "10 Oct 2018", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at AMITA Health", "Interview Descriptions": "I applied online for the la grange location. I scheduled a phone interview. It was about 7-10 minutes long. The important thing to know is that they will ask about their mission statement. They will ask how you will \"embody\" their mission and values. I read from posts on glassdoor about that so I was ready for the questions about the mission statement. I got a rejection email the next day.", "Interview Questions": "what are my weakness?"}, {"date": "11 Sept 2018", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at AMITA Health", "Interview Descriptions": "I applied online got an email to schedule a phone interview 30 min long. I scheduled it for a week later. The phone call was 7 minutes long. I got a rejection email the next day.", "Interview Questions": "Why cardiology unit? "}, {"date": "9 Aug 2018", "title": "CNA Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at AMITA Health", "Interview Descriptions": "Short, the person didn’t ask too many questions. They got straight to the point. Somewhat professional. Offered job right on the spot. Wasn’t too thrilled with the company and how they did things. CNAs go unnoticed too much and it’d be great to have some apprection every once in awhile.", "Interview Questions": "How are you in stressful situations? "}, {"date": "29 Mar 2018", "title": "Insurance Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at AMITA Health (Chicago, IL)", "Interview Descriptions": "Had phone interview with recruiter. Recruiter was really nice, asked your typical interview questions. I hope my info gets forwarded over to hiring manager for an on-site interview I will definitely post an update if opportunity for an interview arises.", "Interview Questions": "What are your salary expectations?"}, {"date": "19 Jul 2018", "title": "Patient Care Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 1+ week. I interviewed at AMITA Health in Mar 2018", "Interview Descriptions": "I first applied online and then was called for a phone interview. They asked my why I wanted to work there. Then we scheduled a formal interview with the floor with the floor manager. Then they sent me to a peer interview directly after.", "Interview Questions": "A time I went above and beyond for a patient"}, {"date": "20 Mar 2018", "title": "Marketing Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at AMITA Health in Jan 2018", "Interview Descriptions": "Was contacted by the recruiter 2 weeks after applying. Had a phone screen the following week. I followed up with the recruiter a week later, but never received a response. When I called the HR line they told me I was still being considered. Over the next few weeks, I followed up with the recruiter a few more times, but never received a response. This lack of communication reflects poorly on AMITA's employer brand.", "Interview Questions": "The recruiter read AMITA's mission statement and asked me how I fit their mission."}], [{"date": "13 Sept 2017", "title": "Staff RN Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at AMITA Health (Hinsdale, IL) in Sept 2017", "Interview Descriptions": "Was contacted via email 2 days after submitting an application to set up a phone interview. The phone call arrived on time and the interviewer from HR asked basic questions . We only spoke for 7 minutes. Was told the information would be forwarded to the unit director and they would decide if they would want an in person interview or not. Received an email the following day saying they were pursuing other candidates.", "Interview Questions": "Why are you interested in working for this group?"}, {"date": "26 Feb 2019", "title": "Pct Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at AMITA Health (Hoffman Estates, IL) in Oct 2017", "Interview Descriptions": "I first received a call and had a phone interview and then I met with the assistant unit director for 1;1 interview. It was a very laid back interview and I heard back from the recruiter the next day with the job offer.", "Interview Questions": "situational question and what my future goals are"}, {"date": "13 Oct 2017", "title": "Representative Registration Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at AMITA Health in Oct 2017", "Interview Descriptions": "I applied for it Oct 6 - got an email back within hours . Had phone interview . Pretty easy but didn't get the job since I didn't know what to say about the mission statement.", "Interview Questions": "in your words what does mission statement mean to you ?"}, {"date": "17 Oct 2017", "title": "Folk Lift Operator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at AMITA Health (Columbia, SC) in Oct 2017", "Interview Descriptions": "I went in a room with a women. She explained the jobs that she had open and what the qualifications were. At the end of the interview, she informed me that I did qualify for the position", "Interview Questions": "Do I have a high school diploma"}, {"date": "7 Jan 2018", "title": "Mental Health Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at AMITA Health (Hoffman Estates, IL) in Aug 2017", "Interview Descriptions": "The head of the department and a senior counselor. We had nice discussion regarding the job and the responsibilities.\r\nIt began with a phone screening with HR and then a in person interview with the head of the department.", "Interview Questions": "How do you feel about people ( clients) getting angry or even violent towards you . "}, {"date": "26 Jul 2017", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at AMITA Health", "Interview Descriptions": "I applied online and about two weeks later I was emailed for a requested phone interview. The recruiter and I spoke for 30 minutes and then I was contacted two weeks later to schedule an in person  interview.", "Interview Questions": "How will you apply the mission and vision of AMITA in your everyday work?"}, {"date": "31 Aug 2017", "title": "Director of Operations Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. The process took 4 weeks. I interviewed at AMITA Health (Milwaukee, WI) in Aug 2017", "Interview Descriptions": "Well done I loved the mission and values of the organization and they have a wonderful culture of carrying for people. I was  impressed by the people and the genuine feeling that is there.", "Interview Questions": "How could your values help our organization"}, {"date": "1 Sept 2021", "title": "Sleep Technologist RPSGT Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at AMITA Health (Elk Grove, IL) in Jul 2017", "Interview Descriptions": "Phone interview first with a few standard questions.  Second interview was with the dept manager and lead tech.  I was asked what I like to do outside of work and if I’m a team player.", "Interview Questions": "Phone interview I was asked describe a time you had a difficult situation and how was it resolved."}, {"date": "1 Sept 2017", "title": "RN Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at AMITA Health (Chicago, IL) in Jun 2017", "Interview Descriptions": "The interview was over the phone and it was 30 minutes long. The interviewer started with basic questions about my license and experience and then asked my thoughts on the mission statement. The interview was easy and the interviewer was very polite and talkative.", "Interview Questions": "What do I think that the mission statement is stating?"}, {"date": "7 Jun 2017", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at AMITA Health", "Interview Descriptions": "Interviewed with HR over the phone, then with the manager at the hospital, then with a few staff nurses. The nurses on the floor asked me about my experience, why i want this job,  and what im looking for in a job.", "Interview Questions": "Tell me about a time when you had to work in a team and how you accomplished a goal together."}], [{"date": "26 Mar 2019", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at AMITA Health (Chicago, IL) in Apr 2017", "Interview Descriptions": "very informal and relaxed. Some technical questions just to see how you answer. Also questions on how you delegated tasks in the past. How you have handled a troublesome coworker. How you handled any mistakes. all in all the manager is trying to see if you're a team player and a good fit for the unit. The interview took less than 1 hour and everyone was very nice. cost of parking was covered. a tour of the unit was provided and there was plenty of time for questions", "Interview Questions": "what school did you graduate from?"}, {"date": "23 Jan 2017", "title": "Patient Access Representative Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at AMITA Health (Chicago, IL)", "Interview Descriptions": "Simple interview with manager and second interview with supervisors. Asked basic questions, strongest/weakest traits, tough challenge that was overcome, etc. The idea of working odd hours, weekends was mentioned numerous times.", "Interview Questions": "Asked basic questions, strongest/weakest traits, tough challenge that was overcome, etc. "}, {"date": "7 Jun 2017", "title": "Pharmacist Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at AMITA Health in Dec 2016", "Interview Descriptions": "Received an email about scheduling a phone interview one day after I submitted an online application.  I followed the instruction on the email, was not able to schedule online, so I contacted the phone number on email regarding to this issue, but didn't hear back from them at all. I eventually called the number again, and got scheduled for a phone interview.  Somehow I didn't receive a phone call on the scheduled day, had to call the same number again to reschedule (later on that evening, I received an email about \"sorry we missed you\").  Recruiter on the phone was not professional at all, plainly read out from her script, and when I asked about her experience, she said \"it was good\".", "Interview Questions": "Where did you find about this position?"}, {"date": "21 Dec 2016", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at AMITA Health (New York, NY) in Dec 2016", "Interview Descriptions": "I applied online. Called by HR 3 days later and had an easy impromptu phone interview - very general questions about interests and experiences. Scheduled an in-person manager interview for the next week. Manager interview was very informative and felt like a good flow of conversation rather than a strict interview. Scheduled a peer interview for a few days later. Peer interview was also very friendly and questions weren't difficult, just required some reflection. Got a call from HR with an offer a few hours after my peer interview. The process was very fast and efficient!", "Interview Questions": "Why do you want to work at this hospital? Why do you want to work in this unit? What would your friends say are good things about you? Describe a time you had to deal with a difficult patient/co-worker/etc. Tell us about a time you didn't agree with a new rule at work and what did you do about it? "}, {"date": "24 Jan 2017", "title": "Billing Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at AMITA Health (Elk Grove Village, IL) in Nov 2016", "Interview Descriptions": "It was very simple and straightforward. I had a small interview with the recruiter on the phone. In a week I got an interview request. I had interview with the manager on site and than one week later I got the offer.", "Interview Questions": "Why do you want to work with us?"}, {"date": "13 Sept 2016", "title": "Senior Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at AMITA Health", "Interview Descriptions": "typical interview with easy questions and explaining job expectations. hr called first with questions then got a call from the manager and met with her to interview. received an offer about 5 days later from hr. easy.", "Interview Questions": "describe how you handle conflict with a co worker"}, {"date": "2 Jun 2017", "title": "Nutrition Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at AMITA Health (Arlington Heights, IL) in Jul 2016", "Interview Descriptions": "Interview was serious business type, less of a discussion more of a drill. Interviewers were great at connecting, especially towards end. Mostly felt as though I was being judged instead of interviewed for a job I was more than qualified for.", "Interview Questions": "What experience can you bring to this position?"}, {"date": "23 Aug 2016", "title": "Physical Therapist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at AMITA Health (Elk Grove, IL) in Jul 2016", "Interview Descriptions": "searched for and found position online, completed online application process, received call from HR recruiter with (former) Alexian Brothers Health System (current) AMITA Health, discussed job interests and experience, she gave my info to the hiring managers and then scheduled an in person interview, had interview with hiring manager and lead physical therapist", "Interview Questions": "nothing out of the ordinary"}, {"date": "27 Apr 2016", "title": "Service Line Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. I interviewed at AMITA Health (Milwaukee, WI)", "Interview Descriptions": "3 Phone and Skype interviews by recruiters, including 2 partners in the firm. Onsite interview with 3 execs at Aurora.  All very capable and progressive leaders who asked great questions, and got to know my skills as a candidate.", "Interview Questions": "Tell me about your experience around this role"}, {"date": "31 May 2017", "title": "Senior Systems Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at AMITA Health (Arlington Heights, IL) in Nov 2015", "Interview Descriptions": "It was a 2 phase approach. One was a phone call , with an HR screener and then in-person. In person was with a Director and team member together.  The interview was about 1 hour long, very conversational about past work experiences.", "Interview Questions": "How do you handle ambiguity?"}], [{"date": "22 Mar 2017", "title": "Cancer Registry Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at AMITA Health (Hoffman Estates, IL) in Nov 2014", "Interview Descriptions": "I applied online and heard back MONTHS later. It took so long that I could not even remember what job I applied for.  Luckily I was still looking for a position. I had a brief phone screening with HR & then had a face to face interview with whom would be my boss. The interviewer was reading from a sheet of paper with questions on it.  All scenario type questions, which I think is a very outdated style and not very personable.", "Interview Questions": "Tell me a time when you disagreed with a coworker."}, {"date": "8 Oct 2017", "title": "Sales Associate/Cashier Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 9+ months. I interviewed at AMITA Health (Miami, OK) in Aug 2014", "Interview Descriptions": "relocated upstairs to do in a phone booth to carry out sales product for the men section. also provide information on back round check to see if i qualified for the job.", "Interview Questions": "have I worked before in sales industry . "}, {"date": "24 Sept 2015", "title": "Pct Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 5 days. I interviewed at AMITA Health (Hoffman Estates, IL) in Jul 2014", "Interview Descriptions": "the hiring process was quick and relatively easy, I was immediately contacted after submitting my resume. The process of orientation was long though, there was one week of hospital orientation which is paid, but you learn about all the other departments. And then there was 3 weeks of guided orientation on the unit I would be working on.", "Interview Questions": "I was asked about situational stuff on the floor and how I would handle it"}, {"date": "11 Apr 2017", "title": "EMR Analyst Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at AMITA Health (Arlington Heights, IL) in Jul 2014", "Interview Descriptions": "Asked mostly questions about my background and not so much about skill fit for the job I would eventually be doing. I wasn't really asked any questions that I perceived as behavioral questions. One of my interviewers verbally stumbled and got embarrassed and shutdown for the remainder of the interview.\r\n\r\nI found it odd that they didn't ask for college transcripts and only required a photo copy of you college diploma; That struck me as a really bad practice.", "Interview Questions": "What would you do if you couldn't use a certain technology that's readily available, but blocked by our parent company's (Ascension Health) policy."}, {"date": "30 Sept 2016", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. I interviewed at AMITA Health (Hoffman Estates, IL) in Apr 2012", "Interview Descriptions": "I went to a job fair and handed her my resume and expressed my areas of interest. Then I was called for an interview so I Met with the recruiter, then the management team, and lastly had a peer interview.", "Interview Questions": "Tell us about yourself and your experiences"}]]