[[{"date": "6 Apr 2023", "title": "Technical Advisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 4 weeks. I interviewed at CNFA (Washington, DC) in Nov 2021", "Interview Descriptions": "I went through a phone screening and then for second round, to a three person panel. The panel was comprised of two division leads for the programming departments and then the hiring manager - the senior agribusiness advisor. The two department leads were a joy to talk to, ask situational questions. The hiring manager was extremely negative and I could tell would be a bad manager, he corrected me during the interview itself. He seemed like he belonged in investment banking instead of nonprofit.", "Interview Questions": "Tell me about yourself Tell us how you’d contribute to this technical area for the company"}, {"date": "23 Aug 2020", "title": "Program Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at CNFA", "Interview Descriptions": "Single video interview, very traditional questioning, overall enjoyable experience. Interviewer was kind, passionate and straightforward. Seems like a great organization to be apart of. Thorough knowledge of organization and position functions will be beneficial.", "Interview Questions": "Sample question - why do you want to work for CNFA"}, {"date": "21 Jul 2017", "title": "Lead Technical Writer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied through a recruiter. I interviewed at CNFA", "Interview Descriptions": "I was referred to the job through a recruiting firm. I had a one hour interview by phone with this recruiting firm. Then I was asked to complete an in-depth test which I spent approximately six hours on. Next I was invited for an in-person interview with HR, the hiring manager and another member of the BD team. This lasted about one hour. I was told that they needed someone to start asap and that I would hear an update in two weeks or less. After a month passed, I called to ask for an update and was told that the HR rep I met with was on maternity leave and that they would let me know that day about my status. I have heard no update. This process was arduous and opaque. It feels like I just wasted more than 8 hours (one full work day). If this is how they treat a candidate for a job, I can only imagine how they must treat their employees. My advice is to not waste your time and talents on CNFA.", "Interview Questions": "When I was asked how soon I could start they balked at my answer and tried to get me to say I could start sooner. The position is still posted on their website so their sense of urgency was likely exaggerated."}, {"date": "4 Jan 2017", "title": "Communications Interm Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at CNFA (Washington, DC) in Jan 2017", "Interview Descriptions": "I have two interviews so far on skype. The first interview was with HR. The second one was with the communications team. It was great. Everyone I have talked to so far has been really nice and courteous. It was easy and conversational.", "Interview Questions": "What do I expect to gain from the internship?"}, {"date": "12 Feb 2014", "title": "Project Accountant Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at CNFA (Washington, DC) in Jan 2014", "Interview Descriptions": "I applied through CNFA's website, I received an email from CNFA inviting me to a one-on-one interview. The staff were very nice and welcoming. I had two interviews the first day. the first one with the Recruitment & Partnerships Manager. then I interviewed with the two staff from the finance team. \r\nTwo days later I received another invite for a second round, which was with more senior management with the Executive Vice President / Operations and Compliance. I met with most of the staff the same day after my 2nd interview.", "Interview Questions": "There were not any difficult interview questions, as I have previously done the exact same work in the past."}]]