[[{"date": "7 May 2023", "title": "PhD Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Vrije Universiteit Brussel (Brussels)", "Interview Descriptions": "The interview is a two steps process First there's a first talk about the research topic and a know each other interview. In the second, there will be a deep analysis of the project you are going to work on with some practical questions", "Interview Questions": "How am I going to use my skills for the research?"}, {"date": "4 Feb 2023", "title": "Masters Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Vrije Universiteit Brussel", "Interview Descriptions": "It is a friendly interview in two stages, firstly, the initial concepts in physics and optics and secondly, for scholarship specifically more technical details were asked. Also the third (formal) session about your goals and purposes to study", "Interview Questions": "What do you know about Maxwell equations"}, {"date": "9 Jan 2023", "title": "Student Job Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Vrije Universiteit Brussel", "Interview Descriptions": "Simple questions, very friendly, and respectful. The average wage is the minimum. I would have love a little bit more since the cost of life has become a little bit expensive in brussels.", "Interview Questions": "Do you have experience in programming?"}, {"date": "6 Jun 2023", "title": "IT Beheerder Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Vrije Universiteit Brussel (Brussels) in Jan 2023", "Interview Descriptions": "Er moest eerst een (remote) technische proef afgelegd worden (de vragen waren relevant en qua niveau conform met de openstaande positie). Daarna kreeg men een uitnodiging om op gesprek te komen (ook remote). Binnen 10 werkdagen was er al mogelijkheid om contract te ondertekenen.", "Interview Questions": "Voornamelijk vragen gebaseerd op ervaring, hoe ver kennis reikte."}, {"date": "24 Sept 2022", "title": "Pedagogical Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at Vrije Universiteit Brussel (Brussels) in Sept 2022", "Interview Descriptions": "Short small-talk section.\nSix questions total.\nTwo pertaining to research plans: PhD research topic, trajectory.\nTwo concerned hypothetical job scenarios (psycho-emotional response): how to talk to a distressed student; how to handle work pressure (juggling several projects at the same time).\nTwo about similar prior experiences (have I taught before; what I expect from superiors).\nTurned the interview over to me to close.", "Interview Questions": "Q:  Do you plan to continue doing research? If so, how will you find the time?"}, {"date": "1 Sept 2022", "title": "Technical Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Vrije Universiteit Brussel (Elsene, Brussels) in Aug 2022", "Interview Descriptions": "Candidature par lettre de motivation et CV. \r\nSélection pour un test écrit en ligne. \r\nSuivi d'un entretient oral devant le commité de sélection sous condition de réussite du test écrit.", "Interview Questions": "Describe the working of a laser cutter in detail."}, {"date": "30 Jan 2023", "title": "Master Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Vrije Universiteit Brussel (Brussels) in Mar 2022", "Interview Descriptions": "It took only one online interview with the faculty. They spoke quite fast, and without facial expression. Asking a bunch of questions regarding your resume and CV letter. Sometimes, they didn't even ask you to introduce yourself at the beginning of the interview.", "Interview Questions": "What makes you apply to our program, instead of other programs in other schools?"}, {"date": "3 Jun 2021", "title": "Mandaatsassistent Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at Vrije Universiteit Brussel", "Interview Descriptions": "kort en bondig, de testen waren doenbaar, maar vergden wel voorbereidingstijd. de communicatie verliep vlot en vriendelijk. de testen duurden wel lang, maar neem best je tijd om de vragen grondig te beantwoorden.", "Interview Questions": "Welke onderzoeken ik zou doen"}, {"date": "25 Jun 2021", "title": "PhD Researcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Vrije Universiteit Brussel (Brussels) in Jun 2021", "Interview Descriptions": "I have undergone the 1st interview and it was a success. it was more friendly and a discussion rather than an interview\r\nI applied through an online application process and I was contacted by email after my profile match the candidate requirements", "Interview Questions": "Can you describe some of your  weaknesses and how do you handle stress"}, {"date": "20 Oct 2020", "title": "PhD Candidate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Vrije Universiteit Brussel (Brussels) in Jun 2020", "Interview Descriptions": "We had a non-formal interview which went very well. The other formal interviews did not happen and did not get any feedback about my application. Only an automatic ugly reply after three months.", "Interview Questions": "Tell us something about yourself and experience?"}], [{"date": "18 Aug 2020", "title": "Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 1 week. I interviewed at Vrije Universiteit Brussel (Brussels) in Aug 2019", "Interview Descriptions": "Na heen en weer mailen werd ik uitgenodigd voor een gesprek met de prof. Het verliep heel amicaal. Er was één andere kandidaat. We hadden een fijn gesprek waarna de prof me een rondleiding gaf. Daags nadien werd ik gebeld dat ik de job had.", "Interview Questions": "Hoe zie je het onderwijs zitten? Geraak je hier vlot? "}, {"date": "8 Feb 2020", "title": "MSC Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Vrije Universiteit Brussel in Apr 2019", "Interview Descriptions": "I applied online and it took about 1 week to receive an email for an interview. Then I had a second interview for a scholarship. The whole process took 3 weeks. The second interview was supposed to be non technical, but it was technical indeed so watch out.", "Interview Questions": "How are you planning to finance your studies?\r\n\r\nPN junction?\r\nInterferometry?\r\nMaxwell equations?\r\nFT of cosine?\r\nAdaptative Optics?\r\n\r\nHow does a laser work?\r\n\r\nHow does an optical fiber work?\r\nWhat is polarisation?"}, {"date": "4 Dec 2017", "title": "Secretaresse Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Vrije Universiteit Brussel (Etterbeek) in Nov 2017", "Interview Descriptions": "Cv en motivatiebrief gestuurd en na 3-4 weken antwoord gekregen. Langsgeweest en sollicitatiegesprek gehad met 2 werkneemsters. Ik heb ook een test afgelegd. Ik heb nooit antwoord gekregen. Ik had wel een mailtje verwacht met een ja of een nee.", "Interview Questions": "Vertel over jezelf"}, {"date": "20 Jun 2017", "title": "European Photonics Master Joint Program (VUB & Ghent) University Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at Vrije Universiteit Brussel (Leuven) in Jun 2017", "Interview Descriptions": "I applied online and it was after the deadline and i had to pay 100 euros because it is after the deadline and then i went through an online interview on Skype with the chef of the program.\r\nThe interview took around 30 minutes, and the chef will asked me if i have the finance or not to cover my stay in Belgium.  \r\n\r\nI am writing this process and i didn't get my result yet, still waiting for the interview's result, \r\nSo i will be optimistic and tic for getting the offer ^^\r\n\r\nGood Luck!", "Interview Questions": "What is:  \r\n1. Band gap?\r\n2.Fourier Transform (F.T.)? \r\n3. F.T. of sine or cosine wave?  \r\n4.  Interefrometery?   \r\n5. Free optical design of a lens system? Turbulence of light? \"Read about adaptive optics is a +\"\r\n6. p-n junction?"}, {"date": "16 Sept 2018", "title": "Business Controller Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 4 weeks. I interviewed at Vrije Universiteit Brussel (Brussels) in Feb 2016", "Interview Descriptions": "Eerst was er een test, daarna kwam er een sollicitatiegesprek en na het sollicitatiegesprek kwam er terug een test. Daarna duurde het ongeveer 2 maand vooraleer ik kon starten. Over het algemeen een aangename ervaring", "Interview Questions": "Waarom zou u voor de VUB willen werken."}, {"date": "14 Apr 2016", "title": "Stafmedewerker SAC Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 2 days. I interviewed at Vrije Universiteit Brussel (Elsene, Brussels) in Mar 2015", "Interview Descriptions": "De sollicitatie bestond uit drie onderdelen:\r\n- Inhoudelijke vragen m.b.t. onderwijslandschap in België \r\n- Business flow tekenen aan de hand van tekst\r\n- Berekeningen in Excel\r\n\r\nBij de drie onderdelen was het gebruik van het internet toegelaten", "Interview Questions": "Waarom denkt u geschikt te zijn voor deze job?"}, {"date": "5 May 2014", "title": "PhD Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 months. I interviewed at Vrije Universiteit Brussel (Brussels)", "Interview Descriptions": "Initial communication by professor to students on open position followed by in person interview and assessment of the applicant based on study records and opinions of previous master thesis supervisor and former lectures. The hiring process took about 2 months and a 3 or 4 years appointment was offered at the PhD level. Subject was set for the 1st year and could be changed in 2nd or 3rd year.", "Interview Questions": "Definition of goals and research topics. Several positions were open."}, {"date": "6 Jun 2018", "title": "Onderzoeker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Vrije Universiteit Brussel (Brussels) in Apr 2014", "Interview Descriptions": "Het sollicitatiegesprek is aangenaam verlopen. Na CV gesprek kwam een discussie van het te verrichten onderzoek, samen met twee andere onderzoekers. Het project werd in grote lijnen voorgesteld, en klonk bijzonder aantrekkelijk.", "Interview Questions": "Wat was uw graad bij het beëindigen van uw studies?"}, {"date": "28 Nov 2017", "title": "Stafmedewerker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Vrije Universiteit Brussel (Brussels) in Feb 2013", "Interview Descriptions": "Redelijk chaotisch, maar wel positief. 250 sollicitanten werden op schriftelijk examen uitgenodigd voor een handvol mogelijke functies binnen een dienst. Velen gaven het al op toen ze het aantal uitgenodigde sollicitanten zagen. Een goede voorbereiding is noodzakelijk. Ik werd gemaild om de volgende dag op interview te komen, dus men moet zeer flexibel zijn.  Het interview was een gesprek met ca 4-6 personen. Ca 2 weken na het interview kreeg ik een job aangeboden.", "Interview Questions": "Wat is project management?"}]]