[[{"date": "10 Mar 2022", "title": "Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at KaBOOM!", "Interview Descriptions": "It was many years ago. Interviews are by nature a very informal measure of both the company and employee. It would be hard to provide a rating  to  meet this narrow system you have developed.", "Interview Questions": "What as my experience in account management ?"}, {"date": "28 Jan 2021", "title": "Executive Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at KaBOOM! (Washington, DC)", "Interview Descriptions": "Fairly easy, asked the typical interview questions. I did personal research on each person I was interviewed by to have a personal angle. Was able to take a 20 minutes interview and turned it into 45 minutes.", "Interview Questions": "How would you handle a very difficult boss.?"}, {"date": "26 Aug 2019", "title": "Vice President Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at KaBOOM!", "Interview Descriptions": "An external search company oversaw the process and I was contacted through email to schedule an interview. Several minutes before the interview was to occur, the interviewer called and asked to reschedule.  It took several weeks to reschedule due to the interviewer being unresponsive. This was very frustrating since I blocked out times that she suggested, only to never get a confirmation from her. We finally conducted the phone interview and I haven't heard anything since. Kaboom is a good organization and it's unfortunate that they've secured an unprofessional organization to handle their recruiting. As a candidate, it takes time to prepare and engage in the hiring process. It's frustrating to work with a hiring team that doesn't seem to value or recognize that.", "Interview Questions": "What is your management style?"}, {"date": "27 Aug 2018", "title": "Community Outreach Coordinator Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at KaBOOM!", "Interview Descriptions": "I applied online and then I reached out to the recruiter on LinkedIn. They emailed me back and set up an interview with the team lead. After a brief interview, he offered I go on to the next round of the interview process. The next round was a mock call where I would be attempting to sell a community organization on applying to a Kaboom grant.", "Interview Questions": "What experience do you have with a difficult client interaction?"}, {"date": "29 Jun 2018", "title": "Community Playground Organizer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at KaBOOM! in Jun 2018", "Interview Descriptions": "Reached out through email and arranged for a video interview.  Then moved to another video interview. There were some issues with downloading the file you needed to conduct the interview but that is typical when using technology.  Was more personal than phone screening.", "Interview Questions": "Role Play: Organizing a build day and having issues with people digging holes."}, {"date": "20 Jun 2016", "title": "Business Development Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 8 weeks. I interviewed at KaBOOM! (Washington, DC)", "Interview Descriptions": "Phone screen interview, panel interview with potential co-workers. Manager arranging panel interview was incredibly disorganized, she proposed dates/time 3 times (which I agreed to) before actually scheduling one. Overall from phone to panel interview was 4 weeks, and they then never responded to followup enquiries. 6 weeks later, when I caught her on the phone, she said they filled the position 4 weeks before but hadn't told me in case another position came open. Very unprofessional - particularly as they would not have accepted that level of followup in the position itself! Interviewed for another position there, similar experience. I would never apply there again, and based on my experience would not donate either. Very unprofessional and discourteous.", "Interview Questions": "Describe what about the mission appealed to me."}, {"date": "25 Mar 2016", "title": "Strategic Communications Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at KaBOOM!", "Interview Descriptions": "Two interviews, one with my superior and another with the director of communications. Both were phone interviews and they were very accommodating to dates/times. However, it took a while for them to respond; I had to keep emailing them to finally receive an offer.", "Interview Questions": "Why KaBOOM?"}, {"date": "18 Dec 2015", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at KaBOOM! (Washington, DC)", "Interview Descriptions": "Detailed over several weeks beginning with telephone screen, verification of resume and on-line application.  Interviews were somewhat thorough.  Some of the interviewers were clearly green or  inexperienced.", "Interview Questions": "Whether I had previous non-profit experience."}, {"date": "31 May 2019", "title": "Fundraiser Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at KaBOOM! (Washington, DC) in Apr 2015", "Interview Descriptions": "Phone screening first, then in person interview, meeting with the team and then with senior leadership.  Be prepared to answer a range of questions related to your experience and how it fits the job description", "Interview Questions": "Why KaBoom?"}, {"date": "15 Apr 2016", "title": "Fundraising Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at KaBOOM! (Washington, DC) in Feb 2015", "Interview Descriptions": "I applied, was contacted within 24 hours, had an interview with my direct supervisor, the division VP, and the Chief Mission Officer within a couple weeks, and within a few days of my final interview I was offered the position.", "Interview Questions": "Why is the mission important to you?"}], [{"date": "12 Nov 2014", "title": "Associate Community Outreach Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at KaBOOM! in Oct 2014", "Interview Descriptions": "Submitted an application and received an email requesting a phone interview about a week later. Had the phone interview the following week. Phone interview lasted about 30 minutes. Received an email the next day saying I wasn't moving on to the next round. Appreciated the prompt response, even if it was a negative.", "Interview Questions": "Name a time when you were the leader of a group. "}, {"date": "2 Aug 2014", "title": "Intern Interview", "results": "No Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 7 weeks. I interviewed at KaBOOM!", "Interview Descriptions": "Submitted cover letter and resume, received a phone call to set up interview. Phone interview was pretty standard--thought it went well. Coordinator then sent me a written test kind of thing, which was basically designed to see how you problem solve.", "Interview Questions": "Was awhile ago...questions related to play and problem solving"}, {"date": "6 May 2014", "title": "Business Development Interview", "results": "No Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at KaBOOM!", "Interview Descriptions": "Initial steps went well and quickly ... within 2 weeks of applying I'd had a phone interview, as well as in person interviews.  I liked that I was working with a member of the business unit and not HR from the perspective that they know the job and are personally qualified to review my qualifications.  However, I also found it odd that a formal HR/recruiting process seemed to be lacking.  The in-person interview went well, but when I asked what next steps were, the person I asked (the decision maker) didn't know and it was obvious he hadn't even thought about it or discussed it with his team.  He said, \"I know what I want to do and I think we'll have a decision next week.\"  It's now 5 weeks later and my 4 follow up emails (2 to him, 2 to my POC on his team), and 2 phone messages (1 to each) have been summarily ignored.  This is be highly unprofessional and rude in general, but particularly from business development professionals who should know better.  I have since heard (from this site as well as word of mouth) so many bad things about the way KaBOOM! does business and how they treat employees so I guess my experience is just insight to who they are.  It's too bad because their mission is very admirable and they could be doing so much more good than they are if they could pull it together.", "Interview Questions": "N/A"}, {"date": "28 Aug 2015", "title": "Alumni Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at KaBOOM! (Washington, DC) in Apr 2014", "Interview Descriptions": "I was brought in to interview for this position and recommended for a different role. In both interview processes, I was asked to present a business plan around a case study in each of the second interview. I did not hear for about a month after each process that I wasn't hired for either position.", "Interview Questions": "They asked detailed questions about how I would improve their current programming and what could be done if I got the position. This was outlined in the presentation they asked me to give."}, {"date": "5 Sept 2014", "title": "Associate Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at KaBOOM! in Mar 2014", "Interview Descriptions": "The interview process is about 4 or 5 rigorous stages.  Each interview is conducted over their video conferencing line.  Many situational questions are asked.  It is impoortant to know what the job is before applying and interviewing with the company.  During the 3rd interview, you are expected to go out on a Build and work with the staff and community.  This helps the KaBOOM! staff understand how you work with a large group of people.", "Interview Questions": "You will be asked situational questions.  What happens if a funding partner requires healthy food options and your community wants to supply McDonalds?  How would you set up your Build event?  How are you with planning?"}, {"date": "23 Jan 2014", "title": "Client Services Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 months. I interviewed at KaBOOM! (Washington, DC)", "Interview Descriptions": "Took a very long time to hear back from then anytime there was communication. At least a month after submitting my resume to hear back, then another 2 weeks until a phone interview, then 2 months until I heard back to schedule an in person interview, then didn't hear back for 3 months after that interview. Required multiple follow ups both on phone and email.", "Interview Questions": "When I turned up for the interview, the position was already filled so I was actually interviewing for a different job"}, {"date": "19 Jul 2013", "title": "Associate Client Services Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at KaBOOM! (Washington, DC)", "Interview Descriptions": "I was incredibly interested in working for KaBOOM! and had sent my resume to the general HR email for review.  I never heard back, but decided to keep trying.  I eventually found the email address of two directors in the department I wanted to work for and began sending more personalized cover letters and my resume to them.  After a few months I received a call from HR for a screening interview.  This was fairly straightforward and I was called back about two weeks later to come in for a second round interview.  This again went well, but then I waited about four weeks before I heard anything.  I was asked to come in a second time to meet the director of the department and two weeks later I was offered the full-time position.  The whole process took well over two months.  I was thrilled to get hired, but it was a drawn out and taxing process.", "Interview Questions": "Most of the interview questions were incredibly straightforward.  They are trying to get a sense of how well you can work under pressure and how well you can communicate effectively with people you will only work with over the phone.  The most difficult questions were about how you would track down communities you were working with who were short of resources and effectively encourage them to continue moving forward with a large-scale volunteer project"}, {"date": "1 Feb 2013", "title": "Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at KaBOOM!", "Interview Descriptions": "Initial communication was a bit strained as the admin seemed unfocused in scheduling interviews and arranging details. First interview was with preliminary interviewer, secondary was with Project Management lead. From there, the offer came fairly quickly.", "Interview Questions": "The interview was fairly casual in that no questions seemed too pointed. \"How did you handle a difficult situation in the past?\" is a standard one used. When the interview continued, though, there were scenario-based questions such as \"So if your hired contractor walks off the job site and refuses to return, what do you do?\" Having never hired a contractor before, I was unsure how to answer, but as long as you try, it's fine."}, {"date": "22 May 2012", "title": "Development Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at KaBOOM! (Washington, DC) in May 2012", "Interview Descriptions": "Who knew so much is involved in hiring for an entry-level position?\r\n\r\nPhone interview lasted about an hour. \r\nSecond interview (chat) lasted an hour.\r\n\r\nThere is a third round (!!!) that involves a face-to-face with a panel of people. I did not get a callback for this round, but it's APPALLING that this organization makes you go through so many hoops for a position that pays less than $30k. \r\n\r\nNot cool that organization didn't have the decency to email/call to say you didn't make it to the third round. Very inconsiderate.", "Interview Questions": "What type of staff gathering would you plan?"}, {"date": "25 Feb 2013", "title": "Grants Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at KaBOOM! in Mar 2011", "Interview Descriptions": "I had a phone interview that lasted about 20 minutes after applying via email. I never heard back about next steps. I sent a thank-you note and followed up 2 more times specifically asking about my application status, but I never got a response. It was very disappointing (and rude) to not even get a rejection after having a one-on-one interview.", "Interview Questions": "Would you be willing to accept less than your listed salary requirements?"}], [{"date": "3 May 2011", "title": "Build Manager Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "The process took 3 weeks. I interviewed at KaBOOM! (Chicago, IL) in Jul 2009", "Interview Descriptions": "The hiring process was lengthy and overrated for the position I was pursuing.", "Interview Questions": "What is your current company;'s motto?"}]]