[[{"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Really empowering place to work", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "7 May 2018", "job_title": "Coordinator in Hong Kong", "duration": "N/A", "pros": "You are extremely empowered to do your job.\r\n\r\nThe work Seefar does is really inspiring.\r\n\r\nLow levels of hierarchy and a pretty flat org structure. You can collaborate and talk with anyone in the organisation without barriers to get stuff done.\r\n\r\nYou are entitled to unlimited leave. No one abuses it. Management encourage you to take more leave.\r\n\r\nYour work hours are flexible.\r\n\r\nRecently introduced a pension, benchmarked pay rates and home office support.\r\n\r\nThe team is extremely close for a remote workforce. Probably because we get together in person a lot and everyone is friendly and helps each other so much.\r\n\r\nThere doesn’t seem to be any hidden agendas or internecine warfare, the best ideas almost always win. People are also really willing to be challenged and challenge each other to come to a good decision. This level of openness is really hard to find.\r\n\r\nManagement is really solid and often inspiring actually. Not many organisations could have done what Seefar has done in such a short space of time. There is also a clear focus on ppl and they are doing as much as they can given how fast we are growing. Kudos to them.\r\n\r\nPeople are asked to leave if they aren’t a good fit, either for values, workstyle or performance. That doesn’t happen in many development organisations. It means our team keeps getting stronger is not weighed down by dead weight. But you are supported, so almost everyone thrives. It is mainly arrogant people who don’t do well at Seefar, at least that is my observation based on me thinking about this a lot.\r\n\r\nSeefar seems to take things back to their roots before deciding on a new system. It is unlikely that something will get implemented just because someone ‘did it that way’ somewhere else.\r\nIf there is a problem, management are quick to act and get it fixed.\r\n\r\nGenuinely the best job I’ve had.", "cons": "Seefar has a high performing culture and management encourage continual feedback to everyone so we all get better faster. That is pretty unique and most people have not truly been in a culture like this before. A really powerful example for me was that at our last summit, someone openly gave the CEO negative feedback and it was appreciated by him. The downside is that this can be tough to get used to for some people, mainly those that are underperformers.\r\n\r\nA lot is expected of you for your level so you need to be prepared to grow into your role and become effective pretty fast.\r\n\r\nThere is an environment of dedication so if you are not careful you will overwork yourself. While management have been conscious of this and have been encouraging us to not work so hard, they have only just implemented systems to stop this, which had made a big difference to everyone (in what other organisation do you need to do this?!). But it is easy to go down a rabbit hole exploring something and forget to finish work for the day!\r\n\r\nSeefar is growing fast so org structures are fluid. However, not a big problem.\r\n\r\nManagement don’t spend much time or money on promoting the Seefar."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 1, "Culture & Values": 3, "Diversity and Inclusion": 3, "Career Opportunities": 0, "Compensation and Benefits": 5, "Senior Management": 3, "review_title": "Experience", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "14 Jun 2023", "job_title": "Administrator in Hong Kong", "duration": "N/A", "pros": "Very Good pay Diversity Friendly people", "cons": "High Pressure No adequate time for training they expect results immediately The policy for terminating employment is not so good"}]]