[[{"date": "19 Jul 2022", "title": "Compliance Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Bon Secours", "Interview Descriptions": "Gotta say this was a weird one. I received immdiate outreach from an executive recruiter expressing interest to interview, and then total silence for weeks after I responded. When I sent them a follow-up as a courtesy (in case I'd been lost in the shuffle), the recruiter responded 10 days later with an apology and offering times for an interview. I had a perfectly fine introductory interview with the senior leader, where we talked generally about the position but not really in too much detail - presumably because much of the work would be done between peers in the system.  At the end, next steps were laid out and it was fully intimated that the recruiter would be contacting me to schedule the next formal round of interviews, where we would really dig in. \r\n\r\nThat recruiter never reached out one way or the other, even after a thank you email. The position is still posted months later.  I guess they want someone to just recruit themselves every step of the way?  Just kind of a generally unprofessional candidate experience that doesn't give off a good vibe for joining here.", "Interview Questions": "How does your work experience fit into this role"}, {"date": "6 Jun 2022", "title": "Receptionist Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Bon Secours", "Interview Descriptions": "The process was easy going. After doing the online application, I did a video. And then received a call for an interview as well. Overall process was quick and easy.", "Interview Questions": "Why did I want position"}, {"date": "21 Jun 2022", "title": "Patient Service Representative Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Bon Secours (Midlothian, VA) in Jun 2022", "Interview Descriptions": "Application, then if AI feels you are a fit you immediately get invitation to do a Hirevue Interview. I did mine of Friday and am waiting to see if I get in person interview.", "Interview Questions": "Strengths, Example of how you handle multiple projects with equal importance, example of how you handled working with difficult co-worker, what is a patient experience vs patient satisfaction and tell me about yourself. "}, {"date": "23 May 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Bon Secours", "Interview Descriptions": "The interview started with HR phone call i review and then another zoom interview was with the department manager, supervisors and any available team nurse. A lot was focused on my experience and what I would do in certain situations. It was a calm and inviting and everyone was nice and not intimidating.", "Interview Questions": "What would you do in this situation...? There were several questions like this. "}, {"date": "15 Feb 2022", "title": "Compliance Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Bon Secours", "Interview Descriptions": "I had a 20-25 minute telephone screening with HR.  Within a couple of days, the hiring manager reached out via email to schedule a panel Zoom interview.  The panel interview lasted just over an hour, but a good 20 minutes of it consisted of one of the members berating me for wanting to leave my current position.  I am currently a licensed attorney, as were two members of the panel, and one of the attorneys was basically scolding me for trying to get a job with Bon Secour.  He kept telling me that it was a downward move and I should be applying to other law firms.  I was quite taken back because, as I mentioned before, two of these panelists were also attorneys, including the guy berating me.  It was just confusing.  The other two panelists were quite nice, but I knew I would not be getting an offer just based off of the one guy's temperamental chastising.", "Interview Questions": "They asked me general questions about my current work, the types of providers I work with, and difficulties I've encountered."}, {"date": "13 Dec 2021", "title": "Registered Respiratory Therapist (RRT) Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Bon Secours", "Interview Descriptions": "The interview process was fast. HR was quick to respond and set up an interview. After my interview it only took a couple days to hear back with an offer. Although my interview was online via webcam due to COVID, everyone seemed nice and professional. Unfortunately, I was moving from out of state and had to make a decision without really getting to tour the hospital, so I was in a tough position to choose. I ended up going somewhere else, but have heard good things about working at Bon Secours.", "Interview Questions": "Why do you want to work in healthcare?"}, {"date": "5 Oct 2021", "title": "Sterile Processing Technician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Bon Secours in Oct 2021", "Interview Descriptions": "Straight forward interview , very professional , open minded and very welcoming . Interviewer was very kind and I enjoyed talking with them. They responded quickly after I applied and allowed me to provide them with times and dates for availability to have a phone interview", "Interview Questions": "Describe more about how you can thrive both as a team and independently "}, {"date": "3 Aug 2021", "title": "Occupational Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Bon Secours", "Interview Descriptions": "Following an initial resume screen, I had a phone interview with a recruiter followed by an in-person interview with the management team. The recruiter provided info on benefits, salary, etc", "Interview Questions": "Describe your strengths and weaknesses"}, {"date": "26 Jul 2021", "title": "Director Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Bon Secours", "Interview Descriptions": "4 total interviews, 2 were panel interviews.  They were not too grueling.   Be prepared to answer situational questions and to solve problems the position may be facing.  Show excitement for the position and why you are the best fit.", "Interview Questions": "Tell me about a complex problem and how you solved it.  "}, {"date": "21 May 2021", "title": "Physical Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Bon Secours", "Interview Descriptions": "I had 2 interviews- one with HR and one with the rehab director and PT lead. All very kind and friendly, great experience! I received an offer with in a week.", "Interview Questions": "Strengths and weakness, workplace questions, why I wanted  the job  "}], [{"date": "2 Jul 2021", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. I interviewed at Bon Secours (Richmond, VA) in May 2021", "Interview Descriptions": "Linkedin outreach\nEmail outreach\ninterview time slot\nEnded up talking to two recruiters and phone screen and then was passed along to another recruiter for non bedside role and did not hear back.", "Interview Questions": "Tell me about your past experience.\nHow can we get you back with us?"}, {"date": "7 Apr 2021", "title": "Patient Care Technician Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Bon Secours", "Interview Descriptions": "Applied online and heard back about a month later. Had a virtual interview. Was offered a position, but declined. Interviewer was very nice, but other staff left more to be desired.", "Interview Questions": "What are your greatest strengths and weaknesses? "}, {"date": "23 Apr 2021", "title": "Athletic Trainer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Bon Secours in Apr 2021", "Interview Descriptions": "The interviewers I had made me feel very comfortable. There was an easy setup process for the interview and they were very flexible with my schedule. Overal really great experience", "Interview Questions": "What makes you stand out the most"}, {"date": "21 Jun 2021", "title": "Patient Transporter Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Bon Secours (Richland, SC) in Mar 2021", "Interview Descriptions": "It took way too long, I got offered multiple jobs in between waiting for this job and never got emails or calls back after going through the online HireView interview.", "Interview Questions": "How are your communication skills in touch times?"}, {"date": "2 Feb 2021", "title": "Health Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Bon Secours", "Interview Descriptions": "The interview process took about two weeks. Went through three sets of interview, first was a pre screening phone call, second was with three managers, and last was with a director.", "Interview Questions": "Describe a situation when you went above and beyond for a client/patient"}, {"date": "12 Feb 2021", "title": "New Graduate Nurse Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Bon Secours (Rich Int Ap, VA) in Jan 2021", "Interview Descriptions": "I received a phone call the day after I had sent in my application. It was a quick mini-interview to just ask why I am interested in working with Bon Secours and what departments I'm interested in. The woman gave me a brief overview of the residency program and then immediately wanted to set up interviews. The interviews lasted 10-30 minutes and were simple questions.", "Interview Questions": "What is something about yourself that you need to work on?"}, {"date": "27 Aug 2020", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Bon Secours (Saint Pete, FL)", "Interview Descriptions": "I applied for an RN position at Bon Secours St Petersburg. I was called by the recruiter and scheduled me for an interview with the Hiring Manager. My interview went well. The Hiring Manager said that the same recruiter who scheduled my interview will call me back. After few days the recruiter called me back saying that we will start the on boarding process. She said that I will be receiving an email shortly and I should fill out forms etc. Never received it. So I decided to email her and asked then she sent me a link for an LPN position. I was surprised because I am a RN and I applied for a RN job and yet she was sending me link to reapply and this time it's and LPN position. It is a big joke. The recruiter is either no organizational skill, forgetful, or whatever you call. Says something about the company. Never received a response when I asked for clarifications. Says something about the management.", "Interview Questions": "N/A"}, {"date": "3 Sept 2020", "title": "Certified Nursing Assistant CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. The process took 1 week. I interviewed at Bon Secours (Richmond, VA) in Aug 2020", "Interview Descriptions": "It was a phone interview. It was very relaxed. I had no problems. The on-boarding process has a lot of steps but it's standard.  Overall it was a positive experience.", "Interview Questions": "They asked me about my CNA experience. "}, {"date": "13 Feb 2021", "title": "Client Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Bon Secours (Richmond, VA) in Apr 2020", "Interview Descriptions": "Very quick and easy. The process when by very fast and minimal questions were asked. This a good position to learn how to network if you plan on moving to management or into a higher lab position .", "Interview Questions": "Please describe your skills and how proficient you are in interpreting statistics?"}, {"date": "21 Jan 2020", "title": "Environmental Services Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 5 days. I interviewed at Bon Secours", "Interview Descriptions": "The phone interview was a little confusing because the phone number they call you from is not from the same area. If you miss their call, they won't leave a voicemail which is frustrating because they don't email you to tell you when they will call you.", "Interview Questions": "What is your opinion with the phrase, if it's not broken don't fix it. "}], [{"date": "24 Sept 2019", "title": "Program Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Bon Secours", "Interview Descriptions": "I received a call from recruiting asking for 5 references to complete a thorough questionnaire, which they all completed within the same day of the phone call. The recruiter called a few days later, asking if it was a good time to talk. Unfortunately it was not, as I was taking my nephew to school. We scheduled a time to chat later that day, but she never called. I tried following up with HR several times, with no luck. At one point she supposedly called back but never left a message. Highly unprofessional and inconsiderate of my time and those that provided references. It was a position that I was definitely qualified for and would have excelled at. Very disappointed in their recruitment team and process.", "Interview Questions": "Is this a good time to speak? Asking after randomly calling "}, {"date": "13 Aug 2019", "title": "Pharmacist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Bon Secours", "Interview Descriptions": "I applied for a job listing online and received an Email about 3 weeks later. Eventually I had an in person interview. The interview itself was very laid back with 5 pharmacists total taking turns asking questions.", "Interview Questions": "The questions asked were mostly generic including why I’d be a good fit for the company and what I’m looking for in a company. I was also asked about specific experiences based on my resume.   "}, {"date": "17 Oct 2019", "title": "Managed Care Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Bon Secours (Richmond, VA) in Jun 2019", "Interview Descriptions": "Inviting, organized, informative and casual. Great opportunity to learn about the company & position. Not an aggressive interview.  Phone screen to start with recruiter. Then a panel interview with 2 people at a time. Very laid back and inviting.", "Interview Questions": "My previous experience in the field."}, {"date": "3 May 2019", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Bon Secours (Richmond, VA)", "Interview Descriptions": "Easy and laid back.  Questions about current position, behavioral questions and why I am interested in Bon Secours.  The interview panel was friendly and made me feel at ease.  Provided information for follow-up questions after interview.", "Interview Questions": "Why am  I interested in the position?"}, {"date": "26 Apr 2019", "title": "Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 1 week. I interviewed at Bon Secours", "Interview Descriptions": "Worked as temp and asked to be full time. This was a very long time ago to remember the process. Do not remember the interview process over 4 years ago.", "Interview Questions": "This was standard questions"}, {"date": "3 Apr 2019", "title": "RN Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at Bon Secours (Portsmouth, VA)", "Interview Descriptions": "Filled out an application online and received a call from a recruiter about two months later. Discussed what positions I was interested in and set up interviews. Straightforward, panel style interview, basic questions describing myself and where I want to go with my career. Why I’m interested in these particular positions. Etc", "Interview Questions": "Tell me about yourself, where you see yourself going etc"}, {"date": "29 Mar 2019", "title": "Nurse Educator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Bon Secours (Portsmouth, VA) in Mar 2019", "Interview Descriptions": "Total of two interviews, both were panel type interviews. The first was with the directors in the education department, the second was a two part panel, the first with the directors at the hospital I would be working for and the second with the education team at that hospital", "Interview Questions": "How do you handle someone with a different learning style? What do you do if you don't know the answer or how to approach a topic?"}, {"date": "13 Feb 2019", "title": "Switchboard Operator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Bon Secours", "Interview Descriptions": "Completed brief phone interview. Advised my application being forwarded to hiring manager. I received a request for FIVE references to continue. With their emails and phone numbers. Way too invasive to expect me to give up this information. And the cherry on top, when I called HR to ask when benefits become effective after hire, they don;t release that info until you have an offer!! Double standard on privacy in this day and age.", "Interview Questions": "Phone interview confirmed application details."}, {"date": "21 Jan 2019", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Bon Secours in Jan 2019", "Interview Descriptions": "I was contacted by a recruiter and gave her my top three choices. I was later contacted by the nursing directors for each unit to come in for an interview.", "Interview Questions": "Tell me about yourself "}, {"date": "15 Apr 2019", "title": "Admissions Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Bon Secours in Jan 2019", "Interview Descriptions": "I had a very in depth interview and discussion session with the Admissions Director.   We discussed the  skillset, qualifications, benefits, expectations for the position in depth. The interviewer was professional, courteous, on time, and friendly.", "Interview Questions": "What do you feel you could bring to the team that would be an asset "}], [{"date": "18 Dec 2018", "title": "Coding Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Bon Secours", "Interview Descriptions": "Phone interview. Recruiter was kind but clearly unimpressed with my lack of coding credentials.  He told me to apply again after I passed  a coding credential. It was not a negative experience, just disappointing.", "Interview Questions": "How much coding experience do you have? What specialties? Do you have a coding credential, like a CPC?  "}, {"date": "11 Jan 2019", "title": "Staff Chaplain Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Bon Secours in Dec 2018", "Interview Descriptions": "They took a long time to get back to me after the initial online application: 3 months.\r\n\r\nThe interview itself was good. Interviewers were friendly and courteous.  But it took them a long time again, to follow up on the interview results.", "Interview Questions": "Tell us about your experience of caring for a person who had religious beliefs different from your own..."}, {"date": "5 Nov 2018", "title": "Lpn Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Bon Secours", "Interview Descriptions": "First applied online then several days later I received a call setting up multiple interviews, interviews took place the following week and all lasted about an hour. Everyone I met with was very friendly and explained everything in detail, offered multiple positions and once I decided I received my offer letter then proceeded with background check and drug/tobacco/health screen.", "Interview Questions": "Why are you looking to change jobs; strengths/weaknesses/ very straight forward interviews. "}, {"date": "31 Aug 2018", "title": "Lpn Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Bon Secours", "Interview Descriptions": "Unorganized, panicky on their end, friendly yet overly friendly, suspicious, confusing, not so sure sincere?, all over the place, perks were intriguing yet failed to come to table.", "Interview Questions": "N/A"}, {"date": "28 Oct 2018", "title": "Scheduling Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Bon Secours (Saint Petersburg, FL) in Aug 2018", "Interview Descriptions": "I applied online, within  2 weeks I had a phone interview and was asked if I could start in 2 weeks. I then was called for the in person interview.  Went in and I thought it went well. Said they would let me know. I waited 2 weeks without a phone call. I called the St Pete office and said they have been busy and lost track of time. Said I was on the list for a second interview. Came in for that and was in August. I called and no response at all. Very disappointing and not good business management. I will not work for a company with bad communication. I make sure I let people know how bad the process was. A phone call saying Thank you.. we have chose another candidate would have been nice.", "Interview Questions": "Why I was looking for a new job "}, {"date": "18 Oct 2021", "title": "Patient Registrar Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Bon Secours in Aug 2018", "Interview Descriptions": "Phone interview, in person interview, orientation then on the job training. Bring a couple copies of your resume. They tend to have high turn over as it is repetitive work.", "Interview Questions": "What do you think you can bring to this company?"}, {"date": "15 Aug 2018", "title": "Social Worker Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Bon Secours (Baltimore, MD) in Jun 2018", "Interview Descriptions": "The interview process was a little clumsy and that's cause I lived out of town and they weren't too sure I would drive down. I came for the interview and didnt hear back from them in a week like was stated. But got a call from them about 5weeks about another open position and if I was interested, Since I was really planning to relocate but wanted a job before doing so i accepted the offer. And bring process commenced immediately.", "Interview Questions": "How would u approach an angry or uncooperative patient."}, {"date": "16 May 2019", "title": "Insurance Verification & Pre-registration Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 5 days. I interviewed at Bon Secours in Jun 2018", "Interview Descriptions": "I was in the process of relocating so I was able to do a telephone interview. The process lasted about 25-30 minutes and was conducted by the director and manager of the department.", "Interview Questions": "Since you have previous customer service experience, please tell us about a time you have deescalated an angry caller."}, {"date": "26 Jul 2018", "title": "Unit Se Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Bon Secours in May 2018", "Interview Descriptions": "It was fairly simple. Asked a couple questions. Knew I got the job before leaving.  It was a group interview. The hiring manager and 2 others.  After I was told I got the job, HR needed to call me and give me the details of the offer. I got a call within 30 mins after the interview.", "Interview Questions": "Are you a self starter?"}, {"date": "12 Apr 2018", "title": "Health Educator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Bon Secours (New York, NY)", "Interview Descriptions": "Panel interview with current person holding position that obviously felt she was doing a better job than anyone they could hire.  She very blantly demonstrated incivility to her coworkers and subordinates during the interview visiably trying to intimidate them in their response to my questions and made the entire process for me and the other interviewers akward and uncomfortable. I had much higher expectations from this organization.", "Interview Questions": "what are you doing to change the leadership style you learned in the Army?"}], [{"date": "16 Apr 2018", "title": "Home Health RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Bon Secours (Suffolk, VA) in Apr 2018", "Interview Descriptions": "Brief and concise, the questions were unique to the description of the job. It was a team interview however, the environment was welcoming. The job description was reiterated and expectations specified.", "Interview Questions": "How can you be an asset to this team?"}, {"date": "26 Aug 2022", "title": "Summer Analyst Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Bon Secours in Feb 2018", "Interview Descriptions": "A lot of fun good work things are right up there together with the last minute of the day they are completely free just to get acclimated to the kitchen I would like to come in for an interview at this", "Interview Questions": "They're Catholic or part of the problem "}, {"date": "7 Jul 2018", "title": "Volunteer Coordinator Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Bon Secours (Norfolk, VA) in Jan 2018", "Interview Descriptions": "Informal, meeting with the director first. Felt very comfortable, then met with the rest of the department. It was not intimidating in the slightest, and they were very welcoming and kind.", "Interview Questions": "What is your ideal work environment?"}, {"date": "18 Dec 2017", "title": "Administrative Resident Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Bon Secours (Columbia, MD)", "Interview Descriptions": "I t was intense. There were several groups of people to interview. The interviewing process was long and stressful. Each candidate had to interact with previous residents and other potential candidates.", "Interview Questions": "what makes you a better candidate?"}, {"date": "28 Oct 2017", "title": "Cancer Registrar Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Bon Secours (Midlothian, VA)", "Interview Descriptions": "There was a phone interview after my application met the minimum requirements. After the phone interview there was no follow up which I had to contact HR several times. Then I was told they hadn't posted the job. This entire process took 3 months.", "Interview Questions": "The interview was mainly based on temperament and working with a team."}, {"date": "9 Aug 2017", "title": "Physical Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Bon Secours", "Interview Descriptions": "Informal sit down meeting with administrator and rehab director.\r\nTook place the same day I appeared in person to submit a resume.\r\nVery friendly staff, made me feel very welcome and gave a sense of family.", "Interview Questions": "Q: Provide correct medical documentation for home health care plans for a given client."}, {"date": "18 Oct 2017", "title": "Rehab Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Bon Secours (Hampton, VA) in Aug 2017", "Interview Descriptions": "Applied online. Received a call about a week or two later about an interview set up. Asked me a few question about myself and my future goals. Took a tour of the facility.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "3 Jul 2017", "title": "Unit Secretary Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Bon Secours", "Interview Descriptions": "The interview process was very long. It took me a month to get an interview. After getting the interview, it did not take long for me to start working.", "Interview Questions": "Basic questions were asked."}, {"date": "31 Aug 2017", "title": "RN Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Bon Secours (Midlothian, VA) in Jul 2017", "Interview Descriptions": "I was brought in for a shadowing experience to see how the unit runs. At the end of my 3 hour experience I was surprised by a \"Peer Interview\" by 4 current employees.  Bon Secours only asks pre-written questions. I never actually interviewed with the manager and she was not present during the interview.", "Interview Questions": "Tell me about a situation in which you had a problem with another employee and how did you handle it?"}, {"date": "25 May 2017", "title": "Rehab Tech Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Bon Secours (Midlothian, VA) in Apr 2017", "Interview Descriptions": "Took about 15-20 minutes. 2 people interviewed me at the time: a PT and PTA. They first asked me basic questions about myself and past experiences, then asked me scenario questions. Afterwards I was given a tour of the facility", "Interview Questions": "Have you ever worked with any one of a different culture or background? Were there any difficulties, and if so how did you overcome it"}], [{"date": "7 Jun 2017", "title": "Helpdesk Support Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Bon Secours (Richmond, VA) in Apr 2017", "Interview Descriptions": "It was very basic, the manager was nice and very accommodating.\r\nFrom what I saw, the employees were very friendly.\r\nThey seem to have a great deal of religious value. \r\nIt was a casual environment and the manager so nice, she suggest to take a suit jacket off if I wasn't comfortable in it.  lol\r\nI got the offer and was very happy with it. They even give you an idea of what you'll be doing so as to give you a head start on your job if you were to get a call back from them..", "Interview Questions": "Basic PC Troubleshooting skills"}, {"date": "18 Mar 2017", "title": "Radiology Scheduler Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Bon Secours", "Interview Descriptions": "Phone call to set up in person interview, in person interview, then a call to see if you got it or not. Then an offer letter would be sent to you if so.", "Interview Questions": "How do you handle an irate customer?"}, {"date": "10 Apr 2017", "title": "Executive Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Bon Secours (Greenville, SC) in Mar 2017", "Interview Descriptions": "An initial interview was conducted, touched on all the right questions.  HR representative was very prepared and was engaging.  The interview lasted approximately 45 minutes.  She represented the company very well and responsibilities the position entailed.", "Interview Questions": "How do I handle difficult personalities?"}, {"date": "6 Sept 2019", "title": "Clinical Resource Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Bon Secours (Richmond, VA) in Feb 2017", "Interview Descriptions": "Small panel interview, manager and another employee.  Questions seemed \"off the cuff\", very laid back but in a weird way.  Inappropriate at times - talking about the difficult staff and how \"changes are coming\" if staff don't comply.  Odd interview", "Interview Questions": "How you handle conflict"}, {"date": "25 May 2017", "title": "Human Resources Service Advisor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Bon Secours (Richmond, VA) in Jan 2017", "Interview Descriptions": "Easy interview process, meet with the manager and director for an hour and a half a few days later received a call from a recruiter for a job offer and to discuss salary and start date.  Received offer letter by email.", "Interview Questions": "Tell me about a time when you dealt with a difficult co-worker."}, {"date": "12 Jan 2017", "title": "RN Med/Surge Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied through an employee referral. I interviewed at Bon Secours (Warwick, NY) in Jan 2017", "Interview Descriptions": "Met with the charge nurse and the nurse manager for an interview. I felt nervous prior to the interview, yet, the moment I walked into the conference room I felt my anxiety lessen. They are approachable, and have type of demeanor that is very easy going and relaxing.\r\nThe interview was scheduled over the phone, and the interview took an hour in a conference room, then a person took me around the floors to show me the med-surge units.", "Interview Questions": "Describe a day during your preceptor-ship on med-surge? (Newly Graduated RN here)"}, {"date": "22 Nov 2019", "title": "Pct Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Bon Secours in Aug 2016", "Interview Descriptions": "It was fine, the unit manager calls you and you go into the facility to interview.  Usually you are offered an opportunity to shadow and see if you like the unit.", "Interview Questions": "Why you came into the medical field."}, {"date": "15 Sept 2016", "title": "New Grad RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Bon Secours (Richmond, VA) in Aug 2016", "Interview Descriptions": "I was contacted by HR in Baltimore and then my  application was transferred to Richmond area manager. I then interviewed face to face with 3 managers in ICU, PCU, CVPC. I had a phone interview with a different ICU department. \r\nI received a phone call about 3 days later for an offer in the PCU department.", "Interview Questions": "How do you handle death and dying?"}, {"date": "31 Jan 2019", "title": "Financial Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at Bon Secours (Baltimore, MD) in Jul 2016", "Interview Descriptions": "Very informative, down to earth interview. Met with a team member for better description of job duties. Typical describe at time questions. But asked other personality questions, so get gather insite on your interaction style.", "Interview Questions": "What do you hate the most or what frustrates you the most on a team?"}, {"date": "30 Jun 2016", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 6 days. I interviewed at Bon Secours in Jun 2016", "Interview Descriptions": "The interview process was easy. I applied online and was called by Nurse Manager within a few days to come in for an interview. Manager and head nurse interviewed me and were friendly and professional.", "Interview Questions": "Can you tell us some of Bon secours values?"}], [{"date": "21 May 2017", "title": "Registrar Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through other source. I interviewed at Bon Secours (Baltimore, MD) in Apr 2016", "Interview Descriptions": "It was a three step process. Interview with HR, then executive director,  then direct manager. then you had to wait for an offer. After you accepted the offer you had to go online and fill out your prehire forms, a health screening a drug test and background check, then a 1 week orientation. then you started work", "Interview Questions": "What area do you thin you need to work on the most"}, {"date": "14 Jan 2017", "title": "Certified Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Bon Secours (Richmond, VA) in Jan 2016", "Interview Descriptions": "I initially applied on 12/28. Received a call from HR on 1/10.  Recruiter asked basic questions such as Salary expectations and confirmed my work history. She submitted my resume to hiring managers and not even a hour later I had 2 interviews scheduled for 1/12. During my interview I met with the practice administrator, supervisor, physicians and my future coworkers. Received a call from the recruiter and an offer for one of those positions on 1/13. I accepted since that's the position I wanted.", "Interview Questions": "Describe yourself in five words."}, {"date": "29 Dec 2015", "title": "RN Case Manager Home Health Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 4 days. I interviewed at Bon Secours (Saint Petersburg, FL)", "Interview Descriptions": "accurate and to the point, easy, I felt very comfortable because I had worked with the DON before and she knew my work and my strengths and weaknesses. both DON and Director were professional and friendly", "Interview Questions": "what is your best attribute? i'm organized, compassionate, a good listener and very patient\r\nwhat is your worst? I can a little slower than other nurses but I am very thorough. I always drive the speed limit for safety"}, {"date": "17 Nov 2015", "title": "Physician Liaison Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 1+ week. I interviewed at Bon Secours (Norfolk, VA)", "Interview Descriptions": "It was a 3-step interview; 2 phone interviews and a final panel interview with roughly 8 people; it was a bit overwhelming having so many leaders talk at one time", "Interview Questions": "How did I plan to gain experience since I was new to healthcare"}, {"date": "24 Nov 2015", "title": "RN Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Bon Secours in Nov 2015", "Interview Descriptions": "fairly easy, I got a screening interview via phone then offered a in-person interview. During screening I explained my minimum salary.  I was asked basic questions like why do you want to work here. I was offered a position, however, it was far far less than my minimum I stated in screening. Therefore, I declined the position.", "Interview Questions": "Why do you want to work here? greatest weakness"}, {"date": "3 Oct 2015", "title": "Human Resources Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Bon Secours (Richmond, VA) in Oct 2015", "Interview Descriptions": "I applied online, and filled out a background check form and took a personality test. A few days later, I did a phone screen with a recruiter out of their office in MD, then she arranged a phone call with the hiring manager in my future department, and I came in for an in person interview. I met with her and an HR Director for the interview, and I received an offer the next day. \r\n\r\nMy interaction with everyone from the recruiter to the staff at my new job was pleasant. I felt like a member of the staff before I even received an offer. I accepted the offer, and I chatted with an on-boarding coordinator about the next steps and received info on new hire paperwork, requirements, etc. You would also have to take a drug test (urine), at their employee wellness department within 48 hours of accepting the offer. \r\n\r\nThe salary exceeded my expectations, so I did not need to negotiate. I cannot wait until I start this job in a few weeks :D", "Interview Questions": "What are your salary expectations?"}, {"date": "16 Feb 2018", "title": "Coder II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 5 days. I interviewed at Bon Secours in Sept 2015", "Interview Descriptions": "Quick interview process which included a call with a coding manager and then a panel interview with 5 managers and the department director. They asked good questions and were polite and professional.", "Interview Questions": "Give an example of how you handle conflict with a coworker"}, {"date": "14 Aug 2019", "title": "Lpn Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Bon Secours (Virginia Beach, VA) in Aug 2015", "Interview Descriptions": "I applied online for several locations. I was interviewed at 2 specialty and 1 primary office. I liked the managers and they worked together to find me the best match for my skills and work/life balance. I toured the offices and met current employees. After job offer Inwas required to present imm records and do bloodwork including drug and tobacco screen.", "Interview Questions": "What has been the most challenging part of your most recent job? "}, {"date": "13 Sept 2016", "title": "Unit Secretary Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Bon Secours (Newport News, VA) in Jul 2015", "Interview Descriptions": "The interview process was a little lengthy. I got called for a phone interview. It took almost a week for them to call me back to schedule a face to face interview. After the face to face interview they gave me my start date.", "Interview Questions": "Why do I want to work for the company?"}, {"date": "24 Jan 2016", "title": "Patient Service Representative Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Bon Secours (Portsmouth, VA) in May 2015", "Interview Descriptions": "Applied online and filled out the questionnaire. Heard back maybe a week or so later from HR, who asked me some pre-interview questions. Interviewed with hiring manager in a location that I did not apply to, so be prepared to possibly travel for interview. Simple hiring questions you'd find in any healthcare field. Gave me a tour of the unit there (not the one I'd work at). Told me she'd make a decision by Friday (I interviewed on a Tuesday). I never heard back from her, so assumed I did not get the job. But then I heard about three weeks after the interview from HR that I was offered the job.", "Interview Questions": "Tell me about a time you had work place conflict and how you resolved it."}], [{"date": "1 Nov 2015", "title": "Data Abstractor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 3 days. I interviewed at Bon Secours (Greenville, SC) in May 2015", "Interview Descriptions": "Worked through a recruiting agency - sent in my resume, gave two reference contact information and then was offered the job without even meeting in person - went in to recruiters office to fill out paper work and give a voided check as well as two forms of identification. i was a temporary worker so that is probably why this process was so quick and easy - although i did notice many employees did not seem qualified and were soon let go", "Interview Questions": "what are two reference contacts can we reach"}, {"date": "1 Nov 2016", "title": "Surgical Scheduling Authorization Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Bon Secours (Richmond, VA) in Apr 2015", "Interview Descriptions": "Panel of 5 people asking several questions. How do you handle a tough situation etc. they were asking questions back to back with no pauses. Some managers that you know weren't interested didn't ask any.", "Interview Questions": "How do you manage multi task?"}, {"date": "2 Jan 2018", "title": "Desktop Support Analyst II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Bon Secours (Greenville, SC) in Mar 2015", "Interview Descriptions": "Interview in the phone.  Then once on site.  Showed up 15 minutes beforehand.  Interview with IT manager and IT director, discussed current experience, what the job entails, some basic technical questions, and was followed up within the week.", "Interview Questions": "Technical questions in troubleshooting, experience, what would I like to be doing 5 years, ect.  Pretty standard"}, {"date": "6 Oct 2016", "title": "Patient Registrar Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Bon Secours (Portsmouth, VA) in Feb 2015", "Interview Descriptions": "phone interview, various questions regarding previous experience, skills, pay scale, hours available, previous supervisor experience, cons, pros, past history, why left previous job, liked and disliked about previous job, liked and disliked about previous supervisor, what would you like to see in a manager, position, benefits", "Interview Questions": "previous experience"}, {"date": "4 Sept 2016", "title": "Certified Nursing Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Bon Secours (Richmond, VA) in Feb 2015", "Interview Descriptions": "I applied online and received an email from the unit manager asking for an interview. The interview was very pleasant and under 30 minutes, and I received a phone call from HR within an hour of leaving the hospital", "Interview Questions": "If I was a student and if so what kind of hours would I want to work?\r\n"}, {"date": "22 Sept 2017", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Bon Secours (Richmond, VA) in Jan 2015", "Interview Descriptions": "Group interview on the unit I was applying to. Scheduled for 8pm to meet with night shifters. Day shifters were still there finishing up, so wound up being interviews by them all. Had a packet of questions that they asked.", "Interview Questions": "Was asked to share an experience from working as a nurse. Had not yet worked as a nurse"}, {"date": "14 Aug 2018", "title": "Executive Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Bon Secours (Richmond, VA) in Jan 2015", "Interview Descriptions": "Panel Interview, then back for 2nd panel interview.  need to be well pre-prepared.  Nice people, no difficult questions, no one wants you to be uncomfortable.  Good experience.", "Interview Questions": "What skills do you have specifically?  What do you enjoy most about work"}, {"date": "21 Feb 2018", "title": "Scheduler Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Bon Secours (Richmond, VA) in Dec 2014", "Interview Descriptions": "Phone interview first, then in person interview. Personality test is taken at the time of submitting an application. In person interview included the department supervisor and then the department director", "Interview Questions": "what does stewardship mean to you"}, {"date": "29 Aug 2018", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Bon Secours (Portsmouth, VA) in Dec 2014", "Interview Descriptions": "Hiring manager and two other staff members did a group interview. They were very nice. Explained the position and expectations. I was asked a few questions. We went over my experience. I left the interview feeling good. Got a call a few hours later I got the job.", "Interview Questions": "What is a difficult situation you have been in and how did you handle it?"}, {"date": "1 Oct 2014", "title": "Front Office Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Bon Secours", "Interview Descriptions": "I completed the phone interview successfully and everything went well. The recruiter was very professional and informative about the position. I was very well qualified for the position and actually thought I had a chance of being hired because I have a positive employment background. But, a week later I got a letter stating that I was not eligible for hire because of one negative inquiry on my credit report.\r\n\r\nI felt like I wasted my time applying and interviewing for the position and that was such a slap in the \"face\" because I've worked so hard to go back to school and better my self so that I can get experience in my field of study. My personal credit report has nothing to do with me as a individual and my work ethics. I'm sure not everyone has perfect credit and I felt like this was discrimination; especially coming from an organization that bases it's morals on a Christian background. I was judged for the wrong reason and it cost me the opportunity at a career and training that I very much needed to move forward.\r\n\r\nThere are soooooo many individuals that lie and cheat to get where they are and a honest hardworking person like me can't even get the chance at a better career.", "Interview Questions": "N/A"}], [{"date": "14 Aug 2015", "title": "PCT/CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Bon Secours (Greenville, SC) in Nov 2014", "Interview Descriptions": "Very laid back interview. Only lasted for about 15 minutes. I only had to interview with the supervisor, but others have had to do peer interviews as well since then. They made me feel very comfortable which you don't typically feel like during an interview. Offer came back in a couple days through HR. The whole process was pretty easy.", "Interview Questions": "Why do you want this job?"}, {"date": "19 Oct 2016", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Bon Secours (Norfolk, VA) in Sept 2014", "Interview Descriptions": "First step was phone interview with Talent Acquisition.  Next was in person interview with Medical Director, Manager and Nursing Supervisor. Last was group interview with entire clinic staff.  I was offered the position within 2-3 days but was not able to start work until the company's mandatory orientation, which wasn't being held until a little over 1 month later.  At said orientation, some physicians and other medical staff reported that their hiring process took 3-6 months!", "Interview Questions": "Describe a positive and negative experience from a previous job."}, {"date": "7 Aug 2014", "title": "Unit Clerk Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Bon Secours", "Interview Descriptions": "Interview process was fine.  Just what to be expected.  The whole experience was great.   I loved my time working there and would go back at anytime if living back in South Carolina.", "Interview Questions": "Cannot think of any."}, {"date": "4 Jun 2014", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Bon Secours", "Interview Descriptions": "There was a lot of Human Resources red tape and it was time consuming and hard to get your foot in the door.  But once in, it was easy and fast to grow.  Salaries are set by ranges and are stringently adhered to.  The online application is lengthy.  The onboarding process is also lengthy, but necessary and helpful.", "Interview Questions": "N/A"}, {"date": "10 Jan 2016", "title": "Human Resources Service Advisor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 1 day. I interviewed at Bon Secours (Richmond, VA) in May 2014", "Interview Descriptions": "It was very timeless and they called me the very next day. I did not apply for this position, the recruiter referred me to this position,. I was called for an interview and I got it the next day. Maybe because they had a high turnover rate the reason I got the job so easily", "Interview Questions": "There were none. All the questions were about me as a person"}, {"date": "15 Oct 2015", "title": "Administrative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at Bon Secours (Richmond, VA) in May 2014", "Interview Descriptions": "15 minute interview with the CFO where we just chatted about the office and what what the department does. He asked me about school and extra curricular activities and I listed my fraternity involvement and volunteering.  He then took me around the office and introduced me to all the people in the office who were all friendly and welcoming. I don't think anyone else was being interviewed for the position because after chatting with me he already began telling people I would be helping out over the summer as if I had already been given the position.", "Interview Questions": "Tell me about yourself"}, {"date": "30 Apr 2015", "title": "Financial Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Bon Secours (Baltimore, MD) in May 2014", "Interview Descriptions": "I applied online and had an HR phone screen, Manager (and other leadership) phone interview, Manager (and other leadership) in person interview, and an Excel assessment. After each round, I was told that I would hear within a week, but I did not receive any update until I called the recruiter weeks later.", "Interview Questions": "You seem very smart and motivated, why doesn't your GPA reflect that?"}, {"date": "18 Mar 2014", "title": "Business Development Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Bon Secours", "Interview Descriptions": "Multiple phone interviews", "Interview Questions": "None if you do your homework"}, {"date": "7 Mar 2014", "title": "ICU Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Bon Secours", "Interview Descriptions": "Panel interview, asked about education goals for magnet status", "Interview Questions": "Tell me about a time when you had to..."}, {"date": "25 Nov 2016", "title": "Certified Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Bon Secours (Suffern, NY) in Mar 2014", "Interview Descriptions": "First there was a phone interview and then another phone interview.  I then i took a personality test online and was set up to meet with the office managers. I met them and They asked me about my job skills, went over my resume and then offered me the position.", "Interview Questions": "how long have you been a medical assistant?"}], [{"date": "10 Feb 2014", "title": "Registered Nurse/Telemetry Floor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Bon Secours in Jan 2014", "Interview Descriptions": "I applied to Bon Secours Maryview in November 2013 and received a phone call in the beginning of January to come in for an interview.  I went in for the interview and waited about 10-15 minutes for the interview to actually start.  They asked the basic interview questions... Tell me about yourself, what would your last employer say about you, why do you want to work on the Telemetry floor, etc.  They told me a lot about the company and what the company had to offer.  At the end they asked a scenario question and they also asked if I had any questions to ask them.  They took me on a tour on the unit after the interview.  Before I left, they offered me to come in to see if I would like to shadow just to see if I'm interested in working on the unit. I called 2 days later to schedule to come in to shadow.  They told me in order for me to come into shadow I had to shadow for 12 hours.  I was there for 13 hours!  I sent a Thank you card for the interview and I told them after shadowing the unit, I was interested in working on the Telemetry floor.  After all of this... I didn't get the job.  :-(   I thought the interview and shadow experience went well.", "Interview Questions": "All the questions were straight forward and they weren't difficult.  The most unexpected question would probably be the scenario question which was a priority question."}, {"date": "4 Jan 2014", "title": "Licensed Practical Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Bon Secours in Dec 2013", "Interview Descriptions": "I was contacted by Bon Secours within one week post application submittal. I had gone on a total of three interviews, two with immediate hiring managers and one with a practicing physician. The overall interview process was amazing! I was greeted with warm smiles and made to feel comfortable in the physicians' office. I was told, in great detail, what was to be expected of me as an incoming LPN. All staff members, from the patient care technicians to the physicians, were extremely friendly, courteous and helpful.", "Interview Questions": "The most difficult question I have trouble answering is the dreaded, \"what are your weaknesses?\". I have become so in tune with my positive attributes that I found it somewhat time consuming to come up with (and somehow turn into a positive) a weakness of mine."}, {"date": "8 May 2015", "title": "Medical Assistant On Care-van Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at Bon Secours (Norfolk, VA) in Jun 2013", "Interview Descriptions": "easy they made me feel comfortable and just had to answer the basic interview questions. they were flexible in doing the interview process. Intervirwed with the head nurse and they gave you a tour afterward.", "Interview Questions": "Tell me about yourself"}, {"date": "4 Apr 2016", "title": "Human Resources Service Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 3 days. I interviewed at Bon Secours (Richmond, VA) in Apr 2013", "Interview Descriptions": "The interview process was short. Only one interview. Asked mainly about my previous experience as well as how proficient I was in Microsoft Word, Microsoft Excel, Microsoft Powerpoint. No question was too strenuous.", "Interview Questions": "How good are you with technology?"}, {"date": "9 Nov 2013", "title": "Telephone Operator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Bon Secours (Midlothian, VA) in Mar 2013", "Interview Descriptions": "Was interviewed by the manager and the team lead. Very open and friendly ladies. Made you feel very comfortable. Seemed to be pretty set on hiring me even before the interview but just wanted to see if my personality was a good fit.", "Interview Questions": "Strengths & Weaknesses "}, {"date": "11 Jun 2013", "title": "Systems Administrator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Bon Secours (Richmond, VA) in Sept 2012", "Interview Descriptions": "Was a contractor employed by X. Started Desktop Support and after a year or so of studying on my own, running labs in the office, and certifying I moved on to the Systems Administrator position. \r\n\r\nFull time positions opened up and I filled one of those available. Had formal interview for my own job. Went as expected.", "Interview Questions": "N/A"}, {"date": "18 Nov 2015", "title": "PSR Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Bon Secours (Richmond, VA) in Sept 2012", "Interview Descriptions": "Very Relaxed, conversational and the interviewers appeared very interested in my background and how great my experience would be to the organization. The The interview took place on a Thursday and the job offer came on a Wednesday of the following week. Then HR reached out to me to provide me with the procedure of hiring and the forms that needed to be completed on line.", "Interview Questions": "Where do you see your self within Bon Secours?"}, {"date": "28 Dec 2016", "title": "Histology Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 3 months. I interviewed at Bon Secours (Norfolk, VA) in Aug 2012", "Interview Descriptions": "resume submitted , phone interview  and on site interview tour of hospital.wait for call back .it took about 3 months to hear back , very long if you need a job right away", "Interview Questions": "hours availability "}, {"date": "23 Sept 2013", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Bon Secours (Richmond, VA) in May 2012", "Interview Descriptions": "Initial step is the online application. Create a profile, save your info as you go. You can then use that completed form to apply for multiple Bon Secours positions and it is much faster. Once the app is submitted, you will be asked to complete the \"survey\" - it is a personality survey that determines if you would be a good fit within the company. It will ask similar questions over and over in different ways - to see if you change your answers each time, or if you are consistent. Be consistent! If you for some reason do not pass the personality survey, the HR dept will not even receive your app and you would be discarded as a candidate. So take your time with that survey!\r\n\r\nOnce you get through that exhausting process online, it's a waiting game for the call from HR. Hopefully, you will receive a call inviting you to interview with one of the managers. You will not really be given any info, other than what the position is and the name of the nurse manager, and of course the time and place for the interview.\r\n\r\nAt the interview, usually you'll meet with the nurse manager at the unit, spend some time interviewing in the office, and then spend some time taking a tour of the unit. Sometimes the nurse educator or assistant nurse manager would also sit in on the interview. Once it's over, you'll leave (hopefully with a business card!) and follow up by email to say thank you.\r\n\r\nIt totally depends on the unit and the urgency as to how long it will take to hear something. I would follow up with the HR rep after the interview, let them know how it went, that you do want the job, and to say thanks. My experience was that the following week I go a call back from HR with an offer.", "Interview Questions": "The interview questions are all \"behavioral\" nowadays... \"Tell me about a time when...\"\r\n\r\nOne hard one was, \"Tell me about a time when you felt angry while at work, and how was it resolved.\" That was hard!"}, {"date": "20 Feb 2016", "title": "Licensed Practical Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 3 weeks. I interviewed at Bon Secours in Apr 2012", "Interview Descriptions": "I was interviewed after being observed in clinical, the overall interview was very informal. I had the position before it was posted. The longest part of the entire process was waiting on HR. You also have to travel do do health screenings and it would been nice if they did them on site.", "Interview Questions": "What is one thing about yourself you would like to improve."}], [{"date": "8 Sept 2015", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Bon Secours (Norfolk, VA) in Mar 2012", "Interview Descriptions": "I applied online, got a call back within a week and was set up for an interview the following week. The interview itself was pretty simple because even though I was interviewing with Bon Secours, I was interviewed by the practice manager of the practice that I was going to work for.", "Interview Questions": "What are some of your weaknesses?"}, {"date": "16 Sept 2015", "title": "CVT Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Bon Secours (Portsmouth, VA) in Aug 2011", "Interview Descriptions": "The interview process was approx 5 years ago so I am sure things have changed. The manager was very nice and polite. I was introduced to some of the staff they were all very friendly. There was one house keeper lady who gave me a hug and said welcome to Maryview. They made you feel very welcome there.", "Interview Questions": "Why do you want to work for Bon Secours?"}, {"date": "23 Sept 2015", "title": "Certified Surgical Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at Bon Secours (Warwick, NY) in Jul 2011", "Interview Descriptions": "I was given a tour of the OR Suites, was told a little bit about the company and the types of surgeries performed. My resume was reviewed with me and I was given the opportunity to ask questions.", "Interview Questions": "Would I be able to take call on a rotating basis?"}, {"date": "21 Oct 2015", "title": "Trainer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 1+ week. I interviewed at Bon Secours (Richmond, VA) in May 2011", "Interview Descriptions": "Very brief phone interview. I was asked where is area code 713. Was asked what modules have I trained in Epic. Interview was very superficial. I was told I got the pistion/contract on a Wenesday and was expected to be on site the following Monday. I would have liked more notice.", "Interview Questions": "How long have you trained Epic?\r\nWhere is the area code 713?\r\nWhat modules have I trained in Epic?"}, {"date": "17 Nov 2015", "title": "Medical Laboratory Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Bon Secours (Norfolk, VA) in Feb 2011", "Interview Descriptions": "I met with the hiring manager who was very nice whom I loved working for. It was very easy and swift started orientation right away.  I am surprised how professional and helpful they were on my first day of orientation.", "Interview Questions": "What made you choose them as an employer to work for?"}, {"date": "9 Mar 2011", "title": "Executive Assistant to Chief Executive Officer At Good Samaritan, Suffern, NY Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "The process took 3 months. I interviewed at Bon Secours (Suffern, NY) in Oct 2010", "Interview Descriptions": "I received an email after I applied online, asking me to call to set up in person interview. That was only the start of almost 4 months of wasted time. Offices looked old and messy, employees look unmotivated and are CERTAINLY not proactive at all.  They just pretend they work and issues will go on for months, no one takes initiative.\r\n\r\nThe \"process\" is very informal and unorganized, with no follow-up whatsoever.  No one cares.", "Interview Questions": "How did you end up in USA?"}, {"date": "29 Jan 2014", "title": "Clinical Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at Bon Secours (Richmond, VA) in Jul 2010", "Interview Descriptions": "Interview process is handled by a peer review process", "Interview Questions": "What is the most stressful situation that you have found yourself in?"}, {"date": "12 Sept 2014", "title": "Recruiter Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied in-person. The process took 3 months. I interviewed at Bon Secours in Mar 2010", "Interview Descriptions": "Initially, I started as a temp.  Most of the interview process was via on-the-job performance and interpersonal communication.  Eventually, a permanent opportunity opened up and I was asked  to interview with the hiring manager.  They were all very professional and clearly had an awesome  department culture--I was very happy to become a part of that.", "Interview Questions": "Tell me about a time in your career when a former manager asked you to do something unethical?"}]]