[[{"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": 3, "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Busy, but worthwhile", "rating": "5.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "22 Mar 2023", "job_title": "Writing Center Tutor in Buena Vista, VA", "duration": "N/A", "pros": "The work hours are pretty flexible, and the job is right on campus, so it's really convenient for a student worker. Helping students improve their writing is rewarding.", "cons": "Work volume is inconsistent. Some shifts will help 1-2 students in an hour, while other shifts will have 2 tutors trying to help a room of 12 people. Days like these can be stressful, especially when a big paper is due and dozens of students need your help to get back on track."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 5, "Culture & Values": 3, "Diversity and Inclusion": 3, "Career Opportunities": 0, "Compensation and Benefits": 1, "Senior Management": 4, "review_title": "Great Boss, some of the other IT faculty are unprofessional", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "3 Feb 2022", "job_title": "IT Help Desk in Buena Vista, VA", "duration": "N/A", "pros": "-The IT director is fantastic and helps us learn new skills \r\n-Fairly simple to navigate workload\r\n-IT director is a great boss.", "cons": "-some of the full time staff are not professional at all and lack credentials to even have their position. \r\n-lack of communication skills of one of the IT developers, uses his “power” or lack of to be rude to student workers.\r\n-Younger developer is rude."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Uplifting and Positive Experience", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "25 Apr 2022", "job_title": "Anonymous Employee in Buena Vista, VA", "duration": "N/A", "pros": "Working here jump-started my career. A very uplifting and creative environment", "cons": "There was some lack of communication."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Wonderful Student Body, Unsupportive Administration", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "29 Apr 2021", "job_title": "Wellness Center in Buena Vista, VA", "duration": "N/A", "pros": "Enjoyed working with my co-workers and with the motivated student population. Together our team generated lots of ideas for improvement in advocating for mental health on across the campus. I value the professional connections I made with my team.", "cons": "Unfortunately upper management and administration does not support mental health and the impacts it has on the success of their students. After being dismissed several times on ideas, policies, and topics that should be integral to the campus when it comes to mental health awareness and advocacy, it became a stagnant place to work with no value placed on supporting students with mental health concerns. Sadly, it became a better option to look for employment where my expertise was valued and the upper management advocated for mental health awareness."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": 4, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Incredible community with innovative strategy", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "22 Sept 2021", "job_title": "Director of Financial Aid in Buena Vista, VA", "duration": "N/A", "pros": "Close-knit community with coworkers and managers who care about you. If you demonstrate good judgement and marked improvement in your area, you'll be given more and more opportunity to grow and lead at the university.", "cons": "The town is really small with not much to do in terms of entertainment unless you like being outdoors and then it's amazing!"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Awesome!", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "2 Jul 2021", "job_title": "Intern in Buena Vista, VA", "duration": "N/A", "pros": "Loved working here. They really care about their employees!", "cons": "Once I got into the routine, I didn't feel very challenged"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 3, "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 5, "review_title": "Awesome Marketing Team", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "23 Oct 2020", "job_title": "Social Media/Marketing Specialist in Buena Vista, VA", "duration": "N/A", "pros": "Awesome teams, lots of collaboration, and a chance to feel included and give input on projects.", "cons": "Still a young company with lots of opportunities for growth, which I guess can be considered a pro too."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "The current leadership (2020) is very poor and very self serving", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "23 Jul 2020", "job_title": "Varied in Buena Vista, VA", "duration": "N/A", "pros": "Working with the students (who are always positive) and most of the faculty and staff is great.", "cons": "The LDS environment only exists below the president's council. Look closely and you will find most of the positive reviews are from those former students who were hired right after graduation. They are thankful to have any job, willing to accept low pay, and generally do not deal with the administration,"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 1, "Senior Management": 0, "review_title": "SVU review", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "20 Oct 2015", "job_title": "Anonymous Employee in Buena Vista, VA", "duration": "N/A", "pros": "Great academic environment. Beautiful campus. Students come from all over the world to be a part of this experience. Have recently restructured to allow more women and faculty to be on the President's Council.", "cons": "It is still a relatively young campus - since the transition from Southern Seminary, to Southern Virginia College, to Southern Virginia University. Organization and financial restructuring is still a pressing issue but they have the people to improve efficiencies and to make things work."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 0, "Senior Management": 4, "review_title": "Overworked, Underpaid, Great Students", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "10 Jan 2014", "job_title": "Professor in Buena Vista, VA", "duration": "N/A", "pros": "If you have always wanted to start a club, take students abroad, engage in some new scholarship, offer suggestions to the administration this is a good place to do it.  The institution is young and eager for new ideas and approaches.", "cons": "The environment is patriarchal with more emphasis on the LDS environment than on academics, even though it is supposed to be independent of the church.  The academic environment is encouraging, but there is no active faculty senate.  The academic program, curriculum, and course sequencing is run entirely by the administration....with some faculty input....but no faculty decision making."}], [{"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "There's not much money to be made, but you get plenty of opportunities to do what you love most as your career.", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "29 Mar 2012", "job_title": "Coach in Buena Vista, VA", "duration": "N/A", "pros": "-Great atmosphere\r\n-Strongly enforced honor code system (could be negative depending on ow you want to look at it)\r\n-Small town feel with tremendous support from the locals.\r\n-Great tutoring system to help your athletes", "cons": "-Again, small paycheck (It's only a school of 800 students so that's understandable)\r\n-No benefits packages for some of the full-time employees\r\n-Very little Athletic facilities and offices"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Very Grateful - Gather, Lift, Launch", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "29 Jun 2020", "job_title": "Assistant Professor in Buena Vista, VA", "duration": "N/A", "pros": "As a graduate of Southern Virginia University, it was a marvelous opportunity to return and work full time teaching in the business program 15 years after I graduated. I was both excited and humbly intimidated to be considered a full-fledged colleague by the wonderful and caring teachers I had taken courses from many years before. As my co-workers I continued to be guided by their example and heartfelt outreach both when I began my teaching as well as throughout my time there. The Faculty Development Committee was generous and extremely supportive in helping me pursue both research and instructional development goals. During my first year, a faculty member offered to meet with me in weekly meetings where the agenda was set mostly by my questions. We discussed instructional theory, degree requirements, past course content, current events, professional development opportunities, institutional goals among other topics. Other faculty offered first-year-teaching suggestions sincerely and humbly. Truly, my experience coming into the organization was noteworthy. It was (and is) easy to see the love and concern the faculty have for the students and for the institution. I thoroughly enjoyed the many and storied examples of faculty sacrificing time and resources for the students. \r\nMy classroom teaching experiences were probably not ordinary. Students were not intimidated to share their personal beliefs about the world or about themselves--their hopes and dreams, as well as their struggles and obstacles. This willingness to share was constructive and led to additional understanding.\r\nI remain extremely grateful for the opportunity to work and learn together at this special institution at this special time. These will be days long remembered.\r\nI wholeheartedly recommend the faculty, the administration, and the institution as it continues to pursue its mission to Gather, Lift, and Launch!", "cons": "As one of the fastest growing on-campus, private universities in the country (maybe the world?), Southern Virginia University as an institution is no stranger to challenges. The challenge of growth is both a blessing and a challenge. Other institutions may never experience the kind of growth SVU has experienced in just a few short years. Adapting to this growth requires willingness to change and adapt from everyone. Notwithstanding this challenge and future challenges I think SVU is well anchored and well positioned to move forward."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 5, "review_title": "Excellent Place to Work", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "13 Aug 2020", "job_title": "Admissions Recruiter in Buena Vista, VA", "duration": "N/A", "pros": "There are too many to put in one place! I'll outline a few:\r\nBecause of the nature of a university that's still in its growing stages, there are opportunities to get exposure to many areas within the organization. While in my position, I was able to work in 4-5 seemingly unrelated roles, and interacted frequently with other departments. \r\nAdditionally, a strong commitment to the mission, success and growth of the university is pervasive across all faculty, staff and students. Because it's a small university, coworkers can easily become friends, and the result is a tight-knit community of hardworking individuals striving for the same goal. \r\nI also always felt a strong sense of transparency from management about the state of the university, policy changes (and reasons for them), as well as announcements that wouldn't normally reach the employees until weeks or months after implementation.", "cons": "With the \"start-up\" nature of the university comes a certain culture of overloading. While family-friendly and welcoming, it's not uncommon to have individuals so overworked that they're either unable to spend time with their family/friends or who feel guilty doing anything other than work. Managers may make efforts to persuade their employees to take time off, but most don't exemplify that behavior or (consciously or unconsciously) encourage a disproportionate work-life ratio. There are certain departments that, of necessity, need to be available and working 24/7/365. However, on top of that it's not uncommon for one employee to be laden with so many responsibilities (this happens at every level of the administration, faculty, and staff) that they hardly have time for anything else in their life. Often an increase in responsibility does not come with increased compensation or allowances in other areas of the employee's role. \r\nThis has been the case for the last 10-15 years, and as the university continues to mature I hope that this cultural phenomenon becomes less prevalent."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Southern Virginia is a great institution for higher learning. They truly care about the success of the students.", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "18 Mar 2015", "job_title": "Anonymous Employee in Buena Vista, VA", "duration": "N/A", "pros": "The Professors are highly qualified and sincerely love the students attending. They will truly do anything possible to help in any way.", "cons": "Sometimes the students complain about the experience because they lack the vision of a liberal arts education. Not enough focus on the right values."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 5, "review_title": "ok", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "5 Sept 2011", "job_title": " in Buena Vista, VA", "duration": "N/A", "pros": "Working at Jonzzey's while attending Southern Virginia University can help pay the bills while attending college. It is also a good alternative to the school cafeteria.", "cons": "One thing I don't like very much about working at Jonzzey's, is that you smell like sandwiches after work. yuck!"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 5, "review_title": "Great Environment", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "12 Aug 2020", "job_title": "Head Coach in Buena Vista, VA", "duration": "N/A", "pros": "Love the environment, the athletic department, and the kids.  Couldn't ask to work with better people.", "cons": "As with any small school, facilities are a struggle.  But administration is very willing to help find remedies."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Love it!", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "4 Jun 2018", "job_title": "Career Development Center Manager/Career Coach in Buena Vista, VA", "duration": "N/A", "pros": "The people and atmosphere are wonderful! Loved to be a part of this community for so long.", "cons": "Not a ton to do around here, but we make our own fun! Avoid gossipy people."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 5, "review_title": "Excellent employers, great atmosphere, fun to work with.", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "27 Jan 2015", "job_title": "Customer Service Associate in Buena Vista, VA", "duration": "N/A", "pros": "Fun atmosphere, flexible schedule, great students", "cons": "Very few hours, no benefits, low salary"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Student Ambassador", "rating": "5.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "28 Sept 2015", "job_title": "Student Ambassador in Buena Vista, VA", "duration": "N/A", "pros": "I enjoyed working with a tight-knit team.  Also our boss was friendly.", "cons": "I don't have any cons to report."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 0, "Senior Management": 3, "review_title": "Okay", "rating": "4.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "25 Feb 2013", "job_title": "Admissions Assistant in Buena Vista, VA", "duration": "N/A", "pros": "very flexible, great people, growing organization", "cons": "very vertical organization, didn't have opportunities to give very much input."}], [{"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Great place to work!", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "12 Jul 2020", "job_title": "Housing Associate in Buena Vista, VA", "duration": "N/A", "pros": "This has been a great place to work.", "cons": "Access to small budgets to update facilities, boost culture, and moral."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Great Environment", "rating": "4.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "14 Sept 2013", "job_title": "Student Ambassador in Buena Vista, VA", "duration": "N/A", "pros": "Some of the best people one could work with, Uplifting Environment, Beautiful surroundings", "cons": "Small room for advancement, Limited flexibility"}]]