[[{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "Great non for profit organization to work with", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "31 Jan 2023", "job_title": "IT Coordinator in Whitchurch-Stouffville, ON", "duration": "N/A", "pros": "It is a non for profit organization that not just help people who are poor but a person with disability. It is warm to work for everyone treated each other like a family not just as a coworker. Employees benefits are well compensated", "cons": "Since it is a charity organization you may not get paid well enough on what you desire. But the benefits are great."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Not a place to work if you want to feel valued and appreciated.", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "27 Mar 2023", "job_title": " in Richmond Hill, ON", "duration": "N/A", "pros": "l liked the staff I was able to work with, not from management but the staff that actually do the work.", "cons": "Management and Executive members do not value your input. They talk down to you, cut you off and belittle you. They show no respect at all. It always has to be their way or you're out. I highly suggest you take your talents elsewhere."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": 3, "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "Amazing organization working to impact the lives of children with disability in poor countries", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "28 Jan 2023", "job_title": "Anonymous Employee in Richmond Hill, ON", "duration": "N/A", "pros": "Great team! Lots of really knowledgeable staff who are highly dedicated. Fair salary and very good benefits. Feel like I’m making a difference. Lots of flexibility. Highly driven organization.", "cons": "Lots of one person roles so it’s difficult when staff are on vacation or when jobs turn over."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 3, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Beware, Terrible Management and Org Structure", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "16 Nov 2021", "job_title": "Anonymous Employee in Whitchurch-Stouffville, ON", "duration": "N/A", "pros": "Pros: um, there was a pretty cool lunch club?", "cons": "Where do I begin??\r\nHands down, bar-none the WORST organization I have ever had the displeasure of working for. \r\n\r\nI was so very invested in the mission when I was first hired, but the management, mainly executive team, run things by ego alone - with no industry knowledge, strategic direction, or human resources understanding. The \"leadership\" team is made up of individuals who have no business acumen and make decisions based on their moods, which are frequently erratic. \r\n\r\nEverything, every day is like the sky is falling. The organization is run by fear and decisions made at the drop of a hat, whichever way the wind blows, and without regard for people, funds, or any industry best practices. \r\n\r\nIt's been said there is a \"tradition\" of firing people who show any signs of knowledge, experience, or any drive to succeed. \"Leadership\" sees any up-and-comers as a threat to their 30 yr, 20 year, and 12 year roles within the org.\r\n\r\nRun! Do not pass go. Do not collect $200. Do not waste your time working for executives that will no sooner feel threatened by anyone smart, capable, and reasonable and let you go without a second thought. \r\n\r\nSo so so many people have quit this organization. Turnover is beyond compare."}], []]