[[{"date": "2 May 2023", "title": "Controller Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Valley Health (Virginia and West Virginia)", "Interview Descriptions": "Phone screen, 1st interview. did not proceed further. The questions were fairly routine and felt the tone was conversational. The interviewer was very understanding and knowledgeable. Would not hesitate to speak to them again.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "21 Jan 2023", "title": "Physician Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Valley Health (Virginia and West Virginia)", "Interview Descriptions": "Phone interview with hospital recruiter was very pleasant. She asked the typical interview questions (tell me about yourself, why are you interested in this position, what are your hobbies, etc). She was very nice and made me feel comfortable. The second part of the interview was a “working interview” day with the team. Everyone was very welcoming and was happy to answer questions. They even catered lunch. I already felt like a welcome member of the team. I have not gotten an offer yet (it has only been a few days) but appreciate the resources and time that went in to interviewing me.", "Interview Questions": "Tell me about a time when a patient encounter did not go to plan, how did you rectify the situation?"}, {"date": "30 Dec 2022", "title": "Registered Nurse, BSN Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Valley Health (Virginia and West Virginia)", "Interview Descriptions": "They were very welcoming and explained the unit, the amount of teamwork, what orientation would look like along with how long it would be. They were open to my questions and gave me a tour of the unit", "Interview Questions": "What was my greatest strength and weakness"}, {"date": "27 Jul 2022", "title": "Patient Care Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Valley Health (Virginia and West Virginia)", "Interview Descriptions": "HR Phone Interview and then interview with the manager of the floor. The HR rep mainly asked my availability and about start dates/ times. She also asked me about when I would be available for trainings. The questions from the floor manager were straight forward and daily easy (What are your strengths and weaknesses?; tell me about yourself.) The manager and a another nurse were the interviewers and I think a lot of it was a \"body language\" interview.", "Interview Questions": "N/A"}, {"date": "27 Dec 2021", "title": "Hospitality Aide Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Valley Health (Virginia and West Virginia) (Winchester, VA) in Dec 2021", "Interview Descriptions": "Top notch very friendly and observation was greatly appreciated, the tour was awesome and informative as well as well kept and sterile operations! Masks were always worn and all employees vaccinated as required makes me feel safe", "Interview Questions": "Basically have done the job before"}, {"date": "24 Aug 2021", "title": "BI Developer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Valley Health (Virginia and West Virginia)", "Interview Descriptions": "There were 3 steps, the first one being a phone call with project admin and was just a casual talk and she said she would  schedule an interview with the team for 30 min. \n\nNext scheduled a zoom meeting for 30 min with most of the team members and  went through my current project and some behavioral questions.\n\nNext Interview was scheduled for an hour with the hiring manager and all the team members, interview was again mostly behavioral questions along with simple sql questions. Also asked to complete an EPIC recommended analytical test before the interview which I did.\n\nwas contacted by hiring manager after a week for references from the current job which were provided, but nothing after that. I sent a follow-up email and never heard back from . What's  frustrating is the way they ghosted me ,no feed back nothing,  if I'm not right for a position I'm fine hearing just that. I believe that they just asked for the references to complete their recruitment process even though they knew I  was not going to get the offer. I have invested my time just as them and getting back to me with a feedback is not much to ask. That's a very bad process.", "Interview Questions": "Mostly Behavioral questions and few questions about sql."}, {"date": "12 Jul 2021", "title": "Director of Government Affairs Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Valley Health (Virginia and West Virginia)", "Interview Descriptions": "Very odd interview process. I was cold called and then had an almost adversarial conversation with the HR person. This happened twice when they had called me again for another open position. The second person was nice, but still a strange experience.", "Interview Questions": "Confrontational questions that felt very off. "}, {"date": "21 May 2021", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Valley Health (Virginia and West Virginia)", "Interview Descriptions": "Great experience. The interviewer was very professional and provided me with a lot of beneficial information. I cannot wait to start my job here because I feel it will be a synergistic environment.", "Interview Questions": "Why are you interested in this field"}, {"date": "17 Sept 2020", "title": "Staff RN Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at Valley Health (Virginia and West Virginia) (Purcellville, VA)", "Interview Descriptions": "I have put in for several positions and have never gotten an interview.  There is no way to follow up with anyone unless you know someone in the system as the HR department specifically says that you cannot check on an application over the phone.  I have over 25 years experience as an RN, BSN in a variety of settings but can’t get my foot in the door.", "Interview Questions": "Can’t get to this point!"}], [{"date": "7 Jan 2020", "title": "Clinical Research Associate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Valley Health (Virginia and West Virginia) (Winchester, VA) in Oct 2019", "Interview Descriptions": "the Interview went OK, but I did not realize that they discriminate people based on their look and religion, the hiring manager said she will contact me regarding her decision, but she did not contact me at all, their selection based on connection and friendship, not education nor experinec .", "Interview Questions": "you are overqualified, why you pick this position? "}, {"date": "19 Aug 2019", "title": "Registered Nurse Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Valley Health (Virginia and West Virginia) (Winchester, VA) in Aug 2019", "Interview Descriptions": "Phone interview with nurse manager, brief in person interview with nurse manager and two hours shadowing with nurse on unit. Super friendly and professional recruiters assisted during the application process.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "13 Sept 2019", "title": "RN Lactation Consultant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Valley Health (Virginia and West Virginia) (Winchester, VA) in Jun 2019", "Interview Descriptions": "I was not even able to get into the interview process as human resources contacted me the day after filing my application and stated I wasn't qualified because I had no current Lactation certifications. When I explained that the job posting only required the a lactation certification be obtained within 2 years, I was brushed off.", "Interview Questions": "I did not make it to the interview process due to situation above. I have noted that the job posting description has yet to be changed to something more unambiguous."}, {"date": "21 May 2019", "title": "CT Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Valley Health (Virginia and West Virginia)", "Interview Descriptions": "Very in depth and thorough. It wasn't one of those interviews that felt rushed and in a hurry. I traveled from out of state, my interview was about and hour. Met with management, got a tour, met other staff working, and even a Dr. Or two. It was worth the trip to go there from out of state.", "Interview Questions": "Describe a positive patient experience. "}, {"date": "18 Apr 2019", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Valley Health (Virginia and West Virginia)", "Interview Descriptions": "The interview was very long for an internship. I met with eight people over the course of three hours. Each interviewer asked the same questions, so by the time I met with the last person I was able to anticipate which question they would ask next.", "Interview Questions": "Give an example of one of your weaknesses and one of your strengths."}, {"date": "25 Jul 2018", "title": "Urgent Care Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Valley Health (Virginia and West Virginia) (Winchester, VA)", "Interview Descriptions": "Application was sent in for a different job, and was sent over to another Director. A few days latter, had a phone call and setup meeting for face to face. Interview was very straight forward. Had to take a personality online exam. Walked out when done. Had to contact Director to determine if I was hired. I wasn’t.", "Interview Questions": "What was a negative situation you turned into a positive"}, {"date": "5 Oct 2016", "title": "EPIC Senior Systems Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Valley Health (Virginia and West Virginia) (Winchester, VA) in Sept 2016", "Interview Descriptions": "Applied online, and hiring supervisor/HR scheduled an in-person interview. Interview was with 3 separate groups within the EPIC team and the Director. The group went over what each team does and how they interconnect. They described their daily work life as well as the on-call process and what the training and certification process is like.", "Interview Questions": "No crazy questions, just your basic IT Analyst type. Tell us about a project you have worked on in the past. Tell us how you handle multiple projects at once. "}, {"date": "18 Jul 2018", "title": "Certified Nursing Assistant CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Valley Health (Virginia and West Virginia) (Chilhowie, VA) in Jul 2016", "Interview Descriptions": "Interview wasn’t bad. Manager was very easy going. Almost didn’t care what you said. I walked in their to fill an application and got hired . They really need staffs, because so many people hate the place and leaves often.", "Interview Questions": "Are you Certified?"}], [{"date": "20 Dec 2015", "title": "Physician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Valley Health (Virginia and West Virginia) (Portland, OR) in Dec 2015", "Interview Descriptions": "I submitted the online application, spoke with physician on the phone, then an interview was arranged.  They covered travel costs. I met the management and physicians at the outpatient clinic site, and I was interviewed by three physicians and managers.  I had a tour of the facility afterwards. They also arranged a dinner with more of the physicians that evening.", "Interview Questions": "Describe a difficult interpersonal scenario that you have dealt with, and how did I handle it?"}, {"date": "17 Nov 2015", "title": "IS Summer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Valley Health (Virginia and West Virginia) (Winchester, VA) in May 2015", "Interview Descriptions": "There wasn't was not an interview process. I was close with one of the employees and he referred me to the IS department to work as a summer intern. I soon after received an email asking if I would like to participate in the summer intern program.", "Interview Questions": "When would you like to start?"}, {"date": "16 Jan 2018", "title": "Insurance Credentialing Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Valley Health (Virginia and West Virginia) (Winchester, VA) in Mar 2015", "Interview Descriptions": "No questions related to Insurance Credentialing. Wanted people that would not ask questions or push back. Looking for timid obedient persons that will never offer ideas, or suggestions to help the department work more effeciently.", "Interview Questions": "What kind of bird are you, Dove, Eagle.."}, {"date": "10 Jul 2013", "title": "Radiologic Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Valley Health (Virginia and West Virginia)", "Interview Descriptions": "Applied online, and was contacted by HR to schedule an in-person interview. Interview was with supervisor and a Full-time Rad Tech at the location", "Interview Questions": "No real off the wall questions, just very standard interview questions"}, {"date": "4 Jan 2014", "title": "Housekeeper Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Valley Health (Virginia and West Virginia) (Winchester, VA) in Dec 2012", "Interview Descriptions": "Explained the position well. took forever for a call back though", "Interview Questions": "N/A"}]]