[[{"date": "3 Aug 2022", "title": "Behavior Health Trainer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Partnerships in Community Living (Monmouth, OR) in Aug 2022", "Interview Descriptions": "The interview process was very supportive. I got a call, did a phone screen and within did a panel interview where I gave a short presentation to show skills. Within a day of my interview I was offered a position!", "Interview Questions": "They asked about giving credit where credit is due, training experience, when a training has gone wrong and how to address it"}, {"date": "24 Jan 2021", "title": "Direct Support Professional Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Partnerships in Community Living", "Interview Descriptions": "i the interview process is really fun they will tell you at the end if youre are pre hired. THEY DO DRUG TEST. mine was for the day after the interview and if you miss it you can’t reapply for 60 days.", "Interview Questions": "its a surprise but just be yourself and nice"}, {"date": "21 Sept 2018", "title": "DSP Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 days. I interviewed at Partnerships in Community Living (Eugene, OR) in Aug 2018", "Interview Descriptions": "Got a call to set up an interview.  Which the interview was in a group. Was asked to participate in a three part interview. These parts were a creative challenge.  To build and work as a team. The next step was a test of computer skills. After we were separated and asked interview questions.", "Interview Questions": "Do you have any experience in this field."}, {"date": "16 Mar 2018", "title": "DSP Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Partnerships in Community Living (Monmouth, OR)", "Interview Descriptions": "It was a group interview and it was a like two day process.  their was multiple interviewers and we also got to play some games. so they could learn about us and how we interact as a team.", "Interview Questions": "What humility means to me"}, {"date": "16 Feb 2018", "title": "DSP Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Partnerships in Community Living (Salem, OR) in Jan 2018", "Interview Descriptions": "I went to a job fair that had multiple portions and was offered a job at the fair. I truly enjoyed the process and would recommend it to anyone. The Job was a craigslist listing.", "Interview Questions": "How to build a team structure in a small amount of time."}, {"date": "22 Dec 2017", "title": "Direct Support Professional Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Partnerships in Community Living", "Interview Descriptions": "We arrived and were introduced to the interviewers.  We got the chance to say why we came to PCL and then we had a teamwork project which I felt we all did good on. After that we had one on one time with the interviewers where they asked as a few questions each.", "Interview Questions": "If someone supported one of your family members, what would you look for? "}, {"date": "18 Aug 2017", "title": "DSP Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Partnerships in Community Living (Monmouth, OR) in Aug 2017", "Interview Descriptions": "We did a large group interview and did a \"speed dating\" process and was asked questions from many DSP's. We then broke into groups and did a exercise with our group to complete a designed task.", "Interview Questions": "What was one example you worked in a team to complete a task. "}, {"date": "18 Aug 2017", "title": "DSP Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Partnerships in Community Living (Monmouth, OR) in Jul 2017", "Interview Descriptions": "fun, comfortable. The interview involved at least one of the PCL supported individuals in the interview process and I think that's wonderful. I liked the interview, i did not like how long it took from the time i applied until the time the interview was scheduled.", "Interview Questions": "how do you deal with stress"}, {"date": "18 Aug 2017", "title": "DSP Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Partnerships in Community Living (Monmouth, OR) in Jul 2017", "Interview Descriptions": "Interesting but long; It was a two hour interview. I am not used to a speed-dating approach to the interview process. I did enjoy the group activity however.  I appreciate the transparency in their desire to hire team players", "Interview Questions": "N/A"}, {"date": "18 Aug 2017", "title": "Direct Support Professional Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Partnerships in Community Living (Monmouth, OR) in Jul 2017", "Interview Descriptions": "There was a group interview, consisting of online portions, group/teamwork activities, and an individual round robin set of interviews. After the interview, I was contacted the next day and asked to come in to the main office to fill out paperwork.", "Interview Questions": "One question was focused on identifying three qualities that I would look for if I was hiring a DSP for a family member, then how I would rate myself on the identified qualities."}], [{"date": "18 Aug 2017", "title": "Direct Support Professional Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Partnerships in Community Living (Salem, OR) in Jul 2017", "Interview Descriptions": "Group interview can be frustrating and cause anxiety for some people. It was broke into groups and did have a few fun activities to break up the anxiety. They asked a lot of questions about the ethics and values of individuals to make sure those line up with company goals and values as well.", "Interview Questions": "Why do I want to work in this field?"}, {"date": "18 Aug 2017", "title": "DSP Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Partnerships in Community Living (Monmouth, OR) in Jul 2017", "Interview Descriptions": "It was like speed dating. About 10 or 12 people rotated between potential hires, then moved on. They asked questions like have you done this type of work before. How do you handle stress. Are you comfortable doing these type of tasks assosiated with the job.", "Interview Questions": "How do you deal with stress"}, {"date": "18 Aug 2017", "title": "Direct Support Professional Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Partnerships in Community Living (Salem, OR) in Jul 2017", "Interview Descriptions": "Group setting allowed to view individuals in utilizing teamwork skills and speed interviewing allowed individual responses for the interviewers to get to know a snippet of the candidates personally.", "Interview Questions": "Thay asked me about my integrity and how I have previously dealt with a mistake I have made."}, {"date": "21 Jul 2017", "title": "Direct Support Professional Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Partnerships in Community Living (Salem, OR) in Jun 2017", "Interview Descriptions": "It was a group interview. We did some things to break the ice and reduce tension. Then we were all given a chance to answer questions and demonstrate our teamwork ability.", "Interview Questions": "How do you value teamwork? Can your skills be improved?"}, {"date": "21 Jul 2017", "title": "DSP Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Partnerships in Community Living (Salem, OR) in Jun 2017", "Interview Descriptions": "Group interview where multiple employees went around and asked a variety of questions. Then there was a group activity to build a structure using spaghetti noodles and marshmallows. Overall the process was very interactive.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "26 May 2017", "title": "Direct Support Professional Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Partnerships in Community Living (Grants Pass, OR) in May 2017", "Interview Descriptions": "It was a group interview. But the interviewers weren't just supervisors it was an integrated interview from the highs and the lows of pcl after getting to know each person it went smooth and helped me get through the interview.", "Interview Questions": "what would you do if you won the lottery?"}, {"date": "26 May 2017", "title": "House Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Partnerships in Community Living (Grants Pass, OR) in Apr 2017", "Interview Descriptions": "First we had introductions. We were given our results for the personality quiz and went over them. Questions were asked regarding our test. We had to address a letter also learn about a diagnosis as well as write a short essay.", "Interview Questions": "If I was a car what would I be and why?"}, {"date": "12 May 2017", "title": "Direct Support Professional Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Partnerships in Community Living (Salem, OR) in Apr 2017", "Interview Descriptions": "Different rooms with different sections, asking different questions, computer work. There were a lot of people that were at the hiring event to ask questions. I was the only one in my group so it was a little bit intimidating. However it felt more personal.", "Interview Questions": "How do you handle your stress?"}, {"date": "12 May 2017", "title": "CSP Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Partnerships in Community Living (Salem, OR) in Apr 2017", "Interview Descriptions": "Interview is fast paced, but a wonderfully nontraditional format. It began with a presentation, then went to a group exercise, then a computer personality quiz, then finally a speed dating style Q/A.", "Interview Questions": "How do you cope with stress? Describe your process."}, {"date": "12 May 2017", "title": "DSP Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Partnerships in Community Living (Monmouth, OR) in Mar 2017", "Interview Descriptions": "it started with us all being in one room at designated seats. davida gave us a run down on how the day would go. we did speed interviewing where i was asked various questions by many different PCL employees. after that we played a team work game and we were able to keep the marshmallow up for over a minute.", "Interview Questions": "they asked my why i wanted to work with PCL."}], [{"date": "17 Mar 2017", "title": "Hiring and Staffing Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Partnerships in Community Living (Monmouth, OR) in Feb 2017", "Interview Descriptions": "It was a group interview. The process started with a computer assessment followed by a fun question ice breaker. Then was a 'speed dating' round of questions with 6 different interviewers. After that was an impromptu speech about a random topic.", "Interview Questions": "Give us an example of a time you had to deal with a difficult coworker. What did you do and were you successful?"}, {"date": "10 Jan 2017", "title": "Direct Support Professional Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Partnerships in Community Living (Monmouth, OR) in Jan 2017", "Interview Descriptions": "it is a two week process where all of the classes, training, and tools are taught up front before actually working out in the houses. within those two weeks they teach all employees everything they need to know, the history, things to expect as well as how to handle various situations that happen or may happen where we will be working.", "Interview Questions": "what experience do i have working with people with disabilities?"}, {"date": "21 Jul 2017", "title": "DSP Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Partnerships in Community Living (Monmouth, OR) in Jan 2017", "Interview Descriptions": "It was fun and very unique because of the group interview mixed with the individual interview. Also the team building exercise. I thought that the homework before that was not useful because we did not end up using the video.", "Interview Questions": "Tell me a time when you used humor to improve a negative situation. "}, {"date": "13 Jan 2017", "title": "Direct Support Professional Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Partnerships in Community Living (Monmouth, OR) in Dec 2016", "Interview Descriptions": "I submitted an online application and was promptly asked to interview. The interviewing process was enjoyable overall. I was asked questions by a variety of employees. Some were serious (\"How do you deal with stress?\") while others were humorous (\"If you won $1,000,000.00 from the lottery, how would you spend it?\").", "Interview Questions": "They, to my surprise, tested my computer skills almost immediately. "}, {"date": "18 Nov 2016", "title": "Direct Support Professional Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Partnerships in Community Living (Monmouth, OR) in Oct 2016", "Interview Descriptions": "It was fun, enjoyable, stress-free, and made me think about what I want to do and my willingness to work in a team. We did a team building exercise and then had a panel of interviewers ask us questions about who we are.", "Interview Questions": "How do I rate myself on my honesty?"}, {"date": "13 Jul 2016", "title": "Individualized Services Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Partnerships in Community Living (Monmouth, OR) in Jun 2016", "Interview Descriptions": "The process was somewhat long, but it was more fun than any other group interview i had been to in the past. About 17 people sat in a room which was set up like a panel of some kind. The first 20 ish minutes is a woman talking to the group about the company and what it stands for. We are then split up in groups for a group activity where we go into a room and are given a team project. For the project, we were given spaghetti noodles, a marshmallow, and tape and were asked to figure out how to get the marshmallow to stand at least 20 inches in the air. It took us about 5 minutes to come up with an idea and we nailed it! At the same time in the other room, the other group is being interviewed in a sort of speed dating way. you are asked about 5 questions (all pretty straight forward) from 5 different employees, and then the groups switch. At some point, i can't remember when, we did a computer skills worksheet, if you have ever used gmail, its very simple to follow.  this whole process was about an hour and a half and i heard back the next day by 5!", "Interview Questions": "If you won a million dollars what is the first thing you would do?"}, {"date": "24 Aug 2015", "title": "Direct Care Support Staff Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Partnerships in Community Living (Monmouth, OR) in Jul 2015", "Interview Descriptions": "The interview process was made fun and very comfortable.The panel were very friendly and professional  as well.It was a group interview and it was very team oriented at times", "Interview Questions": "What I would do if I won the lottery"}, {"date": "18 Aug 2015", "title": "Direct Support Professional Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Partnerships in Community Living (Monmouth, OR) in Jul 2015", "Interview Descriptions": "It was a group interview, where we would receive information on the job. As well as being able to talk to those who work for PCL and their experiences. We also got to read about the people supported, to really get a feel with whether or not we have common interests or not.", "Interview Questions": "What are your weaknesses and strengths."}, {"date": "17 Aug 2015", "title": "Direct Support Professional Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Partnerships in Community Living (Monmouth, OR) in Jul 2015", "Interview Descriptions": "The interview process was a group interview and was stress free. The only anxiety is what you bring with you. There were team building exercises to help you demonstrate your ability to work together. There were questions asked by various members of PCL, most employees were Service or Area Coordinators. The questions varied from abstract and casual, to direct and moral. Overall it was a positive experience. \r\n\r\nProvided you are a good spirited/hearted person with a working moral compass, you shouldn't have a problem being hired.", "Interview Questions": "What vehicle I was most like."}, {"date": "22 Aug 2015", "title": "Direct Support Professional Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Partnerships in Community Living (Monmouth, OR) in Jul 2015", "Interview Descriptions": "A group of us sat down in front of some of the higher up's inside the company, they asked us some basic questions. Had us do some different skill assessment tasks to see if we had the basic level of skills required to do the computer aspect of the job. they then split us up into groups doing one of two activities at a time, one was a team-building exercise where we were given a few minutes to work with a person supported by pcl along with some of the other applicants to see if we could build a structure out of dry spaghetti noodles, tape, and a marshmallow. The other activity was a round-robin Q&A session with more people from inside the company, getting to know who we are and giving us a chance to ask more questions and get some insight as to what the job was like. afterwards they told us we had all been hired and we were ushered back into a different room to complete w4's and receive waivers to have our UA's taken. only my third interview ever in my life, but definitely one of the most pleasant ones.", "Interview Questions": "How would you deal with a situation in which you were asked to perform something deemed unethical by either society or the company you work for."}], [{"date": "17 Jul 2015", "title": "Direct Support Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at Partnerships in Community Living (Monmouth, OR) in Jun 2015", "Interview Descriptions": "group interview with a teamwork activity and rotating interviewers. Team work activity was building a tower that had to stand on its own, 4 people worked together in order to build a successful tower. Each interviewer asked 3 questions covering a different quality in me that PCL is looking for in an employee.", "Interview Questions": "If I had to have someone I loved be supported by PCL, what qualities would you want them to have."}, {"date": "22 Jul 2015", "title": "Direct Support Professional Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Partnerships in Community Living (Grants Pass, OR) in Jun 2015", "Interview Descriptions": "It was a group interview in front of a panel. We did team building skills, question and answer period, one on one question and answer period. Drug Screen and background check.", "Interview Questions": "Name a situation where your integrity was challenged."}, {"date": "20 Apr 2015", "title": "Direct Support Professional Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Partnerships in Community Living (Monmouth, OR) in Mar 2015", "Interview Descriptions": "The interview process consisted of a group of adult interviewers, aged between 18 and 90 years old. The interview was a group setting wherein four interviewees were told about the interview process and the interviewers. The process was such that one of six interviewers sat with one interviewee for one minute, thirty seconds and asked four questions before moving on. This was referred to as \"speed dating\" and each interviewer asked questions to determine a different quality of the interviewee to decide the hirability of each interviewee. The process also included an inclusion and team building activity wherein the four interviewees worked with an employee of the company to accomplish a goal (this goal invovled suspending a marshmallow a specified distance from the workstation table top using dry spaghetti noodles).", "Interview Questions": "If you could be a type of car, what would you be?"}, {"date": "17 Apr 2015", "title": "DSP Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at Partnerships in Community Living (Monmouth, OR) in Mar 2015", "Interview Descriptions": "very relaxed and still business oriented. They did very cool events to get questions answered. Such as the around the room questions with all different staff that has been employed with the company for a good length of time. Also tested us on if we were a team player and could work well without us even knowing that was what they were looking for.", "Interview Questions": "Why i want to work in this field."}, {"date": "21 Apr 2015", "title": "Awake Overnight Direct Support Professional Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Partnerships in Community Living (Monmouth, OR) in Feb 2015", "Interview Descriptions": "The interview was different from any I'd ever experienced. It was actually really fun and there wasn't as much pressure. It felt more like a classroom of students on their first day of school. The interviewers were kind and helpful and led us through the process without alienating anybody. The icebreakers were a nice touch.", "Interview Questions": "How has a person experiencing a disability impacted your life?"}, {"date": "7 Jan 2016", "title": "Direct Support Professional Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Partnerships in Community Living (Monmouth, OR) in Feb 2013", "Interview Descriptions": "It is a group interview with 3 different parts;\r\n\r\n1. Computer Skills: show that you understand how to turn on a laptop and open and log into gmail (there are instructions in case you don't know how)\r\n\r\n2. Craft Project: you and 2-3 other people have x amount of time (3 minutes? 5 minutes?) to build a structure that will support a dixie cup of water for 60 seconds using rolled papers, markers, and tape. This is to show team work. They will ask you about how you felt about this exercise. MAKE SURE your answers center around team work and try to act like a leader during this (not take over the project) but definitely speak up and give your opinions and suggestions. They're looking for team oriented people because thats literally the basis of this whole company.\r\n\r\n3. Group Interview: first, they go around the room and ask people different questions that are honestly kind of silly. Then, your potential supervisor will come to you one-on-one and ask you more silly questions, as well as some actual interview questions. \r\n\r\n**Your answers to any of these questions should include; your ability to work as a team, communicate with your superiors, and your ability and willingness to find answers if you don't know them. Don't be afraid to throw some humor in there as well (appropriate of course), it shows the hiring staff that you can be silly with the clients and have fun. As long as you are extremely positive, dressed somewhat professionally, and can think level headed, you are almost guaranteed a job here. I was called the next day and offered the job and was employed over 3 years**", "Interview Questions": "What kind of car would you be?"}]]