[[{"date": "21 Dec 2022", "title": "Data Scientist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at CAQH", "Interview Descriptions": "Behavioral first interview with a technical case study for a second one. They changed the job requirements afterwards, didn’t get an offer. I don’t like that companies require you to give free work, and it felt like a waste of time.", "Interview Questions": "They asked how I would technically solve a question in Python"}, {"date": "17 Oct 2022", "title": "Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 months. I interviewed at CAQH", "Interview Descriptions": "Very long and tedious. Several interviews back to back across many many days. This is followed by a case study and a write up. Questions are repetitive. Interviews aren’t scheduled judiciously as candidates are expected to meet with departments they’ll never interact with. As you can see from previous reviews, CAQH has a record for being disorganized and, frankly, wasting candidates time. No need to restate any concerns as previous negative reviews can be verified. Recommend seeking opportunities elsewhere.", "Interview Questions": "Many questions were strategy based"}, {"date": "22 Nov 2022", "title": "Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at CAQH (Washington, DC) in Sept 2022", "Interview Descriptions": "Definitely needs to do some work on their interview process. Several months of interviews and, in line with what seems to be the norm given other interviews, did not even extend an offer to anyone, but rather reposted for the third time. clearly has an issue with understanding the job market and the appetite for their work.", "Interview Questions": "Basic questions / nothing serious"}, {"date": "2 Jun 2023", "title": "Product Owner Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at CAQH (Washington, DC) in Jul 2022", "Interview Descriptions": "First telephonic interview. HR interview. Individual interview with panel members. Panel members in my case were Prod Manager, Prod Owner, and Project Manager. Problem statement and presentation to the panel.", "Interview Questions": "Role in current job, why am I looking for a change, approach to certain situations got a problem statement, had to prepare a roadmap"}, {"date": "16 Mar 2022", "title": "Associate Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at CAQH", "Interview Descriptions": "After applying online and speaking a current employee, I completed a 30-minute phone screening with the contracted recruiter. Following that phone screen I provided an annotated overview of my resume to explain my experiences in more detail", "Interview Questions": "Walk me through your resume\r\nWhat are your salary requirements \r\n"}, {"date": "24 Mar 2022", "title": "Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at CAQH in Mar 2022", "Interview Descriptions": "I had an initial phone screen (about 30 minutes) with an HR representative. They asked me standard questions about fit and experience based on my resume. I heard back within a week that I would have an initial interview with a staff member.", "Interview Questions": "What interested you in this position? "}, {"date": "16 Dec 2021", "title": "Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at CAQH", "Interview Descriptions": "I interviewed with CAQH in fall 2021 after being contacted on LinkedIn by a recruiter. I had a first call and then was told they want to schedule more calls, then did not hear back for about a month about when they actually wanted to schedule them. Eventually I was asked about my availability for the following week, which I sent. I last minute heard back that they had scheduled 5.5 hours of interviews and a case study, mostly all on one day. I am working a full time job and told the recruiters I could not accommodate all of this time on one day given my other job. I was given a lot of pushback and they attempted to make it seem like it's my fault for giving my availability on those days.\nIn addition, they required a case study that required a good deal of time to prep for, including developing a presentation and then running a mock call with several CAQH team members, and then writing a mock follow up email for after the call. The process of scheduling this was also frustrating and I was sent the wrong link to the meeting, which added extra stress right before the call.\nAfter all of this pressure to get the calls done as quickly as possible during one week, and a lot of effort on my end to make this work during a busy work week, I then heard nothing from them for over a month. Finally, I heard I did not get the job and that they didn't move forward with any of the candidates and would keep looking.\nWhile I enjoyed some of the conversations I had with team members, I would never consider interviewing with CAQH or with these recruiters again. I did not feel like they respected my time, were organized or that they knew what they were looking for. The entire process left me with a really bad taste for the organization.", "Interview Questions": "Pretty typical questions about my experience and why I was interested in the role"}, {"date": "25 Aug 2021", "title": "Product Owner Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at CAQH in Aug 2021", "Interview Descriptions": "I applied, and then phone screened for 30 minutes. They then took a full week to get back to me for another screen for 30 minutes. After that, they scheduled additional interviews a week later followed by a case study. The case study is very vague and while they say that \"there is no wrong answer\" there definitely is and that is if you do it any other way than what they expect without explaining their standards. They then got back to me a week after that only to say they were closing the position and would re-evaluate in 90 days. So, basically they wasted a month and a half of process time plus all the work that went into it just to abandon the process entirely. They also said there were at least three more rounds after the case study. All in all, CAQH is one of those places who have no clue how to hire. This non profit is a non starter.", "Interview Questions": "What made you decide to apply to CAQH?"}, {"date": "16 Feb 2022", "title": "Data Scientist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at CAQH in Aug 2021", "Interview Descriptions": "One phone interview then ghosted. No communication at all from follow-up emails. \r\nThe recruiter said I may have too much experience and that he would get back to me. Never responded.", "Interview Questions": "Said I had too much experience"}, {"date": "28 Jun 2021", "title": "Program Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at CAQH", "Interview Descriptions": "Thorough, with interviewer having research LinkedIn profiles, social media and Youtube for information on my background and accomplishments.  I was impressed with the level the interviewer had gone.  Then again, the interview was not being conducted by an HR rep.  They utilized an outside company to do some high level screening prior to recommending an interview with the hiring manager.", "Interview Questions": "While all the questions they asked were straightforward and important to the scope of the job, I was totally displeased when I was asked by the interviewer, after having been through 2 other interviews with this person to provide an answer to a what he called \"a purely hypothetically question\"."}], [{"date": "29 Nov 2019", "title": "Account Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at CAQH (Washington, DC) in Nov 2019", "Interview Descriptions": "Very detailed and extensive. It's a small organization, they have to do their due diligence and vet their candidates  carefully. There were a series of phone interviews prior to the in person meeting and eventually an in person interview that included a presentation on a case study.", "Interview Questions": "Why are you looking to pursue this path?"}, {"date": "16 Nov 2018", "title": "CORE Associate Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at CAQH", "Interview Descriptions": "I applied online and was contacted for a phone screen. I did two phone screens initially with someone from HR then the hiring manager on a different date. I was then called in for an in person interview which took all day. I met with about 7 or 8 people. The interviews were from 9:30am - 2pm if I'm not mistaken. After my interviews I was given a test to take. After all of that they sent me an email saying I did not qualify for this entry level  position.", "Interview Questions": "Why do you want to work here? "}, {"date": "27 May 2018", "title": "Business Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. The process took 1 week. I interviewed at CAQH (Washington, DC)", "Interview Descriptions": "I was first interviewed over the phone by someone from the Hr , i was later scheduled for another phone interview with the business analyst manager (BAM).\r\nThis BAM did nothing but to make me feel incompetent. He started off by asking when i got my masters and others. Then he said this question i am about asking will let me know if you are right for this position (In my mind i was like , you dont need to tell me that), he asked a scenario based question, i gave a response, then he told me that was not what he was looking for, he told me the kind of response he expected. He then asked some other questions which i answered. Then , he asked another one , i responded, he was not pleased with the answer, he kept repeating the question and i kept giving him the same answer (Now, at this point, i felt uncomfortable with him,and i just told him that's what my response would be, note that i was polite in my responses with him). The last thing he said that put me off completely was \"You said you are certified in so so and so , but you can not give a good answer to that question, so i can not continue the interview with you\" . \r\nI expected a good interviewer not to put the interviewee down, even if the interviewee gives a different answer from what you want, i mean interviewees know when they have not answered a question rightly (except you want to deceive yourself).\r\nI am glad, i did not get this job because i would not want to work with someone that thinks they are the only smart people, other people can not think differently from them and make others feel incompetent.", "Interview Questions": "What do you know about us and why do you want to work with us?\r\nDoes it mean you are not getting these things with your current employer?\r\nI am a doctor and i need a car so i can get to my patients easily, what questions would you ask me?\r\nWhat is the difference between business requirement and functional requirement?\r\nWhats the structure of your user story?\r\ni want to withdraw money from the ATM, give me one user story on that.\r\nWhat is Epic and features in scrum?"}, {"date": "6 Nov 2019", "title": "Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at CAQH (Washington, DC) in May 2018", "Interview Descriptions": "CAQH has a multi-step interview process involving phone screening by both HR and a hiring manager, onsite interviews with 5 or more people, and frequently a final interview with the president. The onsite interview includes a case study, provided to the applicant in advance, which they are expected to present a solution for in a team interview with 2-3 cross-discipline team members.", "Interview Questions": "The case study is key. It is typically a significant problem the company is trying to solve that will test the applicants ability to research the issue, frame the problem, demonstrate their expertise by formulating a solution and possible alternatives, and communicate their idea effectively."}, {"date": "21 Jan 2018", "title": "Project Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at CAQH (Washington, DC) in Jan 2017", "Interview Descriptions": "The interview process took about 2 weeks. Initial phone screen with a recruiter. Followed by an in-person interview with about 7 staff. Final in-person interview was with Executive Director and another Senior Manager.", "Interview Questions": "Why do you want to work for CAQH?"}, {"date": "19 Aug 2015", "title": "Project Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at CAQH (Washington, DC) in Mar 2015", "Interview Descriptions": "Initial phone interview with recruiter, then asked for an in person interview. The in person interview began with a brief introduction with recruiter, then met with a group of 5 individuals in a group interview. The positions of everyone varied from upper level to mid level. Everyone was upbeat about company core and values. Finished up the day with a test.", "Interview Questions": "What interests you in CAQH?"}]]