[[{"date": "7 Jul 2023", "title": "Crisis Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at PRS", "Interview Descriptions": "I was interviewed via a group interview, easy but not very well organized. We were on camera the who time. Fairly easy questions from two different people. It lasted longer than expected.", "Interview Questions": "What changed my view on suicide"}, {"date": "25 Nov 2019", "title": "Administrative Office Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at PRS", "Interview Descriptions": "The company cares more about seeing you stick around than making you feel welcomed and valued. They have seen two people leave one position within a matter of a month.", "Interview Questions": "How do you work under pressure?"}, {"date": "5 Aug 2018", "title": "Trainer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at PRS", "Interview Descriptions": "individual interview - no panel. I emailed my interest and was contacted by the employer the following day. She requested I offer times for interview and we scheduled a date within 2 weeks.", "Interview Questions": "Could you tell me about your experience as a mental health practitioner?"}, {"date": "18 Apr 2017", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at PRS (McLean, VA) in Dec 2016", "Interview Descriptions": "I interviewed for the intern position with two women, one of whom was to be my supervisor.  The other was head of intakes.  After I was accepted, I had to complete a 2 hour training, a had to be finger printed at the police station and I had to provide a negative TB test.", "Interview Questions": "Why I was qualified."}, {"date": "6 Feb 2018", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at PRS (Alexandria, VA) in Sept 2016", "Interview Descriptions": "Went in, talked about interest, how interning with the company could benefit me, and what I hoped to gain.  Was told about what to expect and why employees decide to work with the company and with the population.", "Interview Questions": "What population do you plan to work with?"}, {"date": "27 Apr 2017", "title": "Counseling Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. I interviewed at PRS (Alexandria, VA) in May 2016", "Interview Descriptions": "I sent HR an email about a possible internship at the McLean location and I received an interview quickly for the Mount Vernon location. I interviewed with the location director who would be my supervisor. It was a quick, 30 minute interview and she signed my internship contract right then, inviting me to complete my graduate student internship there.", "Interview Questions": "Why are you interested in working with this population?"}, {"date": "19 Feb 2016", "title": "Transition Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at PRS", "Interview Descriptions": "Was called for FaceTime interview which was awkward as the interviewer's camera was fuzzy and she never looked directly at me, but down at her desk.  She was rude and questioned my reason for applying despite stating I was very well qualified.", "Interview Questions": "Interviewer immediately questioned if I wanted the job bc my asking was $5k more than listed for the position on glass door. She then preceded to discourage me from continuing my application saying 1. They expected 48 hours per week. 2.  They were so special that 2 years experience at a very reputable county job would only count as 1 year of experience with them. 3. That if they paid anything towards my  license supervision I'd owe them 2 years employment once licensed   Despite the fact I'm 1/2 way done with my hours. 4. That my qualifications put me at a level equivalent to their supervisors, (masters degree license eligible 4 years experience with SMI Crisis management and case management, but she would not hire me as a supervisor bc they are so special they only hire from within for supervisors, 5. That the case load was very heavy and I wouldn't want the job. 6. That I needed to prove I wanted the job, and would work 48 hours per week."}, {"date": "5 Jan 2016", "title": "Crisis Textline Supervisor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at PRS (Tysons Corner) in Nov 2015", "Interview Descriptions": "Applied, scheduled skype interview, invited for an interview one week later. I was invited for an interview at their crisis link building, had about an hour interview. The overall experience was very pleasant, but they ended up choosing another candidate.", "Interview Questions": "They asked me about my commitment for the position"}, {"date": "23 Oct 2014", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at PRS in Sept 2014", "Interview Descriptions": "Be prepared for a long interview with some personal questions. Also make sure you can agree to the training schedule, it's a lot of weekends. They will ask you questions not typical of an interview but are there for a reason. Be yourself and show compassion and caring qualities. It takes a special person to do this and they are looking for someone who holds those qualities.", "Interview Questions": "Have you ever had thoughts of suicide"}, {"date": "27 Feb 2014", "title": "PM Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at PRS in Aug 2013", "Interview Descriptions": "phone call then met over lunch", "Interview Questions": "there wasn't any difficult or unexpected questions"}]]