[[{"date": "5 Mar 2023", "title": "Project Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Council On International Educational Exchange", "Interview Descriptions": "One way video screen Invite to interview in person (the invite referenced the wrong job title...I figured yikes red flag #1). The recruiter made the correction and misspelled the correct title, yikes red flag #2 Interviewer was a late, but no big concern. Very very nice person! Interview imo went really really well Next interview with 4 people (2 of them seemed like horriblely unhappy people). Dry, awkward silence. One person started the interview questions without introducing themselves, no context nothing just...\"so if you were to describe...\" like whoa, hi nice to meet you, a little about you and your role is what? Lol felt like a speed date that they really didn't want to be on.", "Interview Questions": "Can't recall them all. If colleagues would describe you in 3 words what would it be? And of course the tried and true, tell us about yourself"}, {"date": "22 May 2023", "title": "Enrollment Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Council On International Educational Exchange (Portland, ME) in Mar 2023", "Interview Descriptions": "I had three separate interviews. The first was video questions that I recorded online, then I did a second interview with a recruiter, and then a third interview with 2 sales directors. One of them was warm and inviting, and the other seemed very disinterested. They asked the standard questions. The interviews took place in rapid succession over two weeks, but then they took more than two months to get back to me with a final answer (rejected).", "Interview Questions": "Describe a time when you had to make a sale."}, {"date": "21 Feb 2023", "title": "Enrollment Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Council On International Educational Exchange", "Interview Descriptions": "Not a great experience. I spent over an hour of my time doing a one way interview. I wanted to make sure my answers were perfect since it was pre-recorded. The company did not ever contact me back. My interview just disappeared into the abyss. They don't give an email for HR to contact and there's no personal interaction whatsoever. I contacted the ONLY email on their website asking for if my interview was received and let them know I am so excited for the opportunity and asked for HR's email. Nothing. Just completely ghosted. Waste of my time.", "Interview Questions": "Tell us about yourself and why you want to work for CIEE"}, {"date": "17 Jan 2023", "title": "Seasonal Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Council On International Educational Exchange (San Jose, CA)", "Interview Descriptions": "One-way online interview via sparkhire with 6 questions. Each question had an answer time of 2.5 minutes. If you didn't like your response or made a mistake, there was unlimited retakes. You controlled when you ready to move to the next question and answer it.", "Interview Questions": "1. Tell us about yourself (education and professional experience, where you see yourself in 5 years)"}, {"date": "21 Dec 2022", "title": "Study Abroad Advisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Council On International Educational Exchange", "Interview Descriptions": "I completed a time consuming video interview, where I recorded myself answering questions. I was then completely ghosted and never heard back from them. I reached out twice to follow up and no reply.", "Interview Questions": "Tell us why you're interested in this role."}, {"date": "11 Aug 2022", "title": "Director of Enrollment Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Council On International Educational Exchange (Rochester, MN) in Jul 2022", "Interview Descriptions": "5 behavioral questions and one about salary expectations and starting date. You have all the time you need to respond and is through a video platform where you record your answers. They did never reply back after the interview", "Interview Questions": "Tell me about a situation where you had to meet a short deadline"}, {"date": "3 Aug 2022", "title": "Enrollment Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Council On International Educational Exchange (New York, NY) in Apr 2022", "Interview Descriptions": "I felt very comfortable in my interview. They explained the position and company very well. In addition, they seem to have good benefits. The only downfall would be the salary.", "Interview Questions": "Tell me about your experience abroad "}, {"date": "10 Jun 2021", "title": "Program Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Council On International Educational Exchange in Jun 2021", "Interview Descriptions": "The interviewer asked me about job experience in details, knowledge of ciee and overseas experience, etc.  It was very nice for me to get to understand what they do and how it goes with the task.", "Interview Questions": "Could you tell me about your overseas experience?"}, {"date": "13 Jan 2021", "title": "Study Abroad Manager Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Council On International Educational Exchange", "Interview Descriptions": "Very long process (months), even to get acknowledgement of the application - multiple touchpoints with a number of individauls. Very unclear who \"owned\" the process at any given time. A mix of virtual and in-person interviews over several weeks.", "Interview Questions": "Have you studied abroad? Why is it imprtant to you?"}, {"date": "17 Dec 2020", "title": "Marketing Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Council On International Educational Exchange", "Interview Descriptions": "There was a video interview and then an in-person interview. The process was pretty typical and I met and interviewed with two different people. They were very nice and easy to have a conversation with. They asked me about i liked to be managed and how i work best to see if it was a good fit for both of us.", "Interview Questions": "What management style do you work with best?\n"}], [{"date": "13 Feb 2020", "title": "Program Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Council On International Educational Exchange (Boston, MA) in Dec 2019", "Interview Descriptions": "Very poorly communicated, organized and structured. The \"process\" was a series of emails initiated by the recruiter to schedule 1 interview.\r\nThere was no initial phone screening, the recruiter asked from the beginning about salary expectations and told me what the max salary was and that is all. All via email.\r\nShe then proceeded to schedule  the interview with hiring managers which was face to face.\r\nAfter that interview, which I was told was the only one, the recruiter emailed me asking for references. At this point, I picked up the phone and called her to ask her if this meant I was going into next steps, usually references are asked AFTER a verbal offer is given. All the recruiter could say was that I would be given a response in 2 weeks time. She could not articulate what next steps were.\r\nAfter that total radio silence, no follow up communication, not even to inform me that I was not selected.\r\nI would advice anyone to not consider wasting their time with CIEE.", "Interview Questions": "Tell us about your experience"}, {"date": "17 Oct 2019", "title": "Enrollment Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Council On International Educational Exchange", "Interview Descriptions": "I received an invitation to complete the one-way video interview the same day I applied. I found it to be pretty difficult with a lot of behavioral questions. It took me over an hour. About a week later they let me know the position had been filled. This interview style is very impersonal and because there's no feedback from an interviewer, it really wastes candidates' time, especially considering they were clearly far along in the interview process with other applicants. At least they let me know when the position was filled and seemed responsive to applications.", "Interview Questions": "A situation that split your attention and how you prioritize"}, {"date": "13 Aug 2019", "title": "Admissions Coordinator Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Council On International Educational Exchange", "Interview Descriptions": "Multiple interview rounds with multiple member managers of the organization. A lot of behavioral and situational questions but it was an overall great experience. The HR person and Recruiter were all very wonderful throughout the process and kept me in the loop at all times.", "Interview Questions": "N/A"}, {"date": "20 Nov 2019", "title": "Admissions Coordinator Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Council On International Educational Exchange in Aug 2019", "Interview Descriptions": "Complete about a 30 minute self-led video interview. You are given the questions and then about 5 minutes to prepare each answer.  You are then given 2 tries to complete and record your answer.", "Interview Questions": "Tell us about yourself"}, {"date": "24 Mar 2021", "title": "Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Council On International Educational Exchange (Berlin) in Aug 2019", "Interview Descriptions": "I have two interviews and in one of them I had to prepare a class-plan. The interviews were in the bar of the institute, very relax and friendly environment. I had the interview with the Academic Director and he also showed me the classrooms and facilities of the campus.", "Interview Questions": "They asked me about my previous experience as a professor"}, {"date": "7 Jul 2019", "title": "Content Marketing Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Council On International Educational Exchange", "Interview Descriptions": "Got an email for a video interview in about a week. The questions are not related to the job position at all - very general and cliche interview questions and I feel very weird. Did not hear back from them at all for a month (I have sent two emails to the HR and she never got back to me).", "Interview Questions": "One challenge you faced before "}, {"date": "26 Jun 2019", "title": "Marketing Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Council On International Educational Exchange (Boston, MA)", "Interview Descriptions": "I was offered a digital marketing position but ultimately declined because a stronger offer came in from a company in a completely different company. \r\n\r\nThe marketing team, both in the states and in their foreign offices seemed incredibly knowledgable, professional, and passionate about CIEE's mission. I was really impressed with both Giscard's expertise and soft skills during my interviews, and Samantha Arzu was THE BEST HR manager I have ever interacted with in my 12 years of working. She was incredibly responsive, personable, and honest with me during the entire interview process. It was really a tough decision not to join CIEE because I could tell after years of interviewing in various industries that these people are genuine professionals AND they have emotional intelligence. Ultimately, they all seem like normal, good people to be around which is what every prospective employee deserves to know.\r\n\r\nI can only speak to the digital marketing team, but if you have the chance to join them make sure you appreciate the value they can add to your career. In addition, CIEE's mission about advancing international education exchange will always be relevant and beneficial to solving the world's problems. The globe grows smaller each day, and it's up to organizations like CIEE to train the leaders of tomorrow.", "Interview Questions": "Describe examples of lead scoring and using paid advertising in previous work"}, {"date": "6 Mar 2019", "title": "Program Leader Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Council On International Educational Exchange", "Interview Descriptions": "The interview was rather easy. There was a face-to-face interview and then an online interview where you film yourself answering questions related to the job. There are three tries for this, which is a little awkward. If you practice before submitting though it isn't hard.", "Interview Questions": "The film yourself section is awkward but just practice beforehand. Questions switch"}, {"date": "26 Feb 2019", "title": "Program Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Council On International Educational Exchange (Boston, MA) in Jan 2019", "Interview Descriptions": "I had a video interview, where questions are previously uploaded and you make videos of the answers. There were 8 questions total, regarding my background and experience with sales and project management.", "Interview Questions": "Brief summary about me. Sales experience. Talk about a project that you lead. "}, {"date": "29 May 2023", "title": "Assistente Administrativo Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. I interviewed at Council On International Educational Exchange (Sobral, Ceará) in Jan 2019", "Interview Descriptions": "Amei. Foram bem atenciosos e prestativos. Aprendi bastante coisa. A capacitação é impecável. A experiência adquirida lá foi de muito proveito para a minha carreira e experiência profissional. Que dó tem somado", "Interview Questions": "Como você se vê daqui 5 anos? Me fale sobre você Você se imagina trabalhando no banco?"}], [{"date": "26 Mar 2019", "title": "Academic Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Council On International Educational Exchange (Cape Town) in Dec 2018", "Interview Descriptions": "The interview process was very standard- basic questions with a panel of three people in a broom.  I had applied via in house referencing  and networking - emailed CV and cover letter and had received a notification for an interview within 24-48 hrs thereafter.", "Interview Questions": "How do you yourself and set of skills contributing to CIEE? What skills do you bring to CIEE?"}, {"date": "28 Nov 2018", "title": "Consultant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at Council On International Educational Exchange", "Interview Descriptions": "Applied and was contacted quickly for an interview. Interview turned out to be a one-sided interview where you video record your answers to a questionnaire and submit them. Never received a response or a follow up. I reached out to confirm they had received my video submissions and they never replied. \n\nI read in other reviews that they don’t follow up or respond. I did similar work before and was surprised they never contacted me again or replied to a follow up e-mail. One way or another they should reply to their applicants.", "Interview Questions": "Experience with J-1 and F-1 Visas"}, {"date": "6 Feb 2019", "title": "Entrepreneur Lab Academic Program Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Council On International Educational Exchange (Berlin) in Oct 2018", "Interview Descriptions": "First a video  interview and there were supposed to be a couple rounds of face-to-face interviews at the office in Berlin. The interview went very well and the interviewer told me that I should come to Berlin office to talk with the team and the interviewer's boss directly. The interviewer told me that they will organize a schedule for our meeting in the same month. I waited their answer for a week and sent an email to ask about the situation. They told me that they are still working on it to schedule the meeting, so I waited another one week and again sent an email to ask about the status-quo. The similar answer came back, so I waited again. After a couple of days, they said they found someone in Berlin and no longer looking for a person for this position. I simply do not understand why they could not tell me that there is another candidate who might fit better in the position instead of \"we are trying to organize a day for our meeting\". And why they could not  meet and talk with me in Berlin and make a decision afterwards? There are many questions that came into my mind but at the end, I am just very disappointed how there is a lack of respect to candidates - unfortunately, this is not the first time I experienced something like this in a job searching process in Germany...", "Interview Questions": "In-depth questions regarding the skill-sets required for this position. \r\n\r\n\"Why do you think you are the best fit for this role?\"\r\n\"Explain any related experience to this role.\"\r\n\"Do you know about lean startup and agile management?\"\r\n\"What kind of classes have you designed and taught?\"\r\n\"Are you interested in teaching and researching as well?\"\r\n\r\nSomething like that."}, {"date": "8 Jan 2019", "title": "Senior Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Council On International Educational Exchange (Budapest) in Sept 2018", "Interview Descriptions": "Applied, lengthy application, asked to do 9 mini presentations on range of areas / subjects... then followed with interview from Northern Hemisphere Director .. told more steps in interview ( 2 months later) .. no follow up from them... don’t waste your time applying!", "Interview Questions": "N/A"}, {"date": "24 Aug 2018", "title": "Program Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Council On International Educational Exchange", "Interview Descriptions": "I received an email for a video interview which I had to record on a platform of another company. I spent over 1 hour making the video, as the platform's recording tools were not working. On top of that, it's been three weeks and I have received absolutely no response. I sent a follow-up email, and nothing. I found this to be very insulting, especially given the horrendous process of a video interview, which is just a waste of time for anyone. Now I know never to participate in something like this again.", "Interview Questions": "Dream Job\r\nTravel Experience"}, {"date": "11 Feb 2019", "title": "Enrollment Specialist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Council On International Educational Exchange (Boston, MA) in Aug 2018", "Interview Descriptions": "I did  a one-way interview which asked around 5 questions, and then completed an in person interview with the hiring manager and director. The whole process took about two weeks, and I accepted the position.", "Interview Questions": "What experience do you have working in international education?"}, {"date": "11 Jun 2018", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Council On International Educational Exchange", "Interview Descriptions": "Alumni Internship in Portland. It took 2-3 months from initial due date to interview. We kept receiving vague emails stating that we had made it to the next round. The Interview was about 45 minutes and I was offered the internship about 2 weeks after the interview.", "Interview Questions": "A time I completed independent research "}, {"date": "10 Jul 2018", "title": "Study Abroad Advisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Council On International Educational Exchange (Portland, OR) in Jun 2018", "Interview Descriptions": "I actually applied and interviewed for CIEE twice.  The first time was in 2013.  The second time was a month ago.  The first time I was interviewed probably 3 times, once on phone and twice on Skype.  They flew me to Portland and put me up in a hotel.  I interviewed and was told they would make a decision quick.  Of course, I still waited over a month with no response.  The only reason I got a response was that I emailed them multiple times.  This time, I applied online and quickly participated in a one-way interview, recording my answers to questions and having them sent it.  Then I did a Skype interview with three people.  The one guy in the back seemed bored and disinterested in anything he was doing that day.  The two women were active and polite.  However, again, they said they wanted to act quick on this.  They said they were hiring multiple people.  But, again, I waited over a month for a response, many times emailing them with no response.  I really believe you shouldn't waste your time with this place.  Just don't bother.", "Interview Questions": "A time you had to deal with difficult people or difficult coworkers.  "}, {"date": "27 Nov 2018", "title": "Admissions Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 1 day. I interviewed at Council On International Educational Exchange (Boston, MA) in Jun 2018", "Interview Descriptions": "After applying they got back to me within a couple of days and I was offered an in person interview. The mangers that interviewed me were nice and there is only one round of interview", "Interview Questions": "N/A"}, {"date": "16 Sept 2018", "title": "Administrative Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at Council On International Educational Exchange (Portland, ME) in Apr 2018", "Interview Descriptions": "I applied for this job through their website. It took over a month to hear anything back, and when I did, I was instructed to complete a preliminary video interview. This video interview required me to answer a serious of questions. The video interview did not allow me to access the website at first and when I reached out for help to try and get access to the website the woman I spoke to was curt and seemed like it was the least of her problems. It gave you a few attempts to re-record your answers to each question but did not allow you to view all of the questions before hand to prepare your answer, and overall took me about an hour and a half to complete. The concept is that you have the ability to answer all of the questions thoroughly, but it just made me feel even more pressured to answer perfectly, and lacked all together any sort of feeling of conversation or human interaction. I was then contacted to interview in person about a week later, and went in for a two hour long interview where I met with four separate individuals for 30 minutes each. I did enjoy my conversations with each of them and felt that it had actually gone very well, although I was then emailed that they were offering the position to someone who better suited their needs (re: probably more experience).", "Interview Questions": "Why do you want to work for ciee?"}], [{"date": "12 Mar 2018", "title": "Admissions Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Council On International Educational Exchange", "Interview Descriptions": "I was given a call, not an email, about wanting to set up a time for a phone interview. As I was not available at the time, they left a voicemail. I called back and left a voicemail to set up a time. I did not hear back from them.", "Interview Questions": "Are you available to speak today?"}, {"date": "9 Mar 2018", "title": "Program Administrator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "The process took 1+ week. I interviewed at Council On International Educational Exchange (New York, NY)", "Interview Descriptions": "More of the same from other reviews for this company, if their recruiters are this bad it's probably a good thing I didn't move forward. I have applied for 2 positions with CIEE, the first time I was contacted to interview for a different position than the one I applied for, but it was in line with my interests. After a phone interview with the recruiter there was a gap of weeks with multiple follow ups from me for next steps, finally a request for a Skype interview was sent. That was quickly followed by the recruiter asking me if I would relocate to D.C. or New Jersey. When I said no and expressed my frustration with the process, I got a rambling phone call about moving pieces for the position.\n\nAgainst my better judgement I applied for another position. This time I got the invitation for a video interview. A day later the recruiter called me asking if I could complete the video interview soon as they were \"very interested in my resume\" and wanted to do in person interviews 2 days later. I was on the road on Friday so couldn't make an in person interview, but scheduled a Skype interview as the hiring manager was traveling the next week. A day later, another rambling phone call about needed to reschedule as there was a management meeting that afternoon. No problem let me know when to reschedule. Two follow ups later, oh they want to make an offer to someone else sorry. \n\nThey honestly do not care about a candidates time or schedule. Which is probably how they treat their employees so it's probably a blessing.", "Interview Questions": "nothing out of the ordinarary"}, {"date": "15 May 2018", "title": "Exchange Administrator Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 4 days. I interviewed at Council On International Educational Exchange (Portland, OR) in Mar 2018", "Interview Descriptions": "Online application was processed and was quite simple and easy to follow. I felt that this was section took a matter of 30-40 minutes, many questions were multiple questions so that really made it go smoothly", "Interview Questions": "What made you interested in working for CIEE? "}, {"date": "13 Mar 2018", "title": "Registration Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Council On International Educational Exchange (Boston, MA) in Mar 2018", "Interview Descriptions": "I received an email inviting me to complete a Montage on-demand video interview. I was terrified, but it was pretty straightforward. I was able to re-record any video with which I wasn't comfortable (which meant I re-recorded six out of seven, I think, and some of them many times). But I got them to the point where I was comfortable and submitted them. CIEE indicated it would take about 35 minutes. It took me three hours. But that's okay. I wanted what I put forth to be the best I could make it.", "Interview Questions": "What kind of work environment do you feel most comfortable/ work best in?"}, {"date": "2 Apr 2018", "title": "Program Leader Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Council On International Educational Exchange (Portland, OR) in Feb 2018", "Interview Descriptions": "First I applied online, then I was invited for a video interview via Montage in which I recorded videos of myself answering preset questions, then I was invited for a Skype interview about a month later, two weeks later I was offered the position.", "Interview Questions": "What is your style of classroom management?"}, {"date": "5 Dec 2017", "title": "Program Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at Council On International Educational Exchange", "Interview Descriptions": "I was referred by a current employee. I had a phone interview and then an in-person interview. The interview was with several team members and not very memorable or difficult. It went fine but never heard back, which I found quite unprofessional.", "Interview Questions": "Why are you interested in study abroad?"}, {"date": "14 Dec 2017", "title": "Study Abroad Advisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Council On International Educational Exchange in Dec 2017", "Interview Descriptions": "After applying online, I was invited to complete a Green Interview. A week or so after I completed the Green Interview, a recruiter contacted me for a phone interview; she wanted to complete the phone interview that same day. Thankfully, I was available so I had a brief phone interview. I was told that I was one of six final candidates and that the hiring manager would be in contact with me to set up a Skype interview. The hiring manager emailed me the next day and provided ONE time slot for me to complete the two-and-a-half hour interview. I was unavailable during that time slot, so I suggested several other alternative times. The hiring manager told me she would be back in touch \"should a different day work for the seven people on the hiring panel.\" She never got back in touch so I followed up a week later. She told me that I was no longer being considered as a candidate for the position.", "Interview Questions": "The questions were pretty standard interview questions. "}, {"date": "8 Dec 2017", "title": "Compliance Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Council On International Educational Exchange (Portland, ME) in Oct 2017", "Interview Descriptions": "HR recruiter contacted me by email and offered to video interview through a different website, you have to register and and videotape your answers on questions they ask. Questions are easy, but repetitive. After submitting the life interview I have never been contacted back, no feedback either", "Interview Questions": "Why do you want to work for ciee ?"}, {"date": "13 Feb 2020", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. I interviewed at Council On International Educational Exchange in Aug 2017", "Interview Descriptions": "I had one round of interviews with a Director and Vice President.  It was a very laid back and comfortable conversation.  They asked about my experience and spoke about the company's goals and the goals of the team.", "Interview Questions": "Describe how you have handled a request from a demanding client/customer."}, {"date": "7 Aug 2017", "title": "Teach Abroad Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Council On International Educational Exchange in Jul 2017", "Interview Descriptions": "I was asked to schedule a phone interview with a recruiter for this position.  When she called me, she told me right away that she had only been working with CIEE a few weeks.  She had not even read the job description she was interviewing me for, and read it over the phone to herself before asking me her questions.  I got the impression that someone was in the room feeding her lines and questions, because there were many long pauses and the conversation did not flow.  She asked me about my previous experience (I'm completely qualified for this position in that I did teach abroad and know the entire experience and process in depth, in addition to being bilingual, and studying, working, and living abroad).  I have even worked for CIEE as a Local Coordinator, and I had to explain to her what that meant.  She asked about my experience using Excel.  I explained that I had been using Excel every day in all of my work experience for at least the past 4 years.  At the end of the interview she said her main concern was my lack of experience with Excel.  WHAT??!  The following day I sent an email thanking her for her time, and I never heard from her.  I'm really angry at how unprofessionally I was treated, and the lack of communication.  Overall I DO NOT recommend this company.", "Interview Questions": "What is your experience with Excel?"}], [{"date": "4 Sept 2018", "title": "Resident Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Council On International Educational Exchange (Portland, ME) in Jan 2017", "Interview Descriptions": "The interview process was well organized- I had several telephone and then online interviews, followed by an in person interview in Portland. Once there, I had back to back interviews with many departments and areas that I would liase with.", "Interview Questions": "There were a number of situational/behavioral questions, but also thoughtful questions that I felt were aimed at getting to know me better. "}, {"date": "7 Mar 2018", "title": "Manager of Study Abroad Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Council On International Educational Exchange (Portland, ME) in Oct 2016", "Interview Descriptions": "The interview process takes forever at CIEE. They typically end up picking from what's left in the applicant pool as it's taken months for them to move through the process. Submit application, wait. Maybe get sent a link for Greenjobs, submit and wait. Maybe someone from HR calls you. Maybe they email you. Maybe you talk to a hiring manager. Perhaps they do a phone interview. Then you're brought in for an interview, sometimes with an individual and sometimes with a panel. There is no hiring philosophy here and with the high turnover in HR, there is low likelihood the process will become streamlines or more efficient.", "Interview Questions": "Bland and generic answers, which is indicative of who is in leadership. Why do you want to work here? What do you bring to the job? Why should we hire you?"}, {"date": "5 Nov 2016", "title": "Program Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Council On International Educational Exchange in Aug 2016", "Interview Descriptions": "Sent me a link for a \"one way\" interview first; you go to a website and  questions pops up and you film yourself answering them.  A total pain, and serves no purpose but to save them time and effort.  Then got a real interview, everything went well, and I never heard another word from them again!", "Interview Questions": "Why are you interested in Study Abroad?"}, {"date": "13 Jul 2016", "title": "Senior International Sales Consultant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 7 weeks. I interviewed at Council On International Educational Exchange (Portland, ME)", "Interview Descriptions": "The interview process involved 4 interview and took 3 weeks to get the final decision a bit longer than expected. There were two initial interviews with HR specialists then a VP and the director I would have worked under.  Although the position seemed to be advertised as a Nanjing position one interviewer asked the question if it was in this other city in China would you relocate. It seemed like a test of your dedication kind of question. Some of the arrangement of the interviews took place with only a short window and there was a bit of confusion on interview meeting time.  \r\nGenerally the interviews were professional but other than increase enrollments it seemed they had not formulated exactly the expectations for the what the role would be selling . China has a lot of this \"feel the stones as you cross the river\" kind of practicality so this vagueness did not phase me much, but I could see in other contexts it might be difficult. \r\nFrom talking to some people in the organization it does seem that there is a lot of work for a small team and often evening meetings to suit the US time schedule. \r\n\r\nSeveral interviewers asked \"How will you build good relationships with team members in the US that you will not see often?\" It seemed they did not think this would be easy. \r\n\r\nCIEE seems like a good organization to work for with qualified people. However, despite having several programs in particular countries it seems they have silo culture which does not cooperate or share resources between different divisions I.e. Teach in China is completely separate from Exchange study abroad programs.", "Interview Questions": "\"How will you build good relationships with team members in the US that you will not see often?\""}, {"date": "26 Apr 2017", "title": "Campus Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Council On International Educational Exchange in Jun 2016", "Interview Descriptions": "I submitted an application at the beginning of June, sent a follow up email on a Thursday two weeks later and the next day I had an invitation for a one way interview. Like everyone else has said, it's really uncomfortable and kind of a pain but it saves them time. That part took 15 minutes to complete. I heard back in record time, within an hour they were scheduling me for an interview for the following Monday. They didn't have time to fly me out so I had 3 rounds of Skype interviews. They each lasted 30 minutes. I interviewed with a current Study Abroad Advisor, the person who would become my boss, and another Senior Manager. After the interviews concluded I rushed to send references at their request and about an hour later I received an offer.", "Interview Questions": "What previous experience I had that would help me in this position."}, {"date": "23 Jun 2017", "title": "Campus Coordinator Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Council On International Educational Exchange (San Francisco, CA) in Jun 2016", "Interview Descriptions": "You have you do a video recorded initial interview, then another 3 interviews over Skype with higher management . It's a fairly efficient process. The video interview is awkward as you read a question on the screen and are given a certain number of time to answer back in a recorded video. The other 3 interviews were also intimidating, and they each ask you the exact same questions.", "Interview Questions": "Why do you want to work for us? "}, {"date": "4 May 2016", "title": "Study Abroad Campus Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Council On International Educational Exchange in Apr 2016", "Interview Descriptions": "I had to participate in a video interview where I had to record myself responding to the questions that were prompted on the screen. Although it was awkward, it was actually a smooth and easy process that took about 15 minutes.", "Interview Questions": "What work experience makes you think that you'd be a good fit for this position?"}, {"date": "3 May 2018", "title": "Auxiliar of English Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Council On International Educational Exchange in Mar 2016", "Interview Descriptions": "Smooth interview process. Simply a submission of required documents, and a cover letter explaining your desire to work overseas and teach. The level of Spanish you have in this particular case will dictate the intensity of your program upon arrival. You will need to make that clear within your cover letter and required documents--as well as a possible follow up conversation with a representative from the company.", "Interview Questions": "Talk about your level of Spanish and where you learned"}, {"date": "27 May 2016", "title": "Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Council On International Educational Exchange (Portland, ME) in Jan 2016", "Interview Descriptions": "After I submitted my application (online via the web site - the system was a bit confusing for me) it was a full month before I heard from anyone other than the generic autoresponder that my materials were recieved.  I was first interviewed by a contracted HR talent recruiter/screener.  I was then told that I had made it to the next round but that because the people involved were really busy, I wouldn't hear from them for several weeks.  That was great news for me, actually, because I too was preoccupied at that time.  Then, suddenly I was contacted for a Skype interview with my would-be supervisor.  That was a bit frustrating and stressful as I had no time to prepare.  That interview took place 14 days after the screening call.  The day after that I was invited to an onsite interview, which took place about 3 weeks later.  \r\n\r\nI would describe the onsite interview experience as \"mixed\".  I was put in a specially set-up interview room to meet 1:1 via video conference with CIEE staff in other countries.  They were pleasant and engaged and had clearly prepared.  I met with several other people 1:1 in the same room in person, each for 30 minutes as well as with three administrators in their offices.  All were collegial.  I enjoyed those sessions greatly.  I was really very interested in the position and they seemed genuinely interested in me.\r\n\r\nHowever, several things about the process were disconcerting. I was not met at the hotel by anyone from CIEE (took a cab on my own to the hotel as planned - no problem), Despite having flown a fair distance for the interview, I ate breakfast at the hotel on my own.  Also, there were mistakes in the interview schedule in terms of the time slots, but the most bizarre thing was that there was no break for lunch built in.  I emailed the HR contact ahead of time to ask about that, but received no response.  So, I packed a snack and made sure I had a big breakfast.  Then, one of the people who interviewed me noticed that I had no break for lunch and had a sandwich ordered for me.  I was put in one of their little interview rooms and left to eat my sandwich alone!  I had exactly 10 minutes to snarf it down.  I also found it very odd that I was not scheduled to meet with either of the other two direct reports (the other people who would have been on the team for which I was applying to be a part) of the supervisor.  And, there was no group interview time, which meant that I answered many of the same questions over and over for each person and also meant that I had no opportunity to understand their group dynamics.  \r\n\r\n10 days after the interview I received an automated, unsigned, generic email from an unmonitored email account indicating they had selected another candidate.  Given the level of the position, the number of interview phases, and the time commitment on my part, this was not a good sign for me regarding the caliber of the organization.  I felt that if I were not contacted by phone, then a personalized email from the person to whom I would have reported would have been appropriate.  Given this way of being notified that I had not been selected, coupled with the many strange elements of the process described above, I would think twice before interviewing with CIEE.\r\n\r\nNB: The day after my interview, the position of one of the would-be team members was announced, which explains why I was not scheduled to meet that person (s/he had already resigned).  Also, from what I am able to discern, the position for which I interviewed has not been filled, 5 months later.", "Interview Questions": "Why did you apply for this position?"}, {"date": "24 Sept 2015", "title": "Assistant Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Council On International Educational Exchange (Portland, ME)", "Interview Descriptions": "Standard. HR preliminary phone interview followed by an in-person interview with decision-makers, future manager, and manager from secondary department.  Friendly and approachable, but challenging and requires preparation.  Very professional.  They cover all expenses, including a comfortable hotel and meals.  Very hospitable.  I need nine more words so I'm finishing out with this last sentence.", "Interview Questions": "Why do I want to work for CIEE more than with other organizations or universities."}], [{"date": "2 Dec 2015", "title": "Business Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Council On International Educational Exchange (Portland, ME) in Jun 2015", "Interview Descriptions": "Took a long time to hear anything, and then once I was offered an interview it was scheduled within a week. The candidate (me) was put in a special claustrophobic room, and each person on the panel met with the candidate individually. One panel member didn't even show up, and I sat in the room alone while waiting for him.", "Interview Questions": "Describe a problem you've overcome"}, {"date": "24 Jul 2015", "title": "Customer Service Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Council On International Educational Exchange (Portland, ME) in Mar 2015", "Interview Descriptions": "Long, repetitive, 7-8 different people. It was in a tiny room, which was a little too tiny. There was not much privacy. The people were very nice ESPECIALLY the human resource director. She was so sweet.", "Interview Questions": "What does customer service mean to you?"}, {"date": "5 Apr 2017", "title": "International Recruitement Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Council On International Educational Exchange (Portland, ME) in Sept 2014", "Interview Descriptions": "Incredibly long! I was interviewing for almost four hours. Sometimes it was with one person, other times with three people. One of them was on Skype and that was awkward. But definitely plan on at least a half day for the interviews.", "Interview Questions": "How do you feel about traveling with a big group?"}, {"date": "14 Apr 2014", "title": "Support Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Council On International Educational Exchange (Portland, ME)", "Interview Descriptions": "This was a fairly quick process until they had to make their decisions. I receives a call asking for a phone interview two days after I sent iny resume and had the phone interview during that same week. A week later I was asked to come in for an in person interview and met with five people for individual interviews over about 4 hours. I was told I would hear from them in the next 2  weeks but after I had heard fromy references that they were called it was about another 2 weeks.", "Interview Questions": "Be prepared to answer situational questions on how you would respond to certain difficulties students may be going through."}, {"date": "8 Jan 2014", "title": "Enrollment Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Council On International Educational Exchange", "Interview Descriptions": "I was initially contacted for a phone interview, which went great. Then, I had a skype interview that went fine. I was told to wait since they had a busy time of the year coming up, but also told not to freak out. After a month of no response, I emailed and they said they had decided to interview other candidates- no one ever bothered to tell me I was no longer in the running. When I (very politely) asked if I could be told why I was no longer being considered, there was never any response. A few weeks later I get another email saying I'm no longer in the running. Great, thanks.", "Interview Questions": "Name a situation where someone else had a problem and you had to help fix it. "}, {"date": "4 Aug 2013", "title": "Support Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Council On International Educational Exchange (Portland, ME) in May 2013", "Interview Descriptions": "Need to find positions on website; phone interview; skype interview; company paid flight to Portland and company paid hotel room for a face-to-face interview.  Staff are nice but a bit unprofessional.", "Interview Questions": "If a homestay parent called the police on a student, what would you do?  (They don't like to remove students from their homestays)"}, {"date": "28 Oct 2012", "title": "Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Council On International Educational Exchange (Portland, ME) in Jul 2012", "Interview Descriptions": "One month process from application to hire, three Interviews with team members and one with HR.", "Interview Questions": "Interviewed from within the company and had to answer questions on conflicts in my current workplace. It was awkward."}, {"date": "20 Jan 2016", "title": "Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Council On International Educational Exchange (Portland, ME) in May 2012", "Interview Descriptions": "I had a phone call weeks after submitting an app online. They set up a phone interview, and that went well. Basic questions. I had an in-person interview (lived four hours away, no travel reimbursement). Also basic questions. I hit it off with the manager and we spoke for an hour, mostly not related to the job. I received an offer via voicemail. I was hired, and started one month later.", "Interview Questions": "dEscribe a difficult situation and how you handled it"}, {"date": "21 Nov 2011", "title": "Coordinator, Events & Travel Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 2 days. I interviewed at Council On International Educational Exchange (Portland, ME) in May 2011", "Interview Descriptions": "The interview process began with a phone screening by an outside company (I believe). The questions asked were pretty standard. I was then invited in for a face-to-face interview. I met with my direct supervisor, my supervisor's supervisor, and managers in other departments I would be working with. Finally, I met with the HR representative to discuss benefits, etc. I appreciated the fact that they I was able to meet with all of these people in one visit as I had to travel out of state for the interview. For the most part people were very nice, professional, and interested in learning about my background and explaining the work they do. The HR representative was especially helpful. When we discovered that the salary range available would not work for me, she continued to speak with me and give me recommendations for other companies or jobs that might suit what I was looking for.", "Interview Questions": "I was given several situational questions. Due to the international nature of the company, several questions related to how I would react to deal with problems that occur with students abroad, and juggling the needs of parents/educators/government officials/business partners when a problem arises. "}]]