[[{"date": "2 May 2023", "title": "Science and Impact Fellow Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Oceana (Washington, DC)", "Interview Descriptions": "I was contacted via email to set up an interview with the person that would serve as my manager. We met on Zoom and they (singular) asked me about my experience and told me about the role.", "Interview Questions": "Tell me about your fisheries experience in international sphere."}, {"date": "26 May 2023", "title": "Communications Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Oceana (Washington, DC) in Feb 2023", "Interview Descriptions": "Very lengthy process, took a while to schedule each step, but organized and professional. First step was a panel interview followed by several follow-up interviews. Appreciated that I had a direct line of contact with the hiring manager and that they were communicative even after I did not get the job.", "Interview Questions": "Have specific work examples prepared relevant to position,"}, {"date": "5 Jul 2022", "title": "Advancement Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Oceana", "Interview Descriptions": "I had three interviews. The job description and title changed with each interview, and it was clear there was lack of internal communication. At the last interview they spent ten minutes going over what my benefits were going to be, and then all my follow ups were ignored.  I got a rejection email about three months later.", "Interview Questions": "Why do you want to work for us"}, {"date": "4 May 2022", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Oceana", "Interview Descriptions": "The interviewer asks you the regular questions as well as why you are choosing Oceana. I thought the interview was fair and straightforward. I only had one interview but  I know at higher levels you go through more rounds", "Interview Questions": "Tell me why you want to work at Oceana"}, {"date": "27 Sept 2021", "title": "Research Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Oceana", "Interview Descriptions": "I was connected with Oceana staff through my graduate program. The interview process was fairly informal. I have gotten hands-on experience directly in the field I am interested in, and have enjoyed this internship.n", "Interview Questions": "Past experience related to the internship topic"}, {"date": "23 Feb 2023", "title": "Comms Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Oceana in Apr 2021", "Interview Descriptions": "I interviewed with some guy who seemed very friendly at first, but kept grilling me about where I had \"project management\" experience. I did my best to explain that to him thru the interview, but he straight up said he \"didn't buy it.\" Very condescending person, and I never heard back about the job", "Interview Questions": "where do you have Project management experience?"}, {"date": "29 Jan 2022", "title": "Science & Strategy Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Oceana (Washington, DC) in Feb 2021", "Interview Descriptions": "Overall the process took about a month. I had 3 interviews (there was a possibility for a 4th) which seems like a lot for an intern position but I could tell they were just looking for the right person. First interview was a phone screening with the hiring manager, second was a panel interview with others in the team. Everyone was really nice and professional. The third was a zoom conversation with the hiring manager again. Then got back to me within a week with their decision.", "Interview Questions": "Why do you want to work for us?\r\nWhat can you tell me about your understanding of population dynamics?\r\nA time when you made a mistake?\r\nHow do I stay organized?\r\nIf I prefer collaboration or working independently  \r\nIf I’ve ever worked remotely before \r\nWhat kind of managing style do I work best with "}, {"date": "11 Jan 2021", "title": "Campaign Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Oceana", "Interview Descriptions": "The interview was relatively brief and was only held with the campaign director, although I was introduced to other staff as I was given a tour of the office. The questions that were asked of me were quite typical of an interview.", "Interview Questions": "Where do you see yourself in 5 years?\nWhat are your strengths and weaknesses?\nWhat is your research background?\nTell me about yourself."}, {"date": "8 Sept 2020", "title": "Ocean Advocate Position Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Oceana", "Interview Descriptions": "Took about six months and involved several rounds of interviews. Everyone was very nice and while I was nervous, I never felt intimidated. I thought it was a fair, yet thorough process.", "Interview Questions": "What are some of your strengths and weaknesses?"}], [{"date": "21 Jun 2021", "title": "Content Strategist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Oceana (Washington, DC) in Jul 2020", "Interview Descriptions": "The role they were asking me about was different than what the position online said. It ended up being a bad fit. I had to chase them down for a response after the interview. I think if I hadn't done that they would have ghost me. Entire process about 3 weeks", "Interview Questions": "They didn't ask that many questions tbh. I asked a lot because of the difference in the reality of the role vs. what they shared on their website "}, {"date": "28 Oct 2019", "title": "Social Media Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Oceana in Sept 2019", "Interview Descriptions": "Applied, waited a few weeks before finally being contacted for an phone interview. Was told that there would be a social media test three weeks later, but never received it, and ended up getting ghosted.", "Interview Questions": "How would you improve Oceana's social media content?"}, {"date": "24 Jul 2019", "title": "Communications Strategist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 5 weeks. I interviewed at Oceana in Mar 2019", "Interview Descriptions": "The interview process was very hurry-up and wait, and ultimately a disorganized waste of my time. I met initially with the hiring manager for what I expected to be a casual networking chat. Turns out it was a job interview (unbeknownst to me). Although I wasn’t aware of an opening (and none was listed on the website), I was happy to discuss a new position the hiring manager clearly thought would be a good fit for me. I left feeling excited about what sounded like a great career move and confident I was a top candidate for the job.\n\nThe hiring manager quickly arranged for me to interview one on one with each member of team. In one day I interviewed back-to-back with four people in person and one via Skype. I had another Skype interview the next day and a phone interview with the final team member the following Monday. So seven people in three days. The manager was also in a rush to have me submit a formal application (including references) and take a writing test (very straightforward and not too time-consuming).\n\nEveryone on the team had done their homework and came to the interviews prepared with specific questions for me based on my resume. They were all friendly and professional. I liked them and believe I would have enjoyed working with them. While they asked about how my previous job experience would inform my work at Oceana, each of them zeroed in on my communications style and ability to work well with others. The subtext was unmistakable: they were frustrated because their manager didn’t communicate with them.\n\nAfter this flurry of activity, nothing. The next step was supposed to be a final interview with the president  of Oceana and the Comms VP, but all I got for three weeks was crickets. I finally had to contact the hiring manager myself to ask what was going on. That particularly bothered me—it was their responsibility to communicate with me, not the other way around. I emailed him in the morning and didn’t get a response until after 6 pm—telling me they were no longer going forward with creating the position! I invested a lot of time and effort to apply for this job, only to be left hanging for three weeks and then be told, effectively, “sorry, my bad, we changed our minds.” Incredibly unprofessional.", "Interview Questions": "Describe your communications style."}, {"date": "26 Jul 2018", "title": "Director of Development Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Oceana (Washington, DC)", "Interview Descriptions": "It has been a little over a year since I interviewed for two roles at Oceana (Director of Development and Operations and Projects Manager), nevertheless I still remember the interview process as if it were yesterday. The NGO is in a very unique position: \"What do we do with a large sum of money?\" They grew so fast, they literally do not know how to manage the organization. But first, let me start with HR and the phone screen. \r\n\r\nThe HR lady was good to work with, transparent and communicative. After our Skype call, I was invited to interview in Washington DC for the two roles. I should note that Oceana did cover my travel costs which was nice. I met with more than 7 people, most of which were completely unprepared. One meeting I had was with one person in a room, and two more on a skype call and they did not or could not get Skype to work, so that ate 30 minutes into our call. Only one person asked my why I was passionate about wanted to work with them. Most of the employees categorized their work place as, \"organized chaos.\" When interviewing with someone for the OPM role, we did not even discuss the role, which was bizarre. \r\n\r\nProbably the highlight (low-light?) of the day for me though was interviewing with the COO. I knew the whole day was a waste of time when I walked into his office and he said, \"So, what's your name and what role are you interviewing for?\" We then spent about 30 minutes talking about processes - clearly that was his niche but not necessarily what I would be doing in the roles I was interviewing for. I asked him what his favorite part about his job was and he replied, \"Winning.\"\r\n\r\nAnd there is the apparent main problem with the org: With their Harvard and McKinsey mindset, management is stifling their employees and any possible creativity. After I left, I knew I wasn't going to work there, even if offered the role. I kind-of felt bad for the employees and frankly, the whole organization, with such a great mission, could be run better.", "Interview Questions": "Besides the normal interview questions, my favorite was, \"So, what's your name and what role are you interviewing for?\""}, {"date": "26 Jan 2021", "title": "Director De Comunicación Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Oceana (Ciudad de Mexico) in Jul 2018", "Interview Descriptions": "Fue muy bueno, tuve entrevistas por los directivos en México, luego con dos personas vía zoom en la sede de EU, después una en persona con el director general de la oficina en México. Hasta que llegó la oferta final.", "Interview Questions": "Si como pescado y mariscos"}, {"date": "2 Jun 2022", "title": "Senior Accountant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at Oceana (Washington, DC) in May 2018", "Interview Descriptions": "Two rounds of interviews, might have gotten offer but I dropped out in the middle of the process b/c received another offer elsewhere.  Interviewers were punctual and polite, overall good interview experience.", "Interview Questions": "Why do you want to work here?"}, {"date": "9 Nov 2017", "title": "Social Media Associate Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Oceana (Washington, DC) in Oct 2017", "Interview Descriptions": "I applied and heard back quickly that they wanted to set up a phone interview with me. I interview about 2 days later and heard a week later that I did not get the job.", "Interview Questions": "Describe a recent social media innovation by a non-profit that you were impressed by."}, {"date": "13 Feb 2017", "title": "Social Media Strategist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Oceana (Washington, DC) in Feb 2017", "Interview Descriptions": "The people are great and seem nice. Unfortunately they don't have a good process when it comes to interviewing. The manager asked me in the phone screen what my salary expectations were and then proceeded to go through with an in-person interview (I had to submit a writing test as well). They don't like to have you coming back for multiple interviews but that also means you have to come in for about 3 hours and meet with what seems to be the entire company. They are pleasant to talk to. The manager said she would get back to me by the end of the week but actually didn't get back to me until a full 12 days later. She then said that unfortunately she could only afford to have someone for about 40K less than what I was asking for because they are a non-profit. Which I would of understood if we hadn't talked about salary in the initial phone screen. I was a bit confused as to why they would waste time on both sides. Long interview but way off on salary. If you interview here just know they are vastly underpaid with little perks to make up for it. Also, if you drive in, you'll be paying over $20 in parking because street parking limits are for 2 hours. Don't waste you time. Even when I made sure we talked about salary, they knew they couldn't afford me and still had me come in.", "Interview Questions": "They mostly want to see how you work with others. Your working style and what you look for in a manager."}, {"date": "29 Mar 2017", "title": "Marine Scientist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at Oceana in Feb 2016", "Interview Descriptions": "3 interviews: 1 phone interview, 1:1, and group interview. Easy questions and very friendly staff, however it seems as they don´t communicate very well among the team, since questions were asked over and over", "Interview Questions": "Why would you like to work for Oceana? Why am I qualified for this position? Background information about my career and studies."}, {"date": "7 Apr 2017", "title": "Legal Fellow Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Oceana (Washington, DC) in Oct 2015", "Interview Descriptions": "After submitting CV, resume, etc. I received a phone interview. The interviewer was the existing fellow. He did not seem very interested, and was your typical law school grad. He asked standard interview questions.", "Interview Questions": "Why are you interested in working here?"}], [{"date": "7 Aug 2015", "title": "Climate Change Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Oceana in Jul 2015", "Interview Descriptions": "It was surprisingly pleasant! The current intern for the program was tasked to find a replacement, so it was the intern who conducted the phone interview. The position is hired on a rolling basis, so I wasn't contacted until two months after I applied. One day, I received an e-mail from the intern asking for a quick chat about my interest for the position. The intern first asked about my background and interest in working for the organization. Then the intern asked if I was comfortable with the salary range and responsibilities of the intern position (aka deal breakers).", "Interview Questions": "Why did you apply to Oceana and in particular to this program?"}, {"date": "29 Aug 2015", "title": "Science Fellow Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Oceana (Washington, DC) in Jun 2015", "Interview Descriptions": "I got interviewed for the position by two women consecutively (both of which were not in touch with me before). They were both very nice and asked mostly the regular interview questions. However, they said they would contact me the following week, but they did not. They contacted me 2 weeks after the date that they said they would...", "Interview Questions": "Are you cofortable doing cold calls? (They do not have databases that are accessible to do the necessary research that is expected from a Science Fellow, so papers have to be acquired directly from the researchers who authored the papers)"}, {"date": "10 Mar 2014", "title": "Summer Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Oceana (Cambridge, MA) in May 2013", "Interview Descriptions": "I filled out a simple online application and received a call within 2 weeks. Interview was stress-free, basic questions like \"why do you want to work here\" and \"what do you study in school?\" My boss (the Oceana campaign coordinator for the entire Northeast) was very flexible with when I began work, so long as I worked for at least 3 months.", "Interview Questions": "No technical questions. No unexpected questions."}]]