[[{"date": "16 May 2023", "title": "Project Management Data Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Saint Peter's Healthcare System in May 2023", "Interview Descriptions": "I had two rounds of interviews. The first one was virtual and the interview went very well. They were professional, thorough on what to expect and very helpful. The recruiter helped me as much as possible to help me get prepared and it helped so much. The second round went very well too. Both managers were super respectful and I was able to really demonstrate my skills and abilities.", "Interview Questions": "Tell us some of the skills and abilities you possess that would help you in this role."}, {"date": "5 Jul 2023", "title": "Director, Internal Audit Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Saint Peter's Healthcare System in Jan 2023", "Interview Descriptions": "Overall great interview experience from initial phone call with recruiter to final interview with executive team. Recruiter was quick to response to questions throughout the entire process and was helpful with completing the offer process and onboarding. Total of 3 interviews with increasingly higher ups in the organization.", "Interview Questions": "Describe an experience where you had to directly deal with push back from the board and/or audit committee regarding audit findings?"}, {"date": "22 Nov 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Saint Peter's Healthcare System", "Interview Descriptions": "very easy going, interview process seemed more of a conversation than an interview which made it less stressful. welcoming environment, staff friendly with smiles. discussed wishes while working at the facility as well as what I could bring to the table", "Interview Questions": "why do you want to work for St. peters"}], [{"date": "12 Apr 2023", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Saint Peter's Healthcare System (New Brunswick, NJ) in Jan 2022", "Interview Descriptions": "Went well. Asked me why I wanted to work here and some scenario questions. Make sure you come early before the interview so you don’t get losted. I only had to do one interview and then I got an email a couple days later saying I got accepted.", "Interview Questions": "Why do you want to work here?"}, {"date": "12 Oct 2021", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Saint Peter's Healthcare System", "Interview Descriptions": "Mainly was via phone calls and only an in person interview once they are clearly interested in you with the manager at the unit.  The parking is not free so expect to pay for parking for the interview in person. HR was nice and answered faster then other locations I had applied too.", "Interview Questions": "What is one of your weakness?"}, {"date": "24 Aug 2020", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Saint Peter's Healthcare System in Jul 2020", "Interview Descriptions": "15 minute phone interview, have your answers ready. then I met with the nurse manager and had another interview. the phone interview lets you know pretty much everything because its with HR", "Interview Questions": "They asked about how  religion & spirituality comes into play when working as a nurse here at Saint Peters"}, {"date": "19 Aug 2020", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Saint Peter's Healthcare System in May 2019", "Interview Descriptions": "Interview was set up over email/phone. Went in person, met with nurse recruiter in HR who grilled me. Then went over to the hospital to meet with nurse manager who was very nice. After the interview sent thank you emails, later follow-up phone calls, but never heard back. Completely unprofessional to get ghosted by a company. It's okay to say it wasn't a good fit but at least say so.", "Interview Questions": "Why did you leave your last job?"}, {"date": "23 Jan 2019", "title": "Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Saint Peter's Healthcare System", "Interview Descriptions": "I applied via their online application and they contacted me back saying they would like me to come in for an interview. The first interview was with HR, the 2nd with the nurse manager for the unit I applied for.  HR will let you know in an email what documents to bring. \r\n\r\nBoth HR and nurse manager were very friendly. After the interview, they will let you know of their decision. I received mine in 2 days. They then told me to come in for a medication calculation and pharmacology exam 30 questions. The pharm part was easy, basic medication administration knowledge (e.g. give you a scenario and you select what to do). Medication calculation was easy (flow rate, conversions, etc.). You need minimum 85% to pass, but you can retake if you fail.\r\n\r\nPlease note: After the interview, they will not give you a formal hiring letter, only a verbal statement that they want to pursue you as a candidate for the position. They will contact you regarding the hiring letter after your medication exam.", "Interview Questions": "Why are you interested in St Peter's nurse internship program?"}, {"date": "10 Nov 2018", "title": "Nursing Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Saint Peter's Healthcare System (New Brunswick, NJ) in Oct 2018", "Interview Descriptions": "Applied in October and got a call back for an interview within one day. Scheduled interview with both HR and manager two days later. Both parties asked a lot of questions and were very friendly. They told me I should hear back within a week but I haven’t.", "Interview Questions": "What made you want to become a NA?"}, {"date": "22 Jan 2018", "title": "Anonymous Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Saint Peter's Healthcare System", "Interview Descriptions": "Applied online through website. Received call from Human Resources the following morning for preliminary phone interview. Set up in person interview with HR and heads of department the following week. On arrival, met with HR first and then department heads. Department heads spent most of the time asking if I had questions for them rather than asking questions about my experience. Verbally implied I would be a good fit/qualified but I left uncertain because of lack in of interest in me beyond written resume. No response to follow up after interview.", "Interview Questions": "More conversational about topics based on written resume."}, {"date": "20 Apr 2021", "title": "HRIS Analyst Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Saint Peter's Healthcare System in Oct 2017", "Interview Descriptions": "Quick, rather short, but full of specific questions about data and system knowledge. Company uses some rarer systems but is slowly upgrading. Pretty short line between this role and the head of HR", "Interview Questions": "Expertise on usage of Lawson, knowledge of Global HR. Experience in performance management systems (SuccessFactors)"}, {"date": "16 Apr 2018", "title": "Nursing Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Saint Peter's Healthcare System (New Brunswick, NJ) in Aug 2017", "Interview Descriptions": "I applied for the job on the website, heard back the next day and scheduled an interview for the following week. I met with HR and the unit nursing manager and they called me back that day to offer me the position.", "Interview Questions": "Describe an experience with a difficult patient "}, {"date": "1 Aug 2017", "title": "Nursing Unit Secretary Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 2 weeks. I interviewed at Saint Peter's Healthcare System (New Brunswick, NJ) in Aug 2017", "Interview Descriptions": "Applied mid/late July and sent a follow-up email about a week later, and received a call for an interview 2 days later. Interview with recruiter was very nice and then she sent me over to the unit's nurse manager and I interviewed with her and her assistant. Was hired on the spot.", "Interview Questions": "Tell me about yourself."}], [{"date": "31 May 2017", "title": "PCT/CNA Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Saint Peter's Healthcare System (New Brunswick, NJ) in May 2017", "Interview Descriptions": "The interview was an open house event for PCTs/CNAs/Maternity Techs. After signing in, everybody waited in a large room and they called us up one by one. First step was speaking to the recruiter who talked about hours and availability, was then handed off to a nurse manager to talk about interests and job duties and such.", "Interview Questions": "What makes you interested in working for us?"}, {"date": "23 Dec 2016", "title": "Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Saint Peter's Healthcare System (New Brunswick, NJ) in Nov 2016", "Interview Descriptions": "On the spot interview at a job fair. The nurse manager was very easy to talk to and very pleasant. I felt that she was receptive to my answers and I subsequently was brought on a tour of the unit. I was then given the internship opportunity.", "Interview Questions": "Why are you interested in blank (you have the opportunity to indicate your top 4 units)"}, {"date": "12 Jan 2018", "title": "Unit Clerk Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Saint Peter's Healthcare System (Edison, NJ) in Jan 2016", "Interview Descriptions": "It was a group interview with seven other people. The interviewer did not meet with anyone individually. She asked questions about past jobs and what we liked and did not like about working in a group. We mostly introduced ourselves and left a copy of our resumes.", "Interview Questions": "What do you like and dislike about working in a group."}, {"date": "4 Jun 2018", "title": "Medical Laboratory Scientist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 1 day. I interviewed at Saint Peter's Healthcare System in Jun 2015", "Interview Descriptions": "Interview process will be hands on; do a panel, read microscope slides for differentials, look at urines, etc. Once you get a phone call from HR regarding an offer, you will need to schedule for orientation prior to starting the job. Orientation is paid and is an all day event on premise.", "Interview Questions": "What form do you need a physician to sign for uncrossmatched blood and what type of blood would you give?"}, {"date": "10 Jun 2015", "title": "Medical Technician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Saint Peter's Healthcare System (New Brunswick, NJ) in Feb 2015", "Interview Descriptions": "comfortable,Not as stressful as expected, the panel seemed to be impressed by the answers.The environment was clean and impressive and something one would want to work around.The hours of work seemed to be not as aggressive and stressful as compared to my last job.", "Interview Questions": "How will you help the community with your role in the hospital"}, {"date": "18 Aug 2017", "title": "Help Desk Technician Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Saint Peter's Healthcare System (New Brunswick, NJ) in Jan 2015", "Interview Descriptions": "The interview was with my vendor only.  They asked me if I have A + certification and that was it. No interview on-site. I was called by the vendor who has a contract with Saint Peter's", "Interview Questions": "N/A"}, {"date": "5 May 2014", "title": "Respiratory Care Practitioner - Pulmonary Function Lab Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. I interviewed at Saint Peter's Healthcare System in Apr 2013", "Interview Descriptions": "I had 2 phone interviews with Colleen.two offiice interviews with Colleen. when to an all day CEU confrence where i meet the staff I had to meet with Cynthia I also got to meet the other supervisors.", "Interview Questions": "N/A"}, {"date": "29 Jul 2016", "title": "Patient Observer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Saint Peter's Healthcare System (New Brunswick, NJ) in Mar 2012", "Interview Descriptions": "IT was very brief and simple. The position requires that you know how to babysit. But soon, you'll realize there is more to the job. You'll learn things about human behavior and see in a higher form.", "Interview Questions": "Have you ever done babysitting?"}, {"date": "2 Apr 2011", "title": "Respiratory Therapist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 1 day. I interviewed at Saint Peter's Healthcare System (New Brunswick, NJ) in Oct 2010", "Interview Descriptions": "was interviewing for kimbel medical center in lakewood New Jersey. spoke with the director of respiratory over the phone, no interview with HR", "Interview Questions": "Why do you want to leave your present job?"}]]