[[{"date": "26 Jun 2023", "title": "Student Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Kent State (Kent, OH)", "Interview Descriptions": "It was an in-person interview at cafeteria. Interviewer makes sure we have basic computing knowledge IN regards to identifying / troubleshooting software issues. Job is definitely yours if you are a tech geek or nerd.", "Interview Questions": "Soft skills Troubleshoot issue and problem solving"}, {"date": "27 Aug 2022", "title": "Special Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Kent State", "Interview Descriptions": "The process was  very pleasant. It was smooth, quick and efficient.   I had two interviews with them during the process. I met with hiring managers after a screen by Human Resources.", "Interview Questions": "What skills do I think are most needed for this position?"}, {"date": "12 Jul 2022", "title": "Project Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Kent State", "Interview Descriptions": "Phone interview, virtual interview with search committee, final interview with 3 groups- search committee, office staff, dean. Final interview took half a day.  References were also interviewed. The process was overall very thorough.", "Interview Questions": "Describe your approach to project management"}, {"date": "3 Feb 2022", "title": "Human Resources Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Kent State", "Interview Descriptions": "First a phone interview, then in-person interview. The phone interview was about a half hour, and the in-person interview was a little longer. The questions are basic and easy. They check references, and then you get a job offer.  The process is easy, but disorganized.", "Interview Questions": "How do you prioritize your daily tasks?"}, {"date": "31 Jan 2022", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Kent State", "Interview Descriptions": "The process was fairly simple! It was in person and I was asked a series of questions related to me and my interest in working at that job. After that, I also gave a set of hours of when I could work.", "Interview Questions": "Why do you want to work here?"}, {"date": "31 Aug 2021", "title": "Athletics Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Kent State", "Interview Descriptions": "I Just knew someone based off a previous relationship. They recommended me for it. It was an easy onboarding process. That is it. The people there are very sad. It was not a fun place to work.", "Interview Questions": "None that warranted a response. "}, {"date": "27 Aug 2021", "title": "Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Kent State", "Interview Descriptions": "It was good, friendly and relaxed. The person who interviewed me was a nice and she was also my boss. The interview is pretty straightforward, they ask a few questions and because you got a recommendation you are already in basically.", "Interview Questions": "What would you like to tutor? What courses have you completed?"}, {"date": "18 May 2021", "title": "Graduate Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Kent State", "Interview Descriptions": "Very good, I felt very respected. Very laid back and people have good personalities! The interview was relaxed and I felt very comfortable. Kent is an amazing school, I’m proud to be part of the alumni network!", "Interview Questions": "What is your experience with diverse populations?"}, {"date": "20 Apr 2021", "title": "Campus Tour Guide Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Kent State", "Interview Descriptions": "Interview felt very relaxed and casual. Time to hear back was not very long either which was nice. Interview was quick and simple as well. Very nice people during the process", "Interview Questions": "Why did you choose Kent State? "}, {"date": "18 Apr 2021", "title": "Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Kent State", "Interview Descriptions": "Began with a brief Phone interview with the committee chair person, we talked about my experience and my preferred salary requirements. Several weeks a follow up interview with the Vice President and members of the committee.", "Interview Questions": "Conducted a data analysis and made a presentation ."}], [{"date": "1 Apr 2021", "title": "Operations Crew Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Kent State", "Interview Descriptions": "Role: Operations Crew Student Center. Only one round interview that lasted 30 minutes. Questions varied between general interviews and questions regarding situational work hypotheticals. Offer extended via email within a week of the initial interview.", "Interview Questions": "How do you handle multitasking?"}, {"date": "23 Mar 2021", "title": "Academic Advisor Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Kent State", "Interview Descriptions": "Half-day interview. I have a presentation and answered some questions from a panel of about 10 people, met with the director of the office, and then spoke informally with the search committee chair.", "Interview Questions": "The questions were mostly behavioral and scenario-based (how would I handle this or that challenging situation with a student, etc.)"}, {"date": "16 May 2022", "title": "Exploratory Mentor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Kent State (Kent, OH) in Mar 2021", "Interview Descriptions": "Great experience where I got to know the supervisors and community while also learning about the position and what it entails. Previous experience is not required, however, student workers who receive the position are highly preferred to have been in the Exploratory Learning Community as a previous Exploratory major. Great on-campus position!", "Interview Questions": "What are three characteristics that you use to describe yourself?"}, {"date": "17 Apr 2023", "title": "Residents Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 5 months. I interviewed at Kent State (Kent, OH) in Nov 2020", "Interview Descriptions": "filling out an application followed by a virtual interview. A super simple process followed ny a fairly long wait time which can be very anxiety inducing. After this wait time you are informed of your status of employment.", "Interview Questions": "What would you do to build a community?"}, {"date": "29 Apr 2021", "title": "End User Support Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Kent State in Aug 2020", "Interview Descriptions": "Very formal and respectful of my time and status over zoom. The process was very secure and timely in regards to my time and clarity for what the job entailed", "Interview Questions": "How would you benefit the team? How well do you know Mac vs PC issues?"}, {"date": "28 Dec 2020", "title": "Assistant Professor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Kent State (Kent, OH) in Mar 2020", "Interview Descriptions": "Two round interview process, online then in person. They squeezed it all into one day. Spoke to department head, dean, search committee. Presented to faculty and to students. Two restaurants meals with various search  committee members.  Did not end up getting the job but overall  a fine experience.", "Interview Questions": "They were very interested in technology and how I would employ it in teaching."}, {"date": "28 Oct 2019", "title": "Learning Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Kent State", "Interview Descriptions": "One phone interview and then an in-person interview with 2 managers. Very quick and direct process that was easy to follow. After my second interview I waited around 2 weeks until I received another phone call where my future boss formally offered me the job.", "Interview Questions": "Greatest strengths and weaknesses"}, {"date": "26 Sept 2019", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Kent State", "Interview Descriptions": "The interview was brief, but worth it. I was nervous at first, but the interviewer made me feel more comfortable.  Just make sure to wear something office appropriate to the interview and answer every question with confidence and you'll be fine.", "Interview Questions": "Tell me how you organize, plan, and prioritize your work."}, {"date": "30 Nov 2020", "title": "Operations Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Kent State (Kent, OH) in May 2019", "Interview Descriptions": "Very professional interview for an on campus job. I was asked to give a statement on why I would make a great choice for the position, and talked about how I might handle miscellaneous scenarios.", "Interview Questions": "Q: What qualities will make you a good leader if you receive this position?"}, {"date": "19 Dec 2018", "title": "Deli Clerk/Bakery Assistant/Chicken Fryer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Kent State", "Interview Descriptions": "Easy What’s your name what’s your number how old are you why you want to work herewe suckat our job and no one need to work here because it has no benefits", "Interview Questions": "N/A"}], [{"date": "23 Sept 2018", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Kent State", "Interview Descriptions": "It was for 30 minutes panel interview. It was just one round interview. All the basic questions were asked. It was a good professional experience.  I learned a lot from that interview.", "Interview Questions": "Tell me something about yourself?"}, {"date": "5 Sept 2018", "title": "Health Care Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Kent State", "Interview Descriptions": "Interviewers were well prepared and had thoughtful questions. Seemed like a great place to work. There were several people conducting the interview, and they each had a select number of questions to ask.", "Interview Questions": "How would your presence here as an employee make a difference?"}, {"date": "10 Dec 2018", "title": "Student Computer Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Kent State (Kent, OH) in Aug 2018", "Interview Descriptions": "I work at the Service and Repair Center at Kent State University. The interview was very simple and straightforward. They are looking for individuals with a basic level of computer troubleshooting and repair knowledge. I was interviewed by one man in a relaxed atmosphere. He spoke to me as a friend rather than a boss.", "Interview Questions": "Don't overcomplicate the question, but what steps would you take if someone was having trouble connecting to the WiFi?"}, {"date": "2 Jul 2018", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 5 weeks. I interviewed at Kent State", "Interview Descriptions": "The interview was very briefly related to the research project. They asked me questions related to my strength and weaknesses. My passion why I am interested in working on their project.", "Interview Questions": "Why I chose the Public health field though my undergrad was in dentistry"}, {"date": "8 Oct 2019", "title": "Security Guard Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Kent State (Kent, OH) in Jun 2018", "Interview Descriptions": "Straightforward questions about why I want the job so on and so forth. Basically asked how I'd handle conflict and solve a situation that involved drugs or any other sort of paraphernalia", "Interview Questions": "How would you mediate conflict"}, {"date": "28 Mar 2018", "title": "Senior Secretary Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Kent State (Kent, OH) in Feb 2018", "Interview Descriptions": "Requires to take civil service test before interview. Very professional. Panel interview with 4 people for 30 minutes after which I met separately with the Dean who gave a tour while also asking several more questions.", "Interview Questions": "Basic questions. Weaknesses, Strengths and work ethics. "}, {"date": "7 Jan 2018", "title": "Teacher/Instructor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Kent State", "Interview Descriptions": "I was interviewed to become a PhD student in Math. It was mainly academic questions.  I were not interviewed in person, it was on skype.  The Academic Adviser of the whole program is the one who interviews you.", "Interview Questions": "Which courses did I have?"}, {"date": "3 Apr 2019", "title": "IT Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Kent State (Kent, OH) in Jan 2018", "Interview Descriptions": "Mostly questions from my resume. And what I would do for a certain situation. Scenarios and the possible solutions at that moments.  Mostly questions from my resume. And what I would do for a certain situation. Scenarios and the possible solutions at that moments.  Mostly questions from my resume. And what I would do for a certain situation. Scenarios and the possible solutions at that moments.  Mostly questions from my resume. And what I would do for a certain situation. Scenarios and the possible solutions at that moments.", "Interview Questions": "asked about different aspects of my resume "}, {"date": "15 Nov 2019", "title": "Writing Center Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 3 days. I interviewed at Kent State (Kent, OH) in Oct 2017", "Interview Descriptions": "Went through a training course and had an interview halfway through the semester, and other smaller interviews later on, about my comfort as a tutor, what I felt I was mastering and what I was struggling with.", "Interview Questions": "How are you feeling about tutoring?"}, {"date": "15 Aug 2017", "title": "Quality Assurance Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Kent State (Cleveland, OH)", "Interview Descriptions": "Was interviewed by 4 people via telephone. Questions were basic HR questions and I felt I did well. The panel people were very warm and friendly.  Answer all your questions to the best of your ability and make it seem like you can talk and communicate well. That is a plus.", "Interview Questions": "What was one accomplishment u achieved in your previous job?"}], [{"date": "29 Sept 2017", "title": "Marketing Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Kent State (Kent, OH) in Jul 2017", "Interview Descriptions": "Took them a month to contact me after applying online. They gave me some time slots to do a Skype interview. I accepted even though I lived really close. Then a week later I was called to go in  and was offered 1 time or I was no longer considered. I called off work to go in and thought it went well. They said they'd contact in a week. Nothing. I emailed to follow up. No response. I waited a few more weeks and followed up again. Still nothing. It's been almost 2 months. I couldn't even get a rejection email after taking time off to show up when asked. So rude.", "Interview Questions": "What ideas do you have to improve donations? "}, {"date": "12 May 2017", "title": "Shift Supervisor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at Kent State", "Interview Descriptions": "There was no interview, I was hired upon application submission. They asked no questions, offered no training, and I walked right on. There was little no managerial involvement. They would literally hire anyone with a pulse", "Interview Questions": "N/A"}, {"date": "4 Jul 2017", "title": "Academic Advisor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Kent State (Kent, OH) in May 2017", "Interview Descriptions": "The first of two interviews took place via phone and occurred relatively quickly after the posting closed. The second interview was conducted via Skype and involved an hour-long presentation. In other circumstances, the second interview would have occurred in person, however, due to limitations and time constraints, they opted for a virtual final interview.\r\n\r\nAfter reflecting on the process I still don't quite understand why an hour-long presentation is required for an Academic Advisor position. Though the job requires excellent communication and speaking skills, the presentation aspect of the interview does not necessarily contribute to a candidate's effectiveness.", "Interview Questions": "What do you know about the partnerships between campus and the community?"}, {"date": "24 May 2017", "title": "Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. The process took 2+ months. I interviewed at Kent State in May 2017", "Interview Descriptions": "The initial contact was the end of March, and invite to campus extended end of April.  I arrived on campus for interview that lasted majority of day and was asked prior for a presentation during onsite.\n\nThe hiring department did not have many show for the presentation.  The search committee did not have any prepared interview questions or topics for discussion for the next two hours.  Feeling the aquardeness, I started asking questions to find out more from the committee.  They seemed irritated and like they did not want to be present.  \n\nHaving been part of interview processes felt this process was very odd and that they knew who they wanted before I arrived.", "Interview Questions": "what was the most challenging project?"}, {"date": "11 May 2017", "title": "Assistant Professor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Kent State (Kent, OH) in Apr 2017", "Interview Descriptions": "Lengthy day long interview with committee members,  Dean,  and chair.  Waited FOUR weeks for some kind of follow up and response and decision.  First part was a telephone/skype interview.", "Interview Questions": "How would you change the curriculum? "}, {"date": "24 Jan 2019", "title": "Flashguide Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Kent State in Mar 2017", "Interview Descriptions": "It was pretty easy! They just wanted to get to know me as a person. There were a couple people in the room (about 4–5). They made me feel very comfortable and told me not to be nervous and it really helped! Just be yourself!", "Interview Questions": "If you could take a vacation anywhere in their world where would you go?"}, {"date": "13 Sept 2021", "title": "Supplemental Instruction Leader Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Kent State (Kent, OH) in Mar 2017", "Interview Descriptions": "I was interviewed by both the hiring manager and current SI leaders. The hiring manager left the room for the second part of the interview so I could discuss the job with just the current leaders.", "Interview Questions": "It was somewhat light heartedly asked, but I was asked how I would go about figuring out how many tennis balls could fit in a bus. The point being I believe, to see how I translated obscure topics. "}, {"date": "22 Apr 2018", "title": "Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Kent State (Kent, OH) in Feb 2017", "Interview Descriptions": "I applied for multiple positions in the office (they are tiered positions) and was called in for the entry-level position despite my number of years of relevant experience. However, I figured it was a foot in the door and hoped I could move up the rung. \r\n\r\nThe interview was very professional and the job description sounded like a reasonable work load at the time. \r\n\r\nI was given a tour of the space I'd be working in and was asked several questions. There was no presentation requirement but I know for the positions above the entry level, there was as I interviewed for that position at a later date. \r\n\r\nThe process was fairly quick as this was a new office being implemented and they had deadlines to meet and needed the staff in place by a specific date (I assume).", "Interview Questions": "Please explain a situation in which you had difficulty with a co-worker and how you resolved it?"}, {"date": "12 Oct 2016", "title": "Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at Kent State (New York, NY)", "Interview Descriptions": "Panel interviews and took about 8 weeks.  Phone screening and then panel interview. Came back for second interview with Dean and Direct manager.  Resume and application screened first for experience and education requirements.", "Interview Questions": "The last book I read,  What I knew about the campus / university , why I wanted to work here"}, {"date": "25 Aug 2017", "title": "Marketing Assistant Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Kent State (Kent, OH) in Aug 2016", "Interview Descriptions": "There wasn't an interview process for me, I was a transfer of jobs. I did have to jump through hoops to accept the job through Human Resources, but I never did an official job interview.", "Interview Questions": "There wasn't a question that I was asked."}], [{"date": "28 May 2016", "title": "Business Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Kent State (Kent, OH)", "Interview Descriptions": "Team interview with three different executive directors and one VP.  All three executive directors participated in the first half of the interview, but the second half included only the hiring executive and the department VP.", "Interview Questions": "What I knew about the VP's past reputation."}, {"date": "20 May 2016", "title": "Academic Program Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Kent State", "Interview Descriptions": "Called in and interviewed with panel, there was a team and overall it was a basic interview experience. They gave me a tour of the building and the entire interview was about 1 hour.", "Interview Questions": "What experience do you have with customer complaints?"}, {"date": "12 Apr 2017", "title": "Secretary Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2+ months. I interviewed at Kent State in May 2016", "Interview Descriptions": "Panel of 3 interviewers. It took about a month and a half to get an interview after applying and taking civil service test. There was trouble with the first test, so it was rescheduled. Only inconvenience was it was rescheduled at the main campus, which is over an hour away. Did get asked some questions that didn't seem necessary for the interview.", "Interview Questions": "Why are you qualified for this position?"}, {"date": "8 Feb 2020", "title": "Facilities Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Kent State in Mar 2016", "Interview Descriptions": "Defined and thorough, met with Manager then HR.  Second interview with department head then a follow up phone conversation.  Sent an offer email with a  start date.  Showed up for first day then went to HR for orientation and processing.", "Interview Questions": "Why do you want to work here?"}, {"date": "8 Dec 2015", "title": "Clerical Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Kent State", "Interview Descriptions": "This was the most enjoyable interviews I have ever had! Very personable, but professional and straight to the point. The HR department is excellent and very organized! When I left the interview I was very confident that I was a good fit!", "Interview Questions": "How do I handle difficult people?"}, {"date": "9 Apr 2019", "title": "Campus Tour Guide Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Kent State (Kent, OH) in Dec 2015", "Interview Descriptions": "Interview with hiring manager along with other tour guides. Comfortable environment. All interviewers asked questions given off a piece of paper taking turns.  They were dressed in business casual clothing.", "Interview Questions": "What would you change about Kent State if you were President for a day?"}, {"date": "18 Nov 2016", "title": "Financial Aid Counselor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Kent State (Kent, OH) in Nov 2015", "Interview Descriptions": "There were two rounds of interviews. In the first I was asked to provide a brief presentation about financial aid as though I were visiting a high school night with prospective students and parents. The second round interview was with the Director and a few others. \r\n\r\nThe entire process took entirely too long considering that I was applying for a position as a current student employee. The position itself was 'up in the air' at a few times during the process. It was as if the Director was not wiling to promote me to the position I had actually applied for. At one point, I was asked to re-apply to the job through the HR website because the conditions of the position had changed. I did so and had to wait for the bureaucracy of that process. And then I was called in by the Director in a separate meeting and told that there was now two positions available and the office was unsure of who would get them because there was now this new candidate that was very qualified! \r\n\r\nI did eventually get the offer but the whole process seemed unethical, unprofessional and incredibly uncomfortable.", "Interview Questions": "What makes you the most qualified for this position over the others?"}, {"date": "6 Apr 2018", "title": "Student Applications Developer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Kent State (Kent, OH) in Nov 2015", "Interview Descriptions": "Interview process was very quick and painless. Received a take-home coding quiz within days of the initial application, and then a followup for an in-person interview within the next week.", "Interview Questions": "Explain the agile development process."}, {"date": "25 Sept 2015", "title": "Director of Communications Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Kent State (Kent, OH)", "Interview Descriptions": "Very cumbersome interview process. Though from asking around, it seems fairly typical of university job searches. Having never applied for a job with a university before, I was shocked to learn when they agreed to interview me that I should plan to be on campus for FOUR HOURS! I met with four groups of people, for 45 minutes each, then with the hiring manager for another hour! When you factor in travel to and from the interview, it pretty much took my entire day!\r\n\r\nYou'd have thought they were interviewing me for some upper-management position, and not the mid-level management opening I was applying for, but I guess that's how they do it.", "Interview Questions": "Why are you interested in this position?"}, {"date": "14 Jul 2015", "title": "Multimedia Designer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at Kent State (Kent, OH)", "Interview Descriptions": "First was receiving a phone call by the specified office applied for. They would try and schedule a time that fits the person needs, for a physical interview at their office.", "Interview Questions": "If someone doesn&#039;t give you enough information or information that&#039;s is useless to a project, what do you do?"}], [{"date": "20 May 2015", "title": "Computer Lab Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 3 days. I interviewed at Kent State", "Interview Descriptions": "Only one interview was held. I spoke with the direct supervisor about my major and experience. I was told I would find out soon if I was hired. I received an email several days later confirming my hiring.", "Interview Questions": "What is your experience with computers?"}, {"date": "30 Jul 2015", "title": "Tenure Track Faculty (Biology) Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Kent State (Warren, OH) in May 2015", "Interview Descriptions": "After submitting application materials on their HR website, you wait. And wait. And wait. The phone interview came about two months after the application deadline, and then a campus invite two weeks after that. Two months after my on-campus interview (full day of meetings with deans, associate deans, search committee, teaching and research talks, and dinner with the committee), and there still has been no decision. I've contacted the search committee chair (who has been exceptionally understanding, patient, and apologetic) and the administration continues to hold up any movement on the position. I understand that there are lots of applicants and hearing nothing is fairly common, but when you're one of the two or three people invited to campus and spend a full day (plus travel) on a potential job, a little common courtesy from the administration would be appreciated.", "Interview Questions": "Please explain your pedagogical theory and how that impacts your teaching style in a lab classroom."}, {"date": "20 May 2019", "title": "Assistant Professor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Kent State (Canton, OH) in May 2015", "Interview Descriptions": "Phone interview first. If in the top 3 you are invited for a personal interview and a practice teach. The students and faculty have an open forum to evaluate. Once the choice is made a final offer comes over the phone", "Interview Questions": "What is your experience?"}, {"date": "29 Apr 2019", "title": "Graduate Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 days. I interviewed at Kent State (Kent, OH) in Mar 2015", "Interview Descriptions": "For the biology department. Interview process was a two day process, started with an evening gathering at one of the professors house. Next day involved presentations, group meeting with current students, interviews with faculty members as well as tour of the facility. It was followed by showcase of current research in the institution. The day ended with small group dinners with graduate students and interviewees", "Interview Questions": "General questions on scientific interest, coursework, future goals"}, {"date": "16 Apr 2018", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 3 weeks. I interviewed at Kent State (Salem, OH) in Jan 2015", "Interview Descriptions": "Very kind and interested in what you like as a person. They sit down with you and talk with you one on one. This is very unlike most large businesses. They want to know you on a personal level and make the working experience better for you.", "Interview Questions": "Why do you want to work at the library?"}, {"date": "23 Nov 2014", "title": "Flashguide Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Kent State", "Interview Descriptions": "Go through a training workshop then proceed to go into interviewing for the position. This interview was between myself and three other people. They asked many questions about dealing with parents and incoming students and well as knowledge about the campus.", "Interview Questions": "What would you do about a person being inconsiderate while you were talking?"}, {"date": "24 Aug 2015", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Kent State in Mar 2014", "Interview Descriptions": "simple and very straight forward. It was an internal transfer so I didn't have to go through the routine hiring process. I interviewed straight with the department director who asked very basic questions and was very co-operative. I got the decision the same day which was appreciated.", "Interview Questions": "Why we should choose you for this position?"}, {"date": "9 Nov 2018", "title": "Assistant Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. The process took 3 months. I interviewed at Kent State in Mar 2014", "Interview Descriptions": "Very complete, first per telephone, next personal onsite,  five person committee, classroom presentation before persons from faculty, administration, and students.  One on one discussions with individual faculty members, two deans, and the departmental chair. members", "Interview Questions": "How do you balance between teaching and research?"}, {"date": "26 Jun 2016", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 months. I interviewed at Kent State (Kent, OH) in Jan 2014", "Interview Descriptions": "There is no interview process for being a graduate assistant. You must send them a statement of purpose and let that do the talking for you. If you give the head of the program a call, I don't think that she cares. Write a great letter, make sure that you have some good letters of recommendation, and make sure to send it in before the deadline. Finding a place to take the GRE can be hard, but study for it, and you'll do wonderfully.", "Interview Questions": "Why would you be a good candidate for this position?"}, {"date": "21 May 2016", "title": "Academic Advisor Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Kent State (Kent, OH) in Oct 2013", "Interview Descriptions": "30 minute phone interview with Director and then on-campus interview was 1 hour with a very brief presentation with a panel of people. It was overall one of the best interviews I've ever had. It was a conversation not an interrogation.", "Interview Questions": "what is my advising approach? How do you handle working with a large load of students without burnout? What is the value of academic advising? What are some habits of successful students? "}], [{"date": "2 Aug 2013", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Kent State (Kent, OH)", "Interview Descriptions": "Very as expected interview.  Nice people", "Interview Questions": "N/A"}, {"date": "29 Mar 2017", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Kent State (Cleveland, OH) in Jan 2013", "Interview Descriptions": "Panel interviews and took about 8 weeks. Phone screening and then panel interview. Came back for second interview with Dean and Direct manager. Resume and application screened first for experience and education requirements.", "Interview Questions": "N/A"}, {"date": "26 Jan 2014", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1+ week. I interviewed at Kent State (Kent, OH) in Aug 2012", "Interview Descriptions": "The hiring and interview process for becoming a teaching assistant is very intimate. In most cases it helps to know the professor beforehand by being a dedicated student in a course that he or she taught. This has been my experience, of course the skills, resume, and grades need to be there.", "Interview Questions": "How would you teach the class today?"}, {"date": "15 Jan 2016", "title": "Applications Support Analyst Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Kent State in Jun 2012", "Interview Descriptions": "Surprised upon arrival by a group panel interview of 10-12 people including everyone from the unit I would be working with.  I wish I had known ahead of time that this would be the case because I would have prepared differently. In the end, I was offered and accepted the job but it threw me off walking in to that situation without knowing the format ahead of time.", "Interview Questions": "How do you treat your coworkers?"}, {"date": "30 Jul 2013", "title": "Lecturer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Kent State (Kent, OH) in May 2012", "Interview Descriptions": "After phone interview on a Sunday night, drove 2.5 hours to interview two additional times. First interview was with the hiring committee - 8 people.  Second and third times were with the Dean.  Received actual offer via email followed by contract.  There were many, many days between each step with no updates and offer actually came via email.", "Interview Questions": "Tell us about your experience raising funds for a not-for-profit or other similar organization."}, {"date": "16 Mar 2014", "title": "Academic Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Kent State in Sept 2011", "Interview Descriptions": "Depending on the people involved in the hiring process and the urgency of which they need the position filled, you can expect anywhere between 1 month to 3,4 month to wait before you hear anything. In my case, I waited about 3 month after the interview to hear my offer.\r\n\r\nIt started with phone interviews. I was given several time slots and I selected the earliest one. Make sure you be confident and energized. They can hear your smile and feel your enthusiasm. After I got the job, someone remarked it to me that I was the only phone interview candidate that day who seemed genuinely excited to pick up the phone to speak to them. \r\n\r\nInterview will take half a day. You will be taken on a tour of the building first, meet some important people, then head off to the first interview which will be with the general staff you will be working with. You may be asked to do a presentation. Be prepared. DO YOUR RESEARCH ON THE COMPANY. You never know if and when someone might ask you to tell them about the company, so take the time to study the website. After presentation, you will be asked questions about your presentation, and then be asked a list of interview questions they have prepared (including behavioral ones). Everyone was friendly and encouraging. \r\n\r\nThen you will be taken to see whoever is the highest authority of your job area (assistant dean, associate, dean, etc, depending on the level of the position). It will be a relaxed one to one conversation. But make sure to reinforce your strength. Slip a few positive comments in.\r\n\r\nFinally you will meet with a smaller group of the initial staff, who are on the search committee, plus one or two professors or employee of other functions who is serving on the committee. This is where you will be asked more of these dreadful behavior questions. Be sure to relax and be confident since this is a smaller group and you are closer, being those things will really make a difference. \r\n\r\nAfter that it was done. I waited about 3 month before hearing the offer.", "Interview Questions": "What you know about Kent State University. "}, {"date": "30 Sept 2015", "title": "Event Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Kent State (Kent, OH) in Sept 2011", "Interview Descriptions": "I met for a one-on-one interview with the Director of Entrepreneurship. We talked for a bit to get to know each other better. There is one question I particularly dislike during interview questions and that is... \"tell me a little bit about yourself.\" This was one of the first interviews I had ever had, so if you're in the same boat, be sure to know the answer to that. I just rambled a few things off the top of my head but I wasn't very self aware at that point in my life. I realize more now that employers really want to get a sense of who you are aside from what your hobbies are. Or more so, that what your hobbies are say a lot about who you are as a person.", "Interview Questions": "Are you organized? Have you ever planned events before? Why are you qualified for this position? What interests you in entrepreneurship?"}, {"date": "10 Sept 2015", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 days. I interviewed at Kent State (Kent, OH) in Aug 2011", "Interview Descriptions": "I went in for the interview and was called back the same day. I emailed my resume and cover letter directly to the supervisor of my position and he set up the interview. The interview was somewhat formal but not overly so. He asked the regular questions that any other employer asked and discussed the job duties. This was the same in the other office that I GA'd in.", "Interview Questions": "Why should we choose you for this position?"}, {"date": "21 Jun 2015", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Kent State (Kent, OH) in Jun 2011", "Interview Descriptions": "the interview was very easy and simple. it only took a few minutes to complete. He was nice person and try to help me to understand what I have to do for this job. the point is you have to work hard on it and be on time at work.", "Interview Questions": "do you have experience for customer services? you think you will do good on this work?"}, {"date": "31 Oct 2015", "title": "Academic Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 5 weeks. I interviewed at Kent State (Kent, OH) in Jun 2011", "Interview Descriptions": "Phone interview--> Presentation on student success. What is student success and how is advising an critical part of it? There was a phone interview about 30 minutes and then a 2.5 hr interview and presentation to a group of advisors a few weeks later.", "Interview Questions": "What does student success and advising mean to you?"}], [{"date": "14 Mar 2011", "title": "IT User Support Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Kent State (Kent, OH) in Sept 2010", "Interview Descriptions": "A phone interview with 6 people (lasted about 20 to 30 minutes). A wait of about 3 to 4 weeks. A group/panel interview with the same 6 people (lasted about 1 hour). About a 3 week wait. A group/panel interview with 3 people (about 1 hour), then a break, then met with 3 people 1-to-1 over about 2 hours, one of those meeting was mostly a tour of the facility. The other 2 were more traditional - in an office being asked questions and being given detailed information about the job. At this point I was 1 of 3 remaining candidates. A further wait of about 2 weeks before being offered the job over the phone.", "Interview Questions": "N/A"}, {"date": "6 May 2010", "title": "Dean Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 1 day. I interviewed at Kent State (Fayetteville, NC) in Mar 2010", "Interview Descriptions": "Email contact was vague to say the least.  When I asked what the next step was, I received a email that said only ......set up plane ticket......\r\n\r\nThe campus is beautiful and appears to be well run.  The President was pleasant and to the point.  The Vice President of Academic Affairs, which is the position that I most recently held, inquired about everything that I had done.", "Interview Questions": "From what you have seen today, what do you think your challenge in the position will be."}, {"date": "21 Jun 2011", "title": "Writing Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Kent State (Kent, OH) in Jan 2009", "Interview Descriptions": "I began by applying to an internship course through Kent State University. I was interviewed by a professor who specialized in professional writing and then I was placed into the internship after taking an intelligence test, submitting my past work experience, and my intended specialization. It was quite easy and detached from managers at the internship.", "Interview Questions": "Did you have any experience in a publishing environment?"}]]