[[{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Proud to work for wonderful community", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "20 Jan 2023", "job_title": "Human Resources Coordinator in Naples, FL", "duration": "N/A", "pros": "DLC offers many benefits and employee engagement activities. Constantly trying to engage its employees by having events, food trucks, gift cards, gift baskets, etc. apart from all the goodies, to say that they are understanding is an understatement. They are not only understanding by also sympathetic to their employees’s life situations. They help out the community by takjng great care of their internal community (employees). Proud and glad to say that I work for DLC.", "cons": "None, I cant think of one thing."}, {"Recommended": "Yes", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": 3, "Career Opportunities": 4, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "David Lawrence Centers", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "5 May 2023", "job_title": "Therapist in Naples, FL", "duration": "N/A", "pros": "Beautiful area to live and work.", "cons": "Low pay for an expensive area."}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 0, "Culture & Values": 0, "Diversity and Inclusion": 0, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "It is What you make of it", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "2 Apr 2023", "job_title": "Registered Nurse in Naples, FL", "duration": "N/A", "pros": "Remote during early COVID 19", "cons": "Expensive benefit, a lot changes not well communicated, high turnover"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 0, "Culture & Values": 3, "Diversity and Inclusion": 3, "Career Opportunities": 4, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "Learned a lot", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "31 Jan 2023", "job_title": "Clinician 1 in Naples, FL", "duration": "N/A", "pros": "Gave a lot of experience and helped me grow as a person.", "cons": "Pay is terrible and employees don’t get listened to."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 5, "review_title": "Great company with great people", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "15 Jun 2021", "job_title": "Director IT in Naples, FL", "duration": "N/A", "pros": "Very supportive environment. I enjoyed working with so many people who are passionate about what they do and support efforts to continue to provide excellent care to so many people who need help.", "cons": "The pay is low, but this is common in all of Florida, except for Miami."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Discharge Planning Clinician", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "5 Oct 2021", "job_title": "Social Worker/Discharge Planner in Fort Myers, FL", "duration": "N/A", "pros": "Good work environment and supervisory staff.", "cons": "On call and weekend hours are required"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Salary", "rating": "2.0", "reviewer_affiliation": "Former Employee", "job_date": "15 Jun 2021", "job_title": "Clinical Staff in Naples, FL", "duration": "N/A", "pros": "Loved the people I worked with.", "cons": "Low pay, difficult atmosphere and not enough staff."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 1, "Senior Management": 0, "review_title": "Work? Great! Compensation? Not so much!", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "17 Oct 2015", "job_title": "Anonymous Employee in Naples, FL", "duration": "N/A", "pros": "The David Lawrence Center is a community behavioral health center in Naples, FL providing substance abuse and mental health services. It meets a critical community need in providing such services not only for the well-insured, but especially for those who have very little resources. The breadth of its programs is admirable, serving the needs of adults, children, and families. Were it not for DLC, countless thousands of SW FL residents would go without the necessary behavioral health services they need in order to productive citizens of their communities.", "cons": "For all its many excellent aspects, including its staff -- both professional and support -- who provide quality care for people in need, DLC as an agency struggles from significant low staff morale. Compensation levels for Masters's level and licensed providers is significantly below market rate, and even more significantly below national averages. For a community with such wealth -- Naples has more than its share of millionaires and billionaires! -- DLC should be able to compensate staff more adequately. In the several years I've been employed there, there has been a significant turnover in staff, and I know that low compensation is a major factor in this."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Good Job", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "2 Dec 2020", "job_title": "Registered Psychiatric Nurse in Naples, FL", "duration": "N/A", "pros": "decent benefits and co workers", "cons": "management and to much employee turnover"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Recovery Oreinted Systems of Care", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "15 Jun 2020", "job_title": "Peer Support Specialist in Naples, FL", "duration": "N/A", "pros": "David Lawrence Center's care and commitment to helping not only its community, but also, the world as a whole in changing and helping those who sufferer from substance abuse disorder in indeed miraculous. Recovery is expected with the work that DLC is implementing to the people they serve. As an employee for over a year now at this facility and as someone who has over 5 years of long term recovery, it is, because of the work I've learned and been able to implement at DLC. My personal recovery has grown and prospered with the education, training, and helpful guidance from my supervisorial staff and their dedication and relations with other organizations to help recovery become possible for so many.", "cons": "No present downsides or barriers to work at DLC. Our only issue is getting other agency's and organizations to follow the ROSC movement we have joined and follow our DLC charter and mission."}], [{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 5, "review_title": "Excellent Team Environment", "rating": "4.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "1 Mar 2018", "job_title": "Anonymous Employee in Naples, FL", "duration": "N/A", "pros": "Every single employee at DLC is dedicated and are very much appreciated.  Employees are encouraged to speak out and submit suggestions for improvement.  These are taken very serious and are acted on if possible.  The benefits are better than most, i.e. generous vacation time, holiday pay, and inexpensive lunches made on campus.  Employees are held to high standards and this makes for a very professional atmosphere.  DLC management cares about their employees and clients.", "cons": "The pay is very low compared to national averages and the high cost of living in Naples.  Most staff are barely getting by due to the high cost of housing and rent."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "An Amazing Place to Work", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "28 Nov 2019", "job_title": "Certified Recovery Peer Specialist in Naples, FL", "duration": "N/A", "pros": "David Lawrence Center is focused on providing hope to the community. DLC is always looking to enhance the services the services they offer and proactively engages all employees in becoming part of that mission. It’s an amazing work environment because of the passion and dedication of the people who quickly become like family. The gratitude of those who are blesses to work at DLC is seen and felt on a daily basis. DLC values and appreciates and it’s work force and the Golden Gate campus is a beautiful environment to work in, Everyday working at DLC reminds you that there is always hope and that each of us plays a part in being part of the solution.", "cons": "In my personal experience over the past year I have not found any cons."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Lots of potential but no follow through", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "28 Jan 2015", "job_title": "Adult Case Manager in Naples, FL", "duration": "N/A", "pros": "I loved helping people and when I had time to take care of the clients it was great. There is a lot of room for growth within the company. They have great vacation and time off (up to 6 weeks a year plus two week of paid vacation yearly).", "cons": "Leadership is inconsistent and radical. Changes are quickly made without regard for employees and clients- when things don't work out (as they often did) everything is changed again. Productivity is unreasonable, pay is inadequate for cost of living."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 0, "review_title": "Good place to get the foot in the door and then move on", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "24 Dec 2017", "job_title": "Case Manager in Naples, FL", "duration": "N/A", "pros": "Helping others.\nGreat vacation time.\n401k 100% matched.\nYou will learn everything you need to here to learn what you want out of future employment.\nExcellent insurance but costs.\nTrainings.\nBeautiful facility that constantly puts its revenue back into it to stay at not for profit.\nPaperless facility which is really awesome for the planet but it’s big brotherish for the employee.", "cons": "Pay is below poverty for the cost of living in the area.\nManagement is money hungry.\nTo meet productivity you compromise the clients and don’t have time to give them what you are expected to. \nYou will be overworked to the max but learn a lot"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Excellent place to work and grow!", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "3 Dec 2015", "job_title": "Anonymous Employee in Naples, FL", "duration": "N/A", "pros": "--DLC has assisted me in developing as a professional. I have been promoted through multiple progressive position levels at DLC over many years and they have supported me each step of the way.\r\n--Terrific benefits: generous holiday/paid time off patching, 401K matching, etc.\r\n--Great team atmosphere with passionate coworkers who are engaging in meaningful work.\r\n--This agency provides essential services to our community. It is highly rewarding to be a part of an organization creating powerful change!", "cons": "--Very fast-paced environment with frequent changes to workflows in order to remain in compliance with contracts, etc., which can provide a challenge, but the team atmosphere and support makes this manageable."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Excellent Team!!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "2 Mar 2018", "job_title": "Director of Acute Care in Naples, FL", "duration": "N/A", "pros": "I have been working at David Lawrence for a year now. I have an amazing team of workers that are committed to the clients and are always willing to help. Management  team listens to employee suggestions on a regular basis  and implement new ideas as much as possible", "cons": "The salaries for the Behavioral Health Technicians are low and could be improved. Most of them have 2 jobs or live far away because they cannot afford the cost of living in Naples"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Best Organization I've Worked For Yet", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "5 Mar 2018", "job_title": "Director of Duties As Assigned in Naples, FL", "duration": "N/A", "pros": "Two key things, among many, for the pros: firstly, the Center provides a critical service to Collier County residents. David Lawrence Center is a non-profit, mental health and substance abuse treatment center that serves Collier County. We serve everyone in the community, from the insured and well to do, to those that have literally no where else to go. The entire County benefits from the work we do, not just the clients we see, and it is very satisfying to work for an organization that makes such a positive impact in the community. Yes, because we are a non-profit, we have to run lean. We depend on state, federal, and local grants, in addition to private donations to fund our operations, and those sources (particularly government sources) impose requirements that make work here a little more difficult than at our for-profit counterparts. We have to do more with less, and we owe it to the taxpayers and donors to serve our community as efficiently and effectively as possible, which is no easy task. But the people here, the ones that are in it for the long haul, really care about their clients and the community. \r\n\r\nWhich brings me to my second pro: the leadership. From the top down, the culture of DLC is one of compassion and empathy for our clients and staff. I have personally witnessed board and exec team members going to bat for our clients and staff, like fighting to preserve benefits when it comes to budgeting, or going the extra mile to secure funding for a critical community need. None of the executives or directors are working cushy bankers' hours. They are committed and work extremely hard to fulfill the mission of the organization. If you care and are committed to serving the community, the leadership here will fully support you.\r\n\r\nThere are many other pros, but the two I mentioned are the ones that stick out most to me, especially when considered against my previous experiences in the for-profit world.", "cons": "As mentioned above, we do have to do more with less. Because of our funding sources, sometimes it means extra reporting, or more rigorous productivity requirements. But it is doable, and all the necessary tools to get the job done are provided, including training, supplies, staff support, etc. We all have to work hard, and if you're looking for a job where you can browse social media or watch YouTube videos to kill the time, this is definitely not the place for you. If you're looking for a place to grow both personally and professionally, this is the place."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 0, "review_title": "Great place to work", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "25 Jun 2015", "job_title": "Anonymous Employee in Naples, FL", "duration": "N/A", "pros": "Great Benefits and great support for employees. I love my coworkers because of the support I receive from them. Being able to help people is amazing.", "cons": "It can be overwhelmed sometimes. I can not really think of many cons from this job or maybe it's because of my position so I can not tell that everyone shares my point of view on that."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Clinician/Supervisor", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "1 Mar 2018", "job_title": "Clinician in Naples, FL", "duration": "N/A", "pros": "David Lawrence Center is incredibly supportive of staff growth and development. There are many opportunities to advance within the organization and achievement is recognized. David Lawrence Center values people as its greatest asset and there is a spirit of teamwork campus wide among the different programs. For those with the vocation to work in the mental health and substance abuse field, this organization is also very client centered and truly strives to provide exceptional, compassionate care to clients.", "cons": "Not really a con, but you must be able to work in a fast paced environment."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Employee oriented; mission driven", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 8 years", "job_date": "6 Feb 2019", "job_title": "Chief Financial Officer in Naples, FL", "duration": "N/A", "pros": "Leadership values their employees, fights hard to provide strong fringe benefits. The opinions of all employees are taken into consideration. Passionate staff, that work hard and support each other.", "cons": "Due to the nature of the industry, there can be some challenging clients. Patience is required."}], [{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great environment", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "31 Dec 2015", "job_title": "Anonymous Employee in Naples, FL", "duration": "N/A", "pros": "Great mission, dedicated management team looking to improve the organization, helpful services to the community, and they have hired some excellent talent recently. The employees care about the work that they do and are very helpful.  They have excellent benefits and time off policies.", "cons": "None so far that I have encountered."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "Past Employee", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 10 years", "job_date": "9 Mar 2016", "job_title": " in Bonita Springs, FL", "duration": "N/A", "pros": "Great Mission\r\nEffective highly skilled Senior Management\r\nExcellent Benefits\r\nAble to see the effects of your effort through positive customer outcomes\r\nLongevity of key staff", "cons": "Employees are required to do many tasks related to compliance which can sometimes be overwhelming"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Great Place To Work", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "25 Jan 2018", "job_title": "Office Coordinator in Naples, FL", "duration": "N/A", "pros": "The paid time off here is great.  I feel very supported and appreciated by my coworkers and supervisors. And I usually feel that my opinions and suggestions count.", "cons": "The pay is a little on the low side still, but has improved since I started here."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 0, "Senior Management": 3, "review_title": "Clinician II", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "19 Oct 2015", "job_title": "Military Family Life Counselor in Camp Lejeune, NC", "duration": "N/A", "pros": "I worked in the adult substance abuse rehabilitation unit.  The work there was rewarding.  The longevity of the team members as well as their professionalism made it a great place to work.", "cons": "The documentation was cumbersome and at times overwhelming."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Amazing place to work, great, passionate staff!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "9 Aug 2018", "job_title": "Supervisor in Naples, FL", "duration": "N/A", "pros": "Wonderful benefits, Great People, good hours.", "cons": "Always trying to save money and raise funds so that we can continue helping our clients."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "lpn", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "29 Sept 2014", "job_title": "Licensed Practical Nurse in Naples, FL", "duration": "N/A", "pros": "co workers are pleasant and it's for a good cause.", "cons": "poor upper management and they do not appreciate their employees"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "Great place to work", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "3 Sept 2020", "job_title": "Program Support Specialist III in Immokalee, FL", "duration": "N/A", "pros": "Pay was good.\r\nVacation days were better and so were the benefits.", "cons": "Can’t think of one. I enjoyed my time there."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "Good place to work but.....", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "17 Oct 2016", "job_title": "Licensed Practical Nurse in Naples, FL", "duration": "N/A", "pros": "Good work environment with minimal supervision.", "cons": "Low pay, no room for growth"}]]