[[{"date": "27 May 2021", "title": "New Grad StaRN Program Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at HCA Houston Healthcare North Cypress (Pearland, TX) in May 2020", "Interview Descriptions": "The interview process was conducted in groups of four interviewees and four interviewers. Each person got to interview with just one individual and at the end of the interview, an offer would typically be made.", "Interview Questions": "What is your most memorable patient experience. "}, {"date": "16 Mar 2019", "title": "Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 3 weeks. I interviewed at HCA Houston Healthcare North Cypress", "Interview Descriptions": "The hiring and interview process was extremely informal yet professional.  The department manager nurses were very nice and accommodating.  They made me very comfortable throughout the entire interview process.", "Interview Questions": "how well do you get along with others"}, {"date": "16 Apr 2017", "title": "Insurance Verification Specialist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at HCA Houston Healthcare North Cypress (Cypress, TX)", "Interview Descriptions": "I sat with the director and a supervisor to discuss the job and my previous experience. The director stated the duties of the job and made me an offer on the spot! :) They both were really nice and i look forward to working with them. The pay was not great, but a start with a medical center could mean endless  opportunities.", "Interview Questions": "Did you verify any radiology procedures at your last job?"}, {"date": "23 Oct 2017", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at HCA Houston Healthcare North Cypress in Mar 2017", "Interview Descriptions": "Resume submitted in 6 months before I was contacted.  Interview consisted of two parts, a group of the department employees and then an interview with the Director.  Nice facility.  Interview moved quickly.  Took a few weeks to receive an offer.", "Interview Questions": "About my experience and management style."}, {"date": "24 Sept 2015", "title": "Human Resources Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at HCA Houston Healthcare North Cypress (Houston, TX) in Sept 2015", "Interview Descriptions": "Responded the same day I applied, set up interview quickly.\r\nI thought the interview went well.  However, I never heard from them again.  Attempted to call and email and I never heard a thing!  I lost respect for them.  If I wasn't qualified, they could have at least responded in SOME fashion. As an HR professional, I would have expected a response from the HR department.", "Interview Questions": "Asked about prior experience"}, {"date": "1 Dec 2018", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at HCA Houston Healthcare North Cypress (Houston, TX) in Jun 2015", "Interview Descriptions": "submission of resume, follow up calls to HR and department manager, received call for interview, interviewed including tour of department and exceptions, hired same day prior to leaving facility, they asked both professional and personal questions with stress on how i deal with being overwhelmed and being stressed.", "Interview Questions": "why would i be a good fit for their needs"}, {"date": "4 Jan 2016", "title": "Registration Specialist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at HCA Houston Healthcare North Cypress (Houston, TX) in May 2015", "Interview Descriptions": "I applied online and two weeks later I received a phone call to set up an interview. The interview was really casual. The panel consisted of a two supervisors and the Director of the department. We sat and talked about my personal goals and why I would be a great asset to the company.", "Interview Questions": "Where do you see yourself in five years?"}, {"date": "16 Feb 2016", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at HCA Houston Healthcare North Cypress (Cypress, TX) in Jun 2014", "Interview Descriptions": "Sit with the department heads and talk. Then they each pitched their department and you choose. They then make an offer. After acceptance, took a tour. Introduced to staff and shown various aspects and advantages. After that, take the pee test, take the EKG, Drug calculations, Code Response test and go home. Very easy and very friendly way to do it. At least for me.", "Interview Questions": "Why choose us."}, {"date": "27 May 2015", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 5 days. I interviewed at HCA Houston Healthcare North Cypress (Cypress, TX) in Dec 2013", "Interview Descriptions": "Focused on patient care standards and previous situation strategy questions. This is a typical RN type interview and the interviewer was pleasant and interested in my experience as an RN. I felt that the interview process was quick and not dragged out as much as other hospitals may sometimes be. For example, I had previously applied to Texas Children's Hospital online and was not called for an interview until 6 months later. By that time I was no longer even interested in the position as I had moved on.", "Interview Questions": "How long have you been working in patient care as a nurse?"}, {"date": "6 May 2013", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. The process took 4 months. I interviewed at HCA Houston Healthcare North Cypress (Cypress, TX) in Dec 2010", "Interview Descriptions": "I initially came to North Cypress via a temp agency but was asked to stay on. However, I did have to go through the interview process for a permanent position. The interview process was not hard at all for me, as I was already aware of how the organization was ran. I was also familiar with the culture as well. Overall, the interviewing process is not hard at all. Basic interview questions are asked, depending on who is interviewing. HR does not interview but the director, who runs the department for which you are applying. Therefore, technically, there is no formal interview process. It is dependent upon the director's style. Usually, most people who are hired can get on fairly quickly.", "Interview Questions": "N/A"}]]