[[{"date": "25 Jan 2018", "title": "Staff Pastor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 3 weeks. I interviewed at Calvary Church (Houston, TX) in Mar 2014", "Interview Descriptions": "Note: U still currently need a job. I am recovering from my home being destroyed by Hurricane Harvey and have still been  dealing with finding necessities in many hurriedly packed boxes.This experience I shared took plzce before 2016. Obviously it was not recent because I have not had a recent interview.  I am reviewing this in preparation as I get acquainted with Glassdoor and research the current methods and procedures of this current season. I came to the office of the Senior Pastor. We interacted and talked in detail about the vision, plans and operation of the church. I did have opportunity to ask questions. A date in the near future was set for me to preach/teach the Wednesday evening service mid-week service. In a subsequent interview after that Wednesday night service, we once again had additional discussion and interaction time in person and then on the phone.  The interviewing pastor had talked with my previous employer and questioned me about the personal and professional details they had discussed about me. I had opportunity to ask questions and share my insights. Shortly after that date, the Senior Pastor took my information, application documents and a review of my discussions with him before the full Church Board of Directors. He then related questions they wanted me to answer. The time it took and the details they knew about me made me feel very vulnerable, but the process resulted in me being offer a pastoral staff position which eventually opened the opportunity for me to lead a church planting team to start a new church in the Republic of Ireland where I lived and worked for two years.", "Interview Questions": "I was surprised by being asked for personal information about my husband who had passed away a few years before."}], []]