[[{"date": "21 Jun 2023", "title": "Physician Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Deaconess", "Interview Descriptions": "Good experience reviewing the contract. Seemed like a great place to work. Wish more people would have attended the dinner. Was difficult to get a feel for group as didn’t meet many of the group members", "Interview Questions": "No specific questions were asked"}, {"date": "4 Jun 2023", "title": "PCT Patient Care Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Deaconess", "Interview Descriptions": "They called me immediately and a few days later I was given a call back about getting a job. The interview was simple and not too intimidating. I'd work there again", "Interview Questions": "What is your work ethic"}, {"date": "30 Jan 2023", "title": "Biomedical Equipment Technician Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Deaconess (Evansville, IN) in Aug 2022", "Interview Descriptions": "It was laid back and they were impressed with the questions I asked them. They didn't know what the base salary was for the position though. Sadly the day they were going to make me an offer they put a hiring freeze on most positions", "Interview Questions": "Are you okay with going into covid patient's rooms."}, {"date": "9 Mar 2023", "title": "Production Scheduler Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Deaconess in Aug 2022", "Interview Descriptions": "Deaconess is a great place to work with great benefits. I recommend working here. The position I have is a great place to start to get your foot in the door.0", "Interview Questions": "What are you breasted strengths?"}, {"date": "26 Jul 2022", "title": "Cst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Deaconess", "Interview Descriptions": "The managers were super friendly. Asked in depth questions pertaining to what was best for you and what specialties you were comfortable with. Overall, it was an easy interview, but also professional.", "Interview Questions": "What shift can you work? "}, {"date": "6 Dec 2021", "title": "Biomedical Technician I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Deaconess", "Interview Descriptions": "Interview very easy\r\nBasic technical questions.\r\nMajority of technical questions are what was learned in school.\r\nGreat employer as well as a great work/life balance.\r\nCompany values education as well as creating a healthy work environment", "Interview Questions": "Why do you want to be a biomed\r\nWhat experience did you gain in school and what can you contribute to push the company forward"}, {"date": "9 Apr 2022", "title": "ESS1 Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 3 weeks. I interviewed at Deaconess (Newburgh, IN) in Jul 2021", "Interview Descriptions": "Basic question and answer, with some scenarios. But the interviewer got some personal background and work background information. It was in the managers office and it was one on one.", "Interview Questions": "Priorities are important. Prioritize needing an EKG (non-life threatening patient), Blood Cultures, patient needs the bathroom, and routine vitals need done."}, {"date": "22 May 2021", "title": "IT Analyst Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Deaconess", "Interview Descriptions": "3 rounds of interviews. One with the department head, one with other departments. The last with peer. Did not ask in-depth technical questions.  All communications coordinated through HR. The pay offer is below market.", "Interview Questions": "Q: What are your strengths? Why are you searching for another job?"}, {"date": "1 Jun 2021", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Deaconess (Evansville, IN) in Dec 2020", "Interview Descriptions": "called for brief overview  phone call with hiring manager; Day of interview, met hiring manager and  escorted to a conferance room 3 floors up  with no offer of elevator use. Seated in conferance room while panel members assembled. Interviewers asked me to introduce myself 3 different times as people joined  interview . Panel of potential peers asking questions from a list.", "Interview Questions": "why did you apply for this job"}, {"date": "29 Apr 2023", "title": "Customer Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Deaconess (Evansville, IN) in Sept 2020", "Interview Descriptions": "Interviewer made me feel very comfortable which helped lessen my anxiety about the interview. It was a relaxed environment which also helped to lower tensions and make me more authentic.", "Interview Questions": "Have you worked in customer service before?"}], [{"date": "29 Jan 2020", "title": "Applications Systems Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Deaconess (Evansville, IN) in Jan 2020", "Interview Descriptions": "2 interviews, 1 online test. First interview was with a group of 3 people who told about the job requirements and what the job consists of. I then was asked to tell about myself and explain my resume. Then I was asked a series of about 6 questions. Then it was my turn to ask questions. Very laid back 1st interview. The 2nd interview was with a consulting firm, which was a rather intense interview. Multiple questions asked and the entire 2nd interview lasted over an hour. Be prepared to be asked a large number of questions.", "Interview Questions": "Tell me about yourself. "}, {"date": "4 Dec 2019", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Deaconess (Evansville, IN) in Sept 2019", "Interview Descriptions": "I was interviewed with the manager and a clinical supervisor. It was a very brief interview that was much like the rest of interviews. After the interview I was given a tour of the unit and introduce to some of the staff members.", "Interview Questions": "Why do you want to work in Critical care"}, {"date": "30 Jun 2021", "title": "Clerk Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Deaconess (Newburgh, IN) in Oct 2018", "Interview Descriptions": "Great! Very friendly, balanced between laid back and professional. Honest and open about all questions.  Took me on a tour of the unit, explained job duties. Manager was very kind and honest about the job process and how many applicants they still had to interview and when they would be able to contact me.", "Interview Questions": "Why I chose the specific specialty unit I applied for. "}, {"date": "25 Jun 2018", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Deaconess", "Interview Descriptions": "Formal, good practice for a real job interview. I interviewed with a panel and the employees were very kind and made the environment welcoming but professional. They asked about my former experience and courses I was taking in school. They also asked about future plans and how Deaconess could aid in my education.", "Interview Questions": "Why do you wan this position?"}, {"date": "23 Aug 2018", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Deaconess (Evansville, IN) in May 2018", "Interview Descriptions": "I participated in a panel or three interview participants. It was a non-threatening environment. Questions were common interview questions. Was a nice interview and and nice company to work for.", "Interview Questions": "Where I saw myself landing in the future."}, {"date": "22 Apr 2018", "title": "Clinical Office Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Deaconess", "Interview Descriptions": "Applied online, was called 3 weeks later to schedule an interview the next day. Interview was about 30 minutes. Discussed pay,benefits and hours.  Was told what was expected of me and what the next steps were in the hiring process", "Interview Questions": "Why should we choose you for this position ?"}, {"date": "1 Mar 2018", "title": "Lab Processor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Deaconess", "Interview Descriptions": "Applied online and was called for a phone interview. After a quick interview. I was brought in for an onsite interview that lasted about 3o minutes. Walked around the lab and was introduced to each department.", "Interview Questions": "Do you work well in a team setting?"}, {"date": "22 Apr 2021", "title": "RN Pacu Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Deaconess (Newburgh, IN) in Dec 2017", "Interview Descriptions": "There were 2 people to interview me, I brought my portfolio.  They both took turns asking me questions in the same room and did some impromptu on the spot questions. Very thorough and I was very glad I brought in my portfolio.", "Interview Questions": "How would you deal with a disgruntled family member "}, {"date": "6 Aug 2016", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Deaconess (Oklahoma City, OK)", "Interview Descriptions": "Phone interview consisting of a few very basic questions about job search and then in person interview in department with director, team lead, and a few staff Rn for that unit.", "Interview Questions": "Tell me about a stressful situation in your career and how you handled it."}, {"date": "26 Feb 2016", "title": "Patient Access Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Deaconess (Evansville, IN) in Feb 2016", "Interview Descriptions": "I had 2 interviews. The first one, I was interviewed by 2 ladies and was asked a lot of interview questions and was told about the job. The 2nd interview, I wasn't asked any interview questions. I was just told about what job was available for me and told me the pay and we talked about the hours. I want 40 hours a week and she said I'm only going to be authorized 20, but I can work over 40 a week if I want to pick up shifts. I will work day, evenings and nights.", "Interview Questions": "Why do you want this job?"}], [{"date": "6 Jan 2016", "title": "Patient Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Deaconess (Evansville, IN) in Dec 2015", "Interview Descriptions": "I filled out applications for several different units over the course of 3 weeks. I called to check and see if they needed anything else from me for my application and within 48 hours, I received an email questionnaire asking me for more information about myself. I was called back for an interview within 3 days. One week passed, then they asked me for my references again. Another week passed before I heard from one of my references that they had received a phone call about me. Two business days later, I had the job offer. I have a drug test/physical scheduled soon and my start date is in less than 2 weeks.", "Interview Questions": "What is an example of a situation in which you had to go against what a manager wished you would do, why, and what happened?"}, {"date": "8 Nov 2015", "title": "Clinical Staff Pharmacist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Deaconess (Evansville, IN)", "Interview Descriptions": "Received a call on a Saturday within 24hrs of my online application submission!  Had a very brief phone interview with HR and a Pharmacy Supervisor.  In-person, I met with HR, was interviewed by the pharmacy leadership team, and was given a tour of both Main and Gateway Hospitals.  Very impressed by obvious care for employees and patients.  Sensitive to my needs as an out-of-town applicant.", "Interview Questions": "How would your past superiors describe your clinical abilities?"}, {"date": "14 Mar 2015", "title": "Clinic Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Deaconess (Oklahoma City, OK)", "Interview Descriptions": "A telephone interview occurs first to weed out candidates. This consisted of typical behavioral questions to gauge your personality and a few questions were asked about experience. After that, formal interviews are scheduled back to back with Sr. Managers and/or Director and a panel interview with 4-6 clinic managers. Took an hour for both interviews.", "Interview Questions": "What interested you in Deaconess?"}, {"date": "31 Aug 2015", "title": "Clinic Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Deaconess (Oklahoma City, OK) in Mar 2015", "Interview Descriptions": "Interviewed with directors, then peer interview, then HR offer. Had to answer many questions with first interview, then many different ones with Peer interview, then negotiate with HR for salary.  Benefits were discussed and HR orientation was discussed.  I had to take a drug test, get vaccinated and provide shot records.  They were very helpful in the hiring process. Once I started, my first day my fellow managers ate lunch with me and that was really welcoming!", "Interview Questions": "What sets u apart from other candidates?"}, {"date": "12 Dec 2018", "title": "Clerical Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Deaconess (Evansville, IN) in Dec 2014", "Interview Descriptions": "Great, comfortable, it was a professional setting, the people really cared about the area they were hiring for, and wanted to make sure I felt the same way.  Made it easy to open about my future plans and where I saw myself in the company", "Interview Questions": "Typical interview questions"}, {"date": "6 Nov 2012", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Deaconess (Cincinnati, OH) in Nov 2011", "Interview Descriptions": "I was interviewed once and received a job offer very soon afterwards.  I was one of several applicants.", "Interview Questions": "I didn't find any question difficult;  I was completely honest because I wanted the job to match my abilities."}, {"date": "23 Jun 2014", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Deaconess (Newburgh, IN) in Jun 2011", "Interview Descriptions": "Hiring process begins with HR and then you are interviewed by a panel of staff that work on that unit. You must answer questions to the best of your ability. Then panel decides if you are a good match for the unit.", "Interview Questions": "Questions are pre-written and staff presents them."}, {"date": "27 Apr 2013", "title": "Patient Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Deaconess in Oct 2010", "Interview Descriptions": "I later found out that I had been interviewed by two patient techs rather than anyone who was in a management position.  With that said, the interview went fine, and I was asked pertinent questions.  I also had to take some kind of test when I submitted my application, but I do not remember what it was really about.", "Interview Questions": "I was asked how I prioritized my work tasks."}]]