[[{"date": "16 Nov 2022", "title": "Case Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Southwest Network (Chandler, AZ) in Nov 2022", "Interview Descriptions": "Organized and friendly. I love how the questions were answered before I could even ask them. The recruiter knew what to ask and made me feel comfortable. I definitely would recommend interviewing for this company.", "Interview Questions": "What do you like about case management, and how does it fit into your career plans?"}, {"date": "11 Jul 2022", "title": "Case Manager Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Southwest Network (Phoenix, AZ) in Aug 2021", "Interview Descriptions": "The interview was pretty easy. They ask you typical questions. Overall, the interview was  not overly hard. The interview took about half a hour. You are interviewed by the clinical coordinator and the clinic manager at the same time.", "Interview Questions": "Can you tell me what recovery means?"}, {"date": "7 Jun 2022", "title": "Office Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Southwest Network (Phoenix, AZ) in Jun 2021", "Interview Descriptions": "The office assistant position interview process was rarely difficult, but it is a two stage process. You will receive a call from HR and if they see that you meet all the requirements then you will receive a second interview which will be held in person with the Site Administrator depending on the clinic assigned.", "Interview Questions": "What is one main challenge that you have been able to overcome in a difficult situation? How were you able to resolve it?"}, {"date": "6 Jan 2021", "title": "Medical Billing Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Southwest Network", "Interview Descriptions": "They set me up with an interview fast and efficiently. I haven't had the interview yet. I am just trying to read previous peoples answers who have interviewed. I am happy and excited for this opportunity.", "Interview Questions": "How to submit claims for reimbursement"}, {"date": "18 Jul 2016", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at Southwest Network (Chandler, AZ) in Jun 2016", "Interview Descriptions": "long but thorough.  DON was honest about role and what to expect. ..  Discussed the patients that came in to the clinic.   Went over medications commonly used.  Discussed the goals the company has planned and where they were headed. Discussed my experience in mental health and the difference between inpatient and outpatient.  Overall I really enjoyed meeting the DON and enjoyed the interview.  It was somewhat informal.", "Interview Questions": "Mostly behavioral questions."}, {"date": "4 Mar 2016", "title": "Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 3 weeks. I interviewed at Southwest Network (Phoenix, AZ)", "Interview Descriptions": "First did a phone interview with a recruiter and was asked about education, experience, salary expectation.  Group interview with about 3 people.  Process took about 2 weeks before the 1st interview.  Brought back for a 2nd interview after 2 weeks.  During the 2nd interview I had to complete a data project and present it to the group.", "Interview Questions": "Asked about work habits, previous data experience."}, {"date": "14 Jul 2016", "title": "Case Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through other source. The process took 1 week. I interviewed at Southwest Network (Phoenix, AZ) in Jul 2015", "Interview Descriptions": "Interviewed by the team supervisor and site manager simultaneously with questioning from each concerning experience in the field as well as situational hypothetical cases. The interviews usually are scheduled with several different candidates per day over the course of a week and an offer is not given until all applicants are interviewed and the management has time to peruse notes and compare applicants.", "Interview Questions": "Describe a time of difficulty with a mentally ill client via your experience and the steps you took to deal with the situation and the resolution that occurred."}, {"date": "18 Oct 2015", "title": "Case Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Southwest Network (Phoenix, AZ) in Dec 2014", "Interview Descriptions": "After submitting interview online, I received a call from HR which set up the interview for me at the site for which I was interviewing for. I met with two clinical directors. After the interview, I was told I should hear something soon from HR. When HR called me and offered me the job, I was able to negotiate more money than originally offered. They sent me for a drug test within 24hrs of accepting the job and I had to submit additional paperwork for the background check. I was told successful completion of these was needed before the job was for sure.", "Interview Questions": "STAR questions. Ex:Describe a specific time when you did not agree with your supervisor. What did you do?"}, {"date": "16 Aug 2014", "title": "Case Manager Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Southwest Network (Chandler, AZ)", "Interview Descriptions": "First was a screening interview on the phone - seemed very in depth about qualifications and how they translated into position including computer, word/excel knowledge, etc.  Second was in person panel interview with clinical coordinator and clinical director.  Very in depth conversation and questions - interviewers had 3+ pages of questions.  took about 1 hour.  Both were pleasant and engaging.", "Interview Questions": "Mostly star questions - situation, action, result. Have some good relevant work experience situations regarding communication with employees, bosses, problem solving, team building etc.  "}, {"date": "1 Apr 2015", "title": "Support Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 5 weeks. I interviewed at Southwest Network (Mesa, AZ) in Oct 2012", "Interview Descriptions": "First, I interviewed at a Job Fair sponsored by Southwest Network. This was a 1-on-1 interview that could have been with any random senior from any clinic across Maricopa County. I was fortunate to interview with the Clinical Director from a Mesa office - which was where i wanted to work. HR conducted a phone interview with me a couplease weeks later. Then I was asked to attend a follow up interview by HR at the hiring location, where I was interviewed by the Clinical Director and Office Manager. The whole process took so long that I nearly accepted another job by the time they got around to offering me this position.", "Interview Questions": "Why do you want to work in the mental and behavioral health field?"}], [{"date": "29 May 2015", "title": "Office Assistant Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. I interviewed at Southwest Network (Phoenix, AZ) in Jun 2012", "Interview Descriptions": "Long lengthy paperwork and background check, drug screening. Employment doesn't start right away it took a month to start employment. It was a very long process and it's very tidious. The paperwork from human resources is long and then I had to interview in a group setting. I was receiving back to back questions from different employess judging me by my answer before I receive an offer. Then I couldn't start the position right away until a month later until I attended an orientation before employment.", "Interview Questions": "Why do you want to work for us? Where did you come from. A series of questions on how I handle certain job functions on my interview. Group interview wanted to know my educational background, where I came from. Everything was asked except my DNA."}, {"date": "20 Mar 2015", "title": "Case Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Southwest Network (Phoenix, AZ) in Jun 2011", "Interview Descriptions": "It was a panel interview that consisted of the clinical coordinator for the team that I was applying for the position for, another clinical coordinator for another case management team and the Clinical Director for the entire site. They each took turns asking questions but it wasn't very intimidating possibly because we were all sitting at one (fairly small) round table.", "Interview Questions": "Name a time that you have disagreed with your direct supervisor and how did you handle to situation?\r\n\r\nName a time that you have had a conflict with a coworker, how did it start, how was it resolved?\r\n\r\nIf I were in need of (a food box, urgent psychiatric care, rental assistance) where would you refer me for aid?"}, {"date": "19 Aug 2014", "title": "Office Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Southwest Network in Jan 2010", "Interview Descriptions": "I was told I was over qualified, but they had a position opening and would get back to me. Two months later they got back to me and hired me in the phone call. Unfortunately it wasn't for the more qualified position I was told about.", "Interview Questions": "It was a pretty basic interview as the position was for front office work. So there really wasn't anything difficult or unexpected. Sorry"}]]