[[{"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Ameson Year in China", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "5 Jan 2018", "job_title": "Cultural Ambassador in Nanjing, Jiangsu", "duration": "N/A", "pros": "Ameson is a great foundation to work for. They are helpful, knowledgeable, and their focus is really on building meaningful, international relationships.", "cons": "You are expected to figure a lot out on your own, which I personally loved, but can be stressful at times."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": 4, "Career Opportunities": 0, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "good for short vision entry level experience, but not long term", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "26 Mar 2021", "job_title": "Consultant in Yantai, Shandong", "duration": "N/A", "pros": "you get to exprience local high schools' intl divisions, usually go with the local schools' work time, and u get to hang out some cool high school kids if lucky.", "cons": "the pay is pretty low, and no raise for many years, and based on the Chinese age & hierarchical traditions, its also depending on whether you are liked by your team leader or whatnot. In the long run, not very recommending cuz' of the low pay and no raise or promo. And many times you have to deal with crappy parents and their impudence."}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Been with the company for over three years", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "16 Oct 2014", "job_title": "Teacher in Nanjing, Jiangsu", "duration": "N/A", "pros": "The HR department here has always been quick to respond to problems and most will find ways to solve problems.  Since they have hired American deans dedicated to specific areas (Humanities, Math & Sciences) teacher support has improved. The Chinese management team at my school is very responsive to teachers needs and will offer all the assistance possible within their abilities to provide.  The Chinese teachers are all extremely professional and coordinate well with the foreign teachers.", "cons": "The schools tends to hold on onto marginal students who have difficulty in grasping the curriculum or those students who are just lazy, refusing to do any homework and having terrible test scores (but somehow still manage to get into top universities). \r\nSchools tend to focus to much on TOEFL prep for Senior 1 & 2, reducing available class time for classes such as American Studies, History, Literature and the sciences.  For Senior 3, the first two months is completely dedicated to SAT prep, thus delaying AP classes beginning around the time of midterms\r\nThe Chinese staff and parents tend to look at the US News and Business report ratings of colleges as the official rating of American universities."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": "N/A", "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Ameson provides great opportunity for self-starters seeking a change of pace", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "1 Apr 2018", "job_title": "Educational Ambassador in Quzhou, Zhejiang", "duration": "N/A", "pros": "Full immersion in a foreign culture, terrific opportunity to improve conversational Mandarin proficiency, greatly satisfying work, very engaging work community at school and at HQs in Shanghai and DC.", "cons": "School leaders are reluctant to give ambassadors full autonomy (as most Westerners are accustomed to having) and may ask or require ambassadors to report on all movements around and outside of China. The ambassador position also does not require much of  ambassadors, and thus free time is overwhelmingly much. However, for those able to find other productive projects to keep themselves busy this is an ideal setup."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Great place to work in China", "rating": "4.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "13 Jun 2014", "job_title": "Anonymous Employee in Nanjing, Jiangsu", "duration": "N/A", "pros": "Ameson is a great option if you are looking for a job teaching in China as a foreigner. Also, Ameson's different programs offer many career development opportunities. Also, the people here are really great- my Chinese coworkers help me with all aspects of living in China, including learning the language.", "cons": "Ameson is a Chinese company, and operates with a Chinese culture. A lot of problems Westerners have with Ameson stem from this one simple fact. It can be very hard to adjust to the Chinese style of work, communication, and overall company culture, and some people really won't succeed in this kind of environment. It's not just about cross-cultural awareness, but also exercising tact and serious adjustment."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great!!  An Opportunity to see China and its growing importance in World Politics and Economics", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "5 Jun 2014", "job_title": "English Teacher in Guangzhou, Guangdong", "duration": "N/A", "pros": "The Ameson Foundation: Year in China Program has changed my life. I have had an opportunity to travel to Beijing, Guangzhou, Changsha, Foshan, and an occasional trip to Hong Kong. The Ameson Foundation has been there whenever I needed assistance with any issue. I think living abroad should challenge you and should help you grow. China is a dynamic country, but it is also the largest developing country with a history of over 5,000 years. It has been great", "cons": "I honestly can not find any fault. All of my issues were intial culture shock which is a given for living in a foreign land."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 0, "review_title": "Good benefits, subpar HR", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "3 May 2017", "job_title": "Physics Teacher in Jinan, Shandong", "duration": "N/A", "pros": "Good salary with a low cost of living.  Students are (mostly) dedicated and hard working.", "cons": "Some host schools have good support for foreigners who can't speak Mandarin.  I was lucky enough to be at once such location, but many other schools don't have adequate support.\r\n\r\nIf you see in the recruitment flyer that they will give free Mandarin classes and give your kid free school, they are wrong.  It's never included in the contract, it's just a gimmick.\r\n\r\nReimbursements for travel or professional development are highly inefficient and complex."}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "First year this program existed... has some bumps to smooth out but has a valuable mission", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "4 Jun 2014", "job_title": "AYC Teacher in Yichang", "duration": "N/A", "pros": "-It seems they are trying to add some ethnic and cultural diversity to the population of recent grads coming to China from the States. This is a really good because not only does China needs to be exposed to more diversity, but there is also a current lack of opportunities in the U.S. for minorities to travel and work abroad. \r\n-helped get me through the Visa application and TEFL accreditation process\r\n-paid for TEFL course and certificate\r\n-found me a job in a good city that suited my interests \r\n-very open to feedback, will probably see a lot of improvement in their second year\r\n-there are a few individuals in the organization who worked their butts off to try to make life better for the Ameson teachers\r\n-they offer cool prize and cash incentives to help them advertise\r\n-they help you find jobs after you finish your first year contract!\r\n-weekly newsletter is nice, you get to see what the other Ameson teachers are up to, and you get some helpful tips about living and working in China.", "cons": "-grateful for the training I did receive (online and 1 week in Shanghai) but it should have been longer, and needed less time spent on how to teach out of a textbook because most of us didn't receive any textbooks to use in our classes.\r\n-they advertised that they would be in partnership with our schools to provide some opportunities for us to learn and experience Chinese culture (including some outings as well as Chinese language lessons), but I don't know anyone who actually got these.. \r\n-Poor communication the summer before the school year started, resulted in a LOT of stress, wondering whether or not I would actually be going to China; as well as a lot of wasted money due to flight rescheduling \r\n-Overall, they really didn't have their stuff together before they threw themselves (and ~400 recent grads) headfirst into the program and a lot of us got burned for it."}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 3, "review_title": "Worked Six Years For Ameson", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "1 Jun 2018", "job_title": "History Teacher in Suzhou, Jiangsu", "duration": "N/A", "pros": "Some schools had problems, but some are great.  I worked one year in Kunshan then five years in Suzhou.  Suzhou is one of the best schools in the system. It was so well run, we hardly if ever saw anybody from home office on our campus. Unlike many schools where the foreign and Chinese teachers don't communicate, in Suzhou there is constant interaction between the two and we constantly shared information and in many cases interacted socially outside of the job. The Principal and Vice Principal are both friendly and approachable. they never ask anything from the foreign teachers that would not be willing to do themselves.  They also trust their foreign teachers enough to give them full academic freedom to design and teach their courses with little if any oversight. Unlike many Chinese schools where students have to return to school  every evening for study hall till 9 pm, our students go home.  I enjoyed my time in Suzhou, and if it weren't for my daughter reaching school age, I would have stayed another few years there.", "cons": "Some students selected for the program were lazy, refused to do any work and were somehow able to still get into top universities.  \r\n\r\nThe counselors with Ameson need to listen to the foreign (especially the American) teachers when they suggest that students might be better served to spend their first one or two years in a community college before going on to a four year university."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "AYC - The Best Way to Teach in China", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "16 Apr 2017", "job_title": "Educational Ambassador in Lishui, Zhejiang", "duration": "N/A", "pros": "AYCers are afforded a salary, free round-trip ticket, free housing, free utilities, (often) free taxes, and free TEFL certification. They are supported by an office in Shanghai that is staffed with both Chinese and American personnel.", "cons": "Communication and problem-solving is at times difficult because it is sometimes unclear whether Ameson, local coordinators, or the AYCer is liable."}], [{"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 0, "Senior Management": 3, "review_title": "Getting Paid, Learning Chinese", "rating": "4.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "30 Oct 2013", "job_title": "AYC Teacher in Nanjing, Jiangsu", "duration": "N/A", "pros": "Living in Nanjing working with the Ameson AYC program. Life is pretty good. Free housing is nice and Nanjing is fun. Work is pretty easy as it is not hard to teach English speaking as a native speaker. Learning Chinese during work hours", "cons": "Chinese is a very difficult language. Some discrepancies in the contract as presented in the marketing and the final form caused needless difficulties but it has mostly been ironed out now."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "College Counselor", "rating": "2.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "11 Aug 2015", "job_title": "Consultant in Shanghai, Shanghai", "duration": "N/A", "pros": "As someone whose education background was a little over qualified for this position while still a freshman out of school, I was given many opportunities to deal with clients directly very quickly after joining the team.", "cons": "The company doesn't provide a clear (to be more accurate, none) career path. So not recommended for graduates."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "AYC Gives Promises They Cannot Fulfill", "rating": "1.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "25 Feb 2014", "job_title": "ESL Teacher in Foshan, Guangdong", "duration": "N/A", "pros": "There were no program fees for the 2013-2014 application, they coordinated to match applicants with host schools, the host school paid for visa expenses once applicants arrived in China.", "cons": "Instead of dealing with a problem, Ameson thought it was better to just ignore phone calls, emails and concerns from applicants. Once you arrive at your host school they pretty much just dump you off and are of absolutely no help to you from there on after...that is, if you ever hear from them ever again (opposite of what they tell you); everything is either \"out of their control/ there is nothing they can do about it.\" The website promised weekend and holiday excursions put together by Ameson for all participants...which is also false. The orientation in Shanghai was a complete waste of time and I am glad I did not have to pay for it. They tell you that you will get your TEFL Certificate; I have yet to ever see mine. Ameson will try to market themselves by saying 5,000 RBM for 23 hours of lessons per week is really good for a first time teacher in China. This is completely false. Talking with other teachers at other schools in the area...starting salaries are at least 18,000 RMB for teaching an average of 10 hours of lessons a week. This is how they get host schools on board because the school can then get away with having foreign teachers work WAY too many hours for very little pay. Overall, they are a very dishonest, unorganized, and unprofessional company and I am very embarrassed to say that I fell for their scams and lies. For my personal experience, Ameson made sure to hide the fact that this was the inaugural year of the program. If I knew that, I would have probably never accepted the position. In the beginning, this seems like a great opportunity that does not cost too much money. Unfortunately, by the time you deal with Ameson, rebooking flights because of their terribly communication, and having to pay for numerous \"surprises\" along the way that were \"unforeseen\" by the Chinese government...you lose a lot of money, patience and sleep from this program. This company is very shady and I hope this review encourages you to look elsewhere for ESL opportunities."}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Few Hiccups, Overall Fine", "rating": "4.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "11 May 2017", "job_title": "Education Ambassador in Nanjing, Jiangsu", "duration": "N/A", "pros": "They help you throughout the VISA application process and are easy to reach, as well as accommodating.", "cons": "Some information you have to figure out for yourself, and because the VISA isn't guaranteed the first time around, that part of the application process can be a little disconcerting."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Run as fast as you can away!", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "17 Apr 2020", "job_title": "High School History Teacher in Yangzhou, Jiangsu", "duration": "N/A", "pros": "Zero.  None.  Worthless company run by even more worthless people.", "cons": "Low pay.  micromanagement.  inept leadership.  expert liars.  two faced.  master gaslighters.  HR department thinks they can dictate to teachers how to teach.  Chinese liaison as local campuses treat foreign teachers like trash.  Massive xenophobia from owner."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Communication between Head office and Teachers, is terrible.", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "11 Nov 2013", "job_title": "Teacher in Nanjing, Jiangsu", "duration": "N/A", "pros": "In my school the students are excellent and it's a pleasure to teach them.", "cons": "Head office, communication, 10 month contract, unorganized, they take no responsibility for their actions."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Education Ambassador", "rating": "4.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "30 May 2018", "job_title": "Education Ambassador in Longquan, Zhejiang", "duration": "N/A", "pros": "Offer college graduates an easy and affordable way to come live in China to teach English and learn about Chinese culture", "cons": "You don't get to decide where you live"}]]