[[{"date": "7 Oct 2022", "title": "Director, Consulting Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Nonprofit Finance Fund", "Interview Descriptions": "Excessive. More than two hours of interviews, then they require a \"candidate exercise\" project which takes another few hours, and then they want to do the background check before you even have your final interview. They should compensate people for spending so much time helping them find the right candidate.", "Interview Questions": "Why do you want to work here?"}, {"date": "27 Jun 2022", "title": "Project & Initiative Support Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Nonprofit Finance Fund", "Interview Descriptions": "Initial phone interview followed by a hiring manager interview, a team interview (includes an exercise prior), and then an interview with HR Manager.  After my hiring manager interview, NFF had ghosted me and wouldn't respond to my follow-up email.", "Interview Questions": "Basic Interview questions -- Tell me about yourself? How would you bring diversity to this position? "}, {"date": "27 Jun 2022", "title": "Project & Initiative Support Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Nonprofit Finance Fund in May 2022", "Interview Descriptions": "The recruiter had mentioned that the interview process at NFF begins with an initial phone interview before a hiring manager interview followed by a group interview and then a final interview with the head of HR. After the hiring manager interview, NFF had completely ghosted me and didn't respond to my follow-up email after promising a 3 business day turnaround time for next steps. For a company that prides itself in its values, this interview experience has painted a negative of picture the firm for me. Wouldn't bother applying again for another opportunity with them.", "Interview Questions": "Basic Interview Questions:\n\nTell me about yourself?\n\nHow would you promote diversity of thought in their team?\n\nPlease explain the most difficult project that you had so far in your career?"}, {"date": "21 Mar 2022", "title": "Associate, Operations & IT Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Nonprofit Finance Fund in Jan 2022", "Interview Descriptions": "Short phone interview (about 30 minutes) with a Talent Acquisition Associate. Consisted of getting to know you questions, questions about resume, and how you feel about the NFF. Waited for an email regarding next steps (and followed-up with the associate) but was ghosted.", "Interview Questions": "Tell me about your previous work experience. "}, {"date": "10 Dec 2021", "title": "Senior Associate Budgeting & Forecasting Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Nonprofit Finance Fund", "Interview Descriptions": "Applied online through platform, later got an email for a phone interview. Process was easy and it was a first round general interview. Later got an email saying they've moved on to other candidates", "Interview Questions": "More about yourself?  What's your leadership style? What's an achievement you are proud of?"}, {"date": "8 Jun 2021", "title": "Analyst, Advisory Services Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Nonprofit Finance Fund in May 2021", "Interview Descriptions": "I was contacted several months after submitting my application, did an initial phone screening with HR, then completed a take-home assignment and met with two program staff a couple weeks later. Only one staff member asked questions-she was very through and responsive. I didn't hear back for a couple weeks after this and it was an email saying they'd let me know next steps in another week. A couple weeks go by and I finally receive a an email that there was a hiring freeze and they hope to pick back up interviews in about two months.", "Interview Questions": "Take home assignment involved writing an email to a hypothetical client and analyzing survey data and writing a memo to staff."}, {"date": "8 Sept 2020", "title": "Senior Associate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Nonprofit Finance Fund", "Interview Descriptions": "The interviewer called at the scheduled time, but it wasn't the person I was scheduled to interview with. In fact, I don't even know who it was because -- as I told them repeatedly -- I was unable to hear. When their phone cut out, you'd think they'd reschedule -- or at least take off their headset and move to a quiet location -- but I suppose pushing through the questions was more important than the candidate being able to hear them.\n\nThe questions were basic; so basic, in fact, I wondered if they even read my resume. Of course, there was a tell-me-about-a-time-when question and a what-do-you-think-you-bring-to-the-organization question.\n\nWhen it came time for me to ask questions, the interviewer basically read from the \"Our Values\" page on the website, or was unable to answer what I asked.\n\nI was asked about salary and willingness to travel.\n\nThe next steps sounded a bit disproportionate to the position; prepare to have to complete an assignment (unpaid, of course) as part of the interview process.\n\nFor an organization touting its commitment to Diversity, Equity, and Inclusion, it's incredibly ableist to pressure a candidate to continue with a phone interview when they repeatedly tell you they can't hear. Unfortunately, there's a power imbalance in this situation; a reasonable interviewer would say, \"I'm sorry. Let me turn off my headset, move to a quieter location, and I'll call you right back. If we're still having trouble, I'm more than happy to reschedule.\"\n\nBut I guess interviewing qualified candidates is just too much of an inconvenience for HR.", "Interview Questions": "\nTell me about a time you had to have a difficult conversation."}, {"date": "7 Dec 2021", "title": "Associate Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Nonprofit Finance Fund (New York, NY) in Aug 2019", "Interview Descriptions": "The interview process had multiple rounds - it was a mix of behavioral and case interviews. One of the case interviews was analyzing a non-profit's financials and answering some key questions. \n\nI was a bit frustrated because I made my start date very clear up front but in the end, did not get the offer because I could not start when they wanted me to.", "Interview Questions": "How would you gain credibility when working with a new nonprofit partner?"}, {"date": "30 Oct 2017", "title": "Financial Services Associate Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Nonprofit Finance Fund", "Interview Descriptions": "The first round interview was a telephone call with the human services representative. It took approximately 30 minutes and consisted of general interview questions. It was very structured, as if the interviewer was reading questions off a sheet.", "Interview Questions": "What type of work environment do you thrive in?"}, {"date": "19 Oct 2017", "title": "Knowledge and Communications Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 5 months. I interviewed at Nonprofit Finance Fund (New York, NY)", "Interview Descriptions": "2 rounds of phone interviews, 2 in person interviews with hiring manager, HR and VP of department, 1 interview with a team member.  2 hour writing exercise, multiple requests for work samples.  This was drawn out over approximately 5 months and I didn't hear that I wasn't selected until about 3 months after my last interview, at which point I had forgotten about the job.", "Interview Questions": "N/A"}], [{"date": "15 Jul 2015", "title": "Knowledge & Communications Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Nonprofit Finance Fund", "Interview Descriptions": "Initial phone interview w/ HR to go over basic qualifications, education, salary expectations, etc. Two in person interviews with hiring managers and other staff on the team. Lots of focus on organizational fit and comfort with ambiguity. Was not grilled on specific skills.", "Interview Questions": "Talk through the workflow of a project you could imagine yourself doing at NFF."}, {"date": "13 Oct 2016", "title": "Associate Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Nonprofit Finance Fund (New York, NY) in Mar 2015", "Interview Descriptions": "The process started off with an application, after which I was called for a phone interview. The call was led by a member of the HR team. That interview went well, so I was asked to do a case study, which represented a fictional client. I guess I didn't do well on the study because I wasn't called for an other interview afterward.", "Interview Questions": "Give me an example of a time you failed. What did you learn from that failure?"}]]