[[{"date": "2 Feb 2022", "title": "Bilingual Recovery Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Community Health Resources", "Interview Descriptions": "It was an extensive interview but it was really great. The interviewer was very insightful. It tool  about an hour with several questions regarding experiences in the field or in relation to that field.", "Interview Questions": "What difficult situation you have been presented with and how did you handle it?"}, {"date": "24 Aug 2021", "title": "Family Support Specialist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Community Health Resources (Willimantic, CT) in Aug 2021", "Interview Descriptions": "Very friendly and responsive interviewer. It was going to be a two-interview process but I am grateful that they were upfront about salary limitations in the first interview. I was able to make an informed decision to look elsewhere based on my situation.", "Interview Questions": "How is your approach to care informed by trauma?"}, {"date": "11 Jan 2023", "title": "Family Support Specialist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Community Health Resources (Hartford, CT) in Aug 2021", "Interview Descriptions": "The interviewers had clear communication and they were kind. It was easy to ask my questions and get clarity on the compensation for the role early on. They put their best foot forward in terms of respecting my time as a candidate and providing responsive emails.", "Interview Questions": "Please describe considerations and practices for trauma-informed interventions."}, {"date": "25 Apr 2021", "title": "Director Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Community Health Resources", "Interview Descriptions": "Very professional team and process. Appeared to have good comradery and dynamics on the team. \n\nSeemed to have a strong work ethic and to care about the people the clients and communities they serve. Appeared to have a detail oriented process in place for systems within the organization.", "Interview Questions": "What would you consider your strengths??"}, {"date": "20 Jan 2021", "title": "RN COORDINATOR Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Community Health Resources in Dec 2020", "Interview Descriptions": "The interview was done virtually and took about 35-40 minutes long.    They asked me to tell them about myself and what makes me qualified for the position.   They wanted to know why I was interested in working for the department of corrections.   And they also explained the work environment and risks associated with working in a jail.", "Interview Questions": "Tell me about yourself?  \n\nWhy are you interested in this position?\n"}, {"date": "25 Jun 2018", "title": "Residential Supervisor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Community Health Resources (Hartford, CT) in Jun 2018", "Interview Descriptions": "Applied online.  After an email exchange, an interview date was set the following week.  Withing 72 business hours, my interview was cancelled due to the fact the position was filled (the post online was about 6 days old).  I think they had an internal candidate picked out.  I submitted another application for the same position at another site. Did the interview, second interview and a few of my references were called.  It has been about 1 week since those references were called and I am awaiting a response.", "Interview Questions": "About me experience working with clients with trauma."}, {"date": "14 Oct 2018", "title": "Clinician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Community Health Resources (Coventry, CT) in Mar 2018", "Interview Descriptions": "Interviewed at the location where I would be working which was great,  because I could sort of hear the youth screaming and swearing in the back ground which I think was important for a taste of the environment. The interviewer was professional and engaging, and I really liked him off the bat. He asked great questions and we had a lot of dialogue/discussion rather than question/answer style.", "Interview Questions": "How do I handle stressful situations"}, {"date": "13 Apr 2017", "title": "Program Manager Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Community Health Resources", "Interview Descriptions": "Quick as they come. Over and done with after barely 15 minutes. Kind of discriminatory too because of some of the questions they asked. One of the questions asked about my religious preference and whether I would need certain holidays scheduled off to observe. Another question asked about whether I would have a hard time \"taking orders from somebody who was much younger than you.\" Jeez!! Just come righout and say that you discriminate against candidates due to their religion and age. At least I'd have more respect for you for being upfront about the fact. Ironically, I did receive an offer before the week was over. But I followed my gut intuition and turned away the offer. Just a couple weeks later, I received an offer somewhere else working for people that aren't insensitive and discriminatory like CHR obviously is.", "Interview Questions": "\"Will you have a tough time taking orders from somebody much younger?\"\r\n\"What religion are you and do you need those holidays off?\""}, {"date": "12 Apr 2017", "title": "Support Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Community Health Resources", "Interview Descriptions": "Easy interview process but it took over a month to get all background checks etc. done. You also have to be prepared for a week long training which is difficult to schedule.", "Interview Questions": "Explain how your education can help in this position?"}, {"date": "15 Mar 2017", "title": "Nurse Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Community Health Resources", "Interview Descriptions": "My interview experience was really bad, starting with the human resources department. Leadership in human resources at CHR is so unbelievably disrespectful, I wouldn't even know where to begin! They were very dismissive and quick to rush me off the phone. A few weeks later, I was called a second time for the same position which I thought I definitely hadn't got the first time. Evidently there wasn't very much communication in the human resources department between which candidates (myself) had already been screened for which positions. Once I got to the on site part of the interview process, it wasn't very good either. My interviewers clearly had very little experience with interviewing candidates. Most of the questions had little to zero relevance to the position which I had applied for. Some of the questions were even kind of inappropriate in nature, since they both brought politics into the mix. Politics, religion, and other stuff shouldn't really be discussed in the workplace; definitely not during an initial job interview where you don't really know the candidates all that well. Later on, several weeks afterwards, I was finally given a third call back stating that another candidate had ultimately been selected for my first choice. However, they did extend an offer for a different position which I hadn't actually applied for. I declined the second offer since it wouldn't have been compatible with my schedule. By that time thankfully, I had already accepted an employment offer with a much more professional agency. So as far as I'm concerned, it wasn't really that much of a loss.", "Interview Questions": "Some of the questions focused on politics, what policies I supported et cetera. Then there were a couple of standard questions asked: \"what does 'quality of care' mean to you, as a nursing professional?\""}], [{"date": "28 Jul 2017", "title": "Recovery Coach Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Community Health Resources in Mar 2017", "Interview Descriptions": "Met with program director on the first day. Was a new program they were starting so was some longevitity with the hiring process. Updating status could be improved. HR wasn pretty good at returning calls", "Interview Questions": "Why do you want to work in the mental health field "}, {"date": "11 May 2021", "title": "Social Worker/Case Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Community Health Resources (Manchester, CT) in Jan 2017", "Interview Descriptions": "Professional detailed average. I was contacted via phone after submitting my resume. I went through 2 interviews and offered the position. Training was provided and additional training was provided for my specific site. Hands on experience and case management is required.", "Interview Questions": "Standard behavioral questions and your responsiveness "}, {"date": "1 Dec 2015", "title": "Residential Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Community Health Resources (Enfield, CT) in Nov 2014", "Interview Descriptions": "I submitted my resume and it was reviewed by HR and sent directly to the program director of the site that I worked at. The program director called me for an initial phone interview, asking me about my interest in working there and past experiences (what was on my resume). The next step was an onsite interview where I sat with the program director. There was a third step in that I had another interview with the team as a whole - overall the interview process was very relaxed and positive.", "Interview Questions": "Explain your interest in working with adults with mental illnesses?"}, {"date": "14 Aug 2017", "title": "Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Community Health Resources (Windsor, CT) in Feb 2013", "Interview Descriptions": "I was contacted within 2 weeks of submitting my application. I first had a phone interview with a nice woman in HR. They forwarded me to the Program Director and I had an in person interview with her. It was a fairly short interview compared to other interviews I have had but pretty straightforward. The only annoying part was the long and detailed application form they wanted me to fill out which I understand is needed when working in this industry because of all the DCF and state police background checks, etc. I hadn't heard back for about 1 week so I reached out to HR and was told they were still making a final decision but then a couple days later, they made me an offer which I accepted.", "Interview Questions": "How do you perform under stress when presented with a situation you've never dealt with?"}, {"date": "10 Sept 2015", "title": "Office Manager Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. I interviewed at Community Health Resources (Enfield, CT) in Jan 2013", "Interview Descriptions": "First interviewed with a company psychologist,   ver green with the process.  Then sent me to be interviewed by several employees.   Terrible process. Waited weeks for a second interview.  Then met with same person again and at that point she was unsure of whom she was going to diside on.", "Interview Questions": "How would I handle a difficult situation."}]]