[[{"date": "24 Sept 2021", "title": "Tutor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Howard Community College", "Interview Descriptions": "Due to the current pandemic the entire interview and hiring process was online. The prosses happened through the in house HCC career center website available to the students, faculty and alumni.", "Interview Questions": "What are your preferred salary?"}, {"date": "23 Aug 2021", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Howard Community College (Columbia, MD) in Aug 2021", "Interview Descriptions": "I was required to complete a take-home task creating a research proposal, prepare a 10-minute presentation pertaining to my research proposal, answer regular interview questions, and then take a technical test to assess my ability to interpret data.", "Interview Questions": "Describe the feedback you've received, good or bad, pertaining to your academic writing."}, {"date": "18 Apr 2021", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Howard Community College", "Interview Descriptions": "Very smooth interview process which included a little get-to-know chat. I had to prepare a lesson plan prior to the interview and had to demonstrate one exercise explaining the objectives. We discussed my teaching philosophy.", "Interview Questions": "Why did you decide to go into teaching?"}, {"date": "24 Jan 2019", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Howard Community College", "Interview Descriptions": "Phone interview followed by an in-person panel interview. Phone interview was relaxed and went great. Panel interview was intimidating and those who participated did not act professionally. Asked me about my experience working with different personality types, and then proceeded to brag about how they quickly \"weed out\" the quiet types in the office. I happen to be a \"quiet type\" and don't consider myself to be a weed. So let's just say it was not a good fit.", "Interview Questions": "What does diversity in the workplace mean to you?"}, {"date": "20 Feb 2018", "title": "Lab Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 8 months. I interviewed at Howard Community College (Columbia, MD) in Sept 2017", "Interview Descriptions": "It was held one on one in a professors office.  They contacted me after I applied to that job 8 months ago. They need instructors depending on the popularity of the class.", "Interview Questions": "mainly being asked my previous teaching experiences and how to deal with problems when they come up between the Teacher and students."}, {"date": "11 Jun 2016", "title": "Library Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Howard Community College", "Interview Descriptions": "They have too many librarians with full PhDs working part time do to cost-cutting. They made it clear that they did not actually feel the position was needed. There were two interviewers. One was kind and the other was openly hostile. She told me she had never heard of my school (which is in the NESCAC comference) and also told me that it would be important that I be \"careful not to overstep\" when I detailed my previous work experience.", "Interview Questions": "I was asked how I would feel about working with a diverse student body."}, {"date": "24 Jul 2017", "title": "ESL Adjunct Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Howard Community College (Columbia, MD) in Jan 2016", "Interview Descriptions": "It was one-on-one with one of the educational specialists in the department. Overall, it was very low-pressure, with questions geared towards what Teaching experience I had.  There was no demo required. I was offered the job on the spot and given the materials needed to further my employment process.", "Interview Questions": "How would you deal with a student who has no English language experience at all?"}, {"date": "24 Jun 2016", "title": "AV Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 3 days. I interviewed at Howard Community College in Nov 2015", "Interview Descriptions": "Overall It was a good interview. Two managers and an employee interviewed me, they both seemed easy going and easy to talk to. I was asked about my experience and work ethic.", "Interview Questions": "How are your customer service skills?"}, {"date": "6 Sept 2015", "title": "Computer Lab Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Howard Community College (Columbia, MD) in Aug 2015", "Interview Descriptions": "Lots of questions about approach towards others, Information Technology skills, availability, past experience, approach to privacy, customer service, plans from r career development, people skills, reason for leaving last job.", "Interview Questions": "How would you deal with an IT related issue that you did not have the solution for?"}, {"date": "18 Nov 2014", "title": "Groundskeeper Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Howard Community College", "Interview Descriptions": "The interview was very laid back because I knew the guy hiring me.  I feel like there weren't too many questions, but rather just a meet up with bosses and the like.", "Interview Questions": "N/A"}], [{"date": "8 Feb 2014", "title": "Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. I interviewed at Howard Community College", "Interview Descriptions": "Great interview- very kind staff and very fair", "Interview Questions": "Use of ASL fluently with deaf staff - how able would I be?"}, {"date": "4 Apr 2016", "title": "Lobby Monitor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 5 days. I interviewed at Howard Community College (Columbia, MD) in Aug 2013", "Interview Descriptions": "First started out by talking with the Athletic Director at the college about becoming the sports photographer which then lead to an open position at the Athletic and Fitness Center where spoke with the office manager and applied in person at the college. Filled out application and work required information and got the job on the spot.", "Interview Questions": "They asked if I had good computer and communication skills."}, {"date": "28 Jan 2016", "title": "Front Desk Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at Howard Community College (Columbia, MD) in Jul 2012", "Interview Descriptions": "It was very basic.  I met with the Hiring Manager.  After I was hired she was my main manager.  She assigned us our schedules and reviewed our work.  Her questions were also basic and precise.  The interview was quick, and easy.", "Interview Questions": "Why did you chose to apply here?"}, {"date": "13 Jan 2014", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 6 months. I interviewed at Howard Community College (Columbia, MD) in Jan 2012", "Interview Descriptions": "Panel Interview, very involved.", "Interview Questions": "No difficult questions."}, {"date": "11 Nov 2015", "title": "Testing Center Associate Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Howard Community College (Columbia, MD) in Jun 2011", "Interview Descriptions": "After submitting an application online I was contacted to come in for an interview. At the interview, there was a panel of about five people, including a student and a teacher. It was not a very comfortable process in that I felt as if I were \"on the firing line.\" I felt that the panelists didn't strive to make the interviewee (me) feel at ease. I got a form letter after the interview stating that they had selected someone else.", "Interview Questions": "What do you understand \"diversity\" to mean?"}, {"date": "29 Sept 2009", "title": "Coordinator of A Program Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 2 weeks. I interviewed at Howard Community College in May 2007", "Interview Descriptions": "Director of the department interviewed me.  She asked standerd questions and looked at my knowledge, skills and previous performance. She was very professional and asked me very appropriate job related questions and observed my body language very closely.  She also asked many questions regarding common sense which I handeled well.", "Interview Questions": "Why do you think you shoud be hired for this positon?"}]]