[[{"date": "5 Jul 2023", "title": "Talent Development Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Brock University", "Interview Descriptions": "Multiple rounds of interviews. It started virtual and the second was in-person. 3 person panel taking turns asking questions. There was an assessment to review a mock resume. You had to walk through what changes you would make/role play with the panel", "Interview Questions": "How this job fits with your career goals?"}, {"date": "17 Apr 2023", "title": "Coordinator Level Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Brock University", "Interview Descriptions": "Panel interview with questions - HR will always ask you to \"bring your resume to life\". There will sometimes be a second round with specific assignments provided (e.g., create a material, writing sample, etc.).", "Interview Questions": "Describe a time that you planned an event in a previous position - what worked and what did not work. How do you measure success of events?"}, {"date": "12 Apr 2023", "title": "Administrative Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at Brock University (St. Catharines, ON) in Apr 2023", "Interview Descriptions": "A lot of questions. Three very nice people interviewed me, if you go there prepared, you'll do fine. The interviewers are very nice, and you get to the interview online.", "Interview Questions": "How would you describe yourself and why?"}, {"date": "7 Feb 2023", "title": "Business Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Brock University (St. Catharines, ON)", "Interview Descriptions": "Panel interview with 4 people, they take turns in asking you questions. Overall a good interview, not too difficult, however I got a rejection email a few weeks latter though.", "Interview Questions": "What was the question asked"}, {"date": "26 Nov 2022", "title": "Associate Director Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Brock University (St. Catharines, ON) in Nov 2022", "Interview Descriptions": "I applied online and was contacted within the week. I had one online interview with a panel and questions were all behavioural. The entire process was less than 3 weeks.", "Interview Questions": "What is the best piece of constructive criticism that you have received in your career, and how have you incorporated it into your work life?"}, {"date": "29 May 2022", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 8 months. I interviewed at Brock University (St. Catharines, ON) in Sept 2021", "Interview Descriptions": "Not intimidating at all, interview went smooth I felt welcome and no pressure. I enjoyed the option of meeting online as this was during hybrid work it made the process and decision a lot easier", "Interview Questions": "Describe how your recent work experience would benefit you in this position "}, {"date": "7 Jun 2021", "title": "Camp Counselor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at Brock University", "Interview Descriptions": "The group interview level was very stressful but well organized. Individual interviews were a great experience. Male counselors have a better chance of being hired since there is always a lack of male counselors.", "Interview Questions": "Adapt a game for a camper with an exceptionality"}, {"date": "5 Jun 2021", "title": "Student Ambassador Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Brock University", "Interview Descriptions": "Interview went smoothly and questions were very straightforward. It was a group panel were students took turns answering questions via Microsoft teams. Prepare for basic questions in advance and you should be ready to go", "Interview Questions": "Why do you want to work here"}, {"date": "3 Jun 2021", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Brock University", "Interview Descriptions": "Very nice professor and very kind to help people out. You should tell professor why you want this work and be patient and polite. Even though I did not choose by the finalist, I still feel respect and encouragement.", "Interview Questions": "Behaviour questions and academic questions"}, {"date": "27 Nov 2021", "title": "Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Brock University (St. Catharines, ON) in Jun 2021", "Interview Descriptions": "Written assessment first then video interview \r\nThe supervisor is great. But the HR staff at the interview is not friendly. He basically declined to answer my question. \r\nThe whole process took a month from written assessment to offer", "Interview Questions": "Previous experience in creating programs "}], [{"date": "19 Mar 2021", "title": "Student Peer Mentor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Brock University", "Interview Descriptions": "Three interviewer, one program coordinator, one from student residence department, one current student peer mentor. They read questions from the list in turn and was writing notes the entire time.", "Interview Questions": "Mostly behavioral or situational like questions"}, {"date": "17 Dec 2019", "title": "Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Brock University", "Interview Descriptions": "There was no interview. Candidates were selected based on their academic qualifications only. It was required to have taken the course that was being taught and having at least a Master's degree.", "Interview Questions": "N/A"}, {"date": "10 Aug 2019", "title": "Recruitment Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Brock University (Saint Catharines, ON) in Jul 2019", "Interview Descriptions": "Took three weeks to hear from HR for an interview. Scheduled for a week out. Process was organized and efficient. People were very friendly. Asked 95% behavioural based questions that I was prepared for.", "Interview Questions": "tell us about a time when you were faced with a challenge"}, {"date": "23 Jul 2022", "title": "Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Brock University (St. Catharines, ON) in Nov 2018", "Interview Descriptions": "Screening call, then later they did mostly behaviour-based questions. They kept double checking to ensure you know the salary band. Pretty friendly overall. Always good to follow up with a thank you email.", "Interview Questions": "Describe a time when you had to make a challenging decision."}, {"date": "10 Jul 2018", "title": "Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. The process took 2 months. I interviewed at Brock University", "Interview Descriptions": "Human Resources called to schedule an interview and then completely ignores me for weeks. Unprofessional and lack of consideration from their Human Resources department. They made me wait so long that when I did receive a response I couldn’t bother to deal with such disorganized people.", "Interview Questions": "N/A"}, {"date": "23 Feb 2019", "title": "Researcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Brock University (St. Catharines, ON) in Sept 2017", "Interview Descriptions": "Describes what kind of thesis you would like to pursue. Asks about previous experiences; projects, jobs, and education. There is no technical kind of question, just questions purely related to thesis and the study.", "Interview Questions": "What of the three most interests you (followed by some thesis statements)? And why?"}, {"date": "17 Jan 2018", "title": "Data Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Brock University (St. Catharines, ON) in Jan 2017", "Interview Descriptions": "very formal interview and all questions are predictable. Also, the interviewer is very nice and patient and less technical questions. Furthermore, the supervisor give a full review of the project I am going  to engage in and  very concern about your work under minimum supervise", "Interview Questions": "why do you choose the position"}, {"date": "18 Sept 2017", "title": "Web Developer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Brock University (Saint Catharines, ON) in Jan 2016", "Interview Descriptions": "Easy, fun and conversational, went very fast, bosses are very kind, no behavioral questions, straight to the point, ask a lot of outside of work questions, like what's your fav sport or tv show", "Interview Questions": "What's your fav sport"}, {"date": "2 Dec 2015", "title": "Reference Librarian Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Brock University (Saint Catharines, ON)", "Interview Descriptions": "Interview was easy. Basic questions about yourself and your ability to do research, and work in a team. It was a panel type interview with 2 people from management. A lot of questions came from your information on your interview. Another question was based on your ability to keep current with subject matter material. Overall the interview was process was positive.", "Interview Questions": "What database do you most often refer to? How would you help a new student locate reference guides?"}, {"date": "3 Nov 2017", "title": "MD At BFIG Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Brock University (Saint Catharines, ON) in Apr 2015", "Interview Descriptions": "It was great. A lot of technical questions. You should have finance knowledge about portfolio management and some behavioural questions as well. Direction for the role and club, where do you see things going. Market talk and what's happening in the markets nowadays.", "Interview Questions": "Different valuation techniques?\r\nAlpha vs beta?\r\nSmall cap vs mid vs large cap?"}], [{"date": "17 Jan 2014", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Brock University", "Interview Descriptions": "Got the call for in-person interview within a week after the posting is closed. Panel interview. Answered 15-20 behavior and situational job related questions. Around an hour. Got the offer very quick in the same week.\r\n\r\nI don't think Brock ever had phone-interview. Most of them will be in-person interview. Higher level job will have the second interview plus presentation. While some union jobs will consider internal candidates FIRST/ONLY (depending on the level of the jobs, the job code usually give you a bit insights) --- Therefore, don't give up if you never received a call even if you think you are more qualified candidate, it might because they just simply could not use your resume...", "Interview Questions": "Not unexpected questions at this level of positions. Just need to study the job description a bit and related to your own experience.\r\nHow do you handle a fast path work environment when constant interruptions are incurred?"}, {"date": "20 Nov 2015", "title": "Career Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Brock University (Saint Catharines, ON) in Mar 2013", "Interview Descriptions": "The interview is focused on the following things:\r\n- Customer Service\r\n- Real Life Situations\r\n- Professionalism\r\n\r\nSince this job is focused on career consulting, many people think they want experience in resume editing and other skills directly relating to the job. As with many other jobs, that is not the case. They are looking for someone who is reliable, has a strong sense of customer service, and is team-focused rather than self centered,", "Interview Questions": "Describe a time when it  was difficult to provide customer service.\r\n\r\nIf you found yourself not very busy and with not much to do, what would you do?\r\n\r\nTell us about yourself\r\n\r\nWhy do you want to work here\r\n\r\nTell us about a time in the workplace when you did not see eye-to-eye with a co-worker. How did you resolve this?"}, {"date": "25 Sept 2017", "title": "Senior Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 5 weeks. I interviewed at Brock University (Saint Catharines, ON) in Jan 2013", "Interview Descriptions": "HR Behavioral interview followed by a technical test. The test contained some simple but logical use cases that I had to solve (basic math and logic is sufficient to crack it). The there is a panel interview where 3-4 people sitting on a round table will ask you many questions. Usually one question is cross-linked with the next one.", "Interview Questions": "Please tell us how will you explain statistical models to audiences who are not necessarily from quantitative background."}, {"date": "9 Nov 2015", "title": "Exam Invigilator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Brock University (St. Catharines, ON) in Aug 2011", "Interview Descriptions": "The interview process was very straightforward. I submitted my application after viewing the job posting online. Just over a week later I was called in to have a one-on-one interview. They mainly asked behavioural-based questions. About a week later I received the job offer and began working shortly afterwards.", "Interview Questions": "Tell me about a time you faced an ethical dilemma and how did you respond."}, {"date": "19 Nov 2015", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Brock University (Saint Catharines, ON) in May 2011", "Interview Descriptions": "apply internally using brock job board. internally network to obtain needed recommendation for the job. pre-screen done by brock hr. then professor interviews to complete the selection process. Professor does not say \"Yes\" or \"No\" for a good 10 days or more. Once he offers a job then it is conveyed through brock hr. i was not able to negotiate at all since they have a fixed budget and they had a pool of applicants to choose from.", "Interview Questions": "do you have experience teaching?"}]]