[[{"date": "8 Jun 2023", "title": "Tech Support Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Wichita State University (Wichita, KS)", "Interview Descriptions": "Interview was good and it’s not too difficult. Asked basic questions about technical support. Pay was decent too. There are two rounds for the interview. It all went smooth and good.", "Interview Questions": "Related Tech Support questions and related fields"}, {"date": "3 Apr 2023", "title": "Graphic Designer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 2 weeks. I interviewed at Wichita State University (Wichita, KS) in Aug 2022", "Interview Descriptions": "It was pretty simple only one round of interviews and they were pretty lenient on being able to find a time in which we could meet. The questions pertained to the job and nothing more.", "Interview Questions": "Q: What from of Design do your expertise in."}, {"date": "1 Mar 2022", "title": "Lab Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Wichita State University", "Interview Descriptions": "First had a Phone interview and then a Group interview which also had practical testing and Q&A session. Finally, an One to One interview with Dept Chair. After a week, I have been notified of the decision.", "Interview Questions": "All the electrical lab and Desktop support questions"}, {"date": "12 Dec 2021", "title": "Program Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Wichita State University", "Interview Descriptions": "FRIENDLY, SIMPLE AND EASY PROCESS. Quick response. Option to work remote or on site. Work is grant funded. No guarantee for permanent role after 4 years. I encourage others to apply.", "Interview Questions": "Why do you want to work for us?"}, {"date": "26 Feb 2021", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Wichita State University", "Interview Descriptions": "Quick interview for background knowledge checks, but mostly checking if the student would be a good fit with the team environment. Overall, a very friendly and welcoming interview. Did accept the position and worked until graduation. Highly recommend to build connections within school.", "Interview Questions": "How can my previous experience be used in the new team?"}, {"date": "30 Jun 2021", "title": "Academic Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Wichita State University in Dec 2020", "Interview Descriptions": "It was an easy application process online submitting resume and cover letter. After the submission deadline, I was offered a first round of interviews which was a 45min interview with the search committee.", "Interview Questions": "Tell us about yourself and why you want to work in this position."}, {"date": "17 Feb 2019", "title": "Adjunct Professor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Wichita State University (Wichita, KS) in Jan 2019", "Interview Descriptions": "The interview was telephonic, and with a board of the program director and two senior faculty.  It was useful to have the program charter, course catalog, and syllabi available online.", "Interview Questions": "Questions were based on relevant experience and interpretation of the program vision, mission and values.  Additional questions were administrative, such as commitment and availability, clarifying roles and responsibilities."}, {"date": "3 Aug 2018", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Wichita State University", "Interview Descriptions": "Resume submitted online and an interview conducted in the office with managers and director of the department. It was easy. Mostly the behavioral questions and previous work experiences and all. Overall it was good.", "Interview Questions": "How do you handle multitasking?"}, {"date": "8 Oct 2018", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Wichita State University (Wichita, KS) in Aug 2018", "Interview Descriptions": "Face to face plus a writing piece that allowed them to see your writing skills as well as submitting a porfolio that was viewed by the pannel. afterwards there was a group interview process with yourself and 5 staff memebers.", "Interview Questions": "What are your goals"}, {"date": "3 Aug 2017", "title": "Graduate Student Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Wichita State University", "Interview Descriptions": "I had earlier taken a class with the professor. When I showed my interest in the position, the professor told me to send my resume. A few days later, I was called take the offer letter and fill the required documents for the position.", "Interview Questions": "No questions, except I had done well in the previous classes with the professor"}], [{"date": "27 Sept 2019", "title": "Cadman Art Gallery Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Wichita State University (Wichita, KS) in Aug 2017", "Interview Descriptions": "after the application gets selected it will be a direct interview with the supervisor. As schedules, the interview will be taking place for around 40 minutes where all sort of personality and interpersonal questions would be asked.", "Interview Questions": "What motivates you to work for a gallery "}, {"date": "24 Sept 2018", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Wichita State University (Wichita, KS) in Jan 2017", "Interview Descriptions": "i applied online and got selected for face to face interview,they asked me why should we hire you and they asked me some questions about my past work experience, tell me about yourself.", "Interview Questions": "why do you think you will be a perfect fit for this position?"}, {"date": "15 Jun 2016", "title": "Education Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Wichita State University (Wichita, KS) in May 2016", "Interview Descriptions": "Applied online, took eight weeks to hear from anyone. When the hiring manager called and asked if I was still interested in the job, she sounded surprised when I said yes. A panel interview was scheduled for three weeks later. Questions were very basic: What are my strengths and weaknesses? Do I prefer to work alone or with people? Each panel member took a turn asking a question. \r\n\r\nAt the end of the interview I was told that the hiring manager would get back to me in two weeks with a decision. It's now five weeks later and I haven't heard anything. I assume I didn't get the job.", "Interview Questions": "How do you manage competing priorities?"}, {"date": "20 Apr 2016", "title": "Director of Student Services Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Wichita State University in Mar 2016", "Interview Descriptions": "the interview process was long and drawn out.  they asked irrelevant questions.  in fact, i thought to myself during the interview.  Who came up with these questions.  Nothing was asked about my leadership style.  nothing was asked about my past experience.  every question asked was a conceptual philosophical question.  it was a waste of time.  i thought to myself, I knew i would not get a call back.  it was a very frustrating process.", "Interview Questions": "if you experienced a conflict between diversity and excellence, how would you handle it"}, {"date": "30 Dec 2017", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 4 days. I interviewed at Wichita State University (Wichita, KS) in Jan 2016", "Interview Descriptions": "Two  Rounds, one Round was Technical and other is HR.Technical round by the current employees under the employer and HR was done by, Director of Library Technologies. Was not that difficult and wasnt that easy.", "Interview Questions": "What kind of technologies have you worked on."}, {"date": "20 Jun 2017", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Wichita State University (Wichita, KS) in Dec 2015", "Interview Descriptions": "I just spoke to the lecturers interested in having GTA.\r\nThey will annonce or you have to fill an application and submit to the deans office.\r\nIts easier if you have seniors leaving their position so you can fill it up.\r\nAlways always meet the professors , they can always help.", "Interview Questions": "Do you have knowledge in his research field?"}, {"date": "29 Dec 2015", "title": "Student Assistant IT Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Wichita State University (Wichita, KS) in Sept 2015", "Interview Descriptions": "Submitted CV. After review, got a call to let me know that I've been conceived an interview. Met the whole staff on that day, toured the facilities and got and explanation of what is to be expected from the position.", "Interview Questions": "What can you contribute to this place?"}, {"date": "2 Feb 2016", "title": "Senior Level Job Within President's Office Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Wichita State University (Wichita, KS) in Aug 2015", "Interview Descriptions": "Highly unorganized, unprofessional, silly and a waste of time.  Wichita State is a sinking ship who has hired some of the most incompetent people to work in leadership.  Their recent issue of the alumni magazine with the \"Team\" shows what a joke this group of people are.  Too bad they are doing it with such a great school and using taxpayer money to go unicorn hunting.", "Interview Questions": "Standard interview questions, obvious no one was listening."}, {"date": "23 Mar 2016", "title": "Staff Trainer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Wichita State University (Wichita, KS) in Jun 2015", "Interview Descriptions": "It took about 5 weeks from the time I submitted my application to the time they called, but I suppose that may be standard with Higher Ed.  First interview was 1.25 hour long phone interview.  They were thorough, but it really was conversational.  Next was an on campus interview - 4 there to interview me as a group.  They each turn asking situational questions.", "Interview Questions": "Near the end of the interview they surprised me by requesting that I go to the front of the classroom and \"teach\" them how to improve an existing document that they had created."}, {"date": "18 Sept 2017", "title": "Graphic Designer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Wichita State University (Wichita, KS) in Jun 2015", "Interview Descriptions": "After showing that I had training in graphic design, I was called up and showed my portfolio and interviewed with their full-time designer. We discussed the responsibilities of the job and how you would operate in the system. There was a short office tour and then it was over.", "Interview Questions": "How do you deal with a difficult client?"}], [{"date": "29 Nov 2016", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at Wichita State University (Wichita, KS) in May 2015", "Interview Descriptions": "I applied through an online recruitment process at WSU, then I got a call after 2-3 weeks for an interview. They took only 1 interview face to face and that's all.", "Interview Questions": "They asked me about the basics related to hardware and software and the other IT operations. You should know the installation procedures for printers, scanners, network drives, software and drivers, basic troubleshooting steps in case of network failure. The most important thing you have to face students and staff members daily to help and assist them in all their needs."}, {"date": "25 Oct 2015", "title": "Technician Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 5 days. I interviewed at Wichita State University in Apr 2015", "Interview Descriptions": "It was in an office, and sat on a chair. Then the person start questioning. It felt good and everything went smooth. The interviewer was friendly. I was not nervous about it.", "Interview Questions": "The person asked about my major and CGPA. Also, the knowledge about using the computer software such as MS Office."}, {"date": "27 Nov 2017", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Wichita State University (Wichita, KS) in Mar 2015", "Interview Descriptions": "Applied through Handshake and got an interview. They thoroughly compared my skills to the skills required for the job. They found me to be a match and wanted assurances on loyalty.", "Interview Questions": "Why should we hire you?"}, {"date": "4 Jan 2016", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Wichita State University (Wichita, KS) in Sept 2014", "Interview Descriptions": "The interview was pretty easy. Manager was a straight forward person looking for a person whose profile matches closely with the job description. Also, the manager was very friendly and cooperative. Their assessment about my resume was authentic. they posed quiet few number of technical questions and were satisfied by my qualifications.", "Interview Questions": "How do you fit for this job?"}, {"date": "18 Apr 2016", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Wichita State University (Wichita, KS) in Aug 2014", "Interview Descriptions": "It was kind of lengthy and it was regarding my work and my research work as a research assistant and it was technical regarding the production system , quality engineeringand stuff regarding my thesis work", "Interview Questions": "regarding my past experience"}, {"date": "17 Nov 2015", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Wichita State University (Wichita, KS) in Apr 2014", "Interview Descriptions": "I was actually asked to apply for the position because I knew the person hiring me.  I had taken one of their classes and had gotten to know them on a project.  I had a very informal interview and was told during the interview the pay and the expected schedule.  It was very laid back.", "Interview Questions": "Mostly they asked me about my previous position and then we talked about what would be expected on the job."}, {"date": "12 Mar 2014", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Wichita State University", "Interview Descriptions": "Two weeks", "Interview Questions": "What is your research background"}, {"date": "2 Nov 2015", "title": "Test Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Wichita State University (Wichita, KS) in Mar 2014", "Interview Descriptions": "Based on experience\r\nEasy for those with experience\r\nApply online listing all your skills and experience and try to convince the HR that you know what you are doing and with some references to back you.\r\nYour application will be reviewed and you will be called if you meet the requirements.", "Interview Questions": "What do you know about storage, networking and testing?"}, {"date": "27 Feb 2014", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Wichita State University", "Interview Descriptions": "Since I am graduate research assistant, I have interviewed with my supervisor first. After a few phone calls and discussions, I got the approval, then it is easy to be accepted to university and work as GRA.", "Interview Questions": "Some questions on your previous experience and resume. Nothing difficult."}, {"date": "29 Jun 2016", "title": "QA Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Wichita State University (Wichita, KS) in Jan 2014", "Interview Descriptions": "They go through basic screening and few questions about resume. They may ask you one or two technical questions like What is the difference between overloading and overriding? They told me to tell the result soon.\r\n\r\ninterview was scheduled with different person. They were not the same people in the confirmation email they sent. They asked all sort of situational questions like \"what are your strengths and weakness\" The third part is technical. There is where I learnt that the company is more inclined towards bookish knowledge. They may check my analytical skills. The interview is very very easy.", "Interview Questions": "They go through basic screening and few questions about resume. They may ask you one or two technical questions like What is the difference between overloading and overriding? They told me to tell the result soon.\r\n\r\ninterview was scheduled with different person. They were not the same people in the confirmation email they sent. They asked all sort of situational questions like \"what are your strengths and weakness\" The third part is technical. There is where I learnt that the company is more inclined towards bookish knowledge. They may check my analytical skills. The interview is very very easy."}], [{"date": "25 Aug 2015", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Wichita State University (Wichita, KS) in Jan 2014", "Interview Descriptions": "The hiring process mainly focused on your English speaking competency. If you are a graduate student, and have a good standing in your program, you can apply for a TA position in the department. Your English speaking skills will be evaluated by TOEFL speaking score or TSE score. The benchmark for both are respectively 23 and 50. In addition, prior knowledge of the subject is very important to get hired.", "Interview Questions": "Questions are mainly from the subject you will be teaching."}, {"date": "5 Dec 2014", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Wichita State University in Dec 2013", "Interview Descriptions": "The hiring process for a GTA is quite simple. You study hard and get a GPA of 3.6-4, you have a good chance to be considered for a GTA postion. It is made sure that the individual considered for this position has good knowledge in the subject that he/she is appointed as a GTA", "Interview Questions": "There would be no questionnaire. You would be appointed as a GTA if the Graduate adviser feels that you can handle the responsibilities efficiently by looking at your score in the subject that you are allotted."}, {"date": "28 Jul 2015", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 5 days. I interviewed at Wichita State University (Wichita, KS) in Nov 2013", "Interview Descriptions": "It was very easy they asked the basic questions to test my communication and confidence level. it went very smoothly. they verified my gpa and education level and did a baground check which was very easy and they asked me to comeby in few days which i did", "Interview Questions": "where did u work prior coming here"}, {"date": "30 Oct 2013", "title": "GRA Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Wichita State University", "Interview Descriptions": "submit resume, they call you, go to interview, easy", "Interview Questions": "N/A"}, {"date": "8 Sept 2015", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Wichita State University (Wichita, KS) in Aug 2013", "Interview Descriptions": "Depending on result and language competency, a student gets interviewed by experienced professionals before every semester starts. For different department, interview process is different. Supervisors try to explain the duties and responsibilities. Friendly environment for current students. Once someone gets the job, for next semesters students don't need to sit for another interview.", "Interview Questions": "What is the goal of your career?"}, {"date": "19 Jan 2016", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied in-person. I interviewed at Wichita State University (Wichita, KS) in Jul 2013", "Interview Descriptions": "Usually, professors arrange a meeting with the candidate, and it takes about 15-20 minutes. The candidate needs to keep in touch with the professor and convince him to arrange a meeting, where they can discuss research opportunities.", "Interview Questions": "What is your research interest? What is your GPA? What's your future plan?"}, {"date": "19 Jun 2013", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Wichita State University (Wichita, KS)", "Interview Descriptions": "I received very helpful information throughout the interview.  Calls into their HR dept were always met with the utmost customer service and care regarding my concerns.  I was given detailed information regarding the interview expectations, and was emailed at each transition point (phone interview, in-person, background check, sign-up process).", "Interview Questions": "What is your favorite movie and why? (No joke.  They wanted to see how i would react to be sure i was both professional and fun, it worked.)  All other questions were as expected.  The skills test was a bit unexpected (I actually had to perform tasks on the spot and present my rationalizations)."}, {"date": "31 Aug 2015", "title": "Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Wichita State University (Wichita Falls, TX) in Jan 2013", "Interview Descriptions": "Phone interview, after two weeks got an onsite interview and a couple of days after got an offer. The interview was really easy. They verify if you can perform all the duties and how well you can deal with different situations and escenarios.", "Interview Questions": "Mathematics questions, how can you deal with kids from different backgrounds."}, {"date": "18 May 2013", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at Wichita State University (Wichita, KS) in Dec 2012", "Interview Descriptions": "Asked about previous research experience; experience with statistical software", "Interview Questions": "How proficient with statistical software; Writing examples"}, {"date": "6 Oct 2013", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1+ week. I interviewed at Wichita State University (Wichita, KS) in Sept 2012", "Interview Descriptions": "Very short process.  I heard about the job through a student group I am a part of.  I went and got an application in person and applied.  About a week later I got a call to set up an interview.  The interview was brief and touched on very basic skills, reactionary questions.", "Interview Questions": "What skills do you have pertaining to running media equipment and how do you deal with malfunctions with the media."}], [{"date": "10 Feb 2013", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Wichita State University (Wichita, KS) in Apr 2009", "Interview Descriptions": "Usually a panel interview. Questions are situational. Will need to describe experience and how it relates to the position. Questions can actually sometimes be found on the website before showing for the interview. Wichita is very good at sticking the legal practices associated with hiring according to the local, state and federal laws.", "Interview Questions": "What makes you a great candidate for this position?"}, {"date": "12 May 2009", "title": "Web Developer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 1 week. I interviewed at Wichita State University (Wichita, KS) in Nov 2007", "Interview Descriptions": "The in-person interview consisted of many situational questions and work history related questions. Everyone seemed friendly and made me feel pretty open to answering.", "Interview Questions": "Have you ever been in a situation with a co-worker that made you uncomfortable and how did you deal with it?"}]]