[[{"date": "7 Feb 2023", "title": "Sales Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at The Children's Place Association", "Interview Descriptions": "Fair easy and basic. Looking for hard working people with good work ethic. They are all about opening up credit cards and rewards as well. Seem like. Great company and great extra benefits", "Interview Questions": "Availability, work experience,why the children's place"}, {"date": "16 Jan 2020", "title": "Development Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at The Children's Place Association (Chicago, IL) in Jul 2018", "Interview Descriptions": "Phone interview followed by in-person. Location is easy to get to, writing samples were requested. Full background check and drug test is done. There is also a requirement to give 3 refereo.", "Interview Questions": "Background in field of volunteer engagement."}, {"date": "9 Mar 2017", "title": "Social Work Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at The Children's Place Association (Chicago, IL) in Nov 2015", "Interview Descriptions": "Fairly straight forward interview process for the internship position. Focused on previous experience and how that could apply to the position, and also asked about future goals.  Interviewers were very warm and welcoming, and did a great job explaining the internship position and what would be expected. They also really focused on the population you would be working with and gave a tour of the location, so you could fully understand and prepare yourself for the work you would be doing with this vulnerable population and possibly stressful situation.", "Interview Questions": "Describe a situation in which a client (any age) was becoming disruptive and possibly aggressive.  How did you deescalate the situation and get the client to once again focus on the task?\r\n"}], []]