[[{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": 4, "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Good working environment", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "25 Mar 2023", "job_title": "Legal Advisor in Paris", "duration": "N/A", "pros": "People are friendly overall and no too much micromanagment by supervisors.", "cons": "Not much possibility of advancement and salary is too low for experience required."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "The only reason it is still standing is its name", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "24 May 2017", "job_title": "Desk Communications Officer in Paris", "duration": "N/A", "pros": "Gives you good place to experiment and build from scratch\r\n\r\nRelatively okay/good salary compared to your local salaries", "cons": "Maybe back in the day this organization meant something, but today calling it organization is over rated.\r\n\r\nYou need to be organized to be an organization.\r\n\r\nMSFF works in developed countries where they get away with plenty of discrimination local vs international.\r\n\r\nI was surprised how few knowledgeable international workers in this organization, and due to invisible wall the heads created between local vs international, the local workers are typically unproductive.\r\n\r\nI understand the salary difference between local vs international, but we are talking about treatment differences and difference in procedure for example if local worker screws up 200$ item he nearly gets fired, while the international worker can order an item for 1000$ and not use it and it ends up as dead weight and end of story.\r\n\r\nIf your local employer you will get sick from the unfair treatment.\r\n\r\nAlso if by any change you are local employer and want to fix things, they will hire and international manager to be your manager so he can get all the credit, and he wont learn what your doing or do any of it, he will be just your manager.\r\n\r\nAlso huge preference for France software  and France  everything made (legal money laundering) even if it was not in place or not the proper tool, they hire France team to work on macros for excel.\r\n\r\n2017 and they use EXCEL and MACROS and they have developer team in France for this.\r\n\r\nAll other tools are also mainly sources from France even if you live in country where french language is insignificant and not even close to secondary language but we have to use it and the main interface is in french\r\n\r\nYou will never be important in this organization no matter how hard you work if you are local nationality."}], [], []]