[[{"date": "16 Mar 2023", "title": "Career Advisor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at New York Institute of Technology in Nov 2022", "Interview Descriptions": "We meet on zoom with multiple directors from the career services department and they asked different questions regarding my background and gave time at the end for me to ask questions.", "Interview Questions": "You clearly have a great deal of business background but what do you know about career advising?"}, {"date": "17 Aug 2022", "title": "Director Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at New York Institute of Technology", "Interview Descriptions": "Went good and as expected for admissions. People were nice and moved quickly with the interview process. Went good and as expected for admissions. People were nice and moved quickly with the interview process", "Interview Questions": "The usual questions that is asked during an interview. "}, {"date": "10 Jun 2022", "title": "UX-UI Designer Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at New York Institute of Technology", "Interview Descriptions": "Very straight forward. 3 rounds. 2 case and 1 behavioral. 1 case is with upper management\r\n\r\nApplied and got an update about 3 weeks later. just be confident! interviewers were also very calm and polite", "Interview Questions": "q: how can the layout of a particular page affect accessibility"}, {"date": "7 May 2022", "title": "Admissions Advisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at New York Institute of Technology (Long Island City, NY)", "Interview Descriptions": "Several screening calls and interviews, all of which went well.  I was told I would be meeting with the highest executive.  I prepared for that level meeting.  I arrived and after a long wait found myself in a group interview: peer-level staff and myself.  I came away with the impression they already had selected someone.  I found by checking the portal I was rejected.  I eventually found an impersonal and poorly formatted email in my spam folder.", "Interview Questions": "\"Where do you see yourself in five years?\" - from someone who would be a colleague, not a supervisor.  "}, {"date": "17 Oct 2022", "title": "Social Work Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. I interviewed at New York Institute of Technology (New York, NY) in Mar 2022", "Interview Descriptions": "The interview process was very casual. They initially asked a couple of questions to break the ice and make me feel comfortable. Then, they asked questions related to your passion for social work and your past internship experiences.", "Interview Questions": "What clinical work have you done in the past?"}, {"date": "14 Aug 2021", "title": "Senior Research Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at New York Institute of Technology", "Interview Descriptions": "The interview process was broken into a cultural fit and technical interview that attempted to hone in on your personality and your technical abilities. It was not lengthy due to being concise and straight to the point.", "Interview Questions": "How would you handle a difficult person in a workplace. "}, {"date": "19 Nov 2020", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at New York Institute of Technology", "Interview Descriptions": "I had a phone screening with the manager of the School of Management. There were several questions asked about availability and soft and hard skills. The interview process wasn't too difficult, just make sure you're ready to schedule when they are available and learn to communicate.", "Interview Questions": "Questions regarding expertise, mainly data entry skills. Questions/ assessment to see capability of using programs such as Oracle and Microsoft Office"}, {"date": "23 Oct 2020", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at New York Institute of Technology", "Interview Descriptions": "Pretty easy process they ask questions regarding your major and then give you tasks to complete to prove your skill set. The interview isn't that looking either but some employers may have multiple steps as mine did.", "Interview Questions": "Why would you like this position."}, {"date": "30 Jun 2021", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at New York Institute of Technology (New York, NY) in Sept 2020", "Interview Descriptions": "It was online and very easygoing. I was asked a few extremely easy questions. I was comfortable answering in the interview and the interviewer was very helpful as well while providing information about the job role.", "Interview Questions": "Tell me about yourself and what do you take interest in?"}, {"date": "27 Jan 2020", "title": "Assistant Registrar Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at New York Institute of Technology", "Interview Descriptions": "The whole interview process happened fairly quickly. HR surprised me with an on-the-spot phone interview. About a week later, I was moved into the second round with the supervisor and then a third interview with the registrar. I was then offered a position about 2 hours after final interview.", "Interview Questions": "Tell me about yourself.\r\nWhat are your greatest/weakest strengths?\r\nScenario questions. "}], [{"date": "3 Feb 2023", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at New York Institute of Technology in Jan 2020", "Interview Descriptions": "It was get picked up based on GPA and interaction with faculty and students. We will get credits for the hours that we are participating in the research. We can get to know more about the project as well.", "Interview Questions": "Based on the resume we need to explain the clarification"}, {"date": "2 Sept 2020", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at New York Institute of Technology (New York, NY) in Jan 2020", "Interview Descriptions": "The interview was basically based on the behavior and responsibility was to be assigned according to it. I got a result in a day.  I got an interview with a referral.", "Interview Questions": "what are your availability Hours?"}, {"date": "15 Dec 2021", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at New York Institute of Technology (New York, NY) in Jan 2020", "Interview Descriptions": "The interview process was very efficient and the organization communicated clearly and in a professional manner. The process was fairly quick, from application submission to hire took about ten days.", "Interview Questions": "What skills do you plan to bring to this role?"}, {"date": "24 May 2021", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at New York Institute of Technology (Old Westbury, NY) in Jan 2020", "Interview Descriptions": "Sending resumes to the Faculty of your department or you can contact your advisor who can help in finding some opportunities for you.\nIf they find your skills and projects match. They email you or call you for an interview. Then", "Interview Questions": "Completely based on your skills"}, {"date": "9 Oct 2019", "title": "Anatomy Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at New York Institute of Technology (Old Westbury, NY)", "Interview Descriptions": "The process was easy and straightforward. All of the interviewers were welcoming and seemed very excited about this position. They gave me a tour and were very proud of NYIT and the department. Most interview processes take some time, but they were very good at keeping in contact with me for the duration of the application process.", "Interview Questions": "I don't remember the specific question, but they asked if there were any research project I'd like to start or assist with in my free time. "}, {"date": "17 Jan 2023", "title": "Assistant Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at New York Institute of Technology in Jul 2019", "Interview Descriptions": "Very informal and collegiate and offered the job on the spot but no mention of salary or benefits . I was of course, grateful for the job and should have asked more detail. But they took me under their wings and really made me feel at home.", "Interview Questions": "Experience , credentials, communication skills and teaching style"}, {"date": "27 Feb 2020", "title": "Research Assistant Professor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at New York Institute of Technology (New York, NY) in Feb 2019", "Interview Descriptions": "The process was well organized, and the school has a great atmosphere. Teaching is emphasized. Great faculty, most were very friendly. The school is in a good area, although a bit far from NYC, the traffic is pretty bad.", "Interview Questions": "Teaching pedagogy"}, {"date": "5 Jun 2020", "title": "Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at New York Institute of Technology (New York, NY) in Jan 2019", "Interview Descriptions": "It was average. As long as you have a good GPA and done well in the previous semester, you will be fine. You have to be more specific when they ask you a broad question.", "Interview Questions": "What makes you a good tutor?"}, {"date": "10 Jan 2022", "title": "IT Helpdesk Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at New York Institute of Technology in Jan 2018", "Interview Descriptions": "During the interview process I was asked why subnets are created and what the 3 ip classes are. Questions also involved around troubleshooting computers and customer service questions . The interview process was very easy.", "Interview Questions": "N/A"}, {"date": "4 Dec 2020", "title": "Assistant Media Service Technical Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at New York Institute of Technology (New York, NY) in Jan 2018", "Interview Descriptions": "Fast and Efficient. It was done promptly which was great for the overall experience. There were no hiccups or anything as well, which meant that it was a smooth process.", "Interview Questions": "Why did you apply to this position and how can it help with what you are studying?"}], [{"date": "8 Nov 2017", "title": "Workshop Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at New York Institute of Technology (New York, NY) in Oct 2017", "Interview Descriptions": "Really casual and friendly environment. HR will reach out on behalf of the director and the interview was quite informal - more of a chat. The interview was held in the space in the manhattan campus and it has a very new space in it that has brand new machines that have been barely used. The shop is small and missing a few key stationary equipment, but it is a great facility. The people who work there seem friendly and down to earth.", "Interview Questions": "Are you familiar with the machines here?"}, {"date": "24 Jul 2017", "title": "Admissions Advisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at New York Institute of Technology (Old Westbury, NY)", "Interview Descriptions": "The first interview was via Skype, and was very relaxed. The second was in person on the Old Westbury campus, and they were not very prepared for the interview. It only lasted about 40 minutes. This was one month ago and they have not contacted me one way or the other. I assume the position has been filled, but it is VERY unprofessional to not follow up with applicants, especially those you have interviewed twice. Bad business.", "Interview Questions": "\"Sell us on NYIT\""}, {"date": "7 Jul 2017", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at New York Institute of Technology", "Interview Descriptions": "You just apply the position to the supervisor of the department which you intent to apply. He or she will arrange an interview for you. Once you passed the interview, you will get the job.", "Interview Questions": "What will you do if there is a conflict between professor and student."}, {"date": "21 Sept 2017", "title": "Head Resident Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at New York Institute of Technology (New York, NY) in Aug 2016", "Interview Descriptions": "The hiring process was relatively quick after the interview. The interview allowed me to express myself and to let the interviewer know who i was. The interviewer was looking for people that had the gift of patience and understanding to deal with the position .", "Interview Questions": "why are you applying here?"}, {"date": "22 Aug 2017", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. I interviewed at New York Institute of Technology (New York, NY) in Apr 2016", "Interview Descriptions": "Easy interview process. according to the time availability of you. good quality interview. Technical knowledge properly gets tested. Project was on haptic devices and it was also somewhat related to machine learning and information security. Professors who took my interview were very polite.", "Interview Questions": "Questions on data structure, algorithms, cybersecurity and cryptography."}, {"date": "19 Aug 2016", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at New York Institute of Technology (Old Westbury, NY) in Mar 2016", "Interview Descriptions": "The interview process was short easy, the supervisor introduced himself and asked me to introduce my self, took me around the work place and explained me what I will be working on,introduced to other team members.", "Interview Questions": "Tell me something about your previous experiences and introduce yourself?"}, {"date": "12 Sept 2017", "title": "GA Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at New York Institute of Technology (New York, NY) in Jan 2016", "Interview Descriptions": "Write java program to find any number between 1 and n that can be expressed as the sum of two cubes in two (or more) different ways. Write a program to check if a number is Mersenne number or not", "Interview Questions": "N/A"}, {"date": "18 Sept 2015", "title": "Professional Position Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at New York Institute of Technology (New York, NY)", "Interview Descriptions": "Had 3 interviews - phone screening with HR, 1 in-person interview with 2 members of department and then another in-person interview with the hiring committee.  I was one of 2 finalists for the position and after having 3 interviews with them, 2 in-person they were not professional enough to inform me that they offered the position to the other finalist. I DIDN'T even get a form letter or email saying \"Thank you but we choose another candidate.\" This shows their COMPLETE LACK OF PROFESSIONALISM.  If you have someone come in for 2 in-person interviews, each lasting over an hour then at least have the courtesy to inform them that they were not selected for the position.  The only way I found out that I was not chosen for the position was by looking at their web site and seeing the new employee listed under the title I interviewed for.", "Interview Questions": "When can you start working"}, {"date": "16 Nov 2017", "title": "Student Ambassador Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 5 days. I interviewed at New York Institute of Technology (New York, NY) in Sept 2015", "Interview Descriptions": "The interview was fairly simple. I was invited during free hour to sit with a member of staff, later to be my supervisor, to as me how I'm doing in school and how will I balance working and studying at the same time. No tough questions, basically a chat before the role was offered.", "Interview Questions": "Have you worked in a professional environment before?"}, {"date": "9 Aug 2019", "title": "Adjunct Faculty Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at New York Institute of Technology (New York, NY) in Jul 2015", "Interview Descriptions": "It was a brief phone interview with the Senior ESL Specialist. I was asked about my previous experience and had to provide answers on how I dealt with challenging situations in the classroom. This was followed by a brief opportunity for me to ask. questions about the program and the students.", "Interview Questions": "Describe your experience in the classroom."}], [{"date": "7 Aug 2017", "title": "Driver Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at New York Institute of Technology (Old Westbury, NY) in Apr 2015", "Interview Descriptions": "Brief Interview. Interviewers vary depending on what jobs they have filled or empty at the time. I've seen a subordinate interview candidates to be their boss. I met with the HR representative and the Director of Campus Dining.", "Interview Questions": "What experiences do you have that make you a good fit for this position?"}, {"date": "7 Apr 2015", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at New York Institute of Technology (New York, NY) in Mar 2015", "Interview Descriptions": "I emailed HR my resume after viewing the opening on a job post. HR called me less than a week later for a short phone interview. The interview took less than 10 minutes, not to mention the HR employee was over a half hour late to call me for the phone screening. There were no interview questions other than \"how much do you make?\" Literally no questions about my background. Just \"what is your current salary?\" The HR person kept pressuring me to reveal my salary, which is highly unprofessional. In fact, after specifically stating that my current employer does not allow us to reveal salaries the NYIT HR person rudely asked \"are you really not going to tell me your salary?\" They were clearly screening applicants based only on salary requirements. The reviews on Glassdoor were right; NYIT is interested in keeping salaries low and not hiring based on quality. Bad first impression from a reputable college.", "Interview Questions": "How much do you make?"}, {"date": "15 Mar 2015", "title": "Technical Support Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at New York Institute of Technology (New York, NY) in Mar 2015", "Interview Descriptions": "Interview process was in two phases:\r\nPhase 1 : Phone interview ; it was pretty casual asking about Education history,academic projects and the ongoing Project.\r\n\r\nPhase 2 : Assesement Exam ; divided into 4 sections . 10 questions in 2 min , Math questions ,logical questions and coding.\r\nCoding was mainly on algorithms and datastructures\r\nSuch as \" given a string all permutation of the string but  uppercase letters and special characters dont move.", "Interview Questions": "About the academic project"}, {"date": "17 Feb 2016", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at New York Institute of Technology (New York, NY) in Feb 2015", "Interview Descriptions": "It was great.I got a call from my supervisor to interview with her .She asked very basic questions from 'Tell me about yourself to strengths and weaknesses.And right away i got selected.She handed me my offer letter and i got my SSN .", "Interview Questions": "They asked me about my Strengths and weakness"}, {"date": "24 Feb 2017", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at New York Institute of Technology (Old Westbury, NY) in Jan 2015", "Interview Descriptions": "Very tough to get job interview but once you get to the interview phase, it gets very easy and they make you feel very comfortable. Fe professors are especially a treat to work with. Very amiable work environment", "Interview Questions": "How long can I commit myself to the post"}, {"date": "9 Jun 2014", "title": "Assistant Professor Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at New York Institute of Technology", "Interview Descriptions": "relatively easy process compared to some other academic interviews i've been on. initially a phone screening which was straightforward, then an invitation to meet the personnel committee on campus in old westbury. this consisted of a panel meeting with seven or so members of the personnel team, as well as a one on one with the dean.", "Interview Questions": "nothing out of the ordinary"}, {"date": "15 Apr 2016", "title": "Graduate Student Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 days. I interviewed at New York Institute of Technology (New York, NY) in May 2014", "Interview Descriptions": "Upload your resume\r\nThe professors ask you questions based on knowledge you got\r\nThe professor give you details on the research and try to see how you can fit in.\r\nIf they Find you interesting and you can bring in new ides to the research they definitely give you some reference paper to read and then next day ask you question on that if you able to satisfy them your hired.", "Interview Questions": "What language you know in computers?"}, {"date": "26 Jan 2014", "title": "Assistant Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at New York Institute of Technology", "Interview Descriptions": "The interview process starts informally, either with service as an adjunct or through a connection into the department you're interested in. A series of interviews will follow, generally 2 or 3, usually one with the dean of the school in person, perhaps one over the phone, and another with the hiring committee (4-8 full-time professors). It helps greatly if you have taught as an adjunct and performed significant university service already.", "Interview Questions": "I was asked how my assignments, which were slightly unorthodox in nature, reflected the demands of real-world, professional experience for the students."}, {"date": "20 Sept 2017", "title": "Associate Instructor of English Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at New York Institute of Technology (Old Westbury, NY) in Aug 2013", "Interview Descriptions": "Very straightforward, met with several people in the main office and talked about my writing experience and what I wanted to bring to the classroom.  Met with three people, and it lasted for about 2 hours.", "Interview Questions": "How I would handle less cooperative students."}, {"date": "5 Sept 2017", "title": "Assistant to the Vice President of Student Affairs Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at New York Institute of Technology (Old Westbury, NY) in Aug 2013", "Interview Descriptions": "The interview (August 2013) was basically a whole day affair (6 hours) with various offices and higher-ups from the university. It was terrible to find out from multiple people throughout the day that there was already an internal candidate primed for the job.  Wasted a whole day.", "Interview Questions": "Why should you be hired?"}], [{"date": "17 Feb 2016", "title": "Graduate Student Research Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at New York Institute of Technology (New York, NY) in Aug 2012", "Interview Descriptions": "i Applied online. The process didnt take long time. everything was online. luckily I got into a friendly environment. A lot of international students. We had an orientation as a group. That was a good experience", "Interview Questions": "What is your major"}, {"date": "5 Jan 2014", "title": "Adjunct Assistant Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 3 days. I interviewed at New York Institute of Technology (New York, NY) in Jan 2012", "Interview Descriptions": "I was recommended by a colleague and had several years of teaching experience. The interview was simple and straight forward. The department chair just wanted to meet me in person before offering me a position.", "Interview Questions": "N/A"}]][[{"date": "16 Mar 2023", "title": "Career Advisor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at New York Institute of Technology in Nov 2022", "Interview Descriptions": "We meet on zoom with multiple directors from the career services department and they asked different questions regarding my background and gave time at the end for me to ask questions.", "Interview Questions": "You clearly have a great deal of business background but what do you know about career advising?"}, {"date": "17 Aug 2022", "title": "Director Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at New York Institute of Technology", "Interview Descriptions": "Went good and as expected for admissions. People were nice and moved quickly with the interview process. Went good and as expected for admissions. People were nice and moved quickly with the interview process", "Interview Questions": "The usual questions that is asked during an interview. "}, {"date": "10 Jun 2022", "title": "UX-UI Designer Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at New York Institute of Technology", "Interview Descriptions": "Very straight forward. 3 rounds. 2 case and 1 behavioral. 1 case is with upper management\r\n\r\nApplied and got an update about 3 weeks later. just be confident! interviewers were also very calm and polite", "Interview Questions": "q: how can the layout of a particular page affect accessibility"}, {"date": "7 May 2022", "title": "Admissions Advisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at New York Institute of Technology (Long Island City, NY)", "Interview Descriptions": "Several screening calls and interviews, all of which went well.  I was told I would be meeting with the highest executive.  I prepared for that level meeting.  I arrived and after a long wait found myself in a group interview: peer-level staff and myself.  I came away with the impression they already had selected someone.  I found by checking the portal I was rejected.  I eventually found an impersonal and poorly formatted email in my spam folder.", "Interview Questions": "\"Where do you see yourself in five years?\" - from someone who would be a colleague, not a supervisor.  "}, {"date": "17 Oct 2022", "title": "Social Work Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. I interviewed at New York Institute of Technology (New York, NY) in Mar 2022", "Interview Descriptions": "The interview process was very casual. They initially asked a couple of questions to break the ice and make me feel comfortable. Then, they asked questions related to your passion for social work and your past internship experiences.", "Interview Questions": "What clinical work have you done in the past?"}, {"date": "14 Aug 2021", "title": "Senior Research Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at New York Institute of Technology", "Interview Descriptions": "The interview process was broken into a cultural fit and technical interview that attempted to hone in on your personality and your technical abilities. It was not lengthy due to being concise and straight to the point.", "Interview Questions": "How would you handle a difficult person in a workplace. "}, {"date": "19 Nov 2020", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at New York Institute of Technology", "Interview Descriptions": "I had a phone screening with the manager of the School of Management. There were several questions asked about availability and soft and hard skills. The interview process wasn't too difficult, just make sure you're ready to schedule when they are available and learn to communicate.", "Interview Questions": "Questions regarding expertise, mainly data entry skills. Questions/ assessment to see capability of using programs such as Oracle and Microsoft Office"}, {"date": "23 Oct 2020", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at New York Institute of Technology", "Interview Descriptions": "Pretty easy process they ask questions regarding your major and then give you tasks to complete to prove your skill set. The interview isn't that looking either but some employers may have multiple steps as mine did.", "Interview Questions": "Why would you like this position."}, {"date": "30 Jun 2021", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at New York Institute of Technology (New York, NY) in Sept 2020", "Interview Descriptions": "It was online and very easygoing. I was asked a few extremely easy questions. I was comfortable answering in the interview and the interviewer was very helpful as well while providing information about the job role.", "Interview Questions": "Tell me about yourself and what do you take interest in?"}, {"date": "27 Jan 2020", "title": "Assistant Registrar Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at New York Institute of Technology", "Interview Descriptions": "The whole interview process happened fairly quickly. HR surprised me with an on-the-spot phone interview. About a week later, I was moved into the second round with the supervisor and then a third interview with the registrar. I was then offered a position about 2 hours after final interview.", "Interview Questions": "Tell me about yourself.\r\nWhat are your greatest/weakest strengths?\r\nScenario questions. "}], [{"date": "3 Feb 2023", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at New York Institute of Technology in Jan 2020", "Interview Descriptions": "It was get picked up based on GPA and interaction with faculty and students. We will get credits for the hours that we are participating in the research. We can get to know more about the project as well.", "Interview Questions": "Based on the resume we need to explain the clarification"}, {"date": "2 Sept 2020", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at New York Institute of Technology (New York, NY) in Jan 2020", "Interview Descriptions": "The interview was basically based on the behavior and responsibility was to be assigned according to it. I got a result in a day.  I got an interview with a referral.", "Interview Questions": "what are your availability Hours?"}, {"date": "15 Dec 2021", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at New York Institute of Technology (New York, NY) in Jan 2020", "Interview Descriptions": "The interview process was very efficient and the organization communicated clearly and in a professional manner. The process was fairly quick, from application submission to hire took about ten days.", "Interview Questions": "What skills do you plan to bring to this role?"}, {"date": "24 May 2021", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at New York Institute of Technology (Old Westbury, NY) in Jan 2020", "Interview Descriptions": "Sending resumes to the Faculty of your department or you can contact your advisor who can help in finding some opportunities for you.\nIf they find your skills and projects match. They email you or call you for an interview. Then", "Interview Questions": "Completely based on your skills"}, {"date": "9 Oct 2019", "title": "Anatomy Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at New York Institute of Technology (Old Westbury, NY)", "Interview Descriptions": "The process was easy and straightforward. All of the interviewers were welcoming and seemed very excited about this position. They gave me a tour and were very proud of NYIT and the department. Most interview processes take some time, but they were very good at keeping in contact with me for the duration of the application process.", "Interview Questions": "I don't remember the specific question, but they asked if there were any research project I'd like to start or assist with in my free time. "}, {"date": "17 Jan 2023", "title": "Assistant Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at New York Institute of Technology in Jul 2019", "Interview Descriptions": "Very informal and collegiate and offered the job on the spot but no mention of salary or benefits . I was of course, grateful for the job and should have asked more detail. But they took me under their wings and really made me feel at home.", "Interview Questions": "Experience , credentials, communication skills and teaching style"}, {"date": "27 Feb 2020", "title": "Research Assistant Professor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at New York Institute of Technology (New York, NY) in Feb 2019", "Interview Descriptions": "The process was well organized, and the school has a great atmosphere. Teaching is emphasized. Great faculty, most were very friendly. The school is in a good area, although a bit far from NYC, the traffic is pretty bad.", "Interview Questions": "Teaching pedagogy"}, {"date": "5 Jun 2020", "title": "Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at New York Institute of Technology (New York, NY) in Jan 2019", "Interview Descriptions": "It was average. As long as you have a good GPA and done well in the previous semester, you will be fine. You have to be more specific when they ask you a broad question.", "Interview Questions": "What makes you a good tutor?"}, {"date": "10 Jan 2022", "title": "IT Helpdesk Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at New York Institute of Technology in Jan 2018", "Interview Descriptions": "During the interview process I was asked why subnets are created and what the 3 ip classes are. Questions also involved around troubleshooting computers and customer service questions . The interview process was very easy.", "Interview Questions": "N/A"}, {"date": "4 Dec 2020", "title": "Assistant Media Service Technical Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at New York Institute of Technology (New York, NY) in Jan 2018", "Interview Descriptions": "Fast and Efficient. It was done promptly which was great for the overall experience. There were no hiccups or anything as well, which meant that it was a smooth process.", "Interview Questions": "Why did you apply to this position and how can it help with what you are studying?"}], [{"date": "8 Nov 2017", "title": "Workshop Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at New York Institute of Technology (New York, NY) in Oct 2017", "Interview Descriptions": "Really casual and friendly environment. HR will reach out on behalf of the director and the interview was quite informal - more of a chat. The interview was held in the space in the manhattan campus and it has a very new space in it that has brand new machines that have been barely used. The shop is small and missing a few key stationary equipment, but it is a great facility. The people who work there seem friendly and down to earth.", "Interview Questions": "Are you familiar with the machines here?"}, {"date": "24 Jul 2017", "title": "Admissions Advisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at New York Institute of Technology (Old Westbury, NY)", "Interview Descriptions": "The first interview was via Skype, and was very relaxed. The second was in person on the Old Westbury campus, and they were not very prepared for the interview. It only lasted about 40 minutes. This was one month ago and they have not contacted me one way or the other. I assume the position has been filled, but it is VERY unprofessional to not follow up with applicants, especially those you have interviewed twice. Bad business.", "Interview Questions": "\"Sell us on NYIT\""}, {"date": "7 Jul 2017", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at New York Institute of Technology", "Interview Descriptions": "You just apply the position to the supervisor of the department which you intent to apply. He or she will arrange an interview for you. Once you passed the interview, you will get the job.", "Interview Questions": "What will you do if there is a conflict between professor and student."}, {"date": "21 Sept 2017", "title": "Head Resident Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at New York Institute of Technology (New York, NY) in Aug 2016", "Interview Descriptions": "The hiring process was relatively quick after the interview. The interview allowed me to express myself and to let the interviewer know who i was. The interviewer was looking for people that had the gift of patience and understanding to deal with the position .", "Interview Questions": "why are you applying here?"}, {"date": "22 Aug 2017", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. I interviewed at New York Institute of Technology (New York, NY) in Apr 2016", "Interview Descriptions": "Easy interview process. according to the time availability of you. good quality interview. Technical knowledge properly gets tested. Project was on haptic devices and it was also somewhat related to machine learning and information security. Professors who took my interview were very polite.", "Interview Questions": "Questions on data structure, algorithms, cybersecurity and cryptography."}, {"date": "19 Aug 2016", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at New York Institute of Technology (Old Westbury, NY) in Mar 2016", "Interview Descriptions": "The interview process was short easy, the supervisor introduced himself and asked me to introduce my self, took me around the work place and explained me what I will be working on,introduced to other team members.", "Interview Questions": "Tell me something about your previous experiences and introduce yourself?"}, {"date": "12 Sept 2017", "title": "GA Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at New York Institute of Technology (New York, NY) in Jan 2016", "Interview Descriptions": "Write java program to find any number between 1 and n that can be expressed as the sum of two cubes in two (or more) different ways. Write a program to check if a number is Mersenne number or not", "Interview Questions": "N/A"}, {"date": "18 Sept 2015", "title": "Professional Position Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at New York Institute of Technology (New York, NY)", "Interview Descriptions": "Had 3 interviews - phone screening with HR, 1 in-person interview with 2 members of department and then another in-person interview with the hiring committee.  I was one of 2 finalists for the position and after having 3 interviews with them, 2 in-person they were not professional enough to inform me that they offered the position to the other finalist. I DIDN'T even get a form letter or email saying \"Thank you but we choose another candidate.\" This shows their COMPLETE LACK OF PROFESSIONALISM.  If you have someone come in for 2 in-person interviews, each lasting over an hour then at least have the courtesy to inform them that they were not selected for the position.  The only way I found out that I was not chosen for the position was by looking at their web site and seeing the new employee listed under the title I interviewed for.", "Interview Questions": "When can you start working"}, {"date": "16 Nov 2017", "title": "Student Ambassador Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 5 days. I interviewed at New York Institute of Technology (New York, NY) in Sept 2015", "Interview Descriptions": "The interview was fairly simple. I was invited during free hour to sit with a member of staff, later to be my supervisor, to as me how I'm doing in school and how will I balance working and studying at the same time. No tough questions, basically a chat before the role was offered.", "Interview Questions": "Have you worked in a professional environment before?"}, {"date": "9 Aug 2019", "title": "Adjunct Faculty Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at New York Institute of Technology (New York, NY) in Jul 2015", "Interview Descriptions": "It was a brief phone interview with the Senior ESL Specialist. I was asked about my previous experience and had to provide answers on how I dealt with challenging situations in the classroom. This was followed by a brief opportunity for me to ask. questions about the program and the students.", "Interview Questions": "Describe your experience in the classroom."}], [{"date": "7 Aug 2017", "title": "Driver Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at New York Institute of Technology (Old Westbury, NY) in Apr 2015", "Interview Descriptions": "Brief Interview. Interviewers vary depending on what jobs they have filled or empty at the time. I've seen a subordinate interview candidates to be their boss. I met with the HR representative and the Director of Campus Dining.", "Interview Questions": "What experiences do you have that make you a good fit for this position?"}, {"date": "7 Apr 2015", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at New York Institute of Technology (New York, NY) in Mar 2015", "Interview Descriptions": "I emailed HR my resume after viewing the opening on a job post. HR called me less than a week later for a short phone interview. The interview took less than 10 minutes, not to mention the HR employee was over a half hour late to call me for the phone screening. There were no interview questions other than \"how much do you make?\" Literally no questions about my background. Just \"what is your current salary?\" The HR person kept pressuring me to reveal my salary, which is highly unprofessional. In fact, after specifically stating that my current employer does not allow us to reveal salaries the NYIT HR person rudely asked \"are you really not going to tell me your salary?\" They were clearly screening applicants based only on salary requirements. The reviews on Glassdoor were right; NYIT is interested in keeping salaries low and not hiring based on quality. Bad first impression from a reputable college.", "Interview Questions": "How much do you make?"}, {"date": "15 Mar 2015", "title": "Technical Support Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at New York Institute of Technology (New York, NY) in Mar 2015", "Interview Descriptions": "Interview process was in two phases:\r\nPhase 1 : Phone interview ; it was pretty casual asking about Education history,academic projects and the ongoing Project.\r\n\r\nPhase 2 : Assesement Exam ; divided into 4 sections . 10 questions in 2 min , Math questions ,logical questions and coding.\r\nCoding was mainly on algorithms and datastructures\r\nSuch as \" given a string all permutation of the string but  uppercase letters and special characters dont move.", "Interview Questions": "About the academic project"}, {"date": "17 Feb 2016", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at New York Institute of Technology (New York, NY) in Feb 2015", "Interview Descriptions": "It was great.I got a call from my supervisor to interview with her .She asked very basic questions from 'Tell me about yourself to strengths and weaknesses.And right away i got selected.She handed me my offer letter and i got my SSN .", "Interview Questions": "They asked me about my Strengths and weakness"}, {"date": "24 Feb 2017", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at New York Institute of Technology (Old Westbury, NY) in Jan 2015", "Interview Descriptions": "Very tough to get job interview but once you get to the interview phase, it gets very easy and they make you feel very comfortable. Fe professors are especially a treat to work with. Very amiable work environment", "Interview Questions": "How long can I commit myself to the post"}, {"date": "9 Jun 2014", "title": "Assistant Professor Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at New York Institute of Technology", "Interview Descriptions": "relatively easy process compared to some other academic interviews i've been on. initially a phone screening which was straightforward, then an invitation to meet the personnel committee on campus in old westbury. this consisted of a panel meeting with seven or so members of the personnel team, as well as a one on one with the dean.", "Interview Questions": "nothing out of the ordinary"}, {"date": "15 Apr 2016", "title": "Graduate Student Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 days. I interviewed at New York Institute of Technology (New York, NY) in May 2014", "Interview Descriptions": "Upload your resume\r\nThe professors ask you questions based on knowledge you got\r\nThe professor give you details on the research and try to see how you can fit in.\r\nIf they Find you interesting and you can bring in new ides to the research they definitely give you some reference paper to read and then next day ask you question on that if you able to satisfy them your hired.", "Interview Questions": "What language you know in computers?"}, {"date": "26 Jan 2014", "title": "Assistant Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at New York Institute of Technology", "Interview Descriptions": "The interview process starts informally, either with service as an adjunct or through a connection into the department you're interested in. A series of interviews will follow, generally 2 or 3, usually one with the dean of the school in person, perhaps one over the phone, and another with the hiring committee (4-8 full-time professors). It helps greatly if you have taught as an adjunct and performed significant university service already.", "Interview Questions": "I was asked how my assignments, which were slightly unorthodox in nature, reflected the demands of real-world, professional experience for the students."}, {"date": "20 Sept 2017", "title": "Associate Instructor of English Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at New York Institute of Technology (Old Westbury, NY) in Aug 2013", "Interview Descriptions": "Very straightforward, met with several people in the main office and talked about my writing experience and what I wanted to bring to the classroom.  Met with three people, and it lasted for about 2 hours.", "Interview Questions": "How I would handle less cooperative students."}, {"date": "5 Sept 2017", "title": "Assistant to the Vice President of Student Affairs Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at New York Institute of Technology (Old Westbury, NY) in Aug 2013", "Interview Descriptions": "The interview (August 2013) was basically a whole day affair (6 hours) with various offices and higher-ups from the university. It was terrible to find out from multiple people throughout the day that there was already an internal candidate primed for the job.  Wasted a whole day.", "Interview Questions": "Why should you be hired?"}], [{"date": "17 Feb 2016", "title": "Graduate Student Research Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at New York Institute of Technology (New York, NY) in Aug 2012", "Interview Descriptions": "i Applied online. The process didnt take long time. everything was online. luckily I got into a friendly environment. A lot of international students. We had an orientation as a group. That was a good experience", "Interview Questions": "What is your major"}, {"date": "5 Jan 2014", "title": "Adjunct Assistant Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 3 days. I interviewed at New York Institute of Technology (New York, NY) in Jan 2012", "Interview Descriptions": "I was recommended by a colleague and had several years of teaching experience. The interview was simple and straight forward. The department chair just wanted to meet me in person before offering me a position.", "Interview Questions": "N/A"}]]