[[{"date": "7 Mar 2023", "title": "Phlebotomist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Vitalant", "Interview Descriptions": "No transparency , needing a lot of documentation to proceed, sends you to a different location upon hiring. Don’t expect to work where you’re hired. Overall kind of weird process , seems like they aren’t telling you the full story", "Interview Questions": "I don’t know the usual stuff"}, {"date": "17 Jun 2022", "title": "Customer Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Vitalant (Baton Rouge, LA) in Jun 2022", "Interview Descriptions": "This was just the phone screening. They set up a time and I called them at the given time. They asked me several questions about my job experience and if I had my own computer. We went over the requirements and salary for the job.", "Interview Questions": "How many years of customer service experience do you have?"}, {"date": "17 Feb 2023", "title": "Lab Technician II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Vitalant in Mar 2022", "Interview Descriptions": "I was interviewing for a position in the manufacturing lab and I must say, it was one of the hardest interviews I’ve had. As long as you know your previous positions in depth and are able to talk about your stengths, you’ll be fine.", "Interview Questions": "What is one of the most important attributes to have in an employee and why?"}, {"date": "19 Feb 2022", "title": "Sourcing Manager Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Vitalant (Columbus, OH) in Feb 2022", "Interview Descriptions": "Very Straight Forward Interview.  Very past job experience focused instead of the underdeveloped recruiter style of questions like \"Tell me a time when\". However, ultimately this company was very unattactive to me from a benefits and compensation point of view. Most expensive benefit package I've encountered so far combined with an insulting low-ball salary offer (40K below the other 3 offers I was considering for the same role / same location). Combine that with their less than 3% \"merit\" based raise structure and I would be taking a pay cut every single year I worked there after Cost of Living / Inflation. When asked about this, they bluntly stated that this is their intentional plan because they are non-profit. Definitely not a career company for anyone with any intelligence in financial planning.", "Interview Questions": "Really just wanted to calibrate my experience with stakeholder influencing. Oddly... they didn't seem to care much about negotiation skills for a procurement role. "}, {"date": "17 Jan 2022", "title": "Encargado Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Vitalant", "Interview Descriptions": "muy profesionales. Aguardando llamado. todo muy organizado y rapido. Aunque el proceso tiene mas instancias de lo normal . El lugar tambien muy lindo todo. Los de seguridad unos piolas tambien. Ojala me llamen pronto, me gustaria brindar mis conocimientos a la empresa y mi grupo de trabajo.", "Interview Questions": "Experiencia laboral en negro es decir conocimientos adquiridos"}, {"date": "9 Jan 2022", "title": "Scientist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Vitalant", "Interview Descriptions": "The interview process took less than a month. I  first  had a phone call with the manager, then was invited for in person meeting with leaders ( pre-Covid). Received offer the next day", "Interview Questions": "where do you see yourself in 5 years?"}, {"date": "20 Jun 2022", "title": "Procurement Manager Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Vitalant (Phoenix, AZ) in Jan 2022", "Interview Descriptions": "Long process involving 5 different interviews with mostly repetitive questions. HR is very agile but when it comes to department folks the process is painfully slow. There is no tasks to complete but you are asked odd questions that you would not know the answers to unless you have already worked for them.", "Interview Questions": "Describe the best procurement process that applies to our business needs."}, {"date": "6 Jul 2021", "title": "Certified Phlebotomist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Vitalant (Tempe, AZ) in May 2021", "Interview Descriptions": "Reviewed the company profile as well as job responsibilities and what would be needed from the candidate. Ask for past work examples as well as education. Asked about problem solving and stressful situations. Asked about customer service and other related healthcare situations situations situations", "Interview Questions": "How would you handle a stressful situation"}, {"date": "19 Jun 2021", "title": "Asst. Supervisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Vitalant (Denver, CO) in Mar 2021", "Interview Descriptions": "At first I received a call screening. And then I was called in for an additional in-person interview. It was a small panel interview/style, between two people. They took turns reading off specific questions that pertained to the position.", "Interview Questions": "Describe qualities that you believe consist of someone being a good leader."}], [{"date": "6 Jan 2021", "title": "Phlebotomist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Vitalant (Las Vegas, NV) in Jan 2021", "Interview Descriptions": "Great! Lots of questions. Very nice people. They described what the job duties were as well as the pay. I answered the questions to the best of my abilities. They had other candidates to review so no offer just yet.", "Interview Questions": "What does quality mean to you?"}, {"date": "7 Dec 2020", "title": "Donor Outreach Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Vitalant", "Interview Descriptions": "Just got hired ! The interview was via zoom.  The questions were customer service related.  As well as questions regarding empathy and patience. the recruiter made me feel very comfortable", "Interview Questions": "Tell me about a time where you had to smooth over a difficult situation you were in."}, {"date": "24 Nov 2020", "title": "Blood Donor Phlebotomist Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Vitalant (Brisbane, CA) in Nov 2020", "Interview Descriptions": "Apply online , they call back and set interview time, in person interview, phone call second interview, no update until now ! They didn’t give me any update , even I message and email 2 times and ask about the result and they reply and said we will reach you out as soon as we have the selected candidates !", "Interview Questions": "What do you do if your manager say something that you are not agree? What do you do if son of your co workers do some work procedures wrong ?"}, {"date": "30 Sept 2020", "title": "Marketing Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "The process took 3 weeks. I interviewed at Vitalant (New York, NY)", "Interview Descriptions": "Overall, it was a rather enjoyable interviewing experience. It's just unfortunate that they never responded back to me after they confirmed they would be in touch very soon, twice.\nI was first reached out to by their internal recruiter via email and then talked with him over the phone two times.\nThen I spoke with the hiring leader for about an hour and it was also a very pleasant experience. She ended the conversation saying they would be in touch very soon, realistically by the end of that week or early the following week.\nI followed up with her later that week to thank her for her time again and she replied back right away and said they would be in touch very soon.\nWhen I didn't hear back by the end of the following week, I reached out to the recruiter again and never heard anything from him unfortunately.\n\nMy overall takeaway was that they seem like a very strong company, that is looking to have a greater impact on the community, however, their HR team should probably improve their communication skills when searching for potential employees.", "Interview Questions": "What previous experience would help you succeed in this role?"}, {"date": "24 Sept 2020", "title": "Development Director Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Vitalant (Pittsburgh, PA) in Sept 2020", "Interview Descriptions": "Vitalant's HR team has designed a great process for applying and interviewing.  The HR recruiter was very succinct, upfront with details, and timely with updates.  Lex T. was awesome.", "Interview Questions": "Please tell me about your overall experience in this field (fundraising)?"}, {"date": "26 Sept 2020", "title": "Hospital Systems II Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Vitalant (Lubbock, TX) in Sept 2020", "Interview Descriptions": "The interview was very in depth however it felt more like a conversation rather than an interview. I actually really enjoyed it. The person who interviewed me made me feel at ease even though the questions were difficult at times. There are also a series of yes/no questions", "Interview Questions": "What would my previous employer say about me"}, {"date": "17 Nov 2020", "title": "Registered Phlebotomist Technician Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Vitalant (Montvale, NJ) in Jul 2020", "Interview Descriptions": "Not long, pretty easy, two step process, phone call first then in person interview, drug test and background check, overall not bad, very nice and understanding co workers and staff, overall great", "Interview Questions": "Would I be able to drive around New Jersey "}, {"date": "14 Aug 2020", "title": "Marketing Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Vitalant (Scottsdale, AZ) in Jul 2019", "Interview Descriptions": "The prescreen person was lacking personality and sense of humor.    They could not answer any quesitons and sounded like a robot-werido.  After that everything was okay.  Hope I get the job.", "Interview Questions": "Why should we hire you."}, {"date": "5 Jun 2019", "title": "Donor Services Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at Vitalant (Rosemont, IL) in May 2019", "Interview Descriptions": "2 person interview. Tag team,  after asking me about scenarios. They asked me did I have any questions Caucasian lady continue looking at me over the rim of her glasses and then turn and look at the African American woman. I asked the African American woman what about the benefits she goes what about the benefits lol.  a Caucasian woman that's what I believe she's asking as what kind of benefits we have as if I was stupid. Throughout the interview I was looking at my purse and looking at the door I wanted to walk out of there. Every question I asked besides the benefits they had no answers for me\r\n\r\nthis was the absolute worst interview I ever had in my life I kind of wish I would have.", "Interview Questions": "Scenarios "}, {"date": "22 Apr 2019", "title": "Laboratory Technician II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Vitalant", "Interview Descriptions": "Interview process was very professional.  They asked a series of questions and my background experience relative to lab work.  Excellent place to gain laboratory experience.   The hirees were very kind professional and answered my questions thoroughly and with detail!", "Interview Questions": "How would you assemble a chair, if divided into separate parts? "}], [{"date": "5 Mar 2019", "title": "Human Resources Generalist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Vitalant (New York, NY)", "Interview Descriptions": "Applied online and was contacted by Corp. Recruiter.\r\nInterview  #1 Spoke with Recruiter, very nice interview.\r\nInterview #2 unscheduled, was  contacted by Director of HR in Denver,  spoke about 20 minutes and was invited to face to face interview following week.\r\nInterview #3 met with HR team, group interview, you know tell me about you rself type of questions. Interview was average until I asked another hr team member the  about iso trainings and was promptly told that she was hit hard like  a \"fire hose shoved down her throat\".  Okay, but its mandatory necessary training .  Isn't it important for proper training  when dealing with controlled substances along with good to  know what other employees should go through as well.  Very uncomfortable hearing this comment from HR. \r\nInterview #4 asked to speak with a remote hr team member, nice person and nice  interview but at this point I'm already feeling not good about working with the other hr team member.\r\nInterview #5 with Corporate HR Director, okay I'll speak with  her but at this point I am really not interested in working for a business that has poor reviews and high turnovers along with working with a grumpy  hr team member with a negative attitude.\r\nAfter 5 interviews I was told they would contact me the following week,  many weeks later, nothing but being ghosted.\r\nThanks but no thanks if this is how HR treats other HR members!", "Interview Questions": "Give us a reason why we should hire you?"}, {"date": "28 Mar 2019", "title": "Mobile Phlebotomist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Vitalant (Aurora, CO) in Mar 2019", "Interview Descriptions": "Over 1 hour long interview with 2 interviewers. They were very thorough and direct with questioning. Great screening process.  Ask questions regarding attendance, availability, flexibility, potential for overtime, and physical requirements for the position.", "Interview Questions": "Asked many questions based on former customer service and teamwork experiences."}, {"date": "27 Feb 2019", "title": "Medical Laboratory Technician Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Vitalant (Pittsburgh, PA) in Feb 2019", "Interview Descriptions": "It was a phone interview after uploading my resume for a nonspecific position.   The recruiter called me almost immediately (within 24 hours) and asked to set up a time to talk.  I think they outsource their recruiting - she was from another state and seemed pretty clueless about both the position and my resume.  She was overtly aggressive throughout the interview, like she herself desperately needed to get the position filled even though she had no connections to the lab whatsoever.  She kept getting herself confused.  As the interview went on and it became obvious the position wasn't going to work for either of us (it didn't align with my schedule), she became a little upset.  Very sloppy and unprofessional, to be honest.", "Interview Questions": "What is your job history for the last seven years?"}, {"date": "20 Jul 2021", "title": "Donor Recruitment Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Vitalant (Lafayette, LA) in Jan 2019", "Interview Descriptions": "Very informative and welcoming. The team was very engaged and looked forward to working with me. Did two interviews and both were enjoyable. The team was highly informative and intrigued.", "Interview Questions": "What do you know about this company?"}, {"date": "14 Dec 2020", "title": "Phlebotomist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Vitalant (Denver, CO) in Nov 2018", "Interview Descriptions": "It was very simple. I was interviewed by two people who asked me a series of behavioral questions. The interview lasted for about 30 mins, and I heard back from them within a few days with an offer which I accepted.", "Interview Questions": "Tell me about a time that you had to lead?"}, {"date": "15 Nov 2019", "title": "Donor Relations Specialist Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Vitalant (Jacksonville, FL) in Nov 2018", "Interview Descriptions": "I had an interview and then followed up with the person who interviewed me twice.  I never got a response from the employer.  I followed up again and then got a response from HR with little information.", "Interview Questions": "How well do you handle a fast paced, every changing environment? "}, {"date": "8 Dec 2018", "title": "Clinical Lab Specialist Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at Vitalant (Tempe, AZ) in Sept 2018", "Interview Descriptions": "Basic interview questions. Why you want to work with us.  You are interviewed by three people. Each has general questions then they get into patient care and why it is important to you. These questions can be tricky.", "Interview Questions": "What  is one of the biggest hurdles you had to overcome?"}, {"date": "7 Nov 2021", "title": "Sales Representative Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Vitalant (Phoenix, AZ) in Jul 2017", "Interview Descriptions": "Phone, video-then a face to face with several people at the final.  Not much else to add just prepare as normal.  Know something about the blood industry... Look at the website for Pete's sake.", "Interview Questions": "Knowledge question mostly, nothing out of the ordinary"}, {"date": "21 Mar 2017", "title": "Mobile Account Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Vitalant (Spokane, WA) in Jan 2017", "Interview Descriptions": "I applied via the Blood Systems site, then received a phone call about two weeks later to discuss the position, the pay, etc., and a formal in-person interview was set up for the following week. At the interview, I arrived a few minutes early and ended up waiting for a good 15 minutes. I met with someone from HR and the person who would have been my manager. We discussed the position in depth, and I asked questions which turned into a solid 50-minute conversation. I thought we were almost done, until they started reading from a two-page list of questions, many of which were redundant based on what we had just talked about. This position was actually a bit underneath my experience level (it was entry level and I have 5+ years of related experience) and the pay was 45% less than what I was currently making, but I was looking for something new and thought this could be a foot in the door. While the interviewers were friendly, my would-be manager actually blatantly offended my experience with one of her comments stating \"This position with us is clearly so much more involved than what you have been doing in your current role at XYZ.\" It was rude, presumptuous and made it abundantly clear that she wasn't listening to a word I had been saying about my experience, or that she had even read my career documents. The position also did not allow any overtime, but required you to meet sales quotas. When I brought up the concern of wanting to meet goals but needing to cap my hours, they seemed to think \"I would figure it out\", and I couldn't help but see it as potentially being set up for failure. The next step in the process was going to be a formal 10-minute presentation in front of a room full of people, which seemed extremely excessive for an entry-level position at that offered pay. The interview lasted nearly 2 hours, and I followed up and told them it would not be a good fit. Most of my negative experiences came from the manager in the room. The HR gal was very nice, personable, and engaging.", "Interview Questions": "If you are at a donor event and someone who is giving blood gets sick and other donors start getting anxious, what would you do?"}, {"date": "14 Dec 2014", "title": "Job Coach Interview", "results": "Declined Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Vitalant", "Interview Descriptions": "the interview is pretty standard a 12 year old could get hired. there are 15 questions pertaining to customer service and your previous experience with other customer service jobs, you are being hired to convince people to make another appointment for a blood donation, kinda sales like.", "Interview Questions": "how would you motivate your team to make goal"}], [{"date": "2 Aug 2013", "title": "Clinical Laboratory Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Vitalant (Tempe, AZ)", "Interview Descriptions": "I was hired over a phone interview from out of state.", "Interview Questions": "None were really difficult that I remember."}, {"date": "5 Oct 2015", "title": "Quality Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Vitalant (Scottsdale, AZ) in May 2011", "Interview Descriptions": "Typical interview.  There was a one-on-one with the hiring manager and then group interview with other managers and vice president. They each interviewed themselves and started asking questions about my experience.", "Interview Questions": "Do you have Trackwise experience?"}, {"date": "29 Sept 2015", "title": "Patient Registration Clerk Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 months. I interviewed at Vitalant (Sacaton, AZ) in Jan 2011", "Interview Descriptions": "It was done by a 5 person. First the interview process was explained to me and if I had any questions about the process. Then the introductions of everyone on the panel started they included their name, what their position was at GRHC, and how long they were employeed.  The panel then asked me to introduce myself. After this they started rotating and asking questions.  While being asked a question the others would write/score my response if, one had a follow up question or wanted to know more in depth information they would ask. When all the questions were done I was asked if I had any questions. Then the interview was done.", "Interview Questions": "What was my knowledge of Gila River Indian Community?"}, {"date": "19 Feb 2014", "title": "Network Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Vitalant in Aug 2010", "Interview Descriptions": "I had 2 interviews, an initial screening interview followed by a more detailed network engineering interview. Interview was conducted by the department director and manager.", "Interview Questions": "Nothing terribly difficult, specific questions were asked on routing and switch configurations, industry standards, past experience, and detailed discussions on past accomplishments."}]]