[[{"date": "31 May 2023", "title": "Project Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Samaritan's Purse (Boone, NC)", "Interview Descriptions": "Lengthy and very slow to respond. I had 11 interviews over 4 months and was down to the final two candidates. I got an automated email that I was declined offer.", "Interview Questions": "What is your experience with overseas project management?"}, {"date": "22 Mar 2023", "title": "Global Intern Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Samaritan's Purse", "Interview Descriptions": "Video interview, then ministry fit interview. Understandably not a lot of clear information about the exact role because every global internship looks different depending on location and skillset. You will be asked a lot of personal questions about faith because of the nature of the position.", "Interview Questions": "How has your relationship with the Lord grown in the last year?"}, {"date": "16 Sept 2022", "title": "Disaster Program Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Samaritan's Purse", "Interview Descriptions": "I was not used to doing a self video interview. they have you do that first before you ever talk to a human being.. I was not used to that so it was difficult.", "Interview Questions": "About my relationship with Jesus ."}, {"date": "13 Sept 2022", "title": "Customer Service Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Samaritan's Purse (Coppell, TX) in Sept 2022", "Interview Descriptions": "I loved and appreciated the genuine Faith in Jesus Christ based interviewing process that allowed one to express their faith experience and glorify GOD. \n\nThank You all at Samaritan's Purse again", "Interview Questions": "Honesty and Faith based questions"}, {"date": "30 Jun 2022", "title": "GIS Analyst Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Samaritan's Purse", "Interview Descriptions": "Very detailed and well organized.  Happy with entire process.  Met with various levels of management and felt very confident in the working environment.  Probably one of the best interviewing processes I have gone to.", "Interview Questions": "What do you think is your best job skill."}, {"date": "1 Jun 2022", "title": "Media Relations Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Samaritan's Purse", "Interview Descriptions": "Very long for a low paying job. Many different rounds and it took a while to hear back. I feel as though i had ample time to consider as did the company.", "Interview Questions": "Name some of your qualifications "}, {"date": "16 Apr 2022", "title": "RN for the Transition to Practice Program Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Samaritan's Purse (Boone, NC) in Mar 2022", "Interview Descriptions": "I was interviewed on Spark Hire.  I did not hear anything for 3 weeks.  When, I did hear back, I was told that they were not interested because I did not have any International Missions experience.  I am disappointed since I am highly qualified and was willing to receive training.  There are stateside opportunities that could be a good learning experience for those that have a willingness to learn and serve.", "Interview Questions": "Q: Can you describe how you would lead someone to Christ?"}, {"date": "25 Jan 2022", "title": "International Apprentice Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Samaritan's Purse", "Interview Descriptions": "I experienced a horrible interview process where my interviewer showed up 30-40min late to our meeting and then only had 20min to interview me. It wasn't professional and I felt like the communication throughout the process could have been more clear and timely.", "Interview Questions": "Asked about my faith, experience and why I would be interested in Samaritan's Purse. "}, {"date": "22 Nov 2022", "title": "Mobilizer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 8 weeks. I interviewed at Samaritan's Purse (Atlanta, GA) in Dec 2021", "Interview Descriptions": "Very extensive. I went through at least 5 interviews with various leadership, managers, volunteers, and teams. The first interview was a video response with no one on the other end, just me recording my answers. Several of the interviews included crossovers with people I had already interviewed with.", "Interview Questions": "How do you plan to connect with volunteers across your region?"}, {"date": "4 Mar 2022", "title": "GSOC Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Samaritan's Purse (Boone, NC) in Dec 2021", "Interview Descriptions": "By video via the Sparkhire service. It was a odd to sit and talked quietly to my computer in response to the questions. I was allowed only one attempt to answer and the time was capped at 2 minutes.", "Interview Questions": "What people groups or region of the world are of special concern to you?"}], [{"date": "30 Oct 2021", "title": "Trainer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Samaritan's Purse", "Interview Descriptions": "It was a spark hire, phone interview and day-long in-person interview. The in-person included panel interviews, one-on-ones and HR closing. I spoke with the hiring manager, leaders, SMEs  and others. It was a tiring day, but great to meet all the teams. It was a wonderful experience.", "Interview Questions": "What is your past experience?"}, {"date": "3 Nov 2021", "title": "Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Samaritan's Purse", "Interview Descriptions": "The interview process was lengthy and repetitive.  Little interest in the actual skills of the candidate. They focused more on assessing if the candidate will comply with their philosophy and mechanisms.", "Interview Questions": "Why did you apply to this position?"}, {"date": "7 Oct 2021", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Samaritan's Purse", "Interview Descriptions": "The first interview was a ministry interview with HR. The second interview was a panel interview with three people of varying levels that I would potentially work with in this role.", "Interview Questions": "Your background is more in line with another department. Why are you interested in this role & department?"}, {"date": "21 Sept 2021", "title": "Project Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Samaritan's Purse in Sept 2021", "Interview Descriptions": "While I appreciated the thorough nature of the interview process, it is exhaustive, repetitive, and borderline invasive. The company moves you through a pipeline of recorded video interviews,  several phone interviews, in-person interviews, zoom interviews. It seems that the company eliminates candidates as they assessed if the candidate aligns with their values and mission.  However, the interviews feel invasive because top executives asked questions about personal beliefs and practices outside of the workplace. This also raises questions about the company culture and top-down approach to leadership. They were more concerned about my theological convictions and less concerned about my professional skills.", "Interview Questions": "1.  What do you believe about spiritual warfare? \n\n2. What do you believe about LGBTQ issues? \n"}, {"date": "24 Aug 2021", "title": "Information and Communication Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Samaritan's Purse", "Interview Descriptions": "The organization contacted me after 3 weeks to complete a pre-interview questionnaire prior to the formal interview. The questionnaire was 6 questions long and asked about the mission, job description and salary expectations.", "Interview Questions": "What part of the mission stands out to you?"}, {"date": "2 Aug 2021", "title": "Finance Supervisor Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Samaritan's Purse (Aden)", "Interview Descriptions": "Personal Interview \nThat start with HR Questions ( Personal Info- Strength -Motivation and about INGOs)\n\n then technical questions ( Job task, CV, senators)\n\nand finaly team and motivation Questions. ( team managements- Conflicts sensors- motivation for work- work with managers)\n\nabout relatives and Salaries expectation", "Interview Questions": "Tell me about your self?\n"}, {"date": "22 Dec 2021", "title": "Human Resources Recruiter Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Samaritan's Purse in Aug 2021", "Interview Descriptions": "Had theee interviews. First was a prescreen by phone to determine if values and beliefs were in line with that of the ministry. Next interview was a one way, video interview which led to two more interviews which were conversational in nature, yet exciting", "Interview Questions": "Marriage and same gender beliefs, value of life and how God views these things according to my beluefs"}, {"date": "14 Jun 2021", "title": "Intern Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Samaritan's Purse", "Interview Descriptions": "Went through three different interviews. Initial interview was through an app and 2 different phone calls.  The interviewer was very friendly. Ask basic interview questions and also your views and values as a Christian", "Interview Questions": "What would you bring to our team?"}, {"date": "18 Apr 2021", "title": "Logistics Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Samaritan's Purse", "Interview Descriptions": "Cared a lot about your Christian values. Asked you to describe the gospel. Didn’t ask too much about professional skills. They are very conservative and Christian so know that going in.", "Interview Questions": "If you drink alcohol or not"}, {"date": "23 Apr 2021", "title": "Regional Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Samaritan's Purse in Mar 2021", "Interview Descriptions": "After half a dozen interviews and an investment of nearly 20 hours, 4 of which were travel, I am told my skills are not a good fit. I am unclear why it took 6 interviews with multiple people to tease this out.", "Interview Questions": "Why should we give e you this position?"}], [{"date": "14 Jul 2021", "title": "Intern Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Samaritan's Purse in Mar 2021", "Interview Descriptions": "The interview process took place over four stages - beginning with a simple, pre-recorded set of questions and progressing to a call with the Director of the program. The team was warm, courteous, and extremely professional. Communication channels were regularly renewed.", "Interview Questions": "What is your personal conviction regarding the Gospel?"}, {"date": "15 Jan 2021", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Samaritan's Purse", "Interview Descriptions": "Submitted a standard application with resume.  2 weeks later i was contacted to submit a video interview.  I got the questions before hand, then had to record my answers in under a minute using only 3 takes per question.  I had to use sparkhire for the video interview.  A few weeks later I was contacted to schedule a phone interview.", "Interview Questions": "What are your interests and what do you like to do in your free time?\r\n\r\nIf someone were to ask you ‘What is the Gospel?’ how would you respond?\r\nJesus gives us a model of being a humble servant, how do you practice this example in your daily life? \r\nWhat question would you have wanted to have been asked to express yourself better?"}, {"date": "3 Jan 2021", "title": "Corporate Security Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Samaritan's Purse", "Interview Descriptions": "One way video interview. 8 questions. You were given a set amount of time to think about question, respond and 1-2 retakes. A variety of applicable questions. Was not stressful.", "Interview Questions": "What interests you about working for Samaritan’s Purse"}, {"date": "10 Mar 2023", "title": "Finance Director Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Samaritan's Purse in Nov 2020", "Interview Descriptions": "Initial one-way questions, about five. questions relevant to the job Then Phone interview which is concerned about one's religious faith and commitment to Christianity. They send through email, specific areas that are covered in the interview. This makes it easy to prepare accordingly.", "Interview Questions": "How to conduct financial analysis, How to be an effective team leader, What to do when confronted with a fraudulent employee, Benefits of a diverse workforce,"}, {"date": "30 Oct 2020", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Samaritan's Purse", "Interview Descriptions": "The process was easy and laid back. I would recommend to find a comfortable setting with little to no distraction. Record you answers clearly and with enthusiasm. I am waiting to hear back since the video recording.", "Interview Questions": "Faith based and hands on knowledge. "}, {"date": "24 Sept 2020", "title": "Global Security Operations Center Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Samaritan's Purse", "Interview Descriptions": "The interview was very fair and easy. A little odd recording yourself answering questions, but after a couple questions in a was able to get comfortable.  I was provided with two opportunities to record myself for each question.", "Interview Questions": "Bring someone to know the Lord. "}, {"date": "13 Sept 2020", "title": "Recruiter Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Samaritan's Purse", "Interview Descriptions": "Uncomfortable and unprofessional... said they would get back with me on a decision but never did. Asked you uncomfortable questions that made you feel like you had to compromise your own beliefs for a job. If this was not a non-profit  Christian organization, these questions would raise huge red flags", "Interview Questions": "Are you pro life or pro choice?\r\nWhat are your views on pre-marital sex?\r\nWhat experiences make you feel you will do well in this position?"}, {"date": "14 Aug 2020", "title": "Supervisor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Samaritan's Purse", "Interview Descriptions": "I was interviewing, but the interviewer kept making excuses for the company and asking if I really wanted to pursue this. I should have taken the hint. I was the one trying to talk about technical approaches.", "Interview Questions": "Can you handle living in Boone NC?"}, {"date": "13 Aug 2020", "title": "Leadership Development Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Samaritan's Purse (Houston, TX) in Aug 2020", "Interview Descriptions": "I only participated in the First round - video interview.  I do not know what happens afterward as I was not selected to move forward with the company.  I do not have anything further to state.", "Interview Questions": "Why is God calling me to work for Operation Christmas Child?\n\n"}, {"date": "11 Jul 2020", "title": "Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Samaritan's Purse", "Interview Descriptions": "The interview process began with a video interview where they asked multiple questions about the position. Then I had an extensive phone interview where they asked about my background information and beliefs.", "Interview Questions": "Why would you like to work here?"}], [{"date": "29 Apr 2020", "title": "Graphic Design Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Samaritan's Purse", "Interview Descriptions": "There were three separate interviews that I had to take with 3 different people. One of them was actually a video that I had to record myself answering the questions", "Interview Questions": "About my hardest time"}, {"date": "13 Apr 2020", "title": "Project Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Samaritan's Purse", "Interview Descriptions": "Process took over three months, had about 8 interviews in total. I made it to the final rounds but was not chosen. Overall, communication was not the greatest and was ultimately declined through an automated email.", "Interview Questions": "How do you handle tedious, detail oriented work? "}, {"date": "13 Mar 2020", "title": "Regional Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 8 weeks. I interviewed at Samaritan's Purse (Calgary, AB) in Feb 2020", "Interview Descriptions": "I was referred by a friend and contacted by HR relatively quickly (few days). They did a phone interview, which was encouraging as it started off with prayer. I was then asked to come in for an interview the next day at the Calgary office with the HR personnel and the manager. Again, started the interview with prayer and then went through the exact same questions as the phone interview, and then some behavioural/situational questions. I felt the interview went very well and I feel like they're genuine in wanting everyone to do well. \r\nI was disappointed that they told me they'd call me the week after, but didn't. It's unfortunate they didn't follow through with their word on keeping me updated. i had to email for updates and finally got a phone call saying they had an internal candidate.", "Interview Questions": "Tell me about your faith."}, {"date": "23 Sept 2020", "title": "Summer Internship Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Samaritan's Purse (Virginia Beach, VA) in Dec 2019", "Interview Descriptions": "I only got to the first round of interviews but that first round involved me recording myself answering questions that they asked me. It had me record videos of myself answering 5 question and I did not get to retake these videos. I have a friend who just went through this process and she said that now you get more than one chance at recording the videos.", "Interview Questions": "What do you like to do on your free time?"}, {"date": "10 Feb 2020", "title": "Apprentice Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Samaritan's Purse (New York, NY) in Dec 2019", "Interview Descriptions": "I wasn't hired. In fact, the position was cancelled without explanation.  It was a computer interview. It contains some ngeneral questions. After the interview, an email was sent to me, saying the position was cancelled.", "Interview Questions": "What is your strength?"}, {"date": "18 Nov 2019", "title": "Ebola Health and Nutrition Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Samaritan's Purse (Nairobi) in Nov 2019", "Interview Descriptions": "Warmly and interesting. The Power of aligning to Godly Principles. I was made wanted by the recruiter and I hope for the best moving forward. The interview was so focused", "Interview Questions": "Mostly about my life, family and career. And How I feel about working for the organization, and my strength and weaknesses.  "}, {"date": "23 Feb 2019", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 4 months. I interviewed at Samaritan's Purse", "Interview Descriptions": "You will go through several rounds of an application process -- the first being short and strictly your resume and a few short answer. Following will usually be and few phone calls and then potentially a skype call. Then you will hear if you are chosen.", "Interview Questions": "What was the last thing you read in the Bible?"}, {"date": "21 Feb 2020", "title": "Communications Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 4 months. I interviewed at Samaritan's Purse (Los Angeles, CA) in Feb 2019", "Interview Descriptions": "I applied for the Internship in December, and received my offer in March. The interview process started with a One-Way Sparkhire interview, then a phone interview, a Skype interview, and finally the call with my offer. The hiring team is extremely nice, and the interview process was very manageable. There was quite a few lulls in communication during interviews, which was a little stressful at times. Overall, it was a good experience!", "Interview Questions": "Teach me something I don't know in 60 seconds."}, {"date": "5 Oct 2021", "title": "Program Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Samaritan's Purse (Hastings-on-Hudson, NY) in Feb 2019", "Interview Descriptions": "It is quite extensive.\n\nThe first stage is through Spark hire. Then that is followed by a written test and sometimes a Ministry fit interview.\n\nThe Spark hire interview takes around30-45 mins and ranges from Ministry fit to Technical knowledge. It takes 2 weeks to get feedback.", "Interview Questions": "Please tell us why you are fit for this position."}, {"date": "22 Sept 2020", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "The process took 1 day. I interviewed at Samaritan's Purse (London, OH) in Feb 2019", "Interview Descriptions": "Great it was really fantastic I loved it there was so many lovely people the coffee was excellent and I went to the shop and drank some milk before and bought some fruit and I was a little mad but sweet but not mad", "Interview Questions": "How many years experience did I have"}], [{"date": "16 Jan 2019", "title": "Internship Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Samaritan's Purse", "Interview Descriptions": "I submitted an application, completed a one-sided video questionnaire, and then completed a phone interview. My process stopped there as they did not reach out to me again. I had to answer a lot of questions about my Christian faith and beliefs and provided a lot of personal information.", "Interview Questions": "Something like: how do you feel a Christian should deal with homosexuality?"}, {"date": "4 Dec 2018", "title": "Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Samaritan's Purse", "Interview Descriptions": "The interview process typically includes the following steps: writing a job description, posting a job, scheduling interviews, conducting preliminary interviews, conducting in-person interviews, following up with candidates, and making a hire.", "Interview Questions": "Skills, experience,  faith-based questions, the reason for the choice of organization."}, {"date": "7 Jan 2019", "title": "Leadership Development Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Samaritan's Purse in Nov 2018", "Interview Descriptions": "Submitted application, received email within a day from HR. Next step was a one way video interview consisting of 5 questions. A bit of an awkward experience however you had the opportunity to do retakes which was helpful. Next step was phone interview.", "Interview Questions": "Why do you want to work for our organization? "}, {"date": "29 Oct 2018", "title": "Intern Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Samaritan's Purse", "Interview Descriptions": "It was a recorded video interview. There were five questions and I had a minute to answer each. But they let you re-record if you wanted. You could do so up to three times. The questions were general interview questions asking you to describe your international experiences or projects you have been proud of in the past.", "Interview Questions": "Tell us about yourself "}, {"date": "23 Dec 2020", "title": "Volunteer Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Samaritan's Purse in Jun 2018", "Interview Descriptions": "I am not sure what the entire process looks like. I only went through one round and realized it was not a good core value fit and didn't pursue anymore. Everyone seemed pleasant in the interviews though.", "Interview Questions": "The organization has strong values about such things as homosexuality, abortion and alcohol consumption. It is definitely for those whose values align with conservative Christian values. "}, {"date": "27 Aug 2018", "title": "International Disaster Response Unit Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Samaritan's Purse (Abilene, TX) in May 2018", "Interview Descriptions": "My interview process with Samaritan's Purse consisted of three stages.  First, after submitting an online application via Workday, I was contacted to set up an phone screening interview.  The initial phone screening interview was with one representative from HR, lasting around 1 hr.  I was previously an employee with Samaritan's Purse overseas, but as this was applying for a domestic-based position, and there had been a gap in time since my last employment, the phone screening interview centered mostly around a 'ministry fit' set of questions; seeing if my personal beliefs and values aligned with core values of the organization.  \r\n\r\nAfter the phone screening interview I was cleared to proceed to the second step, a video interview via Spark Hire.  This was my first time completing video interviews via a video platform, but it was user friendly.  Interview questions for me were challenging and stimulating, diving deeper than qualifications on paper and connecting to one's character on the job, especially as it relates to problem solving, working in a team, following leadership, etc. \r\n\r\nMy video interview responses were reviewed by the hiring manager and I was cleared to move to what would be the final round, a group panel phone interview with my supervisor, the director of my unit and another colleague on the unit.  This lasted one hour and dove deeper into qualifications and previous experience as well as similar questions around my character on the job. \r\n\r\nFrom point of first contact via email, to the receipt of an offer, the whole process was professional and very positive.  I was not sure of the outcome and regardless felt that I was treated with respect even if I was not to be identified as the top candidate.", "Interview Questions": "Name an instance where you disagreed with your supervisor?  What did you do?  How did you handle the situation? "}, {"date": "26 Oct 2019", "title": "International Logistics Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Samaritan's Purse (Calgary, AB) in Apr 2018", "Interview Descriptions": "They care alot about your spirtual journey as well as your job skills. Be prepared to share about your spirtual jouney and why your care about working for a non profit chrisitan organization", "Interview Questions": "Share you testimony"}, {"date": "21 Mar 2018", "title": "Leadership Development Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Samaritan's Purse (Fort Worth, TX) in Mar 2018", "Interview Descriptions": "I applied online and later received a link to a one way video interview. A month later I received a phone call to set up a phone interview. They told me they take a long time in the hiring process because they want to make sure it’s a right fit for them and for me and my family. Very thoughtful and encouraging interview.", "Interview Questions": "How would your previous supervisor describe you?"}, {"date": "11 Feb 2018", "title": "Logistician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Samaritan's Purse (Nairobi)", "Interview Descriptions": "The process is quite smooth and very easy to handle. you sit before a 3-4 member panel and they grill you in regard to your qualifications and experience against what you have indicated in your CV. if you pass or not they will make a point of communicating though not giving reasons especially when you have not passed.", "Interview Questions": "questions range from, your introduction, to your experience to to you explaining why you feel you are suited for that position if given an opportunity."}, {"date": "10 Apr 2019", "title": "International Disaster Team Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 9 months. I interviewed at Samaritan's Purse (Johnson City, TN) in Feb 2018", "Interview Descriptions": "The process was very convenient to my other job because I was offered an online interview by video followed by a phone interview then was hired without requiring travel to remote location until training day", "Interview Questions": "Tell us about a time you were able to use your strengths in ways you never had before"}], [{"date": "28 Jan 2018", "title": "Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Samaritan's Purse", "Interview Descriptions": "Selective interview few questions. no more than a basic one . few information shared about how they work not certain about the contract length.  asked if i can work in religious place .also if they are able to have my services as soon as possible", "Interview Questions": "Personal more than technique "}, {"date": "23 Feb 2018", "title": "Intern Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Samaritan's Purse in Dec 2017", "Interview Descriptions": "Overall disappointed in Samaritan's interview process. I had a phone interview in December and heard nothing from the organization till the end of February and that was to let me know that I did not get the position. I do understand that a lot people apply, but I do not see the need to wait that long to let the people that didn't do good enough in the phone interview, or make it through any of the the steps, know that they didn't get a position. This is inconsiderate to those that are trying to make other plans and are waiting to hear back. There needs to be more communication throughout the process.", "Interview Questions": "What is something you've read in the Bible lately?"}, {"date": "3 Nov 2017", "title": "Fundraiser Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Samaritan's Purse", "Interview Descriptions": "The process seemed in my opinion to be slightly unorganized but there were individuals along the way that seemed to keep the process moving forward.  Overall they seem to be a good organization.", "Interview Questions": "The Interview Questions were general and what would be expected"}, {"date": "18 Nov 2017", "title": "Leadership Development Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Samaritan's Purse (Nashville, TN) in Nov 2017", "Interview Descriptions": "It required a one way video interview.  Unlimited time was given to answer questions and you were permitted to re-record your response.  Questions were thoughtful.  Questions were relevant.", "Interview Questions": "Most significant accomplishment."}, {"date": "22 Jul 2017", "title": "Program Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 2 weeks. I interviewed at Samaritan's Purse (Silver Spring, MD)", "Interview Descriptions": "Got reply email 1 week after application submitted, scheduled for 1st interview (about spiritual life and faith) within 3 days, then scheduled for one way video interview (about leadership and personality) within 3 days, then scheduled for final interview with the hiring manager/program director within 3 days (interview last 2 hours, digging more from 2nd interview questions, and they explained more about the project).\n\nTotal time for the recruitment process about 2 weeks since application submitted. It seems this process is faster than usual since the former employee for the position was retiring soon.\n\nThe recruitment team was professional but also very kind.", "Interview Questions": "- tell me about your walk with God and how you believe in Jesus?\n- what is your spiritual discipline/habit/routine?\n- what do you think about abortion?sex and marriage?\n- what are your strengths and weaknesses?\n- how you describe your leadership style?"}, {"date": "17 Jan 2021", "title": "Deputy Finance Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Samaritan's Purse (Nairobi) in Aug 2017", "Interview Descriptions": "Took less than one month very helpful HR in Kenya. Was contacted for the Job and the team was very professional. Did a written test and got a response withing 5 working days. Has a skype interview with South Sudan team.", "Interview Questions": "How can you add value in a Christian way "}, {"date": "11 May 2017", "title": "OCC Office Administrator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Samaritan's Purse in May 2017", "Interview Descriptions": "The listing had been posted for 30+ days on indeed.com, I clicked the link and applied online through their website. I received an email 2-3 weeks later asking to do a video interview, it had to be completed within 24 hours. 2 days later I got an email asking to set up a skype interview, which happened 2 days later. They said I would hear back within a week if they wanted me to move on to an in person interview. I heard back 3 days later that they chose someone else, via a phone call. \r\n\r\nOverall, the HR person I communicated with and interviewed with was extremely professional and kind. I love this ministry. The video interview was 4 questions, and I got around 1-3 minutes to see the question before I had to answer and I got about 1-3 minutes to give my answer. The questions were: what would you say to someone who asks you how to be saved; what makes you an ideal candidate for this position; why do you want to work for SP; and what skills do you have as an office administrator (or the role you are applying for))? \r\n\r\nThe skype interview centered around you agreeing with SP's statements of faith and personal conduct policies. They ask you more faith based questions like when was a time God clearly called you or purposed you for something. Or about a time you witnessed God's sovereignty in your life.  They did ask more job specific questions and how you would fill the role they are hiring for as well, but I didn't have time to write those down or remember! Since it is a Christian nonprofot, the HR are extremely nice and made me feel at ease the whole time.", "Interview Questions": "What skills do you have as an office administrator (or the job title you are applying for)"}, {"date": "28 Feb 2017", "title": "Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Samaritan's Purse", "Interview Descriptions": "Phone screen by Human Resources. In person interview with hiring manager(s). Helps to know someone to get your foot in the door. Expect questions about your personal faith. Be honest and authentic. Not a difficult interview once you secure one.", "Interview Questions": "Will ask about your Christian faith.\r\nWill ask if you agree with their statments of belief."}, {"date": "22 Jul 2017", "title": "Ministry Pilot Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Samaritan's Purse (Charlotte, NC) in Mar 2017", "Interview Descriptions": "First part includes a general interview on your faith and beliefs. They are keen on making sure you agree with their statement of faith that I am glad they are clear about from the start and doesn't hit you by surprise later. Before the interview they share with you what they will ask you about which is very helpful in preparing. Next step is a more technical interview based on the role you apply for. And it seemed like a very friendly atmosphere one would work at. Overall, be honest and truthful on your beliefs and your qualifications. Should go well.", "Interview Questions": "Is there anything I disagree with in their statement of faith? "}, {"date": "16 Dec 2016", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Samaritan's Purse (New York, NY) in Nov 2016", "Interview Descriptions": "Very laid back initial interview where they want to get to know you. Most of the questions of the first interview are based on their values, so if you do not agree with all their values and beliefs I suggest not applying. The second interview is more skills based, that's when they ask more about your professional experience.", "Interview Questions": "I was asked to do portion of the interview in Spanish which I was not told beforehand."}], [{"date": "13 Dec 2016", "title": "Team Lead Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Samaritan's Purse (Duluth, GA) in Nov 2016", "Interview Descriptions": "The interview process began with a phone call confirming that I was still interested in the position applied for on Indeed. I first interviewed with Hire Dynamics and then was scheduled for a 2nd interview with the Operations Manager at Samaritan's Purse.", "Interview Questions": "What experience do you have in customer service and handing challenging situations?"}, {"date": "4 Sept 2016", "title": "Regional Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Samaritan's Purse", "Interview Descriptions": "Very Difficult to Understand - seemed that they already had selected a candidate and just going through motions.  Also seemed as if the selection process was designed to fit a certain candidate profile.  When I called for clarification - I was told to just send in my CV - after I had already sent it in!  When they started reviewing me - it seemed quite rushed.  Later I called to find out results and was told that the position had been filled.", "Interview Questions": "Why I thought I could do the job."}, {"date": "14 Dec 2015", "title": "Leadership Development Manager Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Samaritan's Purse (Dallas, TX) in Dec 2015", "Interview Descriptions": "I submitted my resume digitally on a Monday Thanksgiving week. I immediately received the canned reply from HR, then within an hour a \"real person\" reply with followup questions. I sent my replies on Friday and got a phone call for a phone interview the next day. Just over a week between submission and first level interview.", "Interview Questions": "Samaritan's Purse is a faith based organization so I was not surprised by questions about Biblical management of conflict, volunteer management, etc. What are the non negotiable qualities for volunteer leaders under my leadership. Why am I searching for a job (I have a great job now)? They are looking for someone with a balance between being systems focused and people focused. What percentage would you say you are, 50/50 (systems and people) 40/60, etc? I withdrew from the process because of the required travel time."}, {"date": "19 Feb 2016", "title": "Data Entry Operator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Samaritan's Purse (Charlotte, NC) in Nov 2015", "Interview Descriptions": "Very professional yet not intimidating at all. Christian values are definitely questioned, but acceptable since this is a ministry. Not everything is made clear during the interview though, like changes in pay periods when going from one part of the project to another.", "Interview Questions": "How would I describe my walk with God"}, {"date": "22 Oct 2017", "title": "Nutrition Program Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Samaritan's Purse (Boone, NC) in Oct 2015", "Interview Descriptions": "Multiple stages, thorough. SP is able to find the best skills because of their questions test out many qualities in a potential candidate. They are multi stage, therefore, able to eliminate those that are less fit", "Interview Questions": "What makes you think you are able to work in South Sudan?"}, {"date": "14 Oct 2015", "title": "Monitoring and Evaluation Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Samaritan's Purse in Sept 2015", "Interview Descriptions": "I applied online for the position in the DRC. I got an email within a week or two after asking to set up a Skype or phone interview. I did the phone interview, and was told I would be contacted within 1-2 weeks if I was selected to go to the second round of interviewing with the national DRC team. I checked in 2.5 weeks later and they told me there had been a delay in the decision making process. I checked in 2 weeks after that and received no response after that. From what I've heard from SP employees the process can take quite a long time.", "Interview Questions": "What is your faith story? (How did you become a Christian?) What roll do you see the Holy Spirit playing in your life? What do you think the Christian community's response to abortion should be? What projects have you worked on? Has anyone ever challenged your character, and how did you respond to that? What projects have you worked on where you've had to use analysis skills? How have you responded to bad team members in the past?"}, {"date": "18 Sept 2015", "title": "Seasonal Administration Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Samaritan's Purse (Boone, NC) in Sept 2015", "Interview Descriptions": "Very long process with a lot of personal inquiry not related to the job. Took a long time to communicate decisions. I did not realize  that they only hire individuals  with a conservative right wing Christian agenda. Make sure you agree with everything the CEO says and does before applying. You cannot have any other opinion. Interview process  was a little  extensive for a temporary position.  I wish I read other posts on glassdoor  before applying. That said the interviewers were all very nice and straightforward.", "Interview Questions": "Tell me your definition of marriage. "}, {"date": "8 Jul 2016", "title": "Human Resources Recruiting Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Samaritan's Purse (Charlotte, NC) in Jul 2015", "Interview Descriptions": "Fairly similar to most. It is a Christian organization so they have the ability to ask questions relating to belief. Was given an assessment initially with examples of various scenarios and rate them in order of importance. Answered a variety of general interview questions. Discussed Clifton Strengths Finder results and the top five areas of strengths. Knowing yourself and your God given gifts and abilities is very important to this organization, especially with Operation Christmas Child.", "Interview Questions": "If I were to ask you what the condition of the interior of your car is like right now, how would you describe it?"}, {"date": "10 May 2017", "title": "Social Media Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Samaritan's Purse (Boone, NC) in Jun 2015", "Interview Descriptions": "I had a phone interview, then an interview panel/visit was scheduled. Before attending the face-to-face, they sent HR paperwork to fill out. They said I would be required to never drink in public again. I wasn't entirely comfortable with that since in my latino heritage  drinking is not demonized like in puritanical faiths. However, since I'm not a big drinker, I agreed. They said I could never have sex with or live with a man before marriage. I was single and that's personal, so I would never talk about that at work anyway, so okay. They also required a signature claiming that I believe God condemns homosexuality and finds it an abomination. I said I do not judge anyone, including people who feel that way, but I would never believe God finds any of his creations an abomination. The HR recruiter claimed it was a requirement for employment, so I canceled the interview and wished them well. I would never work for someone who discriminates against people based on their faith, gender, race, or orientation. If you're a Christian, you should know it's not your place to judge the righteousness of others. She said they wanted everyone to be \"of the same mind,\" but I think differently, and I enjoy and embrace intellectual diversity. I think this would be a good work place for someone who enjoys dogma, routine, and public prayer. There are a lot of rules for not an unfair level of pay, but I have made more money in a position that makes a greater impact on the community. Every year, I used to donate to and volunteer for samaritan's purse. I haven't since and won't ever again.  Better to donate to local churches that you can trust and that do mission work/outreach.", "Interview Questions": "Will you agree not to drink in public? "}, {"date": "15 Jun 2015", "title": "Project Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Samaritan's Purse (Boone, NC) in Apr 2015", "Interview Descriptions": "It is difficult to get an interview unless you know someone.  However, once you get in the people are very friendly and helpful.  The interview questions were average questions.  Of course, being a Christian ministry there were several questions about belief systems and relationship with Christ", "Interview Questions": "What is the most meaningful experience you have had ministering out of the country?"}], [{"date": "23 Mar 2016", "title": "User Experience Designer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 3 weeks. I interviewed at Samaritan's Purse (Upland, IN) in Feb 2015", "Interview Descriptions": "There were two portions: faith based and then skill based interviews. Honesty was key here. It seems like they can tell when you are just spouting out responses that they want to hear.", "Interview Questions": "How did you come to your faith? What are your views on some of the biggest controversial topics of today from a Christian standpoint (It was a little more specific than that, but I'm sure the question will change as time goes on)? What experience have you had in the field? etc."}, {"date": "24 Mar 2015", "title": "Regional Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Samaritan's Purse (Dallas, TX) in May 2014", "Interview Descriptions": "Very long process and wait for interview. Had one interview via phone, another in person with entire office staff. Interviewer left prior to interview and a substitute filled in via Skype. I was promised a decision within a few weeks; waited several months and never received a response even after several messages left.", "Interview Questions": "Q: How do you plan to increase volunteer rates among minority demographics?"}, {"date": "3 Mar 2015", "title": "International Regional Manager OCC Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Samaritan's Purse (Telephone, TX) in Oct 2013", "Interview Descriptions": "First spoke with someone in HR, then had a telephone interview with regional manager followed by a phone interview with regional director. The starting salary for this position was in the upper 50's and I had been earning $85K. The organization would have paid for my relocation. Ultimately I decided not to pursue the position, but it wasn't because of low salary. After a phone interview with the regional manager and then the regional director, it was evident that the organization would be too rigid and confining for my personality and work style. There would have been very little opportunity for advancement. There would have also been 120 days of travel annually at about 2 weeks for each trip. That was more than I wanted to travel. I think Samaritan's Purse is a wonderful organization it just wouldn't have been a good fit for me.", "Interview Questions": "Why I was considering the position?"}, {"date": "26 Jul 2013", "title": "Staff Writer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at Samaritan's Purse", "Interview Descriptions": "The hiring process can take a long time. You'll have multiple interviews and will have to take an editing test.", "Interview Questions": "Why do you want to work for us?"}, {"date": "3 Feb 2016", "title": "Regional Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1+ week. I interviewed at Samaritan's Purse (Boone, NC) in Mar 2013", "Interview Descriptions": "Phone interview followed by in-person interview. The process was relatively straight forward and easy. Most questions are behavioral in nature; however, there will be few simple technical questions related to the job your applying for. There will also be specific questions about your faith and value system , so be prepared to answer those. I was reimbursed mileage and meals, as well as put up in a hotel (Marriott) for the night. Overall, pleasant interview process.", "Interview Questions": "How would you handle a situation where a person you were friends with was doing something inappropriate?"}, {"date": "15 Jul 2012", "title": "Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Samaritan's Purse", "Interview Descriptions": "Long process.  Few only work in HR so it can take awhile before interviews move ahead", "Interview Questions": "Tell me about your spiritual journey and why you feel called to this position ..."}, {"date": "3 Sept 2010", "title": "Regional Finance Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Samaritan's Purse (Boone, NC) in Jun 2010", "Interview Descriptions": "The process began with an on-line application and submission of a resume. After about 10 days received an e-mail requesting a phone interview within a couple days. They called. A group of about 5 were present with questions from all involved. Went very smoothly. About 10 days later received a telephone call requesting a on site interview. They arranged to meet my limited availabilty schedule and paid all expenses for an across the United States trip. Paid for the two nights in a hotel, meals and a vehicle.\r\n\r\nThe on site interview lasted for about 6 hours and included lunch with several from the department. The interview process was with both individuals and small groups at various levels and positions in the department. A low pressure and enjoyable process actually.\r\n\r\nLearned the result within about 5 days, which was no offer, but they invited me to apply for a different position within the same department. I did not due to other personal circumstances.", "Interview Questions": "Describe how you would handle receiving simultaneous phone calls from around the world along with immediate demands within the office? (This is an international relief organization. The position is responsible for operations in several countries, but within a world region.)"}]]