[[{"date": "16 May 2023", "title": "Campus Ambassador Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at University of Missouri-Kansas City", "Interview Descriptions": "super chill environment, had to present something important to us in front of current campus ambassadors and other staff the application was easy and straight forward team seems super welcoming and nice", "Interview Questions": "what is diversity to you"}, {"date": "2 Jun 2023", "title": "Student Support Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Missouri-Kansas City (Kansas City, MO) in May 2023", "Interview Descriptions": "The interview seemed to have went well. It was the direct supervisor and her team lead conducting the interview over Zoom. Not many in-depth questions, just mostly asked about my experience. I have 11 years experience in an almost identical role. They gave the impression that I pretty much had the job, I nailed the questions and filled all the required experience. Yet received a generic rejection email. I will never apply here again and will advise others not to waste their time.", "Interview Questions": "What did you do in your previous role?"}, {"date": "13 Mar 2023", "title": "Graduate Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at University of Missouri-Kansas City", "Interview Descriptions": "Hiring Manager will reach out and set up interview. There is only one round of interview but there are usually a lot of applicants so make sure your application matches the job descriptions as much as possible.", "Interview Questions": "Behavioural questions to see how you have demonstrated similar skills before. For example, demonstrate a time when you solve problems or explain how you prioritize tasks."}, {"date": "8 Jun 2023", "title": "Human Resources Generalist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at University of Missouri-Kansas City (Kansas City, MO) in Mar 2023", "Interview Descriptions": "3 rounds of interviews. 1st with recruiter for screening. 2nd with hiring manager and recruiter. 3rd with HR team. The questions were based on the STAR method. All behavioral type questions.", "Interview Questions": "Tell us a bit about yourself"}, {"date": "17 Oct 2022", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Missouri-Kansas City", "Interview Descriptions": "Competitive and long process. I had 3 round of interview. They asked me the basic questions like tell me about yourself. First two interviews are easy but it got harder for the last interview.", "Interview Questions": "- Tell be about yourself - Why did you apply this job? - Tell me the work experiences"}, {"date": "27 May 2022", "title": "Educator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at University of Missouri-Kansas City", "Interview Descriptions": "Great process, very friendly, welcoming environment.  Very descriptive on the job and you interviewed with multiple people over the course of a couple hours (several interviews within that time).  Very positive experience with this university for employment.", "Interview Questions": "What strengths do you bring to the table as a team member, employee, and to this position."}, {"date": "17 Apr 2022", "title": "Student Diversity Ambassador Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of Missouri-Kansas City", "Interview Descriptions": "Come prepare with examples for each of your answers. They will ask a lot of questions about Diversity & Inclusion and your experiences in those settings.  For each of your answer, you would need to provide an example.", "Interview Questions": "Describe an example of when you use your multicultural skills to solve a problem.   "}, {"date": "15 Apr 2022", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Missouri-Kansas City", "Interview Descriptions": "The interview was great. A panel asked conversational questions and gives you time to think/ explain. Total time was probably around 45 mins to an hour. Allows time for questions at the end. If you pass this interview, you have a secondary one with the director who is very friendly.", "Interview Questions": "Please explain your greatest strength and weakness, and how you overcome it."}, {"date": "5 Apr 2022", "title": "Recruitment Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at University of Missouri-Kansas City", "Interview Descriptions": "Very positive and professional. Heard back quickly and everyone was helpful and kind. Loved working with both my future supervisor and the campus HR department in the process. One of the better experiences I've had.", "Interview Questions": "Why are you interested in this position?"}, {"date": "6 May 2022", "title": "Business Support Specialist II Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at University of Missouri-Kansas City in Apr 2022", "Interview Descriptions": "It was 45 minutes with a human resources rep, and one hour with my potential supervisor (which was actually with the entire department administration, which was a bit of a surprise) via Zoom.", "Interview Questions": "Pretty standard questions - nothing unusual"}], [{"date": "17 May 2022", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Missouri-Kansas City in Apr 2022", "Interview Descriptions": "Initial interview process went quickly as I was contacted within 2 weeks of applying. The interview itself went well and I was told I should hear back soon. I then never heard anything more. It would have been nice to hear that they went with another candidate or weren't interested in moving forward instead.", "Interview Questions": "They wanted to know my experience with early childhood education. "}, {"date": "30 Mar 2022", "title": "Assistant Professor, Graphic Design Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 4 months. I interviewed at University of Missouri-Kansas City (Kansas City, MO) in Dec 2021", "Interview Descriptions": "I interviewed with UMKC in December for Assistant Professor in Graphic Design. The overall experience was great except for the long tiring campus interview. I was asked to be on campus at 8 am and was interviewing, meeting with faculty for the entire day. I was told that at the end of the campus visit,  around 4 pm, will be a meeting with the Dean and which is going to be a casual conversation.  I was caught off-guard when at the end of the campus visit, the Dean had a set of questions written for me and wanted me to explain to her my research plan apart from the one hour Research presentation I gave. I was tired and was not expecting this to be another interview as this was towards the very end of the day so I didn't engage in the conversation. \r\n\r\nFast forward to February, I was asked to submit my official transcripts and so I did. Never heard from them until March and that's when I accept another position and withdrew my application. \r\n\r\nPS: I have not been reimbursed for my campus visit and it has been 4 months since my visit.", "Interview Questions": "N/A"}, {"date": "22 Jul 2021", "title": "Employer Outreach Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of Missouri-Kansas City", "Interview Descriptions": "It was a very easy and friendly process. The first interview is a get-to-know-you, with behavioral questions. If you make it to the second round you will meet with a team of people you will be working with.", "Interview Questions": "Why do you think you are a good fit for this position?"}, {"date": "15 Mar 2022", "title": "Student Ambassador Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of Missouri-Kansas City (Kansas City, MO) in May 2021", "Interview Descriptions": "It was easy. the company is geared towards diversity and teamwork. You will be asked a few questions, have some questions ready and prepare your interview around those main keywords and the regular questions, and you'll do great!", "Interview Questions": "Tell me about yourself.\r\nWhat does team mean to you?\r\nWhat does diversity mean to you?"}, {"date": "5 Apr 2021", "title": "Vice Provost Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at University of Missouri-Kansas City (Kansas City, MO) in Apr 2021", "Interview Descriptions": "I haven't had it yet.  I am hoping to review and get some types although I did talk to the hr people and he was very nice and encouraging.  It seems like a good opportunity for me and my family to move to the area.", "Interview Questions": "Why are you interested in this position?"}, {"date": "2 Sept 2021", "title": "Cahshier Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of Missouri-Kansas City (Kansas City, MO) in Jan 2021", "Interview Descriptions": "Send resume, cover letter and after that we had a in-person interview with manager. I got the offer after the interview. It was very smooth process and it was easy to get a job.", "Interview Questions": "Questions about your school life, your academic, why choose UMKC etc.. "}, {"date": "8 Mar 2019", "title": "Marketing Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at University of Missouri-Kansas City", "Interview Descriptions": "Took a little over a week, I applied in person but I saw the job posting online. Former UMKC alumni so that made the process smooth. Overall managers were nice and interview process was fast and easy.", "Interview Questions": "How will your experience contribute to this job?"}, {"date": "19 May 2022", "title": "Office Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at University of Missouri-Kansas City (Kansas City, MO) in Nov 2018", "Interview Descriptions": "The interviewee was very friendly and welcoming. I did not feel pressured throughout the interview. Everything went smooth. I would not mind working with the same manager. I enjoyed bring introduced to everyone at the end.", "Interview Questions": "Tell me about yourself and your hobbies."}, {"date": "26 Aug 2018", "title": "Writing Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of Missouri-Kansas City", "Interview Descriptions": "A group interview, which can be difficult but everyone is very friendly. It is roughly 30 minutes long and requires some reading before hand. Then you dicuss as a group, so make sure you get a word in.", "Interview Questions": "What do you do in certain scenarios?"}, {"date": "20 Nov 2019", "title": "Academic Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at University of Missouri-Kansas City (Kansas City, MO) in Feb 2018", "Interview Descriptions": "talk through and chat, we go through almost all the academic stuff in my student life, and talk about my behavour for such a long time. Even we know that is not gonna help:(", "Interview Questions": "how you guide students"}], [{"date": "5 Jan 2018", "title": "Graduate Assistant At UMKC Women's Center Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Missouri-Kansas City", "Interview Descriptions": "Two rounds of onsite interview. Offer after second interview. the process went smoothly and initially the management was very supportive. Interview was taken by Director and Assistant Director and questions were standard for an interview process. The time between first interview and offer was two weeks", "Interview Questions": "How do you manage your time?"}, {"date": "25 May 2017", "title": "Office Support Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Missouri-Kansas City (Kansas City, MO) in May 2017", "Interview Descriptions": "I met briefly with a Human Resources representative for a short interview.  From Human Resources I went to the department where the position would be located and interviewed with the direct supervisor.  She was very friendly, and the interview was conversational.  The whole process was not stressful and took under an hour.", "Interview Questions": "Describe an instance when you had a conflict with a client or coworker and how did you resolve it?"}, {"date": "11 Oct 2021", "title": "Recruitment Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of Missouri-Kansas City (Kansas City, MO) in May 2017", "Interview Descriptions": "Phone interview first, then they will bring you on campus to see the space you would be working in. Then you will have a few small interviews with staff members and typically a presentation if you are in a role that presents to the public.", "Interview Questions": "Tell me about yourself, examples of how to help students, recruitment strategies used in the past, any former student experience, why UMKC, why that specific department"}, {"date": "26 Feb 2017", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at University of Missouri-Kansas City (Kansas City, MO) in Feb 2017", "Interview Descriptions": "Visited with HR and then with department. Everyone very friendly and helpful. Total time for the interview was 2 hours and that included travel time to a 2nd location. I arrived a bit late to 2nd location but they were not impatient about that. They started off with description of duties and expectations then each of the three asked their questions.", "Interview Questions": "Why do you want this job?"}, {"date": "12 Aug 2017", "title": "Temporary Office Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Missouri-Kansas City (Kansas City, MO) in Feb 2017", "Interview Descriptions": "Contacted via phone after submitting an application to indeed.com.  I then gave two consective interviews: one with HR and then a roundable with the department.  Do your research before the interview, because you will likely be asked questions by several managers or supervisors, and it is helpful to know their roles going in.", "Interview Questions": "Do you know how to mail-merge?"}, {"date": "20 Jun 2017", "title": "Director of New Business Development Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at University of Missouri-Kansas City in Dec 2016", "Interview Descriptions": "I got phone interview first. They talked about current position and then asked about my job experience. After 15 minutes, I was schedule for actual interview. I had 2 interviews: one with HR and one with department", "Interview Questions": "Is there anything about your former manager that you wish you would do differently"}, {"date": "18 Feb 2017", "title": "Software Developer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at University of Missouri-Kansas City (Kansas City, MO) in Sept 2016", "Interview Descriptions": "The Interview has two rounds. One written and the Technical round.\r\nWritten test is to understand your knowledge on Java, C# and Oracle. The test includes basic questions. Where as in the technical round they will ask you some questions related to Projects you worked on and he will give you a task and will ask you to resolve it.", "Interview Questions": "What was the project you worked on the previous company?"}, {"date": "6 Dec 2017", "title": "Recruitment Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Missouri-Kansas City (Kansas City, MO) in Aug 2016", "Interview Descriptions": "Got an email to set up an interview on-campus which they were very accommodating with times. Had to meet with HR which seemed like a waste of time because they had no clue about the position. Met with a group of around 6 people for the actual interview. Standard questions. Left the interview and never heard from the office again but over 6 months later got an automated email from their HR system saying they had chosen someone else. Very unprofessional.", "Interview Questions": "What is time you had a disagreement with a coworker?"}, {"date": "10 Nov 2016", "title": "AV Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 days. I interviewed at University of Missouri-Kansas City (Kansas City, MO) in Aug 2016", "Interview Descriptions": "very good and interesting , many of the topics are related to the job description, the interview was conducted for about an hour, the session was very live and more of informative discussion like rather than a  bossy and employee interview, totally the process was very excellent.", "Interview Questions": "what is a codec?"}, {"date": "4 Jan 2018", "title": "Technical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at University of Missouri-Kansas City (Kansas City, MO) in Jul 2016", "Interview Descriptions": "The hiring process consists of two steps. Firstly, they conduct an exam. This is the difficult part in the whole process. 30 questions in 60 minutes and you are allowed to use all the sources(internet) you have except communication with others. Once the exam is passed, a face to face interview is scheduled.", "Interview Questions": "If we ask one of your professors about you, how would he describe you?"}], [{"date": "29 Jan 2017", "title": "Program Translator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 3 weeks. I interviewed at University of Missouri-Kansas City (Kansas City, MO) in Jul 2016", "Interview Descriptions": "Submitted my CV and we were interviewed in an conformance room together and asked to translate lots of business presentations. There are two of them, one is the manager and the other is her assistant.", "Interview Questions": "Just went through the CV and why the job"}, {"date": "9 Mar 2016", "title": "Assistant Teaching PRofessor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Missouri-Kansas City (Kansas City, MO)", "Interview Descriptions": "Overall, the interview was excellent!  The department faculty members were very insightful, passionate about student learning, and knowledgable.  I found the students engaging and eager to participate in the teaching demonstration.", "Interview Questions": "How do you plan to contribute to our department?"}, {"date": "4 Sept 2017", "title": "Career Services Advisor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Missouri-Kansas City (Kansas City, MO) in Mar 2016", "Interview Descriptions": "I was called in after online application and interviewed by a committee of those in the department. I didn't feel that the panel had a very positive attitude towards my application. I was then interviewed one on one by an employee who showed me more about the job, which didn't seem very relevant since I wasn't being offered the job. Nothing was negative, but I didn't have a very positive feeling about the experience, though I can't say exactly why.", "Interview Questions": "My greatest weakness"}, {"date": "21 Jan 2016", "title": "Mobile Applications Developer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. The process took 6 days. I interviewed at University of Missouri-Kansas City (Kansas City, MO) in Dec 2015", "Interview Descriptions": "Interview process was very selective. They are choosy and the initial screening is based on the experience we have on the Job requirements. Later the technical interview gonna takes place for an hour and later they keep a Technical exam. Based on the performance , they choose the employees.", "Interview Questions": "Describe the related work you have done?"}, {"date": "20 Jun 2017", "title": "Student Technical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Missouri-Kansas City (Kansas City, MO) in Dec 2015", "Interview Descriptions": "We need to pass an online exam to qualify for the interview. If we get the desired number of marks we get a mail to schedule an interview with the supervisor", "Interview Questions": "Why do you want to work at IS labs?"}, {"date": "19 May 2016", "title": "Executive Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at University of Missouri-Kansas City (Kansas City, MO) in Oct 2015", "Interview Descriptions": "Applied in July, and I think I received the first call in September. I first spoke on the phone to a gal in HR, and then was asked to come in for an interview. I first spoke to the lady I would be replacing (she was moving to a new position) and then I spoke to the person I would be working directly for. A week later, they had me do a timed test to assess my editing skills, which did not go very well. The person who gave me the test emailed it to me and said I had an hour from the time she emailed it to go over it and find any errors. The test was about a page and a half long I believe. This would have been no problem, except she had scanned the document and then emailed it as a photo rather than something I could edit (work or pdf.) I expressed the issue, and she said to do the best I could with what I had. Maybe it was a trick question? I went through it with the drawing tool on work and tried to do the best I could with that. Guess I didn't do too terrible, since I got the job still.", "Interview Questions": "They asked basic questions about experience and how I deal with tough people. "}, {"date": "20 Sept 2015", "title": "Graduate Student Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of Missouri-Kansas City", "Interview Descriptions": "I had a phone interview that lasted about 30 minutes. It seemed like they had already short-listed me as one of the finalists and the interview was pretty perfunctory. The woman who interviewed me was a faculty member who no longer works there. She was friendly and polite.", "Interview Questions": "What are your research interests?"}, {"date": "15 Aug 2015", "title": "Research Assistant Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Missouri-Kansas City", "Interview Descriptions": "The interview was easy and the job was very promising.  Had a phone interview and weeks later I can in-person interview, which I believe went very well. Got the job offer but the pay was very low.", "Interview Questions": "Why do you want to leave your previous job?"}, {"date": "14 Jan 2016", "title": "Human Resources Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at University of Missouri-Kansas City (Kansas City, MO) in Jun 2015", "Interview Descriptions": "The HR department interviews you in a big room with 4 interviewers.  They ask you questions about your background and previous experience.  Its pretty typical as far as interviews go.  If they decide to offer you a position, you then have to go and interview with that specific department.  In my case, the process there was similar.  I was interviewed by the person I would directly report to, then I was interviewed by the other peopel who worked in the office.", "Interview Questions": "Why do you want to work in higher education"}, {"date": "19 Oct 2015", "title": "Assistant Teaching PRofessor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at University of Missouri-Kansas City (Kansas City, MO) in Apr 2015", "Interview Descriptions": "I interviewed for an Assistant Teaching Professor position within the Bachelor of Health Sciences program. While all faculty and staff were courteous during the interview, there was a severe lack of follow-up. For a position such as this, it denotes an absence of professionalism and organization (some of the very things the program strives to teach its students). The only response I received indicated the program was still working on a decision and would follow-up with me again one way or the other. Five months later and after a follow-up call and email from me, I still have not received a response from staff in the program regarding the status of the position. Clearly this program has some work to do in meeting its own standards.", "Interview Questions": "How would handle a situation where a student is working hard in your class but failing in their coursework and exams?"}], [{"date": "22 Sept 2015", "title": "Postdoctoral Fellow Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Missouri-Kansas City (Kansas City, MO) in Feb 2015", "Interview Descriptions": "Normal interview. Just asked science and job related questions. They wanted to know if I had the skills to do the job which I did. We met with some other related staff. I toured the facilities. I also met a few of the graduate students there. Everyone seemed reasonably normal as far as scientists go. Nothing out of the ordinary.", "Interview Questions": "Science and technique related"}, {"date": "18 Jun 2016", "title": "English Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at University of Missouri-Kansas City (Kansas City, MO) in Sept 2014", "Interview Descriptions": "The interviewer was very nice and personable. I appreciated the fact that she hired me immediately after the interview! I was given a last minute interview and was very happy to be offered the job because it helped me gain some experience and learn a few tips and tricks that have helped me in my daily life.", "Interview Questions": "Why do you think you'd be good atvtgus job?"}, {"date": "5 Jan 2016", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at University of Missouri-Kansas City (Kansas City, MO) in Jul 2014", "Interview Descriptions": "Cleared TOEFL with a good score which is the first criteria to apply for Graduate Teaching assistant jobs and later was called for a Technical presentation which serves as a screening.", "Interview Questions": "N/A"}, {"date": "5 Mar 2014", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of Missouri-Kansas City", "Interview Descriptions": "You submit application online, go for an interview, a few weeks to a month after the interview if you are offered an position you will be offered a position as long as you pass the background check.  The process seems unnecessarily long.", "Interview Questions": "Not a very difficult interview.  each position has the same interview questions.  They are pretty standard."}, {"date": "31 Jan 2013", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at University of Missouri-Kansas City", "Interview Descriptions": "The interview was brief and pretty easy.  There is a set list of questions for pretty much every interview.  It took almost a month from the time of the interview until I was told I had the position.  HR takes forever!", "Interview Questions": "the usual, where do you see yourself in 5 years"}, {"date": "30 Jun 2014", "title": "Language Lab Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at University of Missouri-Kansas City (Kansas City, MO) in Jan 2013", "Interview Descriptions": "Informal, and to the point. It's work study, so yeah. He was all like, \"We need a person to sit at the desk and answer the phone, which basically never rings. Do you think you can handle that?\" I responded what if I have to go to the bathroom the one time it does? He said, \"You're hired.\"", "Interview Questions": "There wasn't one, really."}, {"date": "30 Nov 2012", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at University of Missouri-Kansas City (Kansas City, MO) in Oct 2012", "Interview Descriptions": "I applied online. I was called and asked to come in the next day for an interview. I talked to hr and then the hiring manager.", "Interview Questions": "N/A"}, {"date": "10 Jul 2015", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at University of Missouri-Kansas City (Kansas City, MO) in Sept 2012", "Interview Descriptions": "I applied in-person and was referred by another employee. After dropping off my resume, I was asked to come in for an interview, which was in-person. The supervisor of the department screens all applicants. Successful applicants will likely be the ones who can fill gaps in the schedule. The questions are very easy. I was offered the job at the end of the interview. We scheduled the first day of training at that time as well. \r\n\r\nAfter the interview, it took a couple weeks to start the job because the University had to process my paperwork before I could start.", "Interview Questions": "How organized are you?"}, {"date": "11 Aug 2012", "title": "GTA Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at University of Missouri-Kansas City (Kansas City, MO)", "Interview Descriptions": "Hiring was done from the department, I submitted my application with a resume and cover letter. Later I received an offer through Email.", "Interview Questions": "Speak test was the most difficult part."}, {"date": "8 Apr 2015", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 4 weeks. I interviewed at University of Missouri-Kansas City (Kansas City, MO) in Aug 2012", "Interview Descriptions": "It began with a recruiting phone call. Then, two follow up in-person interviews. The interviews became whispers in the dark. Promises of opportunity to advance and contribute were never met.", "Interview Questions": "Can you do this job?"}], [{"date": "24 Nov 2015", "title": "Student Services Coordinator II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at University of Missouri-Kansas City in May 2012", "Interview Descriptions": "The process usually starts with a phone interview to gauge interest and fit. The next round of interviews are In person interview with several groups and individuals. It is not unusual to be asked to do a presentation for a panel. This is to see how you may conduct a class or speak on behalf of the department.", "Interview Questions": "Previous experience with student development and intensive/appreciative advising"}, {"date": "20 Jul 2015", "title": "Core Staff Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 5 days. I interviewed at University of Missouri-Kansas City (Kansas City, MO) in Aug 2011", "Interview Descriptions": "Group interview with a panel of administrative staff.\r\nOver thirty candidates applied for only five positions.\r\nProcess was very competitive as it is an ideal job for many students at the university, particularly freshmen with no form of transportation.\r\nInterviewed in groups of less than ten candidates with a panel of administrative staff ranging from three to sex staff members.\r\nHiring process only occurs at the beginning of each semester.", "Interview Questions": "What are some of your strengths?"}]]