[[{"date": "11 Jun 2023", "title": "Chapter Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Sierra Club (Las Vegas, NV)", "Interview Descriptions": "The interview was a grueling process that betrayed both a lack of urgency and coordination, lasting over six months since the initial job posting. Between half a dozen interviews conducted over that time, I spent around 20 active hours interviewing, preparing, or completing materials asked for by the hiring committee. Two months into the process, I was informed that Sierra Club National required the chapter to keep the job posted until enough candidates of diversity had applied. I respected that choice, as the green movement absolutely has a diversity problem that needs addressing. I assumed things would move more quickly once they had gathered more candidates, however, that was not the case. The second to last interview I did included a one hour timed assignment which consisted of creating the chapter's fundraising budget, plans, and estimating the revenue generated, without any background information. All in all, an inordinate amount of work went into this interview process, only for the team to decide, in the end, to cancel the position and repost it at a higher salary in the hopes to attract better talent. Given the complete disfunction of the hiring process, I can't imagine a candidate with the skills they are looking for accepting a low wage and enduring such a tedious and convoluted process.", "Interview Questions": "Questions were fairly routine and related to experience organizing and running campaigns, lobbying, volunteer management, budget management, and fundraising/development experience and strategies."}, {"date": "30 May 2023", "title": "Operador Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Sierra Club (Buenos Aires)", "Interview Descriptions": "Buen trato buena calidad humana, buen feedback. Excelente trato cordial. La persona encargada se comportó acordé a lo que se esperaría en una entrevista del tipo de presa nombrada. Esperando novedades al respecto", "Interview Questions": "Cargos. Experiencia. Trabajo en equipo. Colaboraciones. Aptitudes."}, {"date": "30 Mar 2023", "title": "Internship Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Sierra Club (Newark, NJ)", "Interview Descriptions": "The interview was with a group of 4 people. They each asked me a question about my prior experiences and how I would approach situations in the position. The interview was conducted over Zoom.", "Interview Questions": "Do you have prior experience with posting on social media? Do you have an example?"}, {"date": "5 Jan 2023", "title": "Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 months. I interviewed at Sierra Club", "Interview Descriptions": "Took 5 months. Applied online in August. Process was slow. First round was written response, second was interview with manager, third was an assignment, and fourth was interview with entire team.", "Interview Questions": "How do you learn new skills and how do you use them? how do you present outcomes to non technical people?"}, {"date": "4 Jun 2023", "title": "Communications Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Sierra Club in Jan 2023", "Interview Descriptions": "Several rounds of very short interviews, with one longer at end. Asked hypothetical questions about campaigns. 4 months between app and first interview, then all interviews happened quickly. Unsure if the short (~10 minute) interviews made it easier or harder than the usual.", "Interview Questions": "How would you organize a campaign to stop a local gas plant form being built."}, {"date": "21 Dec 2022", "title": "Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Sierra Club", "Interview Descriptions": "1. Answer a few short answer questions about why you want to work there 2. Phone screening with hiring manager and a member of the hiring committee 3. Analytical excel task 4. Interview with entire hiring committee", "Interview Questions": "What is a project you've worked on that is relevant to this role?"}, {"date": "19 Dec 2022", "title": "Customer Service Representative Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Sierra Club", "Interview Descriptions": "submitted resume on website and received an email a few days later saying I had been selected to move forward in the interview process. Signed up for a zoo phone call slot 30 minutes long. Second round interviews are in a few weeks.", "Interview Questions": "Describe a time you had a difficult situation with a customer and how did you deal with it."}, {"date": "19 Jul 2022", "title": "Conflict Coach Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Sierra Club", "Interview Descriptions": "Lengthy; in the end it was to be 7 months of jumping through hoops (I jumped for 4).  The manager thought she was a therapist. I'm a real therapist. She isn't a therapist.", "Interview Questions": "Tell us a time you had to resolve a workplace conflict (I'm paraphrasing)."}, {"date": "15 Jul 2022", "title": "Content Strategist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at Sierra Club", "Interview Descriptions": "I had three interviews in total, one with direct managers, one with department head, and one with union members. All online/video interviews. Entire process took 6 months from application to offer.", "Interview Questions": "Asked about my strategies for managing projects"}, {"date": "2 Jul 2022", "title": "Programmer/Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Sierra Club in Jun 2022", "Interview Descriptions": "Initial phone screening was 30 minutes long, with the hiring manager. \n\nThe second round was a 1-hour panel interview with the entire team, conducted via Google Meet. Team members took turns asking questions.\n\nThere was good communication between interview rounds about next steps and status.", "Interview Questions": "Initial phone screening consisted of outlining the hiring process and hiring schedule as well as asking questions about specific skills and past application of those skills. The next round was more focused on communication and problem-solving/interpersonal skills."}], [{"date": "12 Apr 2023", "title": "Communications  and Outreach Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Sierra Club (Trenton, NJ) in Jun 2022", "Interview Descriptions": "Took about a month after submitting an application to hear back. I was to submit ~500 word responses to five different questions based on the role and my experiences. About three weeks later, I had a ~45 minute phone interview with 3 team members. A month later followed yet another interview, this time over Zoom, with three more team members. Two weeks later, I was invited to a final in-person interview at the office with the same group of interviewers plus two more team members. I had to prepare an outreach and communcations plan, which took a few hours to do. Took two weeks after that to hear back that I didn't get an offer. Over three months later between three interviews and two written tasks I was stuck in the same spot. Why it took so long and why there were so many separate tasks and interviews I don't know- a waste of an applicant's time that deterred me from seeking employment at this organization.", "Interview Questions": "How do your personal ethics play in to your professional life?"}, {"date": "12 Apr 2022", "title": "Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Sierra Club in Feb 2022", "Interview Descriptions": "Dec 2021 - Submitted Application via website.\r\nJan 2022 - Hiring Manager sent questionnaire which I completed and returned.\r\nFeb 2022 - 30 minute screening  with the Hiring Manager and the individual who still held the position.   The two asked questions - which were about the same as what was included in the questionnaire for which I had already provided written responses the month prior. A majority of my responses were cut short as the hiring manager insisted on asking each question but did not want to exceed the 30 minute time slot. I managed to ask a typical question at the end of the call, the answer provided by the current development staff member suggested a lack of modernized nonprofit development experience.  I did not receive communication of any kind following the screening phone call.  \r\nApril 2022 - Position opening appears to be heavily promoted again.  \r\nLeadership can't advance the organizational mission and revenue if they can't even get out of their own way.", "Interview Questions": "Share an example of a successful fundraising campaign from start to finish. "}, {"date": "19 Apr 2022", "title": "Associate Director Legislative & Administrative Advocacy Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Sierra Club in Feb 2022", "Interview Descriptions": "The interview process was average and consisted of two separate interviews. One preliminary talk with the hiring director and then another interview with the DC office. However, they asked to see a writing sample once I was a finalist in the hiring process and when I sent in my writing sample, they never contacted me again. I thought this was odd because up until that point they were communicative and then just ghosted me at the very end of the process.", "Interview Questions": "What challenges can you foresee in a position like this? How would you deal with conflicting opinions or positions on an issue?"}, {"date": "6 Nov 2021", "title": "Recruiting Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Sierra Club", "Interview Descriptions": "After submitting an online application, an HR representative will send an e-mail with several short-answer questions that require 150-word answers. The responses need to be sent within a week before they will speak with you.", "Interview Questions": "1. What about the Sierra Club's approach and mission excite you the most? 2. What role do see Sierra Club playing in the social justice movement and how do you see their mission aligning with the role? 3. Briefly describe a project or initiative you participated in that you are proud to share. Be specific. 4. Talk about your experience. 5. Submit a brief statement that will enable us to understand the contribution your personal background would make to our team."}, {"date": "6 Nov 2021", "title": "Conservation Technician Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Sierra Club", "Interview Descriptions": "It was very drawn out. I really wanted the job but it had many levels of interviews and I had been out of work for so long. I had other job interviews happening and had to take the other job instead of continuing down the process. I always wonder what would have happened had I had the time to wait.", "Interview Questions": "What do you consider an area of weakness?"}, {"date": "3 Sept 2021", "title": "Volunteer Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Sierra Club", "Interview Descriptions": "Went through 4 different interviews and they were thorough with lots of meetings with all the stakeholders. Heavy emphasis placed on past experiences, it felt like it would be very difficult to get the job without prior experience doing some kind of environmental volunteer coordination work.", "Interview Questions": "How would you manage in an organization where the majority of the on the ground work is done by volunteers rather than paid staff?"}, {"date": "30 Apr 2022", "title": "Digital Content Strategist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 8 weeks. I interviewed at Sierra Club in Sept 2021", "Interview Descriptions": "Emails + Zoom screen for about 30 minutes, the interviewer was not particularly focused on me as an individual or seeming engaged in my candidacy -- she may have been -- however that wasn't my takeaway. I also felt the screening process was designed to identify political sensitivities and leanings. Which is understandable for a progressive organization.", "Interview Questions": "DEI specific re: white supremacy "}, {"date": "26 Jul 2021", "title": "Campaign Representative Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Sierra Club", "Interview Descriptions": "The interview process was not handled by HR and took months to schedule and complete. I thought multiple times that I had been ghosted. It was not a great experience.", "Interview Questions": "What does environmental justice mean to you?"}, {"date": "7 Jun 2021", "title": "Political Organizer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Sierra Club", "Interview Descriptions": "Short and easy to complete.  You turn in a resume and then have two rounds of interviews. They were very fair in their questions. Most of the questions revolve around electoral organizing / direct voter contact.", "Interview Questions": "How would you create a script?"}, {"date": "24 Mar 2021", "title": "Summer Fellowship Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Sierra Club", "Interview Descriptions": "After submitting my resume, they had a video interview where they gave an overview of the position, asked what topics interested you, and if you were willing to relocate, etc.", "Interview Questions": "What environmental issue interests you?"}], [{"date": "12 Mar 2021", "title": "Advocate Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Sierra Club", "Interview Descriptions": "The interviewing process was smooth, seamless, and to the point. In total I had 3 rounds. From there, I was on boarded approximately a month later. No complaints from their process", "Interview Questions": "An interviewing question was tell me about yourself"}, {"date": "10 Feb 2021", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Sierra Club", "Interview Descriptions": "Fairly straight forward; a lot of questions about organization skills and personal assistant things I'd be willing to do for my boss. \n\nBe prepared to answer questions about why you want to work at the SC, its history, etc.", "Interview Questions": "What tools do you use for organization? \n\nDo you have familiarity with databases? "}, {"date": "6 Feb 2021", "title": "Research Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Sierra Club", "Interview Descriptions": "Interviewed with a small state office. Interviewed by the director and a committee chair. Applied by email (resume and cover letter), then had one interview, and offered a job after the interview.", "Interview Questions": "What work or education do you have that's relevant for the position?"}, {"date": "25 Sept 2021", "title": "Digital Outreach Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Sierra Club in Feb 2021", "Interview Descriptions": "It started with a phone interview with the manager. He was very personable and asked typical interview questions related to the job. I then did a Zoom interview with him and two members of the hiring committee.", "Interview Questions": "What environmental issue are you most passionate about"}, {"date": "15 Jan 2021", "title": "Campaign Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Sierra Club", "Interview Descriptions": "Two virtual interviews with a writing assessment between the two.  First interview was with the direct supervisor and the second interview was with the hiring committee as it was a combined state and national position.", "Interview Questions": "What steps would to take to plan a volunteer-based event?"}, {"date": "19 May 2021", "title": "Senior Campaign Representative Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Sierra Club (New York, NY) in Nov 2020", "Interview Descriptions": "The interview involved a pre-screen, a formal interview, and then an interview before a small panel with other candidates. Writing assignments were also a part of the process. The Sierra Club was very focused on hiring folks from environmental justice backgrounds.", "Interview Questions": "What motivated you to apply for this position?"}, {"date": "18 Dec 2020", "title": "Press Secretary Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Sierra Club (Washington, DC) in Oct 2020", "Interview Descriptions": "I got an email requesting a video interview, and the interviewer took a long time to respond after she sent me a request to interview me. She seemed unorganized and uncaring. Once we were on the video call, she was cold and weird. She even asked me my zodiac sign at the end of the call. I dodge a bullet.", "Interview Questions": "What's the meaning of intersectionality?\nWhat's your zodiac sign?"}, {"date": "28 Aug 2020", "title": "Communications Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Sierra Club", "Interview Descriptions": "Completed phone interview, was sent lengthy writing assignment evaluating a current Sierra Club project (free evaluation for them), was given a second round interview, expecting to discuss my evaluation and my qualifications, but instead I was blown off and asked questions that I felt were designed to remove me from further consideration.", "Interview Questions": "What is your writing process like?"}, {"date": "13 Jul 2020", "title": "Legislative Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Sierra Club in Jun 2020", "Interview Descriptions": "Applied online.  The overall process took 4 months, included 4 phone/Zoom interviews with rapid-fire questions and a writing test.  Then after all that, wasn't offered the role. Ridiculously excruciating process, NOT WORTH IT!", "Interview Questions": "How would you prioritize x , y, and z?"}, {"date": "26 Jul 2020", "title": "Political Organizer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Sierra Club in Jun 2020", "Interview Descriptions": "Such a disrespectful org.  Had a five person Zoom call for this role.  The interview was fairly easy and I was well qualified.  Was given a timeline of when a decision was expected.  Had to chase down the person who sent the initial interview not once, but twice, to get an answer.  Sierra Club does NOT respect their candidates nor respect their time!", "Interview Questions": "What are good elements of a call script?"}], [{"date": "17 Feb 2020", "title": "Field Organizer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Sierra Club (Chicago, IL)", "Interview Descriptions": "Filled out the application and then did a pretty straightforward phone interview. Got a job offer about a week later. The team is very nice and helpful, and I got the impression that they are always looking for more team members!", "Interview Questions": "Do you have experience canvassing/working with campaigns?"}, {"date": "29 May 2021", "title": "Frontline Activist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Sierra Club (New York, NY) in Feb 2020", "Interview Descriptions": "Remote interview, very short and surprisingly unprepared interviewer. I don’t believe she had my resume in front of her. I had to talk through my work experience and she sounded surprised and disingenuously interested.", "Interview Questions": "Why are you interested in Sierra Club?"}, {"date": "5 Dec 2019", "title": "Clean Energy Organizer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Sierra Club", "Interview Descriptions": "Applied online and received an interview. There were three people on the other side of the line - the interviewers seemed to need someone urgently and asked questions about my availability.", "Interview Questions": "Why are you interested in this position?"}, {"date": "4 Nov 2019", "title": "Associate Attorney Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Sierra Club", "Interview Descriptions": "It was a panel interview with team members from various offices throughout the country. The interview was very structured, with each panelist asking questions in turn, presumably the same questions asked of every candidate.", "Interview Questions": "Have you encountered issues of privilege in the workplace, and how did you handle them?"}, {"date": "25 Oct 2019", "title": "Community Outreach Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Sierra Club", "Interview Descriptions": "You must do 2 interviews. One over the phone and one in person. The hiring process moves fairly quickly, over a spandexes of three weeks. Emailed back and forth with the manager, they required 2 references. in person interview is an panel interview", "Interview Questions": "Describe a time where you had to culturally competent \r\nWhy are you the best person for this job"}, {"date": "2 Jun 2019", "title": "Editorial Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Sierra Club (Oakland, CA)", "Interview Descriptions": "I had two interviews, one over Skype and another in person. The interviewers were very kind, patient and professional. They went over responsibilities and then asked me about my interest in applying for the fellowship and what I wanted to gain out of it.", "Interview Questions": "Previous experience with journalism and why I want to work in environmental journalism"}, {"date": "24 Apr 2019", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Sierra Club", "Interview Descriptions": "There was an initial phone screen a couple weeks after I submitted by application online,  followed by an in person interview about two weeks after the phone screening. I heard back with an answer very quickly after the in person interview.", "Interview Questions": "How would you handle having two different people ask for your help with two different projects at the same time?"}, {"date": "15 May 2019", "title": "Senior Campaign Representative Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Sierra Club (Washington, DC) in Feb 2019", "Interview Descriptions": "I had a first interview with the person that would be my supervisor, then an online group interview with different campaign representatives in different states and then was required to travel to the HQ in DC for an in-person interview. \r\n\r\nI have a lot of respect for Sierra Club's mission but the interviewing process was very disappointing. The communication with the supervisor was very poor, I was asked to travel to DC with less than a week in advance and no flexibility on the day or the time of the interview. \r\n\r\nAfter the final interview, I never heard back. I had to follow up multiple times to the point of having to reach out to a person above the interviewer to get an answer. More than two months after my interview, I finally learned that I was not chosen. Later I learned that they had already offered the position to another candidate and didn't inform me of their decision. \r\n\r\nI'm not sure how much the HR department is aware of the lack of protocol held by staff leading interview processes. \r\n\r\nMy advice: Treat your candidates like human beings, especially if you are a mission-driven organization.", "Interview Questions": "Create a plan to stop plans for opening hunting to an endangered specie. "}, {"date": "16 Jan 2019", "title": "Digital Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Sierra Club", "Interview Descriptions": "I applied online through Sierra Club's careers page. I heard back about 2 months later to schedule a video interview. Overall, the process was simple and straightforward. I enjoyed the experience and felt that the interview was personal.", "Interview Questions": "What sort of digital project would you be interested in pursuing during your fellowship?"}, {"date": "23 Apr 2022", "title": "Canvasser Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Sierra Club (Honolulu, HI) in Jan 2019", "Interview Descriptions": "It was a very positive experience and the interviewer was a very kind lady. They called me in and I was able to interview that same day. I went to their local office and was offered refreshments.", "Interview Questions": "Why do you think you would be good for this job?"}], [{"date": "8 Oct 2020", "title": "Law Clerk Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Sierra Club (Washington, DC) in Oct 2018", "Interview Descriptions": "Interviewed at a job fair. It went well - but they were looking for candidates from top-ranked law schools. I was excited for the interview itself. And the interviewer was kind and offered to follow up regardless of whether I got the job or not.", "Interview Questions": "What had my role in climate law looked in the past?"}, {"date": "27 Apr 2019", "title": "Political Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Sierra Club (Lansing, MI) in Jul 2018", "Interview Descriptions": "It was over the phone due to scheduling and it was easy and gave background information about my experiences. They asked about work experience and about the registered student organizations that I was apart of.", "Interview Questions": "Tell me about the student organizations you were a part of?"}, {"date": "16 Jan 2020", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at Sierra Club in Mar 2018", "Interview Descriptions": "Know your state/local government. Lots of questions on current local political issues. As well as typical interview questions.  Two stages of the interview. Relatively easy interview if you know your stuff and brush up on important issues.", "Interview Questions": "What current political issue are you most passionate about?"}, {"date": "5 Mar 2018", "title": "Operations and Compliance Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Sierra Club in Feb 2018", "Interview Descriptions": "Submitted an application and heard back unexpectedly 2-3 weeks later via email. We scheduled a phone interview with the department’s manager for the following week. I thought the phone call went really well, and about a week later, I was invited to do a video interview even though I am located where the HQ is in Oakland. \r\n\r\nThe video interview was with the person who interviewed me over the phone, and 4 others in the department. It took about an hour. They told me it would take at least 2 more weeks after before they would have any updates. \r\n\r\nI emailed 2 weeks later, and they revealed to me that in the two weeks I waited to hear back, they chose someone else for the position.", "Interview Questions": "What do you know about our initiatives?"}, {"date": "9 Jan 2018", "title": "CRM Support Staff Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Sierra Club (Washington, DC) in Oct 2017", "Interview Descriptions": "I did a first round phone interview and then flew to DC for a second round group interview. They never got back to me about whether I got the job, even after 3 emails. No excuse for that. Got reimbursed for the travel though.", "Interview Questions": "Give us a time you dealt with an obstacle and how you tackled it."}, {"date": "13 Jun 2017", "title": "Program Training Director Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Sierra Club (Oakland, CA) in Jun 2017", "Interview Descriptions": "40 minutes over google hangout or phone. Fourteen resumes chosen from hundreds of applicants. Within days of interviewing everyone, called up everyone to let them know if they were selected or not and explained why or why not. Very considerate and professional.", "Interview Questions": "What is your philosophy as an organizer?"}, {"date": "15 Apr 2019", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Sierra Club (Providence, RI) in May 2017", "Interview Descriptions": "I had a phone interview because I was out of state at the time. The interview was around 45 minutes and was a fairly typical interview. By the end of the interview, I felt like I was having a conversation with my interviewer more than I was being quizzed or evaluated. It was clear that they were looking for someone who fit the ideals of the organization and really expressed that the internship experience was what you chose to make of it.", "Interview Questions": "What experience do you have that would make you successful in this position? "}, {"date": "5 Apr 2017", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Sierra Club (Oakland, CA)", "Interview Descriptions": "1st round e-interview via hangout with potential manager & interim employee. 2nd round: travel to HQ for series of interviews with leadership & team members (5 in total). 3rd round e-interview: connect with Union Rep.", "Interview Questions": "What does an ideal work environment look like to you? "}, {"date": "5 Feb 2017", "title": "Associate Organizing Representative Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Sierra Club (Seattle, WA)", "Interview Descriptions": "Had an initial 30-minutes phone interview that asked basic questions. A few days later, I was invited into the office for a second interview, this time with 4 other staff members.", "Interview Questions": "Why do you want to work here?"}, {"date": "17 Jan 2017", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Sierra Club (New York, NY)", "Interview Descriptions": "Two interviews; first a phone interview with direct supervisor, and second a video interview with direct supervisor and colleague.\r\nBoth interviews lasted about 20 minutes each, with quite a bit of time taken up by position description.\r\nEntire process took about three weeks (moves very slow).", "Interview Questions": "Why is social equity important to you?\r\nWhat are you interested in this position?\r\n"}], [{"date": "8 Dec 2016", "title": "Grant Writer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Sierra Club (New York, NY)", "Interview Descriptions": "After sending in my resume and cover letter, they asked that I complete a written evaluation of my skills. Afterward, I was interviewed by a group of 5-6 people. I was not offered a position.", "Interview Questions": "What interests you about this position?"}, {"date": "1 Oct 2016", "title": "EditorialAt Sierra Magazine Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Sierra Club in Jul 2016", "Interview Descriptions": "I was contacted two days after I submitted my application and was asked for a skype interview the next week. The interview was pretty normal, why I wanted the position, why I would be a good fit, what ideas I had to write about, etc. Then two days after that they offered me the position.", "Interview Questions": "Why do you want to work at Sierra?"}, {"date": "8 May 2016", "title": "Community Outreach Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Sierra Club (Richmond, VA) in Apr 2016", "Interview Descriptions": "I applied for the Community Outreach Coordinator Position at the Richmond, Va Chapter and received an interview request two days later. I was told that they were hoping for a fairly quick hiring process and we scheduled my phone interview for a week and a half later. The phone interview went really well! I felt like I connected well with the hiring manager and I was very enthusiastic and showed my excitement for the position. The woman was pretty professional over the phone and I got a great feeling about the office and work environment.\r\n\r\nThe phone interview happened on a Friday and I received an email Monday evening telling me two things: One that I was qualified for an in person interview (to be scheduled the following week on a Thursday or Friday) and that the hiring manager would get back to me by the end of that current week with a time. Secondly I was asked for a sample of my writing, which I wrote and sent back in a few hours after receiving the email. \r\n\r\nI waited and didn't receive an email by the end of the week and decided to follow-up on Sunday evening with an email inquiry. I was working full time and needed ample time to ask off for the interview that was to be scheduled. I did not hear anything the next day which was a Monday so I decided to give the office a call on Tuesday morning. No one answered so I left a message explaining that I needed to ask off that day if I was going to be able to participate in an in-person interview that Thursday or Friday. I waited and did not receive a phone call or email. Thursday came and went and on Friday I received a rejection email telling me that a lot of people had applied and they decided to go with a more qualified candidate, but that they hoped I would join in their fight by volunteering. They also informed me that because of the amount of applications they had received they wouldn't be able to respond to any application questions based on my application experience. \r\n\r\nI was honestly shocked by the lack of professionalism and communication by their office. I was told that I had qualified for an in-person interview, but wasn't given the curtesy of a time scheduled. At the time I was very disappointed because I thought I wanted this job more than any other job I had applied to. After my experience I realized that it was probably for the best because if this is how they communicate with and treat potential employees, then I can't imagine the lack of communication and order they have in the work environment with current employees. \r\n\r\nMy advice to anyone applying to the Richmond, Virginia Chapter is to take it slow, interview the hiring manager just as much as they're interviewing you, and make sure you're aware that a lack of communication may be a possibility.", "Interview Questions": "Why do you want this position?\r\nWhy do you want to work for the Sierra Club?\r\nDefine Climate Change in your own words.\r\nTell me what your greatest strength is.\r\nTell me what your greatest weakness is."}, {"date": "10 May 2016", "title": "Deputy Press Secretary Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 months. I interviewed at Sierra Club (Seattle, WA) in Apr 2016", "Interview Descriptions": "The position was initially posted about six months ago.  I applied after seeing the opening two months later.  After another month I found out there was a delay because the person supervising the position was changing.  After another month I was contacted by phone to see if I was still interested in the position.  After several more weeks I recontacted to see what the status was and was advised I'd be contacted for for a phone screening. I was finally scheduled for a 15 minute phone screening a week later.  After doing the phone screening, no contact from them for three weeks.  Found out through other channels that they had sent around internal emails seeking additional candidates after the phone screening.  Called back the interviewer to see what the status was and was advised someone else would contact me.  Subsequently was advised that they were moving forward with other candidates.", "Interview Questions": "How I would address issues of inclusiveness with a diverse set of stakeholders."}, {"date": "31 Mar 2017", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Sierra Club (Washington, DC) in Apr 2016", "Interview Descriptions": "The interview was a very standard behavioral question based interview. The interviewer was a bit cold and i didn't think she liked me until she offered me a position.", "Interview Questions": "- why i chose my major\r\n- what i want to get out of the internship position\r\n- future goals"}, {"date": "2 May 2016", "title": "Communications Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Sierra Club (Austin, TX) in Feb 2016", "Interview Descriptions": "I applied online and was requested for a phone interview a few weeks later. Applications are submitted through the national chapter and you are contacted based on the position you applied for. I had issues with the  local interviewer obviously not thoroughly reading my cover letter and the organization never following up as a whole. This is disappointing since you expect more from a \" socially conscious\" organization.", "Interview Questions": "Overall basic phone interview questions: ask about experience and go into an in-depth explanation of the role. Major issue with no follow up."}, {"date": "24 Feb 2016", "title": "Political Compliance Officer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Sierra Club (Washington, DC) in Feb 2016", "Interview Descriptions": "I found the job online. I applied and got an email in about 2 days about when to set up a phone interview. We had to do some schedule maneuvering because the interviewer was traveling. \r\n\r\nWe had about a 20 minute phone conversation about the position and what it entailed. While I had a lot of experience that would have been perfectly relevant, I was disappointed to find that the job seemed to be geared more towards training than research (the job description made me think it was more of a research position with its emphasis on gathering information, managing reports, etc.). What was also not listed at all in the job description was traveling to do these trainings. \r\n\r\nI was a bit caught off guard and I think that probably reflected in my interview. The interviewer seemed more interested in having someone who had already done actual trainings before.\r\n\r\nThe interviewer said he'd let me know by the middle of the following week. The end of the following week went by plus a few more days and I followed up by email. In reply I received a form email letting me know I did not get the position. It was a little disappointing to have to prompt them in order to find out whether I should move on or not.\r\n\r\nI never met the interviewer in person. Honestly I wasn't too upset because while I had been very excited when I read the job posting, the fact that travel wasn't listed as part of the job made me wary and the emphasis on training during the interview (despite not having been thoroughly detailed in the job posting) told me this wasn't going to be a good fit. It wasn't a lot of trips (5-6 total a year across the country I think) but travel is usually listed in job postings and it seemed very odd that this wasn't at all mentioned if it's required to train people.", "Interview Questions": "What interested me in this position? Did I have experience in conducting trainings? What was my experience with campaign finance compliance?"}, {"date": "29 Jan 2016", "title": "Campaign Representative Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 3 months. I interviewed at Sierra Club (San Francisco, CA)", "Interview Descriptions": "I was personally recommended for the job by two different people - one inside the organization and one who knew the hiring manager personally. The interview process was pretty protracted - first a one-on-one skype interview, then another skype interview with five different people located in different parts of the country. I expressed interest in meeting in person with the two people located near me, but I never met anyone in person. There were long stretches of the time (weeks) in between each phase, both of which I followed up on, and after all that I never received any word on their hiring decision. (I had to follow up again a month or two later to find out that they'd hired someone else.)", "Interview Questions": "How would I approach running a campaign in a city that didn't have a typical 'environmentalist' (i.e. white upper-class liberal) population?"}, {"date": "25 Sept 2016", "title": "Political Inern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Sierra Club in Jan 2016", "Interview Descriptions": "One interview, in Lansing. Submitted application, got an email response. Solidified a mutual meeting time to have an interview at the Michigan HQ. Overall a pretty easy process and one that helped the interviewee get to know more about the position and organization.", "Interview Questions": "Why are you interested in the position? \r\nAny politial experience?"}, {"date": "2 Dec 2015", "title": "SSC Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Sierra Club", "Interview Descriptions": "Applied online, emailed with the hiring manager, had a phone interview and got the job. Super friendly, very straightforward. Just be enthusiastic and upbeat, they are looking for people that can fit into the culture. Be able to explain why you want the position,  why you want to be at the Sierra Club, and how you will mutually benefit the organization.", "Interview Questions": "Why do you want to work at the Sierra Club?"}], [{"date": "28 Oct 2015", "title": "Organizing Representative Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Sierra Club", "Interview Descriptions": "Applied online to the job posting on their website. They don't list the closing date for the job and will often keep the job up until they've extended the offer to a candidate. First round interview was on the phone and was a pretty standard screening process to see if you were qualified for the position (and not just good on paper). Second round was in person. Process was VERY slow from application to first interview. From first interview on was quick. Final notice on offer or no offer was also slow. Total process 1-3 months.", "Interview Questions": "They ran a roleplay during the 2nd round interview that was surprising. Basically judging your skills in conflict resolution and defusing a bad interaction with an employee/volunteer and a member of the public. "}, {"date": "19 Oct 2015", "title": "Associate Organizer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at Sierra Club", "Interview Descriptions": "Panel interview, with volunteer and 2-3 other staff. Held at the office. Phone conversations prior. Submit examples of previous work (campaign plans, media, etc). Not a suit type environment at all. Be yourself. Know the political landscape.", "Interview Questions": "Why do you want this job?"}, {"date": "17 Dec 2015", "title": "Online Organizer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "The process took 4 months. I interviewed at Sierra Club in Aug 2015", "Interview Descriptions": "I saw some of the reviews on glassdoor prior about how the prospective employer never got back to the interviewee, which in the end was my case. The hiring process was straight forward. I applied online, received and email with a request to set up a phone screening. The phone screening was equally simple. I was then invited again via email to a group panel interview, which was simple and enjoyable. The team was very nice, intelligent and welcoming. The process was very long- 3 months! In the end, I was passed up for an internal candidate. The prospective employer was so taken by me and the recommendations that she introduced me to another department looking for the same position. Although, I had to go through the process again, I was and am very thankful.  \r\n\r\nThe reason that I'm rating this as a negative experience is because the prospective employer never got back to me after interviewing me for an hour about the new position. After a period, I even emailed her to check in and never got a response. I understand that they are probably swamped with people because it's a great organization, however, this is a simple, common courtesy that too many are letting slip through the cracks. Being left hanging about what is the rest of the timeline and whether or not I am moving to the next step is poor.", "Interview Questions": "What has been your experience with mass text messaging systems?"}, {"date": "26 Sept 2015", "title": "Associate Organizing Representative Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Sierra Club in Aug 2015", "Interview Descriptions": "Applied for the position in early August. Had a preliminary phone interview/screening one-on-one via phone about a week and a half later. Advanced to the next step of the process which was a group video interview with several higher representatives in the company. Very professional and cordial panel. Although I did not receive the position, I had a very positive experience and rate the organization very highly.", "Interview Questions": "Q: What experience do you have on campaigns and in the non-profit sector?\r\n"}, {"date": "31 Mar 2015", "title": "Program Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Sierra Club (Washington, DC)", "Interview Descriptions": "I had one phone interview and one in person interview with the team. The phone interview was brief and was with my potential supervisor. The supervisor mostly asked about my resume and experience in my current position. The in person panel interview was candid and mostly to meet the folks on the team and get to know one another.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "13 Mar 2015", "title": "Director of Learning and Development Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through other source. I interviewed at Sierra Club", "Interview Descriptions": "I was contacted by the \"Head of HR\" via LInkedIn about a possible new position in L&D for Sierra Club.  This was a person who I had worked with at a prior company.  We scheduled a phone conversation.  The conversation covered the vision for the role and ended with an action item in which I was told he would have someone contact me for a more formal interview in the next few days.  I followed up with a Thank You LinkedIn message.  A week went by, far beyond the time frame I was told, so I sent another LinkedIn message just following up and checking the status of the process.  I still have not heard anything, and this was in October of 2014.\r\n\r\nI understand positions may come and go or not happen, but to have a HR Head say they will have someone follow up with you, after they initiated contact and to then never follow up and re-connect is poor customer service and unacceptable.", "Interview Questions": "No questions were asked"}, {"date": "13 Nov 2017", "title": "Senior Campaign Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at Sierra Club (Washington, DC) in Feb 2015", "Interview Descriptions": "After two phone calls I was interviewed in the national office.  It was simple, quick, and transparent. The individual who would be the manager for the position was clear and honest about the expectations for the role.", "Interview Questions": "What will it take to win this campaign?"}, {"date": "20 Oct 2014", "title": "Water Policy Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 5 days. I interviewed at Sierra Club", "Interview Descriptions": "I head about the Sierra Club through a friend and was very excited to work with a great environmental group. My interview went well and I was hired within 2 hours. I was told I would be a water policy intern working in an open work space (like a think tank).", "Interview Questions": "They didn't ask anything too hard. They did ask how you previously overcame a difficult experience at a workplace or internship. "}, {"date": "19 Sept 2014", "title": "Associate Organizer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Sierra Club (Seattle, WA)", "Interview Descriptions": "The manager was unprepared. They interviewed for the same position 6 months apart and never hired anyone. ANYONE. Ask the Sierra Club if they are actually hiring or if the interview is fake. Maybe they are unorganized and rudderless on purpose? Maybe they enjoy meeting overqualified candidates and waste his/her time?", "Interview Questions": "Are you able to manage your time effectively and without getting into trouble if unsupervised?"}, {"date": "4 Jun 2015", "title": "Research and Polling Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 3 months. I interviewed at Sierra Club (Washington, DC) in Sept 2014", "Interview Descriptions": "Monitor and compile national environmental polls and research for 300 staff members and lobbyists.\r\nDraft a one page report every 2 weeks for Sierra Sync online newsletter with ~400 staff and volunteer readers.\r\nDraft and edit polling briefings and newsletters related to environmental issues, such as climate change.", "Interview Questions": "Why do you want to work for the Sierra Club"}], [{"date": "29 Mar 2018", "title": "Communications Director Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Sierra Club (Los Angeles, CA) in Aug 2014", "Interview Descriptions": "Interviewed by committee of 6. Referred by the predecessor, who was a friend. This interview was farcical and people spent as much time talking to each other as they did to me re: my qualifications.", "Interview Questions": "Why do you want this job?"}, {"date": "4 Aug 2015", "title": "Communications Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Sierra Club (Seattle, WA) in Jun 2014", "Interview Descriptions": "First I had a phone interview and discussed the details of the position, which made me realize the position was pretty flexible as would be the sort of experience where you get out of it what you put into it.", "Interview Questions": "Tell me about yourself and why you are interested in the Sierra Club."}, {"date": "1 Aug 2013", "title": "Conservation Organizer Apprentice Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Sierra Club (Chicago, IL) in Jul 2013", "Interview Descriptions": "I sent a cover letter and resume online. Was contacted for a phone interview and then for a google hangout interview. I was told I would contacted within the next week regarding their decision, I heard nothing and even after contacting them, I have gotten no response... Not very professional on their part.", "Interview Questions": "They mainly asked questions about my previous experience and to expand on my resume"}, {"date": "13 May 2013", "title": "Dipl.-Reha-Pädagoge Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Sierra Club", "Interview Descriptions": "The hiring process took a long time. I applied for two positions on the same day - one with Sierra Club, and one with another organization. They both responded to me on the same day to schedule an interview. Unfortunately, it took the Sierra Club three weeks to schedule me for an in-person. I was given an offer by the other company in the interim.", "Interview Questions": "N/A"}, {"date": "21 Feb 2017", "title": "Legal Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Sierra Club (San Francisco, CA) in Feb 2013", "Interview Descriptions": "good, felt comfortable and the environment was relaxing. They expect you to have the same passion and eagerness to move the company forward and fight there fight. My position was more can you make us more able to fight laws that stop us from protecting our goals.", "Interview Questions": "what can you bring to sierra club"}, {"date": "19 May 2012", "title": "Senior Front End Web Developer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Sierra Club (San Francisco, CA) in Apr 2012", "Interview Descriptions": "The interview process took place over quite an extended time-frame. After the initial phone screen, I was given an exercise to complete (a little strange in terms of design...but OK), which took roughly a couple hours. Following that, about a week later, was a second phone interview, and then a couple weeks after that a face-to-face interview in the office, first with a panel and then with the manager and the director. And then finally there was a 2 week waiting period before hearing the results. Not once did I have any hesitation about the place, the job, or any of the several people with whom I spoke--all were completely cordial and professional. And combined with the fact that I particularly respect and appreciate what the Sierra Club does, I very likely would have taken the job had it been offered to me--assuming the salary had been adequate (see previous interview writeup).\r\n\r\nFurthermore, even though they did not end up making me an offer, I would have still given the experience a positive rating if it weren't for one aspect. All along the process from beginning to end, whenever Drupal was mentioned I clearly stated that, though I had worked with other CMS's, I had not worked with that particular CMS before (although I assured them I would do all I could to come up to speed prior to starting if selected-- and they always said 'no problem'--including at the in-office interview; in fact they consistently seemed very positive about my suitability for the position. So when they informed me 2 weeks later that they had offered the job to someone else and I asked what took me out of the running, I suppose it was sort of a surprise and yet not a surprise that they said...Drupal! Seems to me it would have saved a good deal of time for all involved if they had first interviewed only those candidates with prior Drupal experience before moving on to other candidates such as myself.\r\n\r\nSo I have to say the way it was handled was disappointing given the long tradition of Sierra Club membership in my family--as a matter of fact, Ansel Adams was a good friend of my father (true story!).", "Interview Questions": "Why did you apply to the Sierra Club?"}, {"date": "29 Aug 2015", "title": "Litigation Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Sierra Club (San Francisco, CA) in Dec 2011", "Interview Descriptions": "At first their was a phone interview with the Director of the department. After that they followed up with an in person interview. The in person interview was with the senior manager and 5 other current litigation assistant employees.", "Interview Questions": "What, other than those related to climate change, is one of the biggest threats to the environment?"}, {"date": "9 Sept 2011", "title": "Webmaster, Web Training Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 1 day. I interviewed at Sierra Club (San Francisco, CA) in Aug 2011", "Interview Descriptions": "Casual work environment, friendly staff. Web and training related, role so asked to prepare a mock training session. Spent several hours preparing a training outline and development a mock training session that covered how to maintain web content in their Drupal environment. Interviewed briefly with hiring manager, then a panel interview which including this mock training session. 1-1 and panel/training session went well, but when hiring manager did a follow up call to discuss salary expectations, the absolute highest salary offered was 10's of thousands below market rate (even considering this is a not-for-profit organization). Notice recently as of 9/2001 position is still unfilled. Shame. Would consider the role if it was closer to market rate. San Francisco is an expensive place to live and the skill sets required for the job command a much more realistic salary.", "Interview Questions": "How to's - using their Drupal setup"}, {"date": "29 Dec 2014", "title": "Associate Organizer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Sierra Club in Apr 2010", "Interview Descriptions": "I submitted my resume and cover letter by email. Took almost 2 months to hear back from the hiring manager, but once I did, the whole process only took about 1 month. There was one phone interview and an in-person interview, both with several people.", "Interview Questions": "What is a failure you've experienced and how did you deal with it?"}, {"date": "27 Aug 2013", "title": "Associate Organizer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Sierra Club (San Francisco, CA) in Jul 2009", "Interview Descriptions": "I applied but was not interviewed for a few months. First I had a phone interview with 3 or 4 people, then they flew me out to the city where I'd be based for an in-person interview. The dress was very casual - I was glad I didn't wear a full suit! About a week later, they made an offer.", "Interview Questions": "I was asked to talk about a time I had failed."}], [{"date": "27 Sept 2012", "title": "Apprentice Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Sierra Club (San Francisco, CA) in Apr 2009", "Interview Descriptions": "I filled out an application with a long essay question/personal statement. My interview was over the phone because the panel interviewers were on the opposite end of the country. They asked me about my interest in working for the Sierra Club, my interest in environmental issues, and my strengths and personal qualities.", "Interview Questions": "I can't remember... the interview took place a long ago."}, {"date": "4 Dec 2012", "title": "Director Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Sierra Club (New York, NY) in Aug 2008", "Interview Descriptions": "Decent communication beforehand. Easy going interview that encouraged discussion and openness. Good followup questions that allowed me to present my qualifications in a context that was relevant to the position. Naively, though, I did not pick up on several signs that the organization itself is rather dysfunctional in terms of employee well-being.", "Interview Questions": "Lots of people want to work for The Sierra Club. Why would we select you over others? "}, {"date": "18 Apr 2010", "title": "Media Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Sierra Club in Jun 2008", "Interview Descriptions": "The interview had two stages. The first was a panel interview with the supervisor and a member of another department. The second stage was another panel interview with the supervisor, the head of the department and a peer level staff member. The work culture appeared relaxed (staff members dressed casually, the atmosphere was casual).", "Interview Questions": "Discuss a work experience that was challenging."}]]