[[{"date": "20 Mar 2023", "title": "Product Marketing Manager/Senior PMM Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Indian School of Business (Mumbai) in Mar 2023", "Interview Descriptions": "The talent acquisition personnel 'Frank Samuel' reached out to check availability for the first round. Reached out with an assignment directly for the first round. Asked current and expected salary range and further shared the assignment.", "Interview Questions": "Reached out with a detailed product launch assignment directly for the first round."}, {"date": "4 Oct 2022", "title": "MBA Student Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 7 months. I interviewed at Indian School of Business (Mumbai) in Sept 2022", "Interview Descriptions": "Very interactive yet tedious. But the experience is well nourishing. It is usually a 40 minute interview with 4-5 panelist most of them are alumni. They judge you on the basis of your goals and resume.", "Interview Questions": "Tell me, where do you see yourself after graduating from ISB"}, {"date": "12 Nov 2022", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Indian School of Business in Apr 2022", "Interview Descriptions": "1 round interview . Question based on resume or CV. Questions based on previous projects done. Analytical and problem solving skills check. Interview was easy. Interviewer was very supportive. Bhari Institute of Public policy, Indian School of Business, Hyderabad, India", "Interview Questions": "Based on CV and previous projects"}, {"date": "25 Oct 2021", "title": "Summer Research Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Indian School of Business (New Delhi) in Jun 2021", "Interview Descriptions": "One Telephonic Interview for 30-45 mins. After that HR contacts over email regarding the selection and other formalities like duration, compensation and all.\r\nAfter accepting the offer they send ISB credentials", "Interview Questions": "1- Programming languages like python and R\r\n2- Proficiency in GIS and Remote Sensing"}, {"date": "30 May 2021", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Indian School of Business", "Interview Descriptions": "This was for a position in the Center for Analytical Finance. There were interview questions on topics such as linear algebra and statistics. Questions on trading strategies was asked. Questions surrounding motivation to work in the role were asked.", "Interview Questions": "Please explain what Kronecker Delta is."}, {"date": "15 Apr 2021", "title": "General Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Indian School of Business", "Interview Descriptions": "Good process, quick and reliable. GOOD Team, does not take a lot of time, fineshes it off soon and very friendly. Interview process is smooth. interviewers are very patient. Overall it provides a good learning experience.", "Interview Questions": "Plans for next 5 years"}, {"date": "15 Jul 2022", "title": "Academic Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Indian School of Business in Mar 2021", "Interview Descriptions": "Applied on the school's website. Got a call in a few days. Interview got scheduled and it was really smooth and easy one.\r\nIt was a generic interview to get to know about one's persona and interest in the role.", "Interview Questions": "Introduction and a walk through resume. "}, {"date": "6 Sept 2020", "title": "Research Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Indian School of Business", "Interview Descriptions": "1. CV shortlisting, only those with a CGPA above 8 were contacted, with a few exceptions because of extraordinary profiles.\r\n2. Interview - Mainly test your coding skills and interest in Finance", "Interview Questions": "How to scrap data using selenium?"}, {"date": "9 Sept 2020", "title": "Research Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Indian School of Business in Aug 2020", "Interview Descriptions": "It was overall a good experience. The questions were easy and learned a lot. The interviewer was too good. Thought will get the offer for the one vacancy position available. But, Didn't got the offer. Waitlisted.", "Interview Questions": "Analytical portion or Theoritical portion-Which will be my future focus"}, {"date": "26 Sept 2022", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Indian School of Business (Hyderābād) in May 2020", "Interview Descriptions": "The process consists of 4 rounds. The school doesn't care if you are from IIT or IIM or some 3rd tier college until the phase where they decide your TC. They treat all candidates equally for up to 4 rounds. \n\nThe process takes about 2-3 months. Sometimes it gets completed within a month, but it is rare. Expect at least 2 months. ", "Interview Questions": "Round-1: Technical round. Three questions (1 week time). Topics on Web Scraping, NLP, ML Clustering, and Classification models.\n\nRound-2: Personal Interview with the Team of professors and associates to understand your background. \n\nRound-3: Research paper round. You are given a research paper on NLP/DL/GANs and are asked to review it and provide a 10 min presentation.\n\nRound-4: Hiring/Reporting manager personal interview (10 mins max) gets to know your background and motivation"}], [{"date": "21 Jan 2022", "title": "Data Analytics Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Indian School of Business (Hyderābād) in Apr 2020", "Interview Descriptions": "Contact the professor through email and attach your CV and cover letter with it you will get call from the scholars who are working under the proff only one round of interview was conducted questions were mainly from cv", "Interview Questions": "Questions were mainly from the cv "}, {"date": "3 Feb 2020", "title": "Marketing Communications Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "The process took 1+ week. I interviewed at Indian School of Business (Hyderābād)", "Interview Descriptions": "There were 2 rounds - F2F interview followed by test assignment. The interview lasted for 30 mins and entire job scope was well articulated so was the written assignment for which one had to spare 2 hours.", "Interview Questions": "Do you understand the job profile"}, {"date": "2 Oct 2020", "title": "Data Scientist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Indian School of Business (Hyderābād) in Jan 2020", "Interview Descriptions": "It was a good experience and we talked about past experience with data science work. After this we discussed how to approach the project at hand and what solutions we could apply", "Interview Questions": "Past experience with data science work? "}, {"date": "26 Jan 2021", "title": "MBA Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Indian School of Business in Jan 2020", "Interview Descriptions": "30 min interview, but usually it's 45 mins to an hour. Questions about my CV. Questions about my background, where you see yourself in 5-10 years, etc etc. Why ISB? How will the MBA help you achieve your goals, etc.", "Interview Questions": "Why an MBA? Where do you see yourself?"}, {"date": "12 Dec 2019", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Indian School of Business (Hyderābād) in Feb 2019", "Interview Descriptions": "I emailed to the concerned professor to work under his guidance. This was followed up by series of assignments given to me in python programming language after successfully completing them I submitted my work to the professor which after her review was approved. which was followed by background check and finally I was selected.", "Interview Questions": "Are you comfortable in working with python and R programming language?"}, {"date": "9 May 2018", "title": "Academic Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Indian School of Business (Mohali, Punjab) in May 2018", "Interview Descriptions": "Applied online, had an interview with a really cool professor. He asked everything mentioned on my resume. Very basic questions. And why I wanted to join Indian school of business", "Interview Questions": "N/A"}, {"date": "3 Jul 2017", "title": "Analyst Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Indian School of Business", "Interview Descriptions": "2 rounds of interview and 1 face to face interview in  campus. Fairly regular questions based on personality, work and domain area. The first round was rigorous whereas the other two were merely for formality.", "Interview Questions": "Why do you want to join ISB?"}, {"date": "21 Feb 2018", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 3 weeks. I interviewed at Indian School of Business (Hyderābād) in Jun 2017", "Interview Descriptions": "The interview is a multiple round interview staring with the concerned department followed by HR round in case of selection. The Interview panel consists of people of multiple departments i.e. internal stakeholders to ensure the fit in the matrix organisation.", "Interview Questions": "How would you contribute to this role?"}, {"date": "13 Nov 2015", "title": "Manager - Admissions and Financial Aid Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 4 months. I interviewed at Indian School of Business (Hyderābād) in Jul 2015", "Interview Descriptions": "Applied through a referral. Preliminary HR interview followed by 3 rounds of interactions with the Senior Manager and 1 round with the Director.\r\n\r\nThe interview process took over a period of 4 months (July - November 2015) which itself is an indication of no clarity on the process. With regard to professionalism, this is the worst organization that I interviewed with ever. They verbally make an offer without anything on paper. Several messages and calls later, they keep asking you to \"have patience\" and provide other sanctimonious suggestions such as \"we encourage you to look for other jobs if our offer is delaying you\". \r\n\r\nFrom my understanding, they generally hire ISB graduates with no offers from visiting companies during placements. It is a surprise how utterly incapable they will be of holding a job themselves. They can't hold a conversation with integrity - they lie, delay things and leave you in muck.\r\n\r\nMy suggestion, Keep Away!", "Interview Questions": "Q: Reasoning behind shift of job\r\nQ: Role related suitability questions\r\nQ: PPT presentation suiting the job role"}, {"date": "8 Jul 2016", "title": "Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 1+ week. I interviewed at Indian School of Business (Hyderābād) in Jun 2015", "Interview Descriptions": "More of a conversation. No difficult questions. received call from recruiter who did initial screening followed by one on one with the HR head.  soft skills based questions.  next stage with immediate supervisor who asked about fitment for the role.  final screening by dean, who will generally check cultural fit.", "Interview Questions": "Why do want this job?"}], [{"date": "3 Dec 2014", "title": "Corporate Relatioins Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Indian School of Business", "Interview Descriptions": "The interview process is pretty straight forward. No big deal. No tough questions. Well it also depends on the role that you are applying for but mine was easy. The interviewers were also not very impressive.", "Interview Questions": "N/A"}, {"date": "21 Jan 2014", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Indian School of Business (Roorkee) in Dec 2013", "Interview Descriptions": "The hiring process for RA at ISB is divided into two steps:\r\n1. Resume submission\r\n2. Telephonic Interview\r\n\r\nFirst, there was submission of resumes through online portal for two profiles: Operations management, Marketing and Sales. The candidates were shortlisted on the basis of resume/CV for each profile. The basis of selection primarily your CGPA and prior research experience(if any).\r\n\r\nThe interview for Operations management profile was difficult. Both techincal and HR questions were asked.\r\n\r\nThe interview for Marketing and Sales profile was complete HR round. The professor asked normal HR questions like \"Tell me about yourself\",\"Why do you want to join ISB\", any prior experience in business research/competitions. The candidate having prior experience in research has got a good chance in making to the ISB.", "Interview Questions": "No difficult question as such. Just normal HR questions and asked about knowledge of software like C++, Matlab etc. "}, {"date": "15 Jun 2013", "title": "Academic Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Indian School of Business (Hyderābād)", "Interview Descriptions": "Selection for interview, Interview in front of panel of experts, generally 3-4 people in panel and then if selected joining. 6 months probationary period.", "Interview Questions": "Can be from your work experience or related to qualification and future goals"}, {"date": "10 Oct 2017", "title": "Academic Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Indian School of Business (Hyderābād) in Jan 2013", "Interview Descriptions": "It is an interview with professor who was interested in knowing about your work experience and aspirations about doing a phd or long term career aspirations and they are very professional and its a enjoyable event", "Interview Questions": "Why do you want to do this job"}, {"date": "14 Jun 2014", "title": "Academic Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1+ week. I interviewed at Indian School of Business (Hyderābād) in Aug 2012", "Interview Descriptions": "1) HR INTERVIEW (basic questions about ISB).\r\n2) Technical interview with a professor in your chosed area.\r\n3) Final discussion\r\nThe interviews are easy. They just want to test willingness towards an academic career", "Interview Questions": "Do you want to do research?"}, {"date": "22 Jul 2013", "title": "MBA Student Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Indian School of Business (Hyderābād) in Jun 2012", "Interview Descriptions": "June 2012. The panel was completely disinterested in doing its job and it seemed like the decision had been made even before the interview started. Complete lack of courtesy and professionalism on the part of the professor on the panel and the two former students. I did waste significant time and money going to this. Upon my return home, I wrote to the university, and they apologized and promised to look into the situation. Since I never heard back from them, I guess nothing was done.", "Interview Questions": "\"Why don't you just go join the circus?\""}, {"date": "7 Jul 2015", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Indian School of Business (Hyderābād) in Mar 2012", "Interview Descriptions": "Interviewed by the Professor I applied to. I was asked to do some literature review as a part of the interview. Was interviewed later by another professor from the same department.", "Interview Questions": "Are you interested in pursuing a career in academic research? Why & how soon"}]]