[[{"date": "24 Feb 2023", "title": "Library Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Los Angeles Film School", "Interview Descriptions": "Progressed through phone to Zoom to on-location. Asked about past and current experience as well as assessment of character. Free tour of facilities. Friendly and communicative throughout the entire process.", "Interview Questions": "Q. How would you deal with a difficult patron?"}, {"date": "12 Oct 2022", "title": "Social Media Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Los Angeles Film School", "Interview Descriptions": "Never even contacted me and never sent any message. It would have been easier if someone contacted me prior if i would even be considered for an interview or not instead of silence", "Interview Questions": "N/A"}, {"date": "9 Mar 2021", "title": "Financial Aid Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Los Angeles Film School", "Interview Descriptions": "It went great very easy interviewed with director asked general quesiotns It went well not nerve racking at all. I had a second interview on spot with a counselor. After that I was brought back to directors office", "Interview Questions": "What my experience how last job   enjoyed m"}, {"date": "4 Jul 2020", "title": "IT Support Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Los Angeles Film School", "Interview Descriptions": "Took some time to get interview scheduled, two zoom meetings. After the second meeting I was told that they'd be reaching out further, and was then ghosted. While I don't mind not getting a third interview, being ghosted is lame for anyone.", "Interview Questions": "Experience with hypervisors. "}, {"date": "11 Mar 2021", "title": "Salesforce Administrator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Los Angeles Film School in Jan 2020", "Interview Descriptions": "I went through three rounds of interview for the position of Salesforce Administrator. I was informed that I am selected for the role. I tried to contact them back for three weeks. But there was no response from the recruiter or the HR team.", "Interview Questions": "Can you give a scenario of working with workflow?"}, {"date": "30 Jan 2020", "title": "Counselor Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Los Angeles Film School (Los Angeles, CA) in Sept 2019", "Interview Descriptions": "Phone screen interview, then interviewed with a group of current staff. The interview process was full of subtext explaining truly what the position involved. They never responded to emails sent in a professional manner.", "Interview Questions": "What was a work problem you encountered and how did you solve it?"}, {"date": "14 May 2019", "title": "Admissions Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Los Angeles Film School", "Interview Descriptions": "The process was fairly simple. I came in and met with 3 people in management positions and 1  senior admissions representative. They asked me relatively normal interview questions and overall the interview took about 1 hour.", "Interview Questions": "Do you consider yourself a competitive person? "}, {"date": "12 Feb 2019", "title": "Library Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Los Angeles Film School (Los Angeles, CA) in Feb 2019", "Interview Descriptions": "Was welcomed and presented a set of questions. They were also warm to listen to my perspectives and experiences. It was calm. One thing Id suggest is to create a more welcoming interview room.", "Interview Questions": "What was a mistake that I have done on a job?"}, {"date": "26 Oct 2022", "title": "Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at Los Angeles Film School (Los Angeles, CA) in Aug 2018", "Interview Descriptions": "Interview with Associate Program Director and Program Director. Good questions, low stress, review of resume. Offered part time and full time position. Accepted full time position and have been with company for many years.", "Interview Questions": "Can you teach multiple classes?"}, {"date": "28 Jan 2020", "title": "Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Los Angeles Film School (Los Angeles, CA) in Jan 2017", "Interview Descriptions": "It was very simple and straight-forward. Everyone was very professional and they laid everything out  on the table and didn't hold anything back which I appreciated.  I really got along with both the director and assistant.", "Interview Questions": "They didn't ask any typical interview questions, instead, we discussed my prior experience in a casual fashion"}], [{"date": "1 Jul 2016", "title": "Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Los Angeles Film School (Orlando, FL)", "Interview Descriptions": "Normal interview process.  Submitted resume online and heard nothing for few months and forgot about it.  Then received an email requesting a phone screening interview with an HR person.  All communication was through email until the actual phone call.  Typical screening questions asked about basic requirements of the position and background.  Informed many times that official transcripts are required and background process completed prior to start date.  Discussed location, hours, student maximum per class, class and program structure.  After phone screening, received email to setup an in-person interview with immediate supervisor on campus.   Typical interview where supervisor provided more details about program, position, structure, and opportunity to discuss how background and skills fit with position.", "Interview Questions": "Questions were relevant to job, background, online atmosphere of program, need to be computer proficient."}, {"date": "2 Mar 2016", "title": "Dean Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 3 weeks. I interviewed at Los Angeles Film School (Los Angeles, CA)", "Interview Descriptions": "The interview process began with a phone call, then I was invited to their organization for a few one-on-one interviews.  Finally, I was invited for a  group interview and presentation, and completed personality type on-line exams.  The entire process very organized and professional, they seem like a fantastic organization to work with.", "Interview Questions": "They asked for a demonstration focused on training for Program Chairs."}, {"date": "4 Feb 2016", "title": "Admissions Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Los Angeles Film School (Los Angeles, CA)", "Interview Descriptions": "First you do a group interview which is really weird. It takes over an hour and you only get 1 chance to answer an individual question. then if they like you they bring you back for one on one interviews.", "Interview Questions": "Sell me this pen"}, {"date": "23 Sept 2014", "title": "Director of Marketing Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 4 months. I interviewed at Los Angeles Film School (Los Angeles, CA)", "Interview Descriptions": "Six phone and skype interviews with Full Sail University and LAFS team. Extensive background research, financial and criminal checks. Fly out in-person interview. Four months overall time from initial interest. This is not a short hiring process.", "Interview Questions": "No unusual questions."}, {"date": "17 Sept 2013", "title": "Recording School Instructor Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 3 days. I interviewed at Los Angeles Film School (West Hollywood, CA)", "Interview Descriptions": "you need to have a Bachelor's degree to get hired here as an instructor.  Steve Miller (the director) is AWESOME & knows his stuff!  If you know what you're doing, you'll do great.  It helps to have a fair amount of professional experience recording, mixing, editing, and composing.", "Interview Questions": "I didn't encounter any hard questions"}, {"date": "11 Jul 2015", "title": "Instructor-Script Supervising Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 6 weeks. I interviewed at Los Angeles Film School (Los Angeles, CA) in Nov 2012", "Interview Descriptions": "Very good process. Good questions, great experience. Very fair and straight forward process. the questions were insightful, asking primarily about education, work experience and teaching experience, as well as philosophy of teaching.", "Interview Questions": "About my experience. The most memorable was about my philosophy of teaching"}, {"date": "31 Jul 2015", "title": "Instructor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Los Angeles Film School (Los Angeles, CA) in Apr 2011", "Interview Descriptions": "Met with hiring manager/supervisor.  Very casual interview.  Seemed like more of a conversation rather than typical interview.  The interviewer did not seem experienced. Was offered the position shortly thereafter.", "Interview Questions": "Tell me about your industry experience."}, {"date": "25 Jan 2014", "title": "Instructor-Script Supervising Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 1 day. I interviewed at Los Angeles Film School (Hollywood, CA) in Nov 2010", "Interview Descriptions": "By telephone-don't remember details", "Interview Questions": "N/A"}]]