[[{"date": "13 Jan 2023", "title": "Hiv Care Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Mary's Center in Jan 2023", "Interview Descriptions": "Initially was interviewed by phone, followed by a virtual group interview. Where the whole panel is asking you questions. Very simple yet exciting and informative. The interview lasted about 45 minutes.", "Interview Questions": "Just scenario type of questions. I enjoyed answering them all!"}, {"date": "18 Nov 2022", "title": "Mental Health Therapist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Mary's Center", "Interview Descriptions": "They are very slow when it comes to even setting up an interview then the interview itself is an hour. Majority of the panel was quiet and cold and distant. I was also told during the phone screening it could take up to two months to be hired. When asking what the weekly productivity requirements are , they would not give me a number. Which was a red flag to me.", "Interview Questions": "What would you describe as your ideal work environment"}, {"date": "7 Nov 2022", "title": "Dental Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Mary's Center", "Interview Descriptions": "Very easy. Jen interview me and made me feel comfortable to answer every question. I left the interview feeling confident. I’m excited about joining the team. I see myself retiring from this company", "Interview Questions": "Elaborate on your experience . How can you utilize your skill for the company"}, {"date": "17 Sept 2021", "title": "Senior GL Accountant - Contractor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Mary's Center (Washington, DC) in Sept 2021", "Interview Descriptions": "Interview was done via TEAMS.  It was arranged by an employment agency.  Stayed strictly with the job requirements and did not discuss any non-employment personal experiences or politically oriented items.", "Interview Questions": "Describe experience with bank reconciliations and the Great Plains bank reconciliation module."}, {"date": "10 Mar 2021", "title": "Customer Service Representative Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Mary's Center", "Interview Descriptions": "Detailed interview and questions answered.   The process was to made me aware of the job functions, what is needed to succeed in the role. It was explained what is the expectation from me during the training process.", "Interview Questions": "What made you choose to work for our company?"}, {"date": "8 Jun 2022", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. The process took 5 weeks. I interviewed at Mary's Center (Washington, DC) in Jul 2020", "Interview Descriptions": "It was awesome, very smooth, staff is super nice and lovely! The team/staff is awesome, I was very comfortable the whole time. Everyone on board is awesome, and I learned a lot during my experience at MC, and I was able to help out throughout my internship.", "Interview Questions": "What skills can I bring to the agency"}, {"date": "8 Jul 2020", "title": "Community Support Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Mary's Center (Washington, DC) in Jun 2020", "Interview Descriptions": "The office manager communicated clearly about the interview date prior. During the first interview, they were clear about the hiring timeline. They were respectful while listening to my answers and very open to questions. They asked many questions about the responsibilities of the position and what I can offer to them.", "Interview Questions": "Tell me about a difficult time and how you dealt with it. "}, {"date": "1 Feb 2021", "title": "Family Support Worker Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Mary's Center (Washington, DC) in Feb 2020", "Interview Descriptions": "I had two group interviews in one day, and then hiring froze due to the pandemic. Everyone was very kind - I met two supervisors and a whole team of FSWs.", "Interview Questions": "How would you handle a situation in which a family expresses discontent over their son wanting to play with dolls?"}, {"date": "9 Nov 2022", "title": "Data Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Mary's Center in Nov 2019", "Interview Descriptions": "you will probably get interviewed by your hiring manager, one another data analyst or senior data analyst and someone from the executive leadership. All questions are fair. They ask about your interest in working with MC and previous experience working with data", "Interview Questions": "What data analytics tools have you worked with?"}, {"date": "27 Apr 2019", "title": "Family Support Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at Mary's Center", "Interview Descriptions": "There is one one-on-one in-person interview, and one group interview with the rest of your team (who will become your co-workers).\r\nThe immediate supervisor was pretty quick to respond to scheduling with me, and HR followed up within about 2 weeks.", "Interview Questions": "There were many questions regarding specific challenging scenarios that one may have to react to in a home visit. There is nothing one can do to prepare, but it's more a test of thinking on your feet. If you apply for a multilingual job, half the interview will be in that language (mine was in Spanish)."}], [{"date": "19 Feb 2018", "title": "Payroll Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "The process took 2 weeks. I interviewed at Mary's Center in Jan 2018", "Interview Descriptions": "Was contacted by recruiter and scheduled an in person interview for the following week. The confirmation email didn’t say who I was interviewing with so I had no idea who to ask for once I arrived. I interviewed with two ladies who didn’t introduce themselves and I still don’t know their names to this day. Very unprofessional.", "Interview Questions": "What experience do you have with the General Ledger?"}, {"date": "11 Mar 2017", "title": "Family Support Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Mary's Center (Washington, DC) in Feb 2017", "Interview Descriptions": "Applied to the job and heard back four days later. Then did a second interview a week after the first one. Heard back about the job a week or so after the second interview. They asked the same questions at both interviews.", "Interview Questions": "They give a bunch of scenarios that you had to respond to relating to potential home visits. They asked a lot of questions, about 30. The interview took about 45-60 minutes."}, {"date": "16 Sept 2016", "title": "Senior Manager of Foundation and Government Relations Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Mary's Center (Washington, DC)", "Interview Descriptions": "Haphazard, slow moving, disorganized. For the second round interview the CDO spoke for 20 minutes; she herself noted it. There was no time for any of my questions. Commonplace to promise a time frame or specific next steps then follow-through completely differently or not at all. Your time is not important to them.", "Interview Questions": "Name your greatest weaness"}, {"date": "7 Feb 2017", "title": "Front Desk Receptionist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Mary's Center (Washington, DC) in Jun 2016", "Interview Descriptions": "Applied online by submitting resume and relevant paperwork, received an email 1 day later with some HR related questions and scheduled an in person interview. The HR rep was courteous and quick to answer my questions on the position and where/when to come in.", "Interview Questions": "Previous experience, why an interest in working for Mary's Center, working style, organizational style"}, {"date": "11 Aug 2015", "title": "Case Manager/Family Support Worker Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 6 weeks. I interviewed at Mary's Center (Washington, DC) in Feb 2014", "Interview Descriptions": "The interview process was very informal as I was already working for Marys Center in a different department. A lot was withheld from hiring manager and I was offered a different position at the end of interview. The interview was one on one with a lot of open ended questions and the second interview was with the department staff and that one was more scenario based.", "Interview Questions": "How would you handle a patient who is in a crisis and its 5 minutes away from the time your shift ends?"}, {"date": "1 Sept 2015", "title": "FNP Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 4 weeks. I interviewed at Mary's Center in Aug 2012", "Interview Descriptions": "Phone screening followed by HR then Group interview with Medical Directors. Option to shadow in clinic. Asked about Past experiences, spanish proficiency, strengths/weakness, comfort working independently, EMR proficiency, efficiency of seeing patients", "Interview Questions": "Which areas of medicine do I not prefer"}, {"date": "18 May 2016", "title": "Child Find Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 2 days. I interviewed at Mary's Center (Washington, DC) in Jul 2012", "Interview Descriptions": "I was called by the program manager for brief interview. I was referred by previous employer. I was hired on the spot. We discussed salary and benefits, once the meeting was adjourn, Human Resource called me the following day with a start up date", "Interview Questions": "Howl long have been working with families? What do you expect out of our organization?"}]]