[[{"date": "22 May 2023", "title": "Business Development Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Meals on Wheels America", "Interview Descriptions": "Easy interview process with direct supervisor. They asked standard questions. They asked about my background. The questions gave me a good feel for job. There was plenty of opportunity to expound on subjects of interest. They gave me a tour of workspace.", "Interview Questions": "What is your five year plan?"}, {"date": "10 Aug 2022", "title": "Driver 1 Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Meals on Wheels America in Aug 2022", "Interview Descriptions": "Easy , comfortable , very helpful with the process start to finish skipped the second interview all together very detailed in what to expect for my daily duties and how the shift would go from clock in to out", "Interview Questions": "What my experience with driving was "}, {"date": "16 Feb 2022", "title": "Site Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Meals on Wheels America", "Interview Descriptions": "First I had the initial phone call, then a tour of the site, and lastly second interview. It was pretty casual and gave you a good idea of what your role would be.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "5 Sept 2022", "title": "Delivery Driver and Trainer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Meals on Wheels America (Macon, GA) in Nov 2021", "Interview Descriptions": "Met with the director and under went a 30 minute interview with her. She was interested in my past experience and jobs. The interview was basically question and answer. I was offered the job.", "Interview Questions": "Why do you wish to work here, what is your past experience, what salary do you expect..."}, {"date": "21 Dec 2021", "title": "Annual Fund Director Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Meals on Wheels America in Nov 2021", "Interview Descriptions": "Within two weeks of applying for the position, I had a phone screen with an HR rep and then a video interview with the hiring manager.  It has been nearly 2 months, but there has been no contact from the organization.", "Interview Questions": "Ability to prioritize initiatives focused on individual prospects?"}, {"date": "24 Jan 2022", "title": "Volunteer Coordinator Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Meals on Wheels America (Ewing, NJ) in Aug 2021", "Interview Descriptions": "One interview with CEO and CPO. Was asked generic questions about why I was interested in the job, how my background would help me succeed, and my availability on the nights and weekends. \r\n\r\nAfter I got the job, they pressured me to give my (then current) employer a 1 week notice. When I told them that was unrealistic and causing me strife with my current company, they questioned \"how badly I really wanted the job,\" After I almost ruined relations with my current employer, they switched tunes and said \"2 weeks is fine!\" \r\n\r\nShould've seen the red flags from the beginning.", "Interview Questions": "How does your background prepare you for this position?"}, {"date": "10 Jan 2021", "title": "Email Marketing Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Meals on Wheels America in Dec 2020", "Interview Descriptions": "The hiring manager reached out for a 30 minute intro call. She asked pretty standard questions and described the roll, but I never heard back from her either way after the call.", "Interview Questions": "Describe your experience with email marketing. "}, {"date": "11 Apr 2023", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Meals on Wheels America in Apr 2020", "Interview Descriptions": "I emailed inquiring about opportunities during covid. I received a very quick response with requirements and availabilities. answered all my questions with very detailed information and explained job very well.", "Interview Questions": "do you have a car"}, {"date": "27 Aug 2020", "title": "Coordinator Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Meals on Wheels America (Los Angeles, CA) in Jan 2020", "Interview Descriptions": "Friendly recruiters and I would love to keep in touch. I recommend this place of work for anyone newly graduated from college. The pay is the only problem since it is a non profit.", "Interview Questions": "Describe a difficult situation while working in a team. "}, {"date": "8 Feb 2019", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Meals on Wheels America", "Interview Descriptions": "Easy because of school program so everyone was hired to contribute to the company . It was a group setting and it was easy for us to get hired because it was contract work.", "Interview Questions": "How can you contribute to our company if we hire you?"}], [{"date": "5 Feb 2019", "title": "Community Engagement Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Meals on Wheels America", "Interview Descriptions": "Simple and straight-forward. The interview process was more of a chance for me to ask questions about their expectations and the demands of the position. I was given the opportunity to demonstrate and relate me past experiences and current skills to the position that I was interviewing for.", "Interview Questions": "What are initiatives that you hope to set and accomplish in this role?"}, {"date": "26 Jun 2018", "title": "Congregate Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Meals on Wheels America (Austin, TX) in Feb 2017", "Interview Descriptions": "It was smooth and simple. They asked about 15 questions. They also gave you a lot of of great information about there company. They do a lot of amazing things.", "Interview Questions": "Do you like to work with elderly people? "}, {"date": "27 Jan 2017", "title": "Food Delivery Technician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 3 days. I interviewed at Meals on Wheels America (Lynchburg, VA) in Jan 2017", "Interview Descriptions": "They were  very friendly and professional. Everyone involved with the job was present and helpful.  They went through all of the job requirements in detail. Though I was not hired, the lady in charge called me in person and explained that another applicant had more experience.", "Interview Questions": "Did I have any experience or education of social work?"}, {"date": "3 Jan 2017", "title": "Program Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Meals on Wheels America (Albany, NY) in Dec 2016", "Interview Descriptions": "Very no nonsense, to the point and if you didn't have an answer they were looking for, there really was an official frown.  It was quite evident from the beginning that they were looking for a multi faceted person with lots of computer skills.  The local office I interviewed with is way behind the times, needs 40 year updating.  Salary was skimpy, responsibility was enormous and I found out that if a meals driver doesn't show, I would have to get in my car and go do the route.  Hmmm.", "Interview Questions": "If hired, what would you do to contribute to the vision of Meals on Wheels?"}, {"date": "11 Sept 2016", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Meals on Wheels America", "Interview Descriptions": "I submitted my application through Idealist and heard back roughly 2 months later for a phone interview. I was then scheduled for a second interview with two members of the team which was to take place over Skype but due to technical difficulties this was changed to a phone interview. I received an offer following second phone interview.", "Interview Questions": "General talk about your relevant experiences and why you want to intern at MOWA."}, {"date": "19 Feb 2020", "title": "Site Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Meals on Wheels America (Chicago, IL) in Feb 2016", "Interview Descriptions": "I was a referral who had already volunteered many time so the interview was just a formality.  I don't see why this has to be 30 words. one two three four five six", "Interview Questions": "Are you available to work Monday-Friday"}, {"date": "30 Sept 2015", "title": "Program Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Meals on Wheels America (Denver, CO)", "Interview Descriptions": "I applied online through Craigslist. They called me for a simple phone interview; more than anything to see if I would be interested in the job. I think they also wanted to make sure I would be okay with the offer they were making (which was set, with no possibility of a raise). I decided to go ahead with it, since it was a good amount. The day after, I went in for an interview with the Program director and the business manager. The interview questions were the norm of what you would hear in any other interview. The two people that interviewed me were professional and very honest with what the job required. After, they took me on a tour of the facility. I was able to ask questions, and they were able to answer them, and at the end of that week I received a call for an offer.", "Interview Questions": "Do you have any sales experience? "}, {"date": "2 Aug 2015", "title": "Events Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Meals on Wheels America (Calgary, AB) in Jun 2015", "Interview Descriptions": "The interview process was relaxed and the team that works there was welcoming and personable.\r\nWhile I did not get the job I am grateful for the experience as well as the facility tour that accompanied the interview.", "Interview Questions": "What kind of manager do you consider yourself to be?"}, {"date": "1 Mar 2016", "title": "Marketing & Communications Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Meals on Wheels America (Washington, DC) in Jun 2015", "Interview Descriptions": "Applied online through Indeed and received an email back around a week later asking for a phone interview. I had one phone interview, lasting around 20-30 minutes about myself and my experiences/skills. I then received an offer within the week and started 2 weeks later.", "Interview Questions": "Specific questions about my experiences on my resume."}, {"date": "19 Apr 2015", "title": "Grant Writing Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Meals on Wheels America (San Diego, CA)", "Interview Descriptions": "Typical interview process. I met with the hiring manager one on one. She asked typical questions, what am I in school for, what is my interest in non-profits, etc. It was short and to the point. The location did not have great parking", "Interview Questions": "Do you have a writing example"}], [{"date": "25 Feb 2015", "title": "STATISTICS DATA Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1+ week. I interviewed at Meals on Wheels America (Syracuse, NY) in Feb 2015", "Interview Descriptions": "I went to a conference room to do a basic question based job interview. The interviewer should be two people, but I don't know why just one recruiter give me the interview. The interview is about 15 minutes. Ask a lot of questions based on the resume and statistic skills.", "Interview Questions": "To do a introduction about yourself\r\nQuestion based on the resume\r\nQuestion about statistic skills"}, {"date": "14 Jul 2014", "title": "Nutrition Staff Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Meals on Wheels America (Fort Worth, TX) in May 2013", "Interview Descriptions": "Two interviews with the President of the Nutrition staff department and another with the nutrition department manager. Mainly, they wanted to know if you were  good fit for the actual position and the situations you would be put in.", "Interview Questions": "Do you think you can meet the learning curve of this job?"}, {"date": "10 Jan 2014", "title": "Volunteer Intern Engagement Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Meals on Wheels America (San Francisco, CA) in May 2013", "Interview Descriptions": "The initial communication was via email and we basically scheduled an in-person interview during that conversation. During the in-person interview, they asked questions about yourself, your job experiences, and your educational background. The process was easy and straight-forward. As long as you have some of the qualifications that they are looking for you should be fine.", "Interview Questions": "How I relate my previous job experience with the current position that I'm applying for."}, {"date": "30 Mar 2013", "title": "Volunteer Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Meals on Wheels America (Macon, GA) in Mar 2012", "Interview Descriptions": "It was wonderful.  I was very optimistic.  I think they really are trying to get some good quality people in there but it is the current management that are trying to weed them out.  It really could be a wonderful place to work.  Just try not to make a difference.  Unless you get on the right team.", "Interview Questions": "There wasn't one."}, {"date": "17 Sept 2013", "title": "Emergency Protocol Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1+ week. I interviewed at Meals on Wheels America (Baltimore, MD) in Feb 2012", "Interview Descriptions": "I talked to the Client services director and her assistant. It was a very good experience. I was referred by someone at my college. I like the atmosphere there. I earned good credit for college.", "Interview Questions": "What position do you want?"}, {"date": "23 Nov 2011", "title": "Executive Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 1 day. I interviewed at Meals on Wheels America in May 2009", "Interview Descriptions": "Interviewed by board Former board chair", "Interview Questions": "What would you do to turn the organization around"}, {"date": "16 Sept 2010", "title": "Communications Director Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Meals on Wheels America in Oct 2008", "Interview Descriptions": "Quicker interview than expected. Asked questions on a basic apples-to-apples comparison list. Some deviation, but not much.", "Interview Questions": "Describe your best boss."}]]