[[{"date": "9 Dec 2019", "title": "Student Admissions Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Bradley University (Peoria, IL) in Nov 2019", "Interview Descriptions": "I was interviewed  by two individuals which lasted about  20 minutes. The questions were of average difficulty.  Don't expect to be notified if you weren't chosen.  Even after contacting  HR.", "Interview Questions": "My weaknesses. I think I told them the wrong thing"}, {"date": "27 Feb 2019", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Bradley University (Peoria, IL) in Jul 2018", "Interview Descriptions": "It wasn't actually an interview my advisor just needed to know whether I was capable of doing the job or not. \r\nNext, it was about checking that my GPA matched the requirements and then checking how I did in my past semester in terms of working as a grader for another professor.", "Interview Questions": "When do you graduate?"}, {"date": "4 Jan 2018", "title": "Student Admissions Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Bradley University", "Interview Descriptions": "Fairly quick & easy. Only one interview if you apply as a freshman versus two or three if you apply as a current student. They conduct the interviews during your orientation so be prepared.", "Interview Questions": "What are you looking forward to getting involved with at Bradley?"}, {"date": "30 May 2016", "title": "Student Admissions Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Bradley University", "Interview Descriptions": "I was hired as an incoming freshman. I know from friends that the application process is much different in that case.  I had to fill out an initial application that required me to creatively answer a variety of question such as why I think I would be a good fit for the job, what famous person I would most like to be for a day, etc. After waiting for quite sometime, I was contacted about an interview.  I had the interview on the first day of my freshman orientation. It was incredibly relaxed.  I went into the office and had a conversation with my future boss and two current college students.  We just talked about why I liked Bradley, why I wanted the position, and just chatted about who I was as an individual. I was contacted for hire within the next few months.", "Interview Questions": "Why do you want to be a STAR?"}, {"date": "21 Aug 2015", "title": "Career Center Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at Bradley University (Peoria, IL) in Apr 2015", "Interview Descriptions": "Standard application with resume and cover letter. Offered an interview and group interview with 3 other individuals. It was a very simple process and everyone was great to work with. The interview only took 30 minutes and was about 7 questions in length.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "5 Feb 2015", "title": "Administrative Assistant Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Bradley University (Peoria, IL)", "Interview Descriptions": "I was called for an interview two days after submitting my resume. The search panel was kind, but the interview was very easy and informal. Panel just briefed me on the job and benefits. Very few real interview questions were asked, other than my prior work experience. I was told the salary range and thought there would be room for negotiating. There wasn't. It appears they have great benefits, but who cares about that when you can't even pay your monthly bills on their offered salary? It's insulting. They have excellent opportunities and want experience, but their pay structure is for recent graduates only.", "Interview Questions": "Why do you want to work for Bradley? Why are you wanting to leave your current employer? What are your future goals?"}, {"date": "7 Sept 2015", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Bradley University (Peoria, IL) in Feb 2015", "Interview Descriptions": "The selection was process and chosen because of my good academic performance,Presentations and assignment work.\r\nThey ask you if you interested to work with them and assist them in the research field.", "Interview Questions": "Why we should hire you? \r\nhow you can be an asset to the organization?\r\nWill you be able to manage research work and your studies simultaneously.\r\nwhich field are you interested in?"}, {"date": "27 Jul 2015", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Bradley University (Peoria, IL) in Feb 2015", "Interview Descriptions": "They took my resume and interviewed about my projects. I clearly explained each and every project clearly. My confidence has helped me in cracking this interview. They are very specific to their requirements and ask more questions on their area of interest.", "Interview Questions": "They took my resume and interviewed about my projects.They took my resume and interviewed about my projects. I clearly explained each and every project clearly. My confidence has helped me in cracking this interview"}, {"date": "22 Apr 2016", "title": "Finance Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Bradley University (Peoria, IL) in Jan 2013", "Interview Descriptions": "Really simple. The coordinator reviewed my grades with me. Asked if there were any classes in particular I was comfortable tutoring others in. Asked to tell a little about myself, my classes enrolled in, and such. The process was very smooth. No trick questions or examinations of any kind.", "Interview Questions": "What classes are you comfortable tutoring others in? Have you tutored before?"}, {"date": "22 Feb 2016", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at Bradley University (Peoria, IL) in Oct 2012", "Interview Descriptions": "Mostly behavioral questions. You apply by submitting your resume and application then everyone gets an interview with two hall directors asking questions and then there's a group interview. If you get an email back to move on you have a final interview with the director of residential living.", "Interview Questions": "Strengths and weaknesses."}], [{"date": "12 Mar 2022", "title": "Assistant Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Wheaton College (IL)", "Interview Descriptions": "Many meetings over 2 days, teaching and research talks.  Meeting with students and faculty.  - - - - - - - - - - - - - - - - - ---------", "Interview Questions": "What is my teaching philosophy?"}, {"date": "25 Feb 2021", "title": "Advancement Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Wheaton College (IL)", "Interview Descriptions": "A general phone interview with an HR representative followed by an interview with supervisors. Everything was clearly communicated and the interviewers asked insightful questions while putting the candidate at ease.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "28 Apr 2018", "title": "Office Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Wheaton College (IL)", "Interview Descriptions": "Average interview. HR was great to talk to, but the people from the area I was applying to were awkward and the manager didn’t seem to hear what I was saying most of the time.", "Interview Questions": "Do you love Jesus "}, {"date": "25 Jul 2018", "title": "Designer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Wheaton College (IL) (Wheaton, IL) in Mar 2018", "Interview Descriptions": "I submitted my resume and website portfolio for review and then received a call from HR for a phone interview. The person interviewing me was 15 minutes late in calling, this was a prescheduled interview made by their HR department.\r\nMy rapport with the woman interviewer went well. We were both clear and candid with each other. The marketing department sounded like it was in transition so I don't feel they were clear in what they needed. I was over qualified but willing to take a lower position due to my life circumstances. I am writing this review to let others who interview know that they don't get back to you even if you politely email and leave phone messages asking for a courtesy call to let you know if the position was filled and where you stand in the process. During the interview she was very encouraging about my portfolio and potential of working in their department. They ask you questions of faith and integrity. Overall, disappointed that they seek others with faith and integrity but their actions don't shown those qualities. Actions in this case do speak louder than words. No decency in providing even a brief response. A return email or voicemail saying they weren't interested was simply right thing to do. Especially from a faith based college.", "Interview Questions": "One of the interview questions was would you be able to make a 2 year commitment."}, {"date": "3 Apr 2017", "title": "Office Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Wheaton College (IL) in Mar 2017", "Interview Descriptions": "One interview with HR then one department interview. Great experience and flexible when needed with timeline. Not particularly difficult questions, especially in contrast to corporate interviews. Pretty standard process and overall was quick once called into the interview. Took a month since I applied to be called though.", "Interview Questions": "Would you say you are detail oriented?"}, {"date": "6 Sept 2017", "title": "Hospitality Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Wheaton College (IL) (Wheaton, IL) in Jan 2016", "Interview Descriptions": "Long process, have to get through HR first then at least 3 more interviews before an offer comes in. willing to fly you out for personal interview, also offered to fly my family out as well. It was a good interview experience and they make sure they are hiring the right person for the job. They are very selective.", "Interview Questions": "How are you?"}, {"date": "11 Apr 2015", "title": "Dean Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Wheaton College (IL) (Wheaton, IL)", "Interview Descriptions": "Interview process was overkill. Interviewed with every department, department partners, etc. Two day process. As well as interview with the President of the College. I was not impressed with the interview format, talking to at least 50 people, with 50 different opinions, and always referencing (being compared to) the incumbent was not a good way to conduct interview. I also got the impression that some panel members had misconceived ideas about my content knowledge or that I could not relate to academically gifted students.", "Interview Questions": "What books do you read."}, {"date": "1 Nov 2015", "title": "Unit Leader At HoneyRock Outdoor Center for Leadership Development Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 3 months. I interviewed at Wheaton College (IL) (Wheaton, IL) in Nov 2014", "Interview Descriptions": "It was a 2-step interview process with Mallory Alpert and Ashley Kiley. The process began with the submission of an application in October. Following that, in November an interview was held with Mallory Alpert. Then, in December an interview was held with Ashley Kiley. An offer was given in January.", "Interview Questions": "Q: What are some challenges you expect to face this summer?"}, {"date": "27 Sept 2015", "title": "Residence Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 3 weeks. I interviewed at Wheaton College (IL) (Wheaton, IL) in Nov 2014", "Interview Descriptions": "Submit their application, solo interview with a panel of Residence Life staff members, group personal collage presentations. The staff was very friendly and warm, and welcomed you and made you feel very comfortable. They care so much about caring for those under them -- it's part of Wheaton College's Residence Life grander vision.\r\n\r\nAltogether, I was very very excited and relaxed to interview with them.", "Interview Questions": "How do you find rest?"}, {"date": "14 Jun 2015", "title": "Program Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Wheaton College (IL) (Wheaton, IL) in Oct 2014", "Interview Descriptions": "Pleasant experience.   I was treated respectfully all along.  I was kept informed  and given timeframes of decision making.  Intelligent insightful interviewer and receptionist.  Good experience all around.  Testing took about 3 hours of unpaid time, but an investment.   Personality, general office skills, and microsoft office suite testing.  A total of 3 interviews for current position.", "Interview Questions": "What do you dislike about former jobs."}], [{"date": "31 Oct 2013", "title": "Resident Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Wheaton College (IL)", "Interview Descriptions": "After applying, there is a meeting with a panel, including two or three current RAs, a GRA or ARD and an RD. There is also what is called \"RA collage\" and you get the chance to express who you are through whatever medium you'd like. After that, all applicants receive a letter with a job offer or not", "Interview Questions": "Why do you want to be an RA?"}, {"date": "30 Sept 2013", "title": "Reunion Giving Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Wheaton College (IL) (Wheaton, IL) in Jul 2013", "Interview Descriptions": "Very quick response to my resume, and easy to schedule interview.  If you come prepared, the interview will last over 1hr 30min, but be well worth it.  However, post-interview follow-up was sub-par at best.", "Interview Questions": "N/A"}, {"date": "7 Feb 2017", "title": "Residence Hall Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 5 weeks. I interviewed at Wheaton College (IL) (Wheaton, IL) in Mar 2013", "Interview Descriptions": "phone interview, than an all day campus interview. The campus interview involved a campus tour, 1 on 1 meetings with the Associate Dean, group interviews with RDs, another with GRAs, another with RAs, Another with Deans and Directors,", "Interview Questions": "Behavioral questions almost exclusively--i.e. tell me about a time when you handled a student in crisis."}, {"date": "23 Oct 2015", "title": "Statistician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Wheaton College (IL) (Wheaton, IL) in Aug 2012", "Interview Descriptions": "It was brief and very simple. He just tried to get to know me and ask about me. The job is fairly easy so he just checked to see if I knew what I was doing.", "Interview Questions": "He asked if I knew what I was doing and why I wanted to work there and what hours I could work."}, {"date": "29 Aug 2012", "title": "Associate Professor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. I interviewed at Wheaton College (IL) (Wheaton, IL) in Mar 2008", "Interview Descriptions": "Not consistent with the expectations of someone committed to teaching.", "Interview Questions": "What is your view of the authority of the Bible?"}]]