[[{"date": "7 Jun 2023", "title": "Financial Support Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Regent University (Virginia Beach, VA)", "Interview Descriptions": "Includes 2-3 people. Asks about experience and skillset. Discusses job role. The interviewer asks about a time where you received constructive criticism and how you handled it. Job tasks are clearly explained during the interview process", "Interview Questions": "Tell me about a time where you made a mistake. How did you fix the issue?"}, {"date": "22 Aug 2022", "title": "Enrollment Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Regent University (Virginia Beach, VA)", "Interview Descriptions": "The interview process was pretty easy. However, its completion was non-existent. The company never contacted me about the position as they said they would. I did not even receive an email as a courtesy.", "Interview Questions": "N/A"}, {"date": "19 Nov 2021", "title": "Academic Counselor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Regent University", "Interview Descriptions": "Phone Interview then zoom interview, the phone interview only took couple of minutes, and the zoom interview needs to be with couple of more people. Prepare to be a long process", "Interview Questions": "Focus on Christianity and share your experience"}, {"date": "10 Aug 2022", "title": "Adjunct Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Regent University (Virginia Beach, VA) in Aug 2020", "Interview Descriptions": "The process included multiple phone interviews. Their selection process for adjuncts is thorough. The first interview was about 30 minutes, and the second interview, about a week later, was a little shorter and mostly entailed clarifying questions about my background and doctrine.", "Interview Questions": "One question regarded my philosophy of teaching and my call to teaching as a vocation."}, {"date": "17 May 2019", "title": "Enrollment Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Regent University", "Interview Descriptions": "Fairly laid back, interviewers were friendly. Typical questions for an interview. Overall a good experience. It took a while to hear back, but that’s ok. Not intimidating at all and they made you feel comfortable before asking any questions. It was nice.", "Interview Questions": "Previous experience?"}, {"date": "26 Oct 2018", "title": "Admissions Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Regent University (Virginia Beach, VA) in Oct 2018", "Interview Descriptions": "Brief phone interview followed by a group interview.  All the hiring managers for the departments are there and they present mock scenarios to see how you would handle it.", "Interview Questions": "Would you be comfortable talking with older people about God?"}, {"date": "24 Sept 2018", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Regent University", "Interview Descriptions": "Very straightforward and low stress. I was asked some typical questions and it felt more like a conversation than an interview. It was very easy to walk in and talk to them.", "Interview Questions": "It was four years ago and I honestly don't remember."}, {"date": "21 May 2018", "title": "Admissions Counselor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Regent University (Virginia Beach, VA)", "Interview Descriptions": "Asked a bunch of random questions, doesn't care about previous work experience, asked to do sales role playing, and feelings about Christianity.  They ask how you are at sales and what your personality type is.", "Interview Questions": "Tell us about your journey with Christ"}, {"date": "29 Oct 2018", "title": "Interview Assistant Professor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Regent University (Virginia Beach, VA) in May 2018", "Interview Descriptions": "This was a 4th round, on-campus interview. On the day of the campus visit, I had three panels, one solo, and an hour-long teaching demo. An overnight with two meals with faculty and a 30 minute campus tour. Everyone was very helpful.", "Interview Questions": "They asked pointed questions about my faith and my teaching philosophy"}, {"date": "4 Mar 2018", "title": "Designer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Regent University", "Interview Descriptions": "Very laid back, encouraging, and respectful interview. I felt very welcome. They asked if I had any experience in print design. Definitely wanted to know about my faith and if I was a Christian.", "Interview Questions": "Are you a Christian? Tell me about your faith. "}], [{"date": "31 Oct 2018", "title": "Admissions Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Regent University (Virginia Beach, VA) in Nov 2017", "Interview Descriptions": "Applied Online.  Was reached out to and had an initial interview over the phone.  Was invited for a group interview with a total of about 12 people.  The group interview was fun and was also a sales training.  Was contacted a few days later with an offer for the job.  They requested a decision of acceptance in a couple days.", "Interview Questions": "What are values key to working at Regent?\r\nWhat are good ways to overcome objections?\r\nHow would respond in such and such scenario?"}, {"date": "16 Jan 2016", "title": "Admissions Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Regent University (Virginia Beach, VA)", "Interview Descriptions": "You are in a room with about 8 people who will interview you.  It's a \"speed dating\" type feel where you go to various tables and have a couple minutes with each person.  It seems a tad overwhelming but they seemed to really be drawn to the people who were light hearted and smiled a lot.  Just try to be yourself as much as you can, and talk about your faith.", "Interview Questions": "How has your faith played a role in your work? Why do you like what Regents mission statement?"}, {"date": "13 Oct 2015", "title": "Career Services Advisor Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 2 weeks. I interviewed at Regent University in Oct 2015", "Interview Descriptions": "I met with the Director of Career Services. She only asked a few questions. I had to submit a mock resume for a factious student. I have yet to hear whether or not I have the job. I was told that they are still interviewing candidates and those chosen for the next round will be notified.", "Interview Questions": "She really didn't ask specific questions."}, {"date": "16 Sept 2015", "title": "Financial Aid Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 5 days. I interviewed at Regent University (Virginia Beach, VA)", "Interview Descriptions": "began with one-on-one interview with Financial Aid Director, then was called back for a second interview with the entire office staff. the experience was great as everyone was able to provide input in the hiring process based on how the interview went.", "Interview Questions": "What kind of financial aid experience do you have?"}, {"date": "8 Aug 2015", "title": "Admissions Counselor/Admissions Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Regent University (Virginia Beach, VA) in Jul 2015", "Interview Descriptions": "Received an email to schedule an interview for the next day after my application was submitted. Interview was completed in a panel type style but one on one. There were four staff members interviewing candidates and you spent about 10 minutes with each interviewer then rotated to the next person. There was myself and one other person interviewing at the same time.", "Interview Questions": "How effective do you believe you will be in walking someone through a process form beginning to end and when have you ever done this?"}, {"date": "31 May 2015", "title": "Video Producer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at Regent University (Virginia Beach, VA)", "Interview Descriptions": "I was interviewed by the entire department at one time... like a group interview with me alone.  A little intimidating.  Each department member was free to ask me questions and most did.  I found myself a little unprepared for that.", "Interview Questions": "They wanted to know if I saw myself as a team player or someone who like to work alone."}, {"date": "18 Apr 2019", "title": "Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Regent University (Virginia Beach, VA) in Apr 2015", "Interview Descriptions": "You will meet with multiple levels, sometimes a panel interview. I actually enjoyed this process because it not only gives the University a good idea of who you are as an applicant, but also offers good information as to whether it's the right fit for you.", "Interview Questions": "Who a favorite author in my field was."}, {"date": "11 Feb 2015", "title": "Admissions Counselor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Regent University (Virginia Beach, VA) in Feb 2015", "Interview Descriptions": "Two stage process - phone screen followed by in person panel interview.  Up front and personable, described position clearly and expectations.   Actually applied in 2014, but was contacted in 2015. \r\n\r\nClear objectives for the position were communicated, as well as showing how they promote from within and have consistency in the department (all people in the panel have been with RU for a minimum of 10 years).\r\n\r\n Chose not to continue the process based on my perception of how I fit into the organization.  Pleasant overall.", "Interview Questions": "Have you had a time where you did not get along with a coworker - superior, peer or direct report?  How did you handle that?\r\n\r\nHow can you take your customer service background and translate that into our needs?\r\n\r\n"}, {"date": "10 Apr 2016", "title": "Enrollment Support Processor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at Regent University (Virginia Beach, VA) in Jan 2015", "Interview Descriptions": "The interview process was very standard, with questions regarding my weaknesses and strengths coming up, along with questions about what kind of leadership I prefer, and what kind of management style best suits me.\r\n\r\nThere were also questions about the history of Regent, itself, as well as a review of technical skills, such as knowledge of Banner and Microsoft Office.", "Interview Questions": "What is your ideal job?"}, {"date": "12 Apr 2018", "title": "Library Circulation Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Regent University (Virginia Beach, VA) in Mar 2014", "Interview Descriptions": "I applied online then they called me in for an interview that maybe lasted about 30 minutes. It was two supervisors in one room. I was referred by someone to them so I've heard it's sometimes hard to get an interview there. I guess lots of students apply.", "Interview Questions": "Previous experience?"}], [{"date": "20 Jul 2015", "title": "Admissions Consultant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Regent University (Virginia Beach, VA) in Feb 2014", "Interview Descriptions": "I applied online and was contacted approximately a week later to set up an interview. The interview was scheduled approximately two weeks from the time that I submitted my application. I was interviewed by two people (at the same time) in a fairly informal interview. Unfortunately it seemed that because this was a new role neither interviewer really had a firm grasp on the questions to ask or how to answer questions that I had. It was especially concerning that neither of the people interviewing would actually be overseeing the position.", "Interview Questions": "I was mostly asked about multitasking and if I felt I could uphold their standards."}, {"date": "26 Oct 2012", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Regent University (Virginia Beach, VA) in Jun 2011", "Interview Descriptions": "Was fairly basic. My skills were known to the person who hired me, and it was more a formality at that point than anything else. But I was able to use it to get a good handle on the job expectations.", "Interview Questions": "n/a"}]]