[[{"date": "3 Jul 2023", "title": "Risk Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Clinicas Del Camino Real (Camarillo, CA) in Feb 2023", "Interview Descriptions": "Interviewing was straightforward and informational. I applied for the position, contacted by recruiter, interview scheduled, occurred, and I accepted the position at the start of that next week. The start time was standard after offer acceptance.", "Interview Questions": "Situational based questions to see how I would act."}, {"date": "15 Jul 2022", "title": "Grant Writer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Clinicas Del Camino Real", "Interview Descriptions": "One interview with two senior managers. It was quite long but was able to get good insight on the company’s history and present structure. Many standard questions and a few specific to grants.", "Interview Questions": "Describe the most significant presentation or report you had to prepare. "}, {"date": "6 Jun 2022", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Clinicas Del Camino Real (Oxnard, CA)", "Interview Descriptions": "It was a lengthy interview with many questions to answer in one hour asked by a group of employees who worked for the clinic all through zoom. There were lots of technical difficulties through Zoom which made it harder to talk in the interview. They also never let me know if I got the job or not.", "Interview Questions": "Would you be able to travel to our other locations scattered across the county when needed?"}, {"date": "23 Nov 2022", "title": "System Administrator III Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Clinicas Del Camino Real (Los Angeles, CA) in Jun 2021", "Interview Descriptions": "IS manager invited me for the first round of interviews and then after that I interviewed with the sys admins team and CIO, and the last one was with HR", "Interview Questions": "Most of the questions were about the project that I have done before. They went through my resume and asked about my experiences."}, {"date": "13 Nov 2021", "title": "System Administrator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Clinicas Del Camino Real (Los Angeles, CA) in May 2021", "Interview Descriptions": "the process took just 2 weeks, first, the IS manager called me and he went through my resume, asked me about my experiences, and then the next interview was with CISO and other system admins (technical), they asked 8-8 questions.", "Interview Questions": "1- why do you want to work here\n2- some questions about my CV\n"}, {"date": "22 Feb 2021", "title": "Dental Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Clinicas Del Camino Real", "Interview Descriptions": "The interview was lengthy and lasted about forty-five minutes. I was interviewed by two people. They went back and forth with different types of questions so be prepared to answer all types of interview questions.", "Interview Questions": "how would someone describe you as?"}, {"date": "28 Aug 2020", "title": "Patient Service Representative Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Clinicas Del Camino Real", "Interview Descriptions": "Interview composed of the manager and lead PSR asking you about 3 pages worth of questions involving scenario questions, translation, and personal questions. Translations questions there were about 3 or 4. Composing of \"hi, how can I help you\" to \"you need to show proof of income\"", "Interview Questions": "What would your past or current employee say about you as an employee?"}, {"date": "27 Jun 2020", "title": "LVN Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Clinicas Del Camino Real", "Interview Descriptions": "Very relaxed but a  long interview . It’s a one on one interview. You get interviews by the manager and a Lead. They ask triage questions.  They don’t tell you whether you get offered immediately.", "Interview Questions": "Triage questions "}, {"date": "2 Apr 2019", "title": "Psychologist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Clinicas Del Camino Real (Camarillo, CA) in Mar 2019", "Interview Descriptions": "The interview was very comfortable and laidback. They clearly explained the position, the salary, and the expectations. Only one clinical question, which was surprising. The overall experience was pretty easy and straightforward.", "Interview Questions": "How would you work with a client who has depression?"}, {"date": "5 Jul 2018", "title": "Provider Relations Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 3 weeks. I interviewed at Clinicas Del Camino Real in Oct 2017", "Interview Descriptions": "Applied online at the request of recruiter. Received interview with hiring manager week I applied. Received offer the following week & negotiations were finalized within a week from the interview. Started new employee orientation less than 2 weeks after interview, during which background and drug testing were done. Interview had a nice, free flowing conversational feel.", "Interview Questions": "Describe how you handled a difficult situation in a previous position."}], [{"date": "20 Jun 2016", "title": "Human Resources Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Clinicas Del Camino Real", "Interview Descriptions": "I was called after applying online. I then came in to meet the HR team. After meeting them, I felt part of the team already. I was in a panel interview style, I was asked several questions related to the position  I applied for. I felt it was a great screening and they were careful of who they hired, Which is a great thing.", "Interview Questions": "What was my greatest achievement "}, {"date": "21 Jun 2016", "title": "Lcsw Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Clinicas Del Camino Real (Ventura, CA) in Feb 2016", "Interview Descriptions": "The process was concise and expedient. I was told that they would decide soon and they did! I met with two decision makers immediately and they were cordial and professional. I did not feel interview anxiety once the process started. The interviewers incorporated levity into the conversation and this allowed all of us to be ourselves.", "Interview Questions": "Why I would be a good fit in their organization"}, {"date": "30 Apr 2015", "title": "\"Provider\" Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I applied online. The process took 3 months. I interviewed at Clinicas Del Camino Real (Ventura, CA)", "Interview Descriptions": "*Prior to interview, you have a huge packet to fill out for the background check which takes a month or more. Once you finally get an interview: One management person, one other who is also recording your answers to questions.\r\n\r\nHowever, not all critical information is given in interview, or at hiring. Only after hired at specific pay, do they tell you the limits of the job. IE: non-union, no rights, management can do whatever they want.\r\nASK SPECIFICS  - for instance, how many hours? is there a limit?  if part-time, can they change your schedule at whim? if shift work, can you count on specific shifts?", "Interview Questions": "Asked about experience working with cultural issues, language barriers."}, {"date": "17 Oct 2015", "title": "Office Clerk Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Clinicas Del Camino Real (Oxnard, CA) in Jan 2011", "Interview Descriptions": "I had a none existing interview basically they called me to set up an appointment and I filled out the paper work at an office in ventura from there I just filled out everything I needed to fill out and was taken to my work station where I was assigned my daily tasks.", "Interview Questions": "Do you want this job?"}]]