[[{"date": "23 Jun 2023", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at School of Visual Arts (New York, NY) in Apr 2023", "Interview Descriptions": "They have , welcoming vibes. Very friendly. Explaining details about works. They make a schedule on time. Good. i hope to work together. They can be great colleague and boss.", "Interview Questions": "What is general time line in the school ?"}, {"date": "27 Mar 2023", "title": "Director of Operations Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at School of Visual Arts", "Interview Descriptions": "fast interview, short response time. didn't work out the way i wanted but it was alright. i have interviewed for multiple positions with SVA and this has always been the case.", "Interview Questions": "They asked about my past relevant experiences"}, {"date": "26 Jul 2022", "title": "Student Library Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at School of Visual Arts", "Interview Descriptions": "Relaxed. They were very accomodating. I emailed the SVA Library about potential job openings. A week or two I was able to go in and get interviewed by the supervisor.  I went in and talked to the supervisor and got to know the staff.", "Interview Questions": "What was your previous experience?"}, {"date": "31 Aug 2022", "title": "EHS Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at School of Visual Arts (New York, NY) in Jul 2022", "Interview Descriptions": "Great in-person interview BUT very vague idea of what kind of candidate they were looking for and what the job would entail. Boss is very particular. Felt like a wild goose chase because by the end it was clear I was nowhere near qualified, they just asked me to interview because of one specific skill set I had that was not on anyone else’s resume (I was the only candidate with hazardous chemical experience). He said in 2 weeks he would narrow down his pool and it’s been a month with no word…job has been open for like 6 months and I know others have been ghosted so I’m not sure they even know what they’re looking for.", "Interview Questions": "Basic - what are your weaknesses? What do you aim for? Can you work independently? What qualities make you good for this job?\n\nMainly boss wants someone who is a problem solver (will deal with things on their own, not come to him and ask “what do I do next?” which I admit is a rare quality among most) and has fire/chemical expedite "}, {"date": "19 Feb 2022", "title": "Admissions Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at School of Visual Arts", "Interview Descriptions": "Process was really straightforward: \r\n- Applied online, went through 30 minute phone interview, followed by hour long in-person interview w a few employees and brief 5 presentation about anything, just to demonstrate public speaking capability, final HR questions followed by references/background check", "Interview Questions": "How would you handle a difficult conversation  with student during a portfolio review"}, {"date": "18 Feb 2022", "title": "Resident Assistant (RA) Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at School of Visual Arts", "Interview Descriptions": "The interview process was quick and easy. Applied because RA do get free housing, however in the middle of interview process I realized that I was not a good fit for the role.", "Interview Questions": "why do you want to become a RA?"}, {"date": "12 Mar 2021", "title": "Exhibition Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at School of Visual Arts", "Interview Descriptions": "Two-step; Meet with department staff to discuss position requirements and details then if all goes well, meet with HR for more formal interview. Be prepared to talk about your strengths and weaknesses, HR wants to hear both.", "Interview Questions": "Are you a good institutional fit?\nThis is an important question as working at a school requires a certain compatibility with many different departments and personalities."}, {"date": "3 Mar 2021", "title": "Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at School of Visual Arts (New York, NY)", "Interview Descriptions": "The Department head and the searching committee reviewed portfolio and professional experiences and had a dialog about various subject matter especially around visual communication, new media, and art in general.", "Interview Questions": "Question about my previous teaching experiences"}, {"date": "12 Aug 2020", "title": "Front Office Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at School of Visual Arts (New York, NY) in Mar 2020", "Interview Descriptions": "The head of the department contacted me to come and see him for an interview. Very pleasant, was on time and it was easy to follow. Then they gave me a tour of the department and met some of the people that work there. It was pretty awesome, I enjoyed it a lot", "Interview Questions": "Do you have experience about the position?"}, {"date": "18 Sept 2020", "title": "Project Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 6 months. I interviewed at School of Visual Arts (New York, NY) in Feb 2020", "Interview Descriptions": "I participated in two interviews for this position.  The first interview was with the team leader.  The second interview was with the department team.\r\n\r\nI had expressed working with the department for which I interviewed over the course of approximately 1-1/2 years.\r\n\r\nI spent a total of approximately 1-1/2 hours interviewing and perceived that my joining the team would be mutually beneficial, that there seemed to be a culture fit in terms of personality and existing skills sets—and that I could add value.\r\n\r\nAbout one month passed between the second interview and the beginning of the March COVID pandemic declaration.\r\n\r\nAfter several attempts to follow-up on my application, I did eventually hear back approximately six months later from the team leader.  They apologized for the drop in communication and explained the extenuating personal and business reasons behind it, which I appreciated.  \r\n\r\nThey inferred that the position for which I interviewed was no longer available.\r\n\r\nI would not be surprised if an internal candidate was selected for this position (this happens in higher-ed institutions frequently).  It is also possible that the budget originally allocated to the job for which I was interviewing got re-allocated to create a new role, to mitigate potential pressure from students whom might be concerned with the current \"political\" and / or \"social justice\" climate in our country.   Private corporations and educational institutions \"fear\" getting \"cancelled\" by their customers and matriculating students and so, hiring teams feel obligated to make certain decisions and adapt in extenuating circumstances, where personal or global health emergencies—and \"political pressures\"—may be variables.  Of course, it's also possible that they felt I simply wasn't the correct person for the job.\r\n\r\n✔︎ That said, the expectation that a representative from the school's human resources department should have been enlisted to update me in a timely fashion regarding the status of my application is reasonable.\r\n\r\n✔︎ I take no issue with not being offered this job or with the team that interviewed me.\r\n\r\n✔︎ However, I would like to see seamless communication plans in-place for the future because my time has value and also, because I am familiar with the culture of this school and know they are capable of doing better.\r\n\r\n__\r\n\r\nDisclaimer\r\n\r\nPlease note that this review is based on my own personal experience and perception and is protected by free speech laws within the jurisdiction of The United States Of America.  It is my opinion only and the general public whom engage with this content are encouraged to form their own opinions and do their own independent research.  Thank You.", "Interview Questions": "N/A"}], [{"date": "16 Dec 2019", "title": "ESL Writing Teacher Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through other source. I interviewed at School of Visual Arts (New York, NY) in Dec 2019", "Interview Descriptions": "I am not superstitious, you might be interested to know that I interviewed at 4:00 pm on a rainy Friday the 13th.  The interview lasted about an hour and twenty minutes. The first half of the interview was an orientation session although there was no offer or acceptance of the position beforehand. After complaining about having to prepare for a major holiday celebration that evening, Dr. Maryhelen Hendricks  alternately read from a three- or four-page, single-spaced course description, paraphrased the job requirements, and spoke in commands. Many of her sentences began with \"You will...\" . This had a smothering effect. She answered some of my questions during this monologue; most of the others, for the reasons stated below, became moot. The second half of the interview was a more typical question-and-answer session. It went well for awhile. Then she became increasingly confrontational. It began with her raising a routine manner: a background check. She said, \"If you've ever been in jail, you'd better tell me right now so we can say goodbye.\" I non-verbally indicated I had no criminal record. When I said there were several factors for me to consider regarding the position, including that I would have to reduce my hours at my current position to teach a class at SVA, she shot back, \"You could have had all three!\" When I replied that this had not been clear to me, she became visibly angry. When I requested a day or two to consider her offer, which was never explicitly made, Dr. Hendricks suggested that I should have interviewed earlier because she was leaving town next week. She then demanded that I \"decide here and now.\" I declined to do so, and the interview ended. It was clear from one of her emails that she was under pressure to fill the position, but there was no indication that this was a take-it-or-leave-it-on-the-spot proposition. I suspect that she wanted me very badly and therefore engaged in arm twisting to get me on board. Hectoring is a non-starter for me. If it appears in an interview, more of the same and worse is likely to occur on the job. That said, if you're willing to put up with that sort of behavior, SVA might be a good fit for you. If you're not, it isn't. The hourly rate is high---$89---but like most college adjunct positions, it is a lot of work, as the materials presented to me indicated. Dr. Hendricks said that a writing coach and other support staff are available to assist teachers with curriculum development and that people rarely leave. However, given our  clash in personal styles, these were insufficient inducements for me.", "Interview Questions": "Tell me about yourself."}, {"date": "15 May 2021", "title": "Lab Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at School of Visual Arts (New York, NY) in Sept 2019", "Interview Descriptions": "you will interview them in ZOOM and they will test your language and discuss your background.  If you have experience with computer assistant, you will easily take the job. By the way, they will use native people.", "Interview Questions": "Do you have any experience with updating the new software on 30 computers?"}, {"date": "10 Jan 2023", "title": "Studio Technician Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at School of Visual Arts in May 2019", "Interview Descriptions": "Initial interview with HR and then an interview with Studio Manager and Director of Operations. HR process took a long time even after Studio Manager offered the job and I accepted.", "Interview Questions": "Asked for prior experience with photography equipment."}, {"date": "25 Sept 2018", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at School of Visual Arts (New York, NY)", "Interview Descriptions": "Participated in a job fair in April. Had a good conversation with HR and advised to apply online. I did. Received a reply about an interview at the end of June. Interviewed in July.", "Interview Questions": "What would you do if you don't know what to do?"}, {"date": "11 Aug 2017", "title": "Assistant to the Chair Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at School of Visual Arts in May 2017", "Interview Descriptions": "The interview process was pretty simple. I applied online via their website and got a response from the Chair's secretary who scheduled my first in-person interview. I spoke with two secretaries and it was a very pleasant conversation and went well. I was then invited to another onsite interview where I met with the Chair of their Computer Art department. He went over my work experience and why wanted to work at SVA.  It was a pleasant experience meeting everyone and going into the office and then things got bad. They never contacted me again.\r\n\r\nI understand that the recruiter cannot reach out to every applicant for the role but they should have the decency to update candidates that they bring in for on site interviews in a timely manner. I'm fine with rejection but it is a common courtesy to keep applicants who have taken the time and effort to come into the office in the loop. I found that unprofessional.", "Interview Questions": "Why did you apply for this position?"}, {"date": "26 Mar 2017", "title": "CIDA Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at School of Visual Arts (New York, NY) in Mar 2016", "Interview Descriptions": "Informative about the requirements of the job and the description. Employer had the resume out and asked about specific experiences and skills and how were they used before in other jobs.", "Interview Questions": "Do you possess the following skills?"}, {"date": "8 Jun 2016", "title": "Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at School of Visual Arts (New York, NY) in Jan 2016", "Interview Descriptions": "It was great they called me in a few times and I met with all the appropriate personnel and submitted to a drug test. They were very nice and were responsive to all the questions that I asked. I cannot say greater things about a companies way of hiring for a staff position.", "Interview Questions": "Why I left my last job and my current job Knowledge skills"}, {"date": "21 Nov 2019", "title": "Multiple Positions Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 5 days. I interviewed at School of Visual Arts (New York, NY) in Jan 2015", "Interview Descriptions": "One Interview was with the person how later became my supervisor. Another was with an H.R. person. The person who I wound up working for I had met previously as I applied to The School of Visual Arts for undergradute school. I have worked two different positions at the school but from before 2015 (as far back as Glassdoor let's one choose.)", "Interview Questions": "What is my experience (specifically with visual arts) and my education and availability."}, {"date": "18 Sept 2015", "title": "Student Circulation Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at School of Visual Arts (New York, NY) in Sept 2014", "Interview Descriptions": "Invited for a 30 minute interview. Interviewed by two managers that asked basic questions on interest in working at the library and ability to work 20 hours a week. Asked past experience managing staff and ability to lead a team.", "Interview Questions": "Will you be able to work up to 20 hours a week throughout the entire semester?"}, {"date": "10 Sept 2014", "title": "Manager Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at School of Visual Arts in Jun 2014", "Interview Descriptions": "Truly the most bizarre interview I have ever experienced.\r\n\r\nTwo of the three people I met were incredibly nice and welcoming. The questions were typical and they barely interviewed me, really. Unfortunately, the interview with the direct supervisor for the position was extremely unpleasant; s/he was verbally hostile and I was asked inappropriate questions. I'm almost 100% sure it's illegal to ask your marital status and sexuality w/in the context of an interview. If it isn't illegal, it's certainly inappropriate.", "Interview Questions": "What is your marital status?"}], [{"date": "16 Apr 2018", "title": "Production Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at School of Visual Arts (New York, NY) in Jan 2014", "Interview Descriptions": "A phone call and a few in person interviews, very casual, with Production Office Manager and Assistant Manager.  A cover letter should absolutely be submitted and your resume ought to include a comprehensive list of every piece of equipment you've even SEEN someone touch within ten feet of you.", "Interview Questions": "open ended questions regarding familiarity with film equipment; more of a tour of the facilities."}, {"date": "30 Mar 2017", "title": "Systems Support Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at School of Visual Arts (New York, NY) in Jan 2013", "Interview Descriptions": "HR conducts the interview and as such they don't have a great understanding of specific technical roles. They will ask the questions that you can anticipate in any interview, mostly having to do with your years of prior experience in a similar role and if you have any working knowledge of any software necessary for the role.", "Interview Questions": "What relevant experience do you have that might help you in this role?"}, {"date": "30 Aug 2015", "title": "Handyman Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 months. I interviewed at School of Visual Arts (New York, NY) in Nov 2011", "Interview Descriptions": "Took a long time before I was called for a interview. When I was finally called for a interview after that it took another 4 months for a 2nd interview.", "Interview Questions": "What experiences I have as a Handyman."}, {"date": "11 Sept 2011", "title": "Engineering Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at School of Visual Arts (New York, NY) in Sept 2009", "Interview Descriptions": "I remember it being a good quick process", "Interview Questions": "Why do you want to work here?"}]]