[[{"date": "16 May 2023", "title": "Teaching Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at University of Rochester (Du Quoin, IL)", "Interview Descriptions": "For this edition of Safe Classrooms, I revisited one of my favorite teacher books called Nonviolent Communication by psychologist Marshall Rosenberg. It’s sold over 1 million copies, so maybe you’ve heard about it or read it yourself. I think this book can provide some strategies for dealing with internal and interpersonal conflict and may be worth reading and sharing with others in your life.", "Interview Questions": "don't review it yet but i wish"}, {"date": "5 May 2023", "title": "PhD Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of Rochester (Rochester, NY)", "Interview Descriptions": "The interview process depends on the specific program or department. However, a general outline of the process is as follows: Application Submission: Prospective students must first complete and submit their application, along with any required documentation such as transcripts, test scores (GRE, TOEFL, etc.), letters of recommendation, and a personal statement or essay. Application Review: The university's admissions committee will review the submitted applications and assess the candidates' eligibility based on their academic background, test scores, and other relevant factors. Shortlisting: After the initial review, the admissions committee will shortlist candidates who meet the program's requirements and have demonstrated strong potential for success in the program. Interview Invitation: Shortlisted candidates will receive an invitation to participate in an interview, which could be conducted in-person, over the phone, or through video conferencing platforms like Zoom or Skype. Interview Preparation: Candidates should prepare for the interview by researching the program, reviewing their application materials, and practicing their responses to common interview questions. They may also want to prepare some questions to ask the interviewer about the program, faculty, or university. Interview: During the interview, candidates will have the opportunity to discuss their academic and professional background, goals, and interests with faculty or admissions committee members. The interviewers will assess the candidate's communication skills, motivation, and overall fit with the program. Post-Interview Evaluation: The admissions committee will evaluate candidates based on their interview performance, application materials, and overall qualifications. Decision Notification: After the evaluation process, the university will notify candidates of their admission status. Accepted candidates may be required to submit additional documentation, such as financial aid forms or proof of English language proficiency, before enrolling in the program. Acceptance and Enrollment: Candidates who have been offered admission must accept the offer and complete any required enrollment procedures, such as paying a deposit or submitting final transcripts, to secure their place in the program.", "Interview Questions": "I did not get any questions"}, {"date": "2 May 2023", "title": "Registered Nurse, BSN Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of Rochester (Canandaigua, NY)", "Interview Descriptions": "Interviewed by a team through zoom for the interview. Everyone was very nice and they asked the common questions asked for nursing. It took about an hour for the whole process.", "Interview Questions": "How do you handle conflict"}, {"date": "29 Apr 2023", "title": "Business Analyst Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at University of Rochester (Rochester, NY)", "Interview Descriptions": "There was an initial phone interview with the hiring manager, then a Zoom interview with a few of the people I would be working with. They asked questions first, then I got the chance to ask questions.", "Interview Questions": "Give an example of a time you overcame adversity."}, {"date": "21 Jan 2023", "title": "Call Center Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of Rochester", "Interview Descriptions": "Of course i had to wait for the call .It was straight to the point interview then i had to go home and write why would I be a great fit for the job", "Interview Questions": "What is one of strenghts and also weakness"}, {"date": "29 Jan 2023", "title": "Finance PhD Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of Rochester (Chicago, IL) in Jan 2023", "Interview Descriptions": "The email said it will take less than 10 minutes, while it took about 17 mins to finish. The professor only asked a few questions: Introduce research experience; Why PHD; Ask me. Most of the time we were chatting.", "Interview Questions": "Q:Introduce research experience; Why PHD; Ask me"}, {"date": "16 Feb 2023", "title": "Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of Rochester in Jan 2023", "Interview Descriptions": "no interview. The only thing you need to do is to write a short message to show your passion for this job and your sense of responsibility for the job. Then after around a week, you can get your result.", "Interview Questions": "N/A"}, {"date": "16 Nov 2022", "title": "Advancement Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at University of Rochester", "Interview Descriptions": "Horrible interview process. Wasted 4-6 months of my time and everyone else that was involved. Went through the entire process, met with the hiring manager, direct team, hirer ups. I was told I was going to receive an offer then immediately never heard back with all communication cut off. This company lacks moral ethics and communication. Very unprofessional the way they handled everything. DO NOT APPLY OR WORK FOR THIS ORGANIZATION!", "Interview Questions": "Standard Interview Questions. Nothing out of the norm."}, {"date": "31 Oct 2022", "title": "Department Secretary Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at University of Rochester", "Interview Descriptions": "Easy - the interview was more of a \"get a feel for a person, see if you vibe\" type of a discussion. I didn't hear back for a while, so I emailed for an update - got the offer!", "Interview Questions": "The classic: Tell me about yourself."}, {"date": "14 Oct 2022", "title": "Nurse Practitioner Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Rochester", "Interview Descriptions": "pleasant, honest, nice and quite welcoming. They were honest with the job role and excited that they were hiring. It was a pleasant overall process. They did not ask any questions that were inappropriate and were interested in what I wanted.", "Interview Questions": "What I wanted in a job"}], [{"date": "7 Sept 2022", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at University of Rochester (New York, NY)", "Interview Descriptions": "I had an interview with two Professors from the Mechanical Engineering department. They asked questions about my background, my solving problems techniques, and my interest in the research conducted in the department. they were friendly and polite", "Interview Questions": "N/A"}, {"date": "26 Aug 2022", "title": "MEDICATION ACCESS SPECIALIST Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at University of Rochester (Rochester, NY)", "Interview Descriptions": "Interview was pleasant , a technician and a pharmacist explained job details. HR contacts you prior to actual interview for assessment.\n\nWaited one month for a decision, only to contact the HR representative for outcome and update on a decision. Only to be sent a letter of rejection.\n\nUnprofessional", "Interview Questions": "What was one example of how you showed great customer service ?"}, {"date": "22 Aug 2022", "title": "Finance Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of Rochester", "Interview Descriptions": "Five rounds of interviews; three on zoom (including a group interview) and two in person (one on one).  We discussed the job duties, my background and resume, what made me a good fit for the position.", "Interview Questions": "I was asked about my background and resume, preferred management styles, experience with different data and accounting systems."}, {"date": "21 Jun 2022", "title": "Human Subject Research Coordinator I Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of Rochester", "Interview Descriptions": "Phone screening with basic questions regarding salary expectations and what the company offers, schedule interview, met with team for interview. Conducted interview, waited, received phone call with job offer. Selected start date.", "Interview Questions": "How does your previous work experience relate to this position?"}, {"date": "14 Jun 2022", "title": "Patient Care Technician Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of Rochester", "Interview Descriptions": "I had 3 interviews over the process over a period of several weeks for the position of Patient Care Technician. The interviews were were both one on one and also with a group of people.", "Interview Questions": "Why do you want to work here?"}, {"date": "11 Apr 2022", "title": "Adjunct Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of Rochester", "Interview Descriptions": "the interview I have to say was very well set up, friendly process, and there were absolutely no adversarial questions which was nice. I thought the interview was reflective of the department culture; it's been a good place to work.", "Interview Questions": "Asked about experience with teaching"}, {"date": "21 Feb 2022", "title": "CETL Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at University of Rochester", "Interview Descriptions": "The interview was easy and laid back. They take you into a conference room with a few other candidates and walk you through potential teaching scenarios and ask how you would react and handle them.", "Interview Questions": "How would you handle a loud and disruptive student?"}, {"date": "12 Feb 2022", "title": "Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of Rochester", "Interview Descriptions": "It may be 1-on-1 Interview OR Group Interview\r\nStep01: Pitch, tell me about yourself\r\nStep02: Case Interview - focus on thinking way\r\nStep03: Focus on personality and your teamwork experience\r\nStep04: Introducing the projects and objectives\r\nStep05: Q&A session", "Interview Questions": "* Tell me about yourself\r\n* How your friend would describe you\r\n* How do you locate your personality"}, {"date": "24 Jan 2022", "title": "Data Entry Clerk Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of Rochester", "Interview Descriptions": "Zoom interview with the supervisor/scheduler. It lasted about 20minutes. It was very brief and an average interview. Explained the duties of the job. And, asked when I was available to work", "Interview Questions": "How do you organize yourself "}, {"date": "21 Jan 2022", "title": "Researcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of Rochester", "Interview Descriptions": "Technical. Asking about engineering. Somewhat difficult. Interviewer was very inquisitive. For instance, after asking a question, they would ask follow-up questions on a whiteboard and have me draw out various tasks. So, again, it was technical. Asking about engineering. Somewhat difficult. Interviewer was very inquisitive. For instance, after asking a question, they would ask follow-up questions on a whiteboard and have me draw out various tasks.", "Interview Questions": "Draw out the inner workings of a hydrogen reaction."}], [{"date": "17 Jan 2022", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of Rochester", "Interview Descriptions": "Interviewed with the head of the lab after speaking with other members. Casual process, online portion was a formality. In my case, the job posting was for a position already filled", "Interview Questions": "Why did you choose your major?"}, {"date": "30 Dec 2021", "title": "Admissions Reader Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Rochester", "Interview Descriptions": "My interviews were great and the people were kind and pleasant.  I had two interviews total and then a third to negotiate compensation.  Compensation offered was very low with no negotiation.", "Interview Questions": "How can you determine professionalism through applications?"}, {"date": "26 Dec 2021", "title": "Graduate Student Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at University of Rochester", "Interview Descriptions": "The interview was hosted via zoom back in 2020. The interviewer was really nice, asked some common questions, and was empathetic the whole time. it probably took 15 mins or so.", "Interview Questions": "What is your short term and long term goal"}, {"date": "30 Nov 2021", "title": "Project Coordinator Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 3 weeks. I interviewed at University of Rochester (Rochester, NY) in Nov 2021", "Interview Descriptions": "Went through three different rounds of interviews with eight people in total asking questions. They stated that they could not tell me what the salary would be because they use a formula to determine that based on experience. I contacted HR to see what the pay scale was to determine if it would be worth going forward with multiple interviews and HR shared the pay scale with me. Then I was offered the position at literally the lowest amount on the pay scale despite having 15+ years experience and being highly qualified for the position. When I said I would not be willing to take such a significant pay cut (40% below what I was already making doing the same work for a competitor) and made a counter offer they said that there was no way they could pay that much. They then called me back an hour later and said that they reconsidered and matched the salary that I asked for. I ended up taking the position but felt that they were dishonest about what the pay scale and using a formula to determine their offer.", "Interview Questions": "What are your strengths and weaknesses? Where do you see yourself in five years? Why should we hire you? Why are you considering leaving your current position?"}, {"date": "21 Oct 2021", "title": "Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of Rochester", "Interview Descriptions": "Submitted my name as an interested applicant. Applied online. I was already working at UR Medical Center. Received an email and set up an interview. I interviewed one on one with department head.", "Interview Questions": "What experience do you have?\nAre you comfortable teaching large lectures?"}, {"date": "5 Nov 2021", "title": "Patient Access Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. I interviewed at University of Rochester (Rochester, NY) in Oct 2021", "Interview Descriptions": "first interview was a phone screen to learn about position and if I would be a good fit. Second interview in person with managers to get to know everyone and learn about the hiring process. Hr contacted me a few days letter with an offer which I accepted. I am now waiting on my background check for the pre- employment screening to start next week.", "Interview Questions": "Where do you see yourself in a few years?\r\n\r\nDo you work well under pressure?\r\n\r\nHow do you handle a difficult person/customer?"}, {"date": "25 Apr 2023", "title": "Technical Support Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at University of Rochester (Rochester, NY) in Sept 2021", "Interview Descriptions": "It was a pretty chill interview. It was more conversational and the boss was very nice. You start by introducing yourself and then they will start asking questions. The questions are just general questions and not too technical.", "Interview Questions": "What are your strengths and weaknesses? How do you define success?"}, {"date": "22 Aug 2021", "title": "Research Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of Rochester", "Interview Descriptions": "There was a single interview with PI. He asked fairly standard questions about resume, strengths/weaknesses, and prior research experience. Then there was a tour of the lab and I got the chance to ask a few quesitons", "Interview Questions": "What is your greatest strength?"}, {"date": "13 Aug 2021", "title": "Human Subject Research Coordinator I Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of Rochester", "Interview Descriptions": "They asked a series of questions and had a supervisor sit in on the interview. I was interviewed by a human subject research coordinator II position. The questions were standard questions for interviews.", "Interview Questions": "What is one weakness you have "}, {"date": "26 Jul 2021", "title": "Assistant Director of Alumni Relations Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 months. I interviewed at University of Rochester (Rochester, NY) in Apr 2021", "Interview Descriptions": "Interviewing was a quite lengthy and time consuming process. I had five separate  interviews  with multiple people, only to have the job go to an internal candidate. That happens at UofR all the time, at least in development and alumni relations.", "Interview Questions": "I can’t remember specific questions. "}], [{"date": "25 Mar 2021", "title": "IT Helpdesk Analyst Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at University of Rochester", "Interview Descriptions": "Good questions. Interview was fine, problem was the environment and didn't get to ask questions. When walking in you can see the current employees enjoying a short laugh and as soon as the manager walks me in to the interview room.... it was like a shift they all turned to their screens and proceeded to answer calls.", "Interview Questions": "Typical IT questions on troubleshooting"}, {"date": "24 Mar 2021", "title": "Marketing Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Rochester", "Interview Descriptions": "Was contacted several weeks after first applying online. However, process moved quickly after they reached out for the first time. Met with HR rep and hiring manager quickly - one after another.", "Interview Questions": "Tell me about yourself and past experience. "}, {"date": "10 Apr 2021", "title": "Clinical Research Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Rochester (Rochester, NY) in Feb 2021", "Interview Descriptions": "Received a followup in 2 days after my initial application asking for reference contacts and to set a date for my zoom interview. I was interviewed by the PI as well as the other research coordinators. My goals and wants from the job opportunity did not line up with that of the university, but It was a pleasant experience.", "Interview Questions": "What other studies have you coordinated and what was your role in them?"}, {"date": "20 Apr 2021", "title": "Population Health Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Rochester in Feb 2021", "Interview Descriptions": "The over all process was very slow and after meeting up with people for four rounds of interview and following up many times, I receive a response saying they have decided to take the position in a different way and the post will be reposted on the website and suggested me to reapply", "Interview Questions": "1.experince with health records?\n2.what is your ideal  work environment?\n3.Where do you see yourself in 5 years?"}, {"date": "14 Jan 2021", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at University of Rochester", "Interview Descriptions": "The course I am applying for is an intro statistics class. My professor interviewed me for questions like why I want to be a TA for his class and what will I do to help students learn more.", "Interview Questions": "Why I want to be a TA for his class"}, {"date": "11 Jan 2021", "title": "Technical Consultant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at University of Rochester", "Interview Descriptions": "Ask previous experiences and some behavior questions. The interviewer is the hiring manager. The interview is not hard and very easy to pass. Just need to be active and take it easy.", "Interview Questions": "Have you had a related experience before? "}, {"date": "6 Jan 2021", "title": "Talent Acquisition Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Rochester", "Interview Descriptions": "I completed two interviews with U of R.  The first was great and very informative.  But, it took 2 weeks before I heard back about scheduling the second.  During the second interview, the role was described very differently than it was during the first interview.   I was not able to get any straight forward answers when I asked clarifying questions.  After the second interview (months ago), there was no follow up or feedback.  I completely understand that life gets busy and things slip through the cracks, however, it was not a positive experience.  I would not apply for another role on their Talent Acquisition team in the future.", "Interview Questions": "Experience, motivation for applying, types of roles worked on in the past"}, {"date": "12 Oct 2022", "title": "Postdoctoral Fellow Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at University of Rochester (New York, NY) in Dec 2020", "Interview Descriptions": "A seminar to talk about works during PhD. The questions surround science and method development. It was a really good interview experience. People within the group were also super nice.", "Interview Questions": "Why do you wanna to apply for this position?"}, {"date": "12 Dec 2020", "title": "Ambulatory Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of Rochester in Dec 2020", "Interview Descriptions": "Traditional application and interview including shadowing with an employee. They also explain clearly general system as an employee there and your role so you know what to expect. \nOverall the employers are very responsive and very kind.", "Interview Questions": "Ability to multitask?\nWhat makes you a good candidate?"}, {"date": "11 Jul 2021", "title": "Student Editor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of Rochester (Rochester, NY) in Dec 2020", "Interview Descriptions": "Video conference over zoom with the two primary supervisors of the position. Process was relatively fast and friendly. Relevant questions were asked, and the decision was given at the end of the interview.", "Interview Questions": "Past coding experience with any given language"}], [{"date": "30 Aug 2021", "title": "Analyst Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at University of Rochester (Rochester, NY) in Dec 2020", "Interview Descriptions": "Fair interview. Based on past experience and current skills. Interviewers may be biased and influenced too heavily on perception and not the candidate's actual abilities. They may underestimate an employee's potential contributions.", "Interview Questions": "How do you feel working in an environment with some level of stress?"}, {"date": "31 Dec 2020", "title": "Senior Human Resource Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Rochester in Nov 2020", "Interview Descriptions": "Received an email from the hiring manger some time after applying to do a phone interview with her. During the phone interview, she ask generic, casual questions. She ended the call with wanting me to meet the team via a zoom meeting. It was over a week since I heard from her when she emailed back how overwhelmed she was and apologized for the delay. We set up a meeting with the team for zoom a few days out from when the email was sent. Did the zoom meeting and was surprised no one was on camera. The hiring manager said her team is camera shy, so I turned off mine to make it less awkward. The hiring manager said she would ask a few things first and then jump off the call and leave the team with me to ask their questions. Before she jumped off, she said she'd follow up with me by the end of the week. Answered the questions from the team and asked my own as well. After the interview, I never heard back at the end of the week. That zoom meeting was on 11/16. I emailed the hiring manager on 12/10 and still silence as of 12/31. It's such a turn off when recruiters, managers, or whoever completely ghost their applicants. If it wasn't for that, my overall experience wouldn't be negative.", "Interview Questions": "How do you prioritize deadlines when things come up unexpectedly?"}, {"date": "9 Nov 2022", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at University of Rochester (Rochester, NY) in Jul 2020", "Interview Descriptions": "Read about the Lab in depth and the professor's work before applying. If you are a student, then it should be easy. Furthermore, take courses that are related to the position you are applying.", "Interview Questions": "Walk me through your resume."}, {"date": "10 Feb 2020", "title": "Tour Guide Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at University of Rochester", "Interview Descriptions": "there were three rounds to the interview process. the first was written pplication, second was group interview, third was individual. overall you need to know about the school and have a bubbly personality", "Interview Questions": "give a 30 second story"}, {"date": "19 Dec 2019", "title": "Technician III Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at University of Rochester", "Interview Descriptions": "Applied online. Received an email to set up an interview a few days later. Interview was fairly standard, asking if I had experience with the different techniques that had been described in the job description.", "Interview Questions": "Tell me about yourself. "}, {"date": "18 Oct 2021", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at University of Rochester (Rochester, NY) in Sept 2019", "Interview Descriptions": "Meet with the researcher that in my interested field, the researcher will talk about their projects and ask what kind of knowledge you have. Then will ask about why choose the researcher's lab and what project can be assigned to you.", "Interview Questions": "Why did you choose our Lab?"}, {"date": "12 Aug 2019", "title": "Accountant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Rochester", "Interview Descriptions": "There was a 3 panel interview lasting roughly 45 minutes to start off.  This was followed by a 1 on 1 interview with the director.  The questions were mostly behavioral, and just to see if you had done any research on the department and their activity.", "Interview Questions": "What do you know about this department?"}, {"date": "18 Aug 2022", "title": "Outpatient Access Specialist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of Rochester (Rochester, NY) in Aug 2019", "Interview Descriptions": "Had phone interview with HR who asks questions to see if you qualify. If you are offered the position, the practice Manager calls you in for an in person interview. After that, it took two weeks to hear back. It was about a month process.", "Interview Questions": "What is a past experience where you needed to problem solve. "}, {"date": "18 Feb 2021", "title": "IT Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. I interviewed at University of Rochester (Rochester, NY) in Aug 2019", "Interview Descriptions": "I was asked about my previous experiences with working with people. Not technical as much as behavioral. I was interview by two people for thirty minutes, both the main boss and the Lead.", "Interview Questions": "They asked me to talk about my previous experiences. "}, {"date": "23 Jul 2019", "title": "PhD Graduate Student - Biology Department Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Rochester", "Interview Descriptions": "I applied in late November 2018 and received an invitation to the in-site interview on December 23rd. The interviews took place at the University of Rochester. The program paid for flights, hotel, and meals for three days. I interview with 6 faculty, 20min each.", "Interview Questions": "Why do you want to pursue a Ph.D.? What are your long term plans? Do you want to stay in Academia or go to Industry? Tell me about your previous research experiences. "}], [{"date": "12 Jan 2021", "title": "Health Project Coordinator Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Rochester (Rochester, NY) in May 2019", "Interview Descriptions": "The interview was fine, nothing too intense. The job description online did not do a great job at explaining what this position really was, which was much more data-driven than expected, as the online summary made it seem more project management based. Overall, a pleasant experience, nothing to complain about.", "Interview Questions": "Do you have experience auditing medical charts?"}, {"date": "9 Apr 2019", "title": "PhD Graduate Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Rochester", "Interview Descriptions": "The application process took a while, they invited me to come down for their phd recruitment weekend for interview. I had interview with four different professors that had similar research interests as I did.", "Interview Questions": "Background/Research Interest/My contribution as phd student. "}, {"date": "2 Jul 2019", "title": "Postdoctoral Research Associate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at University of Rochester (Rochester, NY) in Apr 2019", "Interview Descriptions": "The position at LLE was advertised for a grant with definite research objective. I think I am pretty capable and I applied online.  It took 2 months to get through the DOE censorship. I was invited to an on-site interview. The interview was okay. The interviewer promised to send decision in two weeks. However, 2 weeks past, no news. I waited for about 1 month and finally know that they are considering another candidate. To my surprise, they did not tell me anything until I asked. \r\nAs it is consistently predicted, I was not told anything until the other candidate accepted the offer. In the end, they selected the person based on the need of so-called \"pragmatic\" research, which is not as advertised. Amazing!\r\n Anyway, the whole process took about 4+ months and it is a torture.\r\nBe aware of the internal politics and good luck!", "Interview Questions": "What experiment you will do to verify your theory?"}, {"date": "3 Jul 2019", "title": "Undergraduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at University of Rochester (Rochester, NY) in Apr 2019", "Interview Descriptions": "After a course ends, the professor would contact some top students in class according their academic performance and invite them to be the teaching assistant of the next semester via email .", "Interview Questions": "After the job description, I was asked whether have interest in that job."}, {"date": "7 Mar 2019", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of Rochester", "Interview Descriptions": "Thorough education background review, as well as cross examination for knowledge of the material. The interviewer was friendly and approachable, and the interview lasted about thirty minutes total. Overall the interview turned out to be easier than expected, and I heard back within a week.", "Interview Questions": "Describe your experience in a related class?"}, {"date": "25 Feb 2021", "title": "Athletic Communications Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at University of Rochester (Rochester, NY) in Sept 2018", "Interview Descriptions": "I talked with a director of athletic communications and they asked about my resume. They also were interested in the sports I was familiar with and would be comfortable covering.", "Interview Questions": "What sports are you familiar with?"}, {"date": "15 Oct 2018", "title": "Research Technician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at University of Rochester (Rochester, NY) in Aug 2018", "Interview Descriptions": "A professor from the lab emailed me asking my availability for an in-person interview. During the interview, the professor went over their current research goals and gave me a tour of the lab. I was also given an opportunity to talk with laboratory staff.", "Interview Questions": "What is your biggest weakness?"}, {"date": "25 Apr 2018", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at University of Rochester", "Interview Descriptions": "Face-to-face meeting and discussion about research interests and future goals, why you would be a fit in lab and what expertise can you bring to any current projects in the lab", "Interview Questions": "Why are you interested in our lab's work?"}, {"date": "23 Apr 2018", "title": "Data Assistant Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at University of Rochester", "Interview Descriptions": "The interview process was done by a referral. I  went into the manager's office. They looked at my resume, and took me on a tour of the work place.", "Interview Questions": "no questions- they did not ask questions; you get to do menial office work all day."}, {"date": "22 Sept 2020", "title": "Lab Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Rochester (Rochester, NY) in Mar 2018", "Interview Descriptions": "Pretty straight forward, they call and describe the job and then ask if you're interested in coming in. Then they ask you basic interview questions. Probably varies on the department but I heard back within 2 days of applying.", "Interview Questions": "Describe a time that you had to think outside of the box to solve a problem"}], [{"date": "22 Feb 2018", "title": "Digital Producer Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at University of Rochester", "Interview Descriptions": "There were3 round of interviews-- the first one was a phone interview that covered many behavioral questions, and then followed by a video interview with some of the search committee members, finally the last one was another video interview with different teams and more committee members.", "Interview Questions": "Can you define Success?"}, {"date": "6 Nov 2018", "title": "Director Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 6 weeks. I interviewed at University of Rochester (New York, NY) in Nov 2017", "Interview Descriptions": "no real process if they like you they take you to lunch and then offer the job to you on the spot and they talked bad about the staff and they said the place was in good shape", "Interview Questions": "what do you feel is important in a job"}, {"date": "8 Jun 2018", "title": "Staff Accountant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at University of Rochester (Rochester, NY) in Nov 2017", "Interview Descriptions": "Received a email asking for a phone interview three days after applied online. After phone interview, received another email asking for a in-person interview.  Interviewed with two managers and four staffs all at the same time in the conference room for about 40 minutes.  Everyone asked questions.", "Interview Questions": "Where do you see yourself in five years?"}, {"date": "16 Jul 2017", "title": "Senior Psychiatric Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 6 days. I interviewed at University of Rochester (Rochester, NY)", "Interview Descriptions": "Received a call from the nurse manager maybe the day of or the day after I applied to schedule an interview. The interview was scheduled for a few days later and was with the nurse manager and assistant nurse manager. A lot of time was spent just talking about the position and duties. I appreciated how it felt more of a discussion rather than an interview. They then showed me around the unit and I shadowed someone for about 30 min.", "Interview Questions": "How would you react to a patient that is angry and frustrated?"}, {"date": "25 Aug 2019", "title": "Postdoctoral Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at University of Rochester (Rochester, NY) in Jul 2017", "Interview Descriptions": "Arrive day before the interview; next day meet in the morning with hiring group leader; give a talk to a group of 4-5 people; talk with different people; get a tour to a lab; the visit was paid by University except of air plane.", "Interview Questions": "Why you interested to work with us? \r\nWhy we have to hire you?"}, {"date": "16 Nov 2018", "title": "Information Analyst Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at University of Rochester (Rochester, NY) in May 2017", "Interview Descriptions": "Hiring Manager called over a month after I sent my application in. We scheduled a phone interview with the Hiring Manager, then he called me in to talk in person. The interview was easy - we talked about the position and University benefits more than my qualifications.", "Interview Questions": "Give an example of a problem you experienced and how did you solve it?"}, {"date": "18 Oct 2018", "title": "Workshop Facilitator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at University of Rochester (Rochester, NY) in Apr 2017", "Interview Descriptions": "The process first involved a written application about our interest in the position and how well we had performed in the class. The interview was a group interview with approximately eight other candidates.", "Interview Questions": "The questions were mostly case-based questions, such as how we would handle not knowing the answer to a student's question. "}, {"date": "28 Mar 2017", "title": "Workshop Leader Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 3 weeks. I interviewed at University of Rochester (Rochester, NY)", "Interview Descriptions": "This was a group interview with 2 students that were prior workshop leaders and one of the people present was an employee. The interview was hosted by the past workshop leaders and consisted of the possible scenario that a workshop leader could face.", "Interview Questions": "How would you make all the students feel included?"}, {"date": "16 Mar 2017", "title": "Meridian Society Tour Guide Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of Rochester", "Interview Descriptions": "3 step hiring process that consisted of a written application, group interview, individual presentation. Quite typical questions that have to do with the University as well as a short amount of behavioral questions to see how one would conduct themselves in front of a family.", "Interview Questions": "What is one thing you would change about the University of Rochester"}, {"date": "25 Jan 2019", "title": "Patient Registration Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at University of Rochester (Rochester, NY) in Feb 2017", "Interview Descriptions": "I was asked questions surrounding my knowledge of insurance payers, as well as how team oriented I was, and how I would handle myself under tense situations.  The interview was not very long, but I was sure to provide sound and complete answers.", "Interview Questions": "How do you respond to an coworker who is a bother to you?"}], [{"date": "12 Jul 2017", "title": "Systems Administrative Trainee Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at University of Rochester (Rochester, NY) in Jan 2017", "Interview Descriptions": "The panel/group asked technical questions as expected in regards to aspects needed to monitor the system. It was a Linux System Admin position. Technical as well as behavioral questions were asked.", "Interview Questions": "Asked about various command in Linux in the form of quiz."}, {"date": "6 Nov 2016", "title": "Licensed Veterinary Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. I interviewed at University of Rochester (Rochester, NY)", "Interview Descriptions": "We toured the facility and the Asst Supervisor explained about the animal rooms and Standard Operating Procedures to enter and leave them. Then I had the interview.  It was fairly informal.  It was with the facility supervisor in his office.  There were general questions regarding my experience and my understanding of what the job entailed.  Why I was leaving my previous employer.  What my long term goals were.", "Interview Questions": "If I understood what would be expected of me."}, {"date": "11 Apr 2017", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at University of Rochester (Rochester, NY) in Aug 2016", "Interview Descriptions": "Easy talk, just proves you have related experience. Then introduce your future role and function. Should be easy for a student part time job. Even an undergrad can do that if you are motivated and be patient.", "Interview Questions": "What your projects experience?"}, {"date": "23 Sept 2019", "title": "Software Development Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 3 weeks. I interviewed at University of Rochester (Rochester, NY) in Jul 2016", "Interview Descriptions": "On my resume, I had specified a few some impacts I made in my previous job and they asked me to explain how I made the impact. They were very friendly throughout the interview which made the whole process easy and comfortable for me.", "Interview Questions": "Asked about one specific impact I had made in my previous job"}, {"date": "14 Jan 2017", "title": "Manager of Financial Systems Operations Support Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 1 week. I interviewed at University of Rochester (Rochester, NY) in Jul 2016", "Interview Descriptions": "My initial interview was via phone. The next steps involved 30 minutes each with 3 separate department managers.  Each manager asked questions regarding their department's interaction and expectations of the position.  They all were very thorough in explaining the previous challenges of the position from their perspective.", "Interview Questions": "Why are you interested in the position?"}, {"date": "4 Sept 2016", "title": "Technician Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1+ week. I interviewed at University of Rochester (Rochester, NY) in Jun 2016", "Interview Descriptions": "Two week waiting process.  Not many online options for job search and job hunting. No contacts information listed when trying to apply.  Good phone etiquette . Long parking wait .", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "16 May 2016", "title": "Financial Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of Rochester", "Interview Descriptions": "First was phone screening, then hiring manager interviewed then called for the 2 interview by the director and peers. \r\nInterview was average, got the offer after 3 weeks. Offer was pretty good.", "Interview Questions": "Tell me about yourself"}, {"date": "29 Jun 2017", "title": "NOC Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at University of Rochester (Rochester, NY) in May 2016", "Interview Descriptions": "Interview process was  friendly and comfortable for me.  Hiring process was  easier and fast. I applied through  university job portal. I immediately received further instructions for onsite .  Interview lasted for 2 hours with technical as well behavioral questions.", "Interview Questions": "Many questions were related to wired networks with my prior experience.  Interviewer also asked about wireless network  stuff."}, {"date": "12 Apr 2016", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at University of Rochester", "Interview Descriptions": "The process was brief, involving a phone interview followed by an in person interview. They asked questions about past experience, as well as questions related to working on a team. The entire process lasted for about a week, and was offered a position after providing a list of references and then met with them in person.", "Interview Questions": "Describe your past experience?"}, {"date": "31 Dec 2016", "title": "Pre College Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at University of Rochester (Rochester, NY) in Apr 2016", "Interview Descriptions": "It was a group interview in Wallis Hall. Everyone was asked general questions and expected to respond. Interviewed by admission staff. Some people got chosen. I don't know what they were looking for. Not everyone answered all the questions-as it just became awkward when most people repeated others.", "Interview Questions": "Have you worked with kids before?"}], [{"date": "31 Mar 2016", "title": "Service Assistant At Hillel Chapel Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at University of Rochester (Rochester, NY) in Mar 2016", "Interview Descriptions": "The application process was completed online. After a period just under a week, I received an email to confirm possible interview times. less than a week later, I was asked to meet at the chapel and I was walked through the job I would potentially be receiving. After the brief explanation and a tour of the chapel, I was informed that I i was selected I would be receiving an email in several days time. I did not receive such an email.", "Interview Questions": "They asked if I would be willing to commit to the job for several years."}, {"date": "4 Apr 2016", "title": "Technical Associate Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at University of Rochester (Rochester, NY) in Feb 2016", "Interview Descriptions": "Behavioral interview. The interviewer was very friendly and welcoming. The first interview took place with the HR department, which covered my basic qualifications. The second interview was with the department head, who talked to me about the job and my previous experience. Overall the interview took place in one day and the process was very smooth.", "Interview Questions": "How will your previous experience help you in the position you are applying for?"}, {"date": "15 Aug 2017", "title": "PhD Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at University of Rochester (Rochester, NY) in Feb 2016", "Interview Descriptions": "Go to different professors' offices to be interviewed one by one. Listen to a seminar and provide feedbacks. Q&A  with current students. Fully covered flight, hotel, and meals.", "Interview Questions": "Generally, why you want to apply for this major. What is your plan during and after PhD.  What are the Ask research questions based on your CV. How specifically you did the research. Why this model. "}, {"date": "10 Aug 2016", "title": "Program Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at University of Rochester (Rochester, NY) in Jan 2016", "Interview Descriptions": "I felt very comfortable and at ease. They welcomed any questions I may have had. It took two interviews and a long wait from HR before I was hired. It was two interviews in front of a panel.", "Interview Questions": "Why I was looking to work in that department"}, {"date": "12 Nov 2015", "title": "Information Security Technical Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at University of Rochester", "Interview Descriptions": "It was a very brief phone interview followed up with an in person interview. There were not a lot of technical questions, and it was mostly focused on personality and how you would be able to get along with their team. It was very quick and I had an offer within just a few days.", "Interview Questions": "What do you know about Vulnerability Management."}, {"date": "28 Oct 2015", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 3 months. I interviewed at University of Rochester in Sept 2015", "Interview Descriptions": "Need to get A or A- in the course and they will notice you about that. The department hire representative will connect with you. You must be the second year graduate student in this university.", "Interview Questions": "N/A"}, {"date": "19 Nov 2019", "title": "Senior Accountant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Rochester (Rochester, NY) in Sept 2015", "Interview Descriptions": "Interview was formal interview questions. I interviewed with the manager first, then with her superior and co-worker as a second round of interviewing. The interview was about an hour long.", "Interview Questions": "Why do you want to work here?"}, {"date": "21 Aug 2015", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 3 weeks. I interviewed at University of Rochester (New York, NY) in Aug 2015", "Interview Descriptions": "Excellent personal questions. They were professional and prepared for my qualifications. I sat before a panel and was given a chance to expound on my virtues. I was given every opportunity to prove myself an excellent candidate for the position.  I am in the process of waiting to hear the outcome of the interview.  I am one of 2 people they are considering.", "Interview Questions": "How did I feel about up selling"}, {"date": "16 Sept 2015", "title": "Billing Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Rochester (Rochester, NY) in Aug 2015", "Interview Descriptions": "Phone interview which was about 10 min and after that I got an email to set up a one on one which lasted about 30 min in total. Had to pay to park which seemed a little unprofessional but I have seen worse. I wore a suit and tie and still did not get the job. The interviewer seemed to want to be some other place and a little disinterested in me being there", "Interview Questions": "Basic questions how long have you done this what can you bring to the dept"}, {"date": "9 Aug 2019", "title": "Data Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of Rochester (Rochester, NY) in Jul 2015", "Interview Descriptions": "Applied online, but did not hear back from them. I follow up with the hiring manager and was called in for an interview. The interview went well, I was offered a job the next day. Worked there for 5 years.", "Interview Questions": "Tell me your strengths and weaknesses?"}], [{"date": "6 Jun 2019", "title": "Senior Technical Associate Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at University of Rochester in Jun 2015", "Interview Descriptions": "Many promises made, some kept; many were outside of the control of the hiring manager. Good benefits package with a reasonable work life balance. Many nice people and an overall positive environment with the exception of upper management which seems to have issues in listening to their staff.", "Interview Questions": "Explain your experience that makes you qualified for this position? "}, {"date": "20 Feb 2015", "title": "Public Safety Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through other source. The process took 3 weeks. I interviewed at University of Rochester", "Interview Descriptions": "45 minute orientation going over general information pertaining to the job and the University -> 45 minute interview with multiple supervisors who are very professional and thorough. Be honest and know WHY you want the position and why you want to work for UR ->complete background investigation. Be honest throughout and work with your investigator to make their job as smooth as possible.  If you have anything to hide they will find out. ->medical", "Interview Questions": "Role playing questions"}, {"date": "19 Feb 2015", "title": "Graduate Student Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at University of Rochester (Rochester, NY) in Feb 2015", "Interview Descriptions": "Applied online in December. At the beginning of January I got invitation for an interview weekend event over the phone by professor. For the first day, we just hung out with other applicants and the graduate students. The next day I was interviewed by three different professors.", "Interview Questions": "Assuming had unlimited funds, describe an experiment you would conduct."}, {"date": "27 Oct 2015", "title": "Secretary IV Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at University of Rochester (Rochester, NY) in Jan 2015", "Interview Descriptions": "Interviewed with 2 people.  It was initially the person scheduling the appointments and then you had to go through HR process and background check.  You also had to make sure that you didn't have any outstanding student loans.", "Interview Questions": "Why are applying for this job"}, {"date": "5 Nov 2014", "title": "Research Assistant Interview", "results": "No Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I interviewed at University of Rochester", "Interview Descriptions": "The interview was more of a information session. The interviewer didn't do much to find out about me. The interview also lasted two hours and included a building tour. It was interesting to see what the interviewer was working on however it was not your typical interview. I really had to talk about myself to get that across.", "Interview Questions": "Asking about stereochemistry of an organic molecule"}, {"date": "20 Nov 2014", "title": "Clinical Project Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Rochester in Nov 2014", "Interview Descriptions": "The interviews are based on what research project you are going to work with. I specifically applied for the CAPED project. They responded my job application about two weeks after I put in my application. The over the phone was simple. It was composed of a description of the project, asking me how I felt about it, and my qualifications.", "Interview Questions": "N/A"}, {"date": "16 Jan 2015", "title": "Analyst Programmer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Rochester in Sept 2014", "Interview Descriptions": "Started with 1 phone interview regarding what I know and if I fit the requirements. Follows is about 4 rounds of in person interviews by at least 3 people per round. Everyone is dressed up so go with pen, paper, questions, and dressed up buttoned shirt and tie.", "Interview Questions": "Explain your work process / techniques that you would implement in this position. "}, {"date": "13 Jul 2015", "title": "Postdoctoral Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of Rochester (Rochester, NY) in May 2014", "Interview Descriptions": "I sent my CV first to get myself a 30min interview. Then an one-hour oral presentation of my work was scheduled. After the presentation, I had 15min individual talks to some professors and the chair in the department. A number of detailed technical questions from my supervisor was the last part of the day.", "Interview Questions": "what do I want to get from the postdoc experience"}, {"date": "26 Jan 2016", "title": "Graduate Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. The process took 5 weeks. I interviewed at University of Rochester (New York, NY) in May 2014", "Interview Descriptions": "After the application was submitted I was contacted via email to schedule an interview for admission. The first interview was technical and lengthy. I was the contacted once more about a second interview. The second interview was with a faculty member. I really enjoyed speaking with the staff member. Three weeks later I was contacted with an offer of admission.", "Interview Questions": "Why do you want to be in this program?"}, {"date": "21 Nov 2015", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at University of Rochester (Rochester, NY) in Apr 2014", "Interview Descriptions": "The process to apply to be a math TA was really straightforward. You submit a paper application with recommendation from a faculty member, then they (probably) schedule you for an interview within a week of the application deadline. After the interview, I heard back within a few weeks with what course they would like me to TA for, out of the ones I had requested.", "Interview Questions": "Find the area enclosed between the curves sin(x) and x"}], [{"date": "23 Apr 2015", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at University of Rochester (Rochester, NY) in Jan 2014", "Interview Descriptions": "I had the interview in my professor's office. He introduced a lot about his recent research to me and showed some results from previous research. I was interested in that research so I decided to be his research assistant.", "Interview Questions": "Are you interested in this research?"}, {"date": "28 Sept 2017", "title": "Graduate Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Rochester (Rochester, NY) in Dec 2013", "Interview Descriptions": "on site interviews in one day. Lunch break in between. Party afterward. Tour visit on the second day. five professors interviewed half an hour each. They were looking for inspired individual who was very into science. High GPA and GRE score would help a lot.", "Interview Questions": "why do you want to get PHD degree"}, {"date": "26 Apr 2016", "title": "Undergraduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at University of Rochester (Rochester, NY) in Oct 2013", "Interview Descriptions": "I came into the professor's office for the in person interview. Then we toured where the bulk of my work would be done. After that we chatted about our hobbies. It was a pretty informal interview.", "Interview Questions": "Basic qualifications and such. They don't try to tick you."}, {"date": "1 Aug 2013", "title": "Technical Associate II Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of Rochester", "Interview Descriptions": "Two interviews, initial one with multiple lab members and a tour of the facility, and overview of the research and the second one with the PI of the lab and his administrative assistant. They had multiple online postings avaialble, so it was difficult to tell which posting they were interviewing me for. In the end, they offered me a position well below my expereince level, and were not willing to negotiate the offer.  In the interview they were upfront about the expectation of much more than a 40hour workweek.", "Interview Questions": "One interviewer said \"I understand you have young children\" (which I never disclosed to them), probably to gauge my availability to work late hours. (Which, btw, is illegal for them to ask)"}, {"date": "10 May 2015", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at University of Rochester (Rochester, NY) in Feb 2013", "Interview Descriptions": "I met with the entire office for the position I applied for. Everyone was kind and welcoming. I met with clusters of people separately. It was a bit daunting. There had been no one in my position previously, so I did not get the chance to ask them many questions that was relevant.", "Interview Questions": "Why do I want this position?"}, {"date": "17 Mar 2013", "title": "Administrative Assistant/Practice Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at University of Rochester (Rochester, NY) in Feb 2013", "Interview Descriptions": "I applied 2/7.I got a call 2/11. First interview with the Dept Administrator and Dept HR Rep on 2/14, took about 1.5 hours.  They contacted me 2/15 and asked me for references and a second interview on 2/18 to meet with the Department Chairs and the Department Physicians, Nurse Practitioners, and Staff.  I came in, had 3 separate interviews lasting about 2 hours total.  They had me come in at the end of the day, so everyone would be in their office but the physicians still ended up running behind and did not make it for the second interview.  So they asked me to come back again for a 3rd interview.  I requested that they schedule it after hours because I currently work 8 to 5 but they still scheduled it on 3/4 at 3pm.  I again paid for parking and took more time off for work.  I met with the rest of the physicians.  It lasted 2 hours again.", "Interview Questions": "How would you motivate your employees to complete a difficult task?"}, {"date": "7 Aug 2016", "title": "Licensed Practical Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at University of Rochester in Jun 2012", "Interview Descriptions": "Manager called and spoke with me about hobbies and aspirations, I came in for a tour and then after that, I was hired over the phone.it was a wonderful positive experience.", "Interview Questions": "Where do you see your self in 5 years"}, {"date": "25 Apr 2015", "title": "Parking Services Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at University of Rochester (Rochester, NY) in Dec 2011", "Interview Descriptions": "Interview was about 15 minutes long. Person had to read questions off of paper. He was more nervous than I was. I was not shown around the area. A very brief description of the job was given", "Interview Questions": "They asked about my last job"}, {"date": "5 Oct 2015", "title": "Service Assistant - Dining Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 1 day. I interviewed at University of Rochester (Rochester, NY) in Sept 2011", "Interview Descriptions": "The interview process was very short and easy. These positions require little experience, though experience with cashiering or store maintenance are certainly a plus. The interview essentially consisted of considering my past background and work experience. We further discussed what responsibilities I would be comfortable with, what skills I felt I had to offer, etc as well as my current availability and desired work schedule. In regards to this the management was generally very accommodating, to the best of their ability.", "Interview Questions": "There were no difficult questions in the interview. "}, {"date": "24 Jul 2013", "title": "Human Resources Assistant III Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 days. I interviewed at University of Rochester (Rochester, NY) in Jul 2011", "Interview Descriptions": "I applied they called me in for an interview, I went in and interviewed with my direct boss who hired me.", "Interview Questions": "none that I can think of, it was pretty straight forward"}], [{"date": "13 Jul 2015", "title": "Laboratory Technician Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Rochester (Rochester, NY) in Jun 2011", "Interview Descriptions": "I applied online and received an email requesting an interview, I came in for the interview, which lasted about an hour, and was later offered the position. During the interview I toured the lab, met other lab members and spoke with other faculty. I received an email offer for the position about a week after the interview.", "Interview Questions": "To describe my thought process when working through a problem in my current job."}, {"date": "9 Mar 2014", "title": "Graduate Student Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. The process took 3 months. I interviewed at University of Rochester (Rochester, NY) in Apr 2011", "Interview Descriptions": "University of Rochester physics graduate school application, Based on GPA, GRE, letters of recommendation and Research experience", "Interview Questions": "Why do you want to be a graduate student?"}, {"date": "4 May 2014", "title": "Graduate Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at University of Rochester (Rochester, NY) in Mar 2011", "Interview Descriptions": "I applied via an online application system and came to a prospectives' weekend event in early March.  Over the course of two days I had five faculty interviews and 10+ student interviews.  Each interview was half an hour long, and could range from technical questions to a short Q&A about the interviewer's research.  There were also many informal conversations with graduate students.", "Interview Questions": "Who is your favorite computer scientist?"}, {"date": "14 Jul 2011", "title": "Information Analyst Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at University of Rochester (Rochester, NY) in Feb 2011", "Interview Descriptions": "I had applied online for Information Analyst position. I received from hiring manager for 1:1 interview. Interview went for 45 min. Few HR questions and then few statistical questions- regression analysis and Excel/SAS/Stata skills. It wasn't too hard.", "Interview Questions": "Explain your experience with SAS/Stata."}, {"date": "27 Jan 2014", "title": "PhD Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of Rochester (Rochester, NY) in Feb 2011", "Interview Descriptions": "I applied online, sent the application package by mail and got the on site interview in late January.", "Interview Questions": "One of the faculty member asked me about my summer vacation, really unexpected one!\r\nThe interview is very chill and casual. It seems like the main purpose is getting to know the applicants and showing them around. "}, {"date": "22 Mar 2014", "title": "Assistant Director Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 3 months. I interviewed at University of Rochester (Rochester, NY) in Nov 2010", "Interview Descriptions": "After submitting my email through a horrible online system.  I received a call and spoke with somebody in the department.  After that I came in for three small group interviews.  Following that I had another 1:1 interview.  After that I had a day of 1:1 interviews.", "Interview Questions": "many interviews focused on their level of expertise not what would be required of somebody in another position.  That made it difficult as it felt as though we were connecting."}, {"date": "12 Jan 2012", "title": "Office Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at University of Rochester (Rochester, NY) in Sept 2010", "Interview Descriptions": "It was pretty relaxed - I showed up, answered some standard questions (tell me about yourself, why do you want this job, what are you studying, etc.).  I had almost no work experience at the time so it was really more personality based: they were just looking for a friendly person they'd enjoy working with who'd show up on time and get their stuff done.", "Interview Questions": "Tell me about yourself"}, {"date": "17 Aug 2014", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at University of Rochester in Aug 2010", "Interview Descriptions": "Emailed professor during the summer to get a position in the fall, talked about what specifically interested me from her work, she invited me for an interview, showed me the lab and that's it.", "Interview Questions": "Nothing really unexpected, asked me about previous experience, where I want to go, explained her work a bit more specifically"}, {"date": "4 Dec 2013", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at University of Rochester (Rochester, NY) in Feb 2010", "Interview Descriptions": "submit the application, online and mail\r\nphone interview\r\nreceive offer", "Interview Questions": "depends on your experiences, and the advisor"}, {"date": "12 Jul 2010", "title": "Major Gifts Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "The process took 4 weeks. I interviewed at University of Rochester (Rochester, NY) in Nov 2009", "Interview Descriptions": "I was impressed by the interview process.  Two telephone interviews were followed by an offer to fly me to Rochester for a full day of interviewing.  I interviewed 17 people face-to-face.  Some was one on one, others were with groups of two or three.  I only had a half hour with each person or group, which I felt was too rushed.", "Interview Questions": "I really did not receive any surprising or difficult questions"}], [{"date": "30 Oct 2009", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 2 weeks. I interviewed at University of Rochester (Rochester, NY) in Jun 2009", "Interview Descriptions": "Nice people, but there is quite some administrative processing to be done.", "Interview Questions": "Explain how your background relates to the job requirements"}, {"date": "14 Apr 2010", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "The process took 3 months. I interviewed at University of Rochester (Rochester, NY) in Feb 2009", "Interview Descriptions": "I interviewed with Strong Staffing, U of R's staffing agency, for general Data Entry / Office Assistant jobs. Just getting an interview was a very long process- I had spent 3 months applying for jobs on their website without a single response before going into the office and applying in person. It took about a month after that to get an interview and I wasn't called with my first job offer for about 3 months after that. Even then, the man who called me and left a message never once answered his phone and never returned my calls.\r\n\r\nAll of my contact prior to the interview was with office secretaries who took care of scheduling my interview and administering the skills tests, which were the standard typing drills and MS Office literacy assesments. After the tests I finally met with an actual recruiter for the interview. Because I didn't apply for a specific job but was there to become part of their \"temp agency,\" questions were mostly based around finding which positions to place me in, along with some standard questions to make sure that I could handle myself in an office environment. The interview itself was relatively easy, but I did feel a bit patronized by some of the questions because of my age (I had just graduated college) and I definately left with the understanding that they would call me to follow up, not the other way around.", "Interview Questions": "What traits do you think make up an ideal supervisor / boss?"}, {"date": "24 Jun 2010", "title": "Program Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at University of Rochester (Rochester, NY) in Apr 2008", "Interview Descriptions": "I applied online and was called for a phone interview about 2 months later.  I came in and interviewed for the Director and executive director.  They asked a lot of questions regarding my past experience and then explained the programs to me.   Was called back for a second interview with the director.  Director offered a different position than originally applied for.", "Interview Questions": "What was a typical day like in your last position??"}]]