[[{"date": "N/A", "title": "Visiting Professor, Nursing Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Chamberlain University (Chicago, IL) in Aug 2022", "Interview Descriptions": "The Talent Acquisition Specialist scheduled an appointment with me within a week from the day I applied. The conversation was friendly, straightforward, and informative. The gentleman ( I'm not sure if I can share his name) explained what they are looking for and the requirements for the position. He also asked me a few questions about the professional situations and my solutions. At the end of the conversation, he asked me if we could move forward with the process, to which I agreed, and he explained my next step. Eventually, I received an email and was able to schedule a meeting with the Associate Dean of Faculty. The lady was charming and knowledgeable. She asked me a few questions related to the positions and told me what she was looking for. The interview went well. Overall the process is very organized and structured. I would recommend, of course, being prepared for the interview but also being positive, friendly, and helpful.", "Interview Questions": "I was mostly asked professional questions related to the position or factors that may affect students and how will I resolve them. \n"}, {"date": "15 Jun 2023", "title": "Nurse Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Chamberlain University (North Brunswick, NJ)", "Interview Descriptions": "Series of interviews, the first interview is over the phone. Then you have to complete an online assessment. The second interview is in person at the campus. You do a fifteen-minute teaching demonstration and have a panel interview. I am in the process of the second interview next week.", "Interview Questions": "Why do I want to teach at Chamberlain University?"}, {"date": "12 Jul 2023", "title": "Master of Public Health Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Chamberlain University (Dallas, TX) in Jun 2023", "Interview Descriptions": "The interview was very casual and laid back. They ask basic questions like tell me about a time when you went beyond to help an at-risk student. Overall, the interview was pretty easy. They care a lot about student well-being and supporting every student.", "Interview Questions": "Tell me a time when you went beyond to help an at-risk student."}, {"date": "8 Feb 2023", "title": "Visiting Nurse Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Chamberlain University (Chicago, IL) in Jan 2023", "Interview Descriptions": "The interview process was organized ~ efficient~ and truly reflects the mission and philosophy of the school. Mr. Bartels was clear and concise and with great communication skills that fosters clarity and direction in the initial process of the application as well as throughout the onboarding process. The Chamberlain leadership team were prompt and clear during the interview process.", "Interview Questions": "What can I contribute into the role as an educator and how to handle specific situations."}, {"date": "24 Nov 2022", "title": "Adjunct Nursing Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Chamberlain University (Richmond, VA) in Nov 2022", "Interview Descriptions": "The onboarding was seamless! The recruiter kept open communication and communicated with me in a timely manner. The Director of the program was very informative regarding the job and was very easy to talk to.", "Interview Questions": "Why do you want to be a nursing faculty at Chamberlain? What is your teaching philosophy?"}, {"date": "28 Oct 2022", "title": "Student Learning Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Chamberlain University (Atlanta, GA) in Oct 2022", "Interview Descriptions": "My first interview was a telephone interview with Miss Taft. The interview was great, Miss Taft gave me a lot of information about the company and the position that I was interested in. The atmosphere was very casual and I was at ease during the interview. I was allowed to discuss my qualifications and ask questions. All in all, a great interview.", "Interview Questions": "I was asked how I would approach students with different learning styles."}, {"date": "11 Sept 2022", "title": "Recruiter Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Chamberlain University", "Interview Descriptions": "Round 1 group interview about 15 people. The second  round was an individual one with the director. No phone screen first one was in person. The first one was to judge how you do well presenting to a group of individuals.", "Interview Questions": "Can’t remember has to get up in front of group\nAnd speak. "}, {"date": "3 Oct 2022", "title": "Part Time Clinical Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Chamberlain University (Sacramento, CA) in Sept 2022", "Interview Descriptions": "First, you will be interviewed by a Talent Acquisition Specialist to go over requirements and expectations. Next, your resume will be forwarded to the hiring manager. An automated scheduling service will be emailed to you to schedule an interview time. Finally, you will meet virtually during the selected date and time to have the interview.", "Interview Questions": "Tell me about yourself. Have you taught before?"}, {"date": "9 Sept 2022", "title": "Nurse Education Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Chamberlain University (Sacramento, CA) in Aug 2022", "Interview Descriptions": "I interviewed online with hiring personnel. It was pleasant and a great experience. She was nice and friendly. I interviewed with the manager and she was pleasant and explained the job and gave me a tour of the facility where I would be working. The interview was pleasant.", "Interview Questions": "What strengths to you bring that will help you be good for this position?"}, {"date": "12 Jul 2022", "title": "Associate Dean Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Chamberlain University", "Interview Descriptions": "Straightforward with efficient communication. The recruiter was very helpful and streamlined the process well. They were upfront with salary and benefits. Each person was kind and answered my questions well.", "Interview Questions": "Why are you interested in working at Chamberlain?"}], [{"date": "20 Jun 2022", "title": "Alliance Director of Campus Operations Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Chamberlain University (Phoenix, AZ) in May 2022", "Interview Descriptions": "The interview process was seamless. The role and expectations were thoroughly reviewed and explained. The benefits of working for Chamberlain and the impact they make on student lives made the role even more appealing.", "Interview Questions": "What attracted me to the DCO role?"}, {"date": "31 May 2022", "title": "Visiting Professor, Nursing Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Chamberlain University (Arlington, VA) in May 2022", "Interview Descriptions": "The interview process for Chamberlain University was very smooth.  Everything occurred as described and the follow-up communication was timely. It was one of the most efficient interview processes I have had over the past few months.", "Interview Questions": "Why did I want to work as an instructor?"}, {"date": "24 Jun 2022", "title": "Visiting Professor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Chamberlain University (Jacksonville, FL) in May 2022", "Interview Descriptions": "The Interview Process was efficient and extremely organized. My Talent Acquisition Specialist answered all of my initial questions and guided me through the next steps of the application process. I also spoke with the Associate Dean of the college who further expanded on any other questions that I had.", "Interview Questions": "How would you assist a student that was experiencing difficulty with a learning assessment ?"}, {"date": "15 Apr 2022", "title": "Visiting Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Chamberlain University (Rockville, MD) in Apr 2022", "Interview Descriptions": "Recruiter does screening initially, then interview with the dean and other staff members.\nVery simple process.\nschedules for interview  were made at my convenience which is great.\nI was kept on being informed on the changes of scheduling and response to my questions were very quick.", "Interview Questions": "What attracted you to Chamberlain and why teaching?"}, {"date": "1 Jun 2022", "title": "Visiting Professor, Nursing Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Chamberlain University (Chicago, IL) in Apr 2022", "Interview Descriptions": "The interview process was smooth and I did not have to wait too long for the 2nd interview. The interview questions were appropriate. My questions were answered during the interview.", "Interview Questions": "How to handle challenges of students at the clinical site?"}, {"date": "29 Mar 2022", "title": "Admissions Advisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Chamberlain University", "Interview Descriptions": "Spoke to a recruiter first, then had to do a personality test. Had a zoom meeting with the higher ups of admissions. It was proven within the first 5 minutes that they never read my resume because they did not even realize I had a college degree. They were both very rude and unprofessional and I would not want to work for an organization like this. They acted very snobby and the tone of their voice was anything but positive. Do not waste your time here at this company and look for somewhere else.", "Interview Questions": "You had to roleplay as an admissions advisor. "}, {"date": "5 Apr 2022", "title": "Assistant Professor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Chamberlain University (Ashburn, VA) in Mar 2022", "Interview Descriptions": "Miss Kara Taft ( Talent Acquisition Specialist) initiated the interview followed by the team members lead by Dr C. Combs. The interview was thorough and cordial. I gained broader perspective on the position  being interviewed. I am ready and empowered to move forward with the next phase.", "Interview Questions": "My work experiences and accomplishments attained ."}, {"date": "18 Apr 2022", "title": "Administrative Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Chamberlain University (Chicago, IL) in Mar 2022", "Interview Descriptions": "The interview process was seamless and informative. I had both a phone interview and a virtual interview. Each interview left me more excited to join Chamberlain University. Each person I interviewed with was  professional and insightful.", "Interview Questions": "How did you handle a difficult situation in the past?"}, {"date": "15 Apr 2022", "title": "Nurse Educator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Chamberlain University (Houston, TX) in Mar 2022", "Interview Descriptions": "Phone interview, then virtual interview with the Dean. Went very smoothly, comfortable, explained aspects of work and provided written summary of job via email in case you missed any details.", "Interview Questions": "Why do I want to teach nursing students? Would I be interested in teaching the first level students? "}, {"date": "2 Mar 2022", "title": "Visiting Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Chamberlain University (Jacksonville, FL) in Feb 2022", "Interview Descriptions": "Highly efficient and effective.  The interviewer was knowledgeable about the process, the position, the requirements.  She more than adequately described what to expect and was responsive to all questions.   Soley conducted via phone, set up at a time of my convenience.", "Interview Questions": "Experience, how would I handle hard to reach students."}], [{"date": "8 Feb 2022", "title": "Visiting Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Chamberlain University (Tysons Corner, VA) in Jan 2022", "Interview Descriptions": "I had an Initial screening  with Kara and then \r\nInterview with Assistant Dean at Chamberlain University, Tysons Corner campus\r\nBackground checks\r\ndrug screening\r\nInternational education evaluations\r\nMultiple inquires about transcripts \r\nofficial transcripts from the international school and the US", "Interview Questions": "option for a Full-time position"}, {"date": "1 Feb 2022", "title": "Visiting Professor, Nursing Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at Chamberlain University (Irvington, NY) in Jan 2022", "Interview Descriptions": "The interview process was very professional and positive. Questions were answered in a timely manner. Kara was a great help and provided me with a lot of information that I needed to complete the process.  She was very positive and professional when representing HR for Chamberlain University.\r\nDr. Williams was also a joy to talk to. She explained the responsibilities and the job well. I am looking forward to being a faculty member at Chamberlain University, Nursing.", "Interview Questions": "About my experience and what I could bring to the university."}, {"date": "15 Nov 2021", "title": "Admission Advisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Chamberlain University", "Interview Descriptions": "I applied for a position on 5/28/21 and I didn’t hear back until 7/20/21. I was eventually contacted for a phone interview by a recruiter on 7/22/21. My next interview was set up for 7/27/21 and I was supposed to interview with the hiring team. However, on that day, only one of the team members showed up. At first, the process was pleasant and I did not have any issues.\r\n\r\n\u2028My issues started after the completion of the first interview. I spoke to the recruiter and they told me I would receive an interview with the other team member the following week. However, the recruiter never responded until the day of my interview - 8/4/21 at 6 AM. This type of response was an unprofessional move by the recruiter.\r\n\r\n\u2028After going through a disorganized interview process, I am still awaiting a response. After the last interview, the hiring team told me that I was going to receive a response a week later but they never gave me one. This is an unprofessional move. \r\n\r\n\u2028Since the hiring team did not respond, I had to try and follow up with the recruiter with a phone call on 8/23/21. I also tried to send a follow-up email on 9/1/21 and 9/23/21. I did not receive a response at all from the phone call and emails. I believe that receiving no response about my application from the hiring team is unprofessional, unacceptable, and disrespectful as a candidate. As a result, disciplinary action should be taken against them for their incompetence. Furthermore, I learned that the recruiter left the company - therefore, my application was not managed properly at all. \r\n\r\nIt is clear that someone in the organization is not doing their job properly and they should be terminated from their position. Furthermore, I demand that I receive a position as an Admissions Advisor with Chamberlain’s Addison, IL campus OR any of their campuses after I struggled with the recruiting process with Adtalem.", "Interview Questions": "Tell us about a time you had to build a relationship with someone."}, {"date": "3 Dec 2021", "title": "RN Clinical Instructor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Chamberlain University (Woodbridge, VA) in Nov 2021", "Interview Descriptions": "It was a 30-minute phone interview. Very positive recruiters. Even though the position was not right for me because it was in person, they were still helpful in passing along my information to their online staffing recruiters.", "Interview Questions": "Can you tell me a little about yourself?"}, {"date": "21 Oct 2021", "title": "Student Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Chamberlain University (Pembroke Pines, FL) in Oct 2021", "Interview Descriptions": "From recruiter to hiring manager interviews, everything was streamlined and efficient. I was video-interviewed by two managers. They were professional and not very intimidating which made me more relaxed and confident.", "Interview Questions": "Describe a time when you had to provide critical feedback to a fellow employee."}, {"date": "7 Sept 2021", "title": "Clinical Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Chamberlain University", "Interview Descriptions": "very professional and comfortable environment from start to finish.   They asked several questions but none that were extremely difficult.  I would recommend them and i am happy to accept a position if offered", "Interview Questions": "why do you want to work at chmaberlain"}, {"date": "3 Nov 2021", "title": "Administrative Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Chamberlain University in Sept 2021", "Interview Descriptions": "I spoke with hiring manager who moved me to the supervisor. Both experiences were great.  The hiring manager asked great questions that really helped me evaluate myself and my skills while delivering the information she needed.  My interview with my supervisor was professional but also warm and friendly.  I never felt intimidated and could tell that there was a great team vibe with the company.", "Interview Questions": "How I would handle a difficult call from a student."}, {"date": "3 Oct 2021", "title": "Full Time Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Chamberlain University (Tinley Park, IL) in Sept 2021", "Interview Descriptions": "Interviewed with Talent Acquisition Specialist who asked series of questions; then I took a personality profile assessment. I then interviewed with the Dean of Academic Affairs and the Campus President who asked several general and focal questions. My also interviewed with a faculty development specialist.", "Interview Questions": "What motivated me to apply for the position? What is my philosophy of teaching? Describe a situation where you had to provide constructive feedback to a colleague (employee). Discuss methods you use to coach/mentor a novice educator. Describe a situation where you acted as a change agent. Discuss a teaching-learning situation where ethical principles were intertwined. How do you address (and embrace) accountability in nursing education?"}, {"date": "2 Aug 2021", "title": "Visiting Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Chamberlain University", "Interview Descriptions": "I answered typical questions regarding my experience in teaching this particular level of students. I also answered questions about how my experience would align with the role. All interviews were via phone.", "Interview Questions": "How will your experience help you teaching this course?"}, {"date": "23 Jul 2021", "title": "DOP Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Chamberlain University", "Interview Descriptions": "The interview process at Chamberlain University School of Nursing in Tinley Park Illinois was extensive.  I interviewed with 5 different individuals over the course of 4 weeks.  The definitely do their homework.  Kudos to them.", "Interview Questions": "The asked for my career background."}], [{"date": "12 Jul 2021", "title": "Adjunct Clinical Nursing Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Chamberlain University in Jul 2021", "Interview Descriptions": "Got a call from HR recruit specialist, who will arrange a virtual 20-30 minute interview with the dean in charge. Received positive feedback at the end of interview. Then HR followed up promptly with a job offer.", "Interview Questions": "How did you deal with students who are not making progress?\r\n\r\n"}, {"date": "17 Jun 2021", "title": "Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 5 days. I interviewed at Chamberlain University (Columbus, OH) in Jun 2021", "Interview Descriptions": "Interviewed with HR over the phone. Once that was finished they sent an email with a link and video so I could take a test that looked at personality and how you worked with others. Then I met with the campus president and she interviewed me. After that, I met with the Dean of Academics for a final interview.", "Interview Questions": "When was a time you had an issue with a coworker and what did you do and what type of leadership style do you like?"}, {"date": "13 May 2021", "title": "Student Support Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Chamberlain University (Atlanta, GA)", "Interview Descriptions": "Met with really great people overall. Careful though, there is a red head snake in the bunch. Any time you are potentially a threat to her you risk indifferent treatment. Tread most carefully.", "Interview Questions": "Lots of focus on one's ability to work their way out of difficult conversations."}, {"date": "12 May 2021", "title": "Administrative Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Chamberlain University", "Interview Descriptions": "The interview process was very straightforward. The first step of the process was a fairly short phone interview with talent acquisition. Next step included in person interview with multiple colleagues.", "Interview Questions": "Was asked about skill with Excel."}, {"date": "4 May 2021", "title": "College Admissions Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Chamberlain University (Miramar, FL) in May 2021", "Interview Descriptions": "This was the best interview process. The young lady that interviewed me was remarkable. I had the autonomy to speak freely. I never felt pressured or stressed. The questions that were asked, were meaningful. She also gave great insight on the company and the position.", "Interview Questions": "I was asked about my experience as an admissions advisor. "}, {"date": "14 May 2021", "title": "Adjunct Clinical Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Chamberlain University (Addison, IL) in May 2021", "Interview Descriptions": "The interview process was conveniently arranged and done. Very pleasant and accommodating dean and interviewers . I spoke to a member of the talent acquisition team then met on teams with a group of staff. The position was explained to me and then was given an offer", "Interview Questions": "What I liked about teaching.. my background in healthcare. Current work experience "}, {"date": "14 May 2021", "title": "Digital Media Specialist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Chamberlain University in May 2021", "Interview Descriptions": "All of my communication/scheduling was done through the HR coordinator. I first did a phone screening with her, then a video interview (Microsoft Teams) with the hiring manager the next day. This was followed by two more video interviews the next week: one with two senior team members, and the final interview with the director. In addition, I was asked to complete a personality test and a skill-based activity.", "Interview Questions": "What makes you proud of a project / how do you measure success in a protect?"}, {"date": "8 Sept 2021", "title": "RN-BSN Adjunct Nurse Faculty Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Chamberlain University (Addison, IL) in May 2021", "Interview Descriptions": "Was very incomplete. Did not receive questions specific to my educational background or extensive clinical expertise. No questions about my goals or aspirations or contributions to the nursing field. Scant information about details of the job I applied for. Did receive a little information about orientation. The salary was breached but was not given opportunity to explore parameters for salary determination.\r\nI was very disappointed because I really wanted to be considered for the position. I was well qualified.", "Interview Questions": "Was not asked questions pertinent to the job."}, {"date": "4 Apr 2021", "title": "Nurse Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Chamberlain University (Addison, IL)", "Interview Descriptions": "The interview process began with the Talent Acquisition Consultant reaching out to me who asked about my interest in the position and also provided me general information regarding the job description.  I was then selected to move forward and meet with the Deans of Faculty.  After this meeting the consultant reached out to me and told me I would move forward to meet with the campus President Jan Snow.", "Interview Questions": "What are the challenges I may have regarding the position.  "}], [{"date": "5 May 2021", "title": "Admissions Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Chamberlain University (Sacramento, CA) in Apr 2021", "Interview Descriptions": "Every bit of the interview process was absolutely amazing.  Very informative, answered all my questions, all interviews started right on time, I was made comfortable and welcomed during each interview.", "Interview Questions": "One question I was asked was my qualifications for the position."}, {"date": "10 Apr 2021", "title": "Adjunct Clinical Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Chamberlain University in Apr 2021", "Interview Descriptions": "This has been the best talent acquisition practice I have ever encountered. Ms. Gray was outstanding in all the facets of the hiring process; from arranging interviews to discussing the next steps of the employment requirements, she was very thorough, all with a friendly yet professional demeanor. Overall, I had a great experience with Adtalem (Chamberlain) represented by Ms. Shequenna Gray.", "Interview Questions": "Tell me why you are interested in working at Chamberlain? "}, {"date": "30 Mar 2021", "title": "Admissions Advisor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Chamberlain University", "Interview Descriptions": "I had many one-on-one interviews via Microsoft teams due to the COVID pandemic. The first interview was with who would have been my direct supervisor and with each one it went up a supervisor level. Each person was super nice and easy to talk to. The interviews were not stiff and conversation flowed easily.", "Interview Questions": "Tell me about this on your resume?"}, {"date": "26 Mar 2021", "title": "Student Support Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Chamberlain University", "Interview Descriptions": "Quickly contacted for online interview. Once I completed my online interview I was contacted the same day to move forward with another interview. HR staff were very thorough and helpful throughout process!", "Interview Questions": "Describe a time when you dear with conflict:"}, {"date": "26 Apr 2021", "title": "Visiting Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Chamberlain University (Gibsonville, NC) in Mar 2021", "Interview Descriptions": "It was through, precise and efficient.  One of the best in recent memory.  Janine covered everything I needed in the initial screening.   She laid out next steps clearly and answered my initial questions.", "Interview Questions": "It was not interview questions that were hard, that was like talking with peers.  The nard part were the written questions to be submitted asked about Chamberlain Cares and the TEAM values and how I would meet those with specific examples.\n."}, {"date": "6 Apr 2021", "title": "Student Support Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 4 weeks. I interviewed at Chamberlain University (Charlotte, NC) in Mar 2021", "Interview Descriptions": "I was contacted by a recruiter first to ask a few initial questions. Then I had an interview with the Director of the program and head of admissions. The program director requested a follow up interview the following week. All interviews were done via phone or Microsoft Teams.", "Interview Questions": "How would you handle a situation where the student is complaining about another instructor?"}, {"date": "5 May 2021", "title": "Student Learning Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Chamberlain University (Chicago, IL) in Mar 2021", "Interview Descriptions": "I interviewed with the recruiter, Debbie! The interview was scheduled through an automatic scheduler, making it simple and efficient. After my phone interview with Debbie I was again scheduled using the automatic scheduler to meet with the team in Las Vegas. We did a Teams meeting interview.", "Interview Questions": "What experiences could I bring to the position?"}, {"date": "4 May 2021", "title": "Part Time Clinical Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Chamberlain University (Cleveland, OH) in Mar 2021", "Interview Descriptions": "I received an email asking about my availability to speak with Ms. Gray, recruiter. She totally worked around my schedule.  She asked me questions and provided me an opportunity to ask questions. Was clear about next steps and followed through as discussed.  Emailed regarding availability to interview via zoom with Dean James which went perfectly.  Dean James was very informative, answered my questions and is easy to talk too.  Next steps were explained and the follow-up was timely just as explained.  The entire process exceeded my expectations.", "Interview Questions": "How would I handle a situation where behaviors were not  as they should be by a student."}, {"date": "15 Mar 2021", "title": "Online Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Chamberlain University (Houston, TX) in Feb 2021", "Interview Descriptions": "The process was very simple and direct. I interviewed with the HR Manager and then submitted some proof of courses I took during my graduate studies. Then, I had another interview with the Program Director.", "Interview Questions": "What is your teaching philosophy? "}, {"date": "6 Mar 2021", "title": "Admissions Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Chamberlain University (Los Angeles, CA) in Feb 2021", "Interview Descriptions": "The initial phone interview with HR was very informative, and then I had 3 additional video interviews. Everyone I spoke with was incredibly nice and answered all of my questions.", "Interview Questions": "Many behavioral questions such as: Tell me about a time you solved a dispute with a coworker."}], [{"date": "25 Mar 2021", "title": "Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Chamberlain University (Saint Louis, MO) in Feb 2021", "Interview Descriptions": "The Interview process was extremely positive. All my questions were answered properly.  I was given apple information about the job requirements and benefits. I   do think that the overall process takes a long time.", "Interview Questions": "What was my teaching philosophy?"}, {"date": "6 Jan 2021", "title": "Part Time Clinical Instructor Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Chamberlain University", "Interview Descriptions": "They start off telling you about the school for about 10 minutes. They ask  you questions about your interest in teaching and how you would handle students that are struggling.  They want to know if this is a long term aspiration or just and temporary job for you.", "Interview Questions": "Why do you want to teach?\r\nHow would you handle a student who is struggling?"}, {"date": "19 Feb 2022", "title": "Media Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. I interviewed at Chamberlain University (Downers Grove, IL) in Jan 2021", "Interview Descriptions": "The HR employee communicated efficiently with scheduling and expectations. She was nice and easy to work with. The interviewing process started with HR. Then after she approved, I had an interview with the department manager. Unfortunately I didn’t get the position because there was a more qualified candidate for the specific position.", "Interview Questions": "Describe a difficult situation in the work place and how you overcame it. "}, {"date": "27 Jan 2021", "title": "Visiting Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Chamberlain University (Addison, IL) in Jan 2021", "Interview Descriptions": "The interview with the recruiter (Shequenna) and the leadership team was detailed and professional. \nI was contacted via e-mail, scheduled an interview with the recruiter, then had another interview with the leadership team.", "Interview Questions": "Why Chamberlain University and why  do you want to be a clinical professor?"}, {"date": "5 Mar 2021", "title": "Dean Academic Affairs Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Chamberlain University (Phoenix, AZ) in Jan 2021", "Interview Descriptions": "Scheduled and virtual interview with select members of the team. Completed the survey along with all interviews in a timely manner. The talent acquisition  consultant was timely in responses to questions and very helpful.", "Interview Questions": "How will you transition to a new team?"}, {"date": "18 Nov 2020", "title": "Student Learning Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Chamberlain University", "Interview Descriptions": "First interview was a phone interview with a talent acquisition representative who was very friendly and informative of the next steps in the interview process. Second interview was a virtual interview with the Dean and Assistant Dean of the nursing school. This interview also included a 10 minute presentation as if teaching students on a provided topic.", "Interview Questions": "Tell me about a time you dealt with someone questioning you or your leadership, and how you handled it"}, {"date": "13 Nov 2020", "title": "Visiting Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Chamberlain University (Canton, MI) in Nov 2020", "Interview Descriptions": "Overall a wonderful experience. Was screened properly and all questions asked were appropriate for position. The Mecca array time was spent answering all of my questions and making sure I understood the hiring process thoroughly.", "Interview Questions": "How would you handle a situation where a clinical student was not meeting expectations and the steps I would take to help steer them in the right direction. "}, {"date": "20 Nov 2020", "title": "Nurse Faculty Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Chamberlain University in Nov 2020", "Interview Descriptions": "The interviewer was friendly and helpful, allowed time for open discussion, and the interview was on time. The interviewer answered all of my questions thoroughly. The job expectations today and in the future (without COVID) we're explained. I was left feeling confident.", "Interview Questions": "Why do you want to be in education? "}, {"date": "10 Dec 2020", "title": "Student Support Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Chamberlain University in Nov 2020", "Interview Descriptions": "The interview process very thorough. I was contacted via email that I was selected for an interview and was able to select an option for time slot that worked with my current schedule. \r\n\r\nI was contacted by telephone asked questions about my background/job experience and provided detailed information about the position. I was then selected to move to the next step which was a virtual video chat interview.", "Interview Questions": "They asked about how would I handle stressful customer service experiences."}, {"date": "13 Nov 2020", "title": "Adjunct Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Chamberlain University (Columbus, OH) in Nov 2020", "Interview Descriptions": "The interview process was overall relaxed and engaging. I appreciate the feedback I received from the recruiter and the Dean. They were both approachable, knowledgeable and helpful. It was not nerve wracking. Thank you.", "Interview Questions": "What is a typical Clinical day consist of?"}], [{"date": "23 Nov 2020", "title": "Nurse Practitioner Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Chamberlain University (Troy, MI) in Nov 2020", "Interview Descriptions": "The interview process was very professional and everyone at Chamberlain University was informative, kind and caring. I was impressed with the whole process from Human Resources to the Assistant Dean", "Interview Questions": "How would you handle a student who is struggling and disengaged ?"}, {"date": "1 Dec 2020", "title": "Part Time Clinical Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Chamberlain University (Detroit, MI) in Nov 2020", "Interview Descriptions": "The interview process was fantastic! I was in constant communication with Shequenna throughout the process.  The actual interview was a pleasant professional conversation with no stressors.  I have enjoyed the process thus far.", "Interview Questions": "How would you deal with a student who is having difficulty grasping some fundamental concepts?"}, {"date": "29 Oct 2020", "title": "Adjunct Clinical Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Chamberlain University", "Interview Descriptions": "Everyone was extremely nice and helpful! From the start of the process everyone was very knowledgeable and well educated on any questions I had.  I am very excited to start my journey with such a professional team!", "Interview Questions": "How would you handle a resistant student\\?"}, {"date": "14 Oct 2020", "title": "Adjunct Nursing Faculty Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Chamberlain University", "Interview Descriptions": "Initial interview with HR, which is more informative in nature (discusses benefits, salary, general requirements). If chosen then you will interview with the Dean which involves a 15 min teaching presentation", "Interview Questions": "What is your teaching experience?"}, {"date": "1 Dec 2020", "title": "Clinical Coordination Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Chamberlain University (Las Vegas, NV) in Oct 2020", "Interview Descriptions": "The process was very professional and thorough. I went through 4 levels of interviews before being offered the position. As I advanced through the steps I was communicated with via HR expeditiously.", "Interview Questions": "What makes me the best candidate for the positions in which I was interviewing for...?"}, {"date": "27 Oct 2020", "title": "Clinical Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Chamberlain University (Warren, MI) in Oct 2020", "Interview Descriptions": "The talent recruiter Mr. Gray was prompt and thorough with the process. My interview with Chamberlain leadership team was great. I appreciate the smooth process.  All is well. Thank you.", "Interview Questions": "Why do I want to teach at Chamberlain?"}, {"date": "9 Oct 2020", "title": "Visiting Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Chamberlain University in Oct 2020", "Interview Descriptions": "The interview process was professional and smooth from start to finish.  Most importantly, all parties involved did an thorough job of describing details and expectations in a way that emphasized a welcoming culture focused on education as a collaborative effort between students, educators, and administrators.  The process was also conducted in a timely, prompt, and efficient manner.", "Interview Questions": "The question that stood out to me most involved first describing the overarching educational philosophy of the organization, then inquiring as to my thoughts and feelings."}, {"date": "29 Oct 2020", "title": "Clinical Instructor Position Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Chamberlain University (Houston, TX) in Oct 2020", "Interview Descriptions": "Ryan Leslie and Sybil Rollins were both phenomenal. Both very knowledgeable of the school and the interview process. Thank you for having wonderful staff. They explained the process and what I need to do to proceed with the job opportunity. They were very thorough.", "Interview Questions": "They gave me case scenarios on situations that may arise in the clinical setting and how I would intervene. "}, {"date": "22 Sept 2020", "title": "Part Time Clinical Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Chamberlain University", "Interview Descriptions": "The process was easy and efficient. Contacted several days after submitting the application via email then phone interview set up. The recruiter was helpful during the process. The interview with the Dean was done in a timely manner.", "Interview Questions": "general background and interest; description of the employer."}, {"date": "24 Sept 2020", "title": "Visiting Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at Chamberlain University (Indianapolis, IN) in Sept 2020", "Interview Descriptions": "Straightforward! Asked about background and experience. The process was easy and interview relaxed and personable. The recruiter was very professional and informative. I was contacted based off of a previous application. I was contacted via email and 2 separate phone interviews were completed; one with the recruiter and the second with the Dean of the hiring location/university.", "Interview Questions": "Tell me about your background and experience."}], [{"date": "23 Sept 2020", "title": "Visiting Assistant Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 months. I interviewed at Chamberlain University in Sept 2020", "Interview Descriptions": "Very prompt! Respectful of time. Immediately follow up and feedback. Everyone was very informative and knowledgeable. Friendly, and had great conversation that flowed well throughout the interview. Made me feel very comfortable and engaged.", "Interview Questions": "A little bit about myself and background"}, {"date": "15 Oct 2020", "title": "Nurse Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Chamberlain University (Tinley Park, IL) in Sept 2020", "Interview Descriptions": "The interview process was transparent without any confusions on expectations.  The technology was sufficient to complete the interview process. Deborah S. was quick to answer any questions or help with clarifications.", "Interview Questions": "How did I overcome any challenges with peers/management?"}, {"date": "16 Dec 2020", "title": "Admissions Advisor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Chamberlain University in Sept 2020", "Interview Descriptions": "The first stage was a a virtual interview where you recorded videos of your responses and submitted them via an online platform. Next was a phone screen with straightforward questions with an HR rep, and then a group interview with two current admissions advisor and the manager.", "Interview Questions": "The role play conversation they asked you was to model phone call with a prospective student. You didn't have a lot to go on so I thought it was pretty difficult. I definitely knew I didn't do well and that probably cost me the job."}, {"date": "9 Oct 2020", "title": "Director of Admissions Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. I interviewed at Chamberlain University (Saint Louis, MO) in Aug 2020", "Interview Descriptions": "The interview process was very organized, and professional. The process made me confident in knowing that I was applying to work at an organization that valued finding the right fit for the job.", "Interview Questions": "How do you plan to engage and motivate your team? "}, {"date": "2 Sept 2020", "title": "Admissions Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 4 weeks. I interviewed at Chamberlain University in Aug 2020", "Interview Descriptions": "The process was great especially during the pandemic. I applied, received email for a video screening, received call from a wonderful talent acquisition representative who was such a polite! She touched base with me often and guided me through the process. It was mostly behavioral questions to ensure you’re a good fit.", "Interview Questions": "Tell me about yourself?"}, {"date": "17 Sept 2020", "title": "Nursing specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Chamberlain University (Chicago, IL) in Aug 2020", "Interview Descriptions": "First step was a brief HR interview. Next was a virtual Teams interview with the associate and assistant dean which lasted around 1 hour. Next, a panel to introduce me to the other student learning team as well as the Dean and campus president. This part of the interview also included a 20 minute presentation on a nursing skill.", "Interview Questions": "How do you facilitate learning for students with different learning styles"}, {"date": "21 Aug 2020", "title": "Nursing Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Chamberlain University (Saint Louis, MO) in Aug 2020", "Interview Descriptions": "Easy and quick. Had the first interview with HR and then due to the pandemic had a video interview with both the assistant deans of nursing. Also suppose to interview with the dean however due to a mix up I didn’t have that interview", "Interview Questions": "They asked me typical interview questions, what my teaching philosophy was, and also they asked scenario questions "}, {"date": "22 Aug 2020", "title": "Clinical Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Chamberlain University (Houston, TX) in Aug 2020", "Interview Descriptions": "The interview process was very organized and professional. Once chosen for an interview you will complete a phone interview with the recruiter. The next step is a virtual interview with the Dean. Both individuals were very informative and answered all of my questions in detail.  You are able to schedule both of interviews online and choose the date and time that best accommodates your schedule.", "Interview Questions": "How would you deal with a student who is underperforming or not grasping a certain skill?"}, {"date": "11 Sept 2020", "title": "Nurse Student Learning Specialist Postion Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Chamberlain University (Tinley Park, IL) in Aug 2020", "Interview Descriptions": "I enjoyed interviewing with the staff of  Chamberlain University. I can tell the staff really pride themselves in making sure are students successful. The interviewers asked tough questions that are aimed to make sure the staff are equipped to provide quality education to their students.", "Interview Questions": "Why is the role of education important to me?"}, {"date": "21 Sept 2020", "title": "Student Support Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Chamberlain University (Chicago, IL) in Jul 2020", "Interview Descriptions": "First was a video interview with pre-recorded questions.  A few days later I heard back and had a  30 minute phone interview, and a final 3rd interview followed a couple days later, which was a video chat with 2 managers", "Interview Questions": "Tell me about a time when you had to make a decision all on your own?"}], [{"date": "25 Jul 2020", "title": "Admissions Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Chamberlain University (Joliet, IL) in Jul 2020", "Interview Descriptions": "There were two interviews one with HR and the second with the upper managers. All of them were awesome. They made the process super easy. The HR representative was super helpful and gave a lot of information. She gave me prep information on what to expect during the process. All around it was awesome.", "Interview Questions": "Explain an instance you had to work in a time crunch. "}, {"date": "20 Jun 2020", "title": "Visiting Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Chamberlain University (New Orleans, LA) in Jun 2020", "Interview Descriptions": "My interviewer was pleasant, professional, and gave me a realistic expectation of the process. COVID-19 interrupted the process. She kept in communication with me throughout the process. After I interviewed, she gave me a timeline for the selection process.", "Interview Questions": "To give information about my nursing journey and how it will help me in this position."}, {"date": "3 Jun 2020", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Chamberlain University in Jun 2020", "Interview Descriptions": "The Interview was set up in stages with an initial interview, then a second interview and finally a third to confirm hiring.  All throughout the process, Chamberlain's staff was professional, upfront, very candid and friendly.  A thoroughly pleasant experience.  What profoundly impressed me was that Chamberlain cares VERY deeply about its students and wants to insure that they will get their tuition's worth and that their students have a great experience.  This is a wonderful university with wonderful people in the organization.  I was made an offer and I accepted.", "Interview Questions": "Explain your teaching experience.  They care deeply about hiring experienced instructors.  I think they would hire someone you if you are not very experienced but you would have to demonstrate that you are passionate about your students and the material. "}, {"date": "8 May 2020", "title": "Student Support Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at Chamberlain University", "Interview Descriptions": "The interview process included 3 phases: 1) a screening call with the recruiter; 2) interview with the Manager of Student Services and the Assistant Director of Admissions;  3) interview with the Director of Campus Operations. The recruiter, Sheryl Smith, was extremely helpful and was key in securing my salary expectations. The interview process was overall an enjoyable experience.", "Interview Questions": "How does your experience translate into making you into the best candidate for this role? "}, {"date": "14 May 2020", "title": "Clinical Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 1 week. I interviewed at Chamberlain University (Washington, MI) in May 2020", "Interview Descriptions": "Spoke with the talent specialist, then to the Dean of the University. Process was quick and easy. Both people I had spoken with for this position were knowledgable and spoke highly of the university. Gave insight on the job, compensation and training process.", "Interview Questions": "What was a goal that you had to achieve "}, {"date": "13 Apr 2020", "title": "Visiting Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Chamberlain University (Chicago, IL) in Apr 2020", "Interview Descriptions": "Hiring process, requirement for Visiting professor, Student: Professor ratio,  Hospitals, 8 weeks clinical. Debriefing,  Simulation requirement,  Virtual Clinical, I Human Virtual simulation,  Rotation pick up options, Clinical rotation of Medical Surgical, Fundamental and Capstone", "Interview Questions": "Why Did I choose Chamberlain University?"}, {"date": "6 Apr 2020", "title": "Visiting Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Chamberlain University in Mar 2020", "Interview Descriptions": "The talent acquisition specialist was very responsive to emails and easy to work with. The DNP interview team made the interview feel more like a conversation. They clearly work well together! It was also evident that they enjoy working for Chamberlain!", "Interview Questions": "Tell us about a time you demonstrated care for a student."}, {"date": "4 May 2020", "title": "Business Development Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Chamberlain University (Jackson, MS) in Mar 2020", "Interview Descriptions": "The process began with an initial phone screening with a recruiter. Afterwards, it was followed by (3) separate Webex interviews with upper management; (2) Business Development Manager and the VP of Partnerships.", "Interview Questions": "Can you tell me a little about yourself?"}, {"date": "27 Mar 2020", "title": "Visiting Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Chamberlain University (Jackson, TN) in Mar 2020", "Interview Descriptions": "The process beginning with interview through hiring was seamless.  It was very organized, timely, consistent.  I knew what to expect throughout the process. I had excellent support from all involved.", "Interview Questions": "They asked how I would engage students in the online platform."}], [{"date": "2 Apr 2020", "title": "Visiting Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Chamberlain University (Virginia Beach, VA) in Mar 2020", "Interview Descriptions": "I was contacted by email by Scott Schonning, and then by telephone. He was very thorough and gave excellent explanations about the process. He also helped with the interview process with the dean. His work was quite thorough and I had no surprises.", "Interview Questions": "I was asked about how I made online education engaging for students. "}, {"date": "22 Aug 2020", "title": "Visiting Assistant Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Chamberlain University (San Antonio, TX) in Mar 2020", "Interview Descriptions": "Initial interview with a talent acquisition employee. Reviewed job and pay info. After if both parties agree to a second interview it is set up. Second interview is more specific to the job and with a dean.", "Interview Questions": "Classic question of “tell me how your experience relates to the position you are applying for?”"}, {"date": "27 Mar 2020", "title": "Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Chamberlain University (Bloomfield Hills, MI) in Mar 2020", "Interview Descriptions": "The interview process started with a call from Human Resources.  Ms. Gray was professional and personable.  This lead to a video interview with the dean of the university, Dr. Bradbury.  We discussed my teaching style and I gave a ten minute lesson. Lastly, an offer phone call from Ms. Gray with an offer and instructions to the hiring process.", "Interview Questions": "She asked me about my education."}, {"date": "28 Feb 2020", "title": "Visiting Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Chamberlain University", "Interview Descriptions": "The interview experience was wonderful! You can sense the pride the staff and faculty have in their organization.  Scott in HR prepared me for next steps and kept me in the loop the entire time. Speaking with the Dean of the program sealed the deal, as she was just as enthusiastic about her work and supportive of her faculty as a professor could hope to work for. I’m excited to begin my new journey with Chamberlain!", "Interview Questions": "How would you describe my previous experience in terms of being relevant for the course they were offering?"}, {"date": "21 Feb 2020", "title": "Admissions Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Chamberlain University (Downers Grove, IL) in Feb 2020", "Interview Descriptions": "Overall the interview process was extremely timely and thorough. They made certain that the position was a great fit for both parties. The final decision making process itself was quick, something most companies drag out.", "Interview Questions": "Why do you feel you would be a good candidate for this position? "}, {"date": "25 Feb 2020", "title": "Visiting Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Chamberlain University in Feb 2020", "Interview Descriptions": "1) Phone call with HR that included a thorough outline of the position and questions connected to my experience as it pertained to the position\r\n2) Second phone interview with the Dean of the department that I will be working under that included more typical interview questions.", "Interview Questions": "Questions were formatted in such a way that I was to provide an example of a situation rather than what I might do in that situation: \"Tell me about a time when you . . .\""}, {"date": "24 Feb 2020", "title": "Visiting Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Chamberlain University (New Orleans, LA) in Feb 2020", "Interview Descriptions": "Very pleasant. This company was transparent about the job duties, expectations and pay. I was asked to share my experience with teaching, engaging learners online and students who experience educational barriers. The interviewers asked me to provide specific scenarios in my response. I also was able to ask all my questions regarding the company and job expectations", "Interview Questions": "They asked me about my experience with working students with barriers."}, {"date": "16 Mar 2020", "title": "Visiting Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Chamberlain University in Feb 2020", "Interview Descriptions": "The interview process was seamless. I was given a call from Human Resources for a phone interview that consisted of questions regarding my background and my experience with online education. I received another call for a second interview with the hiring manager that asked more specific questions regarding the area in which I would teach. I must say that every question I asked was answered in a timely fashion. I never had to wait long to hear back with a response.", "Interview Questions": "From your teaching experience, what can you bring to University Studies and assist in out retaining our students?"}, {"date": "28 Jan 2020", "title": "Student Support Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Chamberlain University", "Interview Descriptions": "initially phone call screening that lasted 20-30 minutes. After that came a in person one on one interview with a manager. A week later I had an interview with a supervisor, also one on one.  Wasn't the easiest interview but also wasn't that hard either. Felt average.", "Interview Questions": "How would you handle an upset student over the phone? what are your strengths and weaknesses "}, {"date": "30 Jan 2020", "title": "Full Time Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Chamberlain University (Chicago, IL) in Jan 2020", "Interview Descriptions": "Very organized and met with multiple staff . Very warm and inviting and answered all of my questions . I felt comfortable in the process and wouldn’t recommend. Working here", "Interview Questions": "Why do you want to work here "}], [{"date": "20 Feb 2020", "title": "Visiting Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Chamberlain University (Raleigh, NC) in Jan 2020", "Interview Descriptions": "The interview process was great, and went fairly fast. Scott was my recruiter and he was awesome and very knowledgeable. One of the best interview processes I have done! My first interview was a phone interview with Scott. The second part of the interview I spoke with the Dean of Faculty. She shared a lot about the position and then asked me to share my background and experience. She was really nice, personable and made me feel like this was a place that I would want to work. They care about their students and really want them to be successful. I am a passionate educator and it’s nice to work for a school that is passionate about their students and their success.", "Interview Questions": "What has you interested in this position and why do you think you would be a great fit?"}, {"date": "19 Feb 2020", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Chamberlain University (Chicago, IL) in Jan 2020", "Interview Descriptions": "The interview process was very professional and comfortable. I was able to pick a time that worked best for my schedule. When I was contacted by HR to schedule a phone screening, it was a very comfortable process. At the interview, I felt like I belonged at CCN, which gave me the sense that this was the right choice to proceed with the interview process.", "Interview Questions": "To talk about my career journey."}, {"date": "23 Jul 2019", "title": "Admissions Advisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 3 weeks. I interviewed at Chamberlain University (New York, NY)", "Interview Descriptions": "Received a 10 minute call asking about my background. I was told I could visit with the manager and see the campus. Later I was told that was my interview. I was asked for feedback after the interview by the recruiter. STAR method interview.", "Interview Questions": "Tell me of a time you went against policy to get a job done"}, {"date": "21 Oct 2022", "title": "Student Support Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Chamberlain University (Chicago, IL) in Jun 2019", "Interview Descriptions": "One interview with direct manager in person at the time. Fair questions were asked relayed to the job role. Asked personal questions as well to learn about home life. Offered position within 2 weeks.", "Interview Questions": "How do you do under pressure with multiple task at one time?"}, {"date": "20 Feb 2019", "title": "Faculty Associate Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Chamberlain University (Atlanta, GA)", "Interview Descriptions": "Long interview process. Telephone interview with recruiter, Face to face interview with  teaching demonstration, then 3rd interview.  Process took about 3month then received a generic email, which states they decided to with another candidate.", "Interview Questions": "Basic and geberal"}, {"date": "25 Aug 2022", "title": "Admissions Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Chamberlain University (Saint Louis, MO) in Feb 2019", "Interview Descriptions": "1 phone interview & 3 in person interviews in 2 visits, 1st visit with HR & Director of Admissions. Called back with an offer to return... 2nd visit was with Campus President.", "Interview Questions": "Tell about a time when you handled a difficult situation with leadership & what was the result. "}, {"date": "17 Apr 2019", "title": "Faculty Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Chamberlain University in Feb 2019", "Interview Descriptions": "Applied online and was contacted via email to interview.  Was supposed to have an interview with a panel, but only one person was present for the interview.  Did not seem to have it together or had already selected someone else and wasted my time.", "Interview Questions": "Make sure to discuss SLO's. "}, {"date": "10 Jan 2019", "title": "Director of Student Services Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Chamberlain University (North Brunswick, NJ) in Dec 2018", "Interview Descriptions": "I applied for a different position and they reached out to me to let me know that they were going to hire internally for the other position but they had this position that they thought I was qualified for. It was something I was interested in so I decided to pursue it. Had a phone interview with the HR recruiter. The next step was an assessment test that took approximately 45 minutes. The first part was behavioral work at the questions were you had a rank yourself and the second part was logic which was extremely difficult and I’m still trying to figure out why it was needed for the assessment. They told me I would’ve heard back after the assessment for an in person interview which I never received.", "Interview Questions": " How do you motivate your staff? "}, {"date": "5 Nov 2018", "title": "Business Fevelopment Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Chamberlain University (Chicago, IL) in Oct 2018", "Interview Descriptions": "Long. 1 screening interview by talent management and then 3  interviews with hiring manager and colleagues. They were quick to set up subsequent interviews - which was great, but after the third interview (which i thought seemed excessive) it was radio silence. After an email to the talent manager, I found out the hiring manager had been moved and someone new was in that role. I was NOT given an opportunity to interview with that person, even after investing time in THREE interviews with other team members. I was disappointed, but not surprised when i received the form rejection letter. It was a bit of a bummer to have not, at least, gotten a call after that long interview process.", "Interview Questions": "How do you handle being told no? "}, {"date": "2 Jun 2018", "title": "Student Advisor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Chamberlain University", "Interview Descriptions": "Phone interview then in person. Both consisted of mostly behavioral questions and explaining the position along with a tour. They spend a lot of time with you to make sure you fit well. Overall it was a pretty relaxed process but you definitely need to come prepared", "Interview Questions": "A lot of situational questions so \"Describe a time when you had a manager you disagreed with\" etc... Also just checking on your understanding of the college and what their values are.  They spent a lot of time describing the position and college... they really want to make sure you are a good fit for them and they are a  good fit for you"}], [{"date": "26 Mar 2021", "title": "Visiting Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Chamberlain University (Troy, MI) in Jun 2018", "Interview Descriptions": "Met with campus president, reviewed past experience and expectations while teaching clinicals.  We also toured the facility and reviewed examples of rotation placement and how the sign up process works.", "Interview Questions": "Interview was focused on learning about their programs and how the visiting professor (clinical instructor) role fits in to the program. "}, {"date": "19 May 2018", "title": "Student Support Advisor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Chamberlain University (Atlanta, GA) in May 2018", "Interview Descriptions": "It was quite refreshing, I had an interview over the phone and another one in person with two Supervisors. They were really nice and was very encouraging considering I was a new college graduate. They seemed to be very interested in my personality and experieces.", "Interview Questions": "What are 3 weaknesses/strengths about yourself that you want to improve?"}, {"date": "23 Oct 2017", "title": "Online Nurse Educator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Chamberlain University in Oct 2017", "Interview Descriptions": "I had a phone interview with 3 Online Nursing Faculty at Chamberlain College of Nursing-Online Program for an Informatics course. The faculty were extremely nice and understanding as I haven't interviewed for a new job in over 20 years. I got feedback the following day that they had to go with another applicant that had more knowledge on informatics. One of the interviewers and the Dean provided me with additional resources to review prior to reaching out for another position. So much appreciated. I will not be as nervous with my next interview.", "Interview Questions": "Can you provide us with experiences you have had with informatics?"}, {"date": "10 Nov 2017", "title": "RN MSN/Executive Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Chamberlain University (Atlanta, GA) in Aug 2017", "Interview Descriptions": "The interview process was well organized and fully calls made the process easy.  The Dean Dr Love was very approachable and well informed regarding company's Polices.  The only problem I had was not being able to bargain for a more rewarding salary.", "Interview Questions": "Why do you want to work for Chamberlain University"}, {"date": "25 May 2017", "title": "Adjunct Faculty Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Chamberlain University", "Interview Descriptions": "After filing out the application, a few days later a recruiter called back and basically told me I was not eligible for an online faculty position because I did not have a doctorate degree", "Interview Questions": "have you taught in a traditional college before"}, {"date": "20 Nov 2017", "title": "Program Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Chamberlain University (Downers Grove, IL) in Apr 2017", "Interview Descriptions": "Interview was a breeze and lasted no more than an hour. HR sent me not 1 decline letter but 2 - as if the first one was not bad enough.", "Interview Questions": "Background and information on past bosses."}, {"date": "9 Jul 2017", "title": "Visiting Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Chamberlain University (Charlotte, NC) in Apr 2017", "Interview Descriptions": "The first call received was from the actual recruiter who talks to you about pursuing a job at Chamberlain.  She sends you some pre-questions to answer.  If they like your answers, then you get a follow-up phone call.  They ask to forward your information to the team and give you some times and dates for a team conference call.  After your conference call, the recruiter lets you know if they are interested in offering a position.", "Interview Questions": "What do you feel qualifies you to teach this subject?  "}, {"date": "15 Mar 2017", "title": "Assistant Dean Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Chamberlain University (Saint Louis, MO) in Mar 2017", "Interview Descriptions": "The talent acquisition recruiter initially contacted me for a phone interview. It lasted approximately 15 minutes. The following topics were discussed: my professional background, what led me to apply for this position with Chamberlain college of nursing and their philosophy and history in nursing education.", "Interview Questions": "Describe my professional background."}, {"date": "19 Jan 2021", "title": "Visiting Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Chamberlain University (Phoenix, AZ) in Jan 2017", "Interview Descriptions": "Short and to the point. The interview was straigtforward since my resume such as education and expereince was good. Mainly about my teaching style and schedule flexibility. Associate Dean, who  was hiring manager, was personable.", "Interview Questions": "Experience and education. Availability, flexibility"}, {"date": "15 Oct 2019", "title": "Admissions Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at Chamberlain University (Addison, IL) in Sept 2016", "Interview Descriptions": "Two part interview; phone and in person. Role play involved in the in person interview part. Phone call was a screen for the position; this is when you spoke to the recruiter about the role. Be prepared to talk a lot about your ability to communicate well with others.", "Interview Questions": "What are your goals \r\nWho to manage a difficult person \r\nRole play a sales conversation "}], [{"date": "5 Jul 2016", "title": "Nursing Faculty Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3+ months. I interviewed at Chamberlain University (Addison, IL) in Jun 2016", "Interview Descriptions": "The interview process is awful!! I have never experienced anything like it. Every person you talk to tells you how there are hundreds of applicants, blah, blah, blah. It is very unprofessional. Then, you interview with people who have less credentials than you.", "Interview Questions": "Why Chamberlain?"}, {"date": "26 Feb 2018", "title": "FWS Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 3 weeks. I interviewed at Chamberlain University (Phoenix, AZ) in May 2016", "Interview Descriptions": "You sit down and you talk with them, tell them about what part of the program you are in. Tell them your experience with in that position you are apply for in FWS.", "Interview Questions": "Do you have another job outside of this job you are applying for. "}, {"date": "15 Mar 2016", "title": "Advisor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Chamberlain University", "Interview Descriptions": "I was called for an interview and they spoke with me over the phone about my experience pertaining to the position and ways that I can contribute to the organization.", "Interview Questions": "How do you handle difficult issues?"}, {"date": "2 Apr 2016", "title": "Student Service Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Chamberlain University (Irving, TX) in Mar 2016", "Interview Descriptions": "A few days after applying for the job I was contacted via email by a recruiter for a phone interview. A few days later the phone interview was conducted, then I moved on to the next step which was an online assessment that took about an hour. It was slightly difficult just because the first part was timed, but not too bad. Once I finished that, I was invited to do a face to face interview with the manager first then another interview with the campus president. Then I was sent some paperwork to fill out for a background check and reference check. They conducted the reference checks and then presented me a job offer. In all it took about 2 weeks. Very quick process.", "Interview Questions": "What is your best method for having to learn a lot of new things at one time?"}, {"date": "7 May 2017", "title": "Admissions Advisor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Chamberlain University (Troy, MI) in Jan 2016", "Interview Descriptions": "I dealt with a recruiter first and then was sent an online exam that needed to be completed within 24 hours. I was then contacted and interviewed by the dean of campus operations", "Interview Questions": "Provide an example of how you have overcome a challenging situation in a past job"}, {"date": "3 Dec 2015", "title": "Career Services Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Chamberlain University (Remote, OR)", "Interview Descriptions": "Phone interviews with various levels of leadership and student support managers. Very concise interviews. Recruiter scheduled me quickly from one level to the next. All staff ertr very professional. Emphasized the CARE in their culture which would be great for a new candidate to mention. They were able to provide feedback (brief but helpful) as to why I was not chosen for the  role.  Recruiter shared really good details before I was hired regarding who I would be interviewing with as well.", "Interview Questions": "How would I handle supporting our students virtually? How do you build rapport? How familiar was I supporting nursing path careers? How would I prepare students for the real world."}, {"date": "4 Sept 2015", "title": "Admissions Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Chamberlain University", "Interview Descriptions": "There was a brief initial phone screening, and then a formal 1 hour phone interview with the recruiter. Afterwards I had an on-campus interview with the director of admissions. This was followed by a final visit to campus where I met with the manager of student services and the campus president.", "Interview Questions": "What are your short and long-term career goals."}, {"date": "29 Aug 2015", "title": "Student Services Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Chamberlain University (Chicago, IL)", "Interview Descriptions": "It happened rather quickly. I applied for the position and about two weeks later I received a phone call. There was a brief phone interview and then that was followed by two online assessments and a typing test. After completing those, there was an over the phone mock call where you pretended to speak to a student. Once you pass that part, you then go to the face-to-face interview with about 2-3 people.", "Interview Questions": "Basic behavioral questions."}, {"date": "5 Apr 2015", "title": "Admissions Advisor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "The process took 2 weeks. I interviewed at Chamberlain University", "Interview Descriptions": "Applied online, got contacted to do 2 assessments.  From there I had a phone interview and then was brought in for an in person interview with 3 people, including the Dean of Admissions.  Phone interview was quite simple, but the in person interview was a bit difficult.", "Interview Questions": "Roleplaying seemed to be key to the in person interview about how you would get a potential student to agree to fill out an application."}, {"date": "8 Sept 2016", "title": "Addmissions Representative Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at Chamberlain University in Feb 2015", "Interview Descriptions": "The interview was a pretty lengthy process. Started with a phone interview and continued to a second phone interview. I then moved forward to an interview with 2 managers who seemed to play good cop, bad cop. They asked questions about my experience, why I want the job, etc.", "Interview Questions": "They were very critical of my experience. For example, \"why do you want to work with graduates students when the only experience you have is with children?\""}], [{"date": "4 Nov 2015", "title": "Admissions Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 4 weeks. I interviewed at Chamberlain University (Chicago, IL) in Sept 2014", "Interview Descriptions": "The interview is a little lengthy . It takes about 1 month for them to get back to you. You will also meet with numerous people. First you will have a screening with and HR rep, then you will meet with the hiring manager and the other Associate Directors in the region . Finally you will meet with the Director of Admissions.", "Interview Questions": "Give us some strengths and opportunities."}, {"date": "20 Nov 2015", "title": "Student Service Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Chamberlain University in Jun 2014", "Interview Descriptions": "The whole process from application to hire took almost 3 mo.  First contact HR representive interview questions were, tellme about a time..., Then had to take a competency test.  In two weeks I was contacted and had on campus interview with President and Dean.  Questions about what can you bring to the position, skills, etc.   Then 2 weeks later had phone interview with a manager and then was set up for another phone interview with the Director.", "Interview Questions": "Tell me about a time when....?  How would you handle a difficult student."}, {"date": "6 Apr 2014", "title": "Admissions Representative Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at Chamberlain University (Miramar, FL)", "Interview Descriptions": "One interview with the campus director and second interview with a manager from the national team over the phone. I was a referral from someone that worked there and they still had no consideration in giving me any notice of ending my position.", "Interview Questions": "Very informal interview process. Felt more conversational"}, {"date": "11 Mar 2014", "title": "Admissions Advisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Chamberlain University", "Interview Descriptions": "--Applied online. \r\n--Received an email about setting up a phone interview. \r\n--Phone interview took about 30 +/- minutes.\r\n\r\nIT'S SCRIPTED. My interview sounded like he was reading. I've had dozens of phone interviews over my life and I've never come across a scripted interview. They also kept trying to sale me on why Chamberlain was such a good school and the job was so great. Hey, interview person, I'm applying for your open position because I want the JOB. Stop trying to sale me on it.\r\n\r\nThe interview didn't go bad, but he couldn't answer some basic questions about weekends, needing religious day off, travel, etc. I guess it wasn't in the script as that's the only time they mumbled or used \"uh\"/\"um\".\r\n\r\nThey also wanted me to take a skills test. I find that ridiculous for the position and the company.", "Interview Questions": "The questions were basic interview questions that a company would ask. Name a situation . . . tell me about a time . . . describe a moment . . . etc. "}, {"date": "15 Jul 2015", "title": "Admissions Advisor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Chamberlain University (Columbus, OH) in Mar 2014", "Interview Descriptions": "Worked with recruiter who completed initial interview. Also completed math and personality tests. Interviewed with director of admissions, student services manager, campus president, and finally the regional director of admissions. 2 interviews were on phone.", "Interview Questions": "Tell me about a time that you went above and beyond to help a customer."}, {"date": "15 Nov 2013", "title": "Admissions Advisor Interview", "results": "No Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I interviewed at Chamberlain University", "Interview Descriptions": "The first round phone interview was very straightforward. They asked basic behavioral questions like strengths and weaknesses and why you want to work for the company and why you would be good for the job. The second round was much longer, about 60 minutes. Two people also asked behavioral questions, however they were much more specific and wanted more specific examples.", "Interview Questions": "The most unexpected question was a role play scenario where the interviewer pretended to be a student interested in the school and you had to convince them to enroll. It just caught me completely off guard."}, {"date": "5 Oct 2013", "title": "Nursing Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Chamberlain University", "Interview Descriptions": "Hiring Process and interview was very quick.  Applied online got a response within a week.  Had 1st and second round of interview.  It was a very smooth process getting into the company.", "Interview Questions": "Have you ever had to implement a positive change in your last position? Give example and the outcome."}, {"date": "29 Feb 2016", "title": "Senior Career Services Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Chamberlain University (Addison, IL) in Oct 2013", "Interview Descriptions": "I had a phone interview with Talent Acquisition, very basic. In-person interview with Campus Student Services Manager, a bit more in depth, talked culture and philosophy. Had in-person interview with Campus President, lots of conversation about long-term plans for campus/position. Lastly, had interview with Regional Manager, very dry and typical interview questions.", "Interview Questions": "How will your background help you adjust to this new role, should you be offered the position?"}, {"date": "5 Feb 2014", "title": "Admissions Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Chamberlain University (Addison, IL) in Jan 2013", "Interview Descriptions": "I received a phone screening one month after applying online. The phone screening was great. There was just a few questions asking about my previous experience in customer service and we also went over my resume. After the phone screening I was offered a in person interview, which I accepted. The in person interview was different than any interview I have ever had. It was comfortable but also intense! Questions ranging from my own personal life to my professional life.", "Interview Questions": "The most difficult question that came up was not a question at all. It was role playing! "}, {"date": "20 Dec 2012", "title": "High School Recruiter Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Chamberlain University (Atlanta, GA) in Aug 2012", "Interview Descriptions": "I went through three interviews. The first was with the national guy out of Florida. I was applying for a position in Atlanta. It took about 3 weeks and I got a call for the local interview. Interviewed with the hiring manager locally at the new Atlanta location in Dunwoody. Then I was referred to the national recruiting manager to meet with him. I was able to do an interview in person as he was in the office and not traveling or out of town at that time. Each interview was about an hour. \r\n\r\nUnfortunately, DeVry is known for not calling people back or informing them of their decision. At the time, I was told I was the only one interviewing for the position. However, when it came time for a decision, I was given no word...\r\n\r\nI ended up withdrawing my name from candidacy as I felt I wasn't going to be offered the job anyway. I followed up with both the local and national recruiting managers with one phone call and then one email each. After a month of no contact, I sent a well-wishes email and that was that.", "Interview Questions": "Standard questions. Nothing too difficult. "}], [{"date": "14 Jul 2016", "title": "Associate Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Chamberlain University (Dayton, OH) in Aug 2012", "Interview Descriptions": "It was conducted by telephone and seem very complete.  There was also verification of licenses and drug screening that had to be performed.  The interview process was fairly smooth and the person who conducted the interview was pleasant and know threatening.", "Interview Questions": "Why I liked teaching"}, {"date": "2 Dec 2014", "title": "Admissions Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Chamberlain University in Jun 2012", "Interview Descriptions": "Included a phone screening.  Before meeting on location I was sent personality tests and IQ tests.  Then I met with the Director and the team the same day.  Afterwards I was required to do a drug screening, at their expense.  I got a call the same day and was offered the job.  I believe they had a high need for the position and my experience and personality happened to meet their needs exactly.", "Interview Questions": "N/A"}, {"date": "22 Sept 2016", "title": "Full Time Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Chamberlain University (Chicago, IL) in Feb 2012", "Interview Descriptions": "First round interview with HR and then move on to campus interview with leadership on the campus. Then I had to do a demo in front of the faculty and be interviewed by the members of the faculty. I had a bit of a lag time between my first and second interview. Everyone was nice and professional.", "Interview Questions": "Asked about conflicts and how did I deal with them."}, {"date": "16 Feb 2013", "title": "Admissions Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Chamberlain University (Addison, IL) in May 2011", "Interview Descriptions": "Received a call from Human Resources, had a brief interviewed over the phone with recruiter. Really informational about the position. A couple of days later received invite for interview with both Assistant director of admissions and the director of admissions. Interview was very standard. Not too many difficult questions. Helps if you read about the requirements of the position, and have experience on over the phone sales.", "Interview Questions": "Do you hate losing, or do you love winning?"}, {"date": "5 Feb 2013", "title": "Enrollment Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 2 months. I interviewed at Chamberlain University (Chicago, IL) in May 2009", "Interview Descriptions": "Interview process may include a phone interview with a member of the HR staff. Next, a 1 on 1 interview with a Team Lead and the Dept Manager.  They will ask you to \"Tell us a time when...\" type of questions.  You do need to complete a personality test.", "Interview Questions": "\"Tell us a time when...\" type of questions. "}]]