[[{"date": "30 Jun 2020", "title": "Operations Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Making Waves Foundation", "Interview Descriptions": "30min phone interview with \"Ms. Fries\". I did not get great vibes after she spent 10 minutes on how SHE single-handedly created the program and took credit for all its outcomes. I know racial capitalism well in the non-profit world and this is a leader cashing in big on it.", "Interview Questions": "Tell me about a manager you worked well with? A manager you did not work well with?"}, {"date": "15 Feb 2023", "title": "Junior Accountant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Making Waves Foundation (Richmond, CA) in Jan 2019", "Interview Descriptions": "Very straightforward and asked about personal development. Not a lot of technical accounting questions. Had an interview with everyone on the team as well as the CEO. They asked a lot of questions about your 5 year plan and what you want to achieve from the job.", "Interview Questions": "Where do you see yourself in 5 tears"}, {"date": "31 May 2015", "title": "Sales Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Making Waves Foundation (Bountiful, UT) in May 2015", "Interview Descriptions": "I was contacted by email to come in for an interview. Upon arrival, I spoke to assistant manager to get to know the company better and for the manager to know more about me. I was informed that there was a three part hiring process and a two week training program aimed at progression into a management position.", "Interview Questions": "What is your greatest strength? What is your greatest weakness? What makes you a good candidate?"}, {"date": "3 Aug 2015", "title": "Annual Giving Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Making Waves Foundation (Richmond, CA) in May 2015", "Interview Descriptions": "Phone interview...terrible connection..had to ask many times to repeat questions.  Played a weird Jeopardy type game which through me completely off guard not to mention how many times I said can you repeat that.  Said he would get back to me in a week and never heard a word.", "Interview Questions": "What is a charter school?"}], [], [], []]