[[{"date": "15 May 2023", "title": "Academic Advisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at City Colleges of Chicago in Apr 2023", "Interview Descriptions": "Interviewed by 6 different people Including a representative from HR. The HR rep is the nicest on the interview committee. The interview was not to get to know the person more so their skills and abilities. Not to see if their personality would fit the work culture.", "Interview Questions": "A question such as: if you had a student who was not interested in picking a major how would you help them. A follow up to that was, all of what you suggested the student declined what would be your next step?"}, {"date": "21 Mar 2023", "title": "Adjunct Instructor Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at City Colleges of Chicago in Feb 2023", "Interview Descriptions": "Four people took turns asking prepared questions in a Zoom interview. They were very nice, and it was an informative interview. I learned a lot about the program, which is growing rapidly, and serves a real need in the community.", "Interview Questions": "Where do you see yourself in 5 years? Why do you want to work here? Give an example of how you overcame a problem?"}, {"date": "14 Oct 2022", "title": "Clerical Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at City Colleges of Chicago (Chicago, IL) in Sept 2022", "Interview Descriptions": "Panel interview -not hard, have to do your research for job position. I just went in and answered questions has by best as I could. Just be yourself and honest, don't over do it.", "Interview Questions": "Why do you feel you are qualified for the position and what related experience do you have?"}, {"date": "19 Jul 2022", "title": "Assistant Registrar Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "The process took 6 weeks. I interviewed at City Colleges of Chicago (Chicago, IL)", "Interview Descriptions": "The interview process was unnecessarily tedious. I initially interviewed with the hiring manager, then went on to a 6-person panel interview. One of the questions asked was, “if you could have dinner with any person, living or dead, who would you choose and why?” \n\nAfter making it through this round of interviews, I went on to another round. After completing my third round, I was completely ghosted. It was an awful, disorganized, and protracted process.", "Interview Questions": "If you could have dinner with any person, living or dead, who would you choose and why?"}, {"date": "18 May 2022", "title": "Director of Community Education Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at City Colleges of Chicago", "Interview Descriptions": "Quick, easy interview process. All of my interviews (there were four of them) were completed within about a week and a half. Unfortunately, the job just wasn't the right fit for me.", "Interview Questions": "N/A"}, {"date": "5 Mar 2021", "title": "Assistant Registrar Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at City Colleges of Chicago", "Interview Descriptions": "The interview process was long and arduous. After three interviews, including a panel interview with ridiculously obtuse questions, I was completely ghosted by the organization. I interviewed specifically at Malcolm X college in 2018.", "Interview Questions": "If you could have dinner with anyone in history, living or dead, who would it be and why? "}, {"date": "1 Mar 2021", "title": "Associate Dean of Instruction Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at City Colleges of Chicago", "Interview Descriptions": "Nice people, friendly, except one person asked an inappropriate question that was difficult for me to answer. Rest of interview went downhill after that and I could tell the writing was in the wall.", "Interview Questions": "Why my employment was so short at one of my previous institutions. It was a no-win answer, and didn’t have anything to do with my qualifications for the role."}, {"date": "12 Jan 2021", "title": "Project Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at City Colleges of Chicago", "Interview Descriptions": "One call and two In person interviews with team and CCC President all over the course of two weeks. There were a number of others at the first in-person meeting who had nothing to do with the job i was applying for", "Interview Questions": "Everything was behavioral, tell us about a time when... "}, {"date": "24 Sept 2020", "title": "HR Representative Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at City Colleges of Chicago", "Interview Descriptions": "It was a very enjoyable interview process.  The woman that I communicated with was always on top of her stuff and even called to let me know that I did not receive the role.", "Interview Questions": "How can you improve the culture?"}, {"date": "9 Aug 2019", "title": "Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at City Colleges of Chicago (Chicago, IL) in Jan 2019", "Interview Descriptions": "it was very rigourous and i had to go to multiple interviews and it took at least 6 months and 4 interviews backgorund checks and constant notifications saying the job will be ready someday", "Interview Questions": "what is your favorite cheese"}], [{"date": "28 Jul 2018", "title": "College Clerical Assistant II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at City Colleges of Chicago (Chicago, IL) in Jul 2018", "Interview Descriptions": "Applied on a Wednesday, got a call on Friday to schedule interview for following Monday.  There was a 4 panel interview with HR Director,  Dean and 2 instructors.  Same night (Monday) got a call from HR Director to interview with President the next day ( Tuesday).  Was offered the position by President on the spot.  Spoke with HR Director next day and was sent background and drug test info. Upon board approval, I will then get my start date.    Overall it was extremely fast, and the interview was easy.  Asked about previous jobs, skills, etc", "Interview Questions": "Name something I did when going above and beyond at a previous employer? \r\n\r\nWhat skills do I think are necessary to succeed in this particular role? \r\n\r\nName a time when I had to multi task multiple assignments at once? \r\n\r\nWhat are things that I do to help me prepare for a hectic day? "}, {"date": "1 Jun 2018", "title": "Career Advisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at City Colleges of Chicago", "Interview Descriptions": "There were no \"frequently asked interview questions.\" So no \"tell me about yourself,\" \"what's a strength or a weakness,\" etc.  They asked questions about experience I did not have. It seemed as though they just printed generic questions, and asked without looking at my resume. As a career center for students, you'd think the interviewers would have been great and prepared!", "Interview Questions": "Tell us a time you worked with an employer and how you connected them back to your organization?\r\nWhat would you do if a students resume was not approved by the schools site?"}, {"date": "1 Dec 2018", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at City Colleges of Chicago (Chicago, IL) in Mar 2018", "Interview Descriptions": "They were all over the place .. They were slow and the person interviewing me did not know what he was doing .. Long background check .. There was a panel of people and then you wait even longer and longer ... no process in place", "Interview Questions": "Asked about teaching style "}, {"date": "15 Feb 2018", "title": "Assistant Registrar Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 3 weeks. I interviewed at City Colleges of Chicago (Chicago, IL) in Feb 2018", "Interview Descriptions": "I submitted an application and heard back 12 days later (a rather quick turnaround from what I’m told.) I was called on a Monday to schedule an interview that same Thursday. The interview was brief—only about 30 minutes. During the interview I was told I would hear back by early the following week, but didn’t actually hear anything until the following week.", "Interview Questions": "The questions were very routine “why do you want to work here” questions. There was one intentional curveball question"}, {"date": "6 Apr 2018", "title": "Director Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at City Colleges of Chicago (Chicago, IL) in Jan 2018", "Interview Descriptions": "Chaotic, disruptive, and overall poor communication.  Began with short screening phone interview , followed up with five in -person interviews.  No follow up or response for 5 weeks...then need for additional in-person interview immediately!  No response for 10 days.  Next call from hiring manager with request for another in-person interview.  No response for 5 days...followed by job offer.  \r\nLack of clarity on role and responsibilities, goals and specific expectations.  Lack of information on relationships with other departments and how communication across district could be facilitated.", "Interview Questions": "What is your management style?"}, {"date": "10 Apr 2020", "title": "Student Worker Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at City Colleges of Chicago (Chicago, IL) in Jan 2018", "Interview Descriptions": "I had to do an exam which was a little confusing and you couldn't ask any questions. I answered as best as I could. It took about 30 min. They never told me how I did, jut that they found someone already.", "Interview Questions": "Why do you think we should hire you?"}, {"date": "30 Mar 2020", "title": "Teacher Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at City Colleges of Chicago (Chicago, IL) in Nov 2017", "Interview Descriptions": "The process was rather straight forward. Apply online and wait while your materials are reviewed. Once the pool of candidates is selected you are offered an interview. During the interview you are asked about your knowledge about printmaking .", "Interview Questions": "Are you familiar with stone lithography."}, {"date": "21 Oct 2017", "title": "College Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at City Colleges of Chicago", "Interview Descriptions": "Unless you work at one of the colleges or have a connection, it's hard to even get an interview. It was a simple interview process. The first interview is with a panel of staff and HR and the questions are typical for an advising student services type position. Once you pass that, you meet with the president or designee leadership. Both interviews are about one hour long. The biggest challenge is the interview to hiring could take up to two months. If you get selected, you have to be approved by the Board of Trustee which only meets once a month. Overall, it was an average interview process that has lots of bureaucratic hoops to jump through.", "Interview Questions": "Why do you want to be a College Advisor?"}, {"date": "24 Oct 2017", "title": "Adjunct Lecturer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at City Colleges of Chicago (Chicago, IL) in Aug 2017", "Interview Descriptions": "First you have an interview with the department chair. You will probably go back and forth between emails until you have to meet. At the in person interview it is not as bad (depends on dept chair). They may ask your prior experience, what can you bring the to college, and what are your expectations. Next you will hear back if you passed this interview. If you did you will have to meet with the Dean of instruction for an interview (not every college has this). He/she will ask you more in depth questions mentioned below. Lastly if you pass this you will have to fill out a million pages of paperwork, pass background checks, drug tests, etc. It takes a good month or so because things move slowly between departments.", "Interview Questions": "What is your prior experience? "}, {"date": "5 Oct 2016", "title": "DEI Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at City Colleges of Chicago (New York, NY)", "Interview Descriptions": "I got a phone screen after two months and interviewed the following week. There were two interviewers who asked basic questions of \"Tell me about yourself\" and specific ones to teaching like \"How would you help an underprepared student?\" or \"Tell me about a difficult time you had with a student and how you handled it.\" They discussed scheduling with me and by the end of the day they emailed me an offer. I initially applied for a Biology Tutor position and was told about the remedial education tutor position which had more openings. Also, it was unlisted on indeed so there was not a lot of external competition I had to deal with. If you have the right qualifications, experience (I had three years as a Teaching Assistant in Chemistry) and are very passionate about helping remedial students then the process isn't so bad. Its a good fit all around for the program directors, you and the students.", "Interview Questions": "What is your teaching philosophy?"}], [{"date": "8 Jun 2016", "title": "Administrative Position With Kennedy King College Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at City Colleges of Chicago (Chicago, IL)", "Interview Descriptions": "I first received a short over the phone interview which was fine.  I was called in for a panel interview with 2 men and 2 women. 1 of the women seemed to have an attitude issue. She never smiled and she seemed to not want to be there.  They each fired off several question back to back.  I couldn't believe all this was for an administrative position.  The mean looks that one of the women on the panel gave me, I knew that I wouldn't get this job if she had anything to do with it.  The questions didn't seem to have to do anything with the job itself.  It was very intimidating and I would not want  to work with someone with such a negative energy.", "Interview Questions": "N/A"}, {"date": "12 Oct 2017", "title": "Teacher Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 3 days. I interviewed at City Colleges of Chicago (Chicago, IL) in Jun 2016", "Interview Descriptions": "They ask some pretty basic interview questions, what are you good at, what are you bad at what are your flaws, etc. It is very pressurising having to answer these questions and makes me nervous.", "Interview Questions": "What are you good at"}, {"date": "23 Apr 2016", "title": "Business Operations Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at City Colleges of Chicago", "Interview Descriptions": "After submitting an online application, I received a call in three days; The process was 4 steps: 1st interview--interviewed by a panel of 3 people; 2nd interview--President; 3rd- VC at District office; and 4th-HR Director.  I felt welcomed all the way.", "Interview Questions": "Why are you leaving your current job?"}, {"date": "3 Apr 2016", "title": "Admissions Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at City Colleges of Chicago", "Interview Descriptions": "The first step is a phone interview. If passed, the next step is an in person interview and presentation with a committee. The committee then recommends 1-2 candidates to the president of the college. At this point,  the president interviews the committee approved candidates and makes a recommendation to district office. The final candidate is contacted Human Resources (HR) about the contingent salary offer and the candidate either accepts this offer or asks to negotiate. If candidate accepts the offer, the candidate's file moves to board approval by trustees and CCC Chancellor. Once the board approves the position, this information is released in a board report by district on the CCC website at appointed date. The candidate can either check the report online to see if they have been approved for the position or reach out to HR. Either way, the new hire is contacted by HR with a start date and further instructions.", "Interview Questions": "N/A"}, {"date": "4 May 2017", "title": "Note Taker Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at City Colleges of Chicago (Chicago, IL) in Dec 2015", "Interview Descriptions": "The overall interview was very general in terms of questions asked and they ask for a writing sample from you. I believe they do this just to see how legible your handwriting is.", "Interview Questions": "What subjects are you interested in"}, {"date": "24 Jan 2017", "title": "Note-taker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at City Colleges of Chicago (Chicago, IL) in Sept 2015", "Interview Descriptions": "The interview was very quick and straight forward. I interviewed with the Director of Disability and a HR representative. The interview was about thirty minutes long. Non intimidating, very natural.", "Interview Questions": "What are some things you feel you need to work on?"}, {"date": "26 Jun 2017", "title": "Embedded Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at City Colleges of Chicago (Chicago, IL) in Jun 2015", "Interview Descriptions": "Initial phone interview and a second panel interview.  After that, I was asked to submit background check approval documents.  Once the background was complete, I was given an offer.  After accepting the offer,  an email was sent as a written agreement to the offer, along with final paperwork needed to process my employment.  About a month later, I was contact regarding a start date.  Although the process was long, it was fairly easy.", "Interview Questions": "What are some of the best practices used to service underserved students?"}, {"date": "29 Jul 2015", "title": "Full-Time Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 months. I interviewed at City Colleges of Chicago (Chicago, IL) in May 2015", "Interview Descriptions": "Initial interview & teaching demo were with three members of the faculty search committee. Called back for a second, less formal interview with the college president seven weeks later. Three days after that, I had a third interview with the Vice President of Academic & Student Services, the Dean of Instruction, and the Dean overseeing the program.", "Interview Questions": "Do you know any languages other than the ones listed on your resume?"}, {"date": "14 May 2015", "title": "Office Administration Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at City Colleges of Chicago (Chicago, IL) in Apr 2015", "Interview Descriptions": "I was first phone screened before the in-person interview. The person who called me for the phone screen didn't leave a message and kept calling my phone until I answered, which I found to be off-putting. It was also very difficult to get a straight-forward answer about the position itself since I was told that the job was not exactly what was posted on their website. I was then contacted by an individual in their HR department who sent me a job description from 2001 along with other materials I needed to fill out. \r\nThe in-person interview was standard and out dated. I sat at the head of the table while four other individuals \"who I would be working with\" asked a round of standardized questions that one would get from any HR website. The questions really didn't seem to have much to do with the position itself. One person only asked me one question and then day-dreamed through the rest of my interview.", "Interview Questions": "Where do you see yourself in 5 or 10 years?"}, {"date": "27 Jul 2017", "title": "Accounts Receivable Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at City Colleges of Chicago (Chicago, IL) in Apr 2015", "Interview Descriptions": "A Phone interview. Then  two separate  in  person interviews.  The Board of directors must approve hiring.  The whole process took over 3 months.   Thankfully I was employed during the interview and screening process.", "Interview Questions": "Why do you want to work for City Colleges of Chicago?"}], [{"date": "11 Jun 2015", "title": "Computer Lab Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at City Colleges of Chicago (Chicago, IL) in Apr 2015", "Interview Descriptions": "I was called in for a interview. The interview was three days after I was contacted. I arrived and eventually found the office the interview was to be conducted. I sat down in front of three interviewers and they began to take turns asking me questions. I thought it was odd that the interview was taking place in a office where other staff members were sitting around and or coming pass. That added to my nervousness but I understand.", "Interview Questions": "I was asked to describe myself. I was also asked why I applied for the position."}, {"date": "8 Mar 2015", "title": "Instructor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at City Colleges of Chicago", "Interview Descriptions": "3 one-hour visits with faculty, panel of administrators, then the president.  No teaching demonstration.  The process was not bad at all except for the fact that it was all broken up into three sessions.  Also, it took a very long time to get the offer followed by another long delay to get the actual salary figure.", "Interview Questions": "What you know about the College to Careers initiative."}, {"date": "9 Feb 2018", "title": "Clerical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at City Colleges of Chicago (Chicago, IL) in Mar 2015", "Interview Descriptions": "Everything is done through email, the appointment was set up and I interviewed with 3 people who were very nice . They responded to the questions I had about the position", "Interview Questions": "Job experience why you left your last job"}, {"date": "24 Jan 2016", "title": "Senior Research Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at City Colleges of Chicago (Chicago, IL) in Feb 2015", "Interview Descriptions": "The HR rep, did a brief phone interview, reading-off a brief list of questions clearly derived from the job posting. She probably had a low to moderate understanding of the job content herself, so stuck to basics here.\r\n\r\nPassing that, she sent me a little performance task. It was surprisingly, fairly non-technical, and really only asked me to prepare to give a short PP presentation to the \"Decision Support\" (Strategy) team, a proposal of my ideas for how to manage/structure the evaluation metrics for a given strategic initiative (\"Reinvention\") for different participants across the colleges. I found this a bit too simple, really, to deserve a 15 minute power point (So maybe I missed something?) But, on my interview day, I delivered a few slides on the topic, as asked.\r\n\r\nFor my Interview day, I met with the heads of two, related, departments at the same time, as they both had research/data analytic roles to fill. Then, I gave my PP to the larger team, of maybe 8 staff, with a little discussion. All folks were positive, and engaged. I think they easily could tell that in some areas I was a bit \"green\", but our exchange was quite polite and positive; I made light of some of my previous nonprofit jobs simply not offering very rigorous data challenges yet. And, in all, I think they saw I had strong skills and some useful experience, still.\r\n\r\nAlso, the HR rep, was super kind throughout the process, had a fairly practical, honest way about her. She had asked about salary range a bit, and I told her about a few other organizations I was also interviewing with, and the range for them. She admitted that they were only currently able to offer around the very bottom of that range. I got the sense hat she was disappointed, and that it would be bureaucratically difficult to improve their offer range. So...", "Interview Questions": "Data systems experience, like SQL."}, {"date": "27 Apr 2015", "title": "Lab Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at City Colleges of Chicago (Chicago, IL) in Feb 2015", "Interview Descriptions": "The interview process was done by three interviewers, I was asked about my qualifications, skills and current employment. I was asked how would I handle an unruly student, and if I had ever encountered a situation where a person was upset about the service provided and how did I handle that.", "Interview Questions": "They asked if my schedule was flexible."}, {"date": "21 Oct 2017", "title": "Math Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at City Colleges of Chicago (Chicago, IL) in Dec 2014", "Interview Descriptions": "One of my professors actually recomend me to the tutor position. I went to the interiew with the math tutoring center. He asked basic questions about my academic performance. I also took the basic math test.", "Interview Questions": "there was no any really difficalt questions. The math test was unexpected, but I did well on it."}, {"date": "25 Apr 2016", "title": "Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at City Colleges of Chicago (Chicago, IL) in Oct 2014", "Interview Descriptions": "There was an initial phone screen followed by an in-person panel interview within a short amount of time.  The panel was a mish-mash of co-workers, direct supervisors and departmentally relevant personnel.  They called later that day to offer conditional employment.  The drug test and background check followed within the next 2-3 days though employment did not officially begin until the semester began.", "Interview Questions": "How would you help an under-prepared student?"}, {"date": "10 Oct 2014", "title": "Assistant Business Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at City Colleges of Chicago in Aug 2014", "Interview Descriptions": "Process was faster than usual took about 4 weeks for everything. Typically takes two to three months for hiring process from what I was told. They are working to improve this process. I met with two executives and a director.", "Interview Questions": "I don't recall any truly difficult questions I think the interview was straight to the point and asked valid and relevant questions. If you are a person that answers things truthfully and are qualified for the job it should not be a problem prepare the same as any interview."}, {"date": "30 Jun 2014", "title": "Computer Lab Manager Interview", "results": "No Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at City Colleges of Chicago (Chicago, IL)", "Interview Descriptions": "Applied online followed by a HR phone screen a few weeks later.  About 2 weeks later, I had an in-person interview with a panel consisting of HR staff, IT manager, and potential colleagues.  I was told a final decision would be made in 1-2 weeks, but I never heard anything more despite a few attempts to follow up.", "Interview Questions": "Is there anything else you'd like to share with us that you feel would be helpful in your consideration?"}, {"date": "12 Sept 2017", "title": "Ladungs- und Transportsachverständiger / Großkundenbetreuer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. I interviewed at City Colleges of Chicago (Chicago, IL) in Jul 2014", "Interview Descriptions": "After submitting application online, interview with a committee of three or more people.  One will be HR, Administrator, and person you will report directly to.  If select 2nd interview with President of college.", "Interview Questions": "What do you bring to the department that is beneficial "}], [{"date": "29 Apr 2018", "title": "Call Center Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at City Colleges of Chicago (Chicago, IL) in Jun 2014", "Interview Descriptions": "When I was hired many years ago, the process was seamless. I had a 15-minute interview over the phone and was hired. With new management, they require two interviews and a decision from the board.", "Interview Questions": "How do well do you handle customer's complaints? "}, {"date": "7 Jan 2016", "title": "Testing Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at City Colleges of Chicago (Chicago, IL) in Apr 2014", "Interview Descriptions": "I applied online and received a Skype interview about two weeks later. I was told to come in for a interview, which i did. I interviewed with 4 individuals. My supervisor, hr, VP and President. The interview was laid back and easy going. They took turns asking questions and I heard something back about 2 weeks later. I accepted the position.", "Interview Questions": "Why I would be a good fit for the position."}, {"date": "7 Jan 2018", "title": "College Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at City Colleges of Chicago (Appleton, WI) in Mar 2014", "Interview Descriptions": "Both of my interviews were conducted via Skype. I did not step foot on the campus before my first day of work. The interviewers were at least 30 minutes late for both interviews as well.", "Interview Questions": "What is your experience working with first generation, low income, and undocumented students?"}, {"date": "25 Feb 2016", "title": "Project Team Leader Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at City Colleges of Chicago (Chicago, IL) in Jan 2014", "Interview Descriptions": "Group and individual interviews. I was given a 5 year strategic plan, told to pick a problem, and present in 5 slides or less, how I would structure my problem solving process..", "Interview Questions": "Why did you choose that particular problem from the strategic plan to solve for?"}, {"date": "31 Aug 2015", "title": "Admissions Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at City Colleges of Chicago (Chicago, IL) in Jan 2014", "Interview Descriptions": "The interview process and hiring process was a lot longer than I expected, but both the hiring manager and HR associate were always there for questions that I had along the way.", "Interview Questions": "If you were running late to a meeting would you take the stairs, the elevator, or the stairs? "}, {"date": "27 Sept 2015", "title": "Full Time Faculty Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 2 days. I interviewed at City Colleges of Chicago (Chicago, IL) in Jan 2014", "Interview Descriptions": "Two conversations with two different Management level employees at my part-time professional job transpired which ultimately proved my worth as an effective teacher, as well as, the results of my input towards the academic program which ultimately helped enhance the school's position among the academic world their school's being capable of providing proof of efficacy in the area of architectural design academics.  These two meetings also proved to me, that even though both administrators were sincere regrets  that they were not at liberty to make any offers to me, I learned that the School District had not intentions of offering adjunct teachers any advancement opportunities to upgrade status or salary.", "Interview Questions": "Will you leave us if we cannot offer a position?"}, {"date": "14 May 2013", "title": "Ladungs- und Transportsachverständiger / Großkundenbetreuer Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at City Colleges of Chicago", "Interview Descriptions": "A pannel interview with 5 individuals asking questions. Individuals from different ethnicities to show the company's diversity. I was asked several situational questions such as: How would you deal with an angry customer/coworker? How would you cross a trail in the forest where a bear sleeps? Why are you the best candidate for this position?...", "Interview Questions": "How would you deal with issues within the workplace?"}, {"date": "26 Apr 2013", "title": "Assistant Director of Research and Planning Interview", "results": "No Offer", "experience": "N/A", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at City Colleges of Chicago", "Interview Descriptions": "There were two panel interviews: First, interview with the selection committee (e.g. a group consisting of staff, professors, and vice president); Second interview with the highest college administrators (e.g. president, vice president).", "Interview Questions": "What do you know about the college?"}, {"date": "13 Mar 2013", "title": "Systems Analyst Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at City Colleges of Chicago", "Interview Descriptions": "One interview with the manager and other technical people.", "Interview Questions": "Are you willing to work many off-hours?"}, {"date": "21 Jun 2016", "title": "Partnership Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at City Colleges of Chicago (Chicago, IL) in Mar 2013", "Interview Descriptions": "The interview was very standard.  Phone screen was typical followed by one round of in-person interviews.  Important to really understand the community college model, the Reivention process, the challenges students face within community college and the communities they serve.  Not a lot of room for negotiation.  Important to ask if the job is part of a union.", "Interview Questions": "Describe your understanding of the communities we serve?"}], [{"date": "11 Jan 2016", "title": "Enrollment Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at City Colleges of Chicago (Chicago, IL) in Oct 2012", "Interview Descriptions": "I submitted an online application through indeed.com followed by a phone call from HR and single round face to face interview with the department manager.The entire interview lasted less than an hour.", "Interview Questions": "Describe a time in which you had to difuse a difficult situation."}, {"date": "20 Oct 2016", "title": "Front Desk Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at City Colleges of Chicago (Chicago, IL) in Aug 2012", "Interview Descriptions": "Honestly I just walked in there and already had the job before I even said anything. She said I had the job already before I started talking and was good to go", "Interview Questions": "Why do you want to work for City Colleges of Chicago?"}, {"date": "25 Oct 2012", "title": "Computer Lab Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at City Colleges of Chicago (Chicago, IL) in Jul 2012", "Interview Descriptions": "The interview process involed meeting with department head and tech lead.  They asked very general questions and were very friendly.  They asked about tools, processess and type of environment I worked in.", "Interview Questions": "They asked do you see yourself in management so day?\r\nGiven your background, I think you will be bored with this position?"}, {"date": "19 Dec 2013", "title": "Student Ambassador Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at City Colleges of Chicago (Chicago, IL) in Apr 2012", "Interview Descriptions": "Simple interview process. All employers are friendly and helpful.", "Interview Questions": "Easy questions only. "}, {"date": "13 Jun 2014", "title": "Workstudy Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at City Colleges of Chicago (Chicago, IL) in Feb 2012", "Interview Descriptions": "Hiring process was simple. I filled out the work study application the week that school started, and received a call about a week later asking was i still interested in becoming a work study student. I was asked to come in for a orientation/interview. Really simple process, no real interview questions. I was asked questions like what time would you like to work.", "Interview Questions": "No difficult or unexpected questions"}, {"date": "31 May 2015", "title": "Adjunct Faculty Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at City Colleges of Chicago (Chicago, IL) in Aug 2011", "Interview Descriptions": "It was over the phone.  I was called from some resume pool and nobody asked me anything specific about pedagogy; it was clear they just needed bodies in front of students. I was hired Friday afternoon and started teaching that Monday morning.  I had to chase down a text book.  I even had to beg rosters and markers for the dry erase board.  I knew it was a Machine Nightmare before starting, but was there to protect my brother and sister veterans from getting a education taught by apathy. I believe Wal-Mart has a more selective hiring process to be a greeter. Nobody asked me what I wanted to be in five years, or where I see this position leading me, or if I'd like the chance to move up in the system.  Nobody cared so long as I stood in front of my classes and kept PC.  Anybody familiar with adjuncting knows this is standard, but CCC just doesn't try to hide their apathy for making sure boxes are checked and classes have teachers.", "Interview Questions": "Can you teach at this time and date?\r\nYou OK with not being paid for six weeks?"}, {"date": "2 Aug 2013", "title": "Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at City Colleges of Chicago (Chicago, IL) in Aug 2011", "Interview Descriptions": "The interview process was ok. The person who interviewed me was very personable and talk about different ways that someone should help the students.", "Interview Questions": "Describe things you believe the company does very well, particularly compared to its competition. Explain how the financial strength of the company is important."}, {"date": "6 May 2015", "title": "Storekeeper Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at City Colleges of Chicago (Chicago, IL) in Jun 2011", "Interview Descriptions": "A group interview; consisting of a least three individuals. Director of HR, Director of Auxiliary Services and the Assistant to the President. At this point, it may include the Executive Director.", "Interview Questions": "Why should we consider you for this position?"}, {"date": "19 Jun 2015", "title": "Adjunct Faculty Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at City Colleges of Chicago (Chicago, IL) in Mar 2011", "Interview Descriptions": "it was quick but very disjointed. miscommunication. weirdness and lots of other stuff. easy process but you better have patience because there is no system nor process in place. and there are petty people on interview committee", "Interview Questions": "where did you go to school"}, {"date": "8 Jul 2015", "title": "Project Janitor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 12 months. I interviewed at City Colleges of Chicago (Chicago, IL) in Mar 2011", "Interview Descriptions": "It wasn't any pressure at all doing the interview average question. take differ one's from each of the interviewer's. Anwser's the question to the best of my knowledge ,being positive in my answers. At the end of the interview, we said goodbye shook hands ,feeling that all thing went well I received a phone call six months later to let me know that I had pass all the requirments to by hired for the postion.", "Interview Questions": "How well do you get alone with other ? I get alone with most people"}], [{"date": "4 Sept 2015", "title": "Director of Finance Military Programs Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through a staffing agency. I interviewed at City Colleges of Chicago in Mar 2011", "Interview Descriptions": "Initially was hired by a temporary agency oversee off the accounting for the Military Programs stateside and overseas for 6 years. I was interviewed by the Vice President and Executive Director for Military Program. The President made the final decision.", "Interview Questions": "Did I mind working weekends and sometimes late to get the job completed. "}, {"date": "16 Sept 2013", "title": "Program Director Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at City Colleges of Chicago (Chicago, IL) in Jan 2010", "Interview Descriptions": "Total of 9 interviews with Associate Vice Chancellors, Vice Chancellors, & Chancellor.  Many changes in the schedule, kept waiting at every interview.  Interviewers like to talk about themselves--expect 45-50% of the interview to be about them (personally)", "Interview Questions": "Why should we hire you?"}]]