[[{"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "A challenging and valuable job", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "12 Mar 2019", "job_title": "Researcher in Bogotá, Bogota", "duration": "N/A", "pros": "It is possible to build a career in InSight Crime. I started as an intern and at the end, I was a Researcher with experience in two different projects.\r\n\r\nTo me, the most valuable experience was to be able to travel across my country and get to know the reality from the ground. Now, that I am doing my Masters degree I see how valuable is this knowledge and how important is to do field-work. Also, I had the chance to do fieldwork in Venezuela which was a unique opportunity to work with experts on the field.\r\n\r\nAlso, I think is a type of job that challenges you and invites you to think critically. At the same time, you are able to develop your skills as a researcher, writer, and analyst. \r\n\r\nFinally and not least important, I got the opportunity to work with brilliant people that have become really good friends. At InSight, it is possible to find a friendly environment where you are surrounded by people from all over the world.", "cons": "It's a very demanding job in terms of time and skills. This can be stressful but also can be taken as an opportunity to learn to work under pressure and be able to adapt easily to changes."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": 0, "Diversity and Inclusion": 0, "Career Opportunities": 3, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "Going downhill fast", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "7 Apr 2023", "job_title": "Researcher in Medellín, Antioquia", "duration": "N/A", "pros": "Exciting work that will get you noticed, InSight Crime's reputation is great. But internally, rapid expansion has led to severely limiting possibilities.", "cons": "The directors are clear as to their intent, \"Hook them young, pay them cheap, work them to the bone until they get something else, and then hire more.\" Because the work is exciting, there is a definite belief that young people will accept a raw deal, horrific pay, and aggressive management."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 0, "Culture & Values": 3, "Diversity and Inclusion": 3, "Career Opportunities": 4, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "A Classic Burnout Business", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "11 Apr 2022", "job_title": "Researcher in Medellín, Antioquia", "duration": "N/A", "pros": "Wonderful people, interesting work and the opportunity to live abroad. Also the chance to do fieldwork 1-3 times per year.", "cons": "Poor work/life balance, poor salary (compared to USA/EU) and toxic leadership. A director has publicly described the business model as \"get bright people in their early/mid 20s, pay them like crap, work them to the bone for 2 years, then replace them when they leave for a better job\"."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "A place to learn and make  carreer", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "25 Jan 2019", "job_title": "Graphic Design Manager in Medellín, Antioquia", "duration": "N/A", "pros": "- Great team, nice and very talented people from all over the world.\r\n- Topics we cover matter in terms of contributing to create public policy in latin america\r\n- I have learned a lot of management and skill development to create graphs from data. We have grown a lot as a design team in just 2 years\r\n- Freedom to propose and create new projects,\r\n- Graphic design is a fundamental part of the daily work of the foundation.\r\n- Freedom to work", "cons": "IC is a growing foundation and sometimes it means some  reprocess. But that is the challenge!"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 3, "Senior Management": 5, "review_title": "Researcher", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "11 Feb 2019", "job_title": "Researcher in Bogota, Cundinamarca", "duration": "N/A", "pros": "InSight is a great place to learn and grow in your professional career. Their focus on field work and research helps spark creative thinking, problem resolution and leadership. The international atmosphere and ability to discussed and be heard is something very valuable of the workplace.", "cons": "Home office is not always simple since human interaction is needed to have a healthy working experience. Investing in employees general welfare could translate into a more productive working environment."}], []]