[[{"date": "21 Apr 2023", "title": "Social Impact Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Cambia Health Solutions", "Interview Descriptions": "Three interviews with similar questions each time. Small project request at the last minute. Not overly hard but received very generic answers to questions I had about company culture and related inquiries.", "Interview Questions": "Same old interview questions about interest and experience."}, {"date": "10 May 2023", "title": "Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Cambia Health Solutions in Apr 2023", "Interview Descriptions": "I had a screening call, an interview with my potential manager, another interview with the team, and a final Interview with a VP. The interviews were all about an hour. I was told I was one of the final two they were considering. After all of that I heard nothing for over a week so I emailed the recruiter. I got a generic response brushing me off. I assumed I didn't get the job but was a little annoyed that they didn't even take the time to click a button and email me a generic rejection letter. I get you can't respond to everyone, but if you're going to have someone spend that amount of time and effort interviewing. You can at least communicate with them.", "Interview Questions": "A lot of questions about past experience"}, {"date": "14 Apr 2023", "title": "Underwriter Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 months. I interviewed at Cambia Health Solutions in Feb 2023", "Interview Descriptions": "Painful. Multiple interviews scheduled with different departments, only to get ghosted in the end. One person was asking the complete opposite of what I would call productive questions. He didn't seem interested in me joining the team. Absolute waste of my time, after carving out so much to accommodate.", "Interview Questions": "Why do you want this job"}, {"date": "4 Apr 2023", "title": "Programmer Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Cambia Health Solutions (Portland, OR) in Feb 2023", "Interview Descriptions": "2 people gave this interview one hiring manager and the other is leader of their group it was around 30min most of the questions are behavioral not very stressful and they are polite", "Interview Questions": "what was like about my ETL experience"}, {"date": "16 Dec 2022", "title": "Senior Data Scientist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Cambia Health Solutions (Portland, OR) in Dec 2022", "Interview Descriptions": "Met for a 1 hour technical interview with a manager and current machine learning scientist. They asked questions about probability and machine learning. After that, they sent me a 4 hour take-home assignment with questions about analyzing a data set.", "Interview Questions": "How can you tell if you have imbalanced data, and how do you deal with it?"}, {"date": "27 Jun 2022", "title": "Utilization Review Clinician Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Cambia Health Solutions", "Interview Descriptions": "Currently interviewing and it has been going well. HR has been responsive and interviewing manager provided helpful information. Company offers competitive salary and benefits. Preparing for 2nd interview today. 30 words may be excessive GD.", "Interview Questions": "What caught your attention about the position?"}, {"date": "16 Jun 2022", "title": "Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at Cambia Health Solutions (Seattle, WA) in Apr 2022", "Interview Descriptions": "Half hour interview with the hiring manager, followed by two panel interviews - one with direct reports, and one with peers to the position. All communication with the recruiter was via email, which was a challenge when trying to find mutually agreeable times for an interview. I also didn't get any information about salary or benefits prior to meeting with the hiring manager.", "Interview Questions": "What do you know about Cambia, and why do you want to work here?"}, {"date": "5 Nov 2021", "title": "Software Engineer(Internship) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Cambia Health Solutions", "Interview Descriptions": "Question for HM is hard but fair. If you have any concerns just ask for help, the HM will love to give you hints to help you to finish it.", "Interview Questions": "Question from Leetcode but not 100% same."}, {"date": "22 Oct 2021", "title": "Software Development Engineer (SDE) II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Cambia Health Solutions", "Interview Descriptions": "Great interview.  Had a call with a recruiter, then had a formal interview with the team manager & lead developer. In the final stage I was asked to provide a work sample.", "Interview Questions": "Asked pretty generic interview questions. "}, {"date": "8 Oct 2021", "title": "Consulting Analyst Or Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Cambia Health Solutions", "Interview Descriptions": "The whole process was pretty smooth and quick.  They asked details about my education, working experiences, analytical skills, etc. We had a great talk and both of us enjoyed it.", "Interview Questions": "Basic questions: tell me about yourself, projects"}], [{"date": "13 Aug 2021", "title": "Insurance Claim Processor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Cambia Health Solutions", "Interview Descriptions": "Very natural, nice people. They ask alot if situational question then you're normal interview questions. They explain everything at the beginning which makes it hard to think of other questions at the end.", "Interview Questions": "They ask situational type questions"}, {"date": "14 Sept 2021", "title": "Remote Customer Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Cambia Health Solutions in Aug 2021", "Interview Descriptions": "The interview was good, asked a lot of questions regarding past employment and how I handle situations. I was offered employment a couple weeks after interview and gladly accepted, I was notified during the interview the company supplies the equipment to work remotely and then attend a 8 week training.", "Interview Questions": "How have you handle a situation in your past employment and what was the outcome?"}, {"date": "16 Aug 2021", "title": "Software Developer 3 Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 1 week. I interviewed at Cambia Health Solutions (Seattle, WA) in Aug 2021", "Interview Descriptions": "The meeting invite email had the interview set up between myself, the Hiring Manager, and the Principal Engineer. The actual interview was a panel interview with them and 4-5 additional engineers. They asked several questions that would have been answered for them if they had bothered to review code that I have up on GitHub, with links in my resume. When I asked about technical challenges, they responded by repeating the technical stack they were working with.", "Interview Questions": "They asked if I had worked with MySQL, then asked what an Inner Join and Left Outer Join was"}, {"date": "13 Jun 2021", "title": "Consulting Research Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Cambia Health Solutions in May 2021", "Interview Descriptions": "I applied quickly online through LinkedIn (which directed me to Cambia's job portal). A recruiter reached out to me to coordinate a 30-minute phone interview with two hiring managers. I had a call with the recruiter to prepare for the interview. She was extremely welcoming and helpful. The call with the hiring managers went well. They had thoroughly reviewed my resume before the call and asked relevant and genuine questions to gauge my experience and why I was interested in the job and company. \n\nAfter the 30-minute interview, I was invited back for a 2-hour video interview with the hiring managers and a 30- minute video chat with current employees. The 2-hour interview went by quickly. They asked detailed questions about my education, job history, research and analytical experience, and personality traits. They were genuinely interested in my responses. I had plenty of time to ask questions about the role. This extended interview also allowed me to interact with my future boss and understand his personality and work style. \n\nThe meeting with current employees was laid back. The current employees had various job titles and answered questions about the company and their jobs. We discussed my background and potential fit. The current employees were informative, friendly, and encouraging. \n\nThe entire process took about a month. The recruiter kept me very informed, and they were flexible with scheduling calls and interviews. The recruiter called to offer me the job officially and described the pay and benefits to me in detail before sending supplementary documents.  I was excited to get a great offer and accepted it.", "Interview Questions": "What would your previous manager say your strengths and weaknesses are? "}, {"date": "5 Aug 2021", "title": "Data Scientist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Cambia Health Solutions (Portland, OR) in Apr 2021", "Interview Descriptions": "Initial interview with hiring manager with a variety of questions regarding statistics, machine learning, deductibles, general knowledge of health insurance industry. I accepted another position before proceeding to the next rounds, which they mentioned involved some combination of an assessment along with a panel interview.", "Interview Questions": "What is overfitting? How do you identify it? How do you combat against it?\r\n\r\nWhat is a hyperparameter? What are some hyperparameters of a tree-based machine learning algorithm?\r\n\r\nWhat would be the pros and cons for having high deductibles?\r\n\r\nWhat are some stories of people who have difficulty accessing medical care?"}, {"date": "28 Nov 2021", "title": "Customer Service Representative Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Cambia Health Solutions (Medford, OR) in Apr 2021", "Interview Descriptions": "The interview process was pretty easy actually. They did not ask any hard questions. They just asked me questions about how I feel about certain aspects of the job and the work. They basically asked me if I thought I could do the job.", "Interview Questions": "How do you feel about using 3 screens at once?\nHow do you feel about upset customers and how would you handle it? "}, {"date": "2 Nov 2020", "title": "Customer Service Professional Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Cambia Health Solutions in Oct 2020", "Interview Descriptions": "Had someone reach out about the interview to schedule a date and time and then sent me an email follow-up on where to open/access the link for the video interview. Had a video interview with two supervisors from customer service department.", "Interview Questions": "What was a past position you enjoyed and why?"}, {"date": "25 Oct 2020", "title": "Regence Customer Professional Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Cambia Health Solutions in Sept 2020", "Interview Descriptions": "Before asking any interview questions, the interviewer already sounded fed up with sighing and tones of voice. It didn't help with my confidence level at all and seemed like they were just doing a courtesy interview but had already made up their minds about me.", "Interview Questions": "Can you highlight anything in your resume?"}, {"date": "25 Mar 2022", "title": "Market Research Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Cambia Health Solutions in Sept 2020", "Interview Descriptions": "It was a 60 mins interview over video call. There were 4 interviewers. Everyone was very friendly and they ask some behavioral questions. After my first interview I haven't heard anything back from them.", "Interview Questions": "Why are you interested in this position?"}, {"date": "15 Nov 2020", "title": "Journi Business Development Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Cambia Health Solutions (Portland, OR) in Jun 2020", "Interview Descriptions": "Long process over 4 months with several interviews via  phone and teams (given Covid).  Very informal questions and nice interaction with HR, but lacked professional follow-up from the business management.  Minimal understanding of the business they were trying to get into.", "Interview Questions": "Have you called on health systems executives before?"}], [{"date": "30 May 2020", "title": "Product Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Cambia Health Solutions (Portland, OR) in Apr 2020", "Interview Descriptions": "I had a first round interview with the recruiter and the following week had a second round interview with the hiring manager. After being told I'd hear back by the end of the week, I didn't hear anything. The following week, I emailed the recruiter asking for an update. I never received an email back, and I saw that the position was reposted on LinkedIn shortly thereafter. \r\nSome feedback for recruiting - this is a very challenging time in a number of people's lives. Candidates appreciate updates and feedback even in normal times. In the future, if a candidate isn't moving forward please show them the courtesy of letting them know.", "Interview Questions": "Tell me about your favorite product."}, {"date": "6 Feb 2020", "title": "Talent Acquisition Coordinator Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Cambia Health Solutions (Portland, OR) in Feb 2020", "Interview Descriptions": "I applied online via LinkedIn and received a phone call and email from a Recruiter following up on my application. The recruiter provided information on the role, company and asked a series of questions regarding experience in recruiting coordination and working on a team. After the phone call with the recruiter I had a second phone screen with the department lead and supervisor. Again sharing more information on the role and asking questions regarding experience and career goals. The third interview was in person with the TA Coordinating team in the Portland office. All professional, welcoming and informative throughout the process.", "Interview Questions": "What is your biggest accomplishment so far?"}, {"date": "2 Jan 2020", "title": "Customer Service Professional Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Cambia Health Solutions", "Interview Descriptions": "Two interviewers with computers. Extensive question process involving customer service experience. Be prepared with thorough answers that one can typically expect for a job like this. The people interviewing were relatively nice and interesting to talk to. Not much pressure.", "Interview Questions": "What was your best customer service experience?"}, {"date": "5 Jan 2021", "title": "Marketing Data Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Cambia Health Solutions in Jan 2020", "Interview Descriptions": "Interview went well. The team was keenly interested in all my answers. I was hoping to hear back but didn't get a response from HR until after one month or more.", "Interview Questions": "Questions about my job responsibilities, experience with Google Analytics"}, {"date": "12 Nov 2019", "title": "Competitive Intelligence Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Cambia Health Solutions (Portland, OR)", "Interview Descriptions": "To say that their HR people are stupid is a major understatement.  Clueless!  Yet so arrogant.  They will scan your resume for positions that are expected to match exactly the title of the position you are interviewing for.  If they don't see it, they will be wondering why you are applying.  \r\n\r\nThey are absolutely incapable of seeing the bigger picture, of understanding what kind of a person the company needs, and why.  The only thing that matters to them is that all the HR procedures are followed, that their internal i's are dotted and t's are crossed.  \r\n\r\nIf the position you are applying for is the job of your dreams (or you are really desperate for a paycheck), you may soldier on and put up with this crap.  Most of the time, however, the candidates have other options these days.  The job looked very interesting to me, and the interview with a hiring manager was a good experience, but the HR behavior was a deal breaker.  I got a job elsewhere.  No regrets.", "Interview Questions": "What is your current salary?  What salary do you expect?  "}, {"date": "9 Apr 2020", "title": "Strategic Finance Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Cambia Health Solutions (Portland, OR) in Oct 2019", "Interview Descriptions": "Applied online, messaged multiple recruiters to get an interview. Initial phone screening with recruiter, wanted to make sure I had appropriate budgeting experience. Had 2nd round skype interview due to being an out of state applicant with a Finance Manager. 3rd round in person panel interview with 3 Assistant Directors. Asked about previous experience, interest/background in healthcare, also asked case study questions. Friendly, easy-going interview.", "Interview Questions": "How would you analyze a potential investment opportunity in \"x\" space?"}, {"date": "9 Jun 2020", "title": "Sourcing Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Cambia Health Solutions (Portland, OR) in Sept 2019", "Interview Descriptions": "Initial phone screen with recruiter. 2 phone interviews, and one half day in person interview with management. During the whole process I was updated on next steps, and communication was excellent.", "Interview Questions": "Related experience and projects to healthcare sourcing"}, {"date": "17 Oct 2019", "title": "Dental Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Cambia Health Solutions (Portland, OR) in Sept 2019", "Interview Descriptions": "I applied online through Linkedin. I received an email and a phone call to schedule an interview with several dates/times to choose from. The interview was rescheduled twice.  I received an email verification with the info.", "Interview Questions": "Tell us about a time when you changed something in your last position."}, {"date": "18 Jun 2019", "title": "Underwriter Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Cambia Health Solutions", "Interview Descriptions": "Very kind, put me at ease, very friendly. I did a preinterview by phone and am actually waiting to hear back about an in person interview.  The process from applying online to receiving a call was about two weeks.", "Interview Questions": "What do you know about insurance in general?"}, {"date": "24 Oct 2019", "title": "Software Engineer(Internship) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Cambia Health Solutions (Seattle, WA) in May 2019", "Interview Descriptions": "1 Phone screen followed by 2 phone screens and 1 onsite interview.\r\nEach interview was 45 mins.\r\nFirst 10 mins were used to discuss past projects/internships and some OOP, data sctucture questions.\r\nThen a 30 minute coding question then 5 mins for me to ask questions.\r\nThe recruiter called to schedule each round. Their response was quick and they always offered feedback.", "Interview Questions": "All leetcode easy questions. Stuff like finding smallest sub string that contains all characters of string, binary search, etc."}], [{"date": "20 Nov 2019", "title": "Process Improvement Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Cambia Health Solutions (Portland, OR) in Apr 2019", "Interview Descriptions": "Comprehensive interview process with several stages. The 1st stage was three different interviews with different individuals who interact with the job, including the hiring manager. There was a several week lull between the first interview series and the second, but following that everything moved quickly.", "Interview Questions": "They asked several scenario-based questions. "}, {"date": "8 May 2019", "title": "Business Intelligence Systems Administrator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Cambia Health Solutions (Portland, OR) in Apr 2019", "Interview Descriptions": "I applied online. I was contacted by a recruiter who setup a 30 min phone call with the hiring manager. After that I was asked to do an onsite interview. There were three one-on-one 30 min interviews and a 30 min presentation on a project I was involved with. After that I was asked to give 4 references. Throughout the process the recruiter was helpful and answered any questions I had along the way.", "Interview Questions": "Describe your process for solving an issue that you're faced with? "}, {"date": "24 Feb 2019", "title": "Data Reporting Analyst Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Cambia Health Solutions", "Interview Descriptions": "I applied online and got an email back within a week to schedule for a phone screening . I had a phone interview  with recruiter and it took about 25 minutes.  I was asked very basic questions, nothing out of ordinary. I asked some questions and the recruiter had trouble answering  some questions.", "Interview Questions": "Why are you interested in this company? \r\n"}, {"date": "25 Feb 2021", "title": "Product Owner Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Cambia Health Solutions (Portland, OR) in Feb 2019", "Interview Descriptions": "The whole interview process lasted around 3 weeks.  It was a very positive experience.  The first two interviews were done over the phone, and the third was done in person.  Everyone that I interviewed with asked tough questions and I could tell they expected a thorough response.  It is nice to be interviewed by people who you know would make great partners in the business.", "Interview Questions": "What makes you want to work for Cambia?  \nWhat have you learned in previous jobs that can help you improve yourself while working here?  \nCan you draw me a house? (This was a tricky and great question)"}, {"date": "5 Nov 2018", "title": "Technical Recruiter Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Cambia Health Solutions", "Interview Descriptions": "Phone interview first (30-45 mins). Very good and valuable information.\n\nThis was followed up with multiple in-person interviews. All good talk about employer, team, and company culture.\n\nMention of hearing back within next 3 days. Heard back about a week later that they had selected someone else.\n\nNo feedback whatsoever, which surprised me from a company focused on values like empathy and respect.", "Interview Questions": "What type of technical recruitment have you done?"}, {"date": "27 Nov 2019", "title": "Executive Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Cambia Health Solutions (Portland, OR) in Nov 2018", "Interview Descriptions": "Several phone interviews / 3 in-person interviews over the course of several weeks. I worked with a recruiter within the org that actually out me up for several positions. She wanted my skill set in, and believed the right role would come forward in time.", "Interview Questions": "They asked about work style and collaboration skills for team success. The skills were known; the interviews were more focused on a culture and executive personality fit."}, {"date": "30 Aug 2018", "title": "RN Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Cambia Health Solutions (Vancouver, WA) in Aug 2018", "Interview Descriptions": "Interview was 1hr 15 min.  Interviewer was kind and went through a lot of the programs used in job. I was told that the interviewer would call me then they gave me a number to conference call with the interviewer. It was only  with 1 person on the phone.", "Interview Questions": "What in your current job makes you happy or keeps you there."}, {"date": "18 May 2018", "title": "Business Systems Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Cambia Health Solutions", "Interview Descriptions": "A week and a half after applying online I was offered a 30-minute interview with a recruiter. It was very relaxed, with general information about the role and your typical behavioral questions. Three days later I had my second interview with the manager of the position. the interview lasted about 30 minutes as well and asked me a handful of background and behavioral questions. I just happened to have exact healthcare experience they were looking for so my interview only lasted half the allocated time. \r\n\r\n20 minutes after my interview, I was asked to give them a list of referrals, where they then asked my referrals more questions than they actually asked me. A day after turning in my Referral I was offered a position. From first contact, to offer it was only 8 business days.", "Interview Questions": "Why are you the best fit for this position? "}, {"date": "8 May 2018", "title": "Software Engineer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 6 weeks. I interviewed at Cambia Health Solutions", "Interview Descriptions": "Two phone interviews both technical. First was with an engineer the second with the hiring manager. Didn't hear back after the second. A little bit frustrating. Decided to move on after a couple of weeks.", "Interview Questions": "Python questions."}, {"date": "6 Jul 2018", "title": "Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Cambia Health Solutions (Portland, OR) in May 2018", "Interview Descriptions": "Phone interview with the hiring manager and two team members. A week later I was in the office for multiple in-person interviews, some panel, over three hours with various managers of related teams, including a C-level participant.", "Interview Questions": "How do you handle trying to further an initiative when you have pushback?"}], [{"date": "29 Jan 2021", "title": "Business Development Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Cambia Health Solutions (Portland, OR) in May 2018", "Interview Descriptions": "Overall very good experience. Asked questions about past experience and what I hope to achieve in the future and what are my current goals. Overall just wanted to get to know your personality and how determined you are to learn.", "Interview Questions": "Tell me about your self"}, {"date": "7 Apr 2018", "title": "Senior Business Systems Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Cambia Health Solutions", "Interview Descriptions": "30-minute phone interview with the recruiter.  The questions were standard and focused on the company and the position.  It was a positive experience. I have been invited for a 2nd interview.", "Interview Questions": "What are your strengths and weaknesses?"}, {"date": "10 May 2018", "title": "Data Intelligence Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Cambia Health Solutions in Apr 2018", "Interview Descriptions": "I applied online and after few weeks I received a phone interview call. The first phone interview was with the hiring manager. He asked me about my current work and qualifications. The interview lasted for around 20 mins. At the end of the call, the manager mentioned that he would like to interview me again after 4 days. \r\nThe second interview was a skype interview. The hiring team interviewed me and it was a 2 hours interview. It was a mix of technical and behavioral questions.", "Interview Questions": "The questions were mostly about SQL and Tableau"}, {"date": "2 Mar 2018", "title": "Cambia Grove Program Assistant Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 3 months. I interviewed at Cambia Health Solutions (Seattle, WA)", "Interview Descriptions": "Long drawn-out interview process by people with no background in healthcare. Felt like a political game to get information for their program vs an actual interview. Other staffers at Cambia Health reached out to warn me of new Director's \"mean\" management style,  loss of funding and staff turnover.", "Interview Questions": "What is your experience in building programs?"}, {"date": "15 Jan 2020", "title": "Marketing Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Cambia Health Solutions (Portland, OR) in Mar 2018", "Interview Descriptions": "I literally met with 17 different people over the course of 2.5 days most were multiple people panel/group interviews and some of which kept me waiting/had to push out timing-wise  - it felt excessive.", "Interview Questions": "what was my super power "}, {"date": "27 Mar 2018", "title": "Financial Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Cambia Health Solutions in Mar 2018", "Interview Descriptions": "The interview process was a waste of my time. After stating my salary expectations both online and in my first interview with the recruiter, I had two more interviews. After the third interview, I was asked if I was able to come down from my salary requirements. I said no, and the recruiter said she talked with the manager who was not willing to go up. \r\nThey do not even have a position in mind, they are interviewing \"in case a position opens up\".", "Interview Questions": "Nothing Unusual"}, {"date": "11 Feb 2018", "title": "Records Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Cambia Health Solutions (Portland, OR)", "Interview Descriptions": "I heard from HR several times before the phone interview. Salary requirements were thoroughly reviewed before the phone interview. I was asked to come in for an in person interview, with 3 different interviewers in series of meetings. In the end, they decided not to fill the position.", "Interview Questions": "Describe yourself in 1 word"}, {"date": "8 Feb 2018", "title": "Member Services Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Cambia Health Solutions", "Interview Descriptions": "Internal candidate, applied on line, interviewed over the phone with two directors first, then interviewed in person with the Vice President of the business area.  The hiring manager called me to offer me the position and there was no opportunity to negotiate wage/salary.", "Interview Questions": "I don't recall the specific question, it was around how to reduce overall inventory."}, {"date": "15 Dec 2017", "title": "Associate Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Cambia Health Solutions", "Interview Descriptions": "A new director asked me to apply for the position so I did. The next day I spoke to HR who was excited that I had applied and encouraged me to contact them with any questions and then nothing. No calls or emails so finally I had coffee with another staffer told me that I was being played and wouldn't be getting a call. He/she said to not worry about it though, that the new director already has a reputation for being \"mean\" and I should be glad to not get the job. Both Portland and Seattle's healthcare communities are very small and we all know one another.  Despite the awards at Cambia the culture is changing and when I shared the incident at a community event recently others shared similar experiences internally  where  people are hiring friends over qualified candidates.  It was a very disrespectful process and reflects poorly on how they treat staff and ultimately their patients.", "Interview Questions": "When can you start? by HR person"}, {"date": "28 Dec 2017", "title": "Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Cambia Health Solutions (Portland, OR) in Dec 2017", "Interview Descriptions": "3 Interviews, 2.5 hours interviewing, 1.0 hour filling out supplemental materials\r\n\r\nHR recruiter was disorganized and rude - apparently didn't have my current resume (and insisted that I had failed to send in the right one), hadn't reviewed any of the extensive supplementary materials she had requested me to fill out prior to our conversation, spoke in condescending tones throughout, and evidently didn't bother forwarding the current resume that I personally sent her during the interview to the Sr Analyst I was later scheduled to interview with.\r\n\r\nThe Sr Analyst was also quite rude, took a jab at my GPA for some community college courses (knowing I have an MS degree beyond those) and current financial status, and kept asking me about statistics coursework - only to later reveal towards the end of the interview that the job didn't require any statistics but was actually data management instead.  I was not allowed the opportunity to ask any questions, nor did I learn what this analyst's role or background was.\r\n\r\nThe Supervisor I spoke with was wonderful, and we had a real conversation.  I got a better sense of what her team was looking for, they allowed me to ask questions, and our discussion about the role their team was trying to fill was overall professional and respectful throughout.\r\n\r\nTwo of the three interviews left me with the impression that a culture of fear predominates at this organization, and posturing appears to be more important than meaningful conversation.    I was genuinely excited about this potential opportunity when I was first asked to interview, but if this is how they treat their candidates then I can't imagine it gets much better.", "Interview Questions": "So you've never REALLY reported to anyone at the *executive* level, have you?"}], [{"date": "11 Jan 2018", "title": "Senior Systems/Talend Administrator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 6 days. I interviewed at Cambia Health Solutions (Portland, OR) in Nov 2017", "Interview Descriptions": "30 minutes Phone screen with manager.  Couple of days later, a series of panel interviews with the team, ending with a phone conversation with the manager.  Couple days later, job offer.", "Interview Questions": "N/A"}, {"date": "26 Oct 2018", "title": "Process Improvement Consultant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at Cambia Health Solutions (Seattle, WA) in Nov 2017", "Interview Descriptions": "Longer process, with many interviews.  A couple rounds of phone screens, then an all day round with many different people, then another phone interview.  The HR person started but didn't know much about the job.  It was hard to tell who was the hiring manager or who the people that were interviewing me were because there were so many of them.", "Interview Questions": "Why are you interested in this role, what interests you about this company"}, {"date": "24 Oct 2017", "title": "Clerk II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at Cambia Health Solutions", "Interview Descriptions": "I was contacted by a recruiter that had referred my resume to Cambia Health Solutions about a phone interview.  I did the phone interview and was contacted about the 2nd interview which was 2 panel. I went in, they were very welcoming and friendly and we seemed to share the same views on employee behaviors. The next day I was contacted and now I'm just waiting to start in 2 weeks after a background and drug screen approval.", "Interview Questions": "How do you handle conflict? Name a time you had to work with difficult co workers?"}, {"date": "8 Sept 2017", "title": "Temporary Enrollment Data Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Cambia Health Solutions", "Interview Descriptions": "Applied online and was then called in for an in person interview. Interview was pretty straight forward. Asked a lot of behavioral questions. By a lot I mean at least ten. Interview took 30-40 minutes.", "Interview Questions": "Name an obstacle you've experienced, and how you overcame that obstacle. "}, {"date": "5 Oct 2017", "title": "Benefits Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 4 days. I interviewed at Cambia Health Solutions (Salt Lake City, UT) in Sept 2017", "Interview Descriptions": "The interview process was great.  I actually had a phone interview and took a few assessments, before even applying for the position.  After applying for the position (which is just a formality), I haven't had any communication since.  A little frustrating.", "Interview Questions": "Tell me about your current position."}, {"date": "29 Aug 2017", "title": "Data Entry Enrollment Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Cambia Health Solutions", "Interview Descriptions": "Had a phone interview with HR. I just had a face/face interview with one person, and then someone on the phone who was in the Portland office. It was an hour interview, and a lot of behavioral questions.", "Interview Questions": "Tell me of a time you dealt with a difficult co-worker??"}, {"date": "11 Feb 2018", "title": "Project Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Cambia Health Solutions (Portland, OR) in Aug 2017", "Interview Descriptions": "There was a phone screening with an HR rep that was very excited at my background and told me that if I didn’t get this position she would keep me in mind for others as they came up.  Then another phone interview with a director, before meeting the team in a panel interview.   I hadn’t personally interviewed in many years and may not have been as prepared as I could have or should have been. Coupled with 1 particular fellow who seemed intent on making me think of specific scenarios on the spot and my mind went blank.   It was unfortunate because now when I try to apply for other similar positions I seem to get automatic rejection letters from HR without another opportunity to prove myself again even though I have over 12 years of health care project management experience.", "Interview Questions": "Describe a specific time when you had to deliver bad news to sponsor and how did you handle it?"}, {"date": "27 Aug 2017", "title": "Utilization Management RN Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Cambia Health Solutions (Lewiston, ID) in Aug 2017", "Interview Descriptions": "I had an initial phone interview with questions about myself, my experience in area of the job I applied for along with general standard questions. The questions appeared to be off a list of preselected questions for the specific position interviewing for. There were 2 people interviewing me on a telecom line. Everything was organized and professional, yet relaxed just enough to allow me to respond without being too nervous. My interviewers  repeated and explained questions as needed, and clearly answered my questions solidifying my desire to work with this company. I was told I will hear back from them one way or the other. I just had the interview so I expect to hear from them next week.", "Interview Questions": "\"Tell me an experience I had when working with others in my field, how I handled it and what was the outcome?\""}, {"date": "13 Jun 2017", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Cambia Health Solutions", "Interview Descriptions": "non technical questions, applied online, phone interview with member of team. Interviewer was very nice. Simple, transparent process overall. HR / recruiting team was open , understanding, and timely in responses.", "Interview Questions": "Tell us about yourself"}, {"date": "1 Jun 2017", "title": "Customer Service Specialist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Cambia Health Solutions (Tacoma, WA) in Jun 2017", "Interview Descriptions": "The interview process was fairly standard. There were 2 interviewers. They gave a brief description of the company and position. I took a simple computer test and answered basic interview questions.", "Interview Questions": "They asked a lot of \"Name a time that \" questions. "}], [{"date": "17 May 2017", "title": "Assistant General Counsel Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Cambia Health Solutions (Portland, OR)", "Interview Descriptions": "Very long and drawn out. Cambia does not move quickly to replace attorneys who have left the company. You will interview with a lot of people with various titles in the legal department.", "Interview Questions": "Very fact-based questioning about certain areas of law that pertain to the position you are interviewing for. "}, {"date": "23 Apr 2018", "title": "Software Engineer(Internship) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Cambia Health Solutions (Portland, OR) in May 2017", "Interview Descriptions": "The interview process was very straightforward. The recruiter had prompt responses, and I had one behavioral screening interview and one more technical interview, both on the phone, within two weeks of when they first got back to me.", "Interview Questions": "How have you applied what you've learned in your classes?"}, {"date": "15 May 2017", "title": "Software Development Engineer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Cambia Health Solutions in Apr 2017", "Interview Descriptions": "The interview process consisted of two rounds of phone interviews. \r\n\r\nThe first was a two part interview and the first was a coding interview using coderpad over the phone and the second was a Skype interview with two managers and an hr person.\r\n\r\nThe second round was a phone interview with two more managers and another hr person. This round was non technical, but I was asked about my previous projects and what technologies I've had experience with.\r\n\r\nThe entire interview was organized through and interview 'coordinator,' which made it a bit difficult send a decent thank you letter.\r\n\r\nI know I aced the technical portion...\r\n\r\nI believe I didn't receive an offer because I am not a pure CS student, and I don't have experience with higher level concepts like database use or web design. Beyond this, I believe I didn't convey thorough interest in the position--of course it's hard to be excited about a position at a company with the reviews that Cambia has.\r\n\r\nI felt I've grown a bit from the interview, but the whole process was a bit clunky, time consuming, and I feel, slightly rude. Cambia never sent me a rejection letter and simply stopped responding. To be fair though, they never said they would; simply that they would be sending out offers within a week.\r\n\r\nA bit of advice if you are applying here. For the coding portion use Python if you know it! It will greatly simplify the coding test.", "Interview Questions": "In the technical portion they asked me two questions. Both can be found on LeetCode. \r\n\r\nThe first is find the number of times a DNA sequence is repeated in a string.\r\n\r\nThe second was to reorganize an array of integers into an up down pattern. 'Wiggle Sort' on LeetCode.\r\n\r\nAll of the other questions were either non technical or about what technologies I've used."}, {"date": "1 Apr 2017", "title": "Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Cambia Health Solutions (Portland, OR)", "Interview Descriptions": "First there was a screening phone call. Then there was an invitation to interview with the hiring managers. Then there was an opportunity to interview with a panel of co-workers.", "Interview Questions": "Why do you want to work for Cambia? What drove you to apply for this position?"}, {"date": "18 Jun 2017", "title": "Associate Software Development Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Cambia Health Solutions (Portland, OR) in Apr 2017", "Interview Descriptions": "Had a 1 hour technical phone/coderpad interview and 1 hour behavioral skype interview back to back, followed by a 2nd round behavioral interview over the phone.  At this point they requested references, and an offer was made within a week.", "Interview Questions": "In the technical, given a string of words separated by one space each, reverse each word in the string in the most efficient manner."}, {"date": "9 Jun 2017", "title": "Customer Service Representative Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Cambia Health Solutions in Mar 2017", "Interview Descriptions": "First phone interview was with recruiter.  She was very professional and knowledgable about the position and company.  I made it to the second round with was a phone interview with the manager.  Both interviews were 45-60 minutes.", "Interview Questions": "Tell us an experience with a difficult caller."}, {"date": "8 May 2017", "title": "Counsel Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Cambia Health Solutions (Portland, OR) in Jan 2017", "Interview Descriptions": "Friendly interview.  Quite long interview with a lot of give and take.  No responsiveness after interview.  Sent follow up thank you letter and email.  No response, even to decline hire.  Public facing companies should follow up with all contacts.", "Interview Questions": "Why do you want to work here?"}, {"date": "29 Sept 2017", "title": "Software Quality Engineer Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 2 days. I interviewed at Cambia Health Solutions (Portland, OR) in Jul 2016", "Interview Descriptions": "Made to wait in the lobby until collected, a few minutes after my appointment time.\r\nWas led to believe I was interviewing with the hiring manager; on the elevator ride up, found out it was a panel interview with the full team of 5 people.  This is something I expect on a second interview, or after a phone screen, but it was enough to throw me off my game a bit.", "Interview Questions": "Tell us about your Java experience."}, {"date": "28 Sept 2016", "title": "Data Technology Solutions Performance Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "The process took 2 months. I interviewed at Cambia Health Solutions (Portland, OR) in Jul 2016", "Interview Descriptions": "Phone interview with HR followed by in person interview with two hiring managers that lasted an hour. Very laid back interviews. Everyone was dressed business casual.\n\nTook them over a month to get back to me, which was a bit annoying.", "Interview Questions": "If you had to figure out how to model a certain metric, like time of deliverables, what would you do to gather necessary information if data was not already available?"}, {"date": "29 Sept 2016", "title": "Data Reporting Analyst Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Cambia Health Solutions (Portland, OR) in Jun 2016", "Interview Descriptions": "This was a very intense phone interview. Up to six higher level managers were on the phone grilling me about my work experience and personality type. It was very intense for a first level interview. I didn't feel very comfortable asking specific questions about the job or team given the positions of most of the people on the phone.", "Interview Questions": "They asked specific questions about programming languages I knew. SQL, VB, VBA, etc."}], [{"date": "27 Sept 2016", "title": "Data Scientist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Cambia Health Solutions in May 2016", "Interview Descriptions": "Very quick and speedy. Took less than 2 weeks (from the first contact from the HR to the final offer letter). First call was from the HR, followed by two technical rounds on Skype. Final decision was conveyed both on email and a call from the HR.", "Interview Questions": "Basic machine learning questions about feature reduction and engineering techniques"}, {"date": "13 Jun 2017", "title": "LifeMap Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Cambia Health Solutions (Portland, OR) in May 2016", "Interview Descriptions": "It was relatively simple. I was called in a few weeks after submitting my application and met with the hiring manager. We discussed the position and she asked me questions about my experience and why I want to be an intern with this organization.", "Interview Questions": "Why do you want to be an intern at Cambia Health Solutions?"}, {"date": "30 Mar 2016", "title": "Senior Software Engineer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at Cambia Health Solutions (Portland, OR)", "Interview Descriptions": "I was contact on LinkedIn by a recruiter working for a separate company. I talked to two different recruiters (non-technical) then someone from Cambia called up to setup a phone interview. They sent me a document with some general information about the kind of questions I should be prepared to answer.\r\nThe interview was first general questions about my work experience, etc., then a technical part using coderpad.\r\nPost-interview, I never got an explicit rejection, the recruiter just never got back to me. She emailed me two days after the phone interview to say she had feedback and I called her and left a voicemail but she never called or emailed me back. I knew I hadn't been amazing in the interview so I emailed her and said that I assumed I hadn't gotten the job but would like to hear any feedback she had. I never heard back from her. Clearly, I didn't get the job but it was unprofessional not to respond to my call and emails.", "Interview Questions": "First I was asked to describe my previous work experience, what I'm looking for.\r\nNext I was asked to describe various data structures and their advantages/disadvantges.\r\nFor the coding part, using coderpad, I could use any language I liked. The question was pretty straightforward. It had to do with finding numbers in an array."}, {"date": "13 May 2016", "title": "Data Scientist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at Cambia Health Solutions (New York, NY) in Apr 2016", "Interview Descriptions": "It went very well. Two rounds of phone interview in total. And the questions are some typical machine learning. All of the interviewers are nice and patient. The first round is mainly about the resumes and some following up questions and the second round has both resume questions and basic algo&DS question. They using an online code pad which is almost a white board.", "Interview Questions": "resume questions and follow ups"}, {"date": "14 Jun 2017", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Cambia Health Solutions (Portland, OR) in Mar 2016", "Interview Descriptions": "I had two interviews. One with my (now) boss, one with (now) teammates. Pretty low pressure environment, I felt comfortable. I came overly prepared and that was impressive to them.", "Interview Questions": "Mostly about myself and past work experience. No typical, \"what would you do if...\" questions. "}, {"date": "8 Nov 2016", "title": "Agent Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 4 weeks. I interviewed at Cambia Health Solutions (Portland, OR) in Feb 2016", "Interview Descriptions": "Contacted by recruiter, set up interview. Interviewed with supervisor & lead, was offered the job a week later. Negotiated salary. They offered me 40, I wanted 42. Great experience.", "Interview Questions": "Lots of questions about dealing with agents."}, {"date": "7 Dec 2015", "title": "Legal Counsel Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Cambia Health Solutions (Portland, OR)", "Interview Descriptions": "The interview process is long and drawn out. Cambia generally doesn't make hires quickly. You can expect to be interviewed by numerous people, sometimes in teams. If you are applying for a job outside of Portland, you may be interviewed both at the job location as well as in Portland.", "Interview Questions": "Why did you chose Cambia? "}, {"date": "11 Feb 2016", "title": "Representative Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Cambia Health Solutions (Tacoma, WA) in Nov 2015", "Interview Descriptions": "The recruiters were very respectful and kind, the interview process was short and simple. The questions were basic and answerable nothing to hard. The interviewer was very precise and quick to the point. All and all, the interview was about 15 minutes give or take because there was at least 60 people who also applied for this position and the process was not to difficult.", "Interview Questions": "General Questions"}], [{"date": "15 Nov 2015", "title": "Vice President Brand Creative Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 6 months. I interviewed at Cambia Health Solutions (Portland, OR) in Sept 2015", "Interview Descriptions": "long with little communication in between.  started with a recruiter contacting me followed by a couple of phone interviews then a 1-on-1 with the CMO then a full day of meeting with senior executives and staff who would be direct reports", "Interview Questions": "How do you manage the shift from high-profile consumer brand to health insurance"}, {"date": "28 Jul 2015", "title": "Senior Analyst/Lead Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Cambia Health Solutions", "Interview Descriptions": "Standard committee interview.  Lots of questions about specific details of previous work experience, even going back 5-10 years.  Managers were open about working environment and answering questions about company history and future direction.", "Interview Questions": "Give an example of something that did not go well at your previous employer, and how would you have handled it differently?"}, {"date": "27 Sept 2015", "title": "Marketing Strategy Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at Cambia Health Solutions (Portland, OR) in Jul 2015", "Interview Descriptions": "Initial HR phone screen followed by phone screen with manager. On-site interviews with 6 additional people, 30-60 minutes long each. Appeared each person was given a range of things to explore.\r\nEveryone I met was very excited about the recent marketing re-org, the new CMO and the direction she is pursuing.", "Interview Questions": "Asked how I might approach the role - what I do in different situations, etc. They also probed on my experience and asked questions designed to determine how it would relate to the role. Most interviewers were very poker-faced."}, {"date": "11 Aug 2015", "title": "Software Engineer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 1 week. I interviewed at Cambia Health Solutions (Portland, OR) in Jun 2015", "Interview Descriptions": "Non-technical phone interview with HR, followed by an in-person non-technical interview with management. Everyone was nice and very respectful. They were curious about me as a person and how I would fit into their team.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "30 Jul 2015", "title": "Business Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. I interviewed at Cambia Health Solutions (Portland, OR) in May 2015", "Interview Descriptions": "It was a phone interview conducted in Portland, Oregon, by the Hiring Manager.  She was pleasant and personable.  It was not stressful and lasted no more than twenty to thirty minutes.", "Interview Questions": "What is your process for gathering requirements and how would you define a good requirement?\r\nWhat tools do you use to gather requirements?\r\nHow do you build relationships?\r\nWhat is your experience with Agile - if you don&amp;#039;t have it, what do you know about Agile?\r\nWhat is your experience getting from scope to requirements?"}, {"date": "22 Apr 2016", "title": "Corporate Communications Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Cambia Health Solutions (Portland, OR) in May 2015", "Interview Descriptions": "A phone interview with HR, followed by a 30-minute in person interview with department manager and a 30-minute phone interview with department director. Pretty straight forward. All interviews were 1:1. The HR phone screen was pretty detailed; they asked about salary expectations, date I could start, and asked about any upcoming vacations. Because my other interviews were pretty quick I didn't have the chance to negotiate the salary, but they offered at the top of my range so negotiation wasn't needed. The 30 minute interviews were pretty quick; I think my first one may have even been 20-25 because the manager was fitting me in between other meetings. I would have asked HR more questions if I had known my other interviews were going to be so quick (things like cost of parking, training opportunities). I think some interviews may involve a panel; I think once you get to the stage of coming in for an interview, you are just meeting with the department so it's really up to them who they include and how they structure it.", "Interview Questions": "No surprises, which I really liked. All the questions were basic and straightforward, 'Explain your experience with X' or 'What's your interest in X subject.' No wasting my time with hypothetical 'What if you were in X station' or 'Describe a time when X.'"}, {"date": "16 Oct 2015", "title": "Marketing Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Cambia Health Solutions (Portland, OR) in May 2015", "Interview Descriptions": "Applied for the position online, spoke with a recruiter, had a phone interview with the hiring manager, came in for a couple in-person  with a group and was called with an offer.", "Interview Questions": "Tell me about a time you failed and what you learned from it"}, {"date": "21 Apr 2015", "title": "Finance Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Cambia Health Solutions", "Interview Descriptions": "HR called, but some of the questions surrounding the position and culture of the group couldn't be answered by HR.  The process felt more like a sales pitch of the company instead of trying to get to know if I would be good to pass to the hiring manager.", "Interview Questions": "why are you currently looking for a different position"}, {"date": "11 May 2015", "title": "Project Administrator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Cambia Health Solutions (Seattle, WA) in Mar 2015", "Interview Descriptions": "I applied online and was contacted by a recruiter within a week for a phone interview. Soon after, an in-person interview was scheduled with a team member and the department head. The whole process was smooth and all the individuals were very friendly and professional. The interview went well, but they opted for another candidate. The time between the interview and communicating the decision was 3-4 weeks (longer than I would have liked, but understandable).", "Interview Questions": "Standard questions- nothing unexpected or out of the ordinary."}, {"date": "7 May 2015", "title": "Strategic Communications Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Cambia Health Solutions (Portland, OR) in Feb 2015", "Interview Descriptions": "In-person interview with Brand Strategy Manager and a follow-up Skype interview with the Executive Communications Manager and a PR Coordinator. Wasn't too difficult, do your research about the company and its efforts before coming in. Bring some current events about Cambia and your interviewer will be impressed with your effort.", "Interview Questions": "What's one thing you want to get better at?"}], [{"date": "29 Jan 2015", "title": "Clerk I Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Cambia Health Solutions (Tacoma, WA) in Jan 2015", "Interview Descriptions": "I got a call about a week after I applied asking to take a typing. If you past the typing test, you get to more to the interview process. The test is online and sent to you an email so you can do it on your own time. The faster you take the test; the quicker you get your results to see if you more on or not. I passed the test and got another call about a couple of days later for the interview. It was general questions for your resume and a few give example questions.", "Interview Questions": "There was no difficult or unexpected questions."}, {"date": "10 Jan 2015", "title": "Senior Enterprise Records Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Cambia Health Solutions in Sept 2014", "Interview Descriptions": "1 phone interview, which was very cursory. 1 in-person interview with hiring manager, the position's co-worker, and members of at least 2 other departments (Legal, IT) that the job collaborates with. Minimum salary was a required field on the initial online application. Everyone I met with seemed very sharp. Most seemed eager to get someone on board, but eventually the company decided not to fill the opening.", "Interview Questions": "Describe yourself in a single word"}, {"date": "15 Oct 2014", "title": "Sales Representative Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Cambia Health Solutions (Portland, OR) in Sept 2014", "Interview Descriptions": "Applied online through company website. HR contacted me to set up a phone interview, very basic/typical interview questions. The person I interviewed with was very nice and friendly. Within a week I was invited for an in-person interview and meet with a few team members and department VP. Interview was supposed to last about hour, but ended up having to wait and it ended up being over 2 hours. The in-person interview was pretty standard nothing too difficult, discussed my resume, why I want the position, where I see myself, making lots of phone calls, dealing with rejection, etc. They had a couple more interviews scheduled that week and was supposed to hear back the following Monday. Never heard back, sent a couple emails asking about any updates - still never heard back. Seemed like a pretty cool place to work, just wish I heard feedback.", "Interview Questions": "Pretty standard"}, {"date": "3 May 2015", "title": "Population Health Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Cambia Health Solutions (Tacoma, WA) in Jun 2014", "Interview Descriptions": "The complete interview process took several months, with a more intense focus over the last month or so. The time in between interviews/follow-up made me think I was not an active candidate. The first phase of the interview was with HR recruiters, then it was passed to the department. It went back to HR to give the offer and for negotiation of salary. Not all members of the interview team could meet at once and so I had to go through two separate interviews with the department heads.", "Interview Questions": "What types of public health experience do you bring?"}, {"date": "30 May 2014", "title": "Usability Position Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at Cambia Health Solutions in May 2014", "Interview Descriptions": "Received a LinkedIn (private) mail communication from their \"Talent Acquisition\" folks. Submitted resume and completed a screening call with someone from their personnel department. A phone interview with \"the hiring manager\" followed. The interviewer seemed disinterested, asked only a few general questions, and was preoccupied with what I was making now... Never heard back from anybody, despite being advised to expect otherwise.\r\n\r\nLater I learned (from a local recruiting agency) that this is pretty much \"par for the course\" with these guys, that turnover is high, and lack of organization is endemic. Sometimes not following through can be a blessing... for the applicant!", "Interview Questions": "N/A"}, {"date": "28 Jan 2018", "title": "Senior QA Engineer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. The process took 5 days. I interviewed at Cambia Health Solutions (Portland, OR) in May 2014", "Interview Descriptions": "It went quick and easy. Based on another hired members they have been hired even without minimum practice or skills in required technology. As a result be prepare to work with different level of colleagues.", "Interview Questions": "What is the WSDL and how it works?"}, {"date": "4 Nov 2015", "title": "Accountant II Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 3 weeks. I interviewed at Cambia Health Solutions (Portland, OR) in May 2014", "Interview Descriptions": "Cambia provided the worst overall interview experience I ever had and is a great lesson in disrespect to applicants.  \r\n\r\nThe process started when I applied through a recruiter and did my phone interview through them.  The opportunity then popped up with Cambia and they invited me onsite.\r\n\r\nThis initial interview with Cambia was a huge a waste of time.  Before I even got the chance to speak with anyone and actually ask any questions about the job, I was sent in for 1 hour assessment where I had to research and write some accounting guidance.  After this, I had a 1 hour interview with HR (who was 20 minutes late) that dove right into asking me all about my history.  At about the 2 hour mark of my experience I finally get the chance to ask: \"It seems that the job description is all encompassing for all of your accountants, which specific job am I interviewing for?\"  The answer I received was along the lines of: \"I can't really say, there's a few openings right now and I'll let the managers decide which one best suits their needs.\" I just spent over two hours interviewing and writing an assessment for a job, and HR couldn't answer which job I was applying for?  I felt Cambia was showing that they assumed I wanted to work for them rather than trying to convince that this was a good partnership as much as I was trying to convince them.\r\n\r\nThey call me in for a second interview.  I came back in a week later, and the interviewer showed up over a half hour late.  When he did finally arrive, I received no apology or recognition of the late arrival.  He asked for a copy of my resume and took about 30 seconds to read through it making it apparent that he hadn't prepared.  What followed were some watered down versions of the questions I received in the initial interview, except this one only lasted 15 minutes because the interviewer had to be somewhere.  I had a few minutes to try and sneak some of my own questions in there, and again was told they were hiring for multiple positions in the accounting department and he couldn't tell me which one exactly they needed.  I did receive a bit of clarity on which positions they were looking for, but he didn't seem at all concerned about which one I was most interested in.  \r\n\r\nCambia called me back for a third interview.  At this point, I was 99% sure that even with an offer I would not work for them.  I decided to take the interview because when you're unemployed you have the time to see if there may be something to that 1% and feel ok being brutally honest in your interview.  The third interview started very well as the interviewers actually showed up on time (there's a first time for everything!).  I was interviewed by two managers and they opened the interview explaining in full detail what job opportunities they were looking to fill, asking me my opinion on the whole matter and what position sounded most intriguing to me.  They even gave me the chance to meet and talk with some other people in the department.  I had a lovely time and found that 1% chance steadily rising with every minute.  Towards the end of the interview, I decided to be brutally honest and explain how I thought their whole interview process, prior to that day ,made me feel upset for reasons of not respecting my time and also not making me feel like my opinion mattered.  I asked if this type of attitude would role over into my day to day at Cambia.  The two interviewers, at the time, handled it like champs!  They said they appreciated my honesty and said they would take it to into consideration for further interviewers and assured me that it was not the attitude that would be in the day to day.  I was so impressed that two people I could potentially be reporting to were ok with me being honest and critiquing a process and I thought, \"These are the kind of leaders I want to work for!\"\r\n\r\nThe next day I got a call back from my recruiter who told me Cambia was going to send me an offer!  I was looking forward to seeing what exactly they were going to offer.  A few days later, my recruiter called me back and told me that Cambia withdrew their offer specifically because I had questioned their interview process.  The exact question I asked that made me want to work for Cambia was the exact reason why Cambia didn't want me to work for them.\r\n\r\nI'm still not exactly sure what happened.  Did my recruiter lie to me?  Why did Cambia say no after saying yes?  It's not like I asked the question after the interview.  I'm not sure but the way I see it is that Cambia couldn't show up on time, initially made no effort to convince me that they were the right fit for me, they were looking for a yes man, and they withdrew an offer.  If that last part was on the recruiter, then I still hold Cambia responsible as their recruiters represent them.  \r\n\r\nI e-mailed the last two managers at Cambia to find out what happened and I never received an answer.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "10 Mar 2014", "title": "Senior Analyst/Lead Analyst Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. The process took 3 months. I interviewed at Cambia Health Solutions", "Interview Descriptions": "Initial Interview via phone with HR, intial interview via phone with hiring manager, Inp erson interview with hiring manager. Offer", "Interview Questions": "nothing out of the ordinary"}, {"date": "22 Jan 2015", "title": "Software Developer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Cambia Health Solutions in Mar 2014", "Interview Descriptions": "Most rigorous interview process I have ever been through - not the most technically difficult but there were a lot of hoops to jump through.  I started by submitting an application via the company website.  This is a little bit of a black hole.  There was no way to include a cover letter.  Once the application was sent there was no way to contact the company or get an idea of the application status.  I had preliminary phone calls with HR, then moved on to a phone interview with management.  Next I had a coding exercise to do at home followed by 2 in person interviews.  Then I received an offer contingent on a background check and drug test.", "Interview Questions": "The most difficult question focused on improving performance of ORM queries"}, {"date": "19 Jun 2015", "title": "Process Improvement Analyst Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Cambia Health Solutions (Portland, OR) in Mar 2014", "Interview Descriptions": "very bad. HR didn't even interview me, only my future boss who was let go 3 months later.\r\nThey promised me a moving package which instead of being given to me before the job to help with the moving cost, it was given almost two months after where I was desperate for that money, and that is because I kept asking and pushing for that money", "Interview Questions": "the tradional resume follow up questions"}], [{"date": "27 Oct 2018", "title": "Software QA Engineer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Cambia Health Solutions (Portland, OR) in Mar 2014", "Interview Descriptions": "Mass interview with 10 plus people. There was no specific questions just a round table with 10 people all asking questions. Mass interview with 10 plus people. There was no specific questions just a round table with 10 people all asking questions. Mass interview with 10 plus people. There was no specific questions just a round table with 10 people all asking questions. Mass interview with 10 plus people. There was no specific questions just a round table with 10 people all asking questions.", "Interview Questions": "Software related questions, mostly for trouble shooting"}, {"date": "24 Feb 2014", "title": "Product Manager I Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Cambia Health Solutions", "Interview Descriptions": "Over the phone and in-person interview.", "Interview Questions": "The usual interview questions. Just be prepared to answer anything and be likeable."}, {"date": "13 May 2016", "title": "Associate General Counsel Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Cambia Health Solutions (Portland, OR) in Dec 2013", "Interview Descriptions": "Standard phone interview.  I was referred to the position by a friend.  I was contacted by someone in human resources and they asked that I fill out the online application after we discussed the position. I followed up 3 weeks later and ultimately received an e-mail telling me that they had decided to work with other candidates.", "Interview Questions": "Please tell us about your background. The person interviewing went through my entire application with me."}, {"date": "26 Nov 2013", "title": "BSA Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Cambia Health Solutions (Portland, OR) in Nov 2013", "Interview Descriptions": "Applied and 3-4 weeks later received a call for a phone interview. They changed the phone interview the day before and asked that I come in. Interview was short and sweet, mainly focused on my history and skills. No behavioral type questions. Interview was with director and manager. I regret not asking about pay scale sooner as they do a credit check, background check, education verification, and call all references before even giving an offer.", "Interview Questions": "They didn't ask any questions outside of what was on my resume"}, {"date": "7 Nov 2013", "title": "Marketing Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Cambia Health Solutions (Portland, OR) in Nov 2013", "Interview Descriptions": "The initial interview I had was pretty straightforward to see if I had the qualifications for the job, they wanted to know my work history and they asked about my current salary.", "Interview Questions": "She asked me the definition of the job title, what it meant to me philosophically."}, {"date": "14 Aug 2013", "title": "Business Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Cambia Health Solutions (Portland, OR) in Jun 2013", "Interview Descriptions": "Applied online, HR set up interview with hiring manager.", "Interview Questions": "How would you mentor a group of employees that didn't report directly to you?"}, {"date": "15 May 2013", "title": "Director of Product Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 months. I interviewed at Cambia Health Solutions", "Interview Descriptions": "A long drawn out process as the team is really trying to ensure that they hire the right fit for the organization.  Interviewed with 8 people and spent a total of 9 hours interviewing for the position spread over 2 months.  This included three phone interviews, four in-person interviews (3 had 2 people in each), and a less formal lunch follow up interview.", "Interview Questions": "They were looking for specific examples on how to measure success without hard numbers."}, {"date": "5 Feb 2017", "title": "Utilization Review Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Cambia Health Solutions (Portland, OR) in Apr 2013", "Interview Descriptions": "Phone interview ask behavioral questions, commitment, went over core values. They were the typical interview questions that most companies ask. The interview was relatively an easy process. I was already working there so I knew a lot about the company. Reasearch the company as with any interview.", "Interview Questions": "How have you handled a time you did not agree with your supervisor?"}, {"date": "1 Feb 2017", "title": "Accountable Care Team Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Cambia Health Solutions (Seattle, WA) in Mar 2013", "Interview Descriptions": "Initially, I applied online and was screened for qualifications over the phone by human resources. They passed my information to to the team. Who conducted two interviews- One in person and one over the phone", "Interview Questions": "My previous experience working within the health insurance industry"}, {"date": "5 Dec 2012", "title": "QA Intern Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Cambia Health Solutions (Portland, OR)", "Interview Descriptions": "on campus interview --- mostly behavior questions and some technical questions regarding using java language", "Interview Questions": "overall is not difficult "}], [{"date": "19 May 2014", "title": "Senior Strategic Financial Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Cambia Health Solutions (Portland, OR) in Feb 2012", "Interview Descriptions": "One phone interview with manager. it was general and talked about how the company is changing and the team and its' needs. the role was to be fluid.  One onsite interview with same manager and director.", "Interview Questions": "- very detailed questions about financial knowledge, how to build a model, and name a time when questions"}, {"date": "4 Jan 2013", "title": "Business Intelligence Developer Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Cambia Health Solutions (Seattle, WA) in Jan 2012", "Interview Descriptions": "One brief phone call followed by negotiation on salary and benefits.", "Interview Questions": "None"}, {"date": "27 Nov 2013", "title": "Accountant II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Cambia Health Solutions (Seattle, WA) in Oct 2009", "Interview Descriptions": "Formal first interview with hiring manager. Then had an informal interview with the team and manager.", "Interview Questions": "Understanding what the actual job duties entailed."}]]