[[{"date": "2 Jul 2023", "title": "Surgical Technologist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through other source. I interviewed at Overlake Medical Center and Clinics (Bellevue, WA)", "Interview Descriptions": "No response. You won’t hear from them. Not even a email confirmation. Months later you will get a response that the position has been canceled. It’s disappointing and had so much hope.", "Interview Questions": "There was no questions. None was given"}, {"date": "1 Jun 2023", "title": "Communications Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Overlake Medical Center and Clinics (Bellevue, WA) in Mar 2023", "Interview Descriptions": "I was interviewed twice by the HR representative, one interview with the hiring manager, and one interview with the team. After each interview, the HR representative emailed me asking for feedback, which I provided. So, that is several hours of preparation, responding to emails and participating in the interviews. That doesn't include the time spent applying for the job. The HR representative called me after the interview with the team and left me a voicemail saying she wanted to talk to me about the position. I called her back a couple of times, but she never returned my calls, even though I was returning her call to me. I know not everyone is a good fit for potential job opportunities, and people are busy these days. But it really doesn't take more than 30 seconds to send a simple email to inform an applicant that the organization is going in a different direction. It would be understandable if it had been just one or two interviews. But four, plus follow-up emails? I find that quite unprofessional and surprising coming from a well-known and established organization in the region.", "Interview Questions": "Why do you want to work here? Describe your experience? Experience with DEI?"}, {"date": "12 Oct 2022", "title": "Certified Medical Assistant (CMA) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Overlake Medical Center and Clinics (Issaquah, WA)", "Interview Descriptions": "Went well very nice on video chat it wasn’t to long of an interview started well and ended well would interview again was interviewing by two mangers I was able to ask questions", "Interview Questions": "How many doctors are on staff and if they have RN as well on staff"}, {"date": "7 Sept 2022", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Overlake Medical Center and Clinics", "Interview Descriptions": "Screening interview> team interview> On site meeting with providers & staff. Plenty of opportunity to ask questions and learn more about the opportunity.  Was a mix of phone / virtual / and in person.", "Interview Questions": "What interests you about the position and Overlake?"}, {"date": "28 Jan 2022", "title": "Surgery Tech Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Overlake Medical Center and Clinics", "Interview Descriptions": "Pretty typical  and  straight forward. It was very easy to talk. I appreciated that this was done as a Teams visit initially.  I would recommend them to potential job seekers.", "Interview Questions": "N/A"}, {"date": "8 Jan 2022", "title": "PCR Technician Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Overlake Medical Center and Clinics", "Interview Descriptions": "Phone interview,  and in person view was great \r\nFriendly staff who wanted to know me and understand my career goals \r\nI enjoyed the conversation with the supervisor and the staff", "Interview Questions": "Great questions about my career goals "}, {"date": "8 Dec 2021", "title": "Systems Analyst Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Overlake Medical Center and Clinics (New York, NY) in Nov 2021", "Interview Descriptions": "Initial virtual interview was smooth. Flew into Seattle for \"in-person\"  interview with a panel of 9 people 2 in-person 7 virtual I could tell they had not spoke with each other before the interview. Was asked highly inappropriate questions from thier interim systems analyst or questions directly from the hyland website. At least 3 people  left and came back.. After an hour and and a half the the manager came in and tried to steer the interview back on the rails.", "Interview Questions": "I noticed your current manager is not on your references  why not? can I speak with your current manager?"}, {"date": "26 Nov 2020", "title": "RN Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Overlake Medical Center and Clinics", "Interview Descriptions": "One application and one interview was required. They were easy to schedule with and very kind and accommodating  with my schedule. It was a straightforward interview process. However for a residency it is competitive", "Interview Questions": "Name a time when you had to act quickly "}, {"date": "24 Feb 2021", "title": "Hospitality Staff Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Overlake Medical Center and Clinics (Bellevue, WA) in Oct 2020", "Interview Descriptions": "Interview in person, very engaging and breaks the ice so you’re not so nervous. It was about 1 hour or so can they gave you a tour of the kitchen a little after", "Interview Questions": "Why do you want to work here?"}, {"date": "17 Sept 2020", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Overlake Medical Center and Clinics", "Interview Descriptions": "Online application.  Phone interview with HR, phone interview with manager,  panel interview in person.  Various questions about nursing background and experience, work style, expectations for role.", "Interview Questions": "Tell us about yourself and your nursing career."}], [{"date": "11 Sept 2020", "title": "Patient Care Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Overlake Medical Center and Clinics (Bellevue, WA) in Aug 2020", "Interview Descriptions": "I applied online. Had a phone interview with recruiter, then an onsite interview with nurse managers for two floors that had open PCT positions. both were super nice, and recruiter was helpful and responsive. my interview was onsite since I worked at overlake already in a different role, but I think a lot of interviews have been virtual during covid.", "Interview Questions": "tell me about a time when your attention to detail helped catch an error\n3 strengths and 3 weaknesses"}, {"date": "21 Aug 2020", "title": "Patient Service Representative Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Overlake Medical Center and Clinics (Seattle, WA) in Aug 2020", "Interview Descriptions": "The interview process overall was average. It was not intimidating or pressuring at all. Simple interview and resume questions. The interview process was very quick about 30 or so minutes on the phone.", "Interview Questions": "Why did you apply to this specific position?"}, {"date": "19 Sept 2019", "title": "Clinical Laboratory Scientist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Overlake Medical Center and Clinics", "Interview Descriptions": "Fairly straight forward interview process. Applied job online through their website. After a week received a phone call from a recruiter and scheduled an onsite interview.  The whole process took less than a month.", "Interview Questions": "Please tell how do handle a situation when....?"}, {"date": "10 Sept 2019", "title": "Hospitality Representative Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Overlake Medical Center and Clinics", "Interview Descriptions": "The interview was very good. Gave me a good impression of the company. This company cares about their employees and that was very obvious through the interview. Overall it’s a great company to work for.", "Interview Questions": "Why do you want to work here? "}, {"date": "12 Jul 2019", "title": "Surgery Scheduler Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Overlake Medical Center and Clinics (Bellevue, WA)", "Interview Descriptions": "I had a positive experience at my interview, great questions and information regarding the position. The interviewer also showed me around the office and introduced me to the staff. I was not made an offer but have been called back for a second interview.", "Interview Questions": "How do you handle difficult patients."}, {"date": "6 Mar 2021", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Overlake Medical Center and Clinics (Bellevue, WA) in Jan 2019", "Interview Descriptions": "My interview was very casual. Had a panel of 3 people and they all asked routine questions regarding various scenarios in patient settings, coworkers,  conflict management and a few questions about personality.  I felt very comfortable during the process and got the job the same day!", "Interview Questions": "What was your greatest failure?"}, {"date": "16 Oct 2018", "title": "Pharmacist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Overlake Medical Center and Clinics in Sept 2018", "Interview Descriptions": "Contacted by recruiter the day after I turned in my application.  I was asked to fill out extra forms and take a survey.  Got an interview and the team was really nice.  It was about an hour long.  They had 4 people in the panel", "Interview Questions": "Tell me about yourself"}, {"date": "22 Jul 2019", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. I interviewed at Overlake Medical Center and Clinics (Bellevue, WA) in May 2018", "Interview Descriptions": "The interview began with a short call from the recruiter and the I interviewed with the manager. The final interview was a one on one and it was quite short. The questions were easy", "Interview Questions": "Why should we hire you "}, {"date": "5 Feb 2019", "title": "Medical Imgaing Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Overlake Medical Center and Clinics (Bellevue, WA) in Apr 2018", "Interview Descriptions": "Email from HR, complete self assessment, contact you for interview, then panel interview l. Within 2 weeks. HR rep was very helpful she gave me advice on before the interview. After the interview we did a tour around the hospital and to the different moldalities.", "Interview Questions": "Why do you want to work here? Name a time you have a work place conflict how did you handle it"}], [{"date": "15 Nov 2017", "title": "Scheduling Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Overlake Medical Center and Clinics", "Interview Descriptions": "I've applied online, 7-10 days later I received a call from HR person. After regular phone screening (several hours later) I was invited to onsite interview.  Communication with HR was really nice and effective.", "Interview Questions": "How would you react if your manager will ask you to do something strange, unusual, something that is not your job responsibilities?"}, {"date": "23 Oct 2017", "title": "Licensed Practical Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Overlake Medical Center and Clinics", "Interview Descriptions": "It was a typical nursing interview. The staff that interviewed were very welcoming. It was with only 2 people so it made it a bit easier than some of the group interviews that I had. The interview took about a total of 40 minutes.", "Interview Questions": "How I handle stree from work at home."}, {"date": "27 Aug 2018", "title": "Patient Account Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Overlake Medical Center and Clinics (Seattle, WA) in Oct 2017", "Interview Descriptions": "Hiring process took almost weeks from the time I applied to the time I got offer letter.Was easy but took long time for the process of interview.It was initially phone interview and then scheduled panel interview.", "Interview Questions": "Tell me about yourself,Insurance experience related questions.Clearly explained me what the role is and their expectations are."}, {"date": "9 Jul 2017", "title": "PT Tech Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Overlake Medical Center and Clinics (Bellevue, WA)", "Interview Descriptions": "Submitted cover letter and resume for a position posted ~2 weeks previously.\r\nCompleted work style survey.\r\nCompleted phone introduction with HR and personal interview at the Hospital.\r\nToured the department areas, saw a few staff.", "Interview Questions": "After a verbal clinical quiz and a behavioral scenario questions\r\nThe final question:\r\nDirector: Do you affirm you can perform this job without modifications?"}, {"date": "10 Jan 2017", "title": "Blood Bank Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Overlake Medical Center and Clinics (Seattle, WA) in Dec 2016", "Interview Descriptions": "I submitted an online application and was contacted by a recruiter. The recruiter had me fill out a standardized survey. However, the survey had a lot of weird questions which made me stop perusing the position. \r\n\r\nExamples were things like \"Do you have trouble sitting still?\" I'm not sure how this is relevant, and many people have trouble sitting still (do to their federally protected disabilities). If I had selected 1 would that disqualify me from the position? Lots of concerns here.", "Interview Questions": "It mostly generic questions like \"Do you like working on a team?\" "}, {"date": "3 Nov 2016", "title": "EKG Tech Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Overlake Medical Center and Clinics (Bellevue, WA)", "Interview Descriptions": "Review of application, experience, resume. Questions about relevant experience. Discussion of job and dept. duties and how you would fit into the system. Discussion of EKG process. Rhythm recognition and lead placement test.", "Interview Questions": "Are you comfortable dealing with a diverse variety of patients?"}, {"date": "8 Mar 2019", "title": "Certified Nursing Assistant CNA Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 3 weeks. I interviewed at Overlake Medical Center and Clinics (Bellevue, WA) in Jun 2016", "Interview Descriptions": "Very thorough with the interview, they make sure that we're comfortable and they appreciate our time. As always, they are pretty busy, but I am impressed with their commitment to recruiting new people.", "Interview Questions": "What do you hope to achieve as a CNA?"}, {"date": "8 Sept 2015", "title": "Patient Care Technician Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Overlake Medical Center and Clinics (Bellevue, WA) in Aug 2015", "Interview Descriptions": "Received an email from HR requesting to schedule an interview with the Nurse Manager. Went in for the interview, interviewed with a fellow PCT, Charge Nurse and the Nurse Manager, toured the unit and the interview took about 35 minutes.", "Interview Questions": "They asked questions about HiPPA, patient safety, teamwork and organization."}, {"date": "11 Feb 2016", "title": "Nursing Technician Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Overlake Medical Center and Clinics (Bellevue, WA) in Jun 2015", "Interview Descriptions": "I applied online, the nurse recruiter called me, we set up an interview. The online instructions specifically said *not* to bring a copy of my resume. I followed these instructions. Upon sitting down with the manager - who was very friendly and professional - she asked for a copy of my resume. Yes, I'm an idiot, and I should've brought a copy anyway - but seriously? \r\n\r\nThe interview itself featured literally zero questions. Just the opening \"Tell me about yourself.\" Other people I know applied for the position and had the exact same experience. It was a colossal waste of everyone's time and energy, and I was extremely disappointed.  \r\n\r\nTheir website also specifically says that you will be notified if you are not accepted for a position. This never happened.", "Interview Questions": "Tell me about yourself."}, {"date": "26 Apr 2016", "title": "Patient Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Overlake Medical Center and Clinics (Issaquah, WA) in Jun 2015", "Interview Descriptions": "Interview was very easy and it went really smooth. Arrived 2 hours before and was interviewed and was told I would get a phone call later in the day if I got the job. Got a phone call later in the day that I got the job and started my paperwork.", "Interview Questions": "Tell me about a time you had a problem with another employee and how you handled it?"}], [{"date": "26 May 2015", "title": "Professional Administrative Role Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Overlake Medical Center and Clinics (Bellevue, WA)", "Interview Descriptions": "Overlake uses behavioral-based interviewing so go in prepared to give examples from your prior work.  I had a phone interview with HR first, then an in-person interview with the hiring manager.  I went back for a group interview.  I wore a suit but I think a \"business professional\" look would've been ok, too.  People were friendly.", "Interview Questions": "Tell me about a situation with a difficult person you encountered at work and how you handled the situation."}, {"date": "5 Mar 2015", "title": "Project Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Overlake Medical Center and Clinics (Bellevue, WA) in Feb 2015", "Interview Descriptions": "Phone Interview took about 30 minutes.  The hiring manager gave an overview of the position and the company itself.  The manager also asked a series of standard questions regarding management style, asking me to describe different situations and scenarios that took place in my previous work and how I handled each situation.", "Interview Questions": "How I would handle a situation where two co-workers had different opinions regarding a topic or situation that is work related."}, {"date": "10 Mar 2015", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Overlake Medical Center and Clinics (New York, NY) in Feb 2015", "Interview Descriptions": "I received a phone call for an interview, I went to my interview within a week. Same day of interview I received phone call about checking my references. Three days later I got the phone call that I got the job. Quick an easy process", "Interview Questions": "What did you like about school the most?"}, {"date": "27 Jan 2016", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Overlake Medical Center and Clinics in Oct 2014", "Interview Descriptions": "Manager was very friendly and not intimidating. He gave me a tour of the unit, introduced me to other employees and answered all of my questions. He helped me to feel confident that I would learn all that I needed to in order to succeed as a new critical care nurse. Nurse educator was also very supportive when I was first new to the unit.", "Interview Questions": "How can I be a strong member of the team that encourages others to provide excellent care."}, {"date": "19 Aug 2014", "title": "Health Information Management Technician Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Overlake Medical Center and Clinics (Bellevue, WA) in Jul 2014", "Interview Descriptions": "Applied online and was contacted by a regular staff worker two weeks later. An interview was requested with the HIM manager, but had to be conducted within two days. This was very short notice. 1:1 interview with HIM manager was in her office. There were about 20 difficult questions that assumed working experience in this field. Several questions were odd and probably not part of the \"script\" the manager was supposed to follow.\r\n\r\nA group interview was supposed to occur next, but I wasn't selected to continue in the process.", "Interview Questions": "What are the circumstances in which you would violate policy?"}, {"date": "12 Dec 2018", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Overlake Medical Center and Clinics in Jun 2014", "Interview Descriptions": "clinic supervisor interviewed me after we exchanged emails. Before the interview I also talked to her over the phone. The interview was short. After the interview she explained to me what the next step will be.", "Interview Questions": "why should we hire you "}, {"date": "15 Mar 2018", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 months. I interviewed at Overlake Medical Center and Clinics (Bellevue, WA) in Mar 2014", "Interview Descriptions": "The interview process was long and had difficulties with the communication from Human Resources.  Once I was selected as a candidate the process continued to have delays with response from HR.  The hospital onboarding was very challenging.  As a new Manager I was left to onboard myself.  I think they have made some improvements in the interview process, but onboarding really needs some improvements.", "Interview Questions": "Why Overlake?"}, {"date": "11 Mar 2014", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at Overlake Medical Center and Clinics (Bellevue, WA) in Feb 2014", "Interview Descriptions": "One interview, nurse manager was very congenial and offered me the position on the phone.", "Interview Questions": "N/A"}, {"date": "11 Jan 2014", "title": "Patient Care Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Overlake Medical Center and Clinics (Bellevue, WA)", "Interview Descriptions": "Very Positive experience. Brought in for initial interview, invited back for second team interview. Very informative, offered opportunity to learn a ton about position. Inviting team that seemed to really care about finding the right \"fit\". Communication with HR was fantastic!", "Interview Questions": "Just was very shocked at their transparency (seemed very open and honest about challenges of position). I am not use to this. Team seemed really interested in my thoughts and opened the floor for my questions."}, {"date": "1 Jan 2014", "title": "Medical Technologist Microbiology Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Overlake Medical Center and Clinics (Bellevue, WA) in Oct 2013", "Interview Descriptions": "Easy and straightforward. I had applied several times in the past but I after I did what they told me to do I was offered the position.", "Interview Questions": "Gave me a micro test about the biochemical and morphological characteristics of several organisms."}], [{"date": "24 Oct 2013", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Overlake Medical Center and Clinics in Sept 2010", "Interview Descriptions": "One interview - I knew the manager previously so the interview was not stressful.", "Interview Questions": "How long can you commit?"}, {"date": "14 May 2013", "title": "Patient Care Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Overlake Medical Center and Clinics in Mar 2010", "Interview Descriptions": "Called from HR, scheduled interview with unit nurse manager. Met nurse manage in ED waiting area, then toured unit. After tour went into his office where he asked me questions.", "Interview Questions": "Don't Remember :/ mostly typical basic interview questions. nothing from left field"}]]