[[{"date": "22 May 2023", "title": "Associate Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of West Florida (Pensacola, FL)", "Interview Descriptions": "It was a series of interviews - a group interview (with the existing staff), and then a few one-on-one interviews with a few individuals (my direct supervisor and the director), and then another group interview (with other staff within the division that collaborate regularly with the office).", "Interview Questions": "Time management strategies, communication/presentation skills and experiences, teamwork/collaboration"}, {"date": "29 Jan 2023", "title": "Diversity and Inclusion Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of West Florida", "Interview Descriptions": "Straight forward process, polite and easy to follow application and resume review. Overall a good experience although did notcrecieve the position. I would try again for a different position here.", "Interview Questions": "What is a time you had s challenge?"}, {"date": "30 Jul 2022", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of West Florida", "Interview Descriptions": "What can you do? What can you offer? Figuring out how well I can be utilized through specialization. Fairly good college to work for. Engaged. College of Health is where I worked.", "Interview Questions": "What can you do? What can you offer?"}, {"date": "19 Aug 2021", "title": "Assistant Director, Annual Giving Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of West Florida (Pensacola, FL)", "Interview Descriptions": "The first interview was with a panel of people from various departments. The second interview was with the person who I reported to after I accepted the position. The interview questions were challenging but fair. Everyone was friendly and warm.", "Interview Questions": "Where do you see yourself five years from now?"}, {"date": "27 Jul 2021", "title": "Head of Circulation Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of West Florida", "Interview Descriptions": "Very meaningful, met with team. Had interview with admin and other librarians. It was a good place to work and I enjoyed my time there.  This is a great team. Very interesting work environment, lots of innovation and caring.", "Interview Questions": "Past experience, future goals, how many folks I've managed in the past"}, {"date": "8 Jun 2021", "title": "Senior Accountant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of West Florida", "Interview Descriptions": "Required to complete a task in Excel and return the file before your interview date.  The interview was conducted over Zoom with four people from the office.  They asked the usual interview questions.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "5 Oct 2020", "title": "Assistant Professor Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I applied online. The process took 2 days. I interviewed at University of West Florida (Pensacola, FL)", "Interview Descriptions": "People were openly critical of their colleagues and there was a strong impression of dysfunction throughout the institution.  A handful of people seem quite nice, but there unfortunately seems to be a toxic work environment that causes a lot of whispers and eye rolls in the hallways.", "Interview Questions": "Some deeply personal questions were asked that are not typical of faculty interviews."}, {"date": "28 Nov 2018", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of West Florida", "Interview Descriptions": "During the interview 3 people (office manager, direct supervisor, and associate director of our department) asked me a serious of behavioral and professional questions in which they were able to establish that I was best suited for the position. They assessed my soft skills and asked me about my experiences as listed in my resume.", "Interview Questions": "What is your greatest weakness?"}, {"date": "2 Oct 2018", "title": "Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of West Florida", "Interview Descriptions": "They conduct a phone and in person interview with a committee of people. This committee then meets to discuss your qualifications. Then you receive a call with an offer pending background check", "Interview Questions": "Why do you want this job. "}, {"date": "20 Oct 2018", "title": "TEEL Program Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at University of West Florida (Pensacola, FL) in Oct 2018", "Interview Descriptions": "I actually went in for a possible adjunct professor, later down the road.  Discussed my experiences and qualifications and was offered the position immediately.  I realized I would be able to consolidate a lot of people doing different parts of ONE job.  I also discussed that I would take over the TEEL UWF Page and start the Mentoring Program.  So far I have been given a lot of free range, and I am doing the research, so I can properly set up an excellent program.  That takes time, and research.", "Interview Questions": "She told me they were trying to hire a program coordinator for their TEEL program.  The more she told me the more interested I became."}], [{"date": "16 Feb 2022", "title": "IT Help Desk Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at University of West Florida (Pensacola, FL) in May 2018", "Interview Descriptions": "Great process and team as I learned IT skills across multiple divisions. Couldn't have asked for a better first job in technology. Very thankful for the opportunity to work here", "Interview Questions": "not applicable at this time "}, {"date": "19 Dec 2017", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at University of West Florida", "Interview Descriptions": "Applied on uwf website, created a resume, cover letter and reference sheet. Later did an interview with a group panel.  The process took a long time, but overall was worth it. Ended up getting half of my tuition paid for.", "Interview Questions": "What is my biggest flaw"}, {"date": "9 Dec 2017", "title": "Postdoctoral Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at University of West Florida", "Interview Descriptions": "After the initial application then a phone interview. A few days after the phone interview I was invited for an onsite interview where I presented my work from my past projects.", "Interview Questions": "Why are you interested in this position and what do you hope to achieve from this position."}, {"date": "10 Mar 2017", "title": "Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 4 months. I interviewed at University of West Florida (Pensacola, FL)", "Interview Descriptions": "I was contacted by someone I knew at a federal agency and invited to apply for a position.  The person I knew had recommended me for the position after HR had asked the person for recommendations for the position.", "Interview Questions": "Describe your prior work experience involving the type of work with the vacant position."}, {"date": "3 Jan 2018", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 3 days. I interviewed at University of West Florida (Pensacola, FL) in Jan 2017", "Interview Descriptions": "I was already a graduate student there, and when a faculty member heard about a graduate assistantship opportunity outside of the department, she recommended me for it. I went in for my interview, which was low-stress and the woman was incredibly kind, and got the job that day.", "Interview Questions": "What hours would you be available to work (around classes)?"}, {"date": "28 Aug 2020", "title": "Marketing Coordinator Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at University of West Florida (Pensacola, FL) in Jul 2016", "Interview Descriptions": "I was interviewed by a committee of employees with similar roles in other departments and the supervisor. I then had to give a presentation to that committee and the entirety of the staff for the department explaining my qualifications and presenting speculative work on an upcoming project.", "Interview Questions": "What are your qualifications?\r\nWhat would you change about the marketing that is currently underway?"}, {"date": "1 Jul 2016", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at University of West Florida (Pensacola, FL) in Jan 2016", "Interview Descriptions": "Must talk with department recruiter or entrance personnel.  Then wait about a week to get a phone call or email to come in and meet the professor.  Interview with the professor and if your skills and interest align a verbal offer is made at that time. Then you communicate with HR to get into the system for payroll which is about 2 weeks.", "Interview Questions": "What's your greatest weakness?"}, {"date": "27 Apr 2016", "title": "Coordinator of Career Services Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of West Florida (Fort Walton Beach, FL) in Sept 2015", "Interview Descriptions": "The position was advertised through the university's joblink. I was notified by email when my application was accepted.  The chair of the hiring committee called within 72 hours of the close of the post to set-up a phone interview. Four individuals asked one question each. The phone interview lasted less than 15 minutes. The chair called me back within 48 hours to set up an on-campus interview. The interview consisted of all four committee members asking two questions each. The interview concluded with an exit interview with the executive director.  I received a job offer within 48 hours.", "Interview Questions": "How flexible are you with the work schedule, being this is a branch campus that caters to non-traditional students?"}, {"date": "24 Jul 2014", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at University of West Florida", "Interview Descriptions": "must be recommended by professor.  single interview with department graduate assistant mentor.  Must be enrolled student and have B average.  must be recommended by professor.  single interview with department graduate assistant mentor.  Must be enrolled student and have B average.", "Interview Questions": "N/A"}, {"date": "26 Mar 2016", "title": "TS Skills Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 2 days. I interviewed at University of West Florida (Pensacola, FL) in Jan 2014", "Interview Descriptions": "The interview process was not that difficult. It started with receiving a mass email looking for students willing to help with a program that taught middle school students about engineering and robotics. I replied to express my interest and then I met with the faculty in charge of the program.", "Interview Questions": "The questions were mostly just regarding how far along in my major I was. If I was comfortable explaining programming to people and if I could explain how basic arduino projects worked."}], [{"date": "19 May 2013", "title": "Building Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at University of West Florida (Pensacola, FL) in Apr 2013", "Interview Descriptions": "Hiring process was very easy and streamline. After the application was submitted the company emailed me with a info session time to provide me more information about the organization structure. \r\n\r\nInterview was team based, which you had to work with other people to solve problems.", "Interview Questions": "How can you change the culture of people being on their cellphones during work. "}, {"date": "21 Apr 2016", "title": "Office Administration Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 3 days. I interviewed at University of West Florida (Pensacola, FL) in Sept 2012", "Interview Descriptions": "Was brought into a room with 5 people in it. They asked me questions and asked me about my self and then shoot my had as I left. It went really well and I had a good feeling about the position and I felt as theough they were able to see that I was good fit for them as well", "Interview Questions": "What kind of computer data base knowlege I had"}, {"date": "21 Sept 2015", "title": "Resident Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of West Florida (Pensacola, FL) in Mar 2012", "Interview Descriptions": "The interview was conducted by one professional staff member and one other resident assistant who had been in the position for at least a year. It consisted of being asked pretty standard questions about your experience in housing and what made you want to apply for the job. Why you thought you would be good for the position and what you thought you could bring to the table to improve a staff. There was also a heavy emphasis on character and personality during the interview.", "Interview Questions": "Why do think you would be a good fit for this position?"}, {"date": "21 Mar 2010", "title": "Assistant Professor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of West Florida (Pensacola, FL) in Mar 2010", "Interview Descriptions": "It was a general interview. Presentation followed by question answer session. Prior to that there was dinner. There was a one to one interview with the Dean ,chair and other members of the selection committee.\r\nThis was during the on campus interview. There was a screening interview through the phone.", "Interview Questions": "What are your weaknesses?"}]]