[[{"date": "11 Feb 2022", "title": "Master Level Clinician- School Based Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at McNabb Center", "Interview Descriptions": "The interview consisted of one virtual  interview with the company and one in-person interview at the school you would be working at, both the company and school had to be impressed with you in order to be able to get the job.", "Interview Questions": "Please describe why you be a good fit for this role. "}, {"date": "19 May 2021", "title": "Group Facilitator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at McNabb Center (Chattanooga, TN) in May 2021", "Interview Descriptions": "I met with the BSL Program Coordinator and her supervisor, they both asked me quite a few questions. It was a WONDERFUL experience. I enjoyed the process and the questions asked really allowed me to show my assets.", "Interview Questions": "Are you more of an analytical Thinker or Creative thinker?"}, {"date": "4 Apr 2021", "title": "Clinician Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at McNabb Center in Mar 2021", "Interview Descriptions": "Very personable and caring staff. They are clearly passionate about the work that they do and the people that they serve. The interview was more conversation based than asking straight questions.", "Interview Questions": "How would your previous experience fit with the job?"}, {"date": "19 Apr 2020", "title": "Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at McNabb Center", "Interview Descriptions": "It was really straight forward process. I had only one interview with the hiring manager. The manager told me on the call that they were interested in me. Then they called all supervisors for the last 5 years plus 3 references.", "Interview Questions": "I was asked about team work and flexibility"}, {"date": "20 Oct 2019", "title": "Program Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at McNabb Center (Knoxville, TN) in Aug 2019", "Interview Descriptions": "2 interviews one with direct supervisor, one the. With supervisor and senior director. Went to same location both times I was interviewed. Ask a lot of information, and both was very informative about the job and matching skills with what was required.", "Interview Questions": "A lot about previous experience in supervising. "}, {"date": "3 Oct 2018", "title": "Staff Development Trainer and Personnel Support Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at McNabb Center (Knoxville, TN) in Jul 2018", "Interview Descriptions": "My interview process was fantastic. The supervisor was very prepared, and asked really strong questions to determine my ability to do the job. She was really kind and personable, and made me feel comfortable when I came in. She was prepared enough to know who I was and made it apparent that she had taken the time to read my resume and cover letter.", "Interview Questions": "One part of this job is recruiting. If I were to tell you that we were struggling to hire nurses, & that I needed you to try to recruit nurses to hire, what steps would you take to do this?"}, {"date": "24 Sept 2017", "title": "Milieu Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at McNabb Center (Knoxville, TN) in Sept 2017", "Interview Descriptions": "Applied online and after about two weeks received a call to schedule an interview. The interview was relaxed and was an overview of the position and then I was handed paperwork to fill out for a background check, degree verification, and fingerprint check. There weren't any questions really asked except the ones you had for the program supervisor.", "Interview Questions": "Would you have an issue working with individuals that were abused?"}, {"date": "2 Aug 2015", "title": "Business Office Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 1 week. I interviewed at McNabb Center (Knoxville, TN) in Sept 2014", "Interview Descriptions": "They require that you offer multiple references and those references have to respond by phone before they make an offer to hire, They require a background check and drug testing.", "Interview Questions": "what my experience was in the field"}, {"date": "28 Mar 2016", "title": "Milieu Counselor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 5 days. I interviewed at McNabb Center (Louisville, TN) in Dec 2013", "Interview Descriptions": "Apply online, someone calls you for an on-site interview. No difficult questions. You accept the offer and do a week of training at the main office in Knoxville. Computer modules, CPR, etc.", "Interview Questions": "I can't remember the questions really. I went to school with some guys that worked there. No hassles or headaches."}, {"date": "15 May 2015", "title": "Adult IST Case Manager Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at McNabb Center (Knoxville, TN) in Oct 2013", "Interview Descriptions": "I went in for the interview amd was shocked that the interviewer did not ask me one single question about my experience. The interviewer just browsed my resume, asked if I could verify my education and references and then proceeded to explain the job. I was given the offer on the spot with literally no questions asked.", "Interview Questions": "Does this sound like a job you could do?"}], [{"date": "5 May 2012", "title": "Case Manager/Care Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at McNabb Center (Knoxville, TN) in Oct 2011", "Interview Descriptions": "Was a one on one interview with the program coordinator.  Was very basic interview questions-tell me about yourself, how would you handle certain situations", "Interview Questions": "Describe how you would handle the situation when you are being hit on by a client on your caseload"}, {"date": "24 Jul 2013", "title": "Social Worker Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at McNabb Center (Knoxville, TN) in Jan 2009", "Interview Descriptions": "Great interview process. Detailed and informative", "Interview Questions": "Whats your theoretical approach?"}]]