[[{"date": "23 Mar 2023", "title": "Internship Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Chatham House (London, England)", "Interview Descriptions": "Remote interview where I was asked a range of questions on experience, scenario based questions and others. They ignored my request for feedback following the interview - disappointing to not even get a response.", "Interview Questions": "Asked about event planning experience and what makes a good event."}, {"date": "8 Feb 2023", "title": "Academy Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Chatham House", "Interview Descriptions": "A very pleasant and engaging interview experience Friendly and open yet intellectual and to the point. It was a panel of three that was very thorough in making sure all bases and qualifications were covered.", "Interview Questions": "Background, experience, relevancy to the role, relevant policy questions and a few questions on value and character"}, {"date": "10 Dec 2021", "title": "Research Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Chatham House (London, England) in Nov 2021", "Interview Descriptions": "It was a very transparent, personalised interview process. They sent emails with updates even  when they didn't have the expected response and needed a few more days. Interview questions were inspiring.", "Interview Questions": "What has been the impact of your research so far? "}, {"date": "9 Nov 2022", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Chatham House (London, England) in Jul 2021", "Interview Descriptions": "Had a short presentation to prepare, then a panel interview. Interview was about 40 minutes. Very friendly and made me feel at ease. Asked general and more specific role questions.", "Interview Questions": "Competency questions, tell me a time when"}, {"date": "25 Nov 2020", "title": "Fellowship Program Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Chatham House (London, England) in Nov 2020", "Interview Descriptions": "It was great, the interviewers were friendly and it was quite engaging. The interviewers were quite punctual even though there was an hour time difference. They asked about my skills, experience, my research proposal and my familiarity with their work and with the institute.", "Interview Questions": "What policy impact would your research have?"}, {"date": "5 Sept 2020", "title": "Intern Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Chatham House", "Interview Descriptions": "Passed the initial applications round and was invited to the HQ. It was a one hour conversation with standard questions on asking about your suitability and willingness to do the job .", "Interview Questions": "Why do you want this job? What skills do you possess for this job? What events ideas do you have?"}, {"date": "5 Mar 2020", "title": "Programmer Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 4 weeks. I interviewed at Chatham House", "Interview Descriptions": "I was asked to come in for an interview. Didn't hear back for 2 weeks until I followed up. I was then asked for a second interview by phone. Never heard back. HR process was a bit messy.", "Interview Questions": "Why are you applying for this role?"}, {"date": "4 Feb 2020", "title": "Graduate Research Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Chatham House (London, England)", "Interview Descriptions": "I applied online. It took several weeks before I was invited for an interview, which took place at short notice. I was interviewed by 3 people, one from the team, one HR and one project manager. It was very formal and it lasted for about 40 minutes. I heard back the next day that I was invited to complete an online test the next day of 1 1/5 hours.", "Interview Questions": "Tell me how you would approach dealing with x situation. What is your main strength? Tell me about yourself? Why do you want this job? Tell me about a time when you demonstrated [specific skills required for the job]?"}, {"date": "31 Jan 2020", "title": "Intern Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 8 weeks. I interviewed at Chatham House (London, England) in Jan 2020", "Interview Descriptions": "I was invited for an interview, faced two staff members as interviewers, the chat lasted for about half an hour. The tone was overall friendly, and reasonable. Interviewers do make an effort to make you at ease. Competitive application, I think.", "Interview Questions": "Standard stuff; what makes you fit for this role, what interests you about our research, what experience with research do you have?"}, {"date": "10 Nov 2021", "title": "Programmer Assistant (Fixed Term) Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Chatham House (London, England) in Oct 2019", "Interview Descriptions": "After an initial interview, a test, and a final interview, no one followed up to let me know if I got it or not. I followed up multiple times as I was just out of uni and didn't have a job at the time, but nothing. I was also only given one option for the final interview (which I couldn't make) and I couldn't ask anyone to change it. After various email attempts, I called the office only to find out the person responsible for scheduling it was on leave.", "Interview Questions": "Standard competency-based questions - as well as explaining why I was interested in that particular programme "}], [{"date": "18 Mar 2021", "title": "Recruitment Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Chatham House in Oct 2019", "Interview Descriptions": "2-stage interview process with the hiring manager and another member of the people team. Very conversational, mix of competency questions and career discussion / motivations. Easy to talk to, and had a positive impression of the working culture.", "Interview Questions": "Technical questions about recruitment processes."}, {"date": "1 Oct 2019", "title": "Internal Recruiter Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Chatham House (London, England) in Sept 2019", "Interview Descriptions": "Overall I had a very pleasant experience, the team were very professional and kept me well informed. The interview was relaxed and quite balanced between the interviewers.  Post interview I got lots of constructive feedback. Even though an offer was not made there was a well argued rationale for not being offered the role and an upcoming role that might have been more suited was suggested to follow up on.", "Interview Questions": "Tell us a time where you had a setback or something went wrong in your career."}, {"date": "31 Jul 2019", "title": "Events Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Chatham House", "Interview Descriptions": "Teet to design three events that CH could put on. 1 hour long interview with panel of three followed by second interview then follow up phone call. Asked to justify event choices to team.", "Interview Questions": "Why CH, why the role, which international affairs sissues interest you?"}, {"date": "11 Mar 2019", "title": "Programmer Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Chatham House (London, England) in Feb 2019", "Interview Descriptions": "The interview process had 3 stages: phone interview, in person competency based interview with a test, more informal 'meet the team' 3rd round with test. The panel was really friendly and open. They specifically asked about how I approach gender in research and project work.", "Interview Questions": "They asked me to describe my professional experience to date and usual competency based questions around problem solving and decision making."}, {"date": "9 Apr 2019", "title": "Conference Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Chatham House (London, England) in Feb 2019", "Interview Descriptions": "I applied online, was contacted by HR after a few weeks and asked to take part in a skype interview with my line manager and the head of the area. I was also asked to complete a task before the interview took place. About one hour of interview, with questions aimed at understanding my previous experiences and suitability for the role. After a week, a second and last in-person interview took place, with the same format (competency based questions and informal talking).", "Interview Questions": "What do you know about Chatham House?"}, {"date": "9 Oct 2018", "title": "Energy Environment and Resources Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Chatham House (London, England)", "Interview Descriptions": "Applied online and was invited for a half hour interview with about 8 questions. There were two interviewers and I had been informed before the interview who they would be.", "Interview Questions": "Tell us about a time you had to manage conflicting responsibilities? How did you handle this?"}, {"date": "3 Nov 2019", "title": "Fellow Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Chatham House (London, England) in Jul 2018", "Interview Descriptions": "I was selected for interview about a month after submitting my application. \r\nInterview was scheduled for 2 weeks later. A day prior to the interview, I received a test Skype call to check if connection was O.K. Interview lasted approximately 30mins.", "Interview Questions": "Asked questions about what I had put in my application. "}, {"date": "25 Jun 2018", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Chatham House (London, England) in Jun 2018", "Interview Descriptions": "It was very friendly. I felt comfortable. I enjoyed the whole process. The interview went for half an hour. It was mostly discussing how I can contribute to their work. My areas of interests.", "Interview Questions": "They had a list of 8 questions. Few were competency based and few were to see whether I am a right fit for the department. Questions like how can I I contribute to the work at Chatham House and most rewarding things there. Where do I see myself in long run and how this internship can contribute to it. Questions on team spirit and how do you manage stress at work. "}, {"date": "19 Jun 2018", "title": "External Relations Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Chatham House (London, England) in Jun 2017", "Interview Descriptions": "Phone interview with recruiter, in person interview and presentation to a panel, interview with the director. The presentation is pretty casual but be sure to practice. Over all great process and friendly people", "Interview Questions": "How do you work with partners?"}, {"date": "17 Feb 2019", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Chatham House (London, England) in Jan 2017", "Interview Descriptions": "After applying, I was invited to an interview a few weeks later. I had one face-to-face interview with a panel of staff working in my Department. It lasted just under an hour, and was quite intense, yet stimulating.", "Interview Questions": "Why Chatham House? "}], [{"date": "29 Nov 2016", "title": "Internship Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Chatham House (London, England)", "Interview Descriptions": "After sending my resume and a short writing sample, I was asked to attend an in-person interview, which lasted about 45 minutes. The whole process was as enjoyable as job hunting can be – the two people I spoke to were extremely friendly and happy to discuss the area of my interest. Even though I was ultimately unsuccessful, I still received great feedback.", "Interview Questions": "I was asked about my previous internship experience, the reasons for my interest in the field, and where I see myself in the future."}, {"date": "30 Jul 2016", "title": "Internship Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Chatham House (London, England) in Jul 2016", "Interview Descriptions": "CV and cover letter followed by single interview. Called into a London interview with two interviewers. Very friendly, on time, was offered water. Lasted approximately half an hour. Found out a week later that I did not get the role. I asked for interview feedback and they were happy to give it.", "Interview Questions": "Nothing out of the ordinary... competence questions. What's your biggest weakness? General talk about the CV. Explain why you want to do an unpaid internship... what do you want to get out of it?"}, {"date": "10 Jun 2016", "title": "Research Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Chatham House", "Interview Descriptions": "Interview (about 30 mins) followed by written test, interviewers were nice, appreciated the quick response after the interview even though I didn't get the role and they offered fair feedback both in the interview and in the response email afterwards. They were happy to conduct the interview via skype as I was not in country at the time.", "Interview Questions": "Asked about knowledge of job subject matter, asked usual questions about research, challenges faced, strengths"}, {"date": "6 Dec 2019", "title": "Rogramme Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at Chatham House (London, England) in May 2016", "Interview Descriptions": "The interview was with two team members (one manager, one researcher) from the relevant research stream. The interview was a mixed in terms of questions relating to project management experience and content/research experience. Two weeks later I received an email stating that they decided to continue with another candidate. I also received feedback on my performance in the interview. Overall, the experience was very positive.", "Interview Questions": "Why are you the right candidate for this role?"}, {"date": "11 Jun 2020", "title": "Corporate Relations Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Chatham House (London, England) in Apr 2016", "Interview Descriptions": "I applied for this internship online after researching foreign affairs organisations. I was invited for an interview a week or two later. It was only one interview with two members of the corporate relations team. They asked me some fairly standard interview questions and soon afterwards I was offered the internship. I later learned that 100 people had applied for the role and I think 3-4 were shortlisted. My commercial background, facility with data analysis and analytic/research skills were apparently important in getting the internship.", "Interview Questions": "Why did you choose Chatham House?"}, {"date": "3 Apr 2016", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Chatham House (London, England) in Apr 2015", "Interview Descriptions": "The interview was pleasant and both staff members made me feel very comfortable. The questions were challenging but suitable given the standards of research at Chatham House. Was tested on my experience, as well as on research they were conducting.", "Interview Questions": "Questions on the research being conducted in the department"}, {"date": "30 May 2016", "title": "Project Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Chatham House (London, England) in Mar 2015", "Interview Descriptions": "Best interview I've had, asked questions specifically relevant to my ability to do the job rather than 'what are your weaknesses'. Interviewers were friendly and made up those members of the team I would be working with directly. The written test was fun and manageable though stressful given the time constraints. I appreciated that they were actually testing my skills and not using some obscure personality index.", "Interview Questions": "N/A"}, {"date": "20 Oct 2015", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Chatham House (London, England) in Feb 2015", "Interview Descriptions": "I enjoyed the interview process very much. I applied to a Department doing research, which co-aligns with my personal and academic interests during university. Most questions were related to the specific topics within the department (e.g RE or food security in the EER Department, resource curse or human rights  in the Middle East Programme). Plus the typical questions, such as why you want to do it, why you study what you study, research skills, weaknesses and strengths. I had 5 interviewers n total, which was a bit intimidating in the beginning, but they all turned out to be very nice", "Interview Questions": "What are the impacts of resource governance on food security?"}, {"date": "25 Sept 2013", "title": "Intern Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Chatham House", "Interview Descriptions": "One normal face-to-face interview and one written test consists in summarising an international security article.", "Interview Questions": "N/A"}]]