[[{"date": "11 Mar 2023", "title": "WiMi Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at TU Darmstadt", "Interview Descriptions": "Lockeres Setting aber fachlich sehr anspruchsvoll. Entsprechend des universitären Umfelds spielt Charakter und persönliche Entwicklung eine untergeordnete Rolle. Wert wird auf die bisherige Ausbildung mit Schwerpunkten, wissenschaftlichen Arbeiten, etc. Auch zukünftige Schwerpunkte werden behandelt und diskutiert. Man ist hier recht eingeschränkt und muss sich sehr den Vorgaben des Profs fügen.", "Interview Questions": "Wie hat bisherige Forschung und Ausbildung dazu geführt, dass ich besser für diese Stelle geeignet bin als andere."}, {"date": "11 Nov 2021", "title": "Lehrauftrag Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at TU Darmstadt", "Interview Descriptions": "Telefon, dann vor Ort. Ausführliche 90 min. nettes Personal, schöne Räumlichkeiten. A b c d e f g h i j k l m n o p q r s t u v w x du z", "Interview Questions": "Stärken und Schwächen, Vision, Erfahrung"}, {"date": "15 Jan 2021", "title": "Software Developer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at TU Darmstadt in Jan 2021", "Interview Descriptions": "Good better the best then comes the tricky part of being the worst ever and then the better and then the best and to excellent and the cycles repeats, that's it ....so all in all it is good better best and worst", "Interview Questions": "Some dome ROME home gone "}, {"date": "10 Dec 2020", "title": "Study Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at TU Darmstadt in Nov 2020", "Interview Descriptions": "With Covid, the interview was on zoom. My employer sent me the link in advance so that I could try it and see if there are any technical difficulties that need to be sorted out before the interview. They were very friendly and  started with describing the process of the interview. They then proceeded describing their department and then the position itself more. I really paid attention during this part, because you could tell which parts of the job they emphasized. Then they asked me to describe my CV briefly, in which I focused on the parts that could be beneficial for the position, but also that had a big influence on my work-attitude and personality.  By describing my CV I referred to specific aspects of the advertised work opportunity, to make it easier for them to build connections.", "Interview Questions": "One question they asked was which specific experience of mine qualifies me especially for the position. "}, {"date": "25 Sept 2020", "title": "AI Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at TU Darmstadt", "Interview Descriptions": "It was really good interview, started with introduction, and I were asked some technical questions after that. They asked some questions about my reason for the change of field, and after answering they were quite convinced about it.", "Interview Questions": "Warum dieses field? "}, {"date": "7 May 2019", "title": "Studentische Hilfskraft Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at TU Darmstadt", "Interview Descriptions": "Nette Atmosphäre, Gespräch startet mit persönlichen Fragen und man stellt sich gegenseitig vor, meist sitzen einem mehrere Mitarbeiter des Lehrstuhls gegenüber, teilweise auch studentische Hilfskräfte d.h. die zukünftigen Kollegen. Es geht dann über zu fachlichen Fragen und bereits gesammelter Erfahrung des Bewerbers zu der angebotenen Stelle.", "Interview Questions": "Bei welcher Tätigkeit konnten Sie bereits Erfahrung mit Software X bzw fachlichem Wissen Y sammeln."}, {"date": "2 Mar 2022", "title": "PhD Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at TU Darmstadt in May 2019", "Interview Descriptions": "- Gespräch mit Prof und zwei Mitarbeitern (Post-Doc und Doktorand)\r\n- Begrüßung\r\n- Vorstellung und Lebenslauf\r\n- Fragerunde mit eigenen Fragen und Rückfragen\r\n- Besprechung des Forschungsthemas und der Finanzierung der Stelle\r\n- Angebot erhalten und Anfang besprochen", "Interview Questions": "-Motivation für Position\r\n-Bisherige Erfahrungen berichten"}, {"date": "30 Jul 2018", "title": "Werkstudent Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at TU Darmstadt", "Interview Descriptions": "Locker, Paar Fragen zum Lebenslauf, was ich in diesem Bereich gemacht habe, stärke/schwäche,  wieviel Tage wollen Sie arbeiten, haben Sie schon erfahrung damit ? sind Sie flexibel , wie lange brauchen Sie noch für Ihr Studium", "Interview Questions": "schwäche/Stärke, haben Sie Erfahrung? Fragen zum Lebenslauf, was ich in diesem Bereich gemacht habe, stärke/schwäche,  wieviel Tage wollen Sie arbeiten, haben Sie schon erfahrung damit ? sind Sie flexibel "}, {"date": "23 Sept 2022", "title": "Studentische Hilfskraft Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at TU Darmstadt (Darmstadt) in May 2018", "Interview Descriptions": "Nachdem ich mich beworben habe, wurde ich zum Vorstellungsgespräch eingeladen. Dort wurden Fragen zu meiner Person gestellt und anschließend wurde die Tätigkeit wurde ausführlich erklärt. Dann wollten sie mich gerne für die Tätigkeit haben und haben mich gefragt, ob ich es auch möchte.", "Interview Questions": "N/A"}, {"date": "27 Jul 2021", "title": "Wissenschaftlicher Mitarbeiter Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 5 days. I interviewed at TU Darmstadt in Sept 2017", "Interview Descriptions": "sehr professionell. Es wurden mehrere Gespräche mit verschiedenen Mitarbeitern aus dem Fachgebiet geführt.\r\nMir wurde die Möglichkeit gegeben, Fragen einzubringen und auch meine Erwartungen in den Job einzubauen.\r\nZusätzlich musste ich einen 20 minütigen wissenschaftlichen Vortrag vorbereiten.", "Interview Questions": "Was denken Sie, wie wird ihr zukünftiger Arbeitsalltag aussehen?"}], [{"date": "24 Feb 2017", "title": "Wissenschaftliche Mitarbeiter Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 5 days. I interviewed at TU Darmstadt", "Interview Descriptions": "Ich wurde nett empfangen, man hat gefragt, wieso ich mich auf genau diese Stelle beworben habe und warum ich promovieren möchte. Ich wurde gefragt, wie ich damit umgehe, wenn ich Aufgaben erledigen muss, die mir keinen großen Spaß machen. Die Englischkenntnisse wurden abgefragt", "Interview Questions": "Stärken und Schwächen"}, {"date": "10 Sept 2018", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at TU Darmstadt in Oct 2015", "Interview Descriptions": "At the first stage, I was asked to consider a problem a provide a solution. It took me 10 days. After this stage, there was an interview with thous who solved the problem. During the interview, we discussed the mistakes of my solutions and the way I solved it. The aim of the interview was to check my ability to think critically and to learn new information. Finally, I successfully got the position.", "Interview Questions": "My previous work experience."}, {"date": "29 Sept 2015", "title": "Wissenschaftlicher Mitarbeiter Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at TU Darmstadt (Darmstadt)", "Interview Descriptions": "Meine Unterlagen per Post verschickt.\r\nNach wenige als drei Wochen habe einen Anruf erhalten mit Einladung zur Personlichengespräch.\r\nTermin wurde direkt vereinbart.\r\nBeim Gespräch habe ich mich kurz vorgestellt und über meine Erfahrung und Interesse erzählt.\r\nDer Arbeitgeber hat die Tätigkeiten erklärt, die aktuelle Mitarbeiter vorgestellt und Arbeitsplätze gezeigt.\r\nAm Ende wurden alle interessierte Auskünfte ausgetauscht (Fragen und Antworten) und mit Termin für meine Entscheidung verabschiedet.", "Interview Questions": "Familiensituation"}, {"date": "6 Sept 2015", "title": "Wissenschaftlicher Mitarbeiter Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at TU Darmstadt (Darmstadt) in Jun 2015", "Interview Descriptions": "I wrote my master thesis at my current chair, therefore I did not have a \"real\" interview process. Basically everything was decided well beforehand. Just hand in the CV and talk a bit. Questions: \"Are you more interested in business questions or technical quesions?\" However, the given information on how much time I get to spend on my own research was not indicative at all. This will surely depend on the chair you apply.", "Interview Questions": "Are you more interested in business questions or technical quesions?  Why do you want to do PhD?"}, {"date": "4 Mar 2013", "title": "Wissenschaftlicher Mitarbeiter Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at TU Darmstadt", "Interview Descriptions": "I wrote my master thesis at my current chair, therefore I did not have a \"real\" interview process. Basically everything was decided well beforehand. Just hand in the CV and talk a bit. Questions: \"Are you more interested in business questions or technical quesions?\" However, the given information on how much time I get to spend on my own research was not indicative at all. This will surely depend on the chair where you apply.", "Interview Questions": "Are you more interested in business questions or technical quesions?"}, {"date": "20 Sept 2015", "title": "Wissenschaftlicher Mitarbeiter Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at TU Darmstadt (Darmstadt) in Oct 2011", "Interview Descriptions": "Vorstellung, Fachliche Fragen, Persönliche Fragen, Begleitung zum Bahnhof seitens des \"noch unentschlossenen\" Chefs :). Die fachlichen Fragen waren sehr einfach zu beantworten, da der zukünftige Chef ein Projekt hatte dass nicht seinem Fachgebiet entsprach", "Interview Questions": "Die Vorstellungsgespräche laufen sicherlich sehr unterschiedlich je nachdem auf was und bei wem man sich bewirbt. Man sollte nicht vergessen, dass meist Professoren diese führen, und diese in den überwiegenden Fällen keine HR-Profis sind."}]]