[[{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": 4, "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Unique Experience, Lots of Responsibility, Great Training", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "13 Feb 2023", "job_title": "Field Organizer", "duration": "N/A", "pros": "- Training - Mentorship & support from manager - Lots of responsibility and autonomy - Great people - Helpful connections", "cons": "- Long hours at times, but less than expected - Grassroots organizing is challenging"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Bad", "rating": "2.0", "reviewer_affiliation": "Former Employee", "job_date": "4 Nov 2022", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Can’t think of any pros", "cons": "Toxic workplace, no work life balance"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": 4, "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 5, "review_title": "A year-long Boot Camp in Environmental Organizing", "rating": "5.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "22 May 2021", "job_title": "Field Organizer", "duration": "N/A", "pros": "-\tYour year with Green Corps is exactly how they tell you it will be, it is hard work and you learn A LOT\r\n-\tThe 8wks of classroom training teach you the hard skills you will need to know to be an effective organizer. Each session is taught by someone who works in the field and specializes in that topic (Campaign planning, volunteer recruitment, leadership development, event planning, public speaking, lobbying etc.)\r\n-\tThe multiple campaign placements with different orgs give you a way to try out and practice those organizing skills with the support/mentoring of your GC supervisor. \r\n-\tThe unique experience of working on multiple environmental issues in different parts of the country and be given real responsibility all in one year is a great way to be exposed to different environmental orgs and the work within them.\r\n- The focus is on impact", "cons": "-\t If you’re looking for a low-stress job where you check out at 5pm every day this isn’t for you. It’s basically a year-long boot camp where you will be busy planning, organizing, learning, and making an impact.\r\n-\tMost people in the class recently graduated and left the campus they had just grown on for 4+ years. Some people find it lonely moving to different parts of the country and not knowing too many people there.\r\n-\tSome campaign tactics (like public speaking or doing some phone banking) will put you outside your comfort zone, so if you don’t see that as a learning experience this may not be for you.\r\n- The pay is on the lower-end for how qualified and hard working everyone is, but it's a bit of a trade off for the quality of training you get."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": 3, "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Best experience of my life", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "17 Jul 2021", "job_title": "Field Organizer", "duration": "N/A", "pros": "Green Corps gave me the skills, training, and confidence necessary to make real concrete change on the issues I care about, to continue my career no matter what the path, and provided me with professional connections and friendships that will last a lifetime. The ability to spend a year with personalized training, professional development, and real-world experience working on grassroots field campaigns is invaluable and incredibly fun and exciting. Plus, you get to experience living and working in many different cities across the country!", "cons": "You will work incredibly hard and sometimes feel like you aren't making a difference. Don't lose sight of your long-term goals and the difference that you're making along the way. Also, unless you stay with the organization to work on the central staff team, you may have some really big ideas for how the organization should be run and might not be able to see all of those ideas come to fruition in one year of working with Green Corps. Speak up about your thoughts and understand that it takes time for things to change."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": 3, "Career Opportunities": 5, "Compensation and Benefits": 3, "Senior Management": 5, "review_title": "Work Hard, Learn a Ton", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "25 May 2021", "job_title": "Organizer in Denver, CO", "duration": "N/A", "pros": "- I personally organized on many styles of campaigns and saw colleagues do the same - campaigns ranging from taking leave for a GOTV election effort, to conservation campaigns focused on grasstops engagement, to campaigns working to advance policies in state legislative sessions\r\n-Learned how to build a team of volunteers and train them on some of the same skills I was learning throughout the year\r\n- Lots of alumni help at training \r\n- Felt fortunate to have a job, especially one that I actually cared about, during the pandemic year when seeing many other recent grads struggle to find something. It was also cool to see what the rest of the team and I were still able to accomplish despite doing all of the work remotely.", "cons": "- It's clear that Green Corps is always a challenging program, but online or virtual organizing this past year was definitely personally challenging and seemed less fun relative to stories we heard from alumni. Virtual work was more limiting so some parts of campaigns seemed very similar to others.\r\n- Is in the process of doing more around DEI, but it was nice to see additional content added in throughout the year."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": 3, "Career Opportunities": 5, "Compensation and Benefits": 3, "Senior Management": 5, "review_title": "best training out there", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "21 Jun 2021", "job_title": "Field Organizer in Denver, CO", "duration": "N/A", "pros": "Training - You get a lot of attention from supervisors while you're running campaigns, and the classroom training gives you a good idea of the breadth and depth of environmental campaign work to be done. \nMaking an impact - you get to work on important issues really early in your career and have a lot of responsibility. You get to train and empower community members and sometimes even win your campaign!\nNetwork - the alumni network and the broader Green Corps community is filled with really impressive folks who have made huge impacts on enviro issues\nExperience - you experience a LOT in one year and have a big leg up in terms of understanding and context for whatever your work entails next.", "cons": "The pay is low, but you're getting paid to learn. And it can be challenging to move a few times during a year. Ask for support from management on moving though!"}, {"Recommended": "N/A", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": 0, "Career Opportunities": 4, "Compensation and Benefits": 0, "Senior Management": 4, "review_title": "Green Corps Review", "rating": "4.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "28 Jun 2021", "job_title": "Field Organizer", "duration": "N/A", "pros": "* Connections made through this program are invaluable! Throughout the year I developed close relationships with my GC classmates and volunteers that proved to be the most valuable part of my year. Helping volunteers develop their organizing skills was incredibly impactful and motivating.\n* This year expanded my knowledge of the sustainability field through expansive community organizing training and working with several change-making organizations that exist across the country.\n* I loved the projects/issues that we got to work on. They are relevant, high impact and necessary for progress! I was thankful to be a part of these campaigns and learned a lot about organizing by actively working in the field.", "cons": "* Pay structure (tight budget, high hours/week requirements)\n* Program needs more diversity, equity, inclusion and justice integration"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 0, "Diversity and Inclusion": 1, "Career Opportunities": 0, "Compensation and Benefits": 1, "Senior Management": 0, "review_title": "Extremely Low-Paying & Not Worth It", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "10 May 2021", "job_title": "Field Organizer", "duration": "N/A", "pros": "- People are nice\r\n- Lots of 1:1 time w/ supervisor\r\n- Basic introduction to what organizing is", "cons": "~80% of the class quit, so not a very good social experience\r\n- Extremely low-pay, particularly for how qualified each person is\r\n- Not willing to invest in basic progressive organizing tools like ThruTalk & ThruText (didn't even use VAN!) \r\n- Lots of turnover in management (all but one upper-level staffer left over the duration of the year).\r\n- Lots of orgs have a negative opinion of TPIN, PIRG, & Green Corps so it's hard to get out of these super low paying positions\r\n- 0 regard for individual circumstances, unwilling to be flexible despite asking you to be extremely flexible. \r\n- Unprofessional management (e.g. staffing notes in public google drive folder)\r\n- Exclusively discuss field organizing (not other political paths like data)\r\n- Only ok benefits, especially for the pay, no retirement, long probationary period etc.\r\n\r\n** Many jobs boards & listservs have blacklisted TPIN, PIRG, & Green Corps-- an indicator of a much bigger problem."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": 3, "Career Opportunities": 5, "Compensation and Benefits": 3, "Senior Management": 5, "review_title": "A strong way to start a career in organizing", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "25 Jun 2021", "job_title": "Field Organizer", "duration": "N/A", "pros": "Green Corps is a very thorough training program that equips organizers with so many of the skills you need to be successful in grassroots work. You get exposure to all aspects of campaigning: building a group, getting media attention, working with coalition partners, fundraising, and a lot more. I feel prepared to do most of my job responsibilities in my current job because of what I learned through Green Corps.\nThe model of working on several different campaigns in a year allows you to learn through iteration - what works the first time might not the second, and what you got wrong the first time you can improve on the next time around. By the end of the year, you have a solid grasp of what organizing can look like in different contexts, on different issues, with different partners, and different goals.\nOn top of that, you get in-depth coaching and support from your Assistant Organizing Director, whose sole responsibility is to help organizers learn and succeed. It's more detailed coaching and training than I've seen at any other organization.\nLastly, you get a lot more responsibility than you would in most jobs right out of college. You learn by doing, right from the start.", "cons": "The first con most folks will mention about Green Corps is that it's a tremendously challenging program - which is mentioned time and again during the application process. Moving several times in a year, going to cities you've never lived in, and starting up campaigns from scratch is **hard**, there's no way around it. \nAlso, in part as a result of the short-term campaign model, the campaigns don't usually incorporate an environmental justice lens. It's difficult to build deep relationships with frontline communities in just 3-4 months. The training component is starting to include from environmental justice content, but there is more room to grow there.\nIn a similar vein, the organization has issues with low pay and a lack of diversity (which are definitely linked). The central staff team is aware of Green Corps' shortcomings and is working on changing the things that are in their control. There is definitely more work ahead."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": 4, "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Incredible Training & Team", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "4 Mar 2021", "job_title": "Field Organizer in Columbus, OH", "duration": "N/A", "pros": "-Passionate coworkers\r\n-Lots of responsibility for entry-level job\r\n-In-depth training for organizing and advocacy skills\r\n-Opportunity to explore different issues and approaches over the course of 1 year\r\n-Passionate management team\r\n-Awesome \"alumni\" community\r\n-Health insurance and student loan assistance opportunities", "cons": "It is a challenging year due to the amount of work required to start multiple grassroots campaigns and the fact that most organizers are doing campaign tasks for the first time. Lots of people don't like the quantitative goals or annual pay, but that's also made clear during the application process."}], [{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 0, "Culture & Values": 4, "Diversity and Inclusion": 3, "Career Opportunities": 5, "Compensation and Benefits": 3, "Senior Management": 5, "review_title": "Intense but rewarding experience", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "22 Jul 2021", "job_title": "Development Associate in Denver, CO", "duration": "N/A", "pros": "- Career advancement\r\n- Valuable training, skill building, and character building\r\n- Positive social impact", "cons": "- Must be fine with moving frequently"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Terrible, horrific organization", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "27 Aug 2021", "job_title": "Deputy Field Organizer", "duration": "N/A", "pros": "Nothing about this job can be honestly described as a positive.", "cons": "Racist, classist organization that exploits workers and leaves you demoralized about the very real need for organizing."}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 0, "Diversity and Inclusion": 1, "Career Opportunities": 3, "Compensation and Benefits": 1, "Senior Management": 0, "review_title": "Green Corps will teach you organizing skills but the organization has serious issues", "rating": "2.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "11 Jun 2021", "job_title": "Campaign Field Organizer in Denver, CO", "duration": "N/A", "pros": "Good learning experience\nGood for skill development", "cons": "Toxic work culture\nBad work/life balance\nExploitative"}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Avoid and seek something else worth your time - labour and equity issues off the charts", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "8 Feb 2021", "job_title": "Field Organizer in Denver, CO", "duration": "N/A", "pros": "You get a good introduction to organizing if you never had any experience similar to it, and you will spend a great deal of time with a cohort of young ppl who are passionate about the environment.", "cons": "I worked for GC after graduation during the pandemic, and quit without completing the internship. The main issue about this organization is that they take feedback very poorly, driving young talent away from them and from organizing in general. As a non-profit, most of us understand their pay is not the most abundant. But it is extremely messed up that they seem to use this excuse to exploit young idealistic environmentalists. They don't demonstrate their support to interns beyond lip service - and you wouldn't know this until you're really in the program. Because of the pandemic, we were all paid the minimum wage in our respective states (until a sudden restructuring), and due to differing minimum wage legislation, we experienced massive pay and work gaps between employees in different states (20 hour gaps between some employee’s workweeks), even though we were all hired on an equal level of work and expectations. It is unbelievable to me when I learned that they asked a Canadian intern to move to the US on a very short notice for a REMOTE internship and refused to pay for ANY of the visa fees or travel fees... during a global pandemic. The intern later on told us GC messed up on the visa and asked the intern to return to Canada on a short notice again. The level of mishandling in that situation just shows that they are unprepared to host a non-US intern. Another red flag to me is that they don't seem to foreground the work of communities or color or at least to address the legacies of white supremacy and exclusion in the environmental movement. When concerns on these issues were brought forward by staff, they weren’t met with clear commitment to address them. I observe that a lot GC Alumni felt unequipped to lead campaigns addressing climate justice and intersectional environmental issues after their GC year. Related to that, the program makes it out to be the short path for you to work as an organizer afterwards but job-search is still difficult for graduated fellows, from what I have seen, not everyone who graduates from the program was able to find a job. GC's approach and tactics of organizing are seem outdated and it looks like they lost a lot of partnering organizations year by year. Bottom line, if you want to get involved in environmental organizing, volunteer or work for organizations like sierra club, zero hour, sunrise instead- this fellowship is just not worth it, in my opinion."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Don't work with Green Corps/TPIN", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "8 Feb 2021", "job_title": "Digital Organizer in Denver, CO", "duration": "N/A", "pros": "The greatest pro of Green Corps is the incredible people you meet in your class and through partner organizations.", "cons": "Green Corps is an organization that genuinely lacks inclusion and empathy. I was beyond thrilled when I was first accepted. They advertised themselves as such a progressive program that taught young, passionate people to become successful organizers. Unfortunately, this is just not true. They purposely recruit and target young adults who want to make a career out of helping the environment, people, etc. The program preaches toxic ideals and values. They hesitate to acknowledge environmental racism despite the fact that communities of color are disproportionately affected by climate change (and so on). Moving past the topic of the organization's problematic views, they treat their employees poorly. There is no such thing as a work/life balance with Green Corps. You will work long hours and be severely underpaid. Yes, I understand this is a training program that is prepping their employees/ students for the world of organizing, but the neglect is unnecessary. If you end up not graduating from their program they then blacklist you from jobs within The Public Interest Network. Fortunately, TPIN is notorious for being an awful organization (so you shouldn't want to work with or for them anyways). There is so much wrong with Green Corps-- I'm sure I could go on and on, but I'd like my fellow colleagues to tell their story as well. My advice to people interested in this opportunity is: just don't. There are organizations out there that are genuinely progressive, inclusive, and care about their employees. I know a lot of passionate folks who joined Green Corps and hated it so much that they are no longer organizers and now seek other careers because of it. Green Corps likes to claim that their huge turnover rate is because \"organizing isn't cut out for everyone,\" but truth to be told the program is flawed and unethical. I tried to stay employed by them for as I could withstand it. I ended up leaving due to the evident decline in my mental and physical health. I hope TPIN and Green Corps can reinvent themselves into something that actually creates a net positive for our world."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 0, "Diversity and Inclusion": 1, "Career Opportunities": 4, "Compensation and Benefits": 0, "Senior Management": 3, "review_title": "Investment in your training, high turnover, low pay", "rating": "3.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "5 Oct 2020", "job_title": "Field Organizer", "duration": "N/A", "pros": "A few notes about this review: All of my GC experiences occurred online due to COVID-19, the Executive Director was on maternity leave for most of my time at the organization, and all my experience with GC was during the 2020 election season. I left the program before completing the entire year. It's also worth noting that Green Corps is essentially a department within the Public Interest Network. When you are researching this job read reviews about TPIN. Issues regarding pay and working conditions are similar across the network. \r\n\r\n- You get a lot of individualized attention from your Assistant Organizing Director (AOD). You have multiple meetings throughout the week with your AOD. The quality and nature of your relationship will vary somewhat based on your AOD. \r\n- Valuable classroom sessions. The classroom sessions have a lot to offer especially regarding the strategy behind organizing. Similarly, a lot of GC/TPIN alum still work in social change/environmental fields and genuinely have a lot of insight and perspective to share.\r\n-They work on environmental issues (e.g. endangered species protection, artic protection etc.). If that's something you're really passionate about it's cool to get first-hand experience on those issues. \r\n- The skills you get working on enviro campaigns are transferable to other fields (e.g more socially justice focused work). \r\n- Green Corps hires really incredible, talented individuals. Your teammates are great people.\r\n- GC assigns you a mentor who is a GC alum. If you get to know them, they can be a valuable resource.\r\n- You get healthcare, student loan assistance, and a few travel expenses can be pre-tax.\r\n- During a typical GC year, they pay for all your travel to work destinations.", "cons": "- AOD's typically have between 2-3 years of experience themselves, including their own Green Corps year. So, they're not as experienced as the program suggests. You can still learn from them but, they're not the only people you can learn organizing from. \r\n- There is a lot of turnover in AODs. They typically only work at GC for a couple of years. Depending on the staffing situation, there may be AOD turnover during the middle of your year. \r\n- The pay is very low and the TPIN will go out of their way to pay you as little as possible while having you work as many hours as possible. GC is currently navigating a new labor law (basically having to pay salaried workers overtime if their salary is below the federal minimum amount). So, we started the year being paid hourly. Our hourly pay was based on the minimum wage of our state. Individuals based in states with low minimum wages were asked to work 10-20 hours more per week than those in states with higher wages (to maximize their hours and pay equation). Midway through our first campaign, they switched everyone to salary (federal minimum) until the election. Everyone was asked to work 60 hours a week. People in states with higher state salary minimums were paid more.\r\n- TPIN and GC are not explicitly progressive. They work on enviro issues which tend to align with Dems. However, they are not progressive about pay, DEI issues, or working conditions. They also tend to avoid campaigns that focus on environmental justice. \r\n- Also see, @green_corps_speaks on Instagram. \r\n- This may be unique to COVID and the election but, the work we did was very repetitive and only allowed for a certain amount of growth. We phone banked between 4-6 hours a day. Organizer feedback wasn't really considered unless we had minute comments.\r\n-Diversity, Equity, and Inclusion are not an important part of the GC program, even from a classroom training perspective. In two weeks of training, DEI was not part of the training. They claim that they try to prioritize diversity in their recruitment practices. However, when hiring AOD's (your bosses) they only hire GC alum who are predominately white. They aren't very accommodating of low-income staff situations. For example, we were asked to fundraise our friends and family, which was less feasible/appropriate for some. \r\n- A lot of people will leave the program if you stay for the entire year. Early on, some people will leave because organizing isn't a good fit. That's normal at any job. However, in my 2 months at GC about 30% of the class quit, some of whom really liked organizing. In the previous class, about 60% of people quit (the program did end during the pandemic, so do with that what you will).\r\n- GC avoids conflict by having conversations in small group or individualized settings.\r\n- The paperwork you sign includes an arbitration agreement and doesn't explicitly guarantee you sick or vacation days. (Although, ultimately they do give them to you.)\r\n\r\nUltimately, you are replaceable. Green Corps relies on annual turnover of staff. If you can tolerate some (sometimes a lot) of things you disagree with to get an experience you believe will help you in the future it may be worth it. If you get an offer at Green Corps, you can probably do better. They pick qualified applicants, and quite frankly most of them could get higher paying, better jobs elsewhere."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Mixed Bag: Pros and Cons", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "11 Feb 2021", "job_title": "Community Outreach/Field Organizer in Austin, TX", "duration": "N/A", "pros": "You are given lots of responsibility and control over the campaign that you start. Gain experience on a wide range of skills.", "cons": "Organizers are pushed to long hours and compensated poorly. Isolated from other Green Corps organizers."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 0, "Diversity and Inclusion": 1, "Career Opportunities": 5, "Compensation and Benefits": 1, "Senior Management": 3, "review_title": "Eh", "rating": "2.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "24 Feb 2021", "job_title": "Field Organizer in Palm Desert, CA", "duration": "N/A", "pros": "Training\r\nLots of oversight\r\nGood networking\r\nJobs guarantee upon completion", "cons": "Pay\r\nLabor practices\r\nwork/life balance\r\nParent organization is terrible\r\nLack of DEIJ discussion\r\nNo focus on environmental justice"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Field Organizer", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "17 Nov 2017", "job_title": "Field Organizer in Denver, CO", "duration": "N/A", "pros": "-now working elsewhere in the environmental movement it's obvious that no one prioritizes training and staff development to the degree that Green Corps does. unparalleled access to top trainers, content and ongoing feedback\r\n-experience on lots of different campaigns in lots of different places- I got experience on a corporate campaign, a campus campaign, and a community campaign targeting a city council. All really different, all really valuable for helping develop my strategic thinking and ability to run a variety of campaigns\r\n-ongoing feedback and support- although my manager was in a different city than me, I got weekly feedback and support around planning and executing my campaigns. I had never done work like this so that was really valuable. I also haven't gotten as high a degree of management/feedback/support since leaving the organization at other environmental nonprofits.\r\n-access to an extensive alumni network and job connections- there's a TON of people who are leading the top environmental and social justice organizations who did Green Corps and offered me helpful advice and introductions upon leaving the organization.", "cons": "-it varies from campaign to campaign, but there are high goals and expectations and you'll work really hard to achieve them. I really care about these issues and so it didn't bother me, but some people will leave the program because they don't want to work that hard. They're super upfront about the work load and expectations, but I guess some people are still surprised.\r\n-relocating to different cities- you move around a lot during the year. I really enjoyed this part of the program because I got to see a lot of the country, and get paid to move around to these different cities, but you move around 3-4 times during the year."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": 4, "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Green corps world graduate intenship review", "rating": "4.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "4 Oct 2020", "job_title": "Intern in Los Angeles, CA", "duration": "N/A", "pros": "If u love environmental activism then thats a good place to start", "cons": "Too much work and no accommodation provided"}], [{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Most Effective Environmental Organizing Program - will change your life!", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "21 Feb 2019", "job_title": "Field Organizer in Minneapolis, MN", "duration": "N/A", "pros": "Greencorps is hands down the best training program in environmental organizing. During your time in the program you will not only meet with leaders in the environmental movement and grow your organizing skills through a series of practical, hands-on trainings, but you will also run three or more Field Campaigns to protect the environment on key issues like conservation, corporate responsibility, and climate change. Greencorps helps you become a transformative leader and launch your career. The program challenges you to step outside your comfort zone while also connecting you with incredible mentors, life-long friends, and an alumni network of talented organizers who are changing the world every day. In short, Greencorps will change your life.", "cons": "Organizing is not an 'easy' job and during the height of your field campaigns, you may work more than the typical 9-5. That being said, with the support of your Greencorps team, you will continue grow and learn throughout your time in the program."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 0, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 3, "Senior Management": 5, "review_title": "The best possible thing you could do if you want to be an organizer!", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "7 Feb 2019", "job_title": "Field Organizer in Dallas, TX", "duration": "N/A", "pros": "There is simply NO training program that even comes close to Green Corps in terms of the skills and experience you'll gain. If you want a career in grassroots organizing or social change work, you should do it! Not only does doing Green Corps allow you to learn and train in a unique and powerful way, but also the impact you're making on the issues you work on, and in your volunteers' lives, is tangible and meaningful. The program will launch your organizing career about 20 years farther down the line than it would have been otherwise.", "cons": "Yes, the hours are long, and the work is hard. It's a year-long training program that gives you about 10 years-worth of experience in that amount of time, so that's somewhat inevitable! Be prepared to be completely consumed by this work for a year, and come out better-off and feeling invincible on the other side."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Amazing training + life changing experience.", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "23 Sept 2014", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Green Corps comes pretty much exactly as advertised. You'll learn the skills and get hands-on experience working on urgent environmental campaigns, and getting set up to make this work your career after you graduate. You'll meet some of your best friends, have more responsibility than almost any of your college classmates, all while accomplishing some incredible things during your campaign. I grew a ton during my Green Corps year, and continue to be grateful for all my personal development during the experience.", "cons": "Green Corps definitely pushes you pretty hard. There's a tension with the work-life balance, but if you make an effort and plan well it won't be a huge issue. I worked in 4 different cities during my year, which was challenging but also gave me the opportunity to meet some amazing people and live in places I never thought I would otherwise."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "This is the place to learn how to organize", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "15 Jan 2019", "job_title": "Field Organizer", "duration": "N/A", "pros": "If you want to become an environmental organizer, Green Corps is the place to start. You will learn more, develop more skills and experience, and take on more real responsibility than most other entry-level jobs and you'll do that all while making a real difference in the world. You will undoubtedly graduate with the skills and temperament to be good organizer, amazing like-minded friends, and many job offers in the organizing world.  You'll also grow more as a person than you even think is possible. \r\n\r\nAnother pro is the work environment. It is super inspiring to work with people who share your commitment and values and the current team of senior staff are especially all awesome and very committed to organizers' success!", "cons": "It is very hard work and you will move around the country 3-4 times throughout the course of the year (which was a pro for me, but not for everyone)."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Great start in environmental world!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "14 Jan 2019", "job_title": "Green Corps Organizer in Denver, CO", "duration": "N/A", "pros": "The biggest benefit of Green Corps' year-long training program is the hands-on training, both in the classroom and the general attention to detail from staff directors. Green Corps brings in great guest trainers to give organizers skills and perspective on how to be successful in their work. These are also great folks to network with, and many are alumni of the Green Corps program. You also work on 3-5 campaigns during the year, getting a lot of experience. The current Central Staff team is knowledgeable and responsive to feedback.\r\nHealth care + student loan assistance are big benefits.", "cons": "The salary is lower than some might desire, but it's couched within Green Corps being a 'training program' - there is a ton of skills training that you get. And there's healthcare and a student loan assistance program."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Cult-like organisation", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "24 Mar 2016", "job_title": "Field Organizer in Denver, CO", "duration": "N/A", "pros": "Save ten bucks on that copy of \"Escaping a Cult for Dummies\" you've been thinking about buying--green corps is a value for money crash course! Your considerable value for their minimal money!", "cons": "Functions like a cult. Full of white upper class people with savior complexes. If someday science delivers on lifelike virtual realities, these folks would be just as happy and do less damage playing martyrs and saviors in simulation. \r\n\r\nThat probably sounds harsh but its hard to think of dry professional ways to describe this organisation because it is anything but professional. During training they placed heavy, concerted pressure on new employees to drink and openly monitored who was and wasn't getting smashed with the rest of the group during their free time. One night I went to meet a member of my family who happened to be in town and literally had to explain why the next day. CREEPY."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Launched my career in environmental organizing!", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "17 Nov 2017", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "I credit Green Corps for launching my career in environmental organizing. I worked on four campaigns including working to stop climate change to protecting public drinking water. Was trained in everything from media to fund raising - much of which I use in my job today. One of the best parts of the job is the people you meet - my classmates are still good friends, I stay in touch with many of the volunteers I recruited.  The network I built and continue to have is invaluable.", "cons": "Green Corps is hard work. I pushed and challenged myself throughout the year to take on more than I thought possible. For me, it was worth it. I had a blast. But its not for everyone."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Review of Green Corps", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "18 Mar 2013", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "- excellent training - learned basic skills of organizing and was given a chance to improve them. \r\n- constant feedback throughout the year. Learn your strengths and weaknesses, and given ways to get better. Also helps direct where you can make a big impact. \r\n- large emphasis on finding employment after you finish the program. Lots of resources here, especially if you actively reach out.\r\n- really awesome people. Met best friends who I still talk to on a daily basis. Amazing people who are doing amazing things now across the country.", "cons": "- not necessarily a con, but something that all should know going in! You move 3 - 5 times during the year, so should be ready to do that and be flexible."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "\"Keep Calm and Exploit On!\"", "rating": "2.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "19 Mar 2017", "job_title": "Field Organizer in Denver, CO", "duration": "N/A", "pros": "- Travel for work! (I worked in 4 states in 6 months!)\r\n- Immersive Training\r\n- Classmates = Great Pals for Life", "cons": "- Model depends heavily on taking advantage of college graduates\r\n- Exploits young passionate activists \r\n- Illegal hours and not paid overtime (98 hours/week 7 days/week for the elections!)\r\n- Absolutely resistant to constructive and crucial feedback\r\n- Recruits in places of privilege (universities, often private)\r\n- Whitewashed and not actively creating an intersectional/anti-racist environment for organizers of color\r\n- Does not believe Burn Out exists! (allowing them to be guilt-free when working us an illegal amount of hours)\r\n- Emotional manipulation (guilt-tripping organizers for the sake of quotas)\r\n- No housing in new cities // alone in new cities\r\n- Disturbing \"white savior complex\"\r\n- 40-50% drop-out rate \r\n- Sued the Department of Labor to court to ensure that we were not paid for overtime (and won)"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 0, "Senior Management": 3, "review_title": "intense but rewarding program", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "29 Nov 2017", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "- great training program \r\n- extensive alumni network + help with job placement after GC\r\n- amazing classmates \r\n- experience running your own campaigns\r\n- weekly support/guidance/feedback from staff manager (though not in same location as you)\r\n- lots of travel!\r\n- 3 years of job experience in 1 year", "cons": "- working around the clock \r\n- not much help finding housing in new campaign locations\r\n- unreasonable deliverables / too much focus on numerical targets\r\n- lack of justice lens in trainings and campaigns"}], [{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 3, "Senior Management": 5, "review_title": "Green Corps", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "Green Corps is a great program for launching your career in environmental organizing.  If you want to work on environmental issues, but perhaps have never organized before (or want to be a better organizer), Green Corps will definitely give you the training you need to get a great job with an enviro organization. \r\n\r\nBest things about it:\r\n*Get a diversity of experience:  In your year, you'll work on several different campaigns with several different environmental groups.  The campaigns will have different goals and tactics, and you'll be introduced to people from groups with different missions and organizational cultures. Great way to see what is out there.\r\n*Network with lots of leading environmental groups.  You'll likely work with groups like the Sierra Club or Food & Water Watch and others during your year, so you get to see first-hand what working for them would be like, and get to meet many people at those organizations.\r\n*Great trainers. Bring trainers from across the enviro and social change movement.  Not just GC alum, and not just enviro campaigners.  Lots of different perspectives in training.\r\n*Great staff.  Central staff is incredibly hard working and will provide you with lots of support.\r\n*Great friends/classmates: your class will have passionate, smart, like-minded people...people who you will rely on through the year, and stay friends with long after.\r\n*Alumni network: great support system and network for jobs after GC.", "cons": "Some of these are cons, some of these are just 'things to be aware of'...\r\n\r\n*Green Corps is not easy.  You will work long hours, and sometimes odd hours, including nights and weekends a lot of the year.  The point, of course, is to fit a huge amount of training and experience into 13 short months, but you need to be ready and willing to work hard and give it your all all the way through. \r\n*Green Corps is all about field organizing.  This means getting out in the community and talking to people, organizing community meetings, working with volunteers, etc.  Not a typical desk job. If you're looking to do research on X policy solution to climate change, you will not be doing that here.\r\n*You will move around during the year.  You'll work on 3-5 campaigns, and these likely won't be in the same city. You need to be flexible on where you're willing to live and work, and ready to go where you're needed.  This can be super fun, as you get to see lots of places across the country and meet all sorts of people, but can be a little difficult to pick up and move every 3-4 months.\r\n*Salary is relatively low. You will get paid enough to live on, and get good benefits like healthcare coverage and student loan repayment, but don't expect to save much during your year."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 0, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 0, "Senior Management": 5, "review_title": "2+ yrs of experience in 1 yr", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "22 Oct 2019", "job_title": "Fellow in Denver, CO", "duration": "N/A", "pros": "- very accessible and large network of alumni that work for a wide variety of environmental and social change organizations\r\n- fellows and central staff care deeply about the issues and are generally great, smart people that become friends\r\n- given a lot of responsibility that makes you an attractive candidate for entry level jobs at other environmental/social change organizations", "cons": "- you must be ready to work very hard and understand that you can be sent (truly) anywhere in the U.S. you will relocate 3+ times."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Great opportunity to make an impact while learning how to organize & advocate for the environment", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "15 Jan 2019", "job_title": "Organizer in Denver, CO", "duration": "N/A", "pros": "Green Corps offers a one-year training program in field organizing on environmental issues, and you'll walk away with some serious organizing chops, a solid grasp of the skills it takes to be an effective change maker, and a lot of campaign experience under your belt.", "cons": "Making change is hard work! Expect to roll up your sleeves and put in the hours, and it is worth the effort."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Great company", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "1 Aug 2016", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Good environment, complex business with a variety of issues to manage in order for the business to flourish, from big investment decisions to productivity issues.", "cons": "Perhaps this is a too small player in its field and should perhaps merge with an interesting bigger European player where Green Corps could be the distinctive partner to inspire bigger merger partner to become distinctive."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 3, "Senior Management": 5, "review_title": "Excellent Training and Real World Experience", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "13 Nov 2017", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Green Corps is the best program to learn how to organize people effectively and run smart campaigns. You will learn a ton and get hands on experience running cutting edge campaigns. They have a great training program, access to excellent networking opportunities, and a rigorous hands-on model to have an impact on important issues right away.", "cons": "It is a crash course in environmental organizing so there can be some long hours"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Get ready to learn A LOT", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "15 Jan 2019", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Green Corps is a one-year learning experience that provides young professionals with an opportunity to experience and learn more about the environmental movement than the majority of other entry-level opportunities in this field. It's a great network after the year is over, too!", "cons": "You need to be ready to work hard - very hard -  but you get out of it what you put into it. It's a short term program with long-term gain."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "N/A", "Work/Life Balance": 1, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 1, "Senior Management": 4, "review_title": "Green Corps Review", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "Crash course in professional skills, introduction to basics of grassroots organizing, social network of activists, exposure to different non-profits", "cons": "Expectation of working over 80 hours / week, large proportion of time spent on cold calling and street petitioning, extreme emphasis on meeting performance metrics"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Burnout City", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "9 Dec 2015", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Green Corps does look nice on a resume and completing the year will provide you with great connections in the organizing world. It's a good kickstart to a career if you have no interest in a work/life balance or if you do you're willing to sacrifice your sanity for a whole year and possibly beyond.", "cons": "Green Corps asks entirely too much of it's employees, and unnecessarily at that. There is little to no diversity in the hires here, the 60-80 hour work weeks are more often on the higher end of that spectrum, and to keep you going at such an unreasonably fast-paced rate they employ vaguely cult-like socializing tendencies that can almost seem positive right up until you start taking a step back to question them and then higher-ups question you. If this is such important work, they should not be making it so difficult for their young and impressionable employees to do it. This model would not work on any group of people beyond naive recent college grads."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "N/A", "Work/Life Balance": 1, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 1, "Senior Management": 0, "review_title": "Find something else", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "30 Jun 2019", "job_title": "Organizer", "duration": "N/A", "pros": "Pros are the people. But you can find cool people other places too.", "cons": "Extreme lack of diversity, unrealistic expectations, culty, corporate, top-down activism, lots of scripts, overworking, no housing provided, everyone has regular breakdowns... If you are passionate about activism/organizing/the environment find a local org instead whose focus is more intersectional and where you'll have some amount of input and flexibility. The Public Interest Network is very corporate and can be extremely frustrating to work for. ~25% of each green corps class ends up quitting."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Top notch program!", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "Best program in the country for those wanting to professionalize their environmental activism. You can't get better training, professional development, alumni networking, or hands-on impact for the environment.", "cons": "Requires commitment and hard work."}], [{"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Great interview process", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "3 Jun 2013", "job_title": "Green Corps Organizer", "duration": "N/A", "pros": "They get to know you just as much as you get to know them during the phone interview and then subsequent in person interview", "cons": "Not too bad to get to Boston, but was a travelling weekend."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 0, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 0, "Senior Management": 3, "review_title": "Rewarding experience!", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "Feel like you are contributing to meaningful work; great people; get to travel all over the US; great resume builder", "cons": "never feel entirely stable, long hours, not a tons of pay"}]]