[[{"date": "19 Jan 2023", "title": "HVAC Instructor Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Charter College (Anchorage, AK)", "Interview Descriptions": "Was great until meeting department head who obviously was bent on proving his opinion by annoyingly reiterating questions which quickly became interrogatory he became even more annoying at the mention of my state license in the field and excellency certs which he apparently lacked. By Third interview was clear he's afraid of anyone with more experience, credentials and teaching ability.. he asked questions which anyone with real world experience would know can't be answered by a text book. I immediately declined to continue as there was no way I'd ever work under anyone like that and feel sorry for anyone who has no choice. The fact that someone like that was unofficially over a department and allowed to conduct final interviews alone also showed me that it was more the company than him as he was holding on to what was likely one of few dwindling career options. Don't waste your time unless you have no other choices", "Interview Questions": "Get ready to get asked the same question several times until it becomes insulting and you question the intellect and attention span of the interviewer"}, {"date": "26 Oct 2022", "title": "Campus Support Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Charter College (Vancouver, WA) in Sept 2022", "Interview Descriptions": "The interview was encouraging and comfortable. My interviewer asked great questions. The whole process felt like a friendly conversation instead of an interview. I was set at ease from the moment I walked in the door and was greeted warmly.", "Interview Questions": "What are you work pet peeves? Tell me what you think the job means to you? How would you rank, kindness, transparency and honesty"}, {"date": "31 Mar 2021", "title": "Front Desk Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Charter College", "Interview Descriptions": "Group Interview first. 2nd Interview by yourself. Group Interview was overwhelming trying to stand out from the crowd. 2nd Interview was one on one and  more official met with supervisors.", "Interview Questions": "They asked about previous roles and experience "}, {"date": "27 Oct 2020", "title": "Admissions Representative Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Charter College (Anchorage, AK) in Oct 2020", "Interview Descriptions": "First interview was a group interview. Those are always so awkward. You know you have competition but it’s so much more uncomfortable when you are in the same room and answering the same questions. But also gives you a good idea of what your competition is.\r\nI was scheduled for the second interview within 10 minutes of finishing the group interview. \r\nSecond interview was just me and the president of admissions.", "Interview Questions": "What is your favorite vegetable? \r\nWhat is a goal you currently have for yourself that you want to accomplish by the end of this year?\r\nTell me about a time that you had a problem at work and how you resolved it.\r\nTell me about a time where your ethics were compromised and how you overcame it."}, {"date": "2 Apr 2019", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Charter College (Vancouver, WA) in Mar 2019", "Interview Descriptions": "this interview was in a group interview, they wanted a person to start working a week after interviews took place. It seemed like they were in a bit of a rush since all of the interviews(group of 20 or so people) happened a week before the start date", "Interview Questions": "what kind of skills should a person posses who works in customer service?"}, {"date": "11 Apr 2019", "title": "Admissions Representative Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Charter College in Sept 2018", "Interview Descriptions": "first there was a group interview with approx. 20 people and approx. 3 days later was called in for a one on one interview with the dept. head. An offer sheet was sent a few days later", "Interview Questions": "are you competative"}, {"date": "21 Jul 2018", "title": "Admissions Representative Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Charter College (Oxnard, CA) in Jul 2018", "Interview Descriptions": "It was a group interview of about 10 people and it took forever for everyone to give their answer they should condense the amount of people  but overall people were funny and made you relax", "Interview Questions": "What is one reason why people might fail at this position "}, {"date": "7 Jun 2018", "title": "Instructor, College Or University Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Charter College in Jun 2018", "Interview Descriptions": "The interviewer was professional, thorough, and polite.  The call was on time and lasted approximately 30 minutes. Addressed all of my questions with specific answers.  Referred to job description and upcoming email for information.", "Interview Questions": "Tell me about your past teaching experience"}, {"date": "6 Apr 2018", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Charter College", "Interview Descriptions": "I had been emailing with Arde trying to set up a phone interview. On the agreed upon date I had to leave work early and never received a phone call at the time we had set up. I never received an apology email and ended up emailing them to withdrawal my application. I have not yet received a response.", "Interview Questions": "No questions asked."}, {"date": "22 May 2018", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Charter College (Anchorage, AK) in Feb 2018", "Interview Descriptions": "The interview was a group interview between 8 people and it was a go around the room style of Q and A session. The interview lasted about 45 minutes and afterward about 24 hours I was given a call for the second interview fir the 1 on 1.", "Interview Questions": "How do you deal with change? What is your biggest weakness? Why do you want to work for Charter College?"}], [{"date": "22 Dec 2017", "title": "Admissions Representative Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Charter College (Fife, WA)", "Interview Descriptions": "it was pretty standard. there was a phone interview and an in person interview. the questions were mainly sales focused. this is basically a high pressure sales job.  after the phone interview I was scheduled a panel interview and had to take an ACT test.", "Interview Questions": "\"do you believe there is life in outer space ?\""}, {"date": "30 Jul 2017", "title": "Admissions Representative Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Charter College", "Interview Descriptions": "I met with the Campus President and then the Director of Admissions.  The Director of Admissions was meeting with a student.  I had to leave for an hour and come back to finish the interview.  They gave me a tour of the campus and followed up the next day with an offer.", "Interview Questions": "Do you believe there are aliens?"}, {"date": "30 Jul 2021", "title": "Enrollment Processor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Charter College in Jun 2017", "Interview Descriptions": "Checked in and interviewed with a panel and did a round 2 solo interview. Questions were the same general ethical questions, problem-solving and position qualification questions as well as a team player type questions.", "Interview Questions": "What is the definition of Common sense?"}, {"date": "21 Apr 2017", "title": "CTSS Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Charter College (Vancouver, WA)", "Interview Descriptions": "Initial phone interview and group in-person interview.  All was very professional and executed well.  Beautiful offices and complex; designed to impress.  Office staff were professional and courteous.  Any questions after the fact were answered quickly.", "Interview Questions": "IT professional, been in the industry for over 15 years"}, {"date": "16 Aug 2021", "title": "Admissions Representative Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Charter College (Pasco, WA) in Mar 2017", "Interview Descriptions": "Interview process is personal or remote depending on location and local campus permission level due to COVID protocols. Local Manager and campus intro related to programs and company vision statement.", "Interview Questions": "Tell me why you want to be a part of the Charter Team?"}, {"date": "27 Jun 2016", "title": "Career Services Officer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Charter College", "Interview Descriptions": "They are desperate for employees because the turnover is so high. They'll ask any ridiculous question to make it look like an interview. They then rush through a background test to immediately hire whoever they can.", "Interview Questions": "What would you do if you had a student show up in a club dress and purple hair for an interview?"}, {"date": "24 Jun 2016", "title": "Admissions Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Charter College (Anchorage, AK)", "Interview Descriptions": "Applied online was then invited to a group interview 9 or so people. When they went around you could tell almost immediatly by the answers to the questions who was getting called back. I was one of them. Phone interviewer asked questions to see if you can think on your feet.", "Interview Questions": "Have you ever read interviewing for dummies???"}, {"date": "29 Apr 2016", "title": "Campus Support Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Charter College (Santa Fe, NM) in Apr 2016", "Interview Descriptions": "After submitting my application, I was contacted via email to set up an initial Skype interview. The initial interview took place per the agreed-upon date & time. The young woman in Utah who conducted the interviewed was very pleasant and professional. The interview lasted approximately 20 minutes, after which time I was told I'd be contacted (via email) for a follow-up/secondary interview with another individual in management.\r\nThe next interview was arranged as before, and a new date & time set. This time, however, I received a phone call at the designated hour from the woman with whom I was supposed to interview; she explained that she worked remotely, from home, and was experiencing disruptions due to maintenance testing of the fire/CO2 alert system at her residence, which resulted in a loud alarm going off at frequent intervals. She apologized and requested to reschedule the Skype interview. I understood, of course, and we rescheduled the interview for the following day at 5 PM my time.\r\nThe next day, I waited at my laptop, my cell phone at my side, from 4:30 to 5:45, but she never called, either by Skype or phone. I checked my email in the meantime, but no message. In the days that followed, I did not receive any follow-up emails or phone calls from anyone at Charter College to clarify or explain the situation. I let it go, as I felt it might well be indicative of a lack of professional organization, communication and/or integrity, and was sure I didn't want to work with a management team that wasn't able to demonstrate these core characteristics within the interview process.", "Interview Questions": "You've spent many years teaching; why do you want to work for Charter College in a non-teaching Support Specialist role now?"}, {"date": "7 Apr 2016", "title": "Student Records Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Charter College (South Jordan, UT) in Mar 2016", "Interview Descriptions": "Group interview, with 6 or more people. Asking questions from each person, going around in a circle asking the same question  , giving the next person time to think how to answer the question.  EVERY one saying the same thing 6 times over again and again.  THE WORST INTERVIEW PROCESS THAT I HAVE BEEN TOO.", "Interview Questions": "1 st interview, what would you do if you didn't get the job?\r\n2nd interview question,  you have 5 minutes to tell the student that she is not presentable for a job interview , what would you say and how would you tell her she needs to be more presentable for an interview?"}], [{"date": "13 May 2016", "title": "Admissions Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Charter College (Sandy, UT) in Feb 2016", "Interview Descriptions": "After uploading my resume and filling out the application online, I had to complete 2 very long questionnaires that took about an hour each. I was emailed 5 days later to schedule a phone interview with the hiring manager 2 days later. After the phone interview, I was invited to an in-person interview with the Director of Admissions. \r\nThere was a scheduling conflict and the Director of Admissions was meeting with another interviewee when I arrived. I had to wait for 15 minutes before I met with the Assistant Director of Admissions.", "Interview Questions": "Standard interview questions"}, {"date": "12 Oct 2015", "title": "Director of Career Services Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Charter College", "Interview Descriptions": "Phone with HR then in person with campus president (group), then 1:1 with campus president. It was my second group interview at this level and this one was done right. Sharon the campus president was clear about the campus needs and the interviewees left with a clear indication of the job.", "Interview Questions": "will not share, relevant and job related."}, {"date": "5 Aug 2015", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Charter College (Lynnwood, WA)", "Interview Descriptions": "They make you take an extensive online skills and personality assessment first.  Then a telephone screening interview.  Then you get to an interview.  I was made an offer during interview.", "Interview Questions": "How do you provide exceptional customer service?"}, {"date": "30 Jul 2015", "title": "Admissions Representative Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Charter College (Salt Lake City, UT) in Jul 2015", "Interview Descriptions": "The process began with an email from a very pleasant and helpful corporate recruiter named Arde.  I can't say enough good things about how helpful Arde was during this entire process.  After finishing the application, taking an initial vocation/personality test, I had a phone interview with Arde which went relatively well.  Following the phone interview, I was emailed five questions to answer regarding the position, what I had learned about the College, and how I planned to meet the goals and objectives of being an AR at Charter.  The final step was an in-person interview with Jill, whose job title I believe was Operations Manager.  Good luck finding the office though, as it was poorly labeled, tucked away all neatly among many other non-related businesses, and isn't even called Charter College ... but that's another issue entirely.  \r\n\r\nJill was also nice, and her questions were pretty straight forward about the job and how I would be able to meet the very rigid quota system they had established.  I got the very distinct impression through Jill's questions, however, that the goal of this position had very little to do with what was best for the student.  This is a position geared more towards the used car salesmen sector than it is a typical Admissions Representative role.  If you care about students and want to help them make decisions that will actually benefit their lives, look at one of the many other local colleges and universities in the area. If you can sell a used convertible during a rain storm, however, you will do just fine here.", "Interview Questions": "Would you ever bend the truth or embellish certain details in order to sell a student on enrolling at Charter?"}, {"date": "22 Jan 2015", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Charter College (Spokane, WA)", "Interview Descriptions": "There wasn't much to the interview. They simply asked a few basic questions, asked for any certifications and offered me the job about 3 days later. I assume they did a background check. I was provided materials for the job on the first day or shortly thereafter", "Interview Questions": "Can you start Monday? (it was Thursday)"}, {"date": "22 Sept 2016", "title": "Admissions Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Charter College (South Jordan, UT) in Jan 2015", "Interview Descriptions": "It was a long and hard process but it ended put turning out pretty good and I was employed by charter college when I was done. So win win I guess you could say.", "Interview Questions": "Typical interview questions "}, {"date": "9 Nov 2014", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Charter College (Long Barn, CA)", "Interview Descriptions": "The interview process was a little lengthy but overall a painless experience. I had an over the phone interview, then an in person interview with the Regional Director of Admissions an In person Interview with the Director of Admissions and then Meet and greet with the President of the school.", "Interview Questions": "No unexpected questions. Tell me about your self, tell me about a time when...., then overview of the position and what the expectations were. "}, {"date": "26 Nov 2014", "title": "Federal Workstudy IT Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Charter College in Nov 2014", "Interview Descriptions": "For this work study, the interview was given in daily interaction. I am often found in the library studying. Charter College provides an IT lab and the instructor operates a non-profit organization. It is important to have utmost integrity even though this is an entry-level position. The WYSIWYG applies. There is a delay in regards to background check and verification with the Department of Education. If there is no answer to being hired, be patient. The delay is not in the supervisor or the career development specialist.", "Interview Questions": "None were given. This interview occurred in a series of conversations."}, {"date": "30 Sept 2014", "title": "Admissions Representative Interview", "results": "No Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 days. I interviewed at Charter College (Canyon Country, CA) in Sept 2014", "Interview Descriptions": "I filled out an online application and completed an assessment test that took almost an hour, so be prepared to spend time on it.\r\n\r\nThe next day I was contacted via email by the recruiter (Arde) to complete a questionnaire for their sales position.  This one was only took about 20 minutes, and I received a copy of the results which was cool.\r\n\r\nTwo days later I was contacted again by the same recruiter for a telephone interview and it was arranged for the next day.  The call took about 40 minutes and I was asked a lot of questions about sales, my sales style, overcoming objections, being comfortable in a quota environment and working in a short sales cycle.  The recruiter spent the first several minutes stating all the requirements of the position, the company and the hiring process which was nice because I had the information up front, but then I didn't have a lot of questions to ask at the end because they had already been answered.  \r\n\r\nThe next morning I received a no thank you email from the recruiter (Arde)", "Interview Questions": "You stated that this was the perfect position for you, yet you were unable to answer my questions about who we are, and the student we serve.  Please explain how you would be able to make an educated decision about joining our company if you did not conduct research on us."}, {"date": "9 Sept 2014", "title": "Admissions Representative Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Charter College (Vancouver, WA) in Aug 2014", "Interview Descriptions": "You will submit your resume and then take an online test that will qualify or disqualify you immediately! It is the Biggs test. You don't need an associates or any degree to get a job here! They want pushy aggressive car sales people personalities that have few morals.\r\n\r\n If you get called into for an interview you'll meet with the DOA who is the car salesperson personality totally so talk sales and tell him you are wonderful. Please make sure you get your promises in writing and that you do not sign the arbitration agreement. If you meet the President, you are likely going to get an offer but again, read, read and buyer beware!", "Interview Questions": "none, all sales based"}], [{"date": "23 Jul 2015", "title": "Financial Aid Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Charter College (Canyon Country, CA) in May 2014", "Interview Descriptions": "Interview process started with a phone interview with HR Recruiter.  Then, a group interview with regional director and all other potential candidates happened within 2 weeks.  Final step was an in-person interview with the Campus President.  An offer was made within 1 week.  Employment and working in my position took 5 weeks total.", "Interview Questions": "How do you feel you can contribute to overall campus success?"}, {"date": "20 Nov 2015", "title": "Admissions Representative Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Charter College (Vancouver, WA) in May 2014", "Interview Descriptions": "Phone from corporate, Ardie and then in person with the DOA and maybe some reps\r\nThe DOA will like you right away or not. If you are bubbly, even with no experience, you'll get the job. If you are older, say over 50, don't bother because they are horrible to older employees.  Dress professionally.", "Interview Questions": "Normal everyday questions although the reps might ask more personal ones that aren't\r\nallowed to be asked. Charter doesn't follow the rules however"}, {"date": "5 Mar 2014", "title": "Admissions Representative Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Charter College (Vancouver, WA) in Feb 2014", "Interview Descriptions": "I submitted an online application with the online assessments. They were pretty time consuming test. It took me about 1.5 hours to complete. I was contacted within 3 days by Arde a corporate recruiter. We arranged a phone interview. I prepared for the phone interview and to my surprise Arde never called! She sent me a email about 10 minutes after our scheduled phone interview to reschedule. I thought this was highly unprofessional but I agreed to reschedule. The phone interview went well. We spent about 30 minutes focusing on why choose a career in sales and what do you know about their school. \r\nI went on to the next interview with the director of admissions. He informed me before the interview started that the position had been filled and there was a mistake on their part. We proceeded with a quick meeting/interview since I was there already. He implied that that interview would be considered if another position that met my qualifications opened. Overall I was glad I didn't get the position. My first impression of the company was there was something very shady going on. Be aware of first impressions.", "Interview Questions": "Explain using a talk track/overcoming objections."}, {"date": "24 Dec 2013", "title": "Assistant Director of Carrer Services Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Charter College", "Interview Descriptions": "You have to submit your application and take a personality test.", "Interview Questions": "N/A"}, {"date": "9 Aug 2013", "title": "Admissions Representative Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Charter College (Lynnwood, WA) in Jul 2013", "Interview Descriptions": "I applied online Sunday night. I was emailed to take a 1-hour assessment test online. The assessment took over an hour as it consisted of extremely advanced math questions (i.e. algebraic equations, ratios, and word problems), English (i.e. mainly analogies and word comprehension), and self-assessment questions (i.e. basically rating yourself on various topics), which I aced! I was contacted by Arde, a corporate recruiter for the company, to complete TWO ADDITIONAL assessments online. One assessment was in complex math (which was timed) and the other assessment was a self-questionnaire. After I completed all the unnecessary assessments, Arde contacted me to set up a phone interview. She conducted a 30-40 minute long phone interview, which I aced! I was then set up to meet with the Director of Admissions and Campus President a few days later. I arrived 45 minutes early to the interview (just wanted to be on time) and ended up waiting 30 minutes past my scheduled interview. I was a bit pissed because that is very unprofessional. Neither the President nor the Director of Admissions came out to say they were sorry. Once I finally was invited to interview in the President’s office, I was hounded with questions left and right WITH NO TIME TO THINK. I would barely finish answering a question with one person, and the next person would fire off another question. It went that way for a good 30-35 minutes, and I was absolutely exhausted. The whole interview felt very unprofessional and ruthless. Both the President and Director of Admissions were cold, inconsiderate, and misleading. Even after all that, I still felt I aced the interview! Well, the next day I received an ambiguous email from Arde (the recruiter) that they will be moving forward with other candidates that more closely fit the position. AT THIS POINT, I AM SO PISSED THAT it took me a while to realize: I AM TOO GOOD FOR THEM. I don’t need to work in such a negative and unprofessional environment and horrible management team. All in all, the whole thing left a sour taste in my mouth.", "Interview Questions": "They asked questions that had nothing to do with the position requirements, scenarios, or duties. However, the horrible management kept asking about numbers, results, and ruthless recruiting tactics. "}, {"date": "27 Jul 2013", "title": "Education Loan Specialist and Admissions Representative and Enrollment Processor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at Charter College (Pasco, WA) in Jul 2013", "Interview Descriptions": "I had initially interviewed for the enrollment processor position a couple of years ago with Arde out of Vegas, a corporate recruiter. She did not pass me on and the interview questions were standard but she seemed disinterested. I interviewed again recently in 2013 with Ash, another corporate recruiter for the Education Loan Specialist Position and he was very good with his interviewing and thoroughly engaged with everything I had to say and referred me on to the Regional Financial Aid Director. She had a great attitude and seemed completely impressed with me and referred me onto the President of the College. The President was a very nice man and said that I  must have impressed them to make it that far and it was his job to see that I would be a good fit and told me that he felt I would be but had to discuss with the CEO and would get back to me in a week. Two days later the recruiter sent a pat email that the position had been cancelled but to apply for other open positions. I applied for the Admissions Representative position and again had an interview with Arde from Vegas. She tried to say that the reps had been there for a long time and they were mature. She asked me to describe what I thought the student population was like and she informed me that I described it well and she asked me to tell her how I would be relatable to them. I thought I described it well enough but during the interview process she seemed completely disinterested in me again just like the first time. At the end I asked her if she had any concerns with my abilities and she said tell you what you can take another assessment and then if your results are ok I will refer you on. Well the first assessment I took the other recruiter told me that my results were very good and it looked like the kind of person the college wanted but this time I just got a pat email from Arde that they would be pursuing other applicants so after three tries with this company and getting a disinterested recruiter and a job cancel and even having the President tell me he thinks I am a good fit but the recruiters just pass on me, I don't get it. My family told me to forget about this company because they were just wasting my time.", "Interview Questions": "How are you relatable to the student body."}, {"date": "17 Jun 2014", "title": "Student Services Representative Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Charter College (Valencia, CA) in Jun 2013", "Interview Descriptions": "Filled application out online, received email offering phone interview. Scheduled time over email. Phone interview lasted approximately 30 minutes. Interviewer spent approximately five minutes describing the company and campus that job  was located. Most questions were about previous work experience and desired salary. Interviewer did not give a specific timeline on notification and did not imply there would be further interview process.", "Interview Questions": "Describe how you would maintain organization in a business that has high turn over and where accuracy is essential? "}, {"date": "7 May 2013", "title": "Career Service Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Charter College", "Interview Descriptions": "Basic questions.\r\nEmployment history relevant to the position", "Interview Questions": "N/A"}, {"date": "3 Nov 2014", "title": "Library Coordinator Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Charter College (Fresno, CA) in Sept 2012", "Interview Descriptions": "You apply online and immediately are asked to complete an online assessment including math, grammar, scenario type questions etc. If you fall into the \"range\" in categories for the job you have applied for, you are contacted by a Corporate Recruiter for a telephone interview, If he or she approves, you will be interviewed by the Librarian. If he or she approves you will likely get a campus interview. It is the campus people who will make the ultimate decision.", "Interview Questions": "How would you engage students in teaching a difficult concept?"}, {"date": "15 Aug 2013", "title": "Campus President Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 6 weeks. I interviewed at Charter College (Vancouver, WA) in Dec 2011", "Interview Descriptions": "Thorough application. Submit Resume, take initial assessments, phone interview, 2 in person interviews on campus. Background and reference checks.", "Interview Questions": "N/A"}], [{"date": "13 Oct 2015", "title": "Admissions Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Charter College (Bellingham, WA) in Nov 2011", "Interview Descriptions": "The interviews were lengthy and very thorough. I applied online and was immediately sent a long online assessment. I then was directed to HR for a phone interview followed with a face to face interview. \r\nAt the interview, I had the opportunity to sit for an extended amount of time with the campus president and then had a second interview with the Director of Admissions who flew in to meet me. The company had just offered the position to someone else a week prior, and recommended me two weeks later to a position in Career Services, which surprisingly was a perfect match for me!", "Interview Questions": "Why did I think I would be a good fit for their company"}, {"date": "2 Aug 2011", "title": "Recruitment, Then Discussed Director of Admissions Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Charter College (Reno, NV) in Jul 2011", "Interview Descriptions": "Applied through CareerBuilder.  Next contacted by email to take a 1 hour assessment test online.  I was then contacted by an in-house recruiter to try and dissuade me from the job, as I was overqualified.  Discussed the fact that most companies will get more than they paid for due to the abysmal job market.  She set up an interview with the 'president' of the online campus.  I was told by the recruiter not to be surprised if the interview started to lean towards the director position (in reality, a sales manager).  Met with 'president' of the online school and we immediately decided I was way over qualified for the position, but my background fit into their growth plans from a marketing and business development standpoint.  We discussed a number of ideas to assist in the growth of their business (amounted to free consulting) and she would push my name and credentials up the ladder as they had an executive meeting the next day.  She said she would get back to me.\r\n\r\nNothing......\r\n\r\nSent 2 followup emails outlining our conversation, highlighting areas of greatest return on investment and my willingness to assist.\r\n\r\nNot even the courtesy of a response.\r\n\r\nWhat I learned from this boiler room educational company is that they fit in well with the continued degeneration of education in the state as well as the country.", "Interview Questions": "You are overqualified.  What makes you think you would stay?"}, {"date": "11 Feb 2013", "title": "Library Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Charter College (Reno, NV) in Jun 2011", "Interview Descriptions": "I was asked to take a 1-hour \"skills test\" that actually ended up taking 3 hours. There were a lot of extremely advanced math questions, and I could not imagine why anyone would need to pass these questions for this type of job.", "Interview Questions": "How someone as \"smart\" as me would work well with the demographic of a career college. I was uncomfortable with their roundabout way of explaining their demographic."}, {"date": "18 Feb 2014", "title": "Director of Career Services Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Charter College (Lancaster, CA) in Sept 2010", "Interview Descriptions": "Complete online application\r\nTook personality assessment\r\nPhone Screen with Recruiter from Home Office\r\nPhone Interview with Regional Director of Career Services - we discussed the dynamics of the team, the needs of the organization, and the issues happening with this particular department. \r\nFace to face interview with Campus President and Regional Director of Career Services. Last 2 hours", "Interview Questions": "The previous person in this position was demoted and is still on the team: How would you manage her and the team knowing this?"}, {"date": "30 Jun 2009", "title": "Admissions Representative Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2+ months. I interviewed at Charter College (Long Beach, CA) in May 2009", "Interview Descriptions": "The process was frustrating.  I submitted my information as requested.  I then had to follow up by, among other things, calling their national headquarter in Nevada.  After getting a run-around for several weeks, I was given two telephone screens.  Since I made the grade, I was then given a battery of online tests.  I passed them successfully.  I then was brought in to the office for an interview with the Admissions Director.  An interview that lasted over an hour and a half.  Things looked promising.  I was called in for a follow-up interview with the president.  That interview started with the basic, \"Tell me what you know about our company.\"  So trite.  It went downhill from there.  I did not feel a connection with the President at all.  \r\n\r\nI had been told that they were anxious to get someone in the position ASAP.  Everything looked like a \"go.\"  Then, after waiting for a week, I called the office to find out the status of my interviews.  No response.  They had highlighted in the interview how much they valued follow-up.  I called again and again received no response.  \r\n\r\nI eventually received a call from the HR Manager, who was based in their Nevada office.  She said that the Admissions Director was no longer with the company and that they would no longer be pursuing employment with me.  She apologized that she couldn't give me additional information or feedback on my interviews.\r\n\r\nSo, after successfully passing their tests and being through numerous interviews, I did not get the job.  What started as an exciting venture ended as an experience which left a sour taste in my mouth.", "Interview Questions": "Tell me about yourself."}, {"date": "19 Sept 2013", "title": "Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Charter College (Canyon Country, CA) in Jan 2009", "Interview Descriptions": "Long. First you submit resume online. Next you take a personality test and Intelligence test.  Next you go through a phone interview then and in person interview and finally a teaching demo.", "Interview Questions": "Teaching Demo.  Make it relate to the field you are expecting to teach."}, {"date": "22 Nov 2010", "title": "Admissions Representative Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Charter College (Anchorage, AK) in Aug 2008", "Interview Descriptions": "Starts with a brief phone interview\r\nOnline Persoanlity Test followed by basic English and Math test\r\nFace to face interview with Director of Admissions\r\nFace to face interview with Campus President\r\nOffered job 3 days later", "Interview Questions": "Describe a problem you have had with a customer and how did you overcome it?"}]]