[[{"date": "10 Oct 2022", "title": "Architect Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Franciscan Missionaries of Our Lady Health System", "Interview Descriptions": "Smooth, professional, courteous, hiring manager plus a coworker. It took about an hour to discuss my knowledge plus answer questions that I had. Average company, but the interview process was one of the better processes I have been through.", "Interview Questions": "Name a technical situation you weren't equipped for and how you handled it."}, {"date": "13 Sept 2022", "title": "Certified Medical Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. The process took 2 weeks. I interviewed at Franciscan Missionaries of Our Lady Health System (Monroe, LA) in Aug 2022", "Interview Descriptions": "I didn't feel nervous even though I was interviewed by 3 people at the same time its the first time I wasn't scared to answer everyones questions. Everyone made me feel not pressured and really interested in what I had to say. ", "Interview Questions": "Where do you see yourself in 5 years? "}, {"date": "25 Jun 2021", "title": "Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Franciscan Missionaries of Our Lady Health System", "Interview Descriptions": "Interviewer and team was authentic and interested.  Lead interviewer was very interested in learning about candidate's background.  Team asked their own questions about experience and how it related to job.", "Interview Questions": "Tell me how you work with others."}, {"date": "20 Sept 2021", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Franciscan Missionaries of Our Lady Health System (Baton Rouge, LA) in Nov 2020", "Interview Descriptions": "The interviewing process was extremely easy, they asked me questions about my previous job duties as well as answered any questions I had honestly. They were very transparent and respectful about everything that they said.", "Interview Questions": "What are you looking to gain from this opportunity?"}, {"date": "8 Mar 2020", "title": "Medical Coder III Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Franciscan Missionaries of Our Lady Health System", "Interview Descriptions": "First contact by email with Recruiter sending Digital interview invitation.\nSecond contact by phone with Recruiter senting up face to face interview.\nInterviewed with Director who had coding questions, Manager who had situational questions, and Supervisor who had EHR System Questions.", "Interview Questions": "How many encounters per hour can you coder?"}, {"date": "4 Feb 2017", "title": "Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 2 weeks. I interviewed at Franciscan Missionaries of Our Lady Health System (Baton Rouge, LA)", "Interview Descriptions": "Went in and talked to the hiring manager that oversees the department I was to work for; HR then called me to offer the position and advise the salary. I accepted, then received a packet of documents explaining what to expect, and had a website for me to go complete all the necessary information. It was very well planned out.", "Interview Questions": "Hiring Manager asked about my work background and willingness to work overtime\r\nWe discussed these for a bit, then HM told me about the job I interviewed for, then what to expect after our interview."}, {"date": "19 Jul 2017", "title": "Accounting Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. I interviewed at Franciscan Missionaries of Our Lady Health System (Baton Rouge, LA) in Jun 2016", "Interview Descriptions": "Interviewed with supervisor then director joined the interview. When the interview was done the director left and the supervisor said many negative things about the director. The interview only lasted 10 minutes and they asked all personal questions and no questions related to the position I applied for.", "Interview Questions": "Are you a morning person, because we start early."}, {"date": "2 Apr 2016", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Franciscan Missionaries of Our Lady Health System (Baton Rouge, LA)", "Interview Descriptions": "Two phone interviews (1 with recruiter and 1 with Director), 1 in person interview, and then an offer. The interview was extremely easy and felt they just needed someone to fill the position.  Once the offer was extended, I didn't hear from anyone until I received a confirmation informing me of the start date.", "Interview Questions": "Basic interview questions"}, {"date": "19 Feb 2020", "title": "IS Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Franciscan Missionaries of Our Lady Health System (Baton Rouge, LA) in Jan 2016", "Interview Descriptions": "Interview was a multi group interview handled in a very friendly and professional manner, after a phone screen. A one-on-one was the final with my direct supervisor.  It was all very conversational and relaxed for the most part.", "Interview Questions": "How much integration experience I had"}, {"date": "15 Jul 2017", "title": "Unit Clerk Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Franciscan Missionaries of Our Lady Health System (Gonzales, LA) in Jan 2015", "Interview Descriptions": "I did a video interview, followed by a peer and management interview. The entire process took approximately three weeks, and then I had to wait a month for orientation. I felt the people who interviewed me had good questions, and they clearly were interested in filling the position.", "Interview Questions": "Describe how you would handle a multitasking situation."}], [{"date": "26 Jan 2014", "title": "Training Specialist Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Franciscan Missionaries of Our Lady Health System", "Interview Descriptions": "Staff was welcoming. HR is the problem.", "Interview Questions": "N/A"}, {"date": "24 Jul 2015", "title": "IS Support Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Franciscan Missionaries of Our Lady Health System (Baton Rouge, LA) in Aug 2013", "Interview Descriptions": "Interviewed with a group of upper level officials. At first I was incredibly nervous because I've never interviewed with a group of people, but they were all very friendly. If an interview is scheduled, it is mainly to make sure the personality is there to work efficiently with the current team.", "Interview Questions": "No technical questions were asked other than basic IT knowledge."}, {"date": "21 Sept 2015", "title": "Director Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 3 months. I interviewed at Franciscan Missionaries of Our Lady Health System (Baton Rouge, LA) in Aug 2011", "Interview Descriptions": "Interviewed by every single employee in the department.  Selection was based on a popularity rating.  Many persons interviewing admitted that they had never been part of an interview process.  They were completely unqualified and untrained.", "Interview Questions": "Why do you want this position?"}, {"date": "22 May 2012", "title": "Internal Audit Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at Franciscan Missionaries of Our Lady Health System (Baton Rouge, LA) in Feb 2010", "Interview Descriptions": "Was very \"put off\" by the interview process. There were several people that were involved in the interview process. I then found out through a reliable source how the previous person had been replaced without warning. Got the sense that this was not a good work environment and chose to look elsewhere.", "Interview Questions": "What experiences have you had in confrontational situations?"}, {"date": "13 Apr 2013", "title": "CIS Programmer Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Franciscan Missionaries of Our Lady Health System (Baton Rouge, LA) in Jan 2009", "Interview Descriptions": "Interview on-site with hiring manager.  Later, phone interview with lead programmer to get an understanding of my programming skills.", "Interview Questions": "None, all questions were fairly average."}]]