[[{"date": "27 Jan 2023", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Innocence Project", "Interview Descriptions": "Sent an email to the address given on their website. I was emailed back with a request for an interview over zoom. After the interview I was emailed a couple weeks later with notice that I had gotten the internship.", "Interview Questions": "Why do you want to work for the Innocence Project."}, {"date": "24 Jan 2023", "title": "Individual Giving Coordinator, then Manager Network Training Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 months. I interviewed at Innocence Project (New York, NY) in Dec 2022", "Interview Descriptions": "I applied for the Individual Giving Coordinator position, and several weeks later did a phone screen. I was scheduled for an in person interview several weeks after that. After that interview I sent an immediate thank you and heard nothing back. I reached out a week later-no response. 2 months later I was called and told I didn't get that position and asked if I would be interested in interviewing for a different position, Manager of Network and Training. I looked at it, was interested, and applied. Phone screen, second interview and panel interview later(whole process took about 6 weeks and required me to use PTO from current position) I reached out to follow up...nothing. Reached out to HR. Nothing. 2 weeks later I was told they were pulling the job posting to rework the requirements. (During this time I also received an automated email that said the Individual Giving Coordinator hadn't received enough responses and they were going to rework and repost that as well). It feels as if they were unable to find someone \"good enough\" and will change the requirements after interviewing people. It is also felt disrespectful to the applicant as time is invested and they aren't quite sure what they are looking for until after the process has started. It's NYC---you can't find someone to meet your requirements??", "Interview Questions": "What advice would you tell an organization that was looking to hire their first Director of Development?"}, {"date": "28 Jan 2023", "title": "Associate Director of Individual Giving Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. The process took 3 months. I interviewed at Innocence Project (New York, NY) in Sept 2022", "Interview Descriptions": "I want to second what the prior applicant for a development position at The Innocence Project recently submitted. I felt very neglected and ignored in the interview process despite a lot of communication on my part and timely submissions of everything that was requested of me. It was an awful process and I have given up hoping that I will ever hear anything from them.\n\nI have to say that this wonderful organization appears to be entirely in disarray in its development department. There are a large number of open positions and a current employee shared with me that a lot of people have recently quit. That person also added that the narrative about the cause for employee departures that is being shared with candidates is false. So I would be careful if you decide to interview for a position at The Innocence Project and ask a lot of questions. Transparency doesn't seem to be a thing there.", "Interview Questions": "Questions were excellent. No problem with that. The interview was great. The process, however, simply sucked. I felt disrespected. They will not retain great employees or hire potential ones if this continues."}, {"date": "25 Jul 2022", "title": "Paralegal Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Innocence Project", "Interview Descriptions": "The process was one prelim interview with the legal team, one writing exam and brief exercise, and the final interview with the division head. Everyone was extremely kind and knowledgeable and they give you a couple days to complete the exam and send it back.", "Interview Questions": "Know what the responsibilities of the job are along with what you will contribute to the department"}, {"date": "8 Feb 2022", "title": "Paralegal Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Innocence Project", "Interview Descriptions": "multiple rounds with different people; writing test; the process took a long time and it took 1-2 weeks to hear back about the next round; easy initial application and they do reach out to your references", "Interview Questions": "Why do you want to work at the IP?"}, {"date": "15 Sept 2020", "title": "Paralegal Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Innocence Project", "Interview Descriptions": "After I applied it took about 3-4 weeks to get a response. The interview was scheduled quickly and I heard back about 3 weeks after that. The interview was a general conversation over video with interviewer and former paralegal. Majority of conversation is with the interviewer then the last portion is with the paralegal.", "Interview Questions": "How will you connect and work with people whom are different  than you are? "}, {"date": "4 May 2016", "title": "Paralegal Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Innocence Project", "Interview Descriptions": "I was reached out to via phone by a representative of the Innocence Project after applying online and set up an interview. I met with two attorneys and a paralegal and spoke with them about my interest and qualifications for the position. I felt the interview went very well and was very pleased with how it went. The interviewers and I chatted casually for almost an hour, and following this I was told they'd be in touch.\r\n\r\nFollowing the interview I sent a thank you email the next day, to which I did not receive a reply. After weeks of waiting, I still had not heard anything, nor had my references been contacted by the Project. After three weeks without word, I sent a follow up email. A day later one of my interviewers reached out and told I would not be offered the position.", "Interview Questions": "Do you see your demographic differences from our clientele as a hindrance to working with them?"}, {"date": "14 Oct 2018", "title": "Human Resources Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Innocence Project (New York, NY) in May 2016", "Interview Descriptions": "The interviewing process was respectful and thorough. Many details were given about the culture and mission, which was very encouraging.  The interviewer had a relaxed style and presence. I felt that I was being evaluated on my comportment as much as my qualifications, due to the extensive number of applicants.", "Interview Questions": "How would I manage explaining  policies to employees on a daily basis?"}], []]