[[{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Good place of working", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "22 Dec 2021", "job_title": "Human Resources Director in Johor Bahru", "duration": "N/A", "pros": "Progression opportunity within the organization", "cons": "Nothing much to say here"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 0, "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Bad management, terrible culture", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "2 May 2023", "job_title": "Marketing And Communications Manager in Johor Bahru", "duration": "N/A", "pros": "- A lot of food around the area - People are impressed when they hear that you're working here - Building is new so it's a nice environment - Good programmes, particularly Engineering and Computer Science", "cons": "- Food is expensive around here - It's really not that great working for the name - Building is new so a lot of things are not ready - there are no cafeterias or hot drink machine - Bad programmes, particularly the Business programmes - The CEO is a terrible manager and doesn't understand how the industry works - she talks a lot and impresses the UK counterpart but she doesn't even do market research before launching new programmes. Thoughtless and irresponsible, she then blames her employees. Terrible person all in all. - The COO is the CEO's lackey. She micromanages a lot, but she is not a terrible person. However the pressure from the CEO makes her become unfavourable as she is seen as the 'bad cop' and the CEO the 'good cop' when in reality it's the other way around."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 0, "Diversity and Inclusion": 0, "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 0, "review_title": "Professional Services", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "6 May 2022", "job_title": "Professional Services in Johor Bahru", "duration": "N/A", "pros": "The organisation is a good stepping stone for those who wish to build a good portfolio in their career. You will always be challenged to explore new ideas and solutions. The pay is within the range of the industry as well.", "cons": "If you are joining the Recruitment, Admissions and Marketing department, expect the few things below.\r\n\r\n1) Micromanagement. The top management here thinks that the best way to manage the people is by micromanaging them. Expect a lot of daily meetings, questions on what you are doing and decisions from top to bottom.\r\n\r\n2) Numbers, numbers and numbers. End of the day, the management here only cares about the numbers. If the numbers do not look good, it means you are not doing your work. However, they fail to understand that the factors affecting the numbers are not something that the staff can control.\r\n\r\n3) Lots of reports, summaries and justifications. Be prepared to be questioned even if you would like to raise a minimal payment. The management here has serious trust issues and do take note that managers, head of departments do not have authority to approve payments. Expect to write a lot of reports on your performance and summaries on even the slightest thing.\r\n\r\n4) Poor synergy among colleagues. Just imagine if you do not even know the people in the HR department. Colleagues from other departments tend to avoid providing support and you will end up doing more than you are supposed to do.\r\n\r\n5) Toxic team members. There will be toxic colleagues within the department and organisation who will badmouth and undermine your efforts. Avoid them if you would like to stay sane. Besides, they are easy to be spotted as they will always try to outshine the others.\r\n\r\n6) Poor work life balance. Expect to do more than what's outlined in your JD and work on weekends. Working long hours is normal here.\r\n\r\n7) Lack of appreciation for your efforts. As the team is rather lean here, you will always be pressured to do more and beyond. However, the problem lies when you are not appreciated but instead, always pressured and criticised for not doing a 'perfect' job when you can only do so much within your limits. \r\n\r\n8) Lack of actions by the management. You can raise 1000 issues to them and they will eventually sweep it under the carpet. \r\n\r\n9) Lack of a good business plan. No solid strategies or tactics to achieve the end goal. The direction is rather unclear and you will always be told to \"figure it out yourself\"."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "no comment", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "20 Jan 2022", "job_title": "Education Counselor in Johor Bahru", "duration": "N/A", "pros": "no comment for that job", "cons": "good reputation company in UK"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": 4, "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Work environment", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "7 Sept 2021", "job_title": "Associate Professor in Johor Bahru", "duration": "N/A", "pros": "Work-life balance, friendly colleagues, good pay", "cons": "Relatively high pressure despite work-life balance"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Nice and chill place to work.", "rating": "5.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "9 Sept 2020", "job_title": "Summer Intern in Johor Bahru", "duration": "N/A", "pros": "Very nice and quiet, with very few distractions.", "cons": "Location is in the middle of nowhere so transport is a must."}], []]