[[{"date": "26 Nov 2022", "title": "IT Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Valdosta State University (Valdosta, GA) in Sept 2022", "Interview Descriptions": "Asked about past help desk experience and challenges. Recall a situation where you go above and beyond what is expected of you. Recall a situation where you were challenged and was not able to resolve the issue alone.", "Interview Questions": "What challenges have you faced in customer facing positions?"}, {"date": "28 Sept 2022", "title": "Finance Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Valdosta State University (Valdosta, GA) in Jul 2022", "Interview Descriptions": "Easy and not much required. student assistant position and help other people taking FIN 3350. This is a good job and I enjoy it very much. I am thankful I have this position. ", "Interview Questions": "Why do you want to be a tutor?"}, {"date": "29 Jun 2022", "title": "HR Generalist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Valdosta State University (Valdosta, GA) in Aug 2021", "Interview Descriptions": "Phone screening, Zoom interview, and In-person interview. Interview process was extensive and included multiple panel interviews, skills assessments, and a role-play scenario. The interviewing team was very friendly and professional.", "Interview Questions": "Describe how you would prioritize the given list of tasks."}, {"date": "4 Mar 2021", "title": "Admissions Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Valdosta State University in Feb 2021", "Interview Descriptions": "The job interview began with a 10 minute phone interview. The second stage was a zoom interview with the directors where I had to share a presentation. They were awesome to interview with!", "Interview Questions": "Q: When have you gone above and beyond"}, {"date": "29 Jul 2022", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Valdosta State University in Jun 2018", "Interview Descriptions": "Applied through the university website and set up an interview via phone call. The phone call lasted 20 minutes and was offered the position an hour after my interview happened.", "Interview Questions": "What is one skill you are great at?"}, {"date": "29 Oct 2019", "title": "Supervisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Valdosta State University (Valdosta, GA) in May 2018", "Interview Descriptions": "the interview process was easy. I submitted my resume online and heard back within a few days. They were very nice throughout the process and helped me with paperwork. Overall is was a great interview process.", "Interview Questions": "How would you handle and intense situation"}, {"date": "1 Mar 2018", "title": "Adjunct Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 1+ week. I interviewed at Valdosta State University (New York, NY)", "Interview Descriptions": "Contacted via phone after submitting online application. Phone interview with department head. Pay is based on your level of education and number of credit hours taught. Did not give me much time to decide since semester was about to start even though I submitted application a month earlier.", "Interview Questions": "What kind of teaching experience do you have?"}, {"date": "29 Aug 2019", "title": "IT Student Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 days. I interviewed at Valdosta State University (Valdosta, GA) in Mar 2018", "Interview Descriptions": "Typical interview questions, wants to make sure you have some kind of basis on what you'll be doing. Things related to IT, technology, maintenance, troubleshooting, and your class schedule. Very nice interviewer who seems really interested in your background.", "Interview Questions": "Describe a time where you troubleshooted an issue and how you solved it."}, {"date": "6 Aug 2017", "title": "IT Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Valdosta State University (Valdosta, GA)", "Interview Descriptions": "Not long, pretty brief at least 30 minutes. Most of the questions were straight to the point. I was basically asked to describe/introduce myself. We then talked about any experience I may have.", "Interview Questions": "Would I be afraid of learning how to work with computers ( taking them apart/fixing them)"}, {"date": "26 Sept 2017", "title": "Financial Aid Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Valdosta State University (Valdosta, GA) in Apr 2017", "Interview Descriptions": "Two persons from managment conduct the interview. They both ask questions interchangeably. They also give positve feedback on your skills thats related to job applying for. They conclude interview and you will get either job offer call or email. After referral and background check come back.", "Interview Questions": "Have you ever dealt with an upset customer if so how did you handle the situation?"}], [{"date": "30 Sept 2017", "title": "History and English Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Valdosta State University (Valdosta, GA) in Feb 2017", "Interview Descriptions": "I applied, and they since I was a current student they looked through my credits, they want to make sure that any tutor they hire has preformed well in their classes. After that, I was brought in and interviewed to see if I would be a good fit.", "Interview Questions": "Do you have experience tutoring or helping students?"}, {"date": "4 Nov 2017", "title": "Lecturer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Valdosta State University (Valdosta, GA) in Apr 2016", "Interview Descriptions": "basic Skype and then follow up with an on campus interview Discussion of , teaching styles, methods, visiting HR, discussion about benefits and salary the a \r\nmeeting with students and dean and presentation of materials", "Interview Questions": "What was your last salary?"}, {"date": "5 Oct 2015", "title": "Front Desk Library Assistant Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 3 days. I interviewed at Valdosta State University (Valdosta, GA)", "Interview Descriptions": "Was called to come in for an interview. When I had the interview, the manager was interviewing me. She seemed really nice and gave me a tour of the area where I would be working at. After that, she told me I will be starting the week after. Once I started, I worked in that one area, then slowly but surely, moved to other areas where I learned new skills.", "Interview Questions": "Why should we hire you?"}, {"date": "5 Jun 2019", "title": "Desktop Support Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 3 weeks. I interviewed at Valdosta State University in Oct 2015", "Interview Descriptions": "3 panel interview. Somewhat tense (the interviewers didn't say anything if I didn't ask a question). Never really deviated too much from the list of questions. However, the interviewers had pretty chill personalities and meaningful answers when I asked them question.", "Interview Questions": "How would you handle an irate faculty member "}, {"date": "29 Sept 2015", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Valdosta State University", "Interview Descriptions": "After applying online, a member of the department contacts you by telephone and schedules an interview. The interview is usually with more than one person. They are very interested in your ability to do the job and if any particular skills are mentioned in the job description they prefer you to have them. The entire process is very quick, they usually contact you the same day after the interview with a decision or 2-3 days after.", "Interview Questions": "Tell me about yourself?"}, {"date": "18 Sept 2015", "title": "Program Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at Valdosta State University", "Interview Descriptions": "Interview Process was Brief.  VSU called for an interview and asked very general questions about my past experiences.  After making it through the phone interviews, they interviewed me at a conference.  Interview was incredibly laid back.", "Interview Questions": "What was the most difficult situation you have faced?"}, {"date": "10 Aug 2015", "title": "Event Operations Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Valdosta State University", "Interview Descriptions": "Depends on the department but they will review candidates and call you in for an in person interview, mainly everyone is very friendly. Dress professional and arrive early since parking with students can be challenging.", "Interview Questions": "What is your biggest weakness and how can you improve on this?"}, {"date": "12 Nov 2018", "title": "English & Writing Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Valdosta State University (Valdosta, GA) in Apr 2015", "Interview Descriptions": "Simple. Short. Just give them your experience. Mine was writing in a blog. I also had great reviews from my professors as well. That probably helped a lot. I think it's easy to get nervous before each interview. Just present the best version of yourself and you should be fine. These interviewers are pretty chill. So don't worry.", "Interview Questions": "N/A"}, {"date": "6 Oct 2015", "title": "IT Student Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 days. I interviewed at Valdosta State University (Valdosta, GA) in Jan 2015", "Interview Descriptions": "Depending on department, they ask you basic questions about your work experience, etc. If you are applying for a actual hands on roll(Desktop, Classroom, Inventory) they may give you a small technical test which was (Plug CPU in, Connect hard drive, etc)", "Interview Questions": "Do you know hardware and software components"}, {"date": "5 Jun 2014", "title": "Lecturer Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Valdosta State University", "Interview Descriptions": "Multiple interviews including phone and on-campus. Interviews were standard for academic interviewing, including prior academic experience and research interests as well as lesson plans, teaching philosophy, etc. First interview conducted by phone, second on campus. Third interview was same day with Dean of college in question. Hire offer was solid. For lecture position, negotiation is minimal.", "Interview Questions": "N/A"}], [{"date": "6 Nov 2017", "title": "Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Valdosta State University in Jan 2014", "Interview Descriptions": "The first phase included a phone and Skype interview. The second phase included meeting with the search committee and presentation to group I would lead. Then I had Q&A from the department.", "Interview Questions": "What can you bring to this position to help shape office and campus culture?"}, {"date": "6 Jun 2017", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Valdosta State University (Valdosta, GA) in Jun 2013", "Interview Descriptions": "The interview was very relaxed and thorough. The interviewer was very approachable and humorous, and they gave me a good idea of what to expect. It was mostly going over my qualifications and teaching how to read the codes on the library books. They show you how to put the books and movies and files back in the proper order as well as how to organize microfilm. They also require you to manage the desks at some point, including how to use Galileo (the book search engine) and how to locate lost books.", "Interview Questions": "Why would you like to work for VSU?"}, {"date": "29 May 2013", "title": "Police Officer Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at Valdosta State University", "Interview Descriptions": "Postings are no longer publicly posted at HR, you must seek the notices on-line. Job postings were not relevant to the actual position(s) available, they would truly consider applicants at any time, and wait to create a posting. Phone calls would not be responded to, it was necessary to show up in person in order to attempt to catch a manager in the office to speak with. \r\nEach division is different when dealing with hiring. They are their own little kingdoms.", "Interview Questions": "Why would you want to work here and take a pay cut?\r\nDo you realize that if you are hired for this position that you can not get a better/different position for 6 months?"}, {"date": "19 Jan 2016", "title": "Computer Operator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Valdosta State University (Valdosta, GA) in Jan 2013", "Interview Descriptions": "First, the interviewer wanted to know as much about me as a person as they could. Then I was asked basic technical questions about how I would go about fixing specific issues that are common. I was also asked about my communication skills and how I would interact with my coworkers.", "Interview Questions": "If I didn't know how to fix an issue, what would I do?"}, {"date": "14 Mar 2014", "title": "IT Student Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Valdosta State University (Valdosta, GA) in Aug 2012", "Interview Descriptions": "1 interview the interview is pretty easy as long as you can speak well you have the job.", "Interview Questions": "none"}, {"date": "27 Mar 2015", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Valdosta State University (Valdosta, GA) in Aug 2011", "Interview Descriptions": "I was offered this position while taking a senior thesis course. Upon arrival into the leading professor's office he asked a few basic chemistry questions along with population densities around Valdosta, GA. He then hired me on the spot telling the details of what the research will in-tell.", "Interview Questions": "What are the most heavily populated area of traffic in Valdosta from different time variables?"}]]