[[{"date": "3 May 2023", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Beaufort Memorial Hospital (Beaufort, SC) in May 2023", "Interview Descriptions": "Interview process was great a lot of information was given didn’t even need to answer any questions managers were very nice and kind bubbly people can just tell tht the atmosphere is where you want to be", "Interview Questions": "What healthcare experience do you have?"}, {"date": "29 Nov 2021", "title": "Pre-Arrival CSS Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Beaufort Memorial Hospital (Beaufort, SC) in Nov 2021", "Interview Descriptions": "The first part of the interview was with the direct supervisor. Pretty standard interview questions along with a great description of the job and current processes. I also liked how she asked me to tell her about myself in a casual manner. The second part of the interview was what they call a peer-to-peer. I met with 2 other department heads who work closely with the department and that portion of the interview went very well. It was a relaxed interview which felt more like having a conversation rather than being drilled with the same boring interview questions like \"where do you see yourself in 5 years\". They told me a lot about the company, their benefits and the overall work environment. They all have been there over 10 years so  certainly spoke from experience.", "Interview Questions": "Tell them about myself, why I was interested in the position and looking to leave my current one. Then they mostly just told me about the company and all of it's benefits and perks."}, {"date": "21 Oct 2021", "title": "Certified Surgical Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Beaufort Memorial Hospital (Beaufort, SC) in Jun 2021", "Interview Descriptions": "Two person, very relaxed and informative.  It went well, they asked how employees view you at the other hospitals.  That’s all I have for now. I will update once HR contacts me.", "Interview Questions": "If traveling from another area, they’re will be inquiry about why hospitals in your home town weren’t an employment option. "}, {"date": "13 Oct 2022", "title": "Rehabilitation Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Beaufort Memorial Hospital (Beaufort, SC) in Jun 2018", "Interview Descriptions": "The process was more of a situational interview. The questions were to ensure one understands how to follow directions to maintain the safety of both the patient, therapist, and yourself.", "Interview Questions": "How would you go about ensuring a safe and tidy work environment?"}, {"date": "25 Oct 2017", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Beaufort Memorial Hospital (Beaufort, SC)", "Interview Descriptions": "Hired after interview with HR manager and nurse manager. I was called within days of submitting an application. The process was smooth and not intimidating. I continue to work with a nice staff and they are very helpful.", "Interview Questions": "Years of experience "}, {"date": "1 May 2018", "title": "Marketing Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Beaufort Memorial Hospital (Beaufort, SC) in Jul 2017", "Interview Descriptions": "Everyone was very warm and made me feel comfortable.  The interview panel consitisted of other employees in the department who took turns answering questions. The questions were mainly about managing relationships between departments and developing strategies. Very few were about technical skills and knowledge.", "Interview Questions": "How would you manage relationships with various stakeholders?"}, {"date": "6 May 2017", "title": "Clinical Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Beaufort Memorial Hospital", "Interview Descriptions": "Contacted via phone and completed interviews with staff, HR, and managers. Everyone was incredibly nice and helpful throughout process. Interview with staff covered typical interview questions but was very laid back.", "Interview Questions": "Name a time when you butt heads with another employee and how did you handle it"}, {"date": "4 May 2017", "title": "Phlebotomist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Beaufort Memorial Hospital", "Interview Descriptions": "I went into the outpatient lab in the hospital and interviewed with the lab director.  It was pretty standard.  Tell me about your experience.  Why do you want to work here.  What can you do you for us that others won't.", "Interview Questions": "Why do you want to work here"}, {"date": "3 Aug 2016", "title": "Food Service Worker Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Beaufort Memorial Hospital (Beaufort, SC) in Mar 2016", "Interview Descriptions": "Submitted application online, was called within 2 weeks, after two interviews with three people was subject to an 8 hr orientation, which I was paid for but did not feel was relevant to my job. \r\n\r\nInterviewed with manager for the first interview, who was very nice and clearly has had people skills training. Second interview was with a supervisor who, while very skilled at what she does, does not have people skills and was difficult to understand both because of her accent and her erratic verbal wanderings. Lady who was with her I almost never saw again after the interview, I can only assume she was there to keep the interview on track and under 2 hours long. All three were friendly, but second interview was haphazard and strange.", "Interview Questions": "\"What was a difficult scenario you encountered at your previous job, and how did you handle it? What skills and attributes you used then could you apply to this job?\""}, {"date": "30 Nov 2016", "title": "Technician Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at Beaufort Memorial Hospital (Beaufort, SC) in Feb 2016", "Interview Descriptions": "Submitted on-line.  I didn't hear anything for a month.  Finally I was called by HR for an interview.  The hiring manager said they would get back to me soon.  Months went by. I finally received an offer.  However I was not told that it was mandatory to join the SC state retirement fund, which was an 8% deduction every pay check.  Ouch!", "Interview Questions": "What was working today?"}], [{"date": "26 Jun 2017", "title": "Patient Access Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Beaufort Memorial Hospital (Beaufort, SC) in Nov 2013", "Interview Descriptions": "last about 30-45mins with the department manager and the team leader.  Then if they are interested you will move on next to have a peer to peer interview on same day. If all goes well with the peer interview you should be given an offer next day.", "Interview Questions": "What are you long term goals for working with the company?"}, {"date": "31 Aug 2015", "title": "Certified Medical Assistant Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Beaufort Memorial Hospital (Beaufort, SC) in Jun 2011", "Interview Descriptions": "Mostly went over resume, some questions. They ask you to do a drug screen that day if you're hired. They seem to be desperate for this position, so it shouldn't be too hard to get a job. The interview was very informal.", "Interview Questions": "What was one situation where you had to deal with a difficult person? How did you handle it?"}, {"date": "24 Mar 2014", "title": "Nurse Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Beaufort Memorial Hospital (Beaufort, SC) in May 2011", "Interview Descriptions": "The HR department is very helpful in the hiring process. They schedule interviews in other departments if they hear back from an interviewer that they are not going to hire you in that particular department. Many people hear back within 48 hours after their initial interview to find out if they will be hired or not. After one interview with department heads, there will be another peer review in most departments. After that you will be contacted by HR as to whether you got the job or not.", "Interview Questions": "Name a time when you made a mistake that could have had serious consequences, and how you fixed the error, and how you prevent yourself from making the same mistake again. "}]]