[[{"date": "9 Nov 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Grand River Hospital", "Interview Descriptions": "Was focused on case study and practical application. Involved manager, educator, and unit nurse. Overall, positive experience and it was nice to have a nurses perspective on unit culture. Manager and educator were kind and insightful.", "Interview Questions": "Declining blood pressure scenario and which interventions applied."}, {"date": "14 Sept 2022", "title": "RPN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Grand River Hospital", "Interview Descriptions": "Interview process took about 2weeks. Interview had about 5 behavioral and scenario questions over zoom with a clinical manager. Interview consisted of about 5 questions, took about 30minutes. Heard back from them within the 24hours.", "Interview Questions": "Tell me about yourself and your experience"}, {"date": "11 Jun 2022", "title": "Environmental Service Aide Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Grand River Hospital", "Interview Descriptions": "Very easy. I was asked 3 basic questions about patient safety, teamwork and relevant experience + availability. Hiring managers were very nice and easy to talk to. Very informal interview", "Interview Questions": "How would you keep patients safe in this position?"}, {"date": "9 Sept 2021", "title": "Occupational Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Grand River Hospital", "Interview Descriptions": "It was a great experience. Both interviewers were very friendly. Started off with questions about yourself, your past and current experiences, assessments you’ve has used.  Then scenario and behavioural questions. Waited a few weeks to get an offer from the HR.", "Interview Questions": "Tell me about your experiences. \r\nWhat kind of assessments you have used?\r\nName a time when you encountered a difficult client. "}, {"date": "11 Mar 2021", "title": "Finance Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 3 days. I interviewed at Grand River Hospital (Kitchener, ON) in Jun 2020", "Interview Descriptions": "The process was quite easy, after applying I was emailed to set an appointment for interviewing online.  Afterwhich was a one-on-one interview with the hiring manager.  Asking questions about my past work experiences, and what makes me a strong candidate.", "Interview Questions": "What are three strengths you have?"}, {"date": "31 Aug 2021", "title": "Clinical Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Grand River Hospital in Jun 2020", "Interview Descriptions": "This was behaviour and scenario based format. It was a virtual interview due to the constraints of the pandemic. It consisted of a panel of leaders a s a physician from the program as well as a recruitment specialist for the program. The length was about sixty minutes which allowed time at the end for my questions to be answered. Overall it was a good interview experience and I felt well supported throughout the recruitment process.", "Interview Questions": "This was behaviour and scenario based format. It was a virtual interview due to the constraints of the pandemic. It consisted of a panel of leaders a s a physician from the program as well as a recruitment specialist for the program. The length was about sixty minutes which allowed time at the end for my questions to be answered. Overall it was a good interview experience and I felt well supported throughout the recruitment process."}, {"date": "20 May 2020", "title": "Specialized Mental Health Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Grand River Hospital in Feb 2020", "Interview Descriptions": "Non-intimidating, 1 interviewer present (it was supposed to be two but one was the second person was unavailable). Interview started as the interviewer explained the role, then asked general character questions and scenario questions, and then I asked my questions.", "Interview Questions": "Asked about specific antipsychotics, antianxiety and mood stabilizers and 2 of their side effects for each."}, {"date": "3 Aug 2019", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Grand River Hospital", "Interview Descriptions": "2 step interview process with HR and then management on the unit you apply for. The interview took 45 mins with the manager and educational nurse. The interview involved generic questions and several that are specific to the floor", "Interview Questions": "What are some of your strengths and weaknesses?"}, {"date": "1 May 2019", "title": "Clinical Secretary Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Grand River Hospital (Kitchener, ON) in Apr 2019", "Interview Descriptions": "There were a manager and one clerical. They were very friendly and interacted with me during the answers. It was not only a question and answer process with a lot of pressure.", "Interview Questions": "What would you do if more than one doctor asks for assistance at the same time?"}, {"date": "21 Apr 2018", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 1+ week. I interviewed at Grand River Hospital in Mar 2018", "Interview Descriptions": "I am a registered nurse, I have just graduated from university and now I am on the search for any offers of any jobs. I have made several interviews to see which one I will get  into.", "Interview Questions": "What type of shift on my unit will I work?"}], [{"date": "21 Mar 2018", "title": "Talent Acquisition Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Grand River Hospital (Kitchener, ON) in Jan 2018", "Interview Descriptions": "I was greeted by a recruiter who explained they were running late. No problem, I waited about 20 minutes which was okay. While I was waiting a man kept walking past me, I thought it was strange that he avoided eye contact and didn’t offer a friendly hello. Usually in such a small lobby space someone would offer a hello, anyway no big deal. The interview started with 2 recruiters who were very friendly, they apologized that the Talent Acquisition Manager was running late. Anyway about 45 minutes in, towards the very end of the interview, the manager came in. It was the man from the lobby. He didn’t really apologize or offer any introduction, or eye contact. He asked me 2 quick questions and then abruptly ended the interview. Such strange behaviour for a talent acquisition manager. Some really basic stuff in recruitment is being mindful of the candidate experience. Anyway I wasn’t offered the position but I remember thinking to myself, I would never want to work for this guy.  Beside the strange TA manager, the questions where very standard and the recruiters were professional.", "Interview Questions": "Tell me about a difficult role you had to fill "}, {"date": "18 Nov 2021", "title": "Security Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Grand River Hospital (Kitchener, ON) in Mar 2017", "Interview Descriptions": "Panel interview. Manager and assistant manager and hr rep.  Very direct questions, situational based, and opinion questions. Try to ask about use of force as it’s a very aggressive job, and they want to make sure you can handle it.", "Interview Questions": "How comfortable with use of force?"}, {"date": "31 Dec 2019", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at Grand River Hospital (Kitchener, ON) in Aug 2015", "Interview Descriptions": "Sit down interview with manager and another nurse. Series of questions were asked that prompted me to explain how I respond in different scenarios .  Topics include how I deal with patients, patients family, challenging skills, time management.", "Interview Questions": "Provide a scenario where you worked with an RPN that was challenging, and how did you deal with the challenge? "}, {"date": "1 Jun 2015", "title": "Registered Nurse, Ontario Nurses' Association Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Grand River Hospital (Kitchener, ON) in Feb 2014", "Interview Descriptions": "My interview occurred in a conference room with the two managers from the unit and the nurse educator. It started with filling out a two page question sheet. There were 4 or 5 scenarios that gave patient details and a situation that required critical thinking as a nurse. They left me alone in the room to fill it out for about 15-20 minutes. We then went over the questions all together.", "Interview Questions": "They asked about a situation from a previous job that required me to take leadership. "}, {"date": "9 Jan 2017", "title": "Licensed Practical Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Grand River Hospital (Waterloo, ON) in Jun 2013", "Interview Descriptions": "it last about 3 hours, there were 2 interviewers there, both of them were units managers. They were very nice and asked me about 10 questions and a test. I did great on the questions and test.", "Interview Questions": "Do you like nursing job"}, {"date": "18 Mar 2016", "title": "Administrative - Non Management Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Grand River Hospital (Kitchener, ON) in Dec 2012", "Interview Descriptions": "Was contacted to come in for an interview, met with a panel of 4 employees (senior manager, director, 1 future colleague and an HR representative). Behavioral interview with some questions about past experience and applicability to the current position. Questions about experience with certain online tools/resources. Basic HR structured interview.", "Interview Questions": "Tell us about a time when......"}]]