[[{"date": "23 Feb 2023", "title": "Front Desk Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Daymar College", "Interview Descriptions": "The interview process was great. I really enjoyed my time there. I loved the environment and the interview was laid back, on my opinion. I am thankful to have been employed.", "Interview Questions": "What is your experience? Describe a difficult decision"}, {"date": "11 Jan 2021", "title": "Assistant Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Daymar College", "Interview Descriptions": "The process starts out very impersonally- application online, group interview and becomes very engaging and personal once the group interview ends. We’re taken on a tour, meet with people who work on different areas and even meet with prospective supervisors before offer is made.\r\nUnfortunately, the actual experience isn’t as rosy as the interviewers portray but it was a great experience.", "Interview Questions": "Who is a role model of yours?  What’s an accomplishment you’re proud of?"}, {"date": "10 Aug 2018", "title": "Assistant Director of Admissions Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at Daymar College (Bowling Green, KY) in May 2018", "Interview Descriptions": "Offered position and Daymar withdrew the offer one day before my start date. I had an extremely frustrating and disappointing experience where after a very lengthy interview process (nearly two months) I was offered and accepted the position, only to have it withdrawn the business day before I started due to supposedly internal miscommunication and a lack of the company being able to support the position by the workload and pending buyout. And that was after I actually followed up simply to express my excitement at starting and asking if I should bring anything - so I don't even know when they planned to tell me. It was tough because I had given two weeks at my current employer AND passed up a promotion there to work at Daymar. This is now future lost wages to me. Just be very careful if you're considering working there. They have much to fix after losing their accreditation and subsequently, nearly half of their student body. They are also in the midst of trying to complete a buyout of themselves to another educational company, so if I were you, I would steer clear for awhile until they get their situation settled. I understand that things don't always pan out, but I just felt they acted incredibly unprofessional and recklessly in regards to my time and personal career that had impacts that I'm still dealing with. It was just incredibly irresponsible.", "Interview Questions": "What sales experience do you have? What motivates you? Are you competitive? Can you ask tough questions of people."}, {"date": "28 Apr 2017", "title": "HVAC Tech Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Daymar College (Murfreesboro, TN) in Apr 2017", "Interview Descriptions": "The interview took about 20 minutes and went real well. The interviewer was very nice and explained how instructors at Daymar are impacting student lives every day. I have no regrets.", "Interview Questions": "How long I've been teacching for?"}, {"date": "18 Sept 2021", "title": "Assistant Director of Admissions Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Daymar College (Nashville, TN) in Mar 2017", "Interview Descriptions": "I was invited to a Group interview, followed by a tour of the facility.  The group interview had 8 applicants and two interviewers. The next step was an interview with director and informal meetings with colleagues.", "Interview Questions": "Who do you admire\r\nWhat is your best achievement"}, {"date": "15 Jan 2017", "title": "Assistant Director of Admissions Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Daymar College (Nashville, TN) in Jun 2016", "Interview Descriptions": "fairly straight-forward and quick; one phone interview followed by a face-to-face after which I received an offer same-day; a bit of a delay with no contact between the phone and face-to-face interviews", "Interview Questions": "how did I see myself impacting their sales team"}, {"date": "7 Mar 2016", "title": "Assistant Director of Admissions Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Daymar College (Nashville, TN) in Nov 2015", "Interview Descriptions": "First there is a group interview that they call the talent search.  There will be 2-5 people interviewing you and maybe 10 other people at the same time.  You have to be able to awkwardly answer questions in front of other candidates.", "Interview Questions": "Basic questions like strengths and weaknesses."}, {"date": "13 Jul 2016", "title": "Full Time Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Daymar College (Owensboro, KY) in Jun 2015", "Interview Descriptions": "Relaxed atmosphere. One on one encounter than meet other Instructors. Tour the college. Hired that day. Application process was long and every detail had to be perfect. It was a very time consuming process and very lengthy.", "Interview Questions": "Experience"}, {"date": "20 Nov 2017", "title": "Career Services Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Daymar College (Bowling Green, KY) in Jan 2015", "Interview Descriptions": "I was interviewed over lunch by the new campus president who was a little sensitive about the fact that I had previously worked for his predecessor.  I had spent several years with the same company before my previous position was eliminated and I was called back to take the job of the person to whom I'd been reported.", "Interview Questions": "What salary were you looking for?"}, {"date": "2 Oct 2016", "title": "Admissions Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Daymar College (Nashville, TN) in Aug 2014", "Interview Descriptions": "Very intense interview , although a friendly atmosphere during interview, there were many questions about past and how that would help in current job. They wanted to know about my sales experience and how I would do on the phones. If you have great sales skills and cold calling experience chances are you'll get an opportunity. It was an average interview.", "Interview Questions": "How would my past job experience help me with this position"}], [{"date": "26 Sept 2014", "title": "Adjunct Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Daymar College (Russellville, KY) in Jun 2014", "Interview Descriptions": "The campus director was very nice but you could tell he was also strictly business. Questioning wasn't the traditional, like: Where do you see yourself in 10 years or tell me about yourself. (which I liked) His questioning led more into the career itself. He looked over my transcripts and asked me questions on the basis of the job I was applying for to see my knowledge of the content. It was breath of fresh air to feel that even though he cared about who you were as a person, but also showed he was serious in hiring the right person for the job. It's not very often that you go to an interview that is outside the norm that gives you a chance to show what you know in your area of expertise in a comfortable and professional atmosphere.", "Interview Questions": "I brought in my teaching portfolio to prove to him that I had went through all the educational loops and experience. Not only did he view it, he also had me explain to him details of some of my experiences, some which dated back to almost 10 years ago to the present. My assumption for this was to see where I had started and where I was now with my teaching methods. This wasn't offensive, but shed light to myself on how far I had come in my knowledge and growth as a teacher."}, {"date": "22 May 2014", "title": "Instructor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Daymar College", "Interview Descriptions": "Interview was done in a large group and narrowed down to those that wanted to continue the interview process. Company wanted to reschedule second part of the interview which I could not due to living four hours away from the school at the initial interview. The school accommodated me.", "Interview Questions": "Wanted me to teach a 10-15 minute blip of information."}, {"date": "28 Feb 2014", "title": "Adjunct Instructor Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Daymar College", "Interview Descriptions": "It is interesting to say the least.", "Interview Questions": "The online application requests a social security number and a driver's license. That is a bit much when not filling out new hire paperwork."}, {"date": "14 Nov 2017", "title": "Instructor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I applied in-person. I interviewed at Daymar College (Murfreesboro, TN) in Dec 2013", "Interview Descriptions": "Met with Director of Education briefly.  Mainly interviewed with program lead.  Had nice discussion on teaching opportunity, students and culture.  Received job off er to teach 3 classes at end of interview.", "Interview Questions": "Why do you want to teach?"}, {"date": "1 Oct 2013", "title": "Career Services Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at Daymar College", "Interview Descriptions": "2:1 interview. Important to research college morals and ethics in addition to the mission statement. Basic interview practice was sufficient. 3-5 Behavior based interview questions. After the interview, the process was lengthy. If I didn't have an existing employee checking for me and pressing for status updates, it could have taken 2-3 months. I started roughly 3.5 weeks after my interview. I've seen others take as long as 8-12 weeks. Obviously, if there's a desperate need for a certain opening, the process will be faster than what I experienced.", "Interview Questions": "Integrity, Honesty, and Hard Work. Which one of those values is most important to you and why?"}, {"date": "20 May 2014", "title": "Financial Aid Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Daymar College (Murfreesboro, TN) in Sept 2010", "Interview Descriptions": "Interviewed with Financial Aid Manager short 15 minute interview.  Basic questions...where you see youself in 5 years...best and worst qualities, etc.  I interviewed in 2008 or 2009 the year choice below will not let me selectolder than 2010", "Interview Questions": "Basic interview, worst/best qualities, etc."}]]