[[{"date": "5 Dec 2022", "title": "Counselor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Kentucky Community and Technical College System (Lexington-Fayette, KY) in Jan 2022", "Interview Descriptions": "8 people on camera asking prewritten questions. Each one asked a different question. None of the questions really seemed different. It only lasted half an hour. They gave no feedback. They took three weeks to give me a response.", "Interview Questions": "How to handle difficult students."}, {"date": "29 Nov 2021", "title": "Institutional Effectiveness Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Kentucky Community and Technical College System", "Interview Descriptions": "Two interviews with consistent questioning. Easy-going and generally quick. The first interview was a panel interview, the second was a smaller interview with higher-ranking employees. Not particularly difficult, but did seem tailored to the needs of the position.", "Interview Questions": "What are your strengths and weaknesses?"}, {"date": "17 Oct 2020", "title": "Senior Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Kentucky Community and Technical College System (Louisville, KY)", "Interview Descriptions": "Professional environment with appropriate questions. No indication of discrimination. I felt comfortable and not exceedingly nervous. I was informed of the responsibilities up front and was given an opportunity to ask questions of the committee.", "Interview Questions": "The trivial \"where do you see yourself in 5 years.\""}, {"date": "17 Oct 2017", "title": "PR Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Kentucky Community and Technical College System (Lexington-Fayette, KY) in Oct 2017", "Interview Descriptions": "I was contacted after applying for a PR position. After applying, I was sent an email for a date and time of an interview with zero flexibility. I reached out to HR to let them know their intended interview wasn’t going to work with my schedule since I was summoned to jury duty. I would let the hiring manager know if anything had changed. They sent back an email requesting me to change my time - but jury duty had not left the table. The day of the interview I was summoned to a trial, missing the interview. HR had reached out to me to say ‘are you coming’ obviously no, I had already made them aware of the situation. I asked for a Monday reschedule PHONE interview. The hiring manager then told me I made no effort to communicate any of the above - and that that day was the ONLY day they could possibly do an interview. I let her know that I see they value a body in a chair over the skill set of the hire since they couldn’t possibly be flexible and speak to me any other time. That is not how business is done in the real world, and I would never work for this company who can’t even accommodate someone who has been summoned by the state for jury duty. Lack of flexibility and accountability - the hiring manager blaming me for her error, after I was flexible with them and changed the time. I normally don’t even complain about scheduling conflicts - but this was beyond ridiculous. I was serving on a trial and now my consideration for a role is gone because they could only speak to me on one specific day and time.", "Interview Questions": "I didn’t even get asked questions based on their hiring process and not bein able to have flexible scheduling."}, {"date": "24 Jan 2017", "title": "Developmental Reading Instructor (Read Right) Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Kentucky Community and Technical College System (Ashland, KY)", "Interview Descriptions": "I was already employed as an Adjunct (i.e. part-time) English Instructor, so the Humanities Division Chair encouraged me to apply for the position of Developmental Reading Instructor (as it was a full-time position). I filled out a standard application; submitted the required paperwork (teaching philosophy, etc.); waited a few days; and then I was called in for an interview before the hiring committee. This committee included the Humanities Division Chair, the head librarian, a few professors (who had nothing to do with the position itself), the head of the Read Right program, and the Academic Dean.The Committee was very cordial and professional and asked me standard/relevant interview questions (e.g. tell us a little bit about yourself, list qualities an instructor should have, why do you feel literacy is an important, how would you handle a difficult student, etc.) Afterwards, I was set up for an interview with the college's president, which I was told was just a formality, but in all actuality, it was nothing short of a sham interview. He was completely unprepared, had no list of questions to run through, and just asked me random questions came to his head. Most of the time was spent listening to him talk about himself, his wife (a retired school teacher), and the history of the college, and very little time was spent discussing the actual job or asking me relevant questions. Instead, he asked rather prying questions such as where I went to high school; how many siblings I had; where my extended family (aunts, uncles, and cousins) lived and if they had gone to college (and, if so, what fields had they studied in and what did they currently do for a living); what colleges my parents attended; what degrees my parents had earned; and my parents' current professions. When he found out that one of my parents graduated high school, chose not attend college, and enter directly into the workforce, that seemed to be the proverbial nail in the coffin. From that point on, he acted completely disinterested in me and displayed a cold, uncouth demeanor as he concluded the \"interview.\" About a week later, when I heard nothing about the job, I inquired of my Division Chair, who asked me if the president had even interviewed me. I said yes and she thought that was strange because, during their hiring committee meetings, she claimed he never even indicated that he had talked to me. Needless to say, I didn't get the job but it was easily the worst interview I had ever been on (and I've been on some poorly-conducted interviews before). In retrospect, I can only assume the college president was looking for a particular person, a \"home town girl,\" for lack of a better term, to teach at *his* school. The overall experience was very insulting and left a poor impression on me as far as how the college's top administrators acted and treated others.", "Interview Questions": "The president was insistent in wanting to know about my parents' academic backgrounds, so he asked what degrees they held, where they had gone to school, and what jobs they currently worked."}, {"date": "11 Apr 2017", "title": "Nursing Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Kentucky Community and Technical College System (Edgewood, KY) in Jul 2016", "Interview Descriptions": "I was I nterviewed by a group of 4, Human Resources, administrative assistant, and two professors from another part of the college.\r\nI was required to do a fifteen minute teaching demonstration. I knew this requirement ahead.", "Interview Questions": "Where will you be in 5 years"}, {"date": "23 Apr 2018", "title": "Technical Instructor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 3 weeks. I interviewed at Kentucky Community and Technical College System (Bowling Green, KY) in Aug 2015", "Interview Descriptions": "A 1-hour panel interview where I was asked a number of questions. I had to prepare a PP on a topic of their choice and deliver it within a specific time frame.  The panel consisted of 5 people from different campuses.", "Interview Questions": "Why do you want to work at here?"}, {"date": "27 Feb 2015", "title": "Instructor Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Kentucky Community and Technical College System", "Interview Descriptions": "talked with a committee of about 7 different folks. Some of them knew absolutely nothing about the field the position covered! Some of the questions in the interview process we're just buddies about as far off base as you could imagine,While only a few were relevant to the field. seems like a very disorganized employer!", "Interview Questions": "how would you handle student discipline"}, {"date": "29 Aug 2014", "title": "Advisor Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Kentucky Community and Technical College System", "Interview Descriptions": "Apply online with application and resume. HR will contact you if they feel you are qualified for the position. I was contacted within a week of submitting information. Phone interview then an in person interview.  Received phone call about a week later offering me the position.", "Interview Questions": "Basic interview questions. Nothing out of the ordinary. "}, {"date": "15 Jun 2014", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Kentucky Community and Technical College System (Lexington-Fayette, KY)", "Interview Descriptions": "Hiring was a matter of answering an ad posted online, then going to the school and getting an interview with a coordinator. He hired me and was wonderfully welcoming. The interview included questions about my resume--which was stellar. He walked me around campus and introduced me to people. I was very pleased.", "Interview Questions": "There was none."}], [{"date": "28 Jan 2016", "title": "Student Employee Position Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Kentucky Community and Technical College System (Covington, KY) in Jan 2013", "Interview Descriptions": "I went into a room, talked with two people. They were both nice and polite. Then i got a call back and for me to come and talk to their boss for a quick interview. After a week or two i got an email and a call from them saying to set up a time to fill out the paperwork because i got the job.", "Interview Questions": "Will you be able to do this position AND take a full load of classes here without it hurting your progress towards your degree or your family life?"}, {"date": "7 Apr 2015", "title": "Developmental Math Adjunct Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Kentucky Community and Technical College System (Covington, KY) in May 2012", "Interview Descriptions": "It was a very comfortable discussion type interview.  I got hired on the spot by Mrs. Schutzman, the Division Chair.  I checked below that it was an average interview because there was no selection for best and most at ease interview.", "Interview Questions": "What is your view on teaching math."}, {"date": "28 Jun 2011", "title": "Professor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 2 months. I interviewed at Kentucky Community and Technical College System (Lexington, KY) in Apr 2011", "Interview Descriptions": "The interview consisted of a group interview and a microteach session at the end or at the beginning of the interview. It's up to the person being interviewed to decide. After the interview I waited a month and was sent an email informing me that I did not get the position.", "Interview Questions": "What are three of your weaknesses? "}, {"date": "5 Mar 2014", "title": "Senior Public Relations Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Kentucky Community and Technical College System (Versailles, KY) in Sept 2010", "Interview Descriptions": "The hiring and interview process was fairly quick, once I was called in for the initial interview, but it took two months from the time I applied until I was called for the first interview. Then I was interviewed by a panel of approximately four people, and offered the job after I passed the background check. This took about three weeks.", "Interview Questions": "I wasn't asked any difficult questions. It was an easy interview. "}, {"date": "28 Jun 2012", "title": "Teaching Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Kentucky Community and Technical College System (Maysville, KY) in Jun 2008", "Interview Descriptions": "A committee interviewed and asked me a set of questions.", "Interview Questions": "Why are you interested in this position?"}]]