[[{"date": "9 Feb 2022", "title": "Graduate Program Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at APM (Sydney) in Feb 2021", "Interview Descriptions": "i had an online interview first that were prerecorded questions with a time limit to answer them in. The process was not stressful as they gave you tome to understand the question beforehand and you were able to listen to the questions before. you were also given practice questions before beginning the online interview,", "Interview Questions": "how do you work in a stressful environment or what do you do to handle stress "}, {"date": "15 Sept 2018", "title": "Fee for Service Therapist Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at APM (Philadelphia, PA) in Apr 2018", "Interview Descriptions": "The interview went really well. The supervisor who interviewed me was extremely nice and optimistic. I was offered the job on the spot, which in hindsight, was a negative sign.", "Interview Questions": "I was asked about my \"instincts\" and ability to read people, which I found strange."}, {"date": "17 Mar 2016", "title": "Case Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at APM (San Juan, PR) in Jan 2015", "Interview Descriptions": "The interview was in my country with the CEO 1:1 and online with the Director. They asked about my work experience.  They asked about the sifficult of moving to USA and about the working among multi cultural job setting.", "Interview Questions": "About my preview experience with case loads and working with families."}, {"date": "26 May 2015", "title": "Teacher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at APM (Philadelphia, PA) in Aug 2013", "Interview Descriptions": "I had one interview with the director of education.  Some of my collegues had two one with HR the other with the Director. She was very friendly and easy to talk to. She was also very professional and would bring the comversation back to business when necessary. HR contacted me within 24 hours to offer me the position. I was able to start as soon as my background checks were completed.", "Interview Questions": "describe your experience with a difficult child."}], [], [], []]