[[{"date": "9 Nov 2022", "title": "County Extension Agent Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Colorado State University (Colorado Springs, CO) in Nov 2022", "Interview Descriptions": "Three rounds One with search group, one with community partners, and one with the boss. Highly recommend researching the programs that they are currently running and things like mission statement, etc.", "Interview Questions": "If a county commissioner were to ask you why you deserved funding what would you say?"}, {"date": "31 Aug 2022", "title": "Marketing Content Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Colorado State University", "Interview Descriptions": "The first interview was a brief phone screen, but the second interview was approximately four and a half hours--an hour-long writing test involving four prompts (never mind the fact that they had already received my portfolio), followed by interviews with the marketing team, the communications team, some stakeholders, and the head of the entire department. \n\nEveryone was friendly and welcoming enough--but asking candidates to clear nearly five hours on a workday morning is unreasonable and unnecessarily time-consuming. That being said, if you're going to do it anyway, at least have enough respect to tell people you've rejected them, instead of telling them you'll get back to them in a week and a half, then leaving them in limbo for nearly three weeks until they email you for an update and receive a bland, copy-paste rejection the next morning. \n\nAll in all, the people genuinely did seem fine, but the process ended up being time-consuming and demoralizing when it really didn't have to be.", "Interview Questions": "Talk about a time when a project didn't go as planned."}, {"date": "15 Aug 2022", "title": "Program Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Colorado State University (Fort Collins, CO)", "Interview Descriptions": "My interview with the SLiCE department of Colorado State University was the most transparent, and friendly interview process I have ever had. They are thorough, they will make sure you have the necessary qualification both minimum and preferred, and they care about Equal Opportunity. CSU as a whole may differ, but my experience of interviewing with a search committee, and going through the whole process up to accepting the role was second to no other job I have ever applied for.", "Interview Questions": "What would you be ready and excited to work on right away in this role? What is a place of growth you would need to work on for this role?"}, {"date": "7 Aug 2022", "title": "Academic Advisor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Colorado State University", "Interview Descriptions": "Initial interview is a screening process via Zoom. Second interview is a lengthy process that takes the entire day. You are scheduled to interview with team members, department chair, student staff, and other office management. Then you are required to give a presentation and answer question from anyone in attendance from the department.", "Interview Questions": "How do you intend to navigate and advise a diverse campus?"}, {"date": "29 Jul 2022", "title": "Assistant Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Colorado State University", "Interview Descriptions": "There was a lunch interview with a smaller group, followed by an interview with a group panel. The content of the interview wasn’t challenging so much as the duration and number of activities", "Interview Questions": "Describe a time you improved a process. "}, {"date": "4 Apr 2022", "title": "Telecommunications Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Colorado State University", "Interview Descriptions": "The student interview was brief and mostly a character analysis in my opinion. Management is looking to see if you are a reliable person. This was a student only position.", "Interview Questions": "Do you mind getting dirty, working with heavy objects, or heights?"}, {"date": "11 Mar 2022", "title": "Customer Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Colorado State University", "Interview Descriptions": "go fine and there was no issues I like it it was so easy you will defiantly be accepted, HR and then a technical presentation with a groupThe process took 1 day.", "Interview Questions": "why do you want to work here"}, {"date": "28 Feb 2022", "title": "Teaching Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Colorado State University in Feb 2022", "Interview Descriptions": "Great! My interviewer was kind and non-judgmental. I am writing this so I can access the website for a project I'm sorry if you were actually looking for a real review I just need to know how much a CNA makes", "Interview Questions": "what do you do for fun?"}, {"date": "21 Feb 2022", "title": "Undergraduate Student Researcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Colorado State University (Fort Collins, CO) in Jan 2022", "Interview Descriptions": "The interview process Included an over-the-phone interview and a secondary in person interview. The in person interview covered the lab's goals and values, my relevant experience, and a summary of the duties involved in the position. I was also shown the lab.", "Interview Questions": "What experience do you have with molecular biology techniques?"}, {"date": "16 Nov 2021", "title": "Department of Atmospheric Sciences, Summer REU Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Colorado State University", "Interview Descriptions": "Really quick phone interview, where they introduce you to some members of the department, ask you questions about your application and research experience. They ask why you are interested in the dept and any future plans after the internship (e.g interest in graduate school)", "Interview Questions": "What are some academic challenges you faced"}], [{"date": "10 Nov 2021", "title": "Family and consumer science educator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Colorado State University", "Interview Descriptions": "You have to create a presentation based on a topic provided to for 10 minutes. Community members and partners attend the interview presentation, which you can expect to have about 5-10 people", "Interview Questions": "what challenges have you encountered working in a team? How did you handle the situation?"}, {"date": "6 Sept 2021", "title": "Alumni Business Partnerships Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Colorado State University (Fort Collins, CO) in Sept 2021", "Interview Descriptions": "Short-listed candidates get two interviews, semi-finalist and finalist. Semi-finalists are asked technical questions and not regular interview questions. The focus is to understand the applicant's technical skills. Once you pass this process you will be considered for the Final Interview.", "Interview Questions": "How will you incorporate the university's core values into this position?"}, {"date": "17 Aug 2021", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Colorado State University", "Interview Descriptions": "I had a pretty informal interview process, I reached out to professors via email that I was interested in working for and from there it was relatively easy to talk to them about their research and potential open positions", "Interview Questions": "Preferred work environment/my personal work style "}, {"date": "5 Aug 2021", "title": "Postdoctoral Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Colorado State University", "Interview Descriptions": "The interview will be for 30 min process. Three PIs were in the interview panel. They asked questions about the technical ability to project administrative tasks. There will be another informal session if you get selected for your salary and arrival discussion.", "Interview Questions": "What do you understand from the project highlights given in the advertisement?"}, {"date": "21 Jul 2021", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Colorado State University", "Interview Descriptions": "Went through one phone interview with hiring manager, was offered the job within a week, smooth process. CSU has been wonderful to work for, awesome benefits and beautiful campus. The interview entailed questions on previous research experience and organization.", "Interview Questions": "What is your previous research experience? "}, {"date": "3 Jul 2022", "title": "Graphic Designer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Colorado State University (Fort Collins, CO) in Jul 2021", "Interview Descriptions": "Asked in the initial phone interview if they were open to hiring a remote position. Went through rounds and rounds of interviews, some of which were rescheduled at the last minute. Did a huge presentation for their entire team. All this only to finally be told that they would hire me, except for the fact that I was remote. The whole process was incredibly unprofessional and an enormous waste of my time.", "Interview Questions": "This was a year ago, I do not remember specific questions they asked."}, {"date": "10 Oct 2021", "title": "Front Desk Receptionist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Colorado State University (Fort Collins, CO) in Jul 2021", "Interview Descriptions": "The interview took place over zoom because of COVID. The questions were scenario based and requested insight into my personal skills. The interview was about 30 minuets and was with my potential supervisor and their supervisor as well.", "Interview Questions": "What is a quality you look for in a supervisor?"}, {"date": "21 Jul 2021", "title": "Sample Receiving Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Colorado State University (Fort Collins, CO) in Jun 2021", "Interview Descriptions": "Over Zoom, 3 interviewers asked me all the  typical questions, discussed benefits and it seemed like they wanted me to bring up salary but I didn't, 30 minutes long. Got the job offer", "Interview Questions": "Explain a time that you took a risk and how that worked out for you?"}, {"date": "27 May 2021", "title": "Graduate Research Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Colorado State University", "Interview Descriptions": "Informal.  Discussion of research tends to be as technical and in depth as you want it to be.  More focused on if you're a good fit personality and interest-wise.  Overall, pretty fun as far as interviews go.", "Interview Questions": "What are your research interests? What skills do you want to gain during your time here?"}, {"date": "15 Jan 2021", "title": "Marketing Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Colorado State University in Jan 2021", "Interview Descriptions": "I was provided links to a one-way video interview and was told to complete it in three days. The questions flashed across a screen with a red countdown timer so that you could see the time remaining to answer. I felt this was not the best choice to get to know candidates, as people do not come across as themselves when they are punching a clock trying to provide responses in a specified time frame while being recorded talking into a video screen. Those who may be good interviewers otherwise are not necessarily good trying to provide answers by themselves without the benefit of having a two-way conversation in this format. If provided with this option for an interview in this format in the future I would likely decline. If a company is going to spend the time to watch someone’s video they can be present on the phone to speak to a candidate instead. Maybe it’s a matter of selecting top candidates for those phone calls instead of mass video requests, I’m not sure.", "Interview Questions": "Why are you wanting the job"}], [{"date": "12 Nov 2020", "title": "Technical Support Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at Colorado State University (San Francisco, CA) in Sept 2020", "Interview Descriptions": "It was a typical three step interview. However,  after successfully completing all three interviews. I was left in the wind for almost a month waiting on a response only to be told that I did not receive the role. What was more upsetting was that I wasn't given a realnreason and when I asked for feedback I was told there wasn't really any feedback they could give me.", "Interview Questions": "What attracted me to the company?"}, {"date": "14 Oct 2020", "title": "Senior UX Designer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Colorado State University in Sept 2020", "Interview Descriptions": "Initial interviews went well. Eventually they had me prepare a big presentation for the final interview. Although they indicated they would get back to me in a week or sooner, they did not get back to me for a month. I called and emailed them during that time in a very professional manner and did not receive any responses. I have to wonder if the way they treat final applicants reflects their professionalism in the actual workplace.", "Interview Questions": "They gave you a design assignment, asking for specific suggestions. I can't but help that they are using the interview process to gain free design advice."}, {"date": "24 May 2022", "title": "Engineering Student Ambassador Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Colorado State University (Fort Collins, CO) in Mar 2020", "Interview Descriptions": "The interview process was first a resume and cover letter submission, and then an invitation to interview. The interview itself was a round robin/speed dating with current employees, a group activity and a presentation portion.", "Interview Questions": "Q: What have you accomplished outside of school and work that you are proud of?"}, {"date": "11 Feb 2021", "title": "Senior IT Manager Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at Colorado State University in Jan 2020", "Interview Descriptions": "Very formal and long throughout the entire process. The interviewers were friendly and communicated effectively about the process. You must first apply online at the official CSU website. You will then be contacted by an HR representative.", "Interview Questions": "Explain the IT Projects you have participated in. "}, {"date": "22 Sept 2020", "title": "Associate Marketing Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Colorado State University (Fort Collins, CO) in Jan 2020", "Interview Descriptions": "The first interview took place over the phone in which I chatted with one gal apart of the department who would be my supervisor. Initially focused a lot on my personality and to see if I could mesh with the culture of the department. Then got into the technical aspects of the skills I had and tools I was familiar with.", "Interview Questions": "How would a previous supervisor describe you?"}, {"date": "25 Feb 2020", "title": "Undergraduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 3 weeks. I interviewed at Colorado State University (Fort Collins, CO) in Dec 2019", "Interview Descriptions": "A few questions asking about how to explain loops etc., that are applicable to your class. I was asked how I would explain a certain block of code to a student who didn't understand.", "Interview Questions": "What does this for loop do?"}, {"date": "28 Feb 2023", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Colorado State University in Nov 2019", "Interview Descriptions": "Very relaxed interview process. Had a sit down with two supervisors and one HR person where they asked general questions about my skills, experience, and expectations. It did not feel harsh and I was offered a job by the end of the interview.", "Interview Questions": "What skills can you contribute to the office? What do you value in an office dynamic? What do you do when you encounter a challenge with a coworker?"}, {"date": "18 Jan 2020", "title": "Equipment Operator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Colorado State University in Nov 2019", "Interview Descriptions": "Short and Brief questions about how well I am able to work with others. Completed a driving test in order to make sure I was a suitable driver. Interviewed and heard back pretty quickly about the selection.", "Interview Questions": "When was a time you "}, {"date": "9 May 2022", "title": "Professional Contributor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Colorado State University (Fort Collins, CO) in Oct 2019", "Interview Descriptions": "The interview process was long but good. One initial 30 minute interview in the summer with the panel on zoom to ensure skills and experience meet there needs. The panel interview consisted of 8 individuals from several departments. About six weeks later, I was invited for an in person interview. I was flown out for the  in person interview since I lived out of state. They paid for the flight, hotel, reimbursed me for meals. Initially I was taken around the office and introduced to other staff members. Then I interviewed with the panel for about an hour to answer questions. After this I was shown around campus and then taken to lunch. After lunch I came back and gave a presentation to panel members and others at the university who were interested in attending my presentation with Q&A’s. Afterwards I met with hiring manager, program director, department head to ask questions and talk. About two to three  weeks after the interview after I received an email asking if they could contact my references. It was roughly a week after I received a phone call with a formal offer.  I accepted. I applied in late July, had the first zoom interview In late August. In person interview was in early October and I received offer on Halloween.", "Interview Questions": "Tell us about a time you made a mistake. "}, {"date": "21 Aug 2019", "title": "Project Management Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Colorado State University", "Interview Descriptions": "There is a panel interview to see which department could use your skillset, it is located in a conference room where you will sit on one side and they will sit on the other. They will each individually ask questions that you wi", "Interview Questions": "If there was a significant problem with the software or lab, what would you do about it?"}], [{"date": "15 Feb 2021", "title": "Field Technician Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at Colorado State University (Fort Collins, CO) in Aug 2019", "Interview Descriptions": "Very formal and intimidating.  Didn't ask many questions, required you to come up with everything.  Gave a very mild description of the job, and no set dates.  I did not feel like they wanted me even as I first sat down.", "Interview Questions": "What is some other experience you have related to this field?"}, {"date": "1 Nov 2021", "title": "A/V Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Colorado State University (Fort Collins, CO) in Aug 2019", "Interview Descriptions": "Normal tech interview . Only one interview and then I got hired. Only my boss interviewed me and it was very casual and in his office. It was pretty easy.", "Interview Questions": "What do you know about audio?"}, {"date": "11 May 2021", "title": "Teaching Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Colorado State University (Fort Collins, CO) in Jul 2019", "Interview Descriptions": "Phone calls and emails. One in person meeting for a tour. Mostly discussed past experience and undergrad research. The school was great but they were looking for someone with more industry experience.", "Interview Questions": "What prior experience do you have. "}, {"date": "26 Mar 2022", "title": "Senior Social Media Manager Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Colorado State University (Colorado Springs, CO) in Mar 2019", "Interview Descriptions": "Was a great and easy-going interview.  Enjoyed talking to the staff. The salary was competitive based on the experience they wanted. Moving and relocation costs were not offered. Was a great and easy-going interview.  Enjoyed talking to the staff. The salary was competitive based on the experience they wanted. Moving and relocation costs were not offered.", "Interview Questions": "Do you have experience in using Hootsuite? "}, {"date": "20 Dec 2022", "title": "Research Associate Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Colorado State University in Feb 2019", "Interview Descriptions": "it is zoom interview with 5 people to discuss my skillsets used for programming and research in the past 5 years from academic to industry professional areas. It is a great experience for me. I like it.", "Interview Questions": "which time can you relocate"}, {"date": "21 Sept 2020", "title": "Student Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Colorado State University (Fort Collins, CO) in Jan 2019", "Interview Descriptions": "Super simple; after speaking to PI, spoke to a graduate student I'd be working for, then went over hours and was hired. We did a tour of the lab where you get to speak a bit about what your experience is related to the equipment they have. Not very formal, though, more like a way for them to see what I'm interested in.", "Interview Questions": "Have you worked in a lab before? What kind of types of equipment are you familiar with?"}, {"date": "24 Mar 2021", "title": "Dining Hall Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Colorado State University (Fort Collins, CO) in Jan 2019", "Interview Descriptions": "very straighforward and Not much preparation was needed. Went in with basic knowledge and came out with a job. I would recommend as a good starting job for someone at this university,", "Interview Questions": "How do you work under pressure?"}, {"date": "17 Feb 2019", "title": "Finance/Accounting Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Colorado State University (Fort Collins, CO) in Jan 2019", "Interview Descriptions": "The process took about 2-3 weeks, first was phone interview with 4 team member and later 2 hour in-campus meeting with the same team. Everybody was nice and seemed to be supportive. The interview run a bit longer for me, which I thought I did pretty well. As I thought back about it, I shouldn't be more \"naive\" in a couple of questions about leadership.", "Interview Questions": "1/Why would you think you would be a good fit?\r\n2/ Some technical questions\r\n3/ How would you handle multiple tasks?\r\n4/ Example of a team you were in that failed in doing their job.\r\n"}, {"date": "10 Feb 2019", "title": "Online Project Management Lead Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Colorado State University (Fort Collins, CO) in Dec 2018", "Interview Descriptions": "First a phone interview with the hiring committee.  Then a panel interview with the same 6 or so folks.  Then a presentation and a one-on-one with the hiring manager.", "Interview Questions": "Atypical.   Very interested in FIT as well as skills.  They were interested in me as a person instead of just a body to fill a need.  I appreciated the way they do things.  Interview went amazingly well. I don't think I ever had such a great interview.  I made the top 3, but didn't get the job. "}, {"date": "21 Sept 2021", "title": "Resident Assistant (RA) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. I interviewed at Colorado State University (Fort Collins, CO) in Dec 2018", "Interview Descriptions": "There were multiple parts to the interview/application process. An application, an interview, and  a group interview. There were group activities and questions asked as well as references needed. It was a very clear process that involved applicants being selected to proceed through the next stage.", "Interview Questions": "There was a given situation of residents writing obscene and offensive messages on a public space. "}], [{"date": "10 Nov 2020", "title": "Orientation Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Colorado State University (Fort Collins, CO) in Nov 2018", "Interview Descriptions": "Group Interview at first, then moved on to the individual interviews. Overall, it was a very easy process, and worked on a lot of testing factors based on working with teams. The one on one interview was similar, received an offer a few days after.", "Interview Questions": "How do you work in a team?"}, {"date": "11 Oct 2020", "title": "Lifeguard Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Colorado State University (Fort Collins, CO) in Oct 2018", "Interview Descriptions": "Started off as a group interview that dealt with group strategy. Then same day, they did single interviews with each of us in private. If they liked us then the next week we had an in-water interview to text our lifeguard skills.", "Interview Questions": "What is your strengths as a lifeguard "}, {"date": "7 Aug 2018", "title": "Aquatic Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Colorado State University", "Interview Descriptions": "Interview process was a phone interview. Entire process from application to offer took about 2.5 weeks. Staff interviewing was professional and friendly. Interview itself was straight forward over the phone.", "Interview Questions": "Describe your field experience?"}, {"date": "16 Nov 2020", "title": "Research Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Colorado State University (Fort Collins, CO) in Aug 2018", "Interview Descriptions": "Applied online through the campus hiring portal. Received an interview invitation a few days later. I did one in person interview with the lab coordinators. Received a phone call a few days later offering me the position. Process was quick and easy", "Interview Questions": "How will this internship help your career goals"}, {"date": "24 Aug 2018", "title": "Advancement Data Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Colorado State University (Fort Collins, CO) in Aug 2018", "Interview Descriptions": "The phone interview was most behavioral. The search committee consisted of about five individuals who all took turns asking questions. The interview consist of 6 question and you are given a maximum of 30 minutes to answer them.", "Interview Questions": "Who would you add to and deal with a diversified environment?"}, {"date": "15 Jul 2018", "title": "Academic Advisor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at Colorado State University (Fort Collins, CO)", "Interview Descriptions": "Was contacted for a phone interview about a month and a half after I submitted an application. Contacted a week later for an on campus and told I would hear something for sure in about a week. Six or so weeks passed before I was mailed a rejection letter. They were nice but be prepared for a lengthy interview process from application to offer or rejection.", "Interview Questions": "Describe your commitment to diversity and inclusion. "}, {"date": "18 May 2021", "title": "Transfer Evaluation Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Colorado State University (Denver, CO) in Jul 2018", "Interview Descriptions": "Zoom interview with 4 people.  It was a very standard interview with the typical “tell me about a time when...” questions.  It was very robotic and there wasn’t much ad hoc conversation.", "Interview Questions": "Talk about a time you were challenged and ended up not being successful with the outcome."}, {"date": "26 Feb 2019", "title": "Sexual Health Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Colorado State University (Fort Collins, CO) in Jun 2018", "Interview Descriptions": "There wasn't one for me because I was already working for the office. Instead it was a move up in the office and a new position that was created.", "Interview Questions": "N/A"}, {"date": "11 Apr 2018", "title": "Postdoctoral Position Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Colorado State University", "Interview Descriptions": "Applied in February, and was asked to interview about 1 month later. They set up a meeting over the phone with me, and called me at the meeting time. It was a very pleasant interview, and they answered all of my questions. I also felt like I answered their questions appropriately as well. They let me know I was a finalist at the end of the interview, and that they would be calling my references", "Interview Questions": "They asked questions regarding my research interests,  my fit for the program, and where I saw my research program headed"}, {"date": "14 Mar 2018", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Colorado State University (Fort Collins, CO) in Feb 2018", "Interview Descriptions": "Applied in November and interviewed in person in February. Takes forever, but they are respectful. Was told via phone that they accepted another candidate with experience working in a university and was advised to keep applying for other CSU positions. They expect a lot of your time for all interview steps. Testing, phone interview, and in person.", "Interview Questions": "Why do you want this position"}], [{"date": "10 Mar 2021", "title": "Undergraduate TA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Colorado State University (Fort Collins, CO) in Jan 2018", "Interview Descriptions": "There was only one interview, which lasted about 25 minutes. It was not particularly rigorous, but they asked questions which were relevant to the scope of the job and the duties to be performed.", "Interview Questions": "Talk me through what you'd say to a student who requested help on this code snippet."}, {"date": "17 Oct 2019", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Colorado State University (Fort Collins, CO) in Jan 2018", "Interview Descriptions": "It was a simple process where you go in to an informal office setting. I recommend doing a lot of homework based on the research that lab does so that conversation is able to easily flow.", "Interview Questions": "what is your interest in research and CSU?"}, {"date": "29 Jul 2017", "title": "Administrative Professional Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2+ months. I interviewed at Colorado State University", "Interview Descriptions": "I applied mid-May. Received an email about a video conference interview one month after application. The interview was the following week. Three people interviewed me. Was told at the end of the interview that on campus interviews would be the end of the month. The end of June passed. I sent a follow up email to the interviewer. The interviewer said that the committee was still reviewing candidates. Mid-July I received an email stating that I was no longer being considered.", "Interview Questions": "What sort of program management experience do you have?"}, {"date": "1 Aug 2017", "title": "Career Services Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Colorado State University (Fort Collins, CO)", "Interview Descriptions": "The interview process took about 3 months from the moment I submitted the application online. You first have a screening phone interview with the search committee where they asked 10 questions. The questions were very much based on the job description. The on-campus interviews was then a half day including breakfast, an interview with the search committee, a presentation for the whole career center staff, and an interview (more of a conversation) with the career education team. Very friendly staff and a fun environment. Made me feel very comfortable throughout the process. extremely organized and thoughtful.", "Interview Questions": "Why are you interested in working for the CSU Career Center? "}, {"date": "18 May 2018", "title": "Manager's Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Colorado State University (Fort Collins, CO) in Aug 2017", "Interview Descriptions": "It went well. They emailed me after a while I applied. I went to the work place for the interview. It was mostly on management and how well I could blend in", "Interview Questions": "Tell us a time where you faced difficulty and overcame"}, {"date": "7 Jul 2017", "title": "Administrative Staff Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Colorado State University in Jun 2017", "Interview Descriptions": "Almost 6 months from application to offer. Phone interview with search committee, then a 4 hour interview on campus with several small stakeholder groups. Offer came 4 weeks after the 2nd interview. Committee was scattered but really nice. I was told there were 6 candidates for round 1 (phone) and 3 for round 2 (campus).", "Interview Questions": "Why did you leave your previous career path?"}, {"date": "26 Apr 2018", "title": "Director of Makreting Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Colorado State University (Fort Collins, CO) in May 2017", "Interview Descriptions": "-Had to submit my Resume and Cover Letter \r\n-Had to fill out the entire application and essay portion \r\n-Interview with management \r\n-Decision was given over the phone a few days later after they had time to discuss", "Interview Questions": "How do you describe servant leadership? "}, {"date": "14 Apr 2017", "title": "IM Ref Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Colorado State University", "Interview Descriptions": "Very easy. They have a meeting for anyone interested to attend. They go over what it's like to work for intramural sports. Then give you a paper to fill out with, availability, preferred sports to ref, sports you' e previously played or still play, and a little about yourself. Then they either email you that you got the job or that you didn't.", "Interview Questions": "Sports you play"}, {"date": "28 Mar 2020", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Colorado State University (Fort Collins, CO) in Apr 2017", "Interview Descriptions": "In person, one on one conservation.  Interviewing with the professor you will be working for.  Walk through the lab and see how things are organized and what equipment they have.", "Interview Questions": "How can you contribute to the lab?"}, {"date": "29 Mar 2018", "title": "Applications Programmer/Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Colorado State University (Fort Collins, CO) in Apr 2017", "Interview Descriptions": "The interview helped reveal a poor work environment built on vocabulary and technology memorization with minimal team building or collaboration.  A board of 5 people made dry title introductions and set the expectations of a time limit and that questions would be asked and should be answered with no discussions until the end.  Halfway through the interview I had already decided this is not a good place to work for me and quickly blew off the rest of the questions and discussion.", "Interview Questions": "How do reverse proxies work?"}], [{"date": "23 Mar 2017", "title": "Accounting Technician Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Colorado State University (Fort Collins, CO)", "Interview Descriptions": "It was lengthy from application to the time I got called for an interview. I had to first submit my resume. I made the first cut, so then I had to take an accounting test to even qualify as a candidate. When my results came in as a top contender, then different departments with an accounting position open would request an interview.", "Interview Questions": "Where do you see yourself in 5 years from now?"}, {"date": "9 Mar 2017", "title": "Network Administrator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Colorado State University", "Interview Descriptions": "Easy 30-45 minute interview, mostly behavioral.  There were a couple technical and a few troubleshooting questions, having prior experience is a huge plus.  There was a panel interview, and everyone was very friendly.", "Interview Questions": "Define terms like \"vlan\", \"switch vs hub\", and \"spanning-tree\""}, {"date": "3 Apr 2019", "title": "Student Assistant Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Colorado State University (Fort Collins, CO) in Mar 2017", "Interview Descriptions": "Very flexible hours. Average difficulty. They contacted me via email and gave me a few dates and times to choose from.  Staff was very cordial throughout the process, i felt well informed.", "Interview Questions": "How do you do you see your future at CSU?"}, {"date": "12 Jun 2018", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Colorado State University in Mar 2017", "Interview Descriptions": "Major related questions, and more about your personalities questions were asked by the interviewer. It's not hard if you prepare before the interview. \r\n\r\nThey also test whether you are keen about the research field that you are interested in.", "Interview Questions": "Why you choose Colorado State University"}, {"date": "24 Jan 2017", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Colorado State University (Fort Collins, CO)", "Interview Descriptions": "The head of the department asked questions regarding my proposal for my research associate position, so not really an interview per se!  Very laid back interview with a panel of professors and department head.  The position was tailored for me specifically because the manager had retired and I was the system matter expert.", "Interview Questions": "To discuss the research position I had to write a proposal and present the topic and any alternatives that may arise!"}, {"date": "14 Jul 2021", "title": "Resident Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Colorado State University in Jan 2017", "Interview Descriptions": "Three rounds of panel interviews with University Housing Department, resident directors, and assistant resident directors. Interview process focused on social justice, diversity, and inclusion ideologies. Ensure to review the pillars of University Housing and how it incorporates the transition of residents living on campus.", "Interview Questions": "Q: Why do you want to be a resident assistant? "}, {"date": "24 Nov 2017", "title": "Administrative II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 3 months. I interviewed at Colorado State University (Fort Collins, CO) in Dec 2016", "Interview Descriptions": "Applied to the pool position posting and then waited for a department that needed an Admin II to request an interview through HR. I was sent out to interview and about 3 weeks later, I was offered the position.", "Interview Questions": "What my marginalization style was."}, {"date": "22 Nov 2016", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Colorado State University", "Interview Descriptions": "Just met with a few people in the department for a casual conversation. They just asked me about my school and schedule. It was more of a conversation to see if I would be a good fit with the team.", "Interview Questions": "What's my school schedule?"}, {"date": "18 Sept 2016", "title": "Facilities Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 5 weeks. I interviewed at Colorado State University", "Interview Descriptions": "Interviewed with many people in department and was asked not only technical questions but personality and problem solving questions as well. They were very professional and were great in communicating about the process", "Interview Questions": "Why do you want to work for CSU?"}, {"date": "1 Jul 2016", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Colorado State University (New York, NY)", "Interview Descriptions": "Get in good with a professor and there is no formal interview. The trick to this is to do well in their class and ask if they need help during office hours. Sometime you can do it for credit or for pay. Different if you're an undergrad or grad student.", "Interview Questions": "Again, no real interview."}], [{"date": "22 Sept 2017", "title": "Learning Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Colorado State University (Fort Collins, CO) in Jul 2016", "Interview Descriptions": "The interview process depends on the professor and the department. For me it was very quick and simple, and I was offered the job almost right away. For others the process can take a little longer, if it is for a more competitive class.", "Interview Questions": "Are you comfortable working 10+ hours a week?"}, {"date": "22 Sept 2018", "title": "Computer Lab Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Colorado State University (Fort Collins, CO) in Apr 2016", "Interview Descriptions": "There is a single interview for this position that lasts roughly 30 minutes. The hiring staff is very flexible regarding times that work with your schedule to interview. I was interviews by two computer lab supervisors and asked approximately five or six questions.", "Interview Questions": "Why are you a good fit for this position and what separates you from others?"}, {"date": "9 Oct 2017", "title": "Recreation Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 months. I interviewed at Colorado State University (Fort Collins, CO) in Mar 2016", "Interview Descriptions": "Interview process was flexible and not very difficult. Friendly hiring manager that tried to relate to you on an individual level. Just be confident and personable to connect with the staff.", "Interview Questions": "Why do you want to work at the Rec Center?"}, {"date": "26 Feb 2018", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Colorado State University in Mar 2016", "Interview Descriptions": "The interview was over Skype and lasted about half an hour. I was interviewed by three people, who took turns asking questions.  They emphasized the importance of finding someone who would work well with the other employees and fit within the culture of their organization.", "Interview Questions": "What specific skills do you bring to our organization that make you a better fit than others?"}, {"date": "18 Mar 2019", "title": "Resident Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 months. I interviewed at Colorado State University (Fort Collins, CO) in Feb 2016", "Interview Descriptions": "The interview and hiring process is relatively holistic, but in the end it truly is a potential for growth, and a level of maturity they look for in people. While the interview is important, you aren't being judged necessarily on composure or knowledge. It's more about answering all parts of a question to the best of your abilities, and demonstrating that you are people focused.", "Interview Questions": "Name a time you faced conflict in a work-type setting, and how you handled it."}, {"date": "11 Apr 2016", "title": "Student Housing and Dining Services Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Colorado State University (Fort Collins, CO) in Feb 2016", "Interview Descriptions": "Not really an interview. You should be able to lift a minimum of fifty pounds in order to be eligible for the job. They just ask for your available time slots of the week to work and give a schedule based on that. You should be able to provide as many time slots as possible in order to get the maximum hours.", "Interview Questions": "Can you lift 50 pounds at a time"}, {"date": "17 Jan 2019", "title": "Associate Researcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 months. I interviewed at Colorado State University (Fort Collins, CO) in Jan 2016", "Interview Descriptions": "There was a number of interviews and after that  begun the hiring process from the employers side. The hiring process took a bit more than anticipated because it also involved the issue of a work visa for the US.", "Interview Questions": "Field specific. About the internals of networking and internet security"}, {"date": "6 Jan 2016", "title": "Assistant Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Colorado State University (Fort Collins, CO) in Dec 2015", "Interview Descriptions": "Applied on campus career portal. I was called in the next 2 weeks for interview. One-to-one interview with different project managers and director. I was offered job confirmation the very next day.", "Interview Questions": "previous experience?\r\nwhy want this job?"}, {"date": "24 Nov 2015", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Colorado State University", "Interview Descriptions": "No interview was required for this job.  I applied to the graduate school by submitting my application along with a letter, letters of recommendation, and my GRE test results.  Based on the submitted information, I was offered a graduate teaching assistant ship that transitioned into a graduate research assistant ship after the first year.", "Interview Questions": "N/A"}, {"date": "10 Nov 2015", "title": "Resident Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at Colorado State University", "Interview Descriptions": "Personal interview with behavior based questions regarding my past experiences, qualifications, and responses to \"What-if\" situation questions. The process was long, and about 20 questions were asked during the first interview. Following this interview was a group interview, where I was in a room with several other candidates; this process was to demonstrate how you work in a group, your leadership skills, and your ability to listen and make appropriate suggestions.", "Interview Questions": "How does alcohol influence the surrounding community?"}], [{"date": "8 Oct 2015", "title": "Student Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Colorado State University", "Interview Descriptions": "Extremely quick and easy application and interview process. I found the job opening on the student employment site and submitted the required materials (cover letter and transcript). I was asked to come into the office and had a very informal interview. They told me the job requirements and asked a few questions. I was offered the position the next day.", "Interview Questions": "Why do you want to work here?"}, {"date": "23 Sept 2015", "title": "Mass Spectrometry Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Colorado State University (Fort Collins, CO) in Jun 2015", "Interview Descriptions": "After applying online it took about a month before I was offered a 40 minute Skype interview. The interview was with a committee of four people at once, but it was pretty casual and comfortable. Everyone was extremely nice and just asked me questions about my experience and why I wanted the job. Then about half a month later I was offered an on-campus interview. This was an all day interview that just felt like spending time with friends. The morning was mostly with the hiring committee, lunch was with graduate students, and the afternoon was personal interviews with faculty and instrument staff. The main problem was just timing and relocation logistics.", "Interview Questions": "Do you see this job as a stepping stone or a longterm career?"}, {"date": "8 Apr 2015", "title": "Marketing and Communications Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Colorado State University", "Interview Descriptions": "It was very quick and wonderful. Interviewer was kind, and there was another student-staff present, so it seemed less intimidating. I first sent in my application after being referred through another student, and I received a calls several days later from the employer. We then set up an interview time. When I came in I had a physical portfolio and my laptop to show my online one, both of which they appreciated. Then, several days later, they called me to say they'd like me on the team.", "Interview Questions": "Tell us why you're here.\r\n"}, {"date": "6 Oct 2018", "title": "Academic Success Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 3 weeks. I interviewed at Colorado State University (Fort Collins, CO) in Feb 2015", "Interview Descriptions": "Phone interview is first round.  Second round is on campus interview.  Something to know is that there might be an open forum where anyone from campus can sit in and ask you questions.", "Interview Questions": "Tell us about your advising style/philosophy.  "}, {"date": "6 Nov 2015", "title": "Student Dining Services I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Colorado State University (Fort Collins, CO) in Jan 2015", "Interview Descriptions": "It's a very simple process with minimum requirements. Almost anyone and everyone can do this job. It all just depends on the openings available at that point of time. After submitting an application online, the manager called me to set up a meeting at his office in a couple of days. After reaching his office, he asked some basic questions about myself and offered the job.", "Interview Questions": "Can you lift things of 50 pounds?"}, {"date": "8 Dec 2014", "title": "Communications Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Colorado State University", "Interview Descriptions": "The hiring process at this university is very slow and formal. it involves a phone interview with the hiring committee who will ask a set list of 6-8 questions and at least one on-campus interview where you will be asked to present at an open forum where anyone across campus can ask questions. There is a tradition of favoring internal candidates, although talent is prioritized for the most part.", "Interview Questions": "How will you navigate the internal politics of a university and build relationships at all levels?"}, {"date": "22 May 2016", "title": "Program Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Colorado State University (Fort Collins, CO) in Dec 2014", "Interview Descriptions": "The interview process was pleasant and conversational overall. The staff at the CSU Health Network are great and were welcoming and helpful. An email exchange to schedule an interview was followed by an in person interview with the Program Manager and a tour of the workplace. Responses were timely and efficient, whole process from application to hire took about two weeks.", "Interview Questions": "What do you see as your personal strengths?"}, {"date": "18 Sept 2016", "title": "Call-a-ram Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 5 days. I interviewed at Colorado State University (Fort Collins, CO) in Nov 2014", "Interview Descriptions": "It was quick and painless.  Applied and then got an interview quickly.  They hire a lot and the turn over is quick so they hire just about everyone if you show up and give a decent interview.", "Interview Questions": "Why do you want to work for us?"}, {"date": "24 Sept 2014", "title": "Web Developer Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Colorado State University", "Interview Descriptions": "I applied for the post through the RamWeb. A couple of days later, I received a call from a manager at who scheduled me for a phone interview. The same recruiter conducted the phone interview two days later. He asked me very basic questions based on my resume. Asked me to describe what I did at my previous job. Asked a couple of more detailed questions based on my answers. When asked what the next step would be if I cleared this interview, I will receive a mail from him", "Interview Questions": "No difficult questions really."}, {"date": "16 Nov 2018", "title": "Advisor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at Colorado State University (Fort Collins, CO) in Sept 2014", "Interview Descriptions": "painful. it took 6 months, the process took many steps, the group interview was ill coordinated, and it took again 6 months. this is a really, really long time. I should have realized at the time that everything at CSU takes this long..but how woudl I know that up front?  wow.", "Interview Questions": "Why did you work at a for-profit university in the past? don't you value education?"}], [{"date": "18 Aug 2014", "title": "Research Associate II Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Colorado State University", "Interview Descriptions": "Interviewed for a position that worked collaboratively with a federal agency. The people conducting the interview had little to no training in how to run an interview, or the steps to the hiring process.  The entire hiring process was a fiasco. The point person / point of contact for follow up about the job ended up being a peer, rather than a supervisor, and had no ability or power to handle negotiations. Make sure you know who to talk to about negotiations. This was not clear, probably because of incompetence in the whole hiring process. I was unable to negotiate, because my job offer (and all contact) was with someone with absolutely no power to negotiate with me.", "Interview Questions": "Questions were reasonable, and very appropriate. Nothing unexpected."}, {"date": "28 Feb 2017", "title": "Equipment Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Colorado State University (Fort Collins, CO) in Aug 2014", "Interview Descriptions": "One in person interview with the department head regarding past work experiences and ability to balance work and school. Simple background check and you must have been granted work study to apply. Some students do not know that you can be approved for \"merit\" based work study if you inquire. You will be approved as long as you request it early in the year. All the work study jobs become available to you too!", "Interview Questions": "How will I deal with a work and school schedule? "}, {"date": "17 Oct 2014", "title": "Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Colorado State University in Jul 2014", "Interview Descriptions": "I applied in early June, received notice that CSU would like to schedule a phone interview with me two weeks later, and had the phone interview a week following that – easy. Two weeks later, after following up, I was notified that I was in the final round of interviews, and that the hiring committee would like to meet me in person for an interview.\r\n\r\nI was told to put together a comprehensive presentation for my interview, which I prepared very well. The interview was the best I've ever had – the meeting was two hours long.\r\n\r\nTwo weeks later (after following up) I was informed that I did not get the job, through a voicemail. I am now seeing the ideas and concepts proposed in my interview presentation popping up on CSU's online sites, and have learned that one of my INTERVIEWEES was actually hired internally for the position.\r\n\r\nMy advice to CSU: If you plan to hire internally, keep in best practices by not having your preferred hire interviewing other candidates. Additionally, do not gleam ideas or inspiration off of candidates' presentations that they spent hours strategizing and working on.", "Interview Questions": "N/A"}, {"date": "30 Mar 2016", "title": "Research Associate II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 2 weeks. I interviewed at Colorado State University (Fort Collins, CO) in May 2014", "Interview Descriptions": "An over the phone interview. Discussed knowledge about the model I would be working with as well as other different models. Talked about potential projects going forward and some mutual connections.", "Interview Questions": "Why are you a good fit for this job?"}, {"date": "25 Oct 2015", "title": "Web Developer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Colorado State University (Fort Collins, CO) in May 2014", "Interview Descriptions": "Asked to prepare code samples and a demonstration of a recent project, which I walked through with a group of about five team members. Later, met with technical lead (actually drove to a coffee shop to grab a drink) to discuss specific skills and for me to ask questions, and finally with department manager.", "Interview Questions": "How do you go about organizing your work day to day?"}, {"date": "16 Apr 2014", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at Colorado State University", "Interview Descriptions": "Many of you may have watched my YouTube videos but what you don’t see are the behind the scenes situations that take place. Some situations are rather funny and some are rather serious. The glamour and glitz that athletes and their families imagine about this process is not what I have personally experienced. Yes, we have fun, but there are a lot of factors that go into securing and accepting a college football scholarship.", "Interview Questions": "What other schools are recruiting you?"}, {"date": "3 Nov 2015", "title": "Student Equipment Operator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 4 days. I interviewed at Colorado State University (Fort Collins, CO) in Apr 2014", "Interview Descriptions": "Applied online, had a great referral from a close friend of mine from college. Came into the warehouse the next day and had a non formal interview with the senior Ops manger. We hit it off from the start and later that day he informed me that I was the number one candidate for the position. Got a call later that day officially offering me the job. He informed me that their was going to be a back ground check but as soon as I passed that I could start work. The whole process was very quick and painless. I would recommend a state position to all who wants to work hard but have holidays off and don't mind working on a college campus", "Interview Questions": "N/A"}, {"date": "29 Jul 2015", "title": "Graduate Teaching Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. The process took 1 day. I interviewed at Colorado State University (Fort Collins, CO) in Mar 2014", "Interview Descriptions": "The process is rolled into the application process. There is no interview or real consideration for who should receive these prized positions outside of the application for attendance. The downside for this is that they make a choice before actually getting to know anyone. There seems to be little opportunity for advancement based on merit seeing as the final decisions are made prior to school starting. On the plus side, if you get a GTA position, it is rare that you will ever lose it.", "Interview Questions": "N/A"}, {"date": "9 Dec 2013", "title": "Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 4 months. I interviewed at Colorado State University (Fort Collins, CO)", "Interview Descriptions": "Phone interview first. Then in-person interview with an internal search committee comprised of about 16 people.", "Interview Questions": "CSU will almost always ask you about Land Grand Universities. Do your homework and be ready to know about CSU's land grant heritage. "}, {"date": "28 Oct 2014", "title": "Software Maintenance – HDS Operations Management Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at Colorado State University in Oct 2013", "Interview Descriptions": "Interview was easy, as I am a student at CSU form CIS. Luckily my manager had the same degree from same professors. Received call from Manager for 1:1 interview. He asked me questions related to basic computer skills and explain me the process and software.", "Interview Questions": "just gone through my resume and skills."}], [{"date": "15 Sept 2013", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I interviewed at Colorado State University", "Interview Descriptions": "Initial communication via email, and that led to a couple of telephonic interviews. Final interview was a one-to-one meeting. In about a 30 days period, I was conveyed that I got the job.", "Interview Questions": "How would you act on an 'XYZ' situation? The question had many possible answers and aspects."}, {"date": "14 Sept 2013", "title": "Student IT Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through other source. The process took 2 weeks. I interviewed at Colorado State University (Fort Collins, CO)", "Interview Descriptions": "Normal interview followed by half hr of troubleshooting questions.", "Interview Questions": "Puzzle problems."}, {"date": "22 Jul 2015", "title": "Program Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Colorado State University (Fort Collins, CO) in Sept 2013", "Interview Descriptions": "Committees of full time staff people conduct phone interviews, then candidates are selected for a second round of on-campus interviews.  The on campus interviews are a full day. I was given a campus tour, Gave a presentation, interviewed with the potential supervisor, interviewed with a panel of potential coworkers. After the interview, the selected candidate is given a verbal offer contingent on passing a background check. Once the background check is complete, the candidate is sent a formal offer letter. If the candidate accepts, he/she signs and returns the offer letter.", "Interview Questions": "How would you promote social justice?"}, {"date": "28 Dec 2016", "title": "Newsletter Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Colorado State University (Fort Collins, CO) in Sept 2013", "Interview Descriptions": "This was a student position. I had two interviews--one with my direct supervisor (who as also a student) and one with her supervisor, the department head, who was a full-time staff person. Each interview was about 30-45 min long. I also was asked to submit a sample of writing, edit a newsletter article submission, and provide a graphic portfolio if I had one.", "Interview Questions": "Share an example of a time when you learned something on your own. How did you learn the skill and what were the outcomes? "}, {"date": "12 Oct 2015", "title": "Helpdesk Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Colorado State University (Fort Collins, CO) in Aug 2013", "Interview Descriptions": "Received a phone call from the office recruiter to schedule an interview. Then I met with the department director. We spoke for 10-15 mins, and scheduled me in for a real interview with the employees of the department to make sure I would fit in. People at the department were very nice and friendly. Few days later I got an offer and I accepted it right away.", "Interview Questions": "As a customer service personnel, how did you handle a difficult situation with a customer?"}, {"date": "23 Feb 2017", "title": "Research Scientist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Colorado State University (Fort Collins, CO) in May 2013", "Interview Descriptions": "get phD degree at the same place, same lab, no interview process to enter a research scientist job position. No other comments here. no questions asked. no questions asked. no questions asked", "Interview Questions": "N/A"}, {"date": "30 Mar 2014", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Colorado State University (Fort Collins, CO) in Apr 2013", "Interview Descriptions": "Talked initially through email after I responded to the job posting.  Went to interview in person and received a job offer about two days later.", "Interview Questions": "There were no curve ball questions asked for this position."}, {"date": "7 Apr 2015", "title": "Guest Services Team Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 2 weeks. I interviewed at Colorado State University (Fort Collins, CO) in Mar 2013", "Interview Descriptions": "Very organized, well informed, professional, want to use your strengths. Two on one interview style. Ask you about why you want the job, how will your personality fit into the work environment.", "Interview Questions": "Give an example of a difficult situation you were in and how you overcame it."}, {"date": "27 Jan 2013", "title": "Laboratory Research Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Colorado State University", "Interview Descriptions": "Very friendly, fair professors and lab techs.", "Interview Questions": "Based mainly on my academic credentials."}, {"date": "16 Aug 2015", "title": "Undergraduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at Colorado State University (Fort Collins, CO) in Jan 2013", "Interview Descriptions": "Interview process consisted of getting a hold of professor that you like and asking them about their research. Ask if you can be apart of there meetings. Then if you like the work ask if you can help with anything.", "Interview Questions": "The only questions asked were what I was interested in learning and doing with my life"}], [{"date": "14 May 2016", "title": "Comparative Medicine Resident Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Colorado State University (Fort Collins, CO) in Dec 2012", "Interview Descriptions": "Group interview, most of the time you are not with other candidates. Only time you would see them would be during lunch and dinner. Great experience meeting with everyone, a full day of schedule including the resident dinner at the end.", "Interview Questions": "Clinical vs. Research Interest\r\nPrevious experience \r\nWhy/how did you get interested in lab animal medicine"}, {"date": "5 Jan 2016", "title": "Network Analyst I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Colorado State University in Aug 2012", "Interview Descriptions": "The interview was good, we first had an in person interview with the entire team and then individual interviews.  They got back to me in several weeks though and if you didn't make it into their final picks you didn't get notified.", "Interview Questions": "What was your experience with vlans, security and how they work."}, {"date": "13 Apr 2014", "title": "Adjunct Instructor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Colorado State University (Fort Collins, CO) in Aug 2012", "Interview Descriptions": "The hiring process is very simple. Almost all the departments have an online application process to get into the hiring pool. Once you are in the pool you have a chance to get a interview. The interview can provide with very important feedback and maybe en in a great job.", "Interview Questions": "The most difficult part of my job is the communication skills and how to speak in from of the audience. "}, {"date": "7 Dec 2015", "title": "Web Developer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Colorado State University (Fort Collins, CO) in Jul 2012", "Interview Descriptions": "Met four individuals from CSU at Cafe Vino (I later found out this was against HR recommend interview practices, and they no longer do this). Three from the Division I was applying for, one from central HR (Office of Equal Opportunities). Asked me simple questions about why I'm applying for job. No tests of my technical ability at all (no coding on a whiteboard, no sample code, no technical questions). After describing my technical experience they left. I then interviewed with my to-be supervisor. She asked me a few questions about résume, and showed me the web site I would be working on. We wrapped up the interview soon after.", "Interview Questions": "Where do you expect to be in 5 years time?"}, {"date": "12 May 2015", "title": "Senior Research Scientist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Colorado State University (Fort Collins, CO) in May 2012", "Interview Descriptions": "Extremely easy. I applied for a technician position for which I was overqualified and was offered a faculty equivalent appointment (without tenure). I happened to know someone who gave me a great reference for the position and knew the hiring person.", "Interview Questions": "How would I get along with others (PI's wife is a postdoc in the lab)? Are you interested in the science (asked in various forms, not so directly)"}, {"date": "29 Mar 2016", "title": "Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Colorado State University in May 2012", "Interview Descriptions": "I had a phone interview with a committee and then an office interview - first with the team and then the hiring manager.  It went smoothly. Questions seemed formatted.", "Interview Questions": "What interests you to apply for this position"}, {"date": "19 Jul 2012", "title": "GIS Technician Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Colorado State University (Fort Collins, CO) in May 2012", "Interview Descriptions": "Applied by the April 20th deadline.  Got a call the last week of May for an interview.  Interview was a conference call over the phone with the CEMML director and 3 other employees at the job location. Seemed to go pretty well. Pretty standard questions \"Tell us about your GIS background?\" \"Why are you interested in this position?\" \"How would you rate your map design skills?\"  I was told that as I had made it so far in the hiring process that they would be checking references and I should let my current supervisor know to expect a phone call.  Also, that they would be letting candidates know a decision in a week or 2.  They never called my supervisor.  They never called any of my references.  19 days went by and I called to see at what point of the hiring process they were at.  I was told they were conducting the last interview the next day and would be letting everyone know their decision in another week. 30 days later I still had heard nothing and so I called again to check.  Was told they offered the position to a different candidate last week.  Kinda pissed that they strung me along for 2 months and had me show my hand to my current employer but never called.", "Interview Questions": "I didn't find any of the interview questions particularly difficult.  Waiting for 2 months on a decision for the position was difficult. Telling me to stick my neck out and let my boss know I've interviewed and then never following through like they said and calling him was just plain rude. "}, {"date": "13 Mar 2012", "title": "Personal Trainer, Medical Campus Recreation Center Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. The process took 1 day. I interviewed at Colorado State University (Aurora, CO) in Mar 2012", "Interview Descriptions": "Well CU does have great plans for the recreation center but were completely naive of needed facts to attract real fitness professionals.  The fitness manager could not tell me how many trainers were going to be hired; or the hours that will be expected.  He stated nobody would receive full time hours; in order to avoid giving benefits.  He couldn't even tell me what to expect as far as compensation.", "Interview Questions": "How many hours do you think you can train in an average week?"}, {"date": "12 Jul 2016", "title": "Library Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Colorado State University (Fort Collins, CO) in Jan 2012", "Interview Descriptions": "I went in to the Library office and sat down with the manager.  We talked about my resume and he said I had done a lot of things for how young I was. (18 at the time).  Then he explained the job which was pretty much stalking the shelves and scanning books to send to other libraries.  He though I had the right experience and we just had similar interests since I noticed he was outdoorsy.  Got the job.", "Interview Questions": "What has prepared you for this job?"}, {"date": "9 Jan 2014", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Colorado State University (Fort Collins, CO) in Dec 2011", "Interview Descriptions": "It basically started of with talking to one of the professors regrading courses and all. After that when I learned he had a position in his research team I went to him and asked him directly if I could work with him. After that it was all about talking about the expectations from each other and what we were expecting out of this.", "Interview Questions": "All your courses have been regrading the waste water treatment, will you be able to do the amount of homework required to get into the oil and gas research we are talking about here and how are you planning to do that? And do you think it will be a problem in future while searching jobs because your course work and research doesn't have a lot in common?"}], [{"date": "4 Jun 2014", "title": "Advanced Video Production Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through other source. The process took 2 months. I interviewed at Colorado State University (Fort Collins, CO) in May 2011", "Interview Descriptions": "Was hired in from when I was a student hourly. First as a 1 year temp contract then after a year as a full time. It was truly a lengthy \"backdoor\" process.", "Interview Questions": "No formal interview for the promotion took place. The most difficult part about that was you just had to constantly prove your worth when aiming for a full time job."}, {"date": "19 Apr 2012", "title": "Student Event Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Colorado State University (Fort Collins, CO) in Mar 2011", "Interview Descriptions": "The supervisor with 2 staff members interviewed me. Most of them are behavioral based questions and some personality questions. The interview lasted about an hour. They emphasize the ability to solve conflicts and require a excellent communication ability.", "Interview Questions": "What do you do for fun?"}, {"date": "16 Dec 2015", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Colorado State University (Fort Collins, CO) in Feb 2011", "Interview Descriptions": "The interview process included a combination of social mixers with students and faculty as well as one-on-one interviews with potential faculty advisers. The department also organized campus tours and informational sessions to highlight some of the resources and advantages of studying at Colorado State University.", "Interview Questions": "Why do you want to do a Ph.D.?"}, {"date": "25 Aug 2015", "title": "Marketing Director Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at Colorado State University (Fort Collins, CO) in Jan 2011", "Interview Descriptions": "Long, detailed form submitted online with discussion questions. This application and your CV/publications list stays on file, but does not necessarily count toward applications to other departments and programs. This is also a publicly funded university, and all CVs, salaries and benefits are public record.\r\nIn person interview with three different staff in the department. They were creating a new position within the department and needed to make sure the person fit into the culture. \r\nMultimedia presentation for a panel from the department and allied consultants. This was the most difficult part, requiring not only a slide show type presentation, but a demonstration of skills in different media (audio, photo, video, writing, public speaking, etc.)", "Interview Questions": "What is your experience with the programs under this department?"}, {"date": "5 Jun 2013", "title": "Teacher Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Colorado State University (Fort Collins, CO) in Jan 2011", "Interview Descriptions": "Must know the basics of microsoft office suit, especially the excel and word, which provides most practice for students.", "Interview Questions": "How to do statistic formula in excel."}, {"date": "6 Apr 2012", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Colorado State University (Fort Collins, CO) in Aug 2010", "Interview Descriptions": "Brought in for an in person interview where 3 people interviewed me. Was asked questions about previous job experience. Then I was offered the position the next day.", "Interview Questions": "What has been your favorite job and why?"}, {"date": "20 Jun 2014", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 2 days. I interviewed at Colorado State University (Fort Collins, CO) in Aug 2010", "Interview Descriptions": "I initially heard about this position through one of the faculty members.  I was referred to a professor who then referred me to a graduate student.  I had an informal interview with the graduate student who hired me immediately as the contract was already in progress with an external client.", "Interview Questions": "The questions were based on my background and I discussed my previous work history, school experience and my ambitions for the position offered."}, {"date": "30 Sept 2014", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Colorado State University in Aug 2010", "Interview Descriptions": "I met with the professor I wanted to work for. He offered me a position that day. Make sure you know about their work and make sure you are able to hold a conversation with them about it. Everyone is laid back, as long as you are motivated and as long as they have the funding, joining a lab shouldn't be that difficult.", "Interview Questions": "What do you want to do with your life and how would joining my lab help you get there?"}, {"date": "8 Jan 2012", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 2 weeks. I interviewed at Colorado State University (Fort Collins, CO) in May 2010", "Interview Descriptions": "I had an interview with the researcher. I had taken a few of his classes previously, and was able to incorporate that knowledge into the discussion.", "Interview Questions": "What do you want to do after graduation?"}, {"date": "29 Jun 2013", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Colorado State University (Fort Collins, CO) in Apr 2010", "Interview Descriptions": "Through Grad school application", "Interview Questions": "appearing GRE"}], [{"date": "8 Apr 2014", "title": "Research Associate III Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Colorado State University (Fort Collins, CO) in Mar 2010", "Interview Descriptions": "I did not have an interview; was hired by professor based on work knowledge", "Interview Questions": "N/A"}, {"date": "25 Feb 2012", "title": "Engineering Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Colorado State University (Fort Collins, CO) in Mar 2010", "Interview Descriptions": "A phone interview with hiring person and his immediate supervisor.  Asked a few questions about my background and work, pretty straightforward.  On the on-site interview, I gave a presentation and was deeply challenged on a few of my points, which I enjoyed.  I was glad to see people cared and would speak up when they disagreed with something.", "Interview Questions": "I really don't recall; there weren't any specific questions that were that difficult."}, {"date": "21 Jun 2013", "title": "Adjunct Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 1 week. I interviewed at Colorado State University (Fort Collins, CO) in Jun 2009", "Interview Descriptions": "Not a lot of an interview as they go by your CV. I had a great gps, so they asked a few phone questions, and within a week I was hired.", "Interview Questions": "Why do you want to come from Massachusetts to work for us in Colorado?"}]]