[[{"date": "8 Mar 2023", "title": "Administrative Assistant II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Young Life", "Interview Descriptions": "I had a great interview experience. Everyone was very pleasant and asked good questions that pertained to the job. I was interviewed by a panel and that was the only interview. I liked that I did not have to jump through 6 different interviews where I am asked the same question every time.", "Interview Questions": "How will your previous experience come into play for this position."}, {"date": "22 Jan 2023", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Young Life", "Interview Descriptions": "The interview process felt easy because I knew the hiring manager so it felt just like a conversation. There were lots of good questions that led to good conversation. Each hiring person can be different though.", "Interview Questions": "How do you fill your cup outside of work?"}, {"date": "20 Dec 2022", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Young Life", "Interview Descriptions": "Everyone in the process was easy to talk to and asked great questions and I was able to ask questions at the end. Application, phone screen, and in person interview.", "Interview Questions": "Tell me about your organizational skills"}, {"date": "5 Aug 2021", "title": "Staff Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Young Life", "Interview Descriptions": "Very intentional, inviting, and friendly interviewers. There were about 6-7 people in the interview which was unexpected. I didn't think there would be that many but made sense since it is a ministry position.", "Interview Questions": "What is the Gospel? What are your strengths and weaknesses?"}, {"date": "13 Oct 2022", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Young Life (San Diego, CA) in May 2021", "Interview Descriptions": "Super Easy and people are super genuine and kind. They love Jesus and it's clear. The job I took I did a trial for for over a month than got hired", "Interview Questions": "Where do you see yourself in 5 years"}, {"date": "21 Feb 2021", "title": "Wilderness Guide Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Young Life", "Interview Descriptions": "The intereview was with two people. Each took about an hour and it was an overall enjoyable experience. It was more of them just getting to know you instead of grilling you.", "Interview Questions": "Can you share the Gospel?"}, {"date": "27 Aug 2020", "title": "Accountant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Young Life", "Interview Descriptions": "It was a very chill interview process and the people were extremely nice.  It is important to be yourself in the interview because if not they will be able to tell. Also , it is a Christian organization so make sure you are prepared to answer questions about your faith.", "Interview Questions": "What has God been teaching you recently?"}, {"date": "13 Feb 2020", "title": "Area Director Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at Young Life", "Interview Descriptions": "Confusing what the actual job entails. Seemed to care a lot about connections. Nice interviewer. They seemed to have a lot of fun. He came to interview me in sandals.", "Interview Questions": "How long have you been involved with Young life?"}, {"date": "5 Dec 2019", "title": "Area Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 6 months. I interviewed at Young Life", "Interview Descriptions": "I was interviewed by two different groups who held various positions within the organization. The interview coud have been seen as unprofessional in some regards, but otherwise it was taken very seriously and they asked great questions!", "Interview Questions": "How do you feel about raising $25,000?"}, {"date": "11 Apr 2019", "title": "Administrative Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Young Life (Colorado Springs, CO) in Mar 2019", "Interview Descriptions": "First met with Office Manager and two other high-level admins. The interview started with a prayer. Interviewers were very friendly and made the environment non-threatening. Call back interview involved Office Manager, COO and another admin on the team.", "Interview Questions": "How would you go about solving the following problem:  How many ping pong balls will fit in a vehicle (don't exactly remember the type of vehicle they may or may not have said).  The point was to just listen to how you would go about solving this.  Don't be shy - think out loud and be honest!"}], [{"date": "16 Oct 2020", "title": "Staff Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Young Life (Nashville, TN) in Mar 2019", "Interview Descriptions": "Pretty straight forward. One in person meeting and one interview. They give you really intentional questions but also give you affirmations at the end. I feel like this could go very differently for people who are different than the people who are interviewing.", "Interview Questions": "How did you meet Jesus? "}, {"date": "20 Mar 2019", "title": "Video Editor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at Young Life (Colorado Springs, CO) in Feb 2019", "Interview Descriptions": "Phone call with hr followed by a Skype interview with hiring team! Overall pretty smooth they kept active and we're responsive to my questions and emails. Very friendly and willing to help anyone out that needed it.", "Interview Questions": "What are your strengths and weaknesses?"}, {"date": "23 Apr 2019", "title": "Staff Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Young Life (Houston, TX) in Jan 2018", "Interview Descriptions": "We sat in a large conference room with about 5 full time staff associates who had been working for the company for 5 years or more. They were kind and all took turns asking about how I operated and what I could bring to the table.", "Interview Questions": "If we tell you tomorrow that we will have to relocate you, is that a change you are willing to make?"}, {"date": "3 Jul 2019", "title": "Year Long Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Young Life in Sept 2017", "Interview Descriptions": "It started with an email confirming interest. I then sent in a video no longer than 5 minutes answering some questions about who I am.  Next, they called me with two people interviewing me via phone call. Lastly, they called and gave me the position. I had a week to accept", "Interview Questions": "How has your faith been impacted through this past year?"}, {"date": "10 Sept 2020", "title": "Staff Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Young Life (Detroit, MI) in Apr 2017", "Interview Descriptions": "I met with the area director for a one on one interview, then met with 3 other staffers who asked behavioral interview questions, and then met with 3 others who asked me about my story and what led me to YL.", "Interview Questions": "Tell me about a time when you had conflict with someone."}, {"date": "25 Jul 2019", "title": "Staff Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at Young Life (Bettendorf, IA) in Oct 2016", "Interview Descriptions": "It was an in-person interview with 3 people (Regional Director, Regional Admin, and Regional board member). They asked personal questions to get to know me and my desire to work in christian ministry. They asked how I would handle certain situations with students, donors, and committee members. The interviewers were very friendly and not intimidating.", "Interview Questions": "What experience do I have with Young Life?"}, {"date": "27 Mar 2017", "title": "Administrative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Young Life (Manhattan, KS) in Apr 2016", "Interview Descriptions": "The interview process was business casual. I was contacted a few days after submitting my resume, we met at the Young Life office, just myself and the Area Director. He had a series of normal application questions i.e. Tell me a bit about yourself, what is your employment experience, did what did you like and not like about some of your previous employments, what are you looking for if you became employed at Young Life...and also a few that you only get when interviewing at a Religious based organization i.e. What does you relationship with Christ look like today, when were you saved, what church do you attend, are you involved with any church groups outside of Sunday morning services, do you have a person in your life that you look up to as a mentor? These all were asked and answered in a very causal conversation style approach and he took notes. About 3/4 of the way through he began saying things like \"when you start\" as opposed to \"if you start\" working with Young Life. I felt good about the interview when it was all over and I received a call from him two days later offering me the position.", "Interview Questions": "The most difficult questions I was asked during this interview were the religious based questions, because of there very personal nature. So for example, What is your relationship with Christ like today?"}, {"date": "4 Apr 2017", "title": "Student Staff Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Young Life (Salem, OR) in Apr 2016", "Interview Descriptions": "They basically wanted to know my journey with Christ and how I came to apply for the job. Young Life is interested in hearing people's stories, so I just told them mine. The interview process was pretty casual. I knew everyone who was interviewing me, so it was easy to feel comfortable.", "Interview Questions": "What are your organizational systems? How will you manage school and work?"}, {"date": "26 Nov 2017", "title": "Staff Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at Young Life (Dallas, TX) in Mar 2015", "Interview Descriptions": "You will interview with the regional interview team, with the area director, and then with the area's committee. The regional interview team will ask questions about what type of position you're interested in, the type of kids you'd like to work with, etc.", "Interview Questions": "Please share the Gospel with us as if we are a high school student."}, {"date": "17 Apr 2015", "title": "Area Director I Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 5 months. I interviewed at Young Life (Westfield, NJ) in May 2014", "Interview Descriptions": "It portrayed false and inaccurate information about the area, position, and title. It was also extremely and unnecessarily lengthy. The person(s) in charge of the interview process were not fit for such a role, nor were they equipped to express and evaluate the position with integrity.", "Interview Questions": "Will you have an issue with women being in a leadership capacity?"}], [{"date": "9 Aug 2017", "title": "Student Staff Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Young Life (San Jose, CA) in May 2014", "Interview Descriptions": "Hiring process is straight forward and honest. Great Non- Profit to be involved with in any capacity.  The interviewing process reflects the programs overall stance of being highly relational.", "Interview Questions": "How long do you see yourself in this role?"}, {"date": "11 Aug 2015", "title": "Student Staff Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Young Life (Portland, OR) in Apr 2014", "Interview Descriptions": "Panel interview asking about your personal story, and ways to deal with difficulties in the workplace, your plan for your time on staff, how you plan to fundraise for yourself", "Interview Questions": "How would you handle inappropriate team relationships?"}, {"date": "16 Jul 2015", "title": "Property Staff Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Young Life in Feb 2014", "Interview Descriptions": "Interviews all over the phone. First one was a standard \"getting to know you\" interview. Very friendly, very personable. If you get to the second round, it's an interview with a panel. Since I could not go to the location, it was over the phone once more. Go over skills, personality, and any work experience that could relate. Overall it was pretty average.", "Interview Questions": "How do you handle struggles in the community? What has been a challenge that you have been through and how did you respond to it?"}, {"date": "10 Dec 2015", "title": "Communication Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Young Life (Colorado Springs, CO) in Feb 2013", "Interview Descriptions": "Great questions, easy to respond. Light-hearted. Asked questions about my faith and prior experience. Thoroughly enjoyed the interview process. Very friendly, and were generally interested in my life and what I wanted to do with Young Life.", "Interview Questions": "Past Young Life experience"}, {"date": "17 Nov 2017", "title": "Campaign Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at Young Life in Jan 2013", "Interview Descriptions": "I already knew the hiring manager and supervisory manager, so I was not a typical case. I had two or three personal (1:1) interviews, then my wife and I had a group interview with the leadership team. Finally, I met in person with my boss's boss. Then was hired.", "Interview Questions": "Tell us about your calling to this position."}, {"date": "22 Jul 2012", "title": "Regional Director Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Young Life", "Interview Descriptions": "Past experience, ability to fundraiser and manage people.", "Interview Questions": "What are your strengths, what sets you apart from other applicants."}, {"date": "9 Apr 2016", "title": "Staff Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Young Life (Houston, TX) in Jul 2012", "Interview Descriptions": "I was recruited by a regional employee who asked me if I was interested in the job. I Interviewed with Regional director, interviewed with Area director and committee, then was offered the job.", "Interview Questions": "What is your relationship with Christ like?"}, {"date": "11 Apr 2016", "title": "Young Life Leader Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Young Life (San Francisco, CA) in Feb 2012", "Interview Descriptions": "It was rigorous. You have to be selected by the leadership team and by your previous Young Life Leader. They would ask you questions specifically about your faith and what it means to be a leader. Furthermore, they would bring up ideal qualifications concerning the position.", "Interview Questions": "Why do you want to be a Young Life Leader?"}, {"date": "9 Oct 2015", "title": "Area Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Young Life (Seattle, WA) in Mar 2011", "Interview Descriptions": "Interview process begins with a meeting with Regional Director or panel from Region. Interview process then moves to the specific area in a meeting with the local adult committee and other key stakeholders. Finally, the region along with the area together make the decisions on hiring.", "Interview Questions": "History of past leadership as a volunteer and what successes you saw."}, {"date": "3 Feb 2013", "title": "Volunteer Leader Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 5 weeks. I interviewed at Young Life (Rochester, NY) in Oct 2010", "Interview Descriptions": "Leadership training followed by certification and placement", "Interview Questions": "How is your personal relationship life?"}], [{"date": "8 May 2012", "title": "Staff Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "The process took 2 weeks. I interviewed at Young Life (Houston, TX) in Jan 2010", "Interview Descriptions": "3 interviews", "Interview Questions": "Tell me how you would share the gospel with kids."}]]