[[{"date": "1 Jul 2023", "title": "ER Technician Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at NorthBay Health", "Interview Descriptions": "A code happened in the background during the interview. I understand the environment and special circumstances but it was a major distraction to the interviewers and to myself. I felt like it was a disadvantage for me.", "Interview Questions": "What is your experience and why Northbay?"}, {"date": "15 Sept 2022", "title": "Accountant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at NorthBay Health", "Interview Descriptions": "Able to get in contact with HR in regards to any questions I had. Very helpful and was able to get through interview process faster than average in comparison to others", "Interview Questions": "What is my skill level of excel? How are you with strict deadlines?"}, {"date": "2 Aug 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at NorthBay Health", "Interview Descriptions": "Quick , average, talk about past experiences made conversations go smoothly. At least 5 questions.  Interview included a manager, lead, and a floor nurse. All were nice and trying to see if the candidates are a good fit.", "Interview Questions": "How do you manage stress?"}, {"date": "13 Apr 2022", "title": "PBX Operator/Communications Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at NorthBay Health", "Interview Descriptions": "Super cool. Relaxing. Just be yourself. Use the STAR method when being asked a question about a previous challenge experience. Smile and be very knowledgeable of the position. Do your research.", "Interview Questions": "Tell me about a challenge you had to face that was difficult and what steps did you take?"}, {"date": "7 Feb 2022", "title": "New Grad RN Residency Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at NorthBay Health (Fairfield, CA) in Jan 2022", "Interview Descriptions": "Phone interview, 150 behavioral questionnaire l, panel interview, references, and job offer. Whole process from application to accepting job took about 1 month.  The whole process was easy going and not stressful.", "Interview Questions": "You have a difficult patient, how would you handle it?"}, {"date": "11 Dec 2021", "title": "Certified Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at NorthBay Health (Fairfield, CA)", "Interview Descriptions": "The interview process was relatively quick, I received a call from the hiring supervisor and the next day I had my interview. The supervisor was very sweet, and they asked very thorough questions. First you go over the job description and outline, and then the interview proceeds.", "Interview Questions": "Why Northbay? Can you give us an example of a time were you had a difficult patient/coworker? Why are you leaving your current position? What would your current employer say about you?"}, {"date": "24 Nov 2021", "title": "Clinical Informatics Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at NorthBay Health", "Interview Descriptions": "First interview was with clinical informatics director then panel interview with the entire informatics department. I never got a call back or email back after panel interview. The process took a few weeks. The entire process was virtual.", "Interview Questions": "Average interview questions. Dug deep into EMR project experience."}, {"date": "21 Jan 2020", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at NorthBay Health (Fairfield, CA) in Jan 2020", "Interview Descriptions": "there were different stations and each member has a set number of interview questions.  questions ranked from why do you want to work here and how do you handle difficult situations.", "Interview Questions": "how would you respond to a difficult patient?"}, {"date": "11 Feb 2020", "title": "New Grad RN Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at NorthBay Health (Fairfield, CA) in Jan 2020", "Interview Descriptions": "Match day-like speed dating, only speed panel interviews. 2-3 interviewers at each table, 8 minutes at each table. Other candidates in the room, all answering questions at the same time. loud and somewhat chaotic, but fun.", "Interview Questions": "Tell me about a time when you had a difficult patient, how did you handle it, and what was the outcome"}, {"date": "21 Feb 2020", "title": "RN Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at NorthBay Health (Fairfield, CA) in Jan 2020", "Interview Descriptions": "First I had a phone interview, followed by a speed interview where 8 minutes was spent at each station, and last interview was a panel interview.  I had an overall positive experience even though I was not offered the job.", "Interview Questions": "Why did you choose nursing?  Why do you want to work here? "}], [{"date": "29 Jan 2020", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at NorthBay Health (Fairfield, CA) in Dec 2019", "Interview Descriptions": "Sit down interview with the manager, two-shift lead nurses, and a staff nurse.  Approximately 30 minutes in length.  Ther interviewers and I sat at a small round table and they fired off questions one at a time.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "8 Sept 2019", "title": "Pharmacy Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at NorthBay Health", "Interview Descriptions": "Interviewed individually by multiple members of staff. Met at separate building from hospital. Interview took roughly one hour. Staff asked basic interview questions about development and experience. Staff was very friendly. Took a brief tour of pharmacy afterwards.", "Interview Questions": "What is one of your weaknesses?"}, {"date": "18 May 2019", "title": "PFS Manager Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied through a recruiter. The process took 2 months. I interviewed at NorthBay Health (Fairfield, CA) in Apr 2019", "Interview Descriptions": "Easy and smooth. Not the typical interview. Very pleasant. Not intimidating . The director was very professional. The consultant was very professional as well. I appreciated the time and interest in me.", "Interview Questions": "How to face difficulties "}, {"date": "26 Jul 2018", "title": "Certified Medical Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at NorthBay Health", "Interview Descriptions": "Called me for a brief interview and 2 days later called to invite me for an in person interview. Interview went on for about 45 mins, had great information, was very nice!", "Interview Questions": "How I feel about working with multiple doctors at a time."}, {"date": "17 Jan 2019", "title": "Certified Nursing Assistant CNA Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at NorthBay Health (Vacaville, CA) in Jun 2017", "Interview Descriptions": "It was a panel of 6-7 people.  Two RNs and the rest at administration department heads.  One person did most of asking the question.  It was the female RN.  I THOUGHT I did pretty good, but it dawned on me after that I was not adept to answer the questions.  I was a rookie job applicant.  I need more practice.  Everyone was pleasant and kind.  They smiled and greeted me.  I brought my resume it was four pages long.  Later, I found out from colleagues and friends to give a one page resume.  Front to back if needed but one page looks better.    The hospital was clean and there were several people waiting for their turn.  I was nervous a bit but once I started talking I felt at ease.  But it was shocking to see so many people and watching your give your answers.  The group made me uneasy.  I felt like I had to perform a show or entertain them with my lame answers.  After the interview and I was driving home, I replayed the scenario and I basically bombed the interview.  I was so embarrassed.  But I’m gonna get up and be more polished with my answers next time, and really be an informed job seekers.\r\nMy advice to people is to come prepare to answer the questions, go to the library, research job interviews on the web that way you wouldn’t have a negative experience like I did,", "Interview Questions": " questions like would you discuss a patient with a team member during your lunch break in the cafeteria.  My answer should have been (after reading up more about HIPAA) that discussing patient case is a violation of the HIPAA privacy rules one because patient didn’t not give permission to talk about her, and two discussion in an unsecured location is not permitted since you can be overheard, and three does the person you are discussing then personal matter need to know this information and how much they should know. So say she’s a team member from another department then she doesn’t need to know.  \r\n"}, {"date": "27 Jan 2017", "title": "Clinical Nurse II Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at NorthBay Health in Jan 2017", "Interview Descriptions": "Received email from Nurse Manager to schedule interview on a day that was convenient for me.  On the day of the interview I immediately felt  welcome and at ease.  Still awaiting outcome of interview.  No matter what the results are, I can honestly say that the staff at NorthBay Healthcare do appear to truly enjoy their job which is a positive reflection of the leadership within their facility.", "Interview Questions": "Standard interview questions."}, {"date": "23 Apr 2016", "title": "Clinical Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at NorthBay Health in Feb 2016", "Interview Descriptions": "very streamlined- applied online in February, received a call 2weeks later, had an interview in a week, received the offer a week later. what follows may take longer or shorter depending on how soon you meet their requirements for reference check and physical. otherwise it was a smooth process! managers and HR personnel very accommodating with my requested start schedule.  very professional staff- not at all surprised with their magnet ststus😀", "Interview Questions": "why did you choose NORTHBAY to apply to and work for?"}, {"date": "20 Apr 2016", "title": "RN Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2+ months. I interviewed at NorthBay Health in Feb 2016", "Interview Descriptions": "Process: Applied online end of January, interviewed about five weeks later and offered a position a week later, second week of March. The whole process- reference check (they require 5, 2 of which must be supervisory- email is sent to each for \"anonymous\" feedback), background check, physical, labs- seemed to really lag, no definitive start dates which made it difficult to gauge when to give notice to my then employer and apartment manager. In the end, I just hoped that everything would come together to begin new employee orientation (begins first week of every month) in April. My final day at my old job came and went without a start date for NB, I was able to begin in April but it was cut pretty short. It's my understanding that one can be hired and begin working without first attending NEO but that is dependent on department approval. \r\n\r\nInterview: The manager was very nice, we started on time and mainly reviewed the type of depth of acute care experience I had, my education and the amount of orientation I would receive, the types of certifications and education that would be required to work on that unit. The rest of the interview was mostly behavioral questions and self-assessment (mainly focusing on strengths I felt I would bring to the unit/organization). I was taken on a brief tour of the unit and then also asked to apply for a number of other openings within that unit, which I did.", "Interview Questions": "What is my greatest strength as a nurse?"}, {"date": "6 Jun 2019", "title": "Patient Access Representative Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at NorthBay Health in Jan 2016", "Interview Descriptions": "Meet with several supervisor team members and reviewed job title, duties and description in detail. Requested job experience and relevance to position. Required stellar customer service and excellent communication skills.", "Interview Questions": "Do you have insurance Payor experience"}], [{"date": "29 Feb 2016", "title": "Coder Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 3 months. I interviewed at NorthBay Health (Fairfield, CA) in Jan 2016", "Interview Descriptions": "It was a panel interview made up the hiring manager, billing manager and two peer interviews. Be prepared to answer tons of questions about your experience. Also know that when interviewing be prepared to take a test that might be relevant to the position you are applying for.", "Interview Questions": "Please tell us about your work experience and how it would apply to the position you are applying for?"}, {"date": "6 Jun 2015", "title": "Lab Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at NorthBay Health (Fairfield, CA) in Apr 2015", "Interview Descriptions": "panel interview, they look for experience, will quiz your knowledge of phlebotomy, order of draw, you won't be poking anyone in this interview, they will ask you about your past work experiences, they already have your resume at hand, make sure that you focus on all the people in the panel interview, and to not leave an awkward silence in the process", "Interview Questions": "how many years of experience"}, {"date": "19 Feb 2014", "title": "Human Resources Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at NorthBay Health (Fairfield, CA) in Jun 2013", "Interview Descriptions": "An on-campus interview and an on-site interview with VP of HR, both very casual (but dress formal).", "Interview Questions": "Mostly just questions for culture-fit and relevant experiences. Nothing unexpected."}]]