[[{"date": "19 Nov 2020", "title": "Research Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at The Paulson Institute", "Interview Descriptions": "A 30 min conversational interview, mainly went through the resume. Always be well-prepared to talk about your thesis and working experiences. 30words 30words 30words 30words 30words 30words 30words 30words 30words 30words 30words.", "Interview Questions": "Can you please talk about your master's thesis?"}, {"date": "2 Nov 2020", "title": "Student Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at The Paulson Institute", "Interview Descriptions": "I was referred to the position through a friend. The supervisor called me for an interview after a day or two. The process wasn't difficult. The questions asked were rather generic, such as going through your resume and how you can help them with their research projects.", "Interview Questions": "Q: Walk me through your review"}, {"date": "17 Mar 2020", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at The Paulson Institute (Beijing, Beijing) in May 2018", "Interview Descriptions": "I applied online and have 2 phone interviews. The first is with the Green Finance Center director, questions including describe previous projects and clarify my skills. The second is with the head of the Office and is very short, just have a brief self-introduction and discuss a few details about intern works.", "Interview Questions": "Explain a previous project."}, {"date": "11 Dec 2017", "title": "Communications Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at The Paulson Institute (Chicago, IL) in Sept 2017", "Interview Descriptions": "After a series of 3 phone interviews, I was flown into Chicago for in-person interviews and it lasted all day. I met with every member of the staff with only short breaks in-between before meeting the VP. It's a team of about 6 people, and I found myself having to repeat the same things for each interview. I also wasn't told I'd be meeting every single person on the staff. It was an exhausting process and months later, I still haven't heard back even though I have followed-up. Really unprofessional, I took a day off from my current job to go across the country to be ghosted by a think tank.", "Interview Questions": "How would you increase the audience of our think tank and prevent loss of subscribers? "}], [], []]