[[{"date": "2 May 2022", "title": "Program Coordinator Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at North Carolina Central University (Durham, NC) in Jun 2021", "Interview Descriptions": "The interview was about an hour or so long with over 10 individuals on the panel. Out of those 10 five individuals asked the interview questions. They also requested that you complete a presentation explaining your philosophy on success. I felt as though one creating a presentation and being interviewed by 5 individuals and a 10 person panel for a job that only pays 18.00hr is ridiculous. Especially if you are an individual that suffers from anxiety this type of tactic is quite overwhelming.", "Interview Questions": "Tell us about yourself, why do you want to work at NCCU."}, {"date": "10 Nov 2022", "title": "Computer Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at North Carolina Central University (Durham, NC) in Jan 2020", "Interview Descriptions": "The interview process is a multi-stage process for hiring new employees. The interview process typically includes the following steps: writing a job description, posting a job, scheduling interviews, conducting preliminary interviews, conducting in-person interviews, following up with candidates and making a hire.", "Interview Questions": "What are your greatest strengths?"}, {"date": "16 Oct 2017", "title": "Adju Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at North Carolina Central University (Durham, NC) in Jul 2016", "Interview Descriptions": "A presentation was conducted for a graduate level course on my area of expertise. The professor and the chair of the department were present to hear my presentation and witness my interaction with the students. Afterwards, more of a conversation to ensure our values and practices were aligned.", "Interview Questions": "Have you ever considered being your experience and expertise from your career, into the classroom?"}, {"date": "5 Apr 2016", "title": "Institutional Advancement Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at North Carolina Central University (Durham, NC)", "Interview Descriptions": "Three interviews were conducted- a video conference interview, a panel interview and an interview with the Vice Chancellor. An application was done online and the following documents where required: references, resume and unofficial transcripts.", "Interview Questions": "Tell us about yourself and why you are interested in this position."}, {"date": "2 Jul 2014", "title": "Vice Chancellor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at North Carolina Central University", "Interview Descriptions": "The current leadership is bypassing hiring policy to place the individuals they want. This is not ethical or legal. I would apply elsewhere.  All senior positions applied for are filled by friends or close associates of the senior administration.", "Interview Questions": "None"}, {"date": "8 Dec 2017", "title": "SRSP Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at North Carolina Central University (Durham, NC) in Apr 2014", "Interview Descriptions": "Had to apply through high school online and answer some questions. Had to turn a recommendation in and it was pretty straight forward. Go to the website and sign up the application. It was a good learning experience.", "Interview Questions": "Mostly what do want to get out of the internship. "}, {"date": "7 Dec 2013", "title": "Technical Support Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at North Carolina Central University (Durham, NC) in Apr 2013", "Interview Descriptions": "Applied online and had a phone interview. Shortly after I had and in person interview and met with the leadership team for 45min. Questions were behavioral and technical.", "Interview Questions": "If you be any shape, what would you be?"}, {"date": "17 Feb 2016", "title": "Administrative Support Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at North Carolina Central University (Durham, NC) in Feb 2013", "Interview Descriptions": "Submitted application through NC state website in January.  Received an immediate email confirmation of application received from state website. About 3 weeks later, I received an email from administrative assistance of the University requesting my availability for an interview.  Interview was   set up the same day and scheduled the following week. The interview was scheduled around the middle of February. I interviewed with a panel of 5of the people I would directly support. Around a month later, mid-March I received a letter in the mail stating I got the job with the start date of first week of June.  The first day I had to go to the University's training which consisted of learning about the benefits and university policies.", "Interview Questions": "Tell me about yourself. What are you strengths and weaknesses? Why should we hire you for this position? How would you handle working with a difficult colleague or student?"}, {"date": "5 May 2016", "title": "Assistant Library Technician Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at North Carolina Central University (Durham, NC) in Jan 2012", "Interview Descriptions": "Talked with the supervisor and toured the library Talked with other workers talked with students talked with faculty talked with support staff talked with it office Talked with the supervisor and toured the library Talked with other workers talked with students talked with faculty talked with support staff talked with it office", "Interview Questions": "they asked about any library experience they asked about other jobs what was my strongest quality did I like working around libraries did I they asked about any library experience they asked about other jobs what was my strongest quality did I like working around libraries did I"}, {"date": "17 Nov 2015", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 5 days. I interviewed at North Carolina Central University (Durham, NC) in Aug 2011", "Interview Descriptions": "The interview was pretty straightforward. More of a conversational tone. It went well. The interview was relaxed. I knew that I would get the position because my grades were pretty good and I spoke to the  professor that I would be assisting before the interview. So she put in a good word for me:", "Interview Questions": "Describe how your background will enable you to complete the duties required of this position? The interviewer asked specific questions and made me feel at ease. I was confident in my answers and I could tell that the interviewer was pleased with my responses. The position required me to have good grades in the class that I would be tutoring. So I also discussed my studying techniques throughout the year:"}], [{"date": "21 Jul 2013", "title": "Controller Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at North Carolina Central University in May 2011", "Interview Descriptions": "Unorganized", "Interview Questions": "What is straight line department"}]]