[[{"date": "15 Jun 2021", "title": "Senior User Experience Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Focus on the Family", "Interview Descriptions": "I was asked quite a few questions about which I thought would convert better between a couple different options of webpages. Additionally, I was asked some open ended questions, trying to show how I would ascertain whether my assumptions were correct or incorrect.", "Interview Questions": "Which of these do you think would convert best?"}, {"date": "23 Apr 2020", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Focus on the Family", "Interview Descriptions": "Two interviews: Both virtual. One was with a member of HR and one was with the direct supervisor and team members. The first one was based off of certain values, while the other was referring to specific job duties.", "Interview Questions": "What are your views on Focus' five key pillars."}, {"date": "14 May 2021", "title": "Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Focus on the Family (San Antonio, TX) in Feb 2020", "Interview Descriptions": "Terrible interview process required multiple interviews and did not communicate results unless I constantly followed up.  Turns out they did the interview as a formality, because they already selected a candidate prior to the interview.", "Interview Questions": "Tell me about a time you had to make a difficult decision "}, {"date": "2 Jan 2020", "title": "Executive Producer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Focus on the Family (Colorado Springs, CO) in Aug 2019", "Interview Descriptions": "Initial call from HR staff with basic questions of compatibility, followed by multiple Zoom interviews with current staff and leadership.  Each interview was very relational in nature with an increasing amount of staff in each interview.  I feel it was fair and balanced and even though it did not result in a fit, we learned a lot about what we were looking for.", "Interview Questions": "What is your leadership style?"}, {"date": "29 Apr 2019", "title": "Internship Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Focus on the Family", "Interview Descriptions": "The interview process went quickly, it started with an online application, then a phone screening that was short and character based/personal questions and lastly a video interview which focused more on the skills of the position. They were great to work with.", "Interview Questions": "Why do you want this position?"}, {"date": "10 Oct 2016", "title": "Video Editor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Focus on the Family (New York, NY)", "Interview Descriptions": "I am not done with the process, but so far everyone I have come in contact with have been super nice and very professional. I am looking forward to finish the hiring process.", "Interview Questions": "They ask about my worldview."}, {"date": "6 Jun 2017", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Focus on the Family (Colorado Springs, CO) in Feb 2016", "Interview Descriptions": "It was a standard interview process.  I met with two ladies at the head of their department and they asked about my past experience, what I hoped to get out of the internship, and why I wanted to work at Focus.", "Interview Questions": "What was your past experience?"}, {"date": "4 Oct 2016", "title": "SEO Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Focus on the Family in Nov 2014", "Interview Descriptions": "I began filling out their Ministry Evaluation Questions and Statement of Faith Documents within three business days of receiving them. I waited for about two weeks to have my first phone interview because I was living out of state. I had my first and second interview within three days of each other. The questions were appropriate for the position - they pretty much stayed on point, which I like because I like focusing on the pain points of an organization. The interviewers were relaxed and asked questions about experience and how to go about certain situations.", "Interview Questions": "What would you do in this situation?"}, {"date": "8 May 2014", "title": "Ministry Strategy/Market Research Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Focus on the Family", "Interview Descriptions": "Great initial communication. Well understood directives. Cordial and professional. New employee packet filled with exceptional data about company, area, ministry, people, values, etc. Plenty of time allowed for questions and answers by all parties. great meet and greet for spouse and children.", "Interview Questions": "N/A"}, {"date": "12 Feb 2014", "title": "Marketing Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 months. I interviewed at Focus on the Family (Colorado Springs, CO)", "Interview Descriptions": "It was a long process but a good one.  I had three interviews that all went well and really helped me better understand the job and the people I would be working with.  It took about three months though.  At the time I thought it had to do with the fact that the people doing the hiring were having issues making a decision, but after being hired and then doing some hiring of my own later, I came to realize that it was more of an HR process issue.  They just were not as organized as they could have been.", "Interview Questions": "They really wanted to understand my current knowledge of client management and my organization skills.  The job I was interviewing for was a very detailed task orientated job and they wanted to make sure I had the skill set to meet those needs."}], [{"date": "8 Mar 2014", "title": "Director of E-Commerce Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1+ week. I interviewed at Focus on the Family (Colorado Springs, CO) in Feb 2014", "Interview Descriptions": "Submitted résumé through an employee of Focus on the Family. Received interview through networking. Was called by Human Resource who set up the interview. Interviewed by director of Marketing. Emailed by HR with result.", "Interview Questions": "None. Stock questions."}, {"date": "25 May 2013", "title": "Customer Service Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Focus on the Family", "Interview Descriptions": "took about three months. long.", "Interview Questions": "lots of question online"}, {"date": "15 Apr 2015", "title": "Guest Relations Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Focus on the Family (Colorado Springs, CO) in Jun 2012", "Interview Descriptions": "It was very positive, and professional yet relaxed. Two people interviewed me-- my (future) supervisor and the head of hospitality. It felt like we were just having a chat and they were getting to know me. A day or two (or maybe a week) later, I was called and offered the job. The only thing I had to still do was go to this doctor at the hospital to demonstrate lifting and bending so they could verify that I was physically able to do so (btw, there's not much lifting involved with this job-- only the occasional carrying a box of magazines to restock the front desk or something). It did not cost me anything to do this.", "Interview Questions": "They asked me something about what if a person came in to the Welcome Center and was irate and saying horrible angry things about Focus on the Family (because Focus's views are not always politically correct, so they do encounter some anger and threats. . . and even a gunman once)."}, {"date": "10 Jun 2015", "title": "Family Care Specialist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Focus on the Family (Colorado Springs, CO) in Apr 2011", "Interview Descriptions": "Took about 3 months. It was ok. Not very difficult nor was it easy. Just took so long the whole process. Need to be ready and able to make telemarketing calls to people to solicit money and all kind of donations.", "Interview Questions": "Write and stuff like that. Not too difficult Christian walk, would I feel comfortable asking for money up front.  Not to worry much about people, but ask for money; would I feed up to that?"}, {"date": "26 Oct 2013", "title": "Family Care Specialist Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Focus on the Family (Colorado Springs, CO) in Mar 2009", "Interview Descriptions": "Took about 3 months. Very long and tiring.", "Interview Questions": "Lots of writing. "}]]