[[{"date": "6 Oct 2022", "title": "Administrative Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at The Gideons International", "Interview Descriptions": "It was laid back. Started and ended with a prayer. The HR associate was very friendly and asked questions that were not difficult. The interview was more of conversational l.", "Interview Questions": "Your journey with Jesus. Questions based on jobs listed on resume."}, {"date": "18 Jan 2021", "title": "Project Coordinator, National Associations Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Gideons International in Dec 2020", "Interview Descriptions": "Wonderful interview process. It’s clear this company values personal connection and takes the time to ensure the job opening is a good fit for both parties. I was very impressed with the level of care, concern, and passion of the staff.", "Interview Questions": "Asked to share my personal testimony. "}, {"date": "22 Feb 2020", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at The Gideons International (Nashville, TN) in Jan 2020", "Interview Descriptions": "It started with an in-person HR screening, not by phone.  Second interview was a few weeks later, 2:1. Third interview the next week, 2:1. The communication through the process was excellent. Very friendly HR Team that made it a comfortable experience.", "Interview Questions": "Share your testimony."}, {"date": "27 Sept 2019", "title": "Receptionist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at The Gideons International (Nashville, TN) in Jul 2019", "Interview Descriptions": "The interview process was wonderful. HR was interested in me as a whole person and not just what was on paper. It was a long process though. I had a total of 4 in person interviews over the course of a month.", "Interview Questions": "They asked me to share my testimony of how I became a Christian. They asked about my prior jobs and experiences there. They asked a lot of questions about my character. They asked about my desires in a job."}, {"date": "2 Feb 2019", "title": "Membership Services Associate Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at The Gideons International (Nashville, TN)", "Interview Descriptions": "3 interview minimum with different levels of team members and intensity. There was talk of a 4th visit to observe.  I had to use a considerable amount of personal time to interview and then was left to wonder if I was going to receive an offer. When I reached out politely for a response, the response was a rejection.", "Interview Questions": "Share your salvation story "}, {"date": "22 May 2018", "title": "Manager, Donor Engagement Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at The Gideons International in May 2018", "Interview Descriptions": "I applied via their website.\nThe following day I received an email from HR asking me to come in for an interview.\nThe first interview was short, 30-40 minutes and was mostly reviewing my resume along with the needs of the position.\nThe second interview came about a week later with HR, the department head, and the outgoing Donor Engagement Manager. It was about an hour long. It ended abruptly as the department head just seemed to decide that he was done. A week later I received a form email stating they were moving forward with someone else.\n\nOverall it was an okay experience but there was a definite sense of condescension from the staff and especially from the department head.", "Interview Questions": "What is your personal testimony?"}, {"date": "17 May 2019", "title": "Membership Associate Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at The Gideons International (Nashville, TN) in May 2017", "Interview Descriptions": "Typically there are 3 interviews in total for successful candidates, beginning with the Human Resources recruiter, then the department manager, and then the HR director and department director.  Overall it was time consuming, 3 trips in all.  The first lasted about 30 minutes and the other 2 about an hour each.", "Interview Questions": "What does good customer service mean to you?"}, {"date": "10 Mar 2017", "title": "Membership Services Associate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at The Gideons International (Nashville, TN) in Feb 2017", "Interview Descriptions": "The interview process was tedious and exhausting.  There were three interviews with several groups of people at once, along with a six page application, along with a an online math/personalitySAT type assessment that took almost two hours to complete.  I will say that most of the interviewers were really nice but I think they were looking for perfect \"A1\" Christians.  They're not too keen on hiring anyone who doesn't regularly attend a church and most of the questions they asked were more about my personal beliefs than my skills and experience.  The interview process/questioning felt invasive and too personal in my opinion.  It was like trying to work for the CIA!", "Interview Questions": "When did you receive salvation?"}, {"date": "26 May 2015", "title": "USA Field Representative Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at The Gideons International (Nashville, TN) in May 2014", "Interview Descriptions": "There was a brief phone interview with HR who then recommended a Skype interview with the ones hiring for the position. It was casual and friendly. They made sure you knew what you were applying for and had a heart for the ministry.", "Interview Questions": "Why do you feel like this is the job you are being called to do?"}], [{"date": "18 Jan 2014", "title": "Membership Specialist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 6 months. I interviewed at The Gideons International (Nashville, TN) in Feb 2010", "Interview Descriptions": "Extremely detailed and exhausting, visits with every dept and manager and overwhelming data to be retained. It seemed that that was no learning curve, just all in. That did not change.\r\nThe amount and extent of travel was represented as being about half the time.\r\nMost employees understand that, you travel out some time on Sunday and get back on Thursday or Friday. The half the time count obviously is calculated on a 7 day week, not a 5 day work week. when you look at a 5 day work week, time out percentage goes way up more, toward 75%.", "Interview Questions": "Do you feel that you are called to be here?\r\nIs this your passion or something that fits within your established career?"}]]