[[{"date": "11 May 2023", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Fred Hutch Cancer Center", "Interview Descriptions": "Quite easy, first round was just a phone screening with a few questions. It was less than 30 mins and if you move on you attend an in person interview at Fred Hutch.", "Interview Questions": "Why are you interested in Fred Hutch?"}, {"date": "4 May 2023", "title": "Project Coordinator Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Fred Hutch Cancer Center (Seattle, WA)", "Interview Descriptions": "The phone interviewer clearly was unhappy with her job and it put a bad feeling in my mind about the role. They had a lot of long pauses and it was very awkward.", "Interview Questions": "Why are you leaving your current role?"}, {"date": "4 Apr 2023", "title": "Research Technician Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Fred Hutch Cancer Center (Seattle, WA)", "Interview Descriptions": "Two-part interview, initial HR screen to see if you qualify, interview with the Principle investigator to learn your interest, motivation, personality, etc. Interviews are virtual using Microsoft office (not zoom), or phone calls.", "Interview Questions": "Why are you leaving your current job?"}, {"date": "10 Mar 2023", "title": "Program Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Fred Hutch Cancer Center", "Interview Descriptions": "fast, easy and expedite. The people who interview me was nice and they explained all the job in a practical way. They show me the people who are part of the team and the facilities", "Interview Questions": "Do you live close by?"}, {"date": "21 Apr 2023", "title": "Project Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Fred Hutch Cancer Center (Seattle, WA) in Feb 2023", "Interview Descriptions": "Initial phone interview with a friendly recruiter where you walk through the job and your background. There is transparency with pay and flexibility up front which is helpful throughout the interview process", "Interview Questions": "What kind of management style do you respond best to?"}, {"date": "13 Jan 2023", "title": "Rehab RN Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Fred Hutch Cancer Center (Seattle, WA)", "Interview Descriptions": "Interviewer showed up late, asked a few pre written “ what would you do” questions, talked about herself , asked my background, talked about herself more, gave general information about the position which was different from the advertised position, talked about herself some more and the interview ended. Probably the most unprofessional interview I have ever had.", "Interview Questions": "Google “ interview questions Fred hutch”"}, {"date": "28 Feb 2023", "title": "Business Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Fred Hutch Cancer Center in Jan 2023", "Interview Descriptions": "I really believe in what the org does! I was so excited when I got a call and prepared so well. But I was extremely disappointed in how the recruiter spoke and how aloof and not excited she was. I was taken aback immediately and felt like she did not care at all. This is a two-way street and the person interviewing needs to really understand that and not make the interviewee feel weird", "Interview Questions": "Just general questions about previous experience; why am i interested in the role; how did I solve for analytic issue"}, {"date": "2 Mar 2023", "title": "DEI Educator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at Fred Hutch Cancer Center (Seattle, WA) in Jan 2023", "Interview Descriptions": "First, there was a recruiter screen then a one-on-one interview with a member of the team, and then a more broad panel interview. The team members I met with were nice, but I felt extremely disrespected throughout the process. The recruiter was rude during the screening call and called late. The process was so lengthy, I doubted their sincerity. Multiple panelists did not show up for the interview. After speaking several times, 6 months after initially applying, I received a generic HR rejection. I was also bothered by their unwillingness to state the salary range until I gave them a number frustrating considering their purported commitment to DEI.", "Interview Questions": "Why do you want to work with adult professionals?"}, {"date": "30 Nov 2022", "title": "Communications Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Fred Hutch Cancer Center", "Interview Descriptions": "I had a phone screen followed by two Zoom interviews. It was a pleasant experience. I ultimately did not get an offer but feel like I was able to have good conversations and learn more about the organization.", "Interview Questions": "What is your past experience working in DEI and why is it valuable"}, {"date": "16 Feb 2023", "title": "Patient Care Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Fred Hutch Cancer Center in Dec 2022", "Interview Descriptions": "Phone screening for first interview, second and third were done on tele conference. Second was done with the manager, then the third and final was done with other team members.", "Interview Questions": "How would you handle a frustrated patient?"}], [{"date": "17 Nov 2022", "title": "Advanced Practice Provider Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Fred Hutch Cancer Center", "Interview Descriptions": "There were multiple interviews. First a phone screen to review my clinical experience and overall interest in the role. Then there were multiple online interviews with different providers. Each intervenes covered covered different aspects including clinical experience, healthcare equity, diversity, research interests and example clinical scenarios", "Interview Questions": "What is your leadership experience"}, {"date": "12 Sept 2022", "title": "Recruiting Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Fred Hutch Cancer Center", "Interview Descriptions": "I had a phone interview with the Recruiter and it (seemingly) went really well. The call lasted 45 minutes instead of the scheduled 30 because the Recruiter said he was really enjoying getting to know me and wanted to talk further. At the end of the call he made it clear he wanted to move me along in the process and asked for my availability for the coming week. He said he would find a good time for me to meet with the hiring manager and then send me email confirmation of my next interview. I never heard from him again despite 2 attempts on my end to reach out and hear an update. Super unprofessional. ", "Interview Questions": "Walk me through your resume"}, {"date": "21 Oct 2022", "title": "Genomics Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Fred Hutch Cancer Center (Seattle, WA) in Sept 2022", "Interview Descriptions": "The whole process took 1 month. The first stage is a phone screen with the in-house recruiter (20 mins) . The next stage is the virtual interview with a panel ( hiring manager, Sr Director, admin manager, and bioinformatics lab director (1 hour). The final stage is 1-hour interview with peers. The whole process was seamless starting from communication, scheduling, and interviews. They are real professionals and know their field very well.", "Interview Questions": "Phone screen: 1. Why do you want to want here? Why this position? 2. How much experience do you have with X,Y,Z skills? General questions regarding experience without asking technical specifics. Interview with directors: 1.Tell us about yourself 2.Why do you have a gap in your career? 3. Tell us about QC of RNA/libraries 4. How do you manage multiple projects? 5. Did you get feedback from the bioinformatics team? 6. Did you have experience with X, Y, X? Tell us about that 7. What questions do you have? Final peer level interview: 1.How do you communicate with ppl with different personalities 2. What schedule do you prefer? 3. Tell us about X project 4. What equipment did you use? 5. QC questions 6. How do you stay on track ? 7. Tell us about yourself Advice: Just be yourself, give honest answers, and show your excitement and enthusiasm! Know all information relevant to your job description and do research even more about their work, equipment, and team members. Show that you really care."}, {"date": "30 Oct 2022", "title": "Healh Behavioral Counselor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Fred Hutch Cancer Center (Seattle, WA) in Sept 2022", "Interview Descriptions": "1.- After applying I received an email to have a phone call.\n2.- I talked the Sr recruiter about generalities about the job and the project.\n3.- After some days I received an email to set a video interviews with people that was working in the project.\n4.- I had a video-call with 6 people at least at the same time, they were reading multiple questions. During more than an hour. They said they will let me know their decision in 2 weeks.\n\n5.- It’s been more than a month. Fortunately I found a job that is serious.\n\nWhat shocked me more about this experience was:\n- Why companies ghost you in 2022?\n- Why to have unorganized interviews with multiple people at the same time?\n\nSeems like I am not the only one with this experience. Red flags!", "Interview Questions": "Why do you want to work here?"}, {"date": "19 Oct 2022", "title": "Research Technician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Fred Hutch Cancer Center (Seattle, WA) in Sept 2022", "Interview Descriptions": "Firstly they set up a screening call a few weeks after I first applied. After this I had a teams video call with the main researcher I'd be working under who gets a better sense of your qualifications and ambitions.", "Interview Questions": "What made you want to work at the Hutch?"}, {"date": "9 Sept 2022", "title": "Patient Care Coordinator Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Fred Hutch Cancer Center (Seattle, WA) in Aug 2022", "Interview Descriptions": "I had two 30 minute interviews via Teams video call.\n\nThe first one was with the manager who was so lovely and warm. She asked a few questions regarding work experience, my experience with diversity, how I heard about them, and why I was interested in the position.\n\nThe second one was with two members of the team. One nurse, and one patient care coordinator. In this one they asked questions about past work experience, how I would handle the work load, their daily tasks, why you're interested in the position.\nI would say come prepared with questions about the work place to try and get a better feel for what the position and daily routine would look like.\n\nOverall I really enjoyed the process and meeting with the team. They pay well for the position and seem to have a safe and supportive work environment. I would've accepted but I decided not to make the move from my current location.", "Interview Questions": "Tell me about a time you experienced diversity in the workplace or regular life?\n\nWhy SCCA (soon to be Fred Hutch)?\n\nDescribe your former role.\n\nWhat do you want to be doing in 5 years?"}, {"date": "24 Jul 2022", "title": "Scheduling Coordinator Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Fred Hutch Cancer Center", "Interview Descriptions": "The experience was overall very positive. The Interview was done via Zoom. It felt more like a genuine conversation than an interview. Quick and simple. Employer communicated well throughout the process.", "Interview Questions": "Please tell me about yourself."}, {"date": "7 Jun 2022", "title": "Patient Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Fred Hutch Cancer Center", "Interview Descriptions": "There were two interviews. The first interview was with HR and then the second interview was with the role's hiring manager and their manager.  Heard back two weeks later. Overall a smooth process.", "Interview Questions": "How do you prioritize your work?"}, {"date": "27 May 2022", "title": "Research Technician I Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Fred Hutch Cancer Center", "Interview Descriptions": "Was relatively long but all the people I met through the process were incredible! There is lots of amazing research occurring at Fred Hutch and there is excitement about it throughout the interview process.", "Interview Questions": "Why are you a good fit for this position?"}, {"date": "27 May 2022", "title": "Research Project Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Fred Hutch Cancer Center in Mar 2022", "Interview Descriptions": "really short, like 15 mins, two interviewers, fast pace. mainly talk about my resume. Only 2 rounds of interviews, the first one is a phone interview with the HR. It has been 2 months and I have not received any feedback. The applicant dashboard still says 'interview completed, under review. I don't know what takes them so long. Low work efficiency. I assume they found a better candidate and just forgot to update the dashboard.", "Interview Questions": "Talk about your resume. Talk about your education. What questions do you have for us."}], [{"date": "13 Apr 2023", "title": "Product Owner Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 3 weeks. I interviewed at Fred Hutch Cancer Center (Seattle, WA) in Mar 2022", "Interview Descriptions": "Up front with budget for the job, minimized the number of interviews but still made time for you to meet the team. Recruiter was great to work with and keep me updated frequently on process.", "Interview Questions": "N/A"}, {"date": "30 Jan 2022", "title": "Software Developer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 8 weeks. I interviewed at Fred Hutch Cancer Center (Seattle, WA)", "Interview Descriptions": "The interview process started with a phone screen which asked basic questions. Then, I received a take-home tech assessment to complete. After I submitted the tech assessment, I was then called for an interview that was supposed to go over my tech assessment. However, instead of going over my tech assessment, they instead asked me a bunch of stats questions (for a dev role???) and nothing relevant to my technical assessment at all. I was completely blindsided.", "Interview Questions": "\"Why do you want to work here?\". \"Tell me about yourself.\""}, {"date": "5 Mar 2022", "title": "Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Fred Hutch Cancer Center (Seattle, WA) in Feb 2022", "Interview Descriptions": "Two rounds of interviews/conversations, both were with a panel. The first included the hiring manager and two senior staff, the second included peers. \r\nThe group I was interviewing with functions somewhat as an autonomous start up within the organization, so the format was relatively informal/conversational.", "Interview Questions": "Why this role/why Fred Hutch"}, {"date": "11 Apr 2022", "title": "Research Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Fred Hutch Cancer Center in Feb 2022", "Interview Descriptions": "The interview process was a little longer than most places, however the recruiters were very friendly and easy to converse with.  The response is pretty fast when you reach out to them for follow up or any other questions you have with them.", "Interview Questions": "Why do you want this position? "}, {"date": "25 Nov 2022", "title": "Patient Navigator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Fred Hutch Cancer Center (Seattle, WA) in Jan 2022", "Interview Descriptions": "Quick and easy! Staff was very friendly and answered all questions thoroughly. Asked several questions about diversity. Appears to be a big focus with the company. Haven’t experienced that feeling in an interview but really appreciated it.", "Interview Questions": "What is diversity to you?"}, {"date": "17 Mar 2022", "title": "Event Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Fred Hutch Cancer Center in Dec 2021", "Interview Descriptions": "30-minute recruiter conversation through Teams.  The Recruiter was prompt and professional in communication, and easy to talk to in the interview.   Standard  \"walk me through your resume\" and answer questions conversation.", "Interview Questions": "Experience with Volunteer management\r\nWhat are you looking for in your next role"}, {"date": "12 Oct 2021", "title": "Bioinformatician Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Fred Hutch Cancer Center", "Interview Descriptions": "Started with a phone screen.  Was a casual process with a senior researcher and an HR member who was organizing the process.  Next became an interview via zoom with another researcher as well.", "Interview Questions": "Q: Are you experienced analyzing single cell RNA-sequencing?"}, {"date": "6 Aug 2021", "title": "Research Specialist Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Fred Hutch Cancer Center", "Interview Descriptions": "Just finished an interview with a recruiter who was very abrupt and cut me off multiple times. She would ask me to \"describe my experience\" and then rudely cut me off when I started detailing my prior responsibilities. She would also phrase questions confusingly and then get upset when I answered her questions.  The position was listed as remote but then she seemed to take issue that I wouldn't move to Washington. This was probably one of the worst phone screens that I have ever encountered. I believe someone who left a negative interview review here may have spoken to her as well...If I were offered a position here, I would decline because she was such a bad representation of the company. Really left a sour taste in my mouth. I almost want to email her back now and withdraw my application. Will update if I hear back.", "Interview Questions": "What are you looking for in your next position?"}, {"date": "16 Jun 2022", "title": "Marketing Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Fred Hutch Cancer Center (Seattle, WA) in Aug 2021", "Interview Descriptions": "First, I had two interviews with HR. After that, I interviewed with my manager and my Principal Investigator. Finally, I did a project to prove my skills. I was hired after that process.", "Interview Questions": "Basic questions and one project "}, {"date": "16 Apr 2022", "title": "Statistical Programmer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Fred Hutch Cancer Center (Seattle, WA) in Aug 2021", "Interview Descriptions": "interview with human resources, behavioral interview with hiring manager, coding sample. The interview process was spread out over a few months for no reason. I was ghosted by the recruiter at the end.", "Interview Questions": "What are important coding practices?"}], [{"date": "10 Jun 2021", "title": "Administrative Manager I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Fred Hutch Cancer Center (Seattle, WA) in Jun 2021", "Interview Descriptions": "Apply online May 7th and was emailed for a phone screen two weeks later with the recruiter. The hiring manager was out of vacation so was not able to do my second interview until the first week of June . I had my second interview on a Tuesday and was schedule for my final interview the very next day. I received my job offer later that afternoon. The whole process took about a month.", "Interview Questions": "Walk me through your resume. Why did you apply for this job?  How are you will learning new application? Are you committed to Diversity, Equity and Inclusion?"}, {"date": "11 Jun 2021", "title": "Research Administrator III Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Fred Hutch Cancer Center in Jun 2021", "Interview Descriptions": "The process moved quickly and the team was very engaged. I had a first round with the department director, supervisor and team member. The second interview round was with the remainder of the team members. I wish I would have been able to meet/interview with some Principal Investigators for the department to understand the working relationship.", "Interview Questions": "How do you handle multiple deadlines and projects?"}, {"date": "18 Jul 2021", "title": "Statistical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Fred Hutch Cancer Center in Jun 2021", "Interview Descriptions": "Had a 10 min phone screen with the recruiter who passed my info on to the rest of the department. Was then asked to attend an hour long zoom call giving me information about the role and answering any questions I had. Then, I was offered a final interview which was 3 hours long and I met with 4 different groups of people. The whole interview process was very seamless! Everyone was extremely nice and communicative. They always got back to me in a very timely manner and the interviews were very conversational.", "Interview Questions": "Why are you interested in this job?"}, {"date": "26 Mar 2021", "title": "Administrative Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at Fred Hutch Cancer Center", "Interview Descriptions": "The Recruiter T was not very nice. She didn’t seem like she understood the job, just read what was in the TOR.I have years of experience but she came across that I was just at the wrong place. Work on diversity. Managers need to hire direct instead of this. This is not a good system", "Interview Questions": "Tell me about yourself ?"}, {"date": "21 Sept 2021", "title": "Clinical Research Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Fred Hutch Cancer Center (Seattle, WA) in Apr 2021", "Interview Descriptions": "Pretty straight forward. During the interview I thought everything was going well. Although, I never heard back from anyone! A month later I looked on company website and saw that I was not selected.", "Interview Questions": "How do you deal with conflict"}, {"date": "20 Feb 2022", "title": "Software Development Engineer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Fred Hutch Cancer Center (Seattle, WA) in Apr 2021", "Interview Descriptions": "Entire process took two months, only because the PI of the lab being applied to had a large grant due. Applied online and then had a phone screen from the in-house recruiter. Then I had a take-home assessment before having a panel interview with four or five members of the lab. The last interview afterwards was a 1-on-1 with the PI. Interview with the PI was casual and just a chance for me to ask any questions to them.", "Interview Questions": "Why Fred Hutch? What has gotten you interested in software engineering in healthcare? Do you have experience with single cell RNA sequencing?"}, {"date": "15 Mar 2021", "title": "Bioinformatics Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Fred Hutch Cancer Center (Seattle, WA)", "Interview Descriptions": "Process consisted of an interview and coding tasks (in R, done begore the interview meeting). The interview was brief, and consisted mainly in reviewing the code tasks, where we discussed some of the challenges with each of the assignments, and how I approached each one of them.", "Interview Questions": "One of the coding tasks involved cleaning a very heterogeneous dataset, and I was asked how I approached this."}, {"date": "11 Jan 2023", "title": "Statistical Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Fred Hutch Cancer Center (Seattle, WA) in Mar 2021", "Interview Descriptions": "HR will screen you first, and then the hiring manager will interview you. If you are a good candidates, you will be introduced to the team, where they can ask you questions and you can ask them too", "Interview Questions": "What's your previous job experience?"}, {"date": "19 Jan 2021", "title": "Project Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Fred Hutch Cancer Center", "Interview Descriptions": "Had 2 phone screens and then was invited to meet a 5-person panel for an onsite interview. After the in-person interview, the HR recruiter never reached out to let me know the outcome. I sent multiple follow up emails and tried to call, but recruiter did not even bother responding.", "Interview Questions": "The usual behavioral interview questions."}, {"date": "29 Sept 2020", "title": "Care Team Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Fred Hutch Cancer Center", "Interview Descriptions": "Team interview style. Asked questions about experience, personality, goals and education and why I would be a good fit for the company. Interview lasted nearly 1 hour and was notified the following week.", "Interview Questions": "Where do you see yourself in 5 years from now?"}], [{"date": "6 Nov 2020", "title": "Financial Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Fred Hutch Cancer Center in Sept 2020", "Interview Descriptions": "Very standard and smooth process. Multiple rounds of interviews to meet a lot of people on the team. Here is the timeline:\n- 08/06/20: Applied online\n- 09/01/20: Initial phone screen with HR\n- 09/04/20: Virtual interview with hiring manager\n- 09/10/20: Virtual interview with two team members\n- 09/16/20: Virtual interview with two directors\n- 09/18/20: HR reached out for reference and background check\n- 09/23/20: Offer\nNegotiation went well. Salary is within my desired range.", "Interview Questions": "Questions are mostly standard behavior questions or \"describe a time when...\". Not difficult.\n- Why Fred Hutch?\n- What do you do to ensure a report's accuracy?\n- Name one of your hobbies that could help you succeed in this job.\n- What existing procedures do you think you can improve at Fred Hutch?"}, {"date": "23 Sept 2020", "title": "Data Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Fred Hutch Cancer Center (Seattle, WA) in Aug 2020", "Interview Descriptions": "Interviews spanned two months. The first was a phone screen. Two weeks later was the second; a one-on-one interview with the hiring manager. Two weeks after that was the third; a panel interview with the hiring managers and other Data Analysts. Two weeks after that I received the rejection email. \n\nI emailed the recruiter asking for feedback on where I could improve to have a better shot next time, but was ghosted. That is very unprofessional. If they are not able to answer the question, the least they can do is send an email saying they can't answer the question. Again, it's very unprofessional.", "Interview Questions": "Why do you want to work at FH?"}, {"date": "21 Oct 2021", "title": "Data Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Fred Hutch Cancer Center (Seattle, WA) in Aug 2020", "Interview Descriptions": "Interview was straight forward. Met with almost entire team I would be working with. They job and responsibilities were accurately laid out and interviewees made sure I was a good fit.", "Interview Questions": "How comfortable are you at handing different tasks and responsibilities that shift based on newly emerging needs at the clinic?"}, {"date": "28 Sept 2021", "title": "Postdoctoral Research Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Fred Hutch Cancer Center (Seattle, WA) in Aug 2020", "Interview Descriptions": "They are very friendly and makes you feel at home. It is three steps process. Phone-virtual and presentation to the research group. You need to know your field very well.", "Interview Questions": "Why do you want to join us?"}, {"date": "24 Sept 2020", "title": "Clinical Research Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Fred Hutch Cancer Center in Aug 2020", "Interview Descriptions": "A phone screen with a recruiter, then radio silence before scheduling the interview with the actual team. \r\n\r\nHere's what happened: During the phone screen, I provided my salary range to which the recruiter said was on the higher end of what they were willing to pay. Right then and there I told the recruiter this position may not be the best fit. He agreed, then said they would keep my resume on file in case something better opened up within the department. Days later I received an email from the recruiter saying he talked to the team and they wanted to interview me anyway. I then provided my availability and was ghosted. This is extremely unprofessional and left a bad impression.", "Interview Questions": "Why do you want to leave your current position?\r\nWhere do you see yourself in 5 years?"}, {"date": "13 Jul 2020", "title": "Lab Data Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Fred Hutch Cancer Center (Seattle, WA) in Jun 2020", "Interview Descriptions": "I had a phone screen with a recruiter, which went very well and I was moved on to the 1:1 interview stage. The 1:1 interview was with the hiring manager, and she asked me questions about my experience first, then I asked her questions. After she answered my questions, she simply said, \"Ok, well it was great talking to you. Have a nice day\" and then the call was over. I wasn't selected, which is completely fine, but I never got an email response saying I wasn't selected, which was incredibly unprofessional and disrespectful. I had to check back in to find out that I wasn't selected, and it left a bad taste in my mouth with the whole experience.", "Interview Questions": "What is your experience in resolving data discrepancies"}, {"date": "21 Sept 2021", "title": "Clinical Data Coordinator II Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Fred Hutch Cancer Center (Seattle, WA) in Jun 2020", "Interview Descriptions": "Interviews consisted of phone screen, interview with manager, interview with team, then another interview with manager, so a phone screen and 3 interviews. The interviews were not difficult, all behavioral stuff.", "Interview Questions": "Tell me about a time you had to coordinate a group of people"}, {"date": "8 Jul 2020", "title": "Research Technician I Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Fred Hutch Cancer Center (Seattle, WA) in Jun 2020", "Interview Descriptions": "I received a word from the P.I. of the lab asking for a time to Zoom. On the initial Zoom, she asked a couple of behavioral questions and then some technical questions. I was thinking the first interview was going to be more just giving information on the position.", "Interview Questions": "Questions about OD and doubling time"}, {"date": "28 May 2020", "title": "Clinical Trials Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 3 weeks. I interviewed at Fred Hutch Cancer Center (Seattle, WA) in May 2020", "Interview Descriptions": "The process was seamless from the beginning to the end (when I received an offer!).  Communication was clear, scheduling interview times was easy, and the staff were incredibly kind and professional.", "Interview Questions": "What I needed from them in order to be a successful employee"}, {"date": "17 Feb 2020", "title": "Post Doc Fellow Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Fred Hutch Cancer Center (Paris)", "Interview Descriptions": "the scientific interviewer was very pleasant and we further discussed  about my phd project, and some of the main topics related the offers, an further explained me the human ressources procedure, i had appreciated the professional way he interviewed me", "Interview Questions": "why do you want to work here "}], [{"date": "24 Feb 2020", "title": "Bioinformatics Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Fred Hutch Cancer Center in Feb 2020", "Interview Descriptions": "I had a video interview with the PI. It was mostly basic questions about my experience. The PI also discussed the job role he was interviewing for. It was really easy.", "Interview Questions": "What do you know about single cell RNA-seq?"}, {"date": "19 Feb 2020", "title": "Program Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Fred Hutch Cancer Center (Seattle, WA) in Feb 2020", "Interview Descriptions": "I applied for the position and within a week I was contacted for a phone interview. The format was conversational. Sue, the recruiter for the position, described the role and its context within the organization to set the tone for the call. She was very knowledgable about the department/position. Sue was a wonderful ambassador for the Hutch as she set a positive and friendly tone for the call. Her energy seems to get the best out of applicants. Through our conversation, we determined that the position wasn't the right fit at this time- but nonetheless I left the interaction happier than when it had started!", "Interview Questions": "If you had to describe what you're looking for in your position with 3 words- what would they be? "}, {"date": "29 Jan 2020", "title": "Research Administrator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Fred Hutch Cancer Center (Seattle, WA) in Jan 2020", "Interview Descriptions": "I applied in December\r\nPhone screening with HR\r\nInterview 1: Team of three I would be directly working with\r\nInterview 2: Director and another person in the department\r\n\r\nThe screening and first interview were very positive and great communication \r\n2nd round is where it began to go off the rails. I believe that once the director was involved\r\nit became challenging, she came across as a micro-manager and asked a few of the same questions twice. While I want to rate the first two phases of the process very positive,  Interview round 2 was less than positive. I was expected to 'expand' on two answers I had already discussed. This individual muddied the water and I would give it a big thumbs down from that point on.  It became apparent to me I was just one of the herd they were considering, the leadership did not want someone with more than 3 years of experience, my guess is to mold the employee. Salary was low for my experience in Clinical Trial Research, however was willing to overlook that for the opportunity of working for this team. It is just unfortunate, there always seems to be \"that\" person who may be able provide relevance but makes everyone jump through an extra hoop to accomplish their goal.", "Interview Questions": "How is your communication style. I was asked this twice during the interview. Either the director was caught up in other thoughts or not paying attention because I was asked to email further discussion on this topic. I work at one of the top hospitals in the United States with some of the most world renowned physicians that Fred Hutch is a SubAward to us. This should not be reinventing the wheel of describing \"communication\""}, {"date": "19 Oct 2019", "title": "Postdoctoral Research Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Fred Hutch Cancer Center", "Interview Descriptions": "Very Easy and friendly process, usually three rounds of interview. The First is with scientific recruiter, then followed by virtual and on site interview with the specific PI you are applying for.", "Interview Questions": "Research focused, plans for future career "}, {"date": "26 Jan 2021", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Fred Hutch Cancer Center (Seattle, WA) in Oct 2019", "Interview Descriptions": "Two rounds.  First, interviewed by another research assistant in the lab. Secondly,  interviewed by the leader of the lab. \nAfter the second round, they said they will contact me shortly to discuss the position in detail but they didn't.", "Interview Questions": "Related to working experiences on the resume"}, {"date": "20 Sept 2019", "title": "Post Doctoral Research Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Fred Hutch Cancer Center", "Interview Descriptions": "I applied online and received a 30-minute phone interview in about 1 week. I received an in-person interview ~1 after that. Excellent email communication from HR  over the interview process.", "Interview Questions": "1. Tell me about yourself.\r\n2. Questions about research skills."}, {"date": "25 Sept 2020", "title": "Staff Accountant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Fred Hutch Cancer Center (Seattle, WA) in Sept 2019", "Interview Descriptions": "it was friendly and quick normal interview. Although nothing hard, meet with all c level and personal. almost 5 people in an interview. questions are normal nothing hard easy. they asked the same question over and over again and no test any whatsoever that is related to the job.", "Interview Questions": "tell me about you\nwhy do you want to work here"}, {"date": "1 Sept 2019", "title": "Quality Assurance Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Fred Hutch Cancer Center (Seattle, WA) in Aug 2019", "Interview Descriptions": "Had a brief initial interview with HR. Which went well. Asked general questions regarding my resume and experience working as an quality personnel. In person interview is scheduled for next week. So if anyone has any suggestions, feel free to comment below.", "Interview Questions": "Explain a time where your work had an positive impact."}, {"date": "10 Oct 2020", "title": "Undergraduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Fred Hutch Cancer Center (Seattle, WA) in Aug 2019", "Interview Descriptions": "Submitted an application on the company job website and the next day got a call from HR saying the hiring manager wanted to interview me. I had previously done two internship interviews with Fred Hutch so there was no need for another screening.\r\nA week later, went into the interview (30 minutes) and was asked about my resume and why I wanted the job.  I didn't get the job at first because I was going to be out of town for two weeks and they needed someone ASAP but after my vacation, the hiring manager contacted me saying they wanted to bring me on the team.", "Interview Questions": "Why do you want this position?\r\nWhat are your goals after graduation?\r\nHow can this position help you achieve your career goals?"}, {"date": "10 Jul 2019", "title": "Biostatistician Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Fred Hutch Cancer Center", "Interview Descriptions": "1 round: interview with HR and submit writing sample and code sample\r\n2 round: interview with hiring manager, asked about past experience and current project\r\n3 round: panel interview with 3 groups of people", "Interview Questions": "categorical analysis"}], [{"date": "16 Jan 2021", "title": "Postdoctoral Fellow Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Fred Hutch Cancer Center in Jun 2019", "Interview Descriptions": "I had a Skype call with the HR who asked me mostly general questions about my background and expectations. It was very one sided (the recruiter asking and me answering) which I guess is to be expected when speaking to someone quite far from the position I'm applying to.", "Interview Questions": "What do you look for in a manager\nWhat is your experience with the R programming language"}, {"date": "27 Jun 2019", "title": "Research Technician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Fred Hutch Cancer Center in Jun 2019", "Interview Descriptions": "10- 15 minute phone screen with a recruiter (mostly asked about my own experiences and why I want to work there with an additional 10- 15 minutes to ask your own questions), additional skype interview with PI if selected", "Interview Questions": "What are you hoping to get out of this job with respect to your future goals?"}, {"date": "9 May 2019", "title": "Q/A Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Fred Hutch Cancer Center", "Interview Descriptions": "Three phone interviews and one in person team interview. The in person interview was a giant mess, people on the panel were scrolling through their phones while I was talking. It was extremely unprofessional and I have never seen that before in a job interview.\r\n\r\nI ended up withdrawing my application.", "Interview Questions": "What your experience and background are like"}, {"date": "3 May 2019", "title": "Clinical Data Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Fred Hutch Cancer Center", "Interview Descriptions": "I applied online. Have a phone-interview with HR and after 2 weeks have interview with manager, then another 3 weeks after interview with other team members. The overall experiences were good. The manager and team members are very nice to communicate, there is no intimidating questions and we really have a good talk.", "Interview Questions": "Past experiences with database used for clinical data collecting"}, {"date": "26 Oct 2022", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Fred Hutch Cancer Center (Seattle, WA) in May 2019", "Interview Descriptions": "The whole interview process is quite great. They have a phone interview first, and they ask you about your experience with the lab that you applied to. It requires two recommendation letters. Later, they schedule you for the in-person interview with the PI. They show you the lab and ask questions about your abilities, your career goals, and so on. Will get the answer on email later whether you pass or not.", "Interview Questions": "What is your career goal? What are your plans for the future? Do you plan to pursue grad school?"}, {"date": "17 May 2019", "title": "Research Technician Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Fred Hutch Cancer Center in May 2019", "Interview Descriptions": "Applied online via the Fred Hutch job board. After 2-3 weeks, a recruiter reached out to set up a virtual interview with some members of the team. I received an update on my application shortly after my interview (approximately 24 hours later).", "Interview Questions": "Why did you apply for this position?"}, {"date": "3 Jul 2020", "title": "Intern - Hourly Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Fred Hutch Cancer Center (Seattle, WA) in May 2019", "Interview Descriptions": "It was  one and half hour video interview .  My experience was really good.  The questions were semi formal  and easy to answer.  It was basically about my past work experience and school projects.", "Interview Questions": "Tell me about yourself?"}, {"date": "16 Apr 2019", "title": "Administrative Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Fred Hutch Cancer Center (Seattle, WA) in Apr 2019", "Interview Descriptions": "The interview process was pretty simple. I applied on 3/27 and was contacted by a recruiter on 4/3 for a phone interview. In person interview was scheduled on 4/4 for an interview date of  4/9. The in person interview was a \"loop\" interview that was 2 hours long and consisted of two panel interviews. I took about a week for the recruiter to contact me about the hiring manager's decision. So it all happened in about a two week period.", "Interview Questions": "What interested you in this position?"}, {"date": "24 Apr 2019", "title": "Research Technician Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Fred Hutch Cancer Center (Seattle, WA) in Mar 2019", "Interview Descriptions": "Difficult process, I was required to be asked to answer a ton of question, and I wasn't properly prepared for such a difficult interview, I needed to exercise my proof of having research experience.", "Interview Questions": "What can you bring to the table? "}, {"date": "21 Nov 2022", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Fred Hutch Cancer Center (Seattle, WA) in Jan 2019", "Interview Descriptions": "Four interviews and screening. The four interviews were back to back for about an hour. During The screening no response to my answers. Which I thought was interesting but they were super nice.", "Interview Questions": "Basic: Like what is your leadership style?"}], [{"date": "12 Jan 2022", "title": "Certified Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Fred Hutch Cancer Center (Seattle, WA) in Jan 2019", "Interview Descriptions": "Interview process was well put together and I met the team as well as did a clinic walk through. I was interviewed by 3 staff members who took turns interviewing me.", "Interview Questions": "Tell us about yourself and work experience"}, {"date": "18 Jan 2021", "title": "Lab Aide Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Fred Hutch Cancer Center (Seattle, WA) in Jan 2019", "Interview Descriptions": "You sit in the lobby and wait for your interviewer to take you into the lab or surrounding meeting areas. Depending on the lab, you might have to interview with only one person or multiple. The interview is very short, about 15 minutes.", "Interview Questions": "Have you ever been in a difficult situation and how did you deal with it?"}, {"date": "12 Jan 2019", "title": "Senior Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Fred Hutch Cancer Center in Dec 2018", "Interview Descriptions": "I applied online and was quickly contacted by email for a phone screen. I was ready to explain my qualifications, but the recruiter quickly leapt to the two \"preferred\" qualification requests and forced me to admit I didn't have that degree (PhD for administrative position!!!) or that experience. Then she focused on the more administrative tasks and acted like I should be disqualified because I haven't been an executive assistant before, then managed to suggest I should apply for an EA role instead, which was insulting based on my background (probably not something that happens to male applicants). I was so dumbfounded and offended by the interaction I decided I would not like to move forward (and it certainly didn't sound like she was going to recommend that), but when I was contacted again by her to set up a call with the Hiring Manager, I decided it was worth talking to her to at least explain how terrible their recruiter is. We ended up having a lovely phone call that elicited much more insight into the position and office it manages, so I decided to avoid bringing up their terrible recruiter. Flash forward to a month later, the terrible recruiter sends me a rejection email, where she spells my name wrong and makes egregious grammatical errors. I responded that she should look into hiring a copy editor, which she then responded that she had to send a bunch of these emails and I should basically give her credit for at least responding and letting me know that I was not selected.\r\n\r\nGood grief Fred Hutch. Your recruiters are literally scaring people away instead of attracting them to work for you. Seriously reconsider your investment!", "Interview Questions": "Do you currently schedule for someone? "}, {"date": "11 Jan 2019", "title": "Lab Technician II Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Fred Hutch Cancer Center in Dec 2018", "Interview Descriptions": "I was emailed a day after submitting my application to set up a 15-20 minute phone interview with the recruiter. The phone interview covered lots of general questions that you would expect and included salary expectations. I received a follow up pretty immediately to set up a 1.5 hour in person interview. I was an out of state applicant, so I set up a virtual interview instead. It was scheduled for 45 minutes with the supervisor, followed by 45 minutes with the other lab techs. Neither interview actually took that long (~30 minutes each) and the tech asked me a lot more questions than the supervisor did but both were nice and the supervisor was very laid back.", "Interview Questions": "What type of data do you collect in your current position? \r\n\r\nWhat do you look for in a job?"}, {"date": "20 Nov 2018", "title": "Systems Engineer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Fred Hutch Cancer Center (Seattle, WA)", "Interview Descriptions": "Applied online, responding to a job posting. Initially contacted by an HR person. Later a phone conversation with a technical person. Then on-site interviews with five technical persons lasting ~3 hours. Nice people; pleasant interviews. I thought all went well. Then silence. Not \"yes\"; not \"no\"; not \"go f--- yourself\". Quite disappointing to hear nothing at all. Seems rather rude.", "Interview Questions": "There was nothing out of the ordinary."}, {"date": "17 Oct 2018", "title": "Research Technician Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Fred Hutch Cancer Center", "Interview Descriptions": "Phone interview with a HR person, asking general questions. Then got an invitation to the in person group interview with PI and team (5 people), asking more of technical questions", "Interview Questions": "Something about time management"}, {"date": "6 Aug 2018", "title": "Administrative Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Fred Hutch Cancer Center", "Interview Descriptions": "Interview process was very quick. From application submission to job offer was about 2 weeks. This made me wonder how desperate they were to fill the position, so it made me a little weary, but it has worked out. Great people to work with!", "Interview Questions": "How do you feel about working in a very high touch environment?"}, {"date": "5 Jun 2021", "title": "Communications Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at Fred Hutch Cancer Center (Seattle, WA) in Jun 2018", "Interview Descriptions": "After talking to a recruiter, I sat in a room with three unenthusiastic people asking rote questions and barely listening to my answers. Also, they refused to converse beyond the questions.", "Interview Questions": "What's an accomplishment you're proud of?"}, {"date": "28 Jan 2019", "title": "Data Coordinator II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Fred Hutch Cancer Center (Seattle, WA) in Jun 2018", "Interview Descriptions": "I got a call about 3 days after my applying for the position to schedule a phone interview. I got the call right on time and it lasted for about 30 minutes where the recruiter got to know me and what my past experience was like as well as why I wanted to work the position I applied for. They informed me the rate at which the manager would be looking to fill the position and how long I should be waiting prior to calling back if I havent heard anything. I received an email 2 days later requesting an in person interview. Because I was living in California at the time, they offered me a time to call through Skype to interview with the manager. I got off the interview with them and received a call about 10 minutes later with a job offer. They also worked with me to manage my move from California to Washington.", "Interview Questions": "How well are you able to manage working on a particular task and moving between more time sensitive tasks and going back to the initial task? "}, {"date": "21 Jun 2018", "title": "Program Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Fred Hutch Cancer Center (Seattle, WA) in Jun 2018", "Interview Descriptions": "Met one-on-one with the lead nurse for a particular subset of the clinical research division. I had one strike against me immediately, because the recruiter told me to meet her at the wrong building, so she had to walk across the campus to come get me. Was brought into her office, and we spoke privately for about 1.5 hours. She started by going through my resume and asking questions about each job (what I liked/didn't like about each) -- all but my current job were from 4+ years ago -- first thing I wasn't expecting. I wasn't sure if she was going to ever ask me to \"tell about yourself\" or ask the usual behavioral questions, so I tried to use this opportunity to segue into those, hoping I wouldn't step on the toes of future questions and use up all my material. Strangely nearly all of the non-resume guided questions after that were about managerial style: what I like and don't like in a manager, times when managers did things I appreciated or didn't -- second thing I wasn't expecting. I got the sense that she would be working very closely with the person in this role and wanted to make sure they were a good fit for her, not necessarily for the job or organization. I've never had an interview like that before, it was like speed dating or something. She did ask the typical strengths/weaknesses questions, which provided some respite. The rest of our meeting was her describing their work and filling me in on the nitty gritty of the job (sick days, etc), which I took to be a good sign. She told me she would be taking next steps by contacting my references.", "Interview Questions": "Are you more introverted or extroverted/do you prefer to work as a team or independently?"}], [{"date": "26 Jul 2020", "title": "Program Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Fred Hutch Cancer Center (Seattle, WA) in Apr 2018", "Interview Descriptions": "Initial phone screening performed by HR representative. Invited back to campus for 2 separate panel interviews. First interview was with direct team and second interview included other team members and Director of team. Needed to perform a \"Skills test\" reviewing materials as requested.", "Interview Questions": "What interests you about the position you applied for?"}, {"date": "1 Aug 2019", "title": "Animal Care Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Fred Hutch Cancer Center (Seattle, WA) in Jan 2018", "Interview Descriptions": "Had a phone interview with HR. In person interview a few weeks later with the manager. It was really relaxed and easy to talk about my experience and plans for the future.", "Interview Questions": "What’s your plan for the future?"}, {"date": "15 Feb 2018", "title": "Human Resources Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Fred Hutch Cancer Center (Seattle, WA) in Nov 2017", "Interview Descriptions": "I was contacted within a day of submitting my application and interviewed shortly thereafter. At the conclusion of the panel  interview another person came in to met with me alone, informing me that the usual phone screening had been skipped because of my qualifications and fit for the job.  She explained the urgency of filling the position and proceeded to ask me my salary requirements and other expectations.  She pressed me repeatedly for any requirement I might have, and implied all could be addressed, then she asked me if I had any concerns about the job.  She said she would get back to me in two days.  I never heard from  her or anyone else from Fred Hutch again.  Two months later my status was changed to \"not selected\" on their on line system.  There was no rejection letter or any other direct communication.", "Interview Questions": "Questions were basic--how do I prioritize work demands, what is my leadership style, what is a typical day in my current job..."}, {"date": "8 Feb 2018", "title": "Postdoctoral Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Fred Hutch Cancer Center (Seattle, WA) in Sept 2017", "Interview Descriptions": "the phone and Skype interview set up very quick. Interviewers were very friendly and knowledgeable. You got  the hiring decision quick after the interview. HR is very professional, so they will give you good advice for next steps to fulfill with the document requirement. They also are knowledgeable about visa or work permission for an international student", "Interview Questions": "what is your experience working with claims data?\r\n"}, {"date": "1 Apr 2018", "title": "Systems Engineer Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Fred Hutch Cancer Center (Seattle, WA) in Sept 2017", "Interview Descriptions": "My experience with this organization was not pleasant. The initial phone screen was robotic, scripted, and bureaucratic.\r\n\r\nThe technical phone screen wasn't very positive either. The engineer who I spoke with seemed disinterested, tired, and a tad bit disrespectful.\r\n\r\nWhen the day for the on-site interview happened, I showed up and was told, five minutes before the start, that they needed to delay by an hour. When the interview finally did happen, they were not prepared. The person who was supposed to interview me was apparently not available, and his replacement's behavior was inappropriately rude. Zero smiles. Bad attitude throughout, and nothing but psycho analysis questions that he had surely scraped off of google ten minutes before. No technical questions were asked.\r\n\r\nWhen the department manager showed up (15 minutes late), she decided that the interview should be about her talking for 20 minutes straight about herself and how she managed the department.\r\n\r\nI should have walked out on these people. This company has some toxic work place problems.", "Interview Questions": "\"How do you handle conflict with others in the workplace?\""}, {"date": "16 May 2018", "title": "Information Specialist I Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Fred Hutch Cancer Center (Seattle, WA) in Aug 2017", "Interview Descriptions": "The first step of the interview process included a brief screening call which followed up with an email to schedule a first round interview. The first round interview lasted two hours, with a panel of three professionals from the department, and included a brief role play.", "Interview Questions": "What is an example of a time you had to balance conflicting values in the workspace?"}, {"date": "12 Sept 2017", "title": "Research Associate I Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Fred Hutch Cancer Center (Seattle, WA) in Aug 2017", "Interview Descriptions": "Had brief phone interview regarding position, a week later had interview with PI. PI contacted references later that week. Overall a very relaxed interview process. PI was very nice and did not try to create an intimidating environment. Overall recruiting staff were pretty responsive with keeping me updated.", "Interview Questions": "Where do you see your career in 5 years?"}, {"date": "25 Sept 2017", "title": "Scheduling Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Fred Hutch Cancer Center in Jul 2017", "Interview Descriptions": "Applied through the Fred Hutch Careers site, received a phone call about a week later offering me a phone interview. I sat down with my phone and interview materials on the agreed upon date and time, and the recruiter called me almost 20 minutes late. They did not apologize for or even acknowledge this inconvenience, and proceeded with the interview as if nothing unusual had occurred.\r\n\r\nThe actual phone interview itself was fine, as far as I could tell - we discussed job duties and salary, and the recruiter told me that I would hear back from them again by the end of the week (this call took place on a Tuesday). The following week, they still hadn't, so I sent a followup email to check in. No response. A week after that I sent another - still no response. Three weeks after the phone interview, I reached out to the person who had scheduled the phone interview (independently from the recruiter who I had actually spoken with), asking them if there had been any updates and explaining the situation. Still nothing.\r\n\r\nIt has now been more than two months, and I have not received a response or any sort of communication from anyone at Fred Hutch since my phone interview. I feel that this is an extremely unprofessional way to treat prospective hires, and judging by some of the other reviews on here it looks like I'm not the only one. I was never told that I wasn't selected for the position, although I'm not sure how they can expect someone to remain enthusiastic about working for the company after being left in silence and flat-out ignored for several months. Very disappointing, as I had high hopes for Fred Hutch as a company and prospective employer.", "Interview Questions": "Describe yourself in three words."}, {"date": "28 Jun 2017", "title": "Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Fred Hutch Cancer Center", "Interview Descriptions": "I was emailed to have a phone interview with them and confirmed and they blew me off.  I waited for their call for the interview at the interview time and then called them when there was no call and left a message.  I even tried reaching out to them by email and did not even receive a response back.", "Interview Questions": "N/A"}, {"date": "26 Apr 2017", "title": "Medical Writer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Fred Hutch Cancer Center", "Interview Descriptions": "Interviewed by phone (lasted approximately 30 mins). Followed by an in-person interview three weeks later. Following this in-person interview, I was asked to return for a second in-person interview, this time with a group. Weeks passed and I had no response from anyone to  tell me that I was not accepted for the position.", "Interview Questions": "Why do you want to work here? What skills do you have which make you suited to the position?"}], [{"date": "5 Jul 2017", "title": "Executive Recruiter Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Fred Hutch Cancer Center in Apr 2017", "Interview Descriptions": "Submitted resume, received a phone call a week later from the Recruiting Leader for Fred Hutch.  Seemed like a good connection and she told me that she would definitely call me in a week or so.  I never heard from her even after 2 calls placed to follow up.  I also found it unprofessional that she shared with me that this is the worst recruiting team she has led and she is trying to overhaul the group.", "Interview Questions": "Why are you looking?  Have you led teams in the past?  How big was the group?"}, {"date": "25 May 2017", "title": "Research Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Fred Hutch Cancer Center in Apr 2017", "Interview Descriptions": "I applied online, and got a call back within a day. I scheduled a phone interview the following day. After the phone interview they called back to schedule a skype interview with two of the post docs. It was pretty laid back and a great experience", "Interview Questions": "Tell me about your research experience"}, {"date": "5 May 2017", "title": "Contractor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Fred Hutch Cancer Center (Seattle, WA) in Apr 2017", "Interview Descriptions": "Phone screen was standard and seemed to go fine. Asking the recruiter questions afterwards resulted in a very hostile response. I expect to be treated professionally with basic respect, and did not see this from the recruiter. Based on my interactions I will not consider Fred Hutch again.", "Interview Questions": "Why did you apply?"}, {"date": "21 Mar 2017", "title": "Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Fred Hutch Cancer Center", "Interview Descriptions": "I was contacted by a recruiter for a phone interview.  A few days later, the department reached out for   an in-person interview.  Each interview was fairly standard.  There weren't any surprising questions.", "Interview Questions": "Why are you interested in this role?"}, {"date": "22 Feb 2017", "title": "Project Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Fred Hutch Cancer Center", "Interview Descriptions": "Extremely unprofessional HR team. I received an email from a recruiting coordinator a couple weeks after applying online. I interviewed with a recruiter via phone and was told I would hear back the next week. I didn't hear back for 3 weeks and sent follow up emails to both the recruiting coordinator and the recruiter and got no response until almost a month after the phone interview. They gave the company a bad reputation through this experience.", "Interview Questions": "What experience do you have that makes you a good fit for this role?"}, {"date": "14 Feb 2017", "title": "Office Worker III Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. I interviewed at Fred Hutch Cancer Center", "Interview Descriptions": "I was actually hired through a temp agency, so there was never an interview for this particular position.  My supervisor just hired me on the spot after seeing my resume.", "Interview Questions": "N/A"}, {"date": "27 Feb 2017", "title": "Research Technician I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 5 days. I interviewed at Fred Hutch Cancer Center (Seattle, WA) in Feb 2017", "Interview Descriptions": "I interviewed with two people from the lab which I applied to. The interviewers were very laid back and kind. They asked general questions about me and my experience, nothing technical regarding lab techniques or equipment. The interview lasted about 30 minutes.", "Interview Questions": "Tell us about what you studied in university and your previous lab experience?"}, {"date": "27 Feb 2017", "title": "Multiple Professional Roles Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Fred Hutch Cancer Center (Seattle, WA) in Jan 2017", "Interview Descriptions": "The FHCRC hiring process is one of the worst I have encountered. \r\n\r\nRecruiters are not familiar with the subject matter for which they are recruiting, online tracking process is not accurate, there are significant delays (months!) in follow up and the HR staff has treated myself and other highly qualified professional candidates I've referred with very little respect. \r\n\r\nNote to HR Leadership: I assume your recruiting philosophy is that you want highly qualified candidates who feel like you value them, and vice versa. I have a successful, professional track record and stellar references. I am passionate about cancer research and treatment. At each juncture, I was treated like FHCRC was 'doing me a favor' by interviewing me for a job there - and this was for multiple roles.", "Interview Questions": "What healthcare experience do you have that is most applicable to this role? "}, {"date": "19 Sept 2017", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Fred Hutch Cancer Center (Seattle, WA) in Jan 2017", "Interview Descriptions": "Series of questions asked over the phone, then hired. Related primarily to background in field of study and education. Generic, aside from content questions. They didn't seem to do a great job of advertising this position, so I am not sure how many people they interviewed. I have, however, a great deal of experience with the content required.", "Interview Questions": "How do you go about finding scientific information to use as a foundation for your curricula? "}, {"date": "27 Dec 2019", "title": "Research Technician II Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Fred Hutch Cancer Center (Seattle, WA) in Jan 2017", "Interview Descriptions": "Was Contacted by the PI, asked a few questions about my expectations and then was given on overview of the lab missions. In retrospect, the lab was desperate for people and it was more of the PI selling me the position rather then me applying for it.", "Interview Questions": "How much do you know about what we study?"}], [{"date": "19 Feb 2017", "title": "Research Technician II Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Fred Hutch Cancer Center (Seattle, WA) in Jan 2017", "Interview Descriptions": "One phone interview with a recruiter talking about what I'm interested in and my qualifications. Then a face to face interview with the head of the lab talking about job specifics and how I would fit into the role.", "Interview Questions": "Tell me about your past research experience."}, {"date": "3 Oct 2017", "title": "Executive Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Fred Hutch Cancer Center (Seattle, WA) in Dec 2016", "Interview Descriptions": "The process is like any normail process, interviewed by 4 managers that the position will be supporting. The questions weren’t difficult, average to figure out if you can do the job.", "Interview Questions": "tell me about your experience supporting executives and multiple managers ?"}, {"date": "3 Jan 2017", "title": "Project Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Fred Hutch Cancer Center (Seattle, WA) in Dec 2016", "Interview Descriptions": "Had a fantastic initial interview with a SR Recruiter. She was very laid back, yet professional and facilitated a productive and engaging conversation. Recruiter gave a lot of leeway to speak, and did a good job listening to answers. She also took the time to answer a lot of the questions that I had as well", "Interview Questions": "Describe how your previous work experience has prepared you to be successful with this job"}, {"date": "15 Feb 2017", "title": "Research Technician Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Fred Hutch Cancer Center (Seattle, WA) in Dec 2016", "Interview Descriptions": "Had a 30 min phone interview with a recruiter. Received the interview request email 1-2 weeks after the phone interview. Had a group interview (with the lab members). Many asked the same questions.", "Interview Questions": "Previous work experience"}, {"date": "27 Jan 2017", "title": "Statistical Research Associate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Fred Hutch Cancer Center in Nov 2016", "Interview Descriptions": "Interviewed for two positions at the same time. The process started in late October, the interviews took place during November, and I still haven't heard back two months later, despite being told they would decide the week after I interviewed. I never received any notification of rejection, and my profile was never updated in their system. I followed up with two different recruiters whom I had been in touch with and heard nothing back - hence the negative review.\r\n\r\nBesides that, the interviews themselves were fine. I first had a phone screen interview with a recruiter, then three Skype interviews - one with the managers and then another with each of the two teams I'd be working with. One of the teams only ever asked about experience, and the other team gave me a sample problem to discuss on the spot. The sample problem was pretty basic, but I was caught off guard and whiffed anyway, which was embarrassing.", "Interview Questions": "Asked questions about experience and showed me a graph of a small sample of trial data to analyze."}, {"date": "20 Feb 2017", "title": "SAS Statistical Programmer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Fred Hutch Cancer Center (Seattle, WA) in Oct 2016", "Interview Descriptions": "My first contact was a phone screen with an HR recruiter which was a very pleasant conversation about my background, why I was interested in working at Fred Hutch, and questions about the projects I had listed on my resume. They did not ask any unexpected questions and were very kind and open about what to expect next. Following this, I scheduled a Skype interview about 1.5 weeks after this and talked to the hiring manager, and 2 potential team members. They asked me several questions about projects on my resume again, but in more detail, and asked me many \"what would I do in this situation\" questions. Although I was not selected for the role, it was a fun and positive experience.", "Interview Questions": "Describe a conflict you had with a teammate and how did you work to resolve it?"}, {"date": "8 Nov 2017", "title": "Research Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Fred Hutch Cancer Center (Seattle, WA) in Oct 2016", "Interview Descriptions": "HR people are quite friendly and get the interview processes done pretty quickly. Overall, the process is well structured and isn't too complicated or time-consuming that it doesn't require us to wait for too long until we receive the final result.", "Interview Questions": "What makes you stand out for this position?"}, {"date": "12 Jan 2017", "title": "Vice President Communications Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 months. I interviewed at Fred Hutch Cancer Center (Seattle, WA) in Oct 2016", "Interview Descriptions": "Very organized and professional. After an initial phone screen spent a full day onsite in interviews. Cleary finding a cultural fit was a priority and spoke with over 10 people in different departments over the day.\r\n\r\nCollaboration, intellectual curiosity, strong media skills, measured risk taking, emotional intelligence appeared to be high values from the conversation.", "Interview Questions": "Describe you management style and success in building and managing teams\r\nExamples of media relations success\r\nExamples of managing board relationships"}, {"date": "8 Oct 2016", "title": "Lab Aide Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Fred Hutch Cancer Center (Seattle, WA) in Oct 2016", "Interview Descriptions": "Applied online. Got an email to schedule phone interview 1 week after applied. Got another email to schedule in person interview with the team. Everyone was friendly and relaxed. Basic questions about education history and experience. The team explained the job duties and what they're doing.  Got the job offer the next day.", "Interview Questions": "What do you expect from this job?\r\nWhat did you study at school that makes you want to work at this lab?"}, {"date": "30 Sept 2016", "title": "Research Technician I Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Fred Hutch Cancer Center (Seattle, WA) in Sept 2016", "Interview Descriptions": "There was no phone interview but they requested 1-3 letters of recommendation. Then they contacted me again for a two hour in-person interview. First had a 1:1 interview with a PI and then met other lab members. Some had more questions for me than others. They were all pretty nice.", "Interview Questions": "-Stock solution dilution problems\r\n-Why do you want to work in research?/what is your goal as a research technician?\r\n-Are you planning on going to graduate school?\r\n-Other very typical questions"}], [{"date": "1 Mar 2017", "title": "Project Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Fred Hutch Cancer Center (Seattle, WA) in Aug 2016", "Interview Descriptions": "They conducted one phone interview and one in person with a panel.  They were both straightforward and relevant to the position.  They also tested for basic writing and proofreading skills.", "Interview Questions": "How do you handle failure?"}, {"date": "18 Aug 2016", "title": "Business Analyst II Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Fred Hutch Cancer Center in Jul 2016", "Interview Descriptions": "I applied for the position starting of June and received an email from the recruiter end of June. I was first called for Business process analyst then the recruiter thought I was a good match for project manager then after one day he sent me another job description for business analyst. I interviewed for business analyst in July by a panel of interviewers and everyone asking me similar questions. It was not organized and post the interview I waited for one week and thought of emailing the HR how ever the HR never responded and I never heard from them for more then a month now. Very unprofessional and inexperienced staff", "Interview Questions": "Why do you want to join us?\nHave you worked on any project which went paperless ?\nHow do you collect data for analysis ?\nHave you done any coding ? Although the job description does not mention anything about coding"}, {"date": "3 Jun 2016", "title": "Administrative Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at Fred Hutch Cancer Center", "Interview Descriptions": "I can't go into too much detail, but I will say that HR seems to be a little....disorganized. I experienced this and several people I know have, too. They made some crucial errors during the hiring process. The dept I am working in was absolutely great with the interviews, it was just the HR dept that was lacking. I recommend figuring out an inside contact to communicate with during the process, otherwise I am not sure your resume will even get to the right person. I hope HR can find more staff to help out! They seem understaffed.", "Interview Questions": "Basic questions about how you handled a particular situation."}, {"date": "7 Jul 2016", "title": "Research Technician I Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Fred Hutch Cancer Center (Seattle, WA) in Jun 2016", "Interview Descriptions": "Interviewer(s), depending on who was present, ask about your current research/experience and talk about the lab in general. If a particular skill/technique was referenced, they will ask questions about it to check for understanding of what it entails. They usually also give a presentation of the workspace and the staff you would be working with to get a sense of what you would be doing.", "Interview Questions": "What would you do to troubleshoot a PCR if it showed no results.\r\nWhat kind of biological questions do you look at in your current work?"}, {"date": "12 Jul 2016", "title": "Administrative Assistant II Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Fred Hutch Cancer Center (Seattle, WA) in Jun 2016", "Interview Descriptions": "Pretty basic, They call you to do a basic phone screen and interview, then a few days later they call to set up an in person interview. From submitting application the process maybe takes 3 weeks max. The interviewers were very friendly. And i would say the best part is that they update your status on line pretty fast.So before they even email you about your status its up online.", "Interview Questions": "Most were behavior questions, like give a time when. Or how would you handle this situation."}, {"date": "5 May 2016", "title": "Program Assistant II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Fred Hutch Cancer Center (Seattle, WA)", "Interview Descriptions": "It was an easy interview process that involved a loop panel. It involved speaking to people in the lab and mgrs along with directors. They were easy to talk to and friendly.", "Interview Questions": "Why do you want to work here\r\nBehavioral questions"}, {"date": "19 May 2016", "title": "Animal Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Fred Hutch Cancer Center (Seattle, WA) in May 2016", "Interview Descriptions": "I received a phone interview 1 week after I applied for the job, and scheduled for an in-person interview 1 week after that. The hiring manager was really nice to talk to and told me she will be contacting my references. She only contacted 2 of my references 2 days after the interview. I got an offer 2 weeks after the interview.", "Interview Questions": "Briefly introduce yourself.\r\nHave you had a conflict with your boss, and how did solve it?\r\nWhat are your strength and weakness?\r\nHave you changed mice cages before?"}, {"date": "21 Jun 2016", "title": "Research Technician I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Fred Hutch Cancer Center in Mar 2016", "Interview Descriptions": "The HR phone interviewer was around twenty minutes late, but it went well. They asked very basic questions, some about skills that ended up not being relevant to either the position or my experience.\nThe in person interview with the lab went well, as I met nearly everyone. Many of the same questions were asked by each person. \nI had previously applied to over 100 positions here, and never had an interview. This was the first of any interview I had where they actually had me demonstrate my lab skills instead of only asking me about them. As a result, I was offered the job three business days later.", "Interview Questions": "How confident are you with sterile technique?"}, {"date": "13 Aug 2018", "title": "Research Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Fred Hutch Cancer Center (Seattle, WA) in Mar 2016", "Interview Descriptions": "Very casual interview. We talked about the research project and areas that I could potentially focus on during an internship. I was told at the end of the interview that I was welcome to join the team. \r\n\r\nAfter being offered the research internship communicated with HR about applying for a visa.", "Interview Questions": "What do you wish to contribute to our research project?"}, {"date": "18 Aug 2016", "title": "Statistical Research Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Fred Hutch Cancer Center (Seattle, WA) in Mar 2016", "Interview Descriptions": "I applied online; got a phone call 3 weeks latter, and schedule a one-day on-site interview. Spoke with several people about their research and work. They asked me my experience.", "Interview Questions": "Asked about my past experience."}], [{"date": "16 Apr 2016", "title": "Intern Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Fred Hutch Cancer Center (Seattle, WA) in Feb 2016", "Interview Descriptions": "applied by online on their site; called, interviewed by three individuals within a week of app. interviews with candidates were back-to-back. job seemed interesting; amazing opportunity to contribute to cancer research. superior asked most questions and was very knowledgeable and friendly; did not develop rapport with other two. it was obvious that interview did not go well.", "Interview Questions": "What can you contribute to us?"}, {"date": "26 Dec 2015", "title": "Postdoctoral Research Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Fred Hutch Cancer Center (Seattle, WA)", "Interview Descriptions": "Sent CV. Was contacted for telephone interview first. After passing phone interview gave references and list of publications, had a meeting with the PI. On a second interview with the PI I was offered the job.", "Interview Questions": "What would be challenging of the job"}, {"date": "25 Apr 2017", "title": "Benefactor Relations Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Fred Hutch Cancer Center (Seattle, WA) in Nov 2015", "Interview Descriptions": "I first had a phone screen with HR. I was then given some written exercises to complete. After that I was invited for an onsite interview. For the onsite interview, a group of about 5 individuals, including some outside of the immediate team this position worked with, questioned me for roughly a hour. It was about 4 weeks before I found out whether I had gotten the job.", "Interview Questions": "How would you approach a nobel laureate to give them tips about giving a presentation to an audience of donors (people who may not have any scientific background)?"}, {"date": "3 Sept 2015", "title": "Grants and Contract Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 6 days. I interviewed at Fred Hutch Cancer Center (Seattle, WA) in Sept 2015", "Interview Descriptions": "I applied online and was contacted by a recruiter the following day and then scheduled for an in person with three people. The recruiter said that I would have a modeling test if I was called back for a 2nd interview. I arrived for the 1st interview and was put into a room to write answers to their interview questions and do modeling test all on excel. No one talked to me until after and then made me feel stupid for not performing well on the modeling test (which I was not prepared to take since it was supposed to happen on the 2nd interview). The whole thing threw me...", "Interview Questions": "Why should we hire you over someone else?"}, {"date": "9 Jul 2015", "title": "Program Manager Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Fred Hutch Cancer Center (Seattle, WA) in Jun 2015", "Interview Descriptions": "Phonecall from HR recruiter 1 week after I applied, with basic interview questions and my availability for in person interviews.  Two weeks later, I had an in person interview with the Program Director and another PM.  They gave an overview of their program for about 15 minutes, and then had questions for about   30 minutes.  Overall they were polite, but didn't seem to be interested in my responses to their questions.  Seemed like they were trying to scare me with how complicated the position was (I've been in Clinical Research for over 15 years), and it seems like an odd approach at an interview.", "Interview Questions": "What is your management style?"}, {"date": "26 Feb 2016", "title": "Cancer Information Specialist Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Fred Hutch Cancer Center (Seattle, WA) in May 2015", "Interview Descriptions": "1st interview was a phone interview with HR.\r\n2nd interview was in-person, the interviewers do mock phone calls about cancer information you are given all the information you need on a print out. You read through it and repeat it essentially word for word.\r\nHired by phone via HR.", "Interview Questions": "How do you work on a team? What do you like about this position? Have you been impacted by cancer in some way?"}, {"date": "11 May 2015", "title": "Quality Assurance Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Fred Hutch Cancer Center (Seattle, WA) in Apr 2015", "Interview Descriptions": "Five weeks after I applied online, I received an email invitation for a phone interview.  I interviewed with a person from HR and he asked me really basic questions about how my qualifications fit the requirements listed in the job description.  He sounded really positive and told me he would call me in 3 days to set up another interview with the department heads.  I never heard from him again.  I emailed him once, maybe a week later, just to check in and see if he wanted to set something up.  Nothing.", "Interview Questions": "Tell me about your quality assurance experience.  "}, {"date": "26 Mar 2015", "title": "Staff Scientist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Fred Hutch Cancer Center", "Interview Descriptions": "phone interview first and then on-site interview. Overall it's not very hard, but still need to prepare it. should be very familier to what you have written in the cv.", "Interview Questions": "some technical questions and R coding questions"}, {"date": "1 Jan 2018", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Fred Hutch Cancer Center (Seattle, WA) in Mar 2015", "Interview Descriptions": "Very informal. They ask about your ability to work in teams, what you hope to do in the future, etc. Just be yourself. They really won't ask for anything more than that.", "Interview Questions": "What do you do if your lab partner is struggling"}, {"date": "30 Jun 2016", "title": "Postdoctoral Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Fred Hutch Cancer Center (Seattle, WA) in Feb 2015", "Interview Descriptions": "Nice and easy. I contacted the PI directly, sent my CV, cover letter, references. Got an answer in 1-2 days and scheduled a skype interview (I lived in Europe at that time). It took ~20 min with standard questions. In the 2 days I was informed that a position is mine and was redirected to immigration specialist.", "Interview Questions": "What are your long-term career plans?"}], [{"date": "23 Mar 2015", "title": "Research Technician I Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Fred Hutch Cancer Center (Seattle, WA) in Jan 2015", "Interview Descriptions": "I applied online through their website. One of their recruiters contacted me by phone about a week later. She asked me a few questions about my background and told me someone else would call me to set up an interview time. The other recruiter called me the next day to schedule my interview.\r\n\r\nAt Fred Hutch, I met with the PI of the lab. He asked me a few questions about my background, then showed me around the lab and introduced me to everyone working there. The whole thing took less than an hour.", "Interview Questions": "Tell me about yourself."}, {"date": "13 Jul 2015", "title": "Statistical Research Associate I Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Fred Hutch Cancer Center (Seattle, WA) in Jan 2015", "Interview Descriptions": "Met with lead scientist, then small groups of the rest of then lab starting with upper management down to research associates I would be closely working with. I was from out of town, so I met with everyone in one day, which was nice instead of having to drive back and forth multiple times. Usually there is a longer interview process and you don;t have to meet everyone in one day.", "Interview Questions": "They asked mostly about the research work I had done and my experiences."}, {"date": "6 Dec 2014", "title": "Administration Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Fred Hutch Cancer Center", "Interview Descriptions": "The process started with a phone screening from a recruiter. An in-person interview followed a week later. The interview was supposed to be an hour long and divided into two sections: 30 minutes with someone in HR and 30 minutes with two other staff members. The first part of the interview was normal; however, the second portion was a bizarre experience. One of the interviewers completely dominated conversation, talked about herself incessantly and neglected to ask me any questions. Her colleague was obviously embarrassed and tried to subtly redirect the interview back to me. After that was unsuccessful, she actually checked out of the interview \"because she had to go home\". Long story short, I was there for another hour and a half, subjected to this woman's stories which ran the gamut of political views on reproductive rights to inappropriate office gossip. I was uncomfortable but didn't know how to end the madness without jeopardizing my chances. The interview ended but not before she revealed another very personal tidbit about herself. I walked back to my car in complete disbelief. Unfortunately, a month has gone by and I never heard from them but my application is still in consideration, according to the website.", "Interview Questions": "Why should we hire you?"}, {"date": "23 Sept 2015", "title": "Lab Technician I Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Fred Hutch Cancer Center in Dec 2014", "Interview Descriptions": "I applied online and about 2 weeks later I received a phone call from HR to schedule an in-person interview. There was no phone screening beforehand. The whole interview process took a little over an hour. I first spoke with the head of the lab who described the work they do and then afterwards got a lab tour and was interviewed further by two lab technicians. The experience was relaxing, I did not feel intimidated and everyone I spoke with was very friendly.", "Interview Questions": "Tell me more about your work experience"}, {"date": "25 Aug 2017", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Fred Hutch Cancer Center (Seattle, WA) in Nov 2014", "Interview Descriptions": "Short, and to the point. Asked about past experience, coursework, career goals, and why I was particularly interested in this division. They did ask a few questions that were directly related to their work so I was glad that I had taken the time to read the most recent articles they had published.", "Interview Questions": "How has your previous coursework prepared you for this position?"}, {"date": "4 Mar 2016", "title": "Research Technician I Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Fred Hutch Cancer Center (Seattle, WA) in Nov 2014", "Interview Descriptions": "Met with post-doctoral fellow and several other lab members, who were all welcoming and informing. Great experience but did not choose to work here due to a better salary offered elsewhere.", "Interview Questions": "Which chemokines are upregulated in individuals who produce broadly-neutralizing antibodies for HIV?"}, {"date": "27 Jul 2014", "title": "Animal Tech Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Fred Hutch Cancer Center", "Interview Descriptions": "They called about a month after application. Interview with HR lasted about an hour. I then scheduled interview with Dept Head about a week later. Started work a couple days after that. Everything seemed organized and that if they call you for an interview you will get hired unless you mess up terribly.", "Interview Questions": "Are you ok euthanizing animals?"}, {"date": "27 Jun 2014", "title": "Recruiter Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Fred Hutch Cancer Center", "Interview Descriptions": "Phone Interview > Team Interview > Direct Supervisor Interview.  The phone interview was 30-45 minutes.  The interviewers reviewed my work history and background as well as gave me a realistic job preview.  The team interview was a lot of fun because it gave both me and the group I would be working with a chance to meet and interact with each other before I became a member of the organization.  The interview with the direct supervisor followed and it was a continuation of the group interview but a bit more in depth.", "Interview Questions": "(Just one example).  Tell me about a hiring challenge that you faced and how you overcame it.  What did you learn that you could apply in the future?"}, {"date": "18 Oct 2016", "title": "Sdfd Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 5 days. I interviewed at Fred Hutch Cancer Center (Seattle, WA) in Mar 2014", "Interview Descriptions": "Hiring was done after a phone screen and then a full day interview with the team , supervisor, other clinicians. Lunch was provided and the people were friendly and will give you overview of how it is to work in that organization", "Interview Questions": "how can you relate your experience with the job"}, {"date": "19 Feb 2014", "title": "Lab Aide Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Fred Hutch Cancer Center (Seattle, WA)", "Interview Descriptions": "Applied online and did not hear back for a few weeks. Followed up by e-mail to lab coordinator. Scheduled phone interview a month after applying online. Asked basic questions: \"post-graduation plans? Long-term goals? Why our lab?\" Was then asked to come in for an in-person interview. Was greeted by the coordinator who interviewed me for half an hour then interviewed by two other lab technicians who are currently working in the lab. Very friendly and inviting. Asked lots of questions regarding scenarios that can occur in the lab, calculating concentrations, etc.", "Interview Questions": "Calculating molarity or specific lab preparation questions: \"If you have a stock concentration of X M...etc.\""}], [{"date": "3 Apr 2014", "title": "Web Developer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "The process took 2+ months. I interviewed at Fred Hutch Cancer Center in Feb 2014", "Interview Descriptions": "Like others here have said, it took the better part of two months to hear back. So long that I'd written them off and for the most part had forgotten I'd even applied.\r\n\r\nPhone interview: Recruiter seemed to enjoy spending more time talking about a lot of hot air than actually listening. When asked about tangible benefits like paid holidays he said, \"We offer more paid holidays than banks! Look on a calendar and if it's a holiday we probably observe it!\" Yet he didn't answer the question.\r\n\r\nWhen asked about paid vacation he dodged again, and in a round about way said two weeks, following that up with a lengthy statement about how you really could take as much time as you wanted regardless what the actual vacation policy is, that it's really no problem. Umm... Yeah... Sure...\r\n\r\nThe salary range was abysmally low. I understand that working for 1) big orgs, and 2) big non-profit orgs tends to skew the salary on the low end, but you could make more money slinging burgers at a fast food joint.\r\n\r\nThe recruiter told me during the interview that they were also hiring a Senior Dev position that would manage the group (the worst of both worlds, IMO). It was a positin I was unaware of and when I asked if he could tell me more about it as it fit my skill set better, he said I should go onto their site and look it up and get back to him because he didn't have it in front of him. I replied via email with some general questions about salary, expectations, time spent managing vs time spent coding, etc., and didn't hear anything back. After 10 days I sent a polite follow up email, more out of annoyance than anything else, and the recruiter replied a week after that to apologize that he'd been out of town (odd, as there were no OOO auto-replies) and that I should call him and he'd be happy to answer my questions. Again, dodging the questions I put to him. \r\n\r\nFor all the great work FHCRC does, they certainly make a sleazy impression on the recruiting end. Between an insultingly low salary and a recruiter that came across more like a used car salesman, I decided not to pursue things further. Thanks, no thanks.", "Interview Questions": "Really, the most difficult thing was getting through the phoner without wanting to shout at the recruiter to stop talking about himself."}, {"date": "1 Jun 2018", "title": "Data Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 3 months. I interviewed at Fred Hutch Cancer Center in Jan 2014", "Interview Descriptions": "There were two phone screens and two in-person interviews. At first HR interviewed me to place me for positions. Then, the hiring manager interviewed me. Then, the team interviewed me.", "Interview Questions": "Explain data cleaning you've done in the past, especially in regards to merging datasets\r\n\r\nExplain how you deal with difficult people"}, {"date": "14 May 2017", "title": "Administration Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Fred Hutch Cancer Center (Seattle, WA) in Nov 2013", "Interview Descriptions": "Received a phone call from hiring manager for a preview screening. Called in for interview with two people and was a very fair and thorough interview.  Called again by another supervisor for final interview and offer. .", "Interview Questions": "What is one weakness?"}, {"date": "16 Aug 2013", "title": "Research Technician Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Fred Hutch Cancer Center", "Interview Descriptions": "Submit application through companies website.  interview process is mainly completed by department manager and can also have a follow up interview with other management. Working interview is sometimes performed , given applicant to have a feeling of environment and other workers.  Informed of higher over phone or in person and then a facility tour and then set with HR for all the required paper work", "Interview Questions": "How long I plan on being with the company"}, {"date": "13 Feb 2013", "title": "Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Fred Hutch Cancer Center", "Interview Descriptions": "I applied online and was contacted by Human Resources by phone for an interview. I interviewed with the team and then was called back a second time for an interview with their supervisor. Human Resources offered the job and, after some negotiation, I accepted.\r\nThe process went smoothly and communication was clear.", "Interview Questions": "None."}, {"date": "2 Apr 2017", "title": "Lab Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Fred Hutch Cancer Center (Seattle, WA) in Jan 2013", "Interview Descriptions": "Brief, not many questions, most of the time was spent talking about scope of work to be done.  This was at a very busy time in research (which is actually not the case now)", "Interview Questions": "specific instrument and assay questions"}, {"date": "14 Oct 2012", "title": "Staff Scientist Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Fred Hutch Cancer Center", "Interview Descriptions": "I replied to a posted advertisement via email. About 2 weeks latter I received an email request for a phone interview with a member of the HR staff. This interview covered my qualifications, experience and ability to collaborate with, and manage others. It lasted about 20 minutes. A few days after this a second telephone interview was organized with the research team. This lasted about 40 minutes with a lot of questions on my educational and work history as well as specific questions about my current research. A week latter I was invited for a face-to-face interview with faculty and team members. This included presenting my current research as an open lecture to the center. I received an offer about 2 weeks latter.", "Interview Questions": "Do you think you are adequately trained for this position? "}, {"date": "26 Apr 2012", "title": "Protocol Review Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Fred Hutch Cancer Center (Seattle, WA) in Apr 2012", "Interview Descriptions": "Submitted my application online due to internal employee referral, receive phone call next day to schedule phone interview. Phone interview was casual and had the usual preliminary questions. Received call back later to schedule in person approximately 7 days. In-person interview consisted of 2 department employees and was somewhat casual. Honest and frank discussion about expectations, environment and growth potential. Was told about next steps and had a delayed response in communication (more than 10 days). When I did receive a phone call it was to say their process is taking longer than expected and that I should be hearing back \"soon\". Have yet to receive that communication.", "Interview Questions": "Why do you want to leave you current employer for this position at The Hutch?"}, {"date": "20 Feb 2012", "title": "Administrative Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Fred Hutch Cancer Center (Seattle, WA) in Feb 2012", "Interview Descriptions": "The phone interview lasted for 30 minutes. The in person interview lasted for about 15 minutes. HR asked two very broad questions that did not allow me to go into detail about my work experiences. It seemed like they had a candidate already in mind because I felt rushed. Apply here if you want to waste your time. A better recruiting and interviewing process needs to be implemented in HR. This was the worst interview experience ever.", "Interview Questions": "Tell us about yourself."}, {"date": "2 Jul 2014", "title": "Data Analyst Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Fred Hutch Cancer Center (Seattle, WA) in Jan 2012", "Interview Descriptions": "Everything is coordinated through HR, which makes the process a bit clumsy. \r\n1) HR contacts you to set up a phone interview. If scheduling is a problem they may need to call the manager and then call you back, rinse and repeat. 2) If phone interview is good, HR contacts you to set up in-person interview. Again, this can be a pain to get scheduled. 3) Possible multiple in-person interviews. Mine were all fairly casual Q&A type events--no tests or anything like that. 4) HR will contact you with an offer. In my case, when I countered the offer the HR person was able to respond without checking in with a manager, so I guess they were given a cap ahead of time. 5) Once hired, work with HR to fill out paperwork!", "Interview Questions": "They asked why I would leave my old job if I loved it so much (I'd raved about it earlier in the conversation). "}], [{"date": "11 Feb 2014", "title": "Systems Analyst/Programmer Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Fred Hutch Cancer Center (Seattle, WA) in Jan 2012", "Interview Descriptions": "Multiple interviews with several people at each interview. Interviewing process is unnecessarily drawn out.", "Interview Questions": "What makes you think you can raise optimism?"}, {"date": "25 Jun 2012", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 3 days. I interviewed at Fred Hutch Cancer Center (Seattle, WA) in Nov 2011", "Interview Descriptions": "The first interview was with the hiring manager, the second interview was with the team, and the third interview was with others with whom the position would work closely.   The total number of interviews seemed extremely excessive for a simple contract position.  Everyone was nice enough, but some personalities seemed belligerent and unfamiliar with legally acceptable interview questions.", "Interview Questions": "What interests you about this position?"}, {"date": "24 Apr 2011", "title": "Statistician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 3 weeks. I interviewed at Fred Hutch Cancer Center in Apr 2011", "Interview Descriptions": "behavior questions, more technical questions and the phone interview last for like30 mins.", "Interview Questions": "how much do you except the salary to be?"}, {"date": "31 Aug 2015", "title": "Postdoctoral Research Fellow Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Fred Hutch Cancer Center (Seattle, WA) in Feb 2011", "Interview Descriptions": "REGUALAR BACK AND FORTH OF ENDLESS EMAILS AND THEN THE PI ASKED ME TO PRESENT IT in a lab meeting and some quite simple questions to be answered before my offer was issued. I did not feel hardtime at all and the whole process was super easy.", "Interview Questions": "REGUALAR QUESTIONS AND NOT IMPRESSIVE AT ALL, BUT TALKING TO DIFFERENT MEMEMBERS OF THE WHOLE LAB, A WASTE OF TIME.\r\nQuestions was pretty basic such as where I worked before, why I came to Seattle, why I am interested in the PI'S lab work and what is my future plan to work as a scientist in the lab.l"}, {"date": "23 Dec 2013", "title": "Licensed Practical Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Fred Hutch Cancer Center (Seattle, WA) in Nov 2010", "Interview Descriptions": "My initial interview was with HR, then an interview with Tim Ball, LPN & Lab Mgr.", "Interview Questions": "N/A"}, {"date": "23 Jun 2012", "title": "Staff Scientist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Fred Hutch Cancer Center (Seattle, WA) in Jul 2010", "Interview Descriptions": "GENERALL PEOPLE ARE NICE HERE. but they will know what they wnat. pretty competitive environment here. not very generous in terms of payment of the interview expense. much less generous than industry.  good communication skill are required to achieve an offer. beatiful view and life condition here. about 2000 employees here and so many asian  chinese scientist around the center. biology, and statitician are most favoriable postion in htis center", "Interview Questions": "what is you previosu experience"}, {"date": "26 Jun 2010", "title": "Clinical Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 2 months. I interviewed at Fred Hutch Cancer Center (Seattle, WA) in Apr 2010", "Interview Descriptions": "1. Phone interview.\r\n2. Day one, 1:1 interview with manager.\r\n3. Day two, 1:1 interview with P.I.\r\n\r\nInterview asked everything that was listed in the job requirements.  Never did they ask \"how do you handle personality conflicts?\"  To me, that's a red flag.", "Interview Questions": "There was not a tough interview question.  Just had to read and relate my experiences to the list of potential questions."}, {"date": "20 Mar 2014", "title": "Post Doctoral Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 3 weeks. I interviewed at Fred Hutch Cancer Center (Seattle, WA) in Mar 2010", "Interview Descriptions": "Very easy - just met with PI and talked about experience/interests. Met with senior staff members (should have met with other post docs - environment not the same for junior post docts).", "Interview Questions": "When can you start - wanted immediately."}, {"date": "30 Jul 2012", "title": "Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 8 months. I interviewed at Fred Hutch Cancer Center in Feb 2008", "Interview Descriptions": "You'll submit a resume online and it will be reviewed by a \"resume robot\". You probably won't  hear anything for many months, and then you'll be extremely surprised to receive a call from HR. HR will schedule your interviews, which will include an one interview (approximately an hour) with the group you'll be working with and another interview with HR during which they'll explain the nuts and bolts, including benefits, compensation, etc. Most of the questions will come from the group that you'll be working with and there's really no way to predict what questions they'll ask you, but it will probably be pretty typical interview stuff for the field. There will be another very long wait period during which you'll think they forgot about it - possibly months. Then, you'll be asked in for a second interview, possibly with a larger group of people you'll be working with. Again, the questions will depend on the group. The whole interview process is long and drawn out so you'll have to be patient. Feel free to hound HR with phone calls, but be polite.", "Interview Questions": "I really don't remember any particularly difficult or surprising questions."}]]