[[{"date": "13 Jun 2023", "title": "Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Liberty University", "Interview Descriptions": "Great interview if you love the school. I loved my time at LU, and working as a grad assistant was great. Loved being a part of the community and being able to share faith and education.", "Interview Questions": "Simple and easy to maneuver if you like the school."}, {"date": "3 Jul 2023", "title": "Gate Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Liberty University (Lynchburg, VA) in Jun 2023", "Interview Descriptions": "The interview process was great! I could tell that the staff cared about me as an individual and what I could bring to their team. They wanted to know about my personal goals as well as my goals within my career.", "Interview Questions": "How do you want to grow over the next year?"}, {"date": "16 May 2023", "title": "Academic Advisor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Liberty University (Lynchburg, VA)", "Interview Descriptions": "I went through two interviews. The first interview was standard (question and response). Second interview was a mock call with readily available information. The overall process was not too hard.", "Interview Questions": "Do you have any prior experience?"}, {"date": "16 Jun 2023", "title": "Enterprise Architect Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Liberty University (Lynchburg, VA) in Apr 2023", "Interview Descriptions": "Zoom call scheduled. First interview is a more of a 'get to know you' interview that takes 15 mins. Not too formal, over zoom and was a couple questions about who I am as a person and what I am interested in.", "Interview Questions": "Tell me a little about yourself"}, {"date": "31 Mar 2023", "title": "Buyer Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Liberty University (Lynchburg, VA)", "Interview Descriptions": "Basic interview , panel type. Interviewees are from various levels and experience. Process is long and time consuming for unknown reasons. Responsiveness would help with the process. The systems do not appear to be efficient.", "Interview Questions": "An example of a 'difficult' situation and how you resolved it. Make me think there are issues."}, {"date": "26 Mar 2023", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Liberty University", "Interview Descriptions": "Interview consisted mostly of theological questions of your religious beliefs as it relates to Christ and the Holy Spirit. They also provide administrative information about the position. They talk about salary. student load, and pay frequency", "Interview Questions": "What is your view of the Trinity"}, {"date": "10 Mar 2023", "title": "Luo Academic Adviser Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Liberty University in Feb 2023", "Interview Descriptions": "I filled out an application online and in a week they offered me times to interview. It was a group interview and was not the most professional process. It was conducted on Microsoft teams, and they did not say how many people would be in the interview other than the representatives. It was five questions each person answers in a different order. The questions were general interview questions they don't seem to what to get to know you personally. Apparently they hire for this position often and it is a call center job. The title is kind of deceiving, you would not be assigned students they would just call in when they have issues. I will also say for an entry level job the other candidates were not entry level.", "Interview Questions": "What is a strength and weakness you have?"}, {"date": "22 Feb 2023", "title": "Academic Advisor Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Liberty University (Lynchburg, VA) in Feb 2023", "Interview Descriptions": "Group interview. Two representatives from the University with three candidates. Each candidate answered the same question. Approximately 5 questions with time to ask questions about the position at the end.", "Interview Questions": "What are your strengths and weaknesses?"}, {"date": "1 Jan 2023", "title": "Assistant Professor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Liberty University (Lynchburg, VA)", "Interview Descriptions": "Very easy and welcoming. Hope I get the job! The questions were fair and they just made it feel like they were just getting to know you. The campus is also very beautiful and would be a breath of fresh air to work there.", "Interview Questions": "Where do you see yourself five years from now? How are you with deadline management"}, {"date": "3 Jan 2023", "title": "Admission Evaluator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Liberty University (Lynchburg, VA) in Jan 2023", "Interview Descriptions": "Has been a long process, but I am confident that I will get the job. It would be a great experience to work for this distinct university. I have heard many great things about this place and I want to be part of them.", "Interview Questions": "What are your strengths and weakness?"}], [{"date": "19 Nov 2022", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Liberty University", "Interview Descriptions": "In person interview. Normal interview questions, nothing super out of the ordinary. Kinda intimidating interviewers, but the whole process was straight forward enough. They asked for a paper resume, which I didn’t have. So make sure to remember to bring one", "Interview Questions": "What is your Biggest strength"}, {"date": "31 Oct 2022", "title": "Business Data Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Liberty University", "Interview Descriptions": "Several interviewers at once. They were professional and very helpful in helping me understand various business functions. That gave me the ability to converse back and forth with them using my previous experience at a local company. Because I felt comfortable in the interview, I was able to speak clearly and communicate my ideas and character. This led to receiving a job offer several weeks later.", "Interview Questions": "Q: What experience do you have in data analytics? Q: How do you handle multiple priorities at once? Q: Tell us how you would describe a database to someone with no prior knowledge."}, {"date": "26 Aug 2022", "title": "Promotional Writer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Liberty University (Phoenix, AZ) in Aug 2022", "Interview Descriptions": "Interviewers numbered 7 managers in total. All individuals were very respectful, attentive, and intentional with questions. Questions were primarily situational and were directed towards the role. Interview was structured and organized. Overall, the interviewers wanted the applicant to feel like they had the chance to communicate everything they felt necessary.", "Interview Questions": "How would you deal with a situation where you missed a deadline?"}, {"date": "30 Aug 2022", "title": "Curriculum Developer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Liberty University (Lynchburg, VA) in Aug 2022", "Interview Descriptions": "There was an initial phone conversation followed by a Microsoft Teams video chat interview the following day.  It was a very pleasant conversation. The interviewer was very easy to talk to.", "Interview Questions": "What excites you about this job and working for Liberty?\nWhat strategies do you use to manage your time?"}, {"date": "14 Jun 2022", "title": "Contact Center Agent I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Liberty University (Lynchburg, VA)", "Interview Descriptions": "I was brought in for a panel interview and got to ask questions about the various departments in the division. It was professional, but also casual, and went very well.", "Interview Questions": "If you had to choose a particular shift, what hours would you work?"}, {"date": "21 Mar 2023", "title": "Business Data Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Liberty University in Jun 2022", "Interview Descriptions": "I had two interviews. The first interview consisted of basic SQL questions to gauge familiarity with database queries. This interview was conducted with two team leads. The second interview was more laid back and was conducted with one of the same team leads from the first interview as well as with the director of the department.", "Interview Questions": "What is a left join. What was a situation where you excelled in the face of a challenging situation at work."}, {"date": "20 Apr 2022", "title": "Assistant Director, Strategic Communications Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Liberty University", "Interview Descriptions": "Two interviews via MS Teams. Asked for project samples and descriptions.  Questions were typical interview-type questions. The first question was how much I expected the salary to be  - without full knowledge of the position,it was too early to answer the question.", "Interview Questions": "What is a campaign I would do to engage families?"}, {"date": "25 Mar 2022", "title": "Business Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Liberty University", "Interview Descriptions": "I applied online and received an email to set-up an interview. I had one laid-back interview. Got to know the manager and team-lead. Open-ended and behavioral questions. Not very technical.", "Interview Questions": "Example: if you had two tasks to complete on one day and realized you would only be able to complete one of them, what would you do? "}, {"date": "26 Nov 2021", "title": "Graphic Design Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Liberty University", "Interview Descriptions": "The interview process for the Career Center was very straight forward. I really enjoyed how friendly the supervisor was and how easy it was to get my answers across. I accepted the position and was able to take a remote internship position for the semester.", "Interview Questions": "What is one project that you are most proud of?"}, {"date": "28 Sept 2021", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Liberty University", "Interview Descriptions": "The interview was pretty comprehensive for an adjunct position, consisting of two rounds. Prior to the interview, candidates must submit an online application, and it takes quite a long time for HR to process and send the application to the Department that the candidate applied to. The first interview was more about the candidate's background and reasoning for applying. The second dealt more with the candidate's qualification and spiritual worldview and testimonies.", "Interview Questions": "Questions about candidate's background, reasoning for applying for the position, and some spiritually-related questions."}], [{"date": "1 Aug 2021", "title": "Program Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Liberty University", "Interview Descriptions": "I had a zoom interview with the director and who would have been my immediate supervisor. They asked questions about my experience and why I wanted the position. They were open about the job role and how it would fit into the overall program.", "Interview Questions": "What new ideas do you have for the program?"}, {"date": "6 Apr 2021", "title": "Graduate Student Assistant (GSA) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Liberty University", "Interview Descriptions": "The interviewer is friendly. We talked about the what is my contribution if I got the job, what I like to do in free time. What is my testimony. Basically, it was just normal conversation.  It was not hard. I really enjoy talking with the interviewers. The interview was not long. The beginning of the interview was explain the job position. What required for that position.", "Interview Questions": "Why do you want this job position?"}, {"date": "23 Mar 2021", "title": "Career Services Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Liberty University", "Interview Descriptions": "A one-on-one in-person interview followed by a panel interview. The interviewer was very kind and responded quickly after the interview. I was asked to present as a sample of my public speaking abilities.", "Interview Questions": "Tell me about yourself? Why are you interested in this position?"}, {"date": "17 Mar 2021", "title": "News Editor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Liberty University", "Interview Descriptions": "Straightforward, often hire within. Will ask about your goals for the position and what you hope to bring to the position. Will ask about InDesign experience as well as AP style knowledge.", "Interview Questions": "What are some goals you have for your section?"}, {"date": "4 Mar 2021", "title": "Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Liberty University", "Interview Descriptions": "It was exciting and the interviewer was very nice and engaged. They focus on what your passion is and what you really want to do. I really enjoyed the interview.", "Interview Questions": "What are your strength and weakness?"}, {"date": "4 Feb 2021", "title": "Help Desk Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. I interviewed at Liberty University", "Interview Descriptions": "The interview process for this job was interactive like none other.  I feel as though other employers evaluating a candidate's skill set should take note that some em\n\nYou take a proctored test for pre-screening. It helps to have at least studied for CompTIA A+ and understand PC architecture", "Interview Questions": "Put it like this-- Be one part creative, another part knowledgeable in troubleshooting scenarios, and you'll do fine. "}, {"date": "15 Feb 2021", "title": "Graduate Student Assistant Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Liberty University (Lynchburg, VA) in Jan 2021", "Interview Descriptions": "The interview was very short and fairly simple. It was more of a get to know you and get to know this position kind of interview. I interviewed with two people at a long oval desk, which was kind of intimidating.", "Interview Questions": "Where do you see yourself in five years?"}, {"date": "6 Dec 2021", "title": "Web Developer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Liberty University in Jan 2021", "Interview Descriptions": "Had to recreate a webpage and all its front-end functionality of one of their webpages. Had a chat with the team after that where I spoke about my resume and experiences that related to the team.", "Interview Questions": "What was an experience you had where you had to show initiative?"}, {"date": "4 Jan 2022", "title": "Events Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Liberty University (Lynchburg, VA) in Jan 2021", "Interview Descriptions": "As an undergrad student at Liberty University, I found that the interview process for the events assistant job was organized, professional, and prepared me for the real world. The interviewer didn't treat me like an incompeent student, but a professional and realistic applicant with respect.", "Interview Questions": "What is your experience in events?\nHow have you handled a conflict in the past with a coworker and/or your supervisor?"}, {"date": "21 Oct 2020", "title": "Project Manager Apprentice Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Liberty University", "Interview Descriptions": "It was a fairly quick and painless process. A very entry-level job, up against other students getting a foot in the door at LU, as well as furthering their education.", "Interview Questions": "\"Give an example of a situation where you had to manage people.\" "}], [{"date": "22 Feb 2021", "title": "Work Study Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Liberty University (Lynchburg, VA) in Oct 2020", "Interview Descriptions": "The interviewer was very nice and easy to talk to and got back to me very quickly. I liked the environment and the questions he asked me. After the interview, I was contacted in a quick manner.  I accepted the offer and started working shortly after.", "Interview Questions": "Why should we hire you"}, {"date": "9 Sept 2020", "title": "Resident Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Liberty University", "Interview Descriptions": "This process is a multi-step process and may vary depending on if you are from outside of liberty vs. being a student first. There where are least 4 phases. Application, 2 panel interviews and one interview with the executive director.", "Interview Questions": "What are some of your strengths?"}, {"date": "16 Sept 2020", "title": "Graduate Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Liberty University (Lynchburg, VA) in Sept 2020", "Interview Descriptions": "The interview process was brief and incredibly vague. It felt more like I was being talked at, rather than interviewed, which made me feel like they learned very little about me.", "Interview Questions": "Do you have a flexible schedule?"}, {"date": "18 Sept 2020", "title": "Student Advocate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Liberty University in Aug 2020", "Interview Descriptions": "I applied online. I was invited to interview via online video conference 2 to 3 weeks later. I went through 2 rounds of interviews. The entire interview process lasted only 2 weeks. Most questions were typical interview questions; very few were specific to the position.", "Interview Questions": "Q: Which animal best describes you and why: lion, golden retriever, otter, or beaver?"}, {"date": "14 Jul 2020", "title": "Resident Admission Counselor Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Liberty University (Lynchburg, VA) in May 2020", "Interview Descriptions": "Simple and straightforward. Interviewers were friendly and explained the position fully. They asked me a few basic questions and it lasted about 30 minutes, but was only about 15 minutes of questions after the description. Good experience.", "Interview Questions": "Describe a process of any kind. "}, {"date": "3 May 2023", "title": "New Enrollment Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 2 months. I interviewed at Liberty University (Lynchburg, VA) in Apr 2020", "Interview Descriptions": "Straight-forth interview process. Hiring manager will provide salary expectations and workplace standards in first round of interviews. I was impression by the hiring management team. Ultimately, hiring manager will want to learn more about your goals and LU can advance your potential.", "Interview Questions": "Where do you see yourself in 5 years from now?"}, {"date": "28 Mar 2020", "title": "Adjunct Professor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Liberty University in Mar 2020", "Interview Descriptions": "I submitted an application online and received a phone interview. I was asked questions concerning faith, theology and position in on political topics.  Then there is an HR screening process that follows, I am uncertain what the outcome of that will be.", "Interview Questions": "Position on abortion. "}, {"date": "16 Jan 2020", "title": "Facilities Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Liberty University", "Interview Descriptions": "It was a very relaxed and welcoming environment. There was enough of a challenge to keep me on my toes. They asked an adequate number of questions and clearly laid out each and every standard and each and every expectation.", "Interview Questions": "What hours would you like to work?"}, {"date": "21 Oct 2019", "title": "Senior Level Administrative Position Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Liberty University", "Interview Descriptions": "Pretty straightforward. I submitted an application online. Within about two weeks, I got an invite for a webcam interview. After that interview (took place about two weeks after invite), I got an invite for an on-site interview after about another two weeks. The on-site interview consisted of pretty straightforward questions and discussions with the office I interviewed with. Everyone was great and it was a decent experience. \r\n\r\nLiberty paid for my hotel. However, they didn't reimburse for anything else. They didn't even offer plane tickets or offer to pay for gas (I drove about 700 miles each way). Considering the amount of revenue that Liberty University is pulling in these days, it's disappointing that they don't offer basic niceties to their interviewees.", "Interview Questions": "What are your strengths? "}, {"date": "26 Nov 2019", "title": "Digital Media Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. I interviewed at Liberty University (Lynchburg, VA) in Oct 2019", "Interview Descriptions": "I am sorry but I am going to have to give a BIG thumbs down! I had high expectations for LU being a christian university but I was highly disappointed. When I had the initial phone interview - call was scheduled at 9AM - no call so I called and he acted like he didn't know why I was calling. He forgot!! However, it still went great and he set up an on-site interview for a few days later. Went to the on-site interview and for starters - the office is a disaster not your typical office...During the interview, I believe they didn't care for me as much because I wasn't a Liberty student. They had mentioned that everyone on the team graduated from LU. I sensed some form of bias! Oh well! The topping on the cake for this interview experience was waiting almost 6 weeks to hear a response from the hiring manager after I emailed twice (once to thank the interviewer for their time) and even contacted a friend of mine who works in the office. I had to get info from my friend to even see what was going on! Then I finally get an email with a fake apology for taking so long. Liberty DO BETTER!! Train your employers how to interview people.", "Interview Questions": "Experience? Faith? Why interested?"}], [{"date": "16 Mar 2020", "title": "IT Support Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Liberty University (Lynchburg, VA) in Oct 2019", "Interview Descriptions": "The interview was very casual and interviewer were nice. They asked me a lot of technical questions and second part of the interview was technical part and required some computer troubleshooting skills", "Interview Questions": "Are customers always right?"}, {"date": "16 Sept 2019", "title": "Financial Services Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Liberty University (Lynchburg, VA)", "Interview Descriptions": "Laid back, two people interviewing me, more just asking questions to get to know me. They took a lot of time describing the positions available. Wanted to see if you are flexible, and working different hours.", "Interview Questions": "Describe a time where you had to help someone complete a task where they had no experience doing so."}, {"date": "16 Jun 2021", "title": "Custodial Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Liberty University (Lynchburg, VA) in Aug 2019", "Interview Descriptions": "Nice people and relax  in this interview. Just sign the paper and ready to go . totally use 20 minutes  to do all the process. and some chemical processes lesson right after the interview.", "Interview Questions": "Just sign the paper and ready to work"}, {"date": "10 Sept 2020", "title": "Junior Software Developer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 3 days. I interviewed at Liberty University (Lynchburg, VA) in Aug 2019", "Interview Descriptions": "The interview was a group interview. It didnt seem scripted or planned. They asked me 1 question to check my knowledge but seemed more interested in putting me in a different role.", "Interview Questions": "What salary are you looking for?"}, {"date": "25 Jun 2021", "title": "Graduate Student Assistant (GSA) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 3 weeks. I interviewed at Liberty University in Apr 2019", "Interview Descriptions": "I was approached by my professor, and we scheduled a one-on-one interview in their office. Following the interview I received contract for the position in about two weeks from the department.", "Interview Questions": "How do you handle conflict management?"}, {"date": "26 Feb 2020", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Liberty University (Lynchburg, VA) in Apr 2019", "Interview Descriptions": "Laid back getting to know me, why I wanted the position, what my class schedule was like and how I will be able to balance working and school, they put emphasis in school being a priority", "Interview Questions": "You have to work 18 hours per week, how will you be able to balance this with your course-load?"}, {"date": "25 Mar 2019", "title": "Lead Plumbing Tech Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 3 months. I interviewed at Liberty University", "Interview Descriptions": "Getting the first interview took FOR-EV-ER! It was 6 months from when I put my application in. One day, out of the blue, the head of the plumbing department called me. We set up a time to where I could come to in for an interview. Basically when I showed up I was interviewed by two people. They looked at my application and asked about how long I had been in the trade and what I did at my previous jobs. Then they just told me what a day was like, and what I would be doing... I was no longer interested in the job when they told me the pay... Which was way too low, well below the local market average for a licensed plumber. Granted free education for full time staff is nice, but I need to be able to pay bills, eat, and have some kind of savings without having to work a second job.", "Interview Questions": "What did you do at your previous jobs?"}, {"date": "22 Mar 2019", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Liberty University", "Interview Descriptions": "Smooth, easy conversations, not feeling pressured, kind enviroment. They make you feel in a safe enviroment. Overall, it is about the confidence you bring and positive attitude as well. Important to read about the department beforehand", "Interview Questions": "What do you see yourself doing"}, {"date": "5 Feb 2020", "title": "Office Staff Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Liberty University (Lynchburg, VA) in Feb 2019", "Interview Descriptions": "In person, it was 30 minutes max. There were two people that interviewed me. We spent a lot of time talking about my goals and passions and how they fit this job and it's long term plans.", "Interview Questions": "Why does this job interest you?"}, {"date": "27 Mar 2019", "title": "Project Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Liberty University (Lynchburg, VA) in Feb 2019", "Interview Descriptions": "Super laid back yet very professional. I immediately felt comfortable and talked freely about myself and my qualifications. They asked around 6-7 open ended questions after getting to know me first. It was a group/panel interview so there were 4 people asking questions. I never felt overwhelmed", "Interview Questions": "How do you adapt to change?"}], [{"date": "3 Oct 2018", "title": "Academic Advisor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Liberty University", "Interview Descriptions": "2 people interview. They ask you to pitch liberty to students and then try to sell  them on that. They ask about what makes you qualified. They don't really care about education background.", "Interview Questions": "How many tennis balls fit in a limo?"}, {"date": "4 Mar 2022", "title": "Senior Promotional Writer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Liberty University (Lynchburg, VA) in Oct 2018", "Interview Descriptions": "The entire interview process took almost a month, including doing some writing promotional samples for university related events. That went well, so I got a phone interview. I thought it went relatively well, and until they asked about questions I had for them. One question was about the work environment and if you if you ever get to work from home if you are sick. This was precovid, but one woman clearly sounded annoyed by the question and asked if not being able to work from home would be a problem for me. Overall, I feel like things were lost in translation over the phone and I feel like they were also just really awkward. In person or video would have been better.  But on top of that, they then just ghosted me even though I had been personally emailing with one of the interviewers for weeks prior.", "Interview Questions": "What skills or experience could you bring to the role of promotional writer."}, {"date": "11 Nov 2018", "title": "Phone Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Liberty University (Lynchburg, VA) in Aug 2018", "Interview Descriptions": "Professional and thorough. I was interviewed by two gentlemen under the age of 30. I expected that but at the same time those two gentlemen seemed mature and wise beyond their years.", "Interview Questions": "Describe a process"}, {"date": "31 Dec 2019", "title": "Financial Aid Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 2 weeks. I interviewed at Liberty University (Lynchburg, VA) in Jul 2018", "Interview Descriptions": "The interview process was alright. You get to interview in front of a full board of members and they find your best fit for a job.  If you are selected they tell you professionally and they are also very gracious if they do not hire you.", "Interview Questions": "How to handle customer service  people "}, {"date": "29 May 2018", "title": "Project Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Liberty University (Lynchburg, VA) in May 2018", "Interview Descriptions": "Phone interview with various project coordinators and managers, followed by a \"homework\" assignment as a second round of interviews. The phone interview was nerve racking because not only was it a first impression, but it was a first impression on many people without any way to gauge a reaction due to it being a phone interview. The homework assignment was straightforward and simple enough, but the wait to hear back afterwards was very long.", "Interview Questions": "How would you handle a situation where one of your coworkers is not pulling their weight on a project."}, {"date": "8 Nov 2017", "title": "Academic Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Liberty University (Lynchburg, VA)", "Interview Descriptions": "I submitted an application and received a call within a month.  I met with a panel of three individuals who took turns to ask questions for approximately one hour.", "Interview Questions": "Why do you think you are the best person for this job?"}, {"date": "18 May 2017", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Liberty University (Lynchburg, VA) in Apr 2017", "Interview Descriptions": "The interview wasn't too intimidating, there were two people present and the environment was very relaxed. The only thing that felt uncomfortable to me was when they started asking about my beliefs.", "Interview Questions": "They did ask what my beliefs were and whether or not I drink alcohol which seemed odd to me."}, {"date": "8 Mar 2017", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Liberty University", "Interview Descriptions": "I applied online through Liberty.edu and was called within a week to interview with the professor I'd be working with.  We met in his office for about 20 minutes and he asked how I like his class and Liberty in general and what I wanted to do in the future.", "Interview Questions": "Have you ever been worked in office where you did not have a supervisor always around?"}, {"date": "29 Sept 2017", "title": "IT Apprentice Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Liberty University (Lynchburg, VA) in Mar 2017", "Interview Descriptions": "It was in the office of the department I was interviewing for. I was interview by two other people to determine if I would be a better fit for their side of the department or the other. The interview itself was easy as they basically did a ton of talking and asked me very basic questions.", "Interview Questions": "Can you think of an instance where you made a mistake that was your fault and how to you handle it?"}, {"date": "28 Aug 2017", "title": "Assistant Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Liberty University (Lynchburg, VA) in Feb 2017", "Interview Descriptions": "It was a great experience with very friendly interviewers. The interview was more of a discussion than being drilled questions. When I asked question, the interviewers fully answered all my questions before I left the interview.", "Interview Questions": "Please explain in depth how to handle a project from start to finish."}], [{"date": "28 Apr 2017", "title": "Adjunct Faculty Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Liberty University (Lynchburg, VA) in Jan 2017", "Interview Descriptions": "I applied in the summer of 2016.  In October 2016, I was asked to provide additional information including an endorsement from my pastor.  I had a phone interview in January 2017 and was informed of my rejection at the end of April 2017. The process is long!", "Interview Questions": "N/A"}, {"date": "20 Dec 2018", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Liberty University (Lynchburg, VA) in Jan 2017", "Interview Descriptions": "Friendly, but still formal. The front desk attendant was very friendly and helped to calm the nerves I had. The interviewers were very friendly and nice and wanted everyone involved to enjoy the interview process.", "Interview Questions": "Why do you want to work here?"}, {"date": "21 Dec 2018", "title": "Library Acquisitions Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Liberty University (Lynchburg, VA) in Jan 2017", "Interview Descriptions": "The interview process took about a medium length of time.  It was me being interviewed by 4 other people.  They took turns asking me questions.  It was a little nerve-racking with so many interviewing me.  They were all pleasant and asked well thought out questions.  Expect to answer a lot of the typical interview questions that you can find online plus others that relate to the job itself.", "Interview Questions": "How would you handle dealing with one issue when another major issue came up at the same time?"}, {"date": "20 Feb 2019", "title": "Academic Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Liberty University (Lynchburg, VA) in Dec 2016", "Interview Descriptions": "The interview was easy Liberty cannot maintain their staff. They are desperate to bring people in and will hire almost anyone who applies to the job. Just dress nicely and you will do fine.", "Interview Questions": "I do not remember"}, {"date": "8 Nov 2016", "title": "Customer Service Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Liberty University (Lynchburg, VA)", "Interview Descriptions": "I received a call and came in the next day for about a 30 minute interview with the Learning Commons Manager and the Coordinator. They seemed to really like me.", "Interview Questions": "They asked me about my mindset concerning customer service. "}, {"date": "6 Nov 2016", "title": "Admissions Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Liberty University", "Interview Descriptions": "Group interview with 6 others who had applied. We were able to view where would we be if hired and explanation of the job was given. There were high hopes given of being able to move up quickly.", "Interview Questions": "Why I thought I would be good for the job."}, {"date": "1 Nov 2016", "title": "Undergraduate Admissions Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Liberty University (New York, NY) in Oct 2016", "Interview Descriptions": "I applied on the Liberty website and received a call a week later asking me to come in for an interview. I Interviewed with two people in the office, and they asked me basic questions about my goals, past experiences, and why I want to work for them. The people who interviewed me were very nice, and the office seems to have a very positive environment. The next day I received a call and was offered the position.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "8 May 2018", "title": "Call Center Agent Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Liberty University (Lynchburg, VA) in Sept 2016", "Interview Descriptions": "The interview process was not that hard. There was a panel type of interview and the next week they called me to tell me they were hiring me.  They asked normal and thought provoking questions.", "Interview Questions": "What was the proudest moment in your life?"}, {"date": "21 Dec 2016", "title": "Library Work Study Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Liberty University (Lynchburg, VA) in Sept 2016", "Interview Descriptions": "I applied on the Liberty Work-Study board. I was called for an interview from that, and was interviewed by two men for about twenty minutes. My prior experience was mainly summer camps and I was applying for a library position so they grilled me to make sure I was capable. I was called 3 weeks later and told I was hired.", "Interview Questions": "How will you adjust to office work?"}, {"date": "5 Feb 2020", "title": "Academic Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Liberty University (Lynchburg, VA) in Sept 2016", "Interview Descriptions": "Interview process was smooth. They asked general interview questions. I did not feel intimidated but Liberty does like to hire from within. I had 3 interviews with Liberty and was offered 2 jobs before I made my decision.", "Interview Questions": "Name 3 strengths and 3 weakness"}], [{"date": "8 Nov 2016", "title": "Web Developer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Liberty University (Lynchburg, VA) in Jun 2016", "Interview Descriptions": "1 interview, 4 interviewers. Given homework to show my coding style. They accepted what I had done, even though I need a lot of work and education. Really great people.", "Interview Questions": "What's my preferred management style?"}, {"date": "15 May 2016", "title": "Online Academic Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Liberty University", "Interview Descriptions": "Preliminary e-mail communications covering the job overview and information and then I had to answer a handful of general questions, submit typing speed tests, and go in for a group interview. There was a brief introduction to quell any misconceptions about the job and then questions from and for a panel of interviewers. Not nearly as bad as I expected it to be.", "Interview Questions": "What's a goal you have had that you completed and how did you do it?"}, {"date": "29 May 2016", "title": "Scenic Artist Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4+ months. I interviewed at Liberty University (Lancaster, PA) in Apr 2016", "Interview Descriptions": "I interviewed over the phone with Liberty University coming up on two months ago. I was told by the interviewer that they would like to move forward, and that I would be receiving a phone call from the head of the department. However, days and weeks went by with no contact. So I did some research and found email addresses which I used to reach out to certain representatives. I also called the initial interviewer several times and left messages. When those attempts were unsuccessful, I emailed the HR office at Liberty and haven'the heard back from them either. At this point it is obvious I am not getting the job, but to not respond to my emails or phone calls over a two month span is unprofessional and quite frustrating. \r\n\r\nDisclaimer: I was not officially offered the job (like it says below... I had to pick one), but the interview went well and it seemed as if they were going to offer it to me.", "Interview Questions": "Specific questions about my portfolio and my experience in college while working towards my degree."}, {"date": "27 Jan 2017", "title": "Academic Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Liberty University (Atlanta, GA) in Feb 2016", "Interview Descriptions": "It was pretty simple and not very long. The questions were basic interview questions. They basically wanted to know if I had good people skills and if I was going to be able to handle the position.", "Interview Questions": "What type of experience have you had in this position?"}, {"date": "1 Dec 2016", "title": "Writing Tutor Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Liberty University (Watertown, WI) in Jan 2016", "Interview Descriptions": "The  interview is over the phone and through skype and is very informal. It took only a couple hours to talk with the supervisor before the job was offered.", "Interview Questions": "Previous experience."}, {"date": "30 May 2016", "title": "Work Study Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 months. I interviewed at Liberty University (Lynchburg, VA) in Jan 2016", "Interview Descriptions": "I had a phone interview for the position seeing as I was not in the area for an in person interview. The process for hiring took a long time for HR to process. I was hired by my boss one month and then officially hired the next month. Do things in advance if you can.", "Interview Questions": "Do you work well with people"}, {"date": "23 Nov 2015", "title": "New Enrollment Specialist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Liberty University (Lynchburg, VA)", "Interview Descriptions": "My first interview was a group interview with three other candidates. Only department managers sat in and it was awkward and didn't flow well with three of us trying to get our time in to talk- I did get a call back to interview further but to a different department that I did not apply for.  This time I was interviewed by 3-4 team leaders all at once, which went much more smoothly.", "Interview Questions": "How would you describe customer service?"}, {"date": "12 Jul 2018", "title": "Information Services Apprentice Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 4 months. I interviewed at Liberty University (Lynchburg, VA) in Nov 2015", "Interview Descriptions": "Had a personal interview with some lower level employees, then another personal interview with a program manager and another employee, and finally a phone interview with the director.  The program manager had originally emailed me about the position.", "Interview Questions": "I don't remember much, but they were literally Googling questions to ask at first. Later interviews had more specific questions about the type of work I'd do, though it was somewhat vague."}, {"date": "23 Aug 2019", "title": "Workforce Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Liberty University (Lynchburg, VA) in Oct 2015", "Interview Descriptions": "Professional and efficient form of interviewing. They called me back for a second interview and a couple days later I was given the offer. Positive experience overall, fairly easy as well.", "Interview Questions": "What do you hope to gain from this position?"}, {"date": "30 Mar 2016", "title": "Graphic Designer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Liberty University (Lynchburg, VA) in Aug 2015", "Interview Descriptions": "Easy and laid back, with thought provoking questions. I felt challenged as to why I do what I do as well as how I would best fit with the already-established team. I don't have too much more to say about this, but Glassdoor requires a 50 word minimum, so I suppose I will just ramble for a little bit.", "Interview Questions": "They asked me what one skill I could really bring to the table to benefit the team."}], [{"date": "25 Sept 2015", "title": "Intern Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at Liberty University (Lynchburg, VA) in May 2015", "Interview Descriptions": "Served as an assistant for the staff workers. I helped them producing segments for the LFSN Channel. I helped with whatever and everything I could. Also did a lot of interviews with important people coaches and players.", "Interview Questions": "Do you know how to edit?"}, {"date": "25 Apr 2015", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Liberty University (Lynchburg, VA)", "Interview Descriptions": "Spoke only with the Supervisor in charge of department; he seemed nice and the overall work area was OK.  Did not get to meet any other employees.", "Interview Questions": "He asked typical questions about my skills and qualifications; the statement of beliefs"}, {"date": "4 Mar 2015", "title": "IT Training Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 3 days. I interviewed at Liberty University (Lynchburg, VA)", "Interview Descriptions": "The interview process was pretty interesting.  I first met with the hiring manager about the position.  He then asked me to meet with two of his peers (also managers of other departments).  I met with them and they asked me their own sets of questions.  I assume they then collaborated and talked through the decision to hire.", "Interview Questions": "Why are you interested in this position?"}, {"date": "21 Jul 2015", "title": "Assistant Librarian Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Liberty University (Lynchburg, VA) in Mar 2015", "Interview Descriptions": "They did not really ask alot of questions. Just simple things as how are you doing in school, what is your expected work hour and such. And what you are good at, as to they have different departments in library", "Interview Questions": "Your time with the Lord"}, {"date": "7 Jul 2015", "title": "Online Admissions Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Liberty University (Lynchburg, VA) in Jan 2015", "Interview Descriptions": "You get a basic phone call talking about the job and your interest. Set up a second phone call that goes more in depth about the job/requirements. Then they set up an in person interview.", "Interview Questions": "Be prepared to sell an item in the office. (Stapler, pen, hand sanitizer)"}, {"date": "11 Nov 2015", "title": "Office Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 3 days. I interviewed at Liberty University (Lynchburg, VA) in Jan 2015", "Interview Descriptions": "I heard about the job through a friend. I contacted the company and asked about the job, they asked me to apply online and then come in for a interview the next day. The interview was with my supervisor and her supervisor. It was a very casual interview and I got a call offering me the job the next day. Overall it was a very easy process.", "Interview Questions": "They asked me about previous office experience I had"}, {"date": "1 Aug 2016", "title": "Slope Operations Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Liberty University (Lynchburg, VA) in Jan 2015", "Interview Descriptions": "Talking about customer service, safety, responsibility, as well as background in either skiing or snowboarding. It was a group interview for me, however, I know for a fact that they transitioned from that to two on one interviews (two managers and one interviewee). They are looking for you to have a friendly, driven personality.", "Interview Questions": "What is one example of great customer service you have received recently?"}, {"date": "12 Dec 2014", "title": "Admissions Evaluator Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Liberty University", "Interview Descriptions": "Not too bad, some are straight up questions, should do well if you do your research, you have to know someone to get into working for the school. The process does not take too long with too many positions, so the interview process was pretty straight forward with its questioning", "Interview Questions": "The most difficult and unexpected question where do you see yourself in 5 years here"}, {"date": "28 Nov 2014", "title": "Financial Aid Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Liberty University", "Interview Descriptions": "Very nice people that interviewed me. It was one person from each department in financial aid. They asked most similar questions that you would normally be asked in an interview. It went smoothly. Lasted about 20 minutes", "Interview Questions": "What was the most difficult thing you encountered while working at your previous job that you couldn't do anything about? "}, {"date": "24 Oct 2014", "title": "Flight Instructor Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Liberty University", "Interview Descriptions": "I applied by calling the Liberty Flight Operations building.  Ended up talking to the chief of operations on the phone to talk about possible positions. Ended up scheduling a phone Interview, then they asked me to come to liberty to do a face to face interview.  After I did that they wanted to see my flying experience in an simulator ride followed by a flight in a C172. After that they made me a  job offer.  Whole thing took about 3 weeks.", "Interview Questions": "Nothing very difficult.  Just asked questions similar to one you might expect on a CFI checkride "}], [{"date": "26 Sept 2014", "title": "Online Communities Administrative Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Liberty University", "Interview Descriptions": "Applied online, received an email for an interview. Very basic questions such as why I wanted to work for them. They would not discuss the pay unless you are offered a position but they typically pay much less than other companies.", "Interview Questions": "Why do you feel you would be a good fit for this department?"}, {"date": "14 Nov 2017", "title": "Admissions Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Liberty University (Lynchburg, VA) in Oct 2014", "Interview Descriptions": "My application was responded to promptly and the interview process was concise but informative. Several representatives were present from management and were very engaging and personal. The interview process lasted a total of 2 hours including time spent sitting with a current agent listening in on phone calls.", "Interview Questions": "What is one thing your previous employer would say you do well?"}, {"date": "21 Mar 2016", "title": "Academic Affairs for Athletics Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 days. I interviewed at Liberty University (Lynchburg, VA) in Aug 2014", "Interview Descriptions": "Took 3 days to interview, send paperwork in and receive an offer. The interview was in person 1:1. They asked fair but somewhat challenging questions. Nothing too difficult but makes you think how you would respond in a tough situation. Interviewer is a great guy, and is very genuine. Quiet guy but very welcoming.", "Interview Questions": "How would you handle an athlete that has no regard for rules?"}, {"date": "30 Jan 2015", "title": "Interlibrary Loans Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Liberty University in Jul 2014", "Interview Descriptions": "Responded very fast to schedule an interview, even faster response for the hiring decision. Interviewers did not know specifics about pay rate, vacation days but where very open about everything else.", "Interview Questions": "Regarding career advancement in my degree field vs staying in Library "}, {"date": "11 Aug 2015", "title": "Event Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Liberty University (Lynchburg, VA) in Jul 2014", "Interview Descriptions": "It was very easy and pretty low key. They didn't describe the job position as clearly as wanted, I am guessing because they didn't want to give away that it is a desk job with a lot of basic computer work.", "Interview Questions": "What are 3 strengths and weakness about yourself?"}, {"date": "1 Jan 2016", "title": "Grounds Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Liberty University (Lynchburg, VA) in Jul 2014", "Interview Descriptions": "Applied online got a call back in a week. Went in for a face to face interview. 3 managers interviewed me and told me about the job. Let me ask questions and showed me around the shop. Total time was about 1 hour.", "Interview Questions": "Strength and weaknesses"}, {"date": "2 May 2018", "title": "Academic Advisor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Liberty University (Lynchburg, VA) in May 2014", "Interview Descriptions": "Phone Interview, asked generic questions regarding professionalism, ability to communicate clearly and trustworthiness. Leadership Is looking for individuals who will show up on time, work hard and be able to adjust based off the needs of the department.", "Interview Questions": "How long do you intend to work for us?"}, {"date": "6 Apr 2014", "title": "Math Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Liberty University", "Interview Descriptions": "I applied for the job on the jobs website. I then sent an email to the head of the department. I got an email the next day asking i come an for an interview. I did the interview it was very basic questions. The main focus was to make sure i had a solid foundation in math.", "Interview Questions": "I was given a math quiz that i had to complete and turn in. to verify i understood the amount of math required."}, {"date": "28 Nov 2015", "title": "Graduate Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 3 weeks. I interviewed at Liberty University (Lynchburg, VA) in Apr 2014", "Interview Descriptions": "There were several interviews that needed to be conducted as they were looking for personality fits, not just skills fits. The job was for teaching so being able to have a commanding presence in a classroom would be a must. They were also looking for someone that was quick to respond to communications.", "Interview Questions": "Where are you in your personal walk with Christ?"}, {"date": "20 Mar 2014", "title": "IT Staff Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Liberty University", "Interview Descriptions": "Started with phone interview, then a visit to the campus for a live interview with hiring manager and two other staff members.  About 2 weeks later, an offer was made.", "Interview Questions": "N/A"}], [{"date": "9 Jan 2017", "title": "Financial Aid Officer Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Liberty University (Lynchburg, VA) in Jan 2014", "Interview Descriptions": "Sit down with head of financial aid and individual department heads. Needed to ensure you were a good cultural fit (same religious beliefs). They trust their you're a good worker if you are an alum.", "Interview Questions": "Which department would you like to work in?"}, {"date": "6 Jan 2016", "title": "Assistant Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Liberty University in Dec 2013", "Interview Descriptions": "I applied for the position online and received a phone call about interviewing. Went in and was interviewed by one person and they asked a variety of questions. The interview process is not very difficult and i am sure the departments vary.", "Interview Questions": "Philosophy on work"}, {"date": "29 Oct 2013", "title": "Communication Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied through other source. The process took 2 weeks. I interviewed at Liberty University", "Interview Descriptions": "It was an internal hiring process, I was approached by my supervisor, saying that they needed a someone who was tech savvy, with a Marketing background.", "Interview Questions": "There wasn't really anything that was unexpected. They just gathered information on my background, and they already knew me personally, so it was a very simple process."}, {"date": "20 Mar 2017", "title": "Adjunct Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 10 months. I interviewed at Liberty University in Sept 2013", "Interview Descriptions": "I had a panel phone interview (2 interviewers).  Since I had already been working at the university, thankfully the interviewers were aware of my reputation and work ethic.  The interview lasted for about an hour.", "Interview Questions": "I was asked to share my teaching philosophy."}, {"date": "7 Aug 2017", "title": "New Enrollment Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Liberty University (Lynchburg, VA) in Aug 2013", "Interview Descriptions": "I applied in May.  Took a few months to hear back, but I received a call inviting me to interview in August.  I was offered the job on the spot, and started about a week later.", "Interview Questions": "What's your biggest weakness?"}, {"date": "14 Jul 2013", "title": "Online Admissions Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Liberty University (Lynchburg, VA)", "Interview Descriptions": "The initial interview process was simple. The application to the job was straightforward and easy. Got a call back for an interview with mid-level management plus one senior level manager. All of them asked me questions about my life goals, my greatest strengths and weaknesses, my sales experience, etc. All very standard interview questions.", "Interview Questions": "What are your greatest strengths and weaknesses?"}, {"date": "26 Mar 2015", "title": "Enrollment Advisor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Liberty University (Lynchburg, VA) in Jun 2013", "Interview Descriptions": "It was easy. They just asked a bunch of typical interview questions then told me they would contact me within a week or two. They contacted me the next week by email telling me they had chosen someone else for the position. It was still a good interview experience.", "Interview Questions": "Have you ever had to work under someone who was difficult to get along with?"}, {"date": "7 Mar 2016", "title": "Academic Evaluator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Liberty University (Lynchburg, VA) in Jun 2013", "Interview Descriptions": "I was interviewed first by two managers or such from the department.  After this, I was brought in for a second interview with the main hiring manager, who would have been my boss if I had received the job.  I received good feedback and communication from the hiring managers throughout the process, even when I was not offered the position.", "Interview Questions": "They asked me why I was wanting to transfer from another department at the University."}, {"date": "9 Jan 2018", "title": "Janitorial Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Liberty University (Lynchburg, VA) in May 2013", "Interview Descriptions": "Got a student job and they just let me become a full-time when a position opened.  In order to get the student job I applied online. They called and offered me the job within a few weeks of feeling out the application", "Interview Questions": "N/A"}, {"date": "20 Sept 2017", "title": "Lift Operator Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Liberty University (Lynchburg, VA) in May 2013", "Interview Descriptions": "Group interview, around thirty applicants. Background check required prior. Very informal, to the point where dressing well might be a detriment. Be prepared to hear more testimonies then work experience.", "Interview Questions": "Are you Ok with working weekends?"}], [{"date": "19 Apr 2013", "title": "Military Affairs Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Liberty University", "Interview Descriptions": "Excellent interview process, professional, quick, and to the point without making one feel insignificant or dismissed. For the large organization that it is, the hiring process was rather quick and painless. There was plenty of guidance and clear goals and expectations set from the get-go. Overall it was a good experience", "Interview Questions": "What are the salary upgrades and how does the road to moving up the ladder work?"}, {"date": "18 Dec 2017", "title": "Landscape Technician Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at Liberty University (Lynchburg, VA) in Mar 2013", "Interview Descriptions": "Standard group panel interview. At the time I was interviewed by the manager, assistant manager, and supervisor. They all asked me different questions about landscape experience and personal questions about my character and habits.", "Interview Questions": "How do you feel about working some overtime if asked?"}, {"date": "6 May 2015", "title": "Student Account Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Liberty University (Lynchburg, VA) in Mar 2013", "Interview Descriptions": "Professional atmosphere, but once the introductions were made, it became more comfortable and easy to complete the interview.  Interviews are now a group interview with individual interviews possible at a later time.", "Interview Questions": "How do you handle a difficult student?"}, {"date": "26 Feb 2013", "title": "Office Manager Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Liberty University", "Interview Descriptions": "I met with the director and we discussed the policies and procedures of the office.  It was an easy flow and seemed as though I was interviewing with a friend.", "Interview Questions": "There really wasn't a question that was out of the ordinary.  The flow was very conversational."}, {"date": "27 Jan 2016", "title": "Marketing Assistant- Writer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 6 days. I interviewed at Liberty University (Lynchburg, VA) in Feb 2013", "Interview Descriptions": "The process was unlike any I had experienced previously. The process involved three main components: 1. Submission of application and resume via the school website 2. A Paneled interview- Six interviewers (pens and notepads, folders and post its at the ready) asked me various questions (We were all seated at a rectangular table. I was surrounded. :) 3. The Completion of a Writing Assignment (This task was assigned following the paneled interview. It's purpose appeared to be for assessing my marketing skills and writing abilities, both of which were needed for the position)", "Interview Questions": "Do you work well with a team?"}, {"date": "24 Jan 2017", "title": "Liberty Online Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Liberty University (Lynchburg, VA) in Feb 2013", "Interview Descriptions": "Group interview - not a fan. At one point I was asked to explain why I am more hireable than the person next to me. I made up some story about how I saw him at a party and he had way too much to drink.", "Interview Questions": "Why do you want to work for LU?"}, {"date": "23 Jan 2013", "title": "Admissions Counselor Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Liberty University", "Interview Descriptions": "Initially, I applied online. However, I knew other agents who worked there and asked them to put in a good word for me. I had a phone interview and then was scheduled for a group interview. At the time, the department was doing pretty large volume hiring, so I had an interview with 4 different directors.", "Interview Questions": "N/A"}, {"date": "22 Aug 2016", "title": "Customer Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Liberty University (Lynchburg, VA) in Nov 2012", "Interview Descriptions": "The Preliminary Phone interview was conducted by the workforce manager. Questions during this interview were mainly to determine if I understood the role and responsibilities of the position. At this point in the process the workforce manager also elaborated on the nature of the work shifts and and employee expectations. This phone interview was then followed by one face to face interview. Interview was with department Director and Assistant Director. Prior to the final job offer, the workforce manager emailed out a  mandatory typing and grammar test. Test results were then emailed back to the workforce manager.", "Interview Questions": "Both the phone and face to face Interview questions dealt with motivation for the field, pay expectations, shift requirements, customer service skills, and career goals. The department as a whole was looking to build at the time and candidates who expressed a willingness to stay with the department for at least 2 years were considered more favorably."}, {"date": "26 Jul 2016", "title": "Financial Aid Advisor II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Liberty University in Oct 2012", "Interview Descriptions": "Hiring managers were friendly and made me feel comfortable. There were a few managers in the interview, in which they would collaborate as to which area in the Financial Aid Department that I would fit best since there is not only the call center, but other departments within financial aid.", "Interview Questions": "General questions, what are strengths and weaknesses, how do you handle conflict."}, {"date": "21 Jul 2015", "title": "Helpdesk Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Liberty University (Lynchburg, VA) in May 2012", "Interview Descriptions": "The interview process was carried out by three managers, and consisted of a basic \"how would you handle these situations\", touched on previous experience, and then ended with a test of troubleshooting skills with fixing a laptop issue. This was all after an initial short test to test aptitude in general, and was well conducted. The managers are nice, and did a good job of staying organized.", "Interview Questions": "Asked to fix a laptop issue while all of the panel watched and took notes."}], [{"date": "17 Aug 2015", "title": "Assistant Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1+ week. I interviewed at Liberty University (Lynchburg, VA) in Nov 2011", "Interview Descriptions": "I flew out on my own dime to Lynchburg for the day. I met with the supervisor and all department employees, plus other members of the leadership team. I went out to lunch with the folks I would be working with. Overall, it was a pleasant experience.", "Interview Questions": "What is your religious background?"}, {"date": "17 Nov 2015", "title": "Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Liberty University (Lynchburg, VA) in Aug 2011", "Interview Descriptions": "The interview process was not too difficult.  It was similar to many others I have been on. Questions had to do with technical skills as well as how I would handle different situations dealing with customers. The interview was conducted from afar and consisted of a few different phone calls.", "Interview Questions": "How would you resolve this issue dealing with a customer?"}, {"date": "8 Aug 2012", "title": "Career Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 1+ week. I interviewed at Liberty University (Lynchburg, VA) in Jul 2011", "Interview Descriptions": "Was contacted initially by Graduate Assistant office, stating that I was referred to the Career Center for open positions. One of the employees at the Career Center contacted me to schedule a panel interview. Afterwards, I was contacted by the Director for a second interview. Finally, I was informed that I'd been chosen for the position.", "Interview Questions": "What are you three weaknesses?"}, {"date": "18 Sept 2015", "title": "Online Academic Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Liberty University (Lynchburg, VA) in Apr 2011", "Interview Descriptions": "I was asked to give a brief summary of my work history, informed of the requirements of the position, asked about how I would handle various challenging situations, asked to give relevant positive and negative qualities about myself, and where I saw myself in five years.", "Interview Questions": "A student is irate with you over the conduct of their online professor, how do you assist them?"}, {"date": "21 Oct 2015", "title": "Online Admissions Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Liberty University (Lynchburg, VA) in Feb 2011", "Interview Descriptions": "was very basic. see if you can sound good on the phone. if you meet the basics or you know somebody in management personally, you have a good shot. filler words filler words filler words filler words...", "Interview Questions": "nothing particular. just basic questions"}, {"date": "26 Mar 2014", "title": "Admissions Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Liberty University (Lynchburg, VA) in May 2010", "Interview Descriptions": "The interview process begins with a 3 page application and questionnaire, as well as a statement of adherence to a moral conduct code and a statement of beliefs. It goes from there to a phone interview, then to an in person interview. Interviews are usually done with a senior manager and a middle manager. Questions are very straightforward. No Cloak and dagger / backhanded questions or trick questions. Follow up was very prompt", "Interview Questions": "How do you respond to micromanagement?"}]]