[[{"date": "13 Jun 2019", "title": "Wellness Coach Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Services for the UnderServed (Brooklyn, NY) in Jan 2019", "Interview Descriptions": "The interview process was very easy. I came in for my interview but the interviewer forgot and didn't show up so I ended up getting interviewed over the phone and got the job offer at the end of the call.", "Interview Questions": "What experience do you have?"}, {"date": "4 Mar 2018", "title": "Residential Aide Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 6 weeks. I interviewed at Services for the UnderServed (Brooklyn, NY) in Oct 2017", "Interview Descriptions": "The interview was during a open House with 300 other interviewees.  The process was not organized and took more than two hours for me to sit down with a recruiter.  The recruiter advised me to call her the following Monday, which I did, she then told me I would be great for her company but she needed to find out which location she would be sending me to.  30 days after the interview she emailed me to come do another in-person interview at the location I would be working at.   I then interviewed with my then manager at that time I asked how much would I be compensated, which I was told that someone else has that answer.  I didn't find out my pay till I signed hiring papers the day before training, which was during holiday season so I took the offer.", "Interview Questions": "Do you volunteer, and If so where?"}, {"date": "6 Mar 2018", "title": "DSP Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Services for the UnderServed (Bronx, NY) in Jan 2017", "Interview Descriptions": "Good. The interview seem to care about me. The questions seem fair. Everybody seem very nice. No need for formal dressing. It takes a long time for background check. After the background check, the paperwork was fast. The HR department was very nice but can be disorganized.", "Interview Questions": "Why do you want to work for SUS?"}, {"date": "30 Apr 2020", "title": "Wellness Coach Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 4 weeks. I interviewed at Services for the UnderServed (New York, NY) in Oct 2016", "Interview Descriptions": "Had an interview with the hiring manager via phone, basic questions. Felt more like a business conversation, very straight to the point. No salary negotiation and they were oh offering 30,000 to someone with a degree.", "Interview Questions": "what kind of experience do you have?"}, {"date": "10 Aug 2016", "title": "Billing Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Services for the UnderServed (New York, NY) in Aug 2016", "Interview Descriptions": "Applied online, received a call 2 days later from Attah. Horrible phone skills, sounded intimidated to ask  for me or to arrange interview. He set interview for a Monday at 1:30 pm. When I arrived at 1:27 (slowwww eleavators)the Receptionist said he stepped out for food. She never even offered me a seat. I heard her leave a message telling him I was there, so I emailed him to let him know I didn't just get there. I waited ten minutes and he decided my time was not valued, why set an interview time and go to lunch??!! If I were late it would reflect poorly on me, this company is not the place for me with this type of lack of concern", "Interview Questions": "N/A"}, {"date": "31 Oct 2019", "title": "Case Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Services for the UnderServed (New York, NY) in Apr 2016", "Interview Descriptions": "Easy. My hire date was a little delayed but smooth otherwise.  have to get a tb test before starting. People are friendly and easy to talk to.", "Interview Questions": "Prior experience?"}, {"date": "13 Feb 2016", "title": "Recruiter Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 3 weeks. I interviewed at Services for the UnderServed (New York, NY) in Jan 2016", "Interview Descriptions": "I applied online and was contacted by Third Party staffing agency. I had a phone interview with the Third Party recruiter to go over the details of the position . Then I had a phone screen by HR supervisor , then 2 weeks later with C-level HR staff.", "Interview Questions": "If hired, what would be your top 3 priorities?"}, {"date": "18 Feb 2016", "title": "Asset Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Services for the UnderServed (New York, NY) in Dec 2015", "Interview Descriptions": "Met in person with SVP and was surprised to also be meeting with their \"talent acquisition\" person, which I was neither expecting nor prepared for.  I sent a thank you .... waited ... sent a follow-up a week or two later ... waited.  Nothing, not a thanks for coming, not a nothing. Ignored.", "Interview Questions": "Right out of handbook of being a HR-bot .... \"why do you want to work here\"   \"what is your management style\"  \"what can you bring to the company\"  etc, etc."}, {"date": "2 Nov 2015", "title": "Human Resources Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Services for the UnderServed", "Interview Descriptions": "I interviewed first with the Recruitment Manager, was nice and not too formal which made me feel more comfortable. After a fews days I was asked to come in for a 2nd interview, but this time I spoke with the HR Coordinator and HRIS Analyst. They asked a lot of situational questions as well as my experience. I was told that I would be contacted at least within 2 weeks. They even assured me again that they will get back to everyone, but.....there was no reply at all (I even followed up). Honestly, I understand if it was just the 1st interview, but after doing 2 interviews I expect at least an email. Unprofessional.", "Interview Questions": "How would you handle a situation where a client is being unresponsive?"}, {"date": "4 Nov 2015", "title": "Case Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Services for the UnderServed (Brooklyn, NY) in Oct 2015", "Interview Descriptions": "I received a phone call, it was a phone screening. I was asked to describe my daily functions as a Case Manager at my current place of employment. I explained the nature of my job, and the type of services that I provide. I explained how many times I am required to see the client once a month. I explained that there might be differences within the types of services because the job at SUS was a Case Manager in a shelter setting, their needs are a bit different.", "Interview Questions": "What type of services can i offer to the clients at SUS"}], [{"date": "23 Dec 2014", "title": "Case Manager Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Services for the UnderServed", "Interview Descriptions": "Very bland no true questions. Cared more about your ability to type rather than experience in the field of mental health. Program Director and Assistant Program director ask you questions about team orientation. The job is highlighted to the best of its ability, but is not worth the time if you are college educated.", "Interview Questions": "N/A"}, {"date": "27 Jan 2016", "title": "Wellness Coach Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 2 months. I interviewed at Services for the UnderServed (New York, NY) in Dec 2014", "Interview Descriptions": "Was interviewed by someone in H.R she was really nice. However interviewed with the director at the site where I would be working she actually told me she was hell on wheels when walking me out after the interview was over.", "Interview Questions": "They asked about everything that was on my resume. Two usual scenario questions.  "}, {"date": "1 May 2015", "title": "Wellness Coach Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 2 days. I interviewed at Services for the UnderServed (Brooklyn, NY) in Aug 2014", "Interview Descriptions": "Started as a Temp, assigned Supervisor told me salary would be negotiable when became permanent because I possessed more education than job description required, but after dedicating several months was told at hiring pay rate was fixed, and was always that way.", "Interview Questions": "Work experience with mental health population."}, {"date": "25 Dec 2016", "title": "Program Specialist Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at Services for the UnderServed (New York, NY) in Sept 2013", "Interview Descriptions": "Asked questions about the work ethics while providing services for the MR population and how long you been in this field the manager and assistant manager where the ones giving the interview", "Interview Questions": "Why do u want this job?"}, {"date": "19 Jul 2014", "title": "Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Services for the UnderServed (New York, NY) in Jan 2013", "Interview Descriptions": "Very professional HR system.  This is one of the best non-profits in NYC and the volume of people applying is staggering.  I was impressed with the way that they were able to manage the large numbers of people being added.", "Interview Questions": "Why did you leave your last job?"}]]