[[{"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": 3, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Good job in the non-profit sector", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "23 Feb 2023", "job_title": "Executive Assistant in Halifax, NS", "duration": "N/A", "pros": "Shelter Movers allows me to feel like I am contributing toward something, in this case, the prevention of gender-based violence, rather than just working to survive. It offers a lot of independence and flexibility, which is nice.", "cons": "Working entirely from home is sometimes isolating."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 3, "Diversity and Inclusion": 3, "Career Opportunities": 0, "Compensation and Benefits": 1, "Senior Management": 3, "review_title": "Amazing mission, burnout culture", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "1 Mar 2023", "job_title": "Anonymous Employee in Toronto, ON", "duration": "N/A", "pros": "- Excellent mission so you feel like you're really making a difference - Attracts empathetic, hard-working, intelligent people - Likely to promote from within so there could be room to grow - Part-time contracts may provide flexible work hours - Many positions are fully remote - The folks who work/volunteer for Shelter Movers are filled with amazing ideas", "cons": "Cons specific to the marketing department: - Unmanageable deadlines and expectations - Due to high demand for the services, rapid growth, and limited budget the department lacked structure and was disorganized. - The marketing department's job is to translate the organization's goals into communications that can be quantitatively or qualitatively analyzed to judge success. The organization lacked clear strategic goals which made it difficult to determine how to invest marketing resources, or to measure how marketing contributed to the overall success of the organization. ---------- Cons regarding the entire organization: - The executive director is difficult to work with, so there's a high degree of turnover in management positions. - A high degree of turnover meant that it was difficult to make meaningful long-term progress. - Concerns about burnout were raised repeatedly but the problem was not addressed. - It was very difficult to establish work/life boundaries because meetings needed to accommodate different time zones and schedules. There was also an expectation that paid employees volunteer during their off hours, which further blurred the line between work/life. - Lack of training opportunities - No formal performance evaluations to identify strengths/weaknesses - Budgets are based on fundraising and grants, which means that there are no guarantees of ever being promoted or transitioning from part-time to full-time employment."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Great Team", "rating": "5.0", "reviewer_affiliation": "Former Freelancer, less than 1 year", "job_date": "23 Sept 2021", "job_title": "Anonymous Freelancer in Ottawa, ON", "duration": "N/A", "pros": "Nothing but great things to say about this team and their goals.", "cons": "It's very professional for volunteer work.\nNo cons."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": 4, "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 5, "review_title": "Its good", "rating": "4.0", "reviewer_affiliation": "Current Contractor", "job_date": "28 Jan 2021", "job_title": "Police Officer in Halifax, NS", "duration": "N/A", "pros": "Flexible, it is a remote position, good people", "cons": "it is a new organization so there are a lot of hiccups at times"}]]