[[{"date": "19 Feb 2022", "title": "Senior Accountant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 1 week. I interviewed at Local Government Commission", "Interview Descriptions": "The interview was a pleasurable experience.  The conversation was great and I learned a lot about the organization and what their expectations are.  The CFO was honest about what they expect for this position. She asked mostly about my experience and behavioral questions.", "Interview Questions": "How would you manage a diverse group of people? "}, {"date": "21 Jan 2021", "title": "Climate Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Local Government Commission", "Interview Descriptions": "1 Phone interview (straightforward, screening interview), 1 video call (~30-minutes). They really just want you to be interested in climate policy and environmental justice, so call that out in the interview.", "Interview Questions": "What are your professional goals?"}, {"date": "26 Feb 2019", "title": "Senior Project Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Local Government Commission (Sacramento, CA) in Jan 2019", "Interview Descriptions": "The interview was conducted virtually with two individuals. The interview lasted approximately an hour. After this virtual interview I was offered a second in-person interview where I was told I would interview with additional people, complete an exercise where I respond to scenarios that a person in the position would face, and make a presentation. I prepared a presentation and sent it in prior to the interview as requested. They then canceled my interview because apparently their board restructured the department and was eliminating the position. I feel as though they should have been upfront about this in the initial interview. I could have saved my time as I would have declined the second interview if there was uncertainty with the position/organization.", "Interview Questions": "Questions were related to the functions of the job (i.e. what is your experience with managing staff?\")."}, {"date": "15 Aug 2016", "title": "CivicSpark AmeriCorps Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Local Government Commission in Aug 2015", "Interview Descriptions": "The first step is a screening interview by phone, followed by a more in-depth interview. Once you pass that step, you will have the opportunity to interview with a CivicSpark regional coordinator and a project partner.", "Interview Questions": "Fairly general questions about yourself and your experiences. I did not get any technical questions."}], [], [], []]