[[{"date": "21 Nov 2021", "title": "Associate Dean Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Dickinson College", "Interview Descriptions": "Behavioral. Lots of questions about how I have handled or would handle typical situations related to student affairs/student support. Some specialized questions related to position. Understanding of mission and values important.", "Interview Questions": "Tell me about a time when you worked across difference."}, {"date": "25 Jun 2021", "title": "Assistant Professor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Dickinson College", "Interview Descriptions": "The interview was very well organized. The interviews were very knowledgeable. The interview was online because of the COVID-19 Pandemic. The interview started on time. They asked questions about my research and teaching.", "Interview Questions": "Tell us about your research. What courses have you taught? What courses would you like to teach? Do you have any questions for us? "}, {"date": "5 Aug 2022", "title": "Athletics Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Dickinson College in Feb 2020", "Interview Descriptions": "Met with various coaches, admissions, and other campus representatives as well as current student athletes. Day was well organized, itinerary was sent late but was not a problem. Also received campus tour", "Interview Questions": "Why are you the right person for this position "}, {"date": "16 May 2019", "title": "Phonathon Caller Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Dickinson College", "Interview Descriptions": "The process was short. I worked on a phone interview and an in person one. After I was interviewed on the phone they asked me to come in for the in person interview. The following year I was able to get the job again without an additional interview.", "Interview Questions": "How comfortable do you feel taking on the phone? "}, {"date": "8 Jun 2020", "title": "Assistant Basketball Coach Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Dickinson College (Carlisle, PA) in Jul 2018", "Interview Descriptions": "Campus tour, meeting with athletic department senior staff, and with direct boss. Lunch at one of the restaurants in Carlisle. Meetings with HR and team being coached if students are on campus.", "Interview Questions": "What do you want from this position?"}, {"date": "12 Nov 2017", "title": "Tour Guide Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Dickinson College (Carlisle, PA)", "Interview Descriptions": "It was great. They are curious about what you do on campus, and want to see your personality. If you do something unique on campus, that's great. The process is pretty simple. You talk to two people, and they are usually really nice.", "Interview Questions": "What are your strengths?"}, {"date": "8 Apr 2018", "title": "Fundraiser Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Dickinson College (Carlisle, PA) in Feb 2017", "Interview Descriptions": "The interview process was very chill. People are very nice. They know I'm a student so they are very considerate and helpful. I did an one on one interview with the director and she was friendly.", "Interview Questions": "How did you deal with a multi-task situation>"}, {"date": "28 Dec 2017", "title": "Campus Recreation Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Dickinson College (Carlisle, PA) in Sept 2015", "Interview Descriptions": "The interview was extremely short and lacking in intuitive questions. They were generic and based more on leadership qualities than logistic qualifications.  The interviewer had just started at the college and was uneducated in the logistics and details of the program.", "Interview Questions": "State a conflict that you faced in a leadership position. How did you resolve it? "}, {"date": "26 Jul 2016", "title": "Community Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Dickinson College (Carlisle, PA) in Mar 2015", "Interview Descriptions": "It was very straightforward based on the application requirements. Preparing and studying the case studies was helpful. Focusing on everything known about residence life based on the Resident Advisor position was helpful.", "Interview Questions": "What do you hope to get out of this job?"}, {"date": "24 Apr 2014", "title": "Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Dickinson College (Carlisle, PA) in Aug 2012", "Interview Descriptions": "Applied online and heard back within two weeks. First one of the faculty called me for an interview and was extremely friendly and was a very casual interview about my CV. Then, I received an e-mail that they wanted to interview me. They paid for my flight and hotel, and I met with most of the faculty and staff I would be working with. The interview was very relaxed and asked basic questions and it was more geared towards what my jobs and responsibilities were. I got along with everyone and they were very cordial. Overall, an excellent interview process. I received a call a few days later saying I got the job", "Interview Questions": "Describe a situation where you had to overcome an obstacle or problem during your duties "}], [{"date": "23 Oct 2015", "title": "Resident Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1+ week. I interviewed at Dickinson College (Carlisle, PA) in Apr 2012", "Interview Descriptions": "I participated both in a group interview with my peers, and then individual interview with someone higher up in the Office of Residence Life. In the individual interview was a HAM (Housing and Apartments Manager) which was a upperclass student who had worked in campus life for over two years.", "Interview Questions": "In what way do you think you will be able to create a sense of community with your residents?"}, {"date": "16 Oct 2014", "title": "Orientation Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Dickinson College (Carlisle, PA) in May 2011", "Interview Descriptions": "There were a lot of applicants for this position. Apparently, students of Dickinson College enjoy working as an Orientation Assistant it seems. However, I am glad that I did not receive this position as it would conflict my vacation plans as well. The interview questions were not that difficult. Mostly behavioral questions.", "Interview Questions": "Pick an object from this room and say why it seemed important to you."}, {"date": "17 Nov 2012", "title": "Visiting Assistant Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 4 weeks. I interviewed at Dickinson College (Carlisle, PA) in May 2008", "Interview Descriptions": "Faculty apply to a Department in which they are qualified to teach. If the hiring committee like your application and you bring the expertise required at the time, a small group call you on the phone. If you do well on the phone you may be one of the 3 or 5 invited on campus for a day or two of interviews. Generally, you meet with faculty, administrators and students majoring in your area of expertise. You also \"teach\" a class so that the hiring committee can get a sense for your teaching style and command of the subject area.", "Interview Questions": "N/A"}]]