[[{"date": "20 Jul 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at HCA Houston Healthcare Kingwood (Houston, TX) in Jul 2022", "Interview Descriptions": "It was very convincing and straight forward, and the Nurse manager looks happy to interview me for this position. I had the opportunity of having the interview virtually and you will be placed in a breakout room with the Nurse manager of the unit you are applying to.", "Interview Questions": "Why I wanted to choose the unit that I picked"}, {"date": "21 Dec 2021", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at HCA Houston Healthcare Kingwood", "Interview Descriptions": "Quick, easy, friendly. Nursing director was very nice, made it feel more like a genuine conversation to get to know me instead of an actual interview. Answered my questions about the job honestly and openly.", "Interview Questions": "Where do you see your career going in the future?"}, {"date": "17 Oct 2019", "title": "PACU RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at HCA Houston Healthcare Kingwood", "Interview Descriptions": "Very smooth and easy. Interviewers very friendly and engaging. I felt like they asked clear questions that also gave me a picture of how it may be like working for this company.", "Interview Questions": "If you are in a situation where you are by yourself can would you feel comfortable in an emergency situation?"}, {"date": "12 May 2018", "title": "ICU RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at HCA Houston Healthcare Kingwood", "Interview Descriptions": "it was fairly simple but they knew what they were looking for, it was specialized I dont know what else to say i am just filling in the required space", "Interview Questions": "typical stuff"}, {"date": "24 Nov 2015", "title": "Pharmacy Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at HCA Houston Healthcare Kingwood in Nov 2015", "Interview Descriptions": "I completed my internship here for school. As I was getting my paperwork filled out by the manager, I was asked about my strengths and weaknesses. That was the only type of interview question that was asked. The rest was information about schedules and shift times. Since I was already a temporary part of the team for about 6 weeks, I had an advantage over other applicants because everyone was able to see my work ethic.", "Interview Questions": "Strengths and weaknesses"}, {"date": "20 Oct 2015", "title": "Registrar Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I applied online. The process took 8 weeks. I interviewed at HCA Houston Healthcare Kingwood", "Interview Descriptions": "Submitted an application online then was called in for a group interview a few months later. Other candidates that were called included a few current employees, which made me feel a bit like the decision may have already been made prior to showing up. There were 10 spots available and various locations and only about 7 people (including myself) showed up for the interview. The director and manager of patient services did an overview of the company and job description. They also expressed how they wanted to change the image of the facility but discovered the only way for that to become possible was to change the people who work there (not in those exact words). The director did most of the talking while the manager barely looked up at anyone. The environment was pretty relaxing and not intimidating at all. After the review of the company was completed the two divided the resumes amongst each other and did two interviews at a time. I was interviewed at the same time as a current employee, but her resume was taken by the director and mine by the manager. I thought the interview went really well. My answers were on point and sincere but at the end she basically made it clear that I wasn't going to be called. I thanked her for the interview and said I looked forward to hearing from them and she responded with \"uh, well....I don't know\". I pretty much knew I wasn't going to get called even after sending a follow up email and calling both parties, which none of my attempts were successful. I was really hoping to be picked considering I have two degrees in healthcare administration and business, but I lack actual experience in a healthcare facility.", "Interview Questions": "Basic interview questions asked to identify personality, work, and ethical traits. Nothing difficult at all."}, {"date": "9 Nov 2015", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at HCA Houston Healthcare Kingwood (Kingwood, TX) in Mar 2015", "Interview Descriptions": "Initial interview online by cideo conference. 2nd interview with charge nurse. Nice interview, more about yourself and getting to know you. And asked if I had any questions. The director and managers were both there. And they were all so friendly and nice.", "Interview Questions": "They wanted to know more about you than asking questions."}, {"date": "7 Feb 2018", "title": "Respiratory Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at HCA Houston Healthcare Kingwood (Kingwood, TX) in Oct 2014", "Interview Descriptions": "You meet with director and manager. Them you do a peer interview where a couple of other coworkers ask you questions then they tell their opinion to director and manager.", "Interview Questions": "What would you do if you don’t agree with your supervisor?"}, {"date": "5 Apr 2013", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at HCA Houston Healthcare Kingwood in Apr 2012", "Interview Descriptions": "Very professional & courteous. Process was streamlined.", "Interview Questions": "Interview questions about how I handled certain patient situations or physican/nurse conflicts in the past. It was difficult to remember on the spot."}, {"date": "31 Aug 2015", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at HCA Houston Healthcare Kingwood (Columbus, OH) in Mar 2012", "Interview Descriptions": "I completed an application for the job. A recruiter reached me by a working phone number I had provided in my application. I honored an interview as scheduled. The the interview was short but tailored towards my job description. It was interesting an insightful for both of us.", "Interview Questions": "Safety measures to prevent fall."}], [{"date": "13 Oct 2011", "title": "Nurse Tech Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at HCA Houston Healthcare Kingwood (Kingwood, TX) in Jul 2009", "Interview Descriptions": "I submitted an online application at the request of the human resources department. They said they would call me. I waited a few days and called them because they never called. I got an interview set up. At the interview They asked me several hypothetical questions about different scenarios to see how I would handle them. They did an extensive background check and drug testing. All together it took about one month to begin work.", "Interview Questions": "What was something innovative that you contributed to the last company you worked for?"}]]