[[{"date": "30 Jun 2022", "title": "Marketing Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Berkeley College", "Interview Descriptions": "Interview was  a very positive experience. I met a lot of nice people and the questions were easy since I had prepared. It was a company I would have liked to work for.", "Interview Questions": "Where do you see yourself in 3 years?"}, {"date": "19 Mar 2022", "title": "Financial Aid Administrator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Berkeley College (New York, NY) in Jan 2022", "Interview Descriptions": "Screening over the phone one day after applying for a position online. Set up an interview over Zoom, which was scheduled five days later. Panel interview with your potential supervisors.  Review of your resume and requirements for the position.", "Interview Questions": "1) What do you know about Berkeley College?\n2) Why would you like to work for Berkeley College?\n3) Do you prefer working independently or as a part of a team?\n4) Would you rather work remotely or in-office settings?"}, {"date": "13 Feb 2021", "title": "Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Berkeley College", "Interview Descriptions": "In person interview; review of published documents/articles; discussed approach to teaching diverse student body.  Very congenial - interviewer provided syllabus for course offered and contact information of faculty member currently teaching course. Received a position shortly after interview.", "Interview Questions": "Past and current experience discussed; approach to education"}, {"date": "20 Nov 2020", "title": "Administrative Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Berkeley College", "Interview Descriptions": "They had brought me in sat me down and staring to ask a few questions. Once they asked a few questions I got the call back to begin working for the institution", "Interview Questions": "Why do you want this job"}, {"date": "21 Apr 2019", "title": "Student Affairs Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Berkeley College", "Interview Descriptions": "Fairly easy. Everyone was very nice. The committee provides diverse experiences, therefore, you could connect with people on different levels. There was one phone interview, a committee and then a campus tour.", "Interview Questions": "Student development theory and knowledge of student populations."}, {"date": "24 May 2018", "title": "Financial Aid Advisor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Berkeley College", "Interview Descriptions": "Not too in depth seems like they just wanted to replace a previous employee asked me about why i think I was a good candidate and just like that i was hired, I should have took this as a sign.", "Interview Questions": "Why are you a good candidate? "}, {"date": "17 Jan 2018", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Berkeley College (Woodland Park, NJ)", "Interview Descriptions": "The process is very easy. They are helpful with their students. I felt very comfortable and did very minimal preparation. It is important to have general knowledge about Berkeley and its resources.", "Interview Questions": "What resources are available on campus and do you know where it is located on campus?"}, {"date": "23 Apr 2021", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Berkeley College (Newark, NJ) in Sept 2017", "Interview Descriptions": "Sent in my resume and was called for an in person interview with director. Only met with the director and then I was offered the position at which time I had to fill out the application to have on record.", "Interview Questions": "Are you OK with working some nights and Saturdays?"}, {"date": "23 Aug 2021", "title": "Desktop Support Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Berkeley College (New York, NY) in Aug 2017", "Interview Descriptions": "I got ask about two IT question before the interview started. Once the interview started I got begin my 60 second pitch on background to IT and why do I believe I am a great fit. Wait for the question to be asked before speaking of course.", "Interview Questions": "Q: Why did you choose this position? "}, {"date": "9 Jun 2017", "title": "Admissions Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Berkeley College", "Interview Descriptions": "I applied and was recommended by a Director to the Director of Admissions. I applied and got the recommendation the same. I got a call the same day by the director of that department asking a couple of questions and sent me an assessment. I had only 3 days to take the test since they were hiring quickly. I got a call to schedule a phone interview for the next day. Did the phone interview and was invited to interview face to face with another director the next day. The interview didn't feel like an interview it was more like having a conversations and the questions weren't as hard questions. The questions were not tricky at all. Just more like getting to know you and if you match the requirements in personality and skills. It helped a lot that I'm a Berkeley College Alumni as well so I have great knowledge on the college. The interview took an hour. Got an offer the same day that after noon!", "Interview Questions": "Give me three reasons why a student should go to Berkeley College"}], [{"date": "22 May 2019", "title": "Peer Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Berkeley College (Woodland Park, NJ) in Feb 2017", "Interview Descriptions": "The interview process was fairly simple:\r\nReceived an email and a phone call from the director of the Center for Academic Success about the time and the location of the interview.  \r\nI was interviewed by two directors of the Center for Academic Success in separate interviews.", "Interview Questions": "Why do you want to be a tutor?\r\nExplain how you get good grades?"}, {"date": "8 Aug 2017", "title": "Communications Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Berkeley College (New York, NY) in Feb 2017", "Interview Descriptions": "It was great, they're were extremely nice people. everyone was friendly. I had the best time interviewing for this company and I hope that everything works out. The environment was humble and the community was everything I would want in a company.", "Interview Questions": "what do you like?"}, {"date": "5 Oct 2016", "title": "Student Accounts Administrator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Berkeley College (Paramus, NJ)", "Interview Descriptions": "Phone screening, folllowed by 30 minute interview. Basic interview. Had to do a lot of the talking and question asking, but it was a pleasant experience and good atmosphere. Was interviewed by 2 people.", "Interview Questions": "Future goals? Strengths and weaknesses? Are you a multitasker/team player?"}, {"date": "25 Aug 2016", "title": "Academic Advisor Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Berkeley College (Newark, NJ)", "Interview Descriptions": "I was contacted to schedule a phone interview. Another member of their team contacted me and asked me to come for an in-person interview before the date of the phone interview.", "Interview Questions": "One question: Why did I want to work as an academic advisor? The next 40 minutes of the interview was spent explaining their hiring and advising department vision. They explained they were onboarding quickly and might not be able to provide finalists with the opportunity to give 2 weeks notice to their employers due to a hard start deadline and the volume of interviews they were conducting before beginning offers. They asked if I had questions. I asked 4, and they thanked me for my time and said they would be in touch. I was confused because it seemed like more of an information session about Berkeley than an interview. I am used to this kind of step occurring by phone before an in-person interview. Just as I was leaving they decided to check in on salary, which was not negotiable and was below market compared to what other schools offer in the metro NY area. I decided not to continue the interview process."}, {"date": "12 Sept 2016", "title": "Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Berkeley College (Newark, NJ) in Jun 2016", "Interview Descriptions": "The process was easy. I was asked basic questions. We had a great conversation. We began on time. I gave a sample lesson. The interview began as a phone interview. I was called within a week to do a second interview.", "Interview Questions": "What is your philosophy of teaching?"}, {"date": "29 Apr 2016", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 days. I interviewed at Berkeley College (Paramus, NJ) in Apr 2016", "Interview Descriptions": "I was referred to the job by Berkeley college career services. The whole process took about a week from the referral, and three days from the interview to be extended an offer. \r\nIt was a very casual, easy going interview, straight to the point. \r\nThe interview was done by the Dean and the Assistant Dean, but only the Dean asked questions and inquired further regarding my experience and how could I benefit the school and students with my background.", "Interview Questions": "They asked me why I wanted to work at Berkeley College, and how was my prior experience related to the job. Another thing they asked, was how could I resolve a student issue and how I would handle conflict. They also asked me how soon could I start working if an offer was made."}, {"date": "12 Mar 2016", "title": "Student Accounts Administrative Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Berkeley College (Clifton, NJ) in Mar 2016", "Interview Descriptions": "Conference room setting. Sat with associate director (who did not speak) and one other person who did not reveal her title. The interview was relatively quick. They had a list of generic questions from online and then opened the floor for me to talk. They were super friendly but it was hard to gauge what they wanted from a candidate.", "Interview Questions": "Would you rather miss a deadline and deliver perfect work OR hand in mediocre work on time?"}, {"date": "14 Sept 2015", "title": "Adjuct Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Berkeley College (Woodland Park, NJ)", "Interview Descriptions": "Was contacted about a week or so after applying through the college website by a very nice woman. She emailed me and asked me to come in for an interview at the Woodland Park location. She was very friendly and gave me a tour of the campus, which was 2 buildings because construction was still being done on the 3rd building. \r\n\r\nThe interview lasted about an hour and was very casual and more discussion based rather than bombarding me with questions. I was offered the position and would have loved to accept it, but they only offered me one class a week which turned out to be $200 weekly. Economically, it didn't make sense for me because I would have needed to work full-time on top of that and the class was only offered twice a week during the middle of the day.", "Interview Questions": "Is $50/ hour good for you? Because it is a deal breaker for many people..."}, {"date": "1 Aug 2015", "title": "Admissions Counselor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at Berkeley College (New York, NY)", "Interview Descriptions": "Mercer exam required, More of who you know rather than what you know, Interview is quick- they want to know that you can sell...Meet with two Directors of Admission and one Associate Vice President", "Interview Questions": "Why do you want to work at Berkeley College"}, {"date": "23 May 2016", "title": "Student Accounts Administrator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Berkeley College (New York, NY) in Jun 2015", "Interview Descriptions": "Interview with COO and Director of Student Accounts. They each ask you questions. Then the Director gives you a tour of the Student Accounts Department. After that they told me that they will give me a call because they are interviewing others candidates.", "Interview Questions": "They ask if you're; customer services oriented, flexible with hours, how do you deal with students, tell me about yourself, How do you handle a difficult situation or student or parent"}], [{"date": "23 Mar 2015", "title": "Student Accounts Administrator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Berkeley College (Paterson, NJ) in Mar 2015", "Interview Descriptions": "Applied online and 2 weeks later received a phone call to schedule an interview. The interview was very general and not many questioned where asked in terms of my skills and previous experience. I felt I was doing the interview and was asking all the questions. Also, I was not told that I would be interviewing with more than one person at a time.", "Interview Questions": "Not many questions where asked of me. Most of the interview was just informing me of the positions responsibilities and explained their company benefits."}, {"date": "21 Jan 2015", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Berkeley College", "Interview Descriptions": "Applied through their online platform. Got an invitation for an interview via email. The position require an individual with ability to learn new software quickly and adapt to seasonal demanding work schedules. \r\n\r\nMy first interview was with the gentleman who was to become my supervisor-Research Analyst. He asked me first open ended questions such as; tell me about your skills and experience in spreadsheet programs.\r\n\r\nMy second interview-on the same day- was by the head of department (the previous interviewer was in the room too). He also asked specific question on my knowledge in using pivot tables. He also asked about my office administration skills. He asked what my academic plans were and if this position was aligned to them.", "Interview Questions": "Have you ever used your excel knowledge to model a solution in a real world problem."}, {"date": "7 Jun 2015", "title": "Nurse Educator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at Berkeley College (Clifton, NJ) in Jun 2014", "Interview Descriptions": "Short but thorough, was asked about my experience and my expectations.  Discussed growth opportunities and potential changes to the programs at the University.  Discussed opportunities for project and program development as well as making the transition from bedside nursing to academia", "Interview Questions": "How did I hear about the job"}, {"date": "23 Jul 2014", "title": "Senior Management Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. I interviewed at Berkeley College (Woodland Park, NJ) in Jun 2014", "Interview Descriptions": "The whole process was a HUGE waste of time. A staffing working on behalf of Berkeley called me for a position, after 2 interviews and 4 weeks of wasted time they went out on there own and offered the position to someone else.", "Interview Questions": "None really, just a big waste of time dealing with a bunch idiots who should have realized that there is  finders fee for trying to get you the best candidate/"}, {"date": "13 Jan 2014", "title": "Department Director Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 4 days. I interviewed at Berkeley College (New York, NY)", "Interview Descriptions": "I was called the day after I applied for the job and hired 3 days later.  No background check or reference check.  It was unprofessional, never got a campus tour, the interview was about an hour and it was a Director level position.  I never had orientation or training.  It was sink or swim from day one.", "Interview Questions": "the interview was simple, no hard questions, it lack professionalism because of the lack of questions that should have been asked considering the seriousness of the position.  I learned that a Director position is really a entry level position that anyone can attain.  Unfortunately, I learned that after I started working there.  "}, {"date": "25 Nov 2015", "title": "Student Aide Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Berkeley College (New York, NY) in Jan 2014", "Interview Descriptions": "This part was easy and fair. They gave me the floor where i chose to speak about my previous work ethics and capabilities for this position. I was satisfied. The interview was done with two people in a room, plus myself. They made me feel very comfortable.", "Interview Questions": "Where do you see yourself in five years?"}, {"date": "19 Nov 2013", "title": "Anonymous Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Berkeley College", "Interview Descriptions": "Interviews are easy, just research the company before the interview", "Interview Questions": "Tell me something about yourself - Difficult question if you do not know the right words"}, {"date": "2 Dec 2015", "title": "Presenter/High School and Community Outreach Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Berkeley College (Woodland Park, NJ) in Aug 2013", "Interview Descriptions": "Long process- 3-4 steps, phone interview with HR, online test (one hour or so), in-person interview with an office coordinator, then interview with VP of department. I had to practice a presentation that was given to me and return to present it to the VP before being offered the position.", "Interview Questions": "How would you handle a difficult class/ classroom management when a teacher is unavailable or not helpful?"}, {"date": "11 Nov 2016", "title": "Student Aide Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 days. I interviewed at Berkeley College (New York, NY) in Aug 2013", "Interview Descriptions": "Admissions representative told me about the job. I applied three days later was contacted for the job and was hired.Staff was professional and welcoming. They didn't ask me any alarming questions. They said that they would contact me if I were chosen and within a matter of days, I receieved an email with all of the steps that I needed to do.", "Interview Questions": "Where do you see yourself in five years?\r\nAre you a quick learner?\r\nCan you answer the phones professionally and be on time?"}, {"date": "23 Nov 2015", "title": "Adjunct Lecturer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Berkeley College (New York, NY) in Feb 2013", "Interview Descriptions": "Interview was great - knew what he was looking for and said I was it. No bush beating, showed me around campus, asked a few questions about my past experience and offered me the job. No frills.", "Interview Questions": "What do you have to bring to the classroom that other teachers don't?"}], [{"date": "20 Nov 2013", "title": "Professor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 3 months. I interviewed at Berkeley College (White Plains, NY) in Aug 2012", "Interview Descriptions": "Fine", "Interview Questions": "Why did you leave prior position."}, {"date": "23 Aug 2016", "title": "College Librarian Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 6 days. I interviewed at Berkeley College (New York, NY) in Aug 2012", "Interview Descriptions": "Very Good and Professional I filled out some important documents and did some reading on the computer with some rules and regulations for the job assignment. I worked on the computer and I had to read rules of the job. Including Sexual Harassment, Discipline, courtesy, respect and arriving on time to work. Dress appearance and Hygiene is important for the job.", "Interview Questions": "How many hours can I work each day. Excluding the weekends"}, {"date": "17 Apr 2015", "title": "Admissions Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Berkeley College (New York, NY) in Feb 2012", "Interview Descriptions": "The VP of Admissions called me in. I met with her then the Director of Admissions and the rest of the team the same day and was hired on the spot.", "Interview Questions": "personality questions How would you handle a difficult student?"}, {"date": "22 Jan 2012", "title": "Instructional Designer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 1 day. I interviewed at Berkeley College (Clifton, NJ) in Jan 2012", "Interview Descriptions": "I was told about an internal opening for instructional designer, so I emailed my resume to the head of the department and he liked it so he emailed me about an interview.  We sat down for a half hour or so and talked about the different aspects of instructional design.  He was big on team work, teaching pedagogy, consistency and organization.", "Interview Questions": "Are you a valuable member to a team?  why?"}, {"date": "10 Aug 2013", "title": "International Admissions Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Berkeley College (New York, NY) in Aug 2011", "Interview Descriptions": "Knew the contact person on the job posting and had an interview scheduled quickly. Didn't ask me any questions normal for an interview and said I basically had already done this job in my past position so I was clearly qualified, but did ask lots of questions about my past employer, and told me I was top of the list for the job at the end of the interview. Interviewer's supervisor called for a phone interview next day and indicated they would hire someone else due to that person's special skills. But then the following day they both called on conference to offer me the position.", "Interview Questions": "N/A"}, {"date": "11 Jan 2014", "title": "Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. The process took 3 months. I interviewed at Berkeley College (New York, NY) in Mar 2010", "Interview Descriptions": "Apply online to their website for open positions.  There was a meeting with the Dean, Chirs, faculty and students.", "Interview Questions": "N/A"}]]