[[{"date": "22 Aug 2022", "title": "Program Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Providence Health Care", "Interview Descriptions": "About 3 weeks.  Phone interview with HR, interview on Teams with a panel. Was ghosted after, which was a bummer. They still have the job posting up even though I applied in January", "Interview Questions": "What do you know about Foundry"}, {"date": "5 Aug 2022", "title": "HR- Consultant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at Providence Health Care (Vancouver, BC) in Jun 2022", "Interview Descriptions": "I asked how the manager and the company sets employees up for success and they said they didn't understand the question which was a red flag for me.  They were also very vague when I asked them what their team culture was like. I never received a response back from HR or the hiring manager after the interview and I don't think any of the 3 interviewers cracked a smile once.  Maybe it's different in other areas of the organization but I didn't get a very good impression of it based on this experience.", "Interview Questions": "What are some of the challenges you would see facing health care organizations today?"}, {"date": "31 May 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Providence Health Care", "Interview Descriptions": "Received a phone screening, then an in person interview with the hiring manager and two of the education coordinators. Approximately one week later, the hiring manager called to offer me the position.", "Interview Questions": "Describe a time when you were in a stressful situation and how you reacted. "}, {"date": "30 Apr 2022", "title": "Clinical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Providence Health Care in Apr 2022", "Interview Descriptions": "Human Resources conducted a phone interview and forwarded my CV to clinic leaders who connected with me to set up a virtual interview. After the virtual interview, the leader followed up with a phone call for some further questions and decided to proceed with references.", "Interview Questions": "How do your previous experiences helpful for this position?"}, {"date": "11 Jan 2022", "title": "Clinical Support Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Providence Health Care", "Interview Descriptions": "Applied and got a call a few days later, followed by  one screening interview, one zoom interview with clinical coordinator and patient care coordinator. Was offered a shadow shift at the  clinic before accepting the offer.", "Interview Questions": "Tell me about a time where you had to collaborate with another team member?"}, {"date": "30 Dec 2021", "title": "Clerk IV Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Providence Health Care", "Interview Descriptions": "I got a call from the registration manager at a specific hospital. She went over the needs of the hospital and what department needed coverage at certain time as I was applying for a casual position. After the interview i was required to pass some testing like medical terminology and typing", "Interview Questions": "How would you deal with a violent patient?"}, {"date": "24 Feb 2023", "title": "Project Management Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Providence Health Care (Vancouver, BC) in Aug 2021", "Interview Descriptions": "Took several weeks for hiring process if not a referral. Interviewed several times by different hr. Hiring teams are very kind with answering different questions. Overall drawn out process but enjoyable.", "Interview Questions": "What is one of your weaknesses?"}, {"date": "19 Jul 2021", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Providence Health Care", "Interview Descriptions": "I applied online to become a volunteer at the Richmond Dialysis Unit and received an email for a quick phone interview.  The phone interview was simple and comfortable, done by the volunteer coordinator. She was very friendly.", "Interview Questions": "What are your past experiences?"}, {"date": "17 Mar 2020", "title": "CST Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Providence Health Care (Vancouver, BC) in Jul 2019", "Interview Descriptions": "One in-person interview, basic questions, about 15-20 minutes. The interview was with a group of 3 people from the team I was assigned to. Questions were based around research skills.", "Interview Questions": "Greatest weakness/strength "}, {"date": "21 Jan 2023", "title": "Clerk Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Providence Health Care (Vancouver, BC) in Jan 2019", "Interview Descriptions": "2 interviews by a supervisor and a manager. HR also contacted me and did a background check.. There was also a typing test and a medical abbreviation test that needed a 70% pass.", "Interview Questions": "What is something you have gone out of your way to do at your job?"}], [{"date": "4 Nov 2016", "title": "Licensed Practical Nurse (LPN) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Providence Health Care (Vancouver, BC) in Oct 2016", "Interview Descriptions": "The hiring process seems to be a long process. I originally applied with the company online. I was contacted a couple of weeks after via e-mail to set up a phone screening with a recruiter. Once finished the screening process, the recruiter informed me that they will pass my resume on to the unit manager, and it could take 4-6 weeks before the manager gets back to me.\r\nThe unit manager followed up within the allotted time frame, and requested to set up an interview.", "Interview Questions": "Phone Screening: Why do you want to work for this company?"}, {"date": "12 Dec 2016", "title": "Analyst, Human Resources Systems & Data Quality Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Providence Health Care (Vancouver, BC) in Sept 2016", "Interview Descriptions": "They did not ever get back to me as to whether I was still a candidate or not. I asked them several times for an answer as to whether I was still\r\nUnder consideration as a candidate, but I have had no response from\r\nThe HR team. I have now given up\r\nOn asking them what my interview outcome was and I have moved on to other opportunities. It's too bad because I was very interested and qualified to work with them.", "Interview Questions": "Tell us about yourself"}, {"date": "4 Sept 2015", "title": "Rehab Care Attendant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Providence Health Care (Vancouver, BC) in Mar 2015", "Interview Descriptions": "They are professional and organized. They are considerate and flexible with the applicant's availability. It doesn't matter what school the applicants' are from as long as they reached the required amount of experience and knowledge combined.", "Interview Questions": "What you think you can do their (resident&#039;s) life?"}, {"date": "13 Nov 2018", "title": "Medical Office Assistant Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Providence Health Care (Vancouver, BC) in Oct 2014", "Interview Descriptions": "I applied for a position in August less than 24 hours after the job was posted on the Providence Health website. It stated that an MOA was needed to start ASAP.\r\n\r\nIt wasn't until October when I received an e-mail requesting an interview, so I agreed. The phone interview with an HR person was okay; the interviewer did not know very much about the job except what was on the job posting so he wasn't able to answer anything. However, he asked me if I could meet the hiring managers in a week.\r\n\r\nA week later, my in-person interview went fine; the hiring manager and physician answered all of my questions and asked me pre-planned interview questions off a sheet of paper. They didn't seem particularly enthusiastic, but I figured what the heck it's a very busy hospital and they probably have a zillion things to do anyways. To finish the interview, I was given a medical transcription test.\r\n\r\nTwo weeks later the HR person who conducted the phone interview emailed me asking for references; I supplied three from a previous company. He then responded saying he needed a reference from my current job. I responded back honestly that my current supervisor has a history of treating staff badly when she knows they are looking for another job, and that if I did not get the position at St. Paul's Hospital then my relationship with my current supervisor would be jeopardized. He also asked me if I could start ASAP, but I said I would need to give 2 weeks' notice.\r\n\r\nThe HR guy called me to ask \"Didn't you read the posting when it said we need somebody ASAP\" and in an accusatory tone, he said \"You're obviously lying about your current boss and you're obviously hiding something.\"\r\n\r\nYes, they needed someone ASAP so bad they waited 2-3 months to call me for an interview, and don't care about job applicants wanting to be professional and courteous to their current employers.\r\n\r\nI told the HR guy again that I was not willing to burn the bridges with my current company by quitting without notice and that once again, I did not want to risk the working relationship with my current boss, so if he really wanted my current supervisor as a reference then withdraw my candidacy.\r\n\r\nI never heard from HR again.\r\n\r\nThe disrespect that HR guy showed and him demanding I behave unprofessionally in my current job was not acceptable. I consider it a bullet dodged.", "Interview Questions": "Why should we hire you?"}, {"date": "13 Sept 2015", "title": "Financial Analyst Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Providence Health Care (Vancouver, BC) in Jan 2014", "Interview Descriptions": "One phone interview, with two interviewers. It was fairly informal and did not appear to have a set script. I was later contacted about references, etc, which was a bit confusing as they did not indicate I had been the successful candidate at that point, only that there was a reference check.", "Interview Questions": "They asked me about my experience with capital projects"}]]