[[{"date": "7 Nov 2022", "title": "RPM Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at HealthCorps", "Interview Descriptions": "3 interviews total and they were all virtual via zoom. Interviewers were as follows below. Associate director VP COO In that order and roughly each 1 week apart. Very smooth and easy process. Answered any questions that I had as well.", "Interview Questions": "How would your previous manager describe you."}, {"date": "13 Dec 2020", "title": "Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at HealthCorps (Sacramento, CA)", "Interview Descriptions": "They ask you to prepare and give a demo lesson with a group of other interviewees. Then you also had a private interview with a panel of three interviewers. At one point they had you role play how you would talk to a group of students who were asking you questions about a not so healthy food.", "Interview Questions": "What interested you about this job?"}, {"date": "2 Nov 2020", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. I interviewed at HealthCorps", "Interview Descriptions": "Interviewed with a few of the people on my team. The interview was scheduled last minute, however, it was pretty straightforward, good conversation, and they explained the role in more depth.", "Interview Questions": "Asked about projects I have worked on that related to the role"}, {"date": "31 May 2019", "title": "Program Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at HealthCorps (Houston, TX) in May 2019", "Interview Descriptions": "Video interview where throughtful, engaged questions were asked about determinants of health problems, community outreach, community engagement, and explaining your overall interest in health. There was also a portion where I was asked about my understanding of healthcorps and if I had questions about the organization. I then asked as many questions about HC as I was curious about.", "Interview Questions": "How do you go about establishing a relationship with school teachers you are co-teaching with/providing support for."}, {"date": "10 Oct 2018", "title": "Regional Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at HealthCorps (Los Angeles, CA) in Apr 2018", "Interview Descriptions": "I applied online and received an email invitation for a phone interview the same day. I spoke with a Supervisor and I thought the interview went well. We discussed next steps and the timeline in which they would happen. I was told I would receive an email with dates and times for an in person interview. I sent a thank you note and noted some dates that I would be available. I sent a follow up email the next week stating that I was still interested. I never heard back. I understand hiring is a process, maybe there was a stronger candidate. However, I find it very unprofessional that I was essentially ghosted by the interviewer.", "Interview Questions": "How do you deal with supervising/coordinating already established groups of people."}, {"date": "20 Jan 2018", "title": "Site Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at HealthCorps in Dec 2017", "Interview Descriptions": "I applied for the position online and was contacted the same day to schedule a phone interview. I scheduled the interview for the very next day and spoke to a woman. The interview I thought went well. I was also contacted the same day by someone in HR as well as one more woman. The questions were standard. I spoke to three people within a two day period and this was before the holidays so I could tell they wanted to have the interviews completed before then and I complied. I was told I would be contacted about a decision by the first week of the new year.  I sent all three interviewers a thank you email right after speaking to them. \r\n\r\nI waited until the second week of the new year to send a follow up email to HR and one woman I spoke to. I thought I would at least get back an email thanking me for my time and telling me whether I got the job or not. Companies don't have to do this of course but considering the way in which the interviews were set up  thought I would get a response.", "Interview Questions": "N/A"}, {"date": "23 Jun 2016", "title": "Healthcorps Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at HealthCorps in May 2016", "Interview Descriptions": "First was a phone interview, then a skype interview (because I wasn't available to come in person for an interview). I thought the skype interview, which was via Google Hangout, was a really great option for those who cannot make it in person due to school locations and graduation dates. For the virtual interview/ in person interview, you are required to give a short lesson on health directed towards high school students. I felt very comfortable in front of the two interviewers and I was very pleased with the interview process.", "Interview Questions": "What was your biggest disappointment in your life?\r\nWhat are you most proud of?"}, {"date": "10 Aug 2017", "title": "HealthCorps Program Coordinator Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at HealthCorps (New York, NY) in May 2016", "Interview Descriptions": "Applied Online and heard back within 2 weeks after my phone interview I heard back about the second skype interview within 2-3 days. The overall process was straight forward but when asked about the job description each person stated that it depends on the needs of the school.", "Interview Questions": "Tell me about a time you had to make a difficult decision?"}, {"date": "10 Jun 2016", "title": "Healthcorps Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at HealthCorps in May 2016", "Interview Descriptions": "After applying I was contacted for a phone interview and then contacted once more for a virtual interview. The process took about three months, after first applying in the beginning of March I heard back late March for a phone interview in the beginning of April and a final virtual interview over Google Hangout beginning of May. I found out I had not received the position in the beginning of June. The interviewers were all very kind and interested in me as a candidate.", "Interview Questions": "Asked to explain my involvements in various positions"}, {"date": "21 Jun 2016", "title": "Coordinator Position Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at HealthCorps (Austin, TX) in May 2016", "Interview Descriptions": "My interview process took over three months.\r\n\r\nI received an email for a phone interview a day after submitting my resume and cover letter. A week later, my interviewer did not call at our scheduled time but did call within the hour. A few days later, I received an email stating that they were nearing the end of their recruiting process so there are limited positions available \"but could continue to be considered for the position, with the understanding that there may or may not still be positions available at this stage in the process\". If I wanted to withdraw my application, they would understand but if I wanted to continue, we could set-up a virtual interview instead of in-person. Was still very much interested and set-up a virtual interview through Google Hangout. After, I was told I would hear back from them by the end of May because in June they would need to have placed Coordinators in their respective locations. I sent a thank you email a few days after my virtual interview. I followed up on June 1st when I did not hear back from them. I called their New York Headquarters mid-June and was told to email someone regarding my application status so a manager could look at it.\r\n\r\nUnfortunately, still have not heard back since my virtual interview.\r\n\r\nAfter checking my status through Jobvite every few days, the status on my application finally changed today from \"In Process\" to \"Closed\".\r\n\r\nHealthCorps responded to me in the time frame they said they would but unfortunately towards the end of my application process, I have not been contacted. I believe one of the Regional Supervisors no longer works with HealthCorps and there was a press release stating that one of their bills for funding was extremely cut.\r\n\r\nWith the understanding that things happen - I was still hopeful that I would at least have their respect and time to email me back stating they already filled the position or some sort of update.\r\n\r\nThe interview process was fun and engaging - I thoroughly enjoyed the interview process. I was comfortable and the questions were average interview questions. But because of how they failed to contact me, I am just upset about wasted time spent on an opportunity that I was extremely excited about.", "Interview Questions": "Prepare a 5 minute lesson plan on any health topic of my choosing."}], [{"date": "8 Sept 2016", "title": "Program Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at HealthCorps (New York, NY) in Sept 2015", "Interview Descriptions": "The first step was a phone screening and I was asked questions related to my application, resume and interest in the position. The next step was meeting with the direct supervisor where I was asked questions very specific to the role. It was a very friendly environment and I was given the opportunity to ask as many questions as I wanted. The final step was meeting with the direct supervisor and director of the department. I was asked similar questions to the last interview as well as questions about my work style, interests and passions. It was a pleasant experience.", "Interview Questions": "How would you handle multiple projects and timelines?"}, {"date": "17 Jul 2016", "title": "Finance Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at HealthCorps (New York, NY) in Jun 2015", "Interview Descriptions": "I applied on line and sent my resume on line. I was connected first with the senior manager. I talked my working experience and education. After that I was interviewed by controller for about half an hour interview.", "Interview Questions": "What do you think is correct. Do thing correctly or do thing in time?\r\nThe related working experience"}, {"date": "20 Apr 2015", "title": "Director Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 4 weeks. I interviewed at HealthCorps (New York, NY) in Mar 2015", "Interview Descriptions": "Applied for position and was contacted two days later to set up a phone interview. After a thirty minute phone interview was told that I would move on to next steps. I was told there would be several steps in the process, but was not given details. I did not hear back about next steps so I reached out a week later. Three days later my email was answered and I was told that I would be contacted that week for next steps. I was contacted by a new person to set up phone interview. That was a thirty minute call. At the end of the call I was told that I would move on to the next steps. I did not hear back again so I reached out exactly one week later. The person who replied was not very nice in the email and said that \"As she informed me in the first call the process was multiple steps\" I felt badly that I reached out, but as someone who has hired many in the past I felt it was professional of me to reach out for next steps.  In the email the person said she would be reaching out by the end of the week to go to next steps after she evaluated feedback. That was a Wednesday. I never heard anything so I sent a Thank you the following Friday. At that point it was safe to assume I would not be hearing back, and wanted to send my best wishes. I admire the company and think what they do is great. I was very surprised to deal with that type of application process and certainly did not expect from such a professional organization. I will say that the President of the company is professional. The staff members that I interacted with were all very nice and professional with the exception of not following through on their timeline that they set.", "Interview Questions": "What is your management approach"}, {"date": "31 Dec 2014", "title": "Supervisor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at HealthCorps", "Interview Descriptions": "Applied online and was contacted roughly a week later via email to set up a phone interview. Phone interview covered basic employment history and experiences. Received an email within the week to set up a skype interview with two of the organization's employees. Questions were standard with challenging scenarios but overall a friendly atmosphere. In person interview with two top officials within the organization had more applicable questions concerning specific situations and took over an hour and a half to complete.", "Interview Questions": "How would you approach various situations as a supervisor who came as an outsider to the organization?"}, {"date": "12 Sept 2014", "title": "Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at HealthCorps", "Interview Descriptions": "You apply and you're scheduled for an interview. During the interview you meet HealthCorps staff (they are very nice and friendly btw) and they ask you questions about your background. After the interview you receive correspondence via email and phone.", "Interview Questions": "How would you get resources into your school as a Coordinator?"}, {"date": "2 Aug 2014", "title": "Healthcorps Coordinator Interview", "results": "No Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at HealthCorps (Charlotte, NC)", "Interview Descriptions": "First had to submit a 1 minute health plan video. Then they scheduled an interview with you about a month later. It was a group interview. You had to present a 90sec-2 min health presentation. Then you had about a 15 min 1-1 interview. The interviews were extremely nice. I left feeling confident that I was going to get an offer, but didnt.", "Interview Questions": "questions wer easy. "}, {"date": "27 Sept 2015", "title": "Fellow Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at HealthCorps (Sacramento, CA) in Jun 2014", "Interview Descriptions": "Prior to the interview, they asked me to prepare a short (~5 minute) presentation on a health topic of choice that one would present to students. The interview was conducted with one other person and we presented in front of each other, as well as two HealthCorps coordinators. There was a short panel-style interview following the presentations, and we were given the opportunity to ask questions. I'm not a fan of presenting or public speaking, but the coordinators were not intimidating and the environment was relatively relaxed. We then were asked to spend about 10 minutes on a written questionnaire, which the coordinators reviewed and then discussed with us each individually. \r\n\r\nDuring the individual interview time, they discussed some of my question responses in more depth and asked additional questions.  For this portion they also brought in a former HealthCorps Fellow who asked very vague questions, seemed super full of himself, and continued to push for very detailed answers to some common sense questions. He had an attitude and rolled his eyes a lot. When I tried to answer honestly, or provide some personal concerns I had about health and education, he questioned my response with some very assuming statements that i thought were ignorant. He also interrupted me a couple of times. I think the fact that he bothered me may have showed on my face towards the end and I'm sure that had an impact on the outcome of the interview. Prior to that I thought things were going well and my conversations with the two coordinators were very productive and cordial. \r\n\r\nHowever, they did not follow up with me, even after I emailed the main contact person for an application status update. I thought this was pretty inconsiderate given that I prepared a presentation and drove about 2 hours in the Sacramento heat for the interview. Overall, I got the impression that the Northern California HealthCorps Fellows are, for the most part, from more privileged backgrounds and are not given practical advice or training for working in communities with varied socioeconomic and racial demographics. They may have been one reason for the arrogance I encountered. If you do interview, it might be beneficial to be positive at all times, and refrain from critical statements (such as about the educational system or racial inequities), that may be perceived as negative. But it all depends on your coordinators I guess.", "Interview Questions": "Name a time when you went above and beyond for a job."}, {"date": "17 Sept 2013", "title": "Healthcorps Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at HealthCorps (Atlanta, GA)", "Interview Descriptions": "Initially you must fill out an application and create a YouTube video promoting a program that you would implement. Then you are invited to a 3-part interview. The first part is challenging- you must present a lesson in only five minutes. Following the lesson is a group and one on one interview. You'll have to kill some time if you are one of the last to interview. I followed up weekly via e-mails to express continued interest/ask when I should hear back, and my interviewer never responded after my first one. They never sent an e-mail or called to give me their decision. That's my only con for the process.", "Interview Questions": "The last book you read- not necessarily difficult, but unexpected I suppose. Most questions centered on how you would handle a given situation and why you want to be a part of HealthCorps."}, {"date": "21 Jul 2015", "title": "Social Media Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at HealthCorps (New York, NY) in Sept 2013", "Interview Descriptions": "I was asked thoughtful questions so research in advance.\r\nIt was a comfortable and welcoming environment.\r\nI was given a quick tour of the office.\r\nOverall, the interview process was a positive experience, expect to do an in person interview and at least one phone interview with an executive in the company.", "Interview Questions": "1. Create your own social media marketing plan (to demonstrate your skills). \r\n2. Explain your background and why do you want to work in social media."}]]