[[{"date": "6 Jan 2021", "title": "Equestrian Leader Position Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at WinShape Foundation", "Interview Descriptions": "It was a fairly hard interview but the staff was great. Hard questions about working with kids, your faith, and experience. Great company and would definitely recommend working for them. Looks good on Resume.", "Interview Questions": "Tell me about a time that you led a child to faith. "}, {"date": "13 Jan 2020", "title": "Marketing Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at WinShape Foundation (Buffington, GA)", "Interview Descriptions": "The interviewer did a really good job caring for my time and my thoughts. He made me feel comfortable during the process. He went over the background of the company and his own history with the company (as I would have been working under him). Then we discussed my background. We dived into my desire to work for this organization.", "Interview Questions": "Howe would you describe overcoming a problem at your current employer?"}, {"date": "8 Apr 2023", "title": "Marketing Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at WinShape Foundation (Atlanta, GA) in Apr 2019", "Interview Descriptions": "It was welcoming and felt comfortable with who was interviewing me, the interviewee's boss. He was straight forward with giving the core values of the company and what they were looking for he also was direct and short when given answers.", "Interview Questions": "How would you handle a problem when it comes up with a team member?"}, {"date": "10 Jul 2015", "title": "Facilitator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at WinShape Foundation", "Interview Descriptions": "Straight forward.  They are primarily looking for a culture fit with the understanding that the skills and experience will come with time.  Just relax, be honest, and ask lots of questions.", "Interview Questions": "Why do you want to work at WinShape Wilderness"}, {"date": "14 Apr 2014", "title": "Marketing Team Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 5 days. I interviewed at WinShape Foundation (Mount Berry, GA) in Jan 2012", "Interview Descriptions": "You meet with the team of directors who run the WinShape College program and they as you a series of questions and then make a decision based off of the questions asked.", "Interview Questions": "Please tell us how you would deal with a situation dealing with conflict?"}], []]