[[{"date": "27 May 2023", "title": "Registered Nurse, BSN Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at SUNY Downstate Medical Center (Brooklyn, NY) in May 2023", "Interview Descriptions": "Straightforward. Make sure to dress appropriately. Manager asked me to tell her about myself. Then went on to ask about my experience and why should they hire me. She also asked me how I managed conflict in the workplace..", "Interview Questions": "How do you manage conflict ?"}, {"date": "24 Apr 2023", "title": "Nursing Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at SUNY Downstate Medical Center", "Interview Descriptions": "The interview was straightforward. It was a group interview with 2 other applicants and the dean. She asked the basic questions plus “who would you dine with dead or alive” and a couple other quirky questions.", "Interview Questions": "Why Downstate? What is your first degree in? Who would you done with dead or alive? What type of cookie would you be? Is Downstate your top choice?"}, {"date": "20 Jun 2022", "title": "Research Scientist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at SUNY Downstate Medical Center", "Interview Descriptions": "Need to submit a cover letter and resume. After a candidate is contacted to schedule the on-site interview. Give a presentation and speak with Principal investigator. \nAlso need to speak with potential colleagues.", "Interview Questions": "Why apply for this position?\nWhat is your plan?\n"}, {"date": "4 Feb 2022", "title": "Radiology Information Systems Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at SUNY Downstate Medical Center", "Interview Descriptions": "The assistant manager was very nice but the manager/director was very rude, on her phone throughout the interview. She asked questions then her head was down in her phone texting while I was responding.", "Interview Questions": "What type of radiology systems have I managed?"}, {"date": "10 Dec 2020", "title": "Program Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at SUNY Downstate Medical Center", "Interview Descriptions": "I interviewed in November through a referral. Asked about my resume and why I was interested in the position.  It was a one on one zoom interview and the interview lasted around 30 minutes.", "Interview Questions": "Tell me about yourself. \nWhy do you want to work here?"}, {"date": "3 Sept 2020", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 4 weeks. I interviewed at SUNY Downstate Medical Center (New York, NY) in Aug 2020", "Interview Descriptions": "Apply with resume ,\r\nInterview set up in a month later. The interview was with 3 person. They were very welcoming.  \r\nI was very nervous but the clinical specialist was very nice. The other two manger seems uninterested. Manager went on vacation and I’m still waking for my reply. It have been over 2 weeks", "Interview Questions": "What does quality care mean to you?"}, {"date": "26 Jun 2019", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at SUNY Downstate Medical Center (Brooklyn, NY) in Jun 2019", "Interview Descriptions": "I applied online by sending my resume and the position I wanted to an email. The nurse recruiter called me and scheduled an interview with me. I went to the location and filled out an application. After that I went to speak to the nurse manager of the unit I wanted to be hired on. There were 3 people asking me questions. They were very nice and easy to talk to. The results of hire or rejection are to come out in 10 days.", "Interview Questions": "Why did you choose SUNY Downstate ? "}, {"date": "24 Sept 2018", "title": "Technician Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at SUNY Downstate Medical Center in Sept 2018", "Interview Descriptions": "A phone interview was set up 2 days before, then there was a 10 min phone interview talking to the PI directly. The interview focuses on general research background and some specific skills (animal studies in this case).", "Interview Questions": "General research experiences"}, {"date": "16 Mar 2021", "title": "Executive Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at SUNY Downstate Medical Center (Brooklyn, NY) in Apr 2018", "Interview Descriptions": "Straightforward questions about job experience and history and in which way experience can benefit the position. I was asked to fill out a form which asked for my age, my race (a diversity form).  I thought that was bit invasive.  I did not want to do it but it seemed like it wasn't a choice the way it was presented to me.", "Interview Questions": "How far did I live from the job site."}, {"date": "29 Apr 2017", "title": "Phlebotomist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at SUNY Downstate Medical Center (New York, NY) in Apr 2017", "Interview Descriptions": "I have over 10 years experience honest hardworking reliable and trustworthy. Enjoy working with people. The interview was very brief and effective  i was asked to work at least five days per week, i was more than happy.", "Interview Questions": "How long will it takes to draw 50 patients "}], [{"date": "9 Jul 2019", "title": "ABSN Program Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at SUNY Downstate Medical Center (Brooklyn, NY) in Jan 2017", "Interview Descriptions": "Straight forward interview, random list of interview questions to get to know you better on a personal level. Written essay prior to verbal interview to gauge your language skills. Interview was done in a group setting, with the Director of the program. They randomly selected a question from a list of 20 or more questions to ask.", "Interview Questions": "What are some of your hobbies?"}, {"date": "24 Aug 2016", "title": "Graduate Student Researcher Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at SUNY Downstate Medical Center (Brooklyn, NY) in Jul 2016", "Interview Descriptions": "Had an hour long interview, standardized questions. Very pleasant, even though my interviewer was a bit late. Staff was very helpful in answering my questions from security to secretaries to students to physicians and nurses. I hope to be accepted and to join this community. I will try to update based on results.", "Interview Questions": "Why do you want to join the downstate community?"}, {"date": "27 May 2019", "title": "Hemodalysis RN Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 2 months. I interviewed at SUNY Downstate Medical Center (Brooklyn, NY) in Jan 2016", "Interview Descriptions": "I went to job fair in Downstate medical center and I applied there and interviewed at same day. After 3 weeks They called me and made the offer for job . And in 2 weeks time I got medical exam for work.", "Interview Questions": "They asked basic questions like how long you've been nurse and how long you work. And any idea of job description I applied."}, {"date": "30 Oct 2015", "title": "Applications Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at SUNY Downstate Medical Center (New York, NY) in Sept 2015", "Interview Descriptions": "met CIO and fellow workers and show me all the work stations in office. nice office and friendly staff. getting one free lunch with the CIO and CEO. lots of questions about old job, they like my answers, wish working there. but no luck", "Interview Questions": "N/A"}, {"date": "15 May 2015", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at SUNY Downstate Medical Center (Brooklyn, NY)", "Interview Descriptions": "The interview process went real smooth... The HR recruiter was very polite and patient. she made the atmosphere  very comfortable.... I answered all her as is. Two weeks later she called me back in for a second interview and I got the job.", "Interview Questions": "Tell me about your self? How would you handle a anger customer?"}, {"date": "11 Sept 2016", "title": "Undergraduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at SUNY Downstate Medical Center (Brooklyn, NY) in May 2015", "Interview Descriptions": "I cold emailed a bunch of professors on the medical school faculty asking if they had any openings for an undergraduate research assistant. Two of the faculty members responded that they were looking for help, and arranged an interview. I ended up meeting with one of them, where I discussed my college career thus far, where I planned on going after college, and what interested me about the work he was doing in his lab. He accepted me on the spot and I began working in the lab three weeks later.", "Interview Questions": "1) What interests you about this specific field of research?\r\n2) What techniques have you learned from you school research?\r\n3) Do you plan on pursuing a career in research or getting a phd."}, {"date": "24 Mar 2015", "title": "Extern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at SUNY Downstate Medical Center", "Interview Descriptions": "It was very clinical, full day interview involving seeing patients.  Everything was questions, but in a testing way, not in a distrustful way.  It was a long day and very exhausting but it was not too difficult to overcome.", "Interview Questions": "Clinically based problem solving questions"}, {"date": "9 Dec 2014", "title": "Senior Research Support Specialist Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied through other source. I interviewed at SUNY Downstate Medical Center (Brooklyn, NY)", "Interview Descriptions": "I received a call from Human Resources 6.5 months ago stating my start date would be the following Monday morning.  Later that day I received an e-mail from Human Resources stating \"We will not be able to use Monday as an official start date for you.  I will notify you when the Research Foundation will be able to appoint you to the payroll.\"  I have been informed that there is a problem regarding the grant for my position.  Human Resources suggested that I contact the department.  The department suggested I contact Human Resources.", "Interview Questions": "Describe your previous research experience."}, {"date": "4 Oct 2015", "title": "Admissions Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 months. I interviewed at SUNY Downstate Medical Center (Brooklyn, NY) in Feb 2014", "Interview Descriptions": "There were 2 steps to the interview process for this position. The first portion was a phone interview conducted by an associate in the office. The second interview was conducted by 2 associates representing the admissions and student affairs offices. I was also required to complete a transcript review at the end of the second interview. Once offered the position, the hiring process to 3-4 weeks to complete. Be ready for this.", "Interview Questions": "Where do you see yourself professionally in the next 10 years?\r\nDescribe an instance when you failed at something. How did you correct your error?"}, {"date": "19 Oct 2013", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at SUNY Downstate Medical Center (Brooklyn, NY)", "Interview Descriptions": "Volunteer work, good GRE scores", "Interview Questions": "N/A"}], [{"date": "22 Mar 2013", "title": "Manager Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at SUNY Downstate Medical Center", "Interview Descriptions": "All involved were friendly, forthcoming and follow through was prompt.  Communication was seamless and all my questions were answered within 24 hours no matter what the question was regarding.  All managers involved were professional and courteous and all HR representative were friendly and well informed.  Good experience over all for me.", "Interview Questions": "No difficult questions.  All questions asked were just based on them learning about your experience and what you would bring to the table.  "}, {"date": "30 Oct 2016", "title": "Clinical Assistant Professor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied through other source. The process took 3 weeks. I interviewed at SUNY Downstate Medical Center (Brooklyn, NY) in Jan 2012", "Interview Descriptions": "It was very dis-organized. Very difficult to get appointments. When I got the did not know what I was supposed to see. I had to wait for extraordinary amount of time between interview. Don't get me wrong typical of any HHC hospital.", "Interview Questions": "N/A"}, {"date": "2 Oct 2015", "title": "Program Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 6 months. I interviewed at SUNY Downstate Medical Center (New York, NY) in Oct 2011", "Interview Descriptions": "This process took almost six months. I applied and then waited for the posting to close. The call back and scheduling of interviews was a process, since they were extremely busy and their calendar kept fluctuating. There was a round of interviews with a group of peers. Then another round with a direct report Supervisor and other lateral supervisors then two more with the High Level Manager that everyone worked for. They asked the usual questions about strengths, weaknesses and hypothetical situations of what would you do, salary range looking for and 5 year plans.", "Interview Questions": "Where do you see yourself in five years?"}, {"date": "31 Mar 2014", "title": "Administrator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 4 weeks. I interviewed at SUNY Downstate Medical Center (Brooklyn, NY) in Apr 2011", "Interview Descriptions": "Met with the department chief who interviewed me and gave me a tour of the department where I met the staff.", "Interview Questions": "Would I be willing to attain certifications relevant to the position in the near future?"}, {"date": "25 May 2011", "title": "Medical Student Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at SUNY Downstate Medical Center (Brooklyn, NY) in Nov 2010", "Interview Descriptions": "One interviewer grill you for about a hour.", "Interview Questions": "Why downstate and not another very similar school?"}, {"date": "6 Dec 2014", "title": "Senior Staff Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at SUNY Downstate Medical Center (Brooklyn, NY) in Oct 2010", "Interview Descriptions": "The hiring process was very long..from the time I was interviewed until actual hire took almost one year. The interview process entailed: initial interview with senior administrator of the department, chief of service, chairman of department, group interview with division during committee meeting", "Interview Questions": "what did I know about live kidney donation and transplantation"}, {"date": "4 Apr 2014", "title": "Physician Interview", "results": "Declined Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at SUNY Downstate Medical Center in Jun 2010", "Interview Descriptions": "around 2010 - disorganized; willing to pay above market rate but are not looking for leaders; not a center of progress or innovation; they are looking for bodies to bill medicaid.", "Interview Questions": "N/A"}, {"date": "14 Dec 2013", "title": "Medical Student Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 10 months. I interviewed at SUNY Downstate Medical Center (Brooklyn, NY) in Feb 2009", "Interview Descriptions": "One interview and they look at rest of application as a whole. Interview obviously depends on interviewer and can vary widely. I had chief of surgery as interviewer and he was rough, asked a lot of difficult questions. Interview has huge weight. The rest of the interview day was good. I heard some people had very easy interviews.", "Interview Questions": "Interviewer asked why i took a vacation when I could have worked or did volunteer service. Tough to answer since he was the type of person who was a workaholic. "}, {"date": "20 Jul 2010", "title": "Resident Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at SUNY Downstate Medical Center (Brooklyn, NY) in Feb 2008", "Interview Descriptions": "1:1 interview with Program Director and Associate DIrector. Standard questions: Why our program?, What are your plans? Why are you the right candidate?", "Interview Questions": "Why did you choose our program?"}]]