[[{"date": "6 Apr 2023", "title": "Insurance Coordinator Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Nemours Children's Health (Brandywine, DE)", "Interview Descriptions": "Very very First Phone screen by recruitment then Remote interview with managers and 2 coworkers Then shadowing Received call for hire Very easy all questions answered regarding benefits and vac questions answered by recruiter", "Interview Questions": "Skills and qualifications Applications used"}, {"date": "13 Mar 2023", "title": "Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Nemours Children's Health", "Interview Descriptions": "Relatively easy process - standard questions ; welcoming interview panel that clearly were passionate about the work that they were doing. No questions felt like I was blindside as they were the basic interview questions most interviewees have used in their interview prep.", "Interview Questions": "Why do you want to work here?"}, {"date": "5 Dec 2022", "title": "Director Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Nemours Children's Health", "Interview Descriptions": "My interview process was facilitated by a recruiter, external to the company. Interactions with him were great, and he was very communicative. However, the actual hiring manager was unresponsive throughout several months of interviews. The interviews were always pleasant, but if I had follow-up questions from the meeting or even just sent a thank you, there was no response.", "Interview Questions": "Why would you like to work here?"}, {"date": "9 Nov 2022", "title": "Social Media Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Nemours Children's Health", "Interview Descriptions": "Had an initial call with HR, a week later had an interview with the manager, then had a 3rd interview with someone else. All interviews went well in my opinion but I never heard back, not even a decline email.", "Interview Questions": "Tell us about a campaign you worked on"}, {"date": "22 Oct 2022", "title": "Administrative Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Nemours Children's Health", "Interview Descriptions": "Received an email about a week after I applied. The interview was a zoom call. It was very easy and laid back, it didn’t even feel like an interview. Unfortunately, they could not meet my salary requirement", "Interview Questions": "Tell me about yourself Relevant experience"}, {"date": "29 Jul 2022", "title": "Nursing Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Nemours Children's Health", "Interview Descriptions": "Multiple Interviewers were part of the interview process, all was done virtually via computer and got to speak with multiple people at different levels.  Interview process was standard for hospital positions.", "Interview Questions": "What are some things you do for self-care?"}, {"date": "13 Jul 2022", "title": "Public Safety Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Nemours Children's Health (Orlando, FL)", "Interview Descriptions": "Clear shot, nice and simple and not overwhelming. The interviewer was very straight forward and took their time with all the questions and made sure they heard you out. Very nice person.", "Interview Questions": "What are some of the things you bring to the table to help improve our company?"}, {"date": "16 Jul 2022", "title": "Medical Laboratory Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Nemours Children's Health in Jul 2022", "Interview Descriptions": "The supervisors that participated in the interview process were very welcoming. Asked a great deal of questions to get to know me and opened the floor for me to ask questions at the end.", "Interview Questions": "Why are you interested in this position?\r\nWhat do you believe your strengths are?\r\nWhat do you believe your weakenesses are?"}, {"date": "20 Jun 2022", "title": "Sys Administrator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Nemours Children's Health", "Interview Descriptions": "The interview felt rushed, timed and the interviewer read off a paper. No response back or feedback. Silence post interview. He said he would like to interview me again but nothing after that. Terrible.", "Interview Questions": "Many questions but felt as though they were just reading off a paper and not listening or interested in getting to know me."}, {"date": "6 Aug 2022", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Nemours Children's Health in Jun 2022", "Interview Descriptions": "The interview process was web-based with the nurse manager for the unit. It was intended to be only 15 minutes long; however, the interview was really just an hour-long conversation! They want to see who you are as a person and your values. A lot of communication came from the interviewer, who also made me feel comfortable in my answers.", "Interview Questions": "\"Why Nemours and the pediatric population?\" \"If you could go back to your time in nursing school, what would you change and why?\""}], [{"date": "30 Mar 2022", "title": "Event Coordinator Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Nemours Children's Health", "Interview Descriptions": "Smooth and friendly. The experience was great from beginning to end. The overall interview took about an hour and I received a call the next week. I found the process as pleasant as can be under the circumstances.", "Interview Questions": "Past experience in the even field. "}, {"date": "1 Mar 2022", "title": "Medical Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Nemours Children's Health", "Interview Descriptions": "Many different supervisor and managers in various parts of the building. It was a very long process, and not just with HR like when I had interviews for other positions.  (After several interviews with this company, I always got the vibe that they discriminate on weight. Think about it - thank about every single employee you have ever seen in their facilities..)", "Interview Questions": "What experience do you have with insurance prior authorization "}, {"date": "27 Jun 2022", "title": "Human Resources Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Nemours Children's Health in Mar 2022", "Interview Descriptions": "Applied online and contacted by a recruiter to complete an on-line assessment.  The three months that followed consisted of 5 interviews with various team members, all of whom essentially asked the same questions. After investing a total of 8 hours in interviews and assessments,  I received an email stating that the manager would be in touch regarding next steps.  Two weeks passed and radio silence. At this point, I realized I had dodged a bullet as I could never work with a team who had such a poor recruitment process in place. Sure enough after having to follow up again when no one got back to me, I was simply told that I was not a good match.  The importance of providing a positive candidate experience is often overlooked and underestimated. As a recruiter, I could never work for a company that would ask me to put a candidate through such an inefficient, frustrating interview process.", "Interview Questions": "What is your favorite interview question?"}, {"date": "16 Jan 2022", "title": "Patient Service Representative Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Nemours Children's Health", "Interview Descriptions": "It was really professional! The Interviewer was so nice and made me feel like i was where i belonged. They asked some questions that made me Think about why i want to be apart of the company. Over all good experience!", "Interview Questions": "What do you think will help you move up in the company?"}, {"date": "15 Jan 2022", "title": "Imaging Informatics Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Nemours Children's Health", "Interview Descriptions": "Laidback multiple team members each person took turns asking questions. Was done via Teams everyone started off with an introduction and then asked questions. Questions ranged from professional to personal .", "Interview Questions": "Name a situation where you had to make a difficult choice. "}, {"date": "25 Jan 2022", "title": "Respiratory Therapist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Nemours Children's Health (Orlando, FL) in Nov 2021", "Interview Descriptions": "Was fine at the beginning, but when the discussion of the vaccine came up, I could tell we were on different pages. I was open to receiving it, but when they couldn’t provide any information on it, I felt as though they shut down. From that point on, the interview was rushed and I never even heard back regarding their decision (although I know what it is).", "Interview Questions": "Do you have the covid vaccine?"}, {"date": "14 Nov 2021", "title": "Patient Advocate Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Nemours Children's Health (Jacksonville, FL) in Nov 2021", "Interview Descriptions": "Very informative. Very relaxed atmosphere. Interviewer very easy to communicate with via zoom. Felt like it was going very well with back and forth question and answering on both sides. Then I was asked where I was looking in the money aspect. I said it was negotiable since I was going into a new role with this new company. Unfortunately it was lower than I had researched the field for on Glass Door. The site has Nemours and other similar companies with salaries posted for much higher pay and she expressed that Nemours is much lower than other companies. 45 minutes after a very pleasant experience with what I thought was a perfect place to hit the snag. Low pay with absolutely no over time to even make up for the pay. I had to pass on something, I thought was going to be my next move.", "Interview Questions": "Have I did collection on account "}, {"date": "8 Apr 2022", "title": "Physician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Nemours Children's Health (Orlando, FL) in Oct 2021", "Interview Descriptions": "Interviewed both virtually and then in person. Met with people in a variety of positions which gave me an impression of the company as a whole.  I also went to different swings to see how the various center functioned.", "Interview Questions": "There is no question I can recall specifically. They wanted to make sure I understood the company culture and felt like I could fit in."}, {"date": "5 Oct 2022", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Nemours Children's Health (Orlando, FL) in Sept 2021", "Interview Descriptions": "very easygoing, 2 interviews and the job was mine! Amazing and fun company to work for especially if you enjoy working with children. It's definitely a safe place for your inner childhood.", "Interview Questions": "How many years of experience do you have?"}, {"date": "11 Feb 2021", "title": "Continuous Improvement Specialist I Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Nemours Children's Health (Elmer, NJ) in Feb 2021", "Interview Descriptions": "Started the initial discussion with the recruiter regarding compensation.  Once the hiring manager was contacted,  they said I was asking for too much.  Why ask but ignore the conversation and get my hopes up?", "Interview Questions": "Tell me something about yourself?"}], [{"date": "5 Mar 2023", "title": "Sodexo Benefits & Reward Services Employee Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Nemours Children's Health (Wilmington, DE) in Mar 2020", "Interview Descriptions": "The interview process was easy and very helpful, meet all of my needs since meeting then the first day. They made sure my schedule was clear, they provided me with work shoes and work gear to get me stared.", "Interview Questions": "What are my qualifications to work for them"}, {"date": "3 Jan 2022", "title": "Physician Auth Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Nemours Children's Health (Wilmington, DE) in Mar 2020", "Interview Descriptions": "2 interviews both team interviews-including managers very easy. Asked about experience, expectations. Explained the position and requirements hours team expectations. My strengths and weaknesses , software programs I have used etc Very laid back interview", "Interview Questions": "What products have  I utilized for insurance verification "}, {"date": "23 Jan 2020", "title": "IT Security Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 4 weeks. I interviewed at Nemours Children's Health (Jacksonville, FL)", "Interview Descriptions": "Great experience and fair opportunity. Went through a phone interview first. Following that I was called in for a panel interview. The interview lasted about one hour. There were four people involved in the interview. They mostly asked about my past experiences.", "Interview Questions": "How would my previous employer describe me today as an employee."}, {"date": "26 Dec 2019", "title": "Patient Service Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Nemours Children's Health (Orlando, FL)", "Interview Descriptions": "Pleasant panel interview.  Basic interview questions. Very friendly panel made me feel very comfortable. Many questions, be prepared. I am very excited to start working with this amazing company as they have me more eager to do so as I already was!", "Interview Questions": "How would you handle employee conflict?"}, {"date": "29 Sept 2019", "title": "MRI Technologist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Nemours Children's Health", "Interview Descriptions": "I met with a manager and a lead tech. They both took turns asking questions and explaining the job. I was also offered a department tour and introduced to other employees.", "Interview Questions": "My strengths and weaknesses "}, {"date": "19 Apr 2019", "title": "Pharmacy Tech Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Nemours Children's Health (Orlando, FL) in Apr 2019", "Interview Descriptions": "I applied online for this position. I heard back from an HR rep about a week later to schedule a Telephone Interview for Start Up Position. I had to wait a week and a half for the telephone interview. Next step will be on location interview and I will find out if I get that chance before the end of the month.", "Interview Questions": "How would you manage technicians with more experience than yourself?"}, {"date": "8 Jun 2023", "title": "Physician Auth Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 3 weeks. I interviewed at Nemours Children's Health (Wilmington, DE) in Feb 2019", "Interview Descriptions": "The in the interview process was fairly easy I was heard from within. Interview scheduled via email and interviewed virtually at the time with the hiring manager. Second interview was then scheduled with peers. Position was offered to me within two weeks.", "Interview Questions": "Insurance experience what insurance sites"}, {"date": "11 Jan 2021", "title": "Physician Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. I interviewed at Nemours Children's Health in Nov 2018", "Interview Descriptions": "Comprehensive process with 1-2 days of interviews with hiring department, HR, and administration. One segment of interview includes behavioral based questions. The interview provides an excellent introduction to the institution and team.", "Interview Questions": "Related experience \nDifficulty patient or coworker behavioral questions \n"}, {"date": "27 Sept 2018", "title": "Patient Services Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 3 weeks. I interviewed at Nemours Children's Health", "Interview Descriptions": "I applied online and it took about a week and a half to two weeks for them to call and request an interview. I scheduled it for a few days out. When I was brought back the interview was held in a meeting room and there were three women there to interview me. It was a very pleasant interview.", "Interview Questions": "Tell us a little about yourself?"}, {"date": "12 Sept 2019", "title": "Medical Secretary III Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Nemours Children's Health (Wilmington, DE) in Oct 2018", "Interview Descriptions": "Three people interview me manager, supervisor and  chief doctor of the department\r\n2 hours long with a lot of questions of organization and being able to work in a fast pace environment", "Interview Questions": "What are my weaknesses?"}], [{"date": "2 Jun 2022", "title": "Pediatric Nurse Practitioner Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 6 weeks. I interviewed at Nemours Children's Health (Orlando, FL) in Sept 2018", "Interview Descriptions": "I was interviewed by several people including members of the multidisciplinary clinic I was hoping to join. In addition I was interviewed by the medical director and the nurse administrator.", "Interview Questions": "How would I respond in a clinical situation if a child arrived at clinic in distress?"}, {"date": "23 Jul 2018", "title": "Telecommunications Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 5 months. I interviewed at Nemours Children's Health (Wilmington, DE) in Jan 2018", "Interview Descriptions": "In the first two weeks, the process was very quick. There were at least two phone interviews and then two face-to-face interviews. After that, I had heard almost nothing, except that they were still working on vetting other candidates. After a month had passed, I had thought that I had been passed on. Then, three months after that, I was called back for a third face-to-face and then presented with an offer.", "Interview Questions": "Why should we hire you?"}, {"date": "27 Oct 2017", "title": "Program and Policy Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Nemours Children's Health (Washington, DC)", "Interview Descriptions": "I was contacted by HR and had a short screening. I was then sent a long list of questions to answer, which took a significant amount of to complete. I never heard back afterward. While I have no issue with being not selected to move forward, the fact that I after I spend at time drafting a document, I should have been given the decency of an email to at least say someone else was selected.", "Interview Questions": "No difficult questions, just a long list of questions to answer, with about 8-10 questions that required significant time to complete."}, {"date": "10 Jun 2017", "title": "Authorization Referral Supervisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 2+ months. I interviewed at Nemours Children's Health", "Interview Descriptions": "I was contacted via email to call and set up interview. I interviewed with two managers one from intake and another from the referral department then I interviewed with a peer employee and a group of employees that the candidate would be managing. \nI believe it went well.  But I will  say that meeting probably had a few members that wanted the job , wasn't qualified for it and  wasn't given the opportunity to be considered for the role.\nI've had a few panel interviews and group interviews but none like this where the  employees are given a prospective bosses resume to review.\nIt should  be more so this is the person selected by the upper management staff to lead you all and  trust they are qualified and put in this position because of their abilities.", "Interview Questions": "why do you want to work here."}, {"date": "29 Nov 2016", "title": "Revenue Cycle Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Nemours Children's Health (Orlando, FL)", "Interview Descriptions": "Avarage.  Informal. The interviewers were negative about the company.  After 4 weeks wait.  I reached out to the Hiring Manager and responded that they are continuing interviews but no position for me.  No professional feedback or recommendations.  My qualifications and interview fullfill the expectations.\r\nNo recruiter or HR response regarding the interview. Lack of professionalism and very bias.", "Interview Questions": "About my professional background.  Hiring Manager pleased with responses and experience."}, {"date": "2 Jun 2017", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Nemours Children's Health (Jacksonville, FL) in Oct 2016", "Interview Descriptions": "Interviewed with two managers, managers alternated asking scripted questions. They were friendly and personable. Gave me the opportunity to ask questions and answered them thoroughly.  Questions were typical \"give an example of ....\" type questions.", "Interview Questions": "Describe a difficult work situation and how you handled it. "}, {"date": "25 Jul 2016", "title": "RN- Day Medicine Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Nemours Children's Health (Wilmington, DE)", "Interview Descriptions": "Was contacted by HR to set up an interview and was emailed benefit information. Interview went well. Met with 3 managers. Said they would have a decision within 3 weeks, hopefully. Sent 2 follow up emails, never heard anything back from anyone. Found out later that position was filled.", "Interview Questions": "Strengths? Weaknesses? Asked about employment history. Why leaving current position. What am I most concerned about with this position?"}, {"date": "13 Dec 2015", "title": "Clinical Research Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Nemours Children's Health", "Interview Descriptions": "Interview was traditional, laid back, and comfortable.  Relevant questions to make sure the position is a good fit for both sides.  A lot of explanation of the goals of Nemours Research Institute, history, goals, and plans for growth.", "Interview Questions": "Typical questions mostly related to your previous experience and your career goals."}, {"date": "23 Aug 2015", "title": "Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Nemours Children's Health (Wilmington, DE)", "Interview Descriptions": "I applied online, had a short call from the hiring manager, and was then asked to come in for a day-long interview. The day-long interview consisted of interviews with the hiring manager, 2-3 directors, and 3-4 direct reports. For the last part of the day, I was given a set time to complete a skills test and personality test.", "Interview Questions": "Hiring manager asked about my current job situation: $, potential start date, commute\r\nDirectors asked behavioral interview questions: Tell me about a time that you had X problem, and how you resolved it."}, {"date": "11 Jul 2018", "title": "Nursing Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Nemours Children's Health (Wilmington, DE) in May 2015", "Interview Descriptions": "Group interview method. Nurse manager, assistant nurse manager and two soon-to-be nurses (nursing assistants at time of my interview) took turns asking me questions, lasted about 20 or so minutes", "Interview Questions": "Standard interview questions"}], [{"date": "1 Jun 2015", "title": "Health Equity Researcher Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Nemours Children's Health in Apr 2015", "Interview Descriptions": "Had a brief phone interview, then was asked to prepare a powerpoint of a relevant publication. Questions covered the presentation, CV, and basic epidemiology concepts. In addition there was a situation question with no right/wrong answer relating to the research & some basic HR questions.", "Interview Questions": "What is health disparities research? "}, {"date": "12 Mar 2015", "title": "Grant Accountant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Nemours Children's Health (Jacksonville, FL) in Jan 2015", "Interview Descriptions": "Applied online; interviewed by 2 people; was Behavioral type questions their questions led off with Tell us about a time and Describe for me a time... Their surprise question was \"Why do you want to leave your current position?\"", "Interview Questions": "Describe for us a time when a team member's task became more of a priority than yours.\r\n\r\nTell us about a time when you had to persuade someone to accept your suggestion.\r\n\r\nTell us about a time when you had to cope with a diffiicult coworker\r\n\r\nWhy do you want to leave your current position?\r\n\r\nMy suggestion is to study the company's job announcement requirements and create questions based on your experiences that could likely be asked. \r\n\r\nUse the S.T.A.R. format to answer your questions.. Rehearse to a mirror..."}, {"date": "18 Aug 2014", "title": "Physician Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 5+ months. I interviewed at Nemours Children's Health", "Interview Descriptions": "Interview process was relaxed, comfortable, informative.\r\nPeople were friendly, inquisitive, and open.\r\nI was able to have all of my questions answered.\r\nI interviewed with both department heads and two peers.\r\nI was given a tour of the facility. Everyone I met was kind and enthusiastic.", "Interview Questions": "N/A"}, {"date": "26 Sept 2018", "title": "Front Desk Receptionist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Nemours Children's Health (Orlando, FL) in Aug 2014", "Interview Descriptions": "took a while to get an interview, it was ok . manager i met with both male was very nice, but it was awkward. I felt they only had me to interview due to the schedule they were asking for and they had no choice but to choose me.", "Interview Questions": "how long have you been in the medical field"}, {"date": "29 Jul 2014", "title": "Graphic Designer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Nemours Children's Health", "Interview Descriptions": "Sat before a 5 person panel, two of which were video conferencing from the home office in Jacksonville, FL and one who had flown up from Jacksonville along with two of the Delaware members of the Creative Team. Reviewed my portfolio, asked questions about my resume and just general questions about me to kinda get a feel for me.", "Interview Questions": "Do you have experience with CMS?"}, {"date": "9 Jun 2015", "title": "Coder Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Nemours Children's Health (Orlando, FL) in Aug 2013", "Interview Descriptions": "The interview process was seamless.  Interview, offer and acceptance within 2 weeks of applying.  Surpisingly fast for any Florida hospital!  The managers presented themselves well, and were very engaging", "Interview Questions": "N/A"}, {"date": "28 Apr 2014", "title": "Anonymous Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Nemours Children's Health in May 2012", "Interview Descriptions": "Behavioral Interview Question (Tell me about a time....) using the Star formula Situation Task  Action Results", "Interview Questions": "Tell me about a time when you had a irate customer and how did u handle the situation?"}, {"date": "23 Mar 2016", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 3 months. I interviewed at Nemours Children's Health (Wilmington, DE) in Apr 2012", "Interview Descriptions": "I had 4 different interviews and it took 3 months to actually start working. I met with the same manager 4 times and the other 3 times with different staff amongst the different units. We met in the same office and then continued by walking around the different units so I could see where/what the job is.", "Interview Questions": "How would I handle an employee conflict"}]]