[[{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 5, "Senior Management": 0, "review_title": "Acuity Review", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 8 years", "job_date": "1 Sept 2015", "job_title": " in Huntersville, NC", "duration": "N/A", "pros": "Great Company and benefits.  Staff from multiple departments work well together.  Relaxed management style.", "cons": "Senior management shares little information about performance leaving employees guessing."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "The worse executives", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 8 years", "job_date": "27 Jun 2021", "job_title": "Anonymous Employee in Atlantic City, NJ", "duration": "N/A", "pros": "I can’t remember even one,", "cons": "Cheaters, liars, backstabbers and simple minded executives."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 1, "Senior Management": 0, "review_title": "BEWARE!!!", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "24 Sept 2019", "job_title": "Tech in San Antonio, TX", "duration": "N/A", "pros": "Basically, it is a job.", "cons": "BEWARE!!!  This company seems to have financial problems.  They do not offer affordable insurance and your other \"benefits\" are little to non-existant.  The main thing to be advised of is that they do not offer the 60-day Warn Letter in case of a lay off, and they do not have a severence package for employees.  This company shut down one of it's locations with no warning the same day.  One day we were working and the next day we weren't.  I understand these things happen, but when asked about the financial status of the facility during company meetings  we were lied to."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "N/A", "Work/Life Balance": 1, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Company has ever changing set of expectations and in terrible financial state where they cannot focus on proper treatment of their employees. It us about the bottom line and NOT ABOUT THE PATIENTS!", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "30 Oct 2014", "job_title": "Director of Pharmacy in Sun City, AZ", "duration": "N/A", "pros": "Small hospital with 2 locations in metro area", "cons": "Management that insults the Clinical Staff almost daily about census, unrealistic expectations for administrative tasks plus direct patient care, blame for things that go wrong in And no responsibility and no support even though written work protocol given with data as to why more staff need to be hired. More hours of operation mean more staff needed. Very simple."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 1, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": 1, "Senior Management": "N/A", "review_title": "Deceiving, Poorly Managed, Unprofessional, and Top-level Greedy(?)", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "16 Sept 2015", "job_title": "Registered Nurse in Phoenix, AZ", "duration": "N/A", "pros": "\"PRO\" 1- At the beginning of acquisition, recruitment and retention of employees was constructed around the Employee-Stock-Ownership-Plan.  Mr. Cooper visited Phoenix himself to energetically welcome our hospitals aboard.  His verbatim statements...' you are going to be glad you are employed by Acuity because someday you will be a part owner...' and 'OH, WE ARE NOT going to leave the Arizona Market...we are going to grow'- Yes, I did take notes at the meetings Mr. Cooper.  The \"PRO\" of this...despite the foolery, we had faith he was sincere.  We were excited and worked very hard to create in ONE year what came to be a patient-centered hospital and SNF approaching excellence.  Our patients and residents received benefit from this dedicated family of workers!; \r\n\"PRO\" 2-...I am not speaking for myself when I say most of us experienced personal growth from working with some outstanding professional individuals.  Many of us shall remain in contact as we move on in our careers; \r\n\"PRO\" 3-  Nearly 400 individuals are growing in character to become even better than they were before their Acuity-employment/experience.  They certainly know and have experienced personally the rippling after-affects of \"Corporate\" poor leadership/management.\r\n\"PRO\" 4-  When notified we would be losing our jobs, nearly all 400 employees, in shock, took a high-road and continued to \"show up\" not only giving diligent care to our ill population, finding  suitable placement for them at other facilities, but also assisting our Corporation with the packing up of offices, cleaning of the building, and providing one another support.  Acuity did not even have a plan to assist us with anything...such as finding new jobs, offering letters of recommendation, assisting in obtaining unemployment benefits...HOWEVER...yet another PRO-One of \"our own\" single-handedly reached out to other facilities, Social Media, and most-importantly, the County to establish contacts that could provide support and/or assistance!  How embarrassing Acuity...Yes...slowly but surely good things are happening.", "cons": "\"CON\" 1-  Our Phoenix community lost care for an acutely ill population of patients, residents.  Very sad, as the Community's trust was building;\r\n\"CON\" 2-  ...The Corporate entity described to the AZ leadership...\"we will support you and give you infra-structure to minimize the time you will need 'reinventing wheels'\"  This was poorly executed even at the beckoning of our own senior leader.  The truth really was...Acuity Infra-structure did not exist and where it did, it was substandard to Best Practices in healthcare. \r\n\"CON\" 3-...nearly 400 individuals were notified after business hours on Wednesday, 8-25  that all jobs were to be eliminated as a result of Hospital/SNF Closing.  Benefits would all be lost as of August 31.  Any and all new employees with less than one year would lose any unused PTO."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Unfortunately new management has taken this hospital into  a downward decline", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 8 years", "job_date": "11 Sept 2019", "job_title": "Admissions Manager in Willingboro, NJ", "duration": "N/A", "pros": "When I started, the hospital was true to its mission statement of Patient First, Service  before self. .....\r\nGreed and  a change in management turned it into a for profit at all costs hospital.", "cons": "Poor management.   Stressful work environment."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Good", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Corp office", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "26 Sept 2018", "job_title": "Corporate Office in Charlotte, NC", "duration": "N/A", "pros": "None at all.  Terrible place to work.", "cons": "Company is falling apart with terrible executives who are not held accountable.  They are sucking the last dime out of LTAC without regard for their employees and, more so, their patients."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "Operations", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "21 Dec 2015", "job_title": "Anonymous Employee in Sun City, AZ", "duration": "N/A", "pros": "Was a great place to work.\r\nEmployees were great, dedicated, and loyal to the patients.", "cons": "Corporate filed bankruptcy and displaced over 400 employees with absolutely no notice. Corporate did nothing to assist the employees."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 4, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Bean Counters", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "6 Sept 2014", "job_title": "Anonymous Employee in Mesa, AZ", "duration": "N/A", "pros": "None at this time.  No room for growth, promotions or otherwise.", "cons": "Bean counters. Bean counters. Bean counters."}], []]