[[{"date": "7 Jul 2023", "title": "Blood Bank Technologist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at University Hospital Newark", "Interview Descriptions": "It was straightforward questions related to blood bank Technology related etc. panels were given to rule out antibodies 2 cell rule out. Selected cell rule out. What antigens are affected by the enzyme and how they are affected enhanced, degraded or no change", "Interview Questions": "Panels Antigen related questions Type scree Grading results"}, {"date": "11 Jun 2023", "title": "Customer Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at University Hospital Newark", "Interview Descriptions": "Great company to work for and am very pleased. I love that they loved their employees. We are free and I love the quiet room on campus. Every time I went to work I felt like I belonged.", "Interview Questions": "What do you like to do?"}, {"date": "3 May 2023", "title": "Radiation Therapist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University Hospital Newark (Newark, NJ) in May 2023", "Interview Descriptions": "Microsoft Team was used for a virtual interview. Friendly dialogue and the interview period was 30 minutes. Basic questions about the profession and clinical training. It was comfortable and insightful.", "Interview Questions": "Basic questions about the profession. Asked about my clinical training."}, {"date": "21 Feb 2023", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at University Hospital Newark", "Interview Descriptions": "The interview process was average. Met with director of nursing , discussed the job, unit and my experience as a nurse. Also discussed scenarios and what I would do. Decent interview, accepted job offer.", "Interview Questions": "Tell me about your experience as a nurse"}, {"date": "15 Feb 2023", "title": "MICP Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University Hospital Newark", "Interview Descriptions": "Panel interview with 2 chiefs and a coordinator via Zoom. Asked experience based questions as well as those pertaining to clinical objectives and operations. Discussed system differences between multiple states and what can be expected from their clinicians.", "Interview Questions": "What do you know about our agency?"}, {"date": "5 Feb 2023", "title": "Program Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University Hospital Newark", "Interview Descriptions": "Fairly Long process took a while to hear back after applying and after interviewing but was onboarded quickly after receiving the call from hr and accepting. Overall just have some patience", "Interview Questions": "Difference between a Project and a Program"}, {"date": "24 Oct 2022", "title": "Data Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at University Hospital Newark", "Interview Descriptions": "My interview was cancelled 15 min before the scheduled time without a reason, horrible management and would not recommend anyone to apply for this hospital in case people face the same situation.", "Interview Questions": "My interview is cancelled 15 min before the scheduled time"}, {"date": "22 Feb 2021", "title": "Intern - Hourly Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University Hospital Newark", "Interview Descriptions": "Pretty straightforward. We had one interview where they mainly asked me about my work history and about my comfortability with the job tasks. Overall, a pretty good experience. Not intimidating at all.", "Interview Questions": "Why do you want to work here?"}, {"date": "28 Sept 2021", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at University Hospital Newark (Newark, NJ) in Aug 2020", "Interview Descriptions": "Meet with ANM for 15 minutes, preset questions, hear from HR within 5 days. Asks about prioritization, when u went above and beyond for a patient and how you would handle a staff member doing something they aren’t suppose to do.", "Interview Questions": "Tell me about a time you went above and beyond for a patient. "}], [{"date": "9 Jul 2018", "title": "Pharmacy Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at University Hospital Newark (Newark, NJ) in Apr 2017", "Interview Descriptions": "It can be a bit intimidating with having 3-5 people in the room to ask you questions but they just want to make sure they’re hiring the right type of technician.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "17 Jul 2019", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. The process took 1 week. I interviewed at University Hospital Newark in Feb 2017", "Interview Descriptions": "i interviewed with the unit manager and clinical instructor. It was a very friendly and cal interview. they asked scenario questions and clinical questions. they asked questions about my background, questions about dealing with difficult staff. they told me what the job entailed and the shifts available.", "Interview Questions": "how will you manage bedsore\r\n"}, {"date": "2 Apr 2017", "title": "Professional Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University Hospital Newark (Newark, NJ) in Jan 2017", "Interview Descriptions": "Was called by a secretary and an interview was set up. I cam in and there was a manager with his colleague. Interviewed for about 40 min was asked if I had question. I had 5, and I feel they answered all of concerns", "Interview Questions": "Where do I see myself in 5 years"}, {"date": "27 Sept 2019", "title": "Unit Clerk Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University Hospital Newark (Newark, NJ) in Dec 2016", "Interview Descriptions": "Applied to the position took about a month before I received a call for the interview. After the interview concluded I got a job offer about a week later. It was a fast process and once I was hired I chose orientation day.", "Interview Questions": "Why should we hire you?"}, {"date": "10 Oct 2016", "title": "Certified Registered Nurse Anesthetist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at University Hospital Newark (New York, NY)", "Interview Descriptions": "Review of past experience and credentials.  Basic discussion of strengths and weaknessess.  Reviewed skills such as central line placement, arterial lines, and fiberoptic intubations  Discussed in detail the numerous amount of shift choices, always having a three day weekend and potential to do more overtime", "Interview Questions": "Most difficult patient scenarios"}, {"date": "10 Feb 2016", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University Hospital Newark (Cleveland, OH) in Jan 2016", "Interview Descriptions": "Interview was great. Went smoothly. Simple questions. She went through a list of 6-8 questions. Most are just generalized question  of how well you deal with issues at work and what you would do to resolve the issue. How you take ownership for problems and work to fixing it smoothly and efficiently. How you think outside the box and solve issues without running to manager for solutions.", "Interview Questions": "How did you deal with angry patient in past? do you work well in team? how do you deal with bad coworker? describe challenge working with diverse coworker?"}, {"date": "11 Oct 2015", "title": "Liaison for Hiv/Aids Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University Hospital Newark (Newark, NJ) in May 2015", "Interview Descriptions": "The hiring and interview process was pertaining to experience and challenges that was faced for the position.They asked how will I face difficult situations with staff members and with meeting daily goals of the company and department.", "Interview Questions": "What will I bring to the company, How will I accomplish my task with staff members if faced with difficult situations, with I meet the mission and vision of the company"}, {"date": "13 May 2015", "title": "Diet Control Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University Hospital Newark (Newark, NJ) in Oct 2014", "Interview Descriptions": "2 person interview. Just an in person interview; no phone interview. Overall experience was that they really enjoyed my personality and goals and saw that as something wonderful for their department. This turned out to be inaccurate as they don't look for employees looking to move forward; only pawns for them to play with.", "Interview Questions": "Where I see myself in 10 years"}]]