[[{"date": "6 Apr 2023", "title": "New Grad RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at VHC Health", "Interview Descriptions": "Scheduling with recruiter. 2 Peer interview and leader interviewed. On site interview was pretty much casual. Not strict. Offered good benefits including tuition assistance and commute subsidies and no contract required. Good ratio. Seems like there are many resources available for staffing. Low travel nurse ratio is plus for me.", "Interview Questions": "What is priority of care"}, {"date": "20 Jun 2022", "title": "Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at VHC Health", "Interview Descriptions": "Long lags between communication. Very simple interview for a high level position. Situational questions and interviews for cultural fit. Very friendly. Long psychological test on the phone. The test and peer are hard stops.", "Interview Questions": "What do you do for fun?\r\nTell me about a time you had a disagreement?\r\nWhat is your leadership style?"}, {"date": "26 Apr 2022", "title": "Front Desk Receptionist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at VHC Health", "Interview Descriptions": "I met with three lovely ladies who made the process smooth and comfortable. I am normally very nervous but after them just walking in the room everything shifted.  Overall great interview experience.", "Interview Questions": "What do you look for in your next position?"}, {"date": "18 Nov 2022", "title": "Student Nurse Extern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at VHC Health in Mar 2022", "Interview Descriptions": "The interview was easy and they asked simple questions. It was with two women and they did not ask me very detailed questions, they mostly asked me about why I wanted the externship.", "Interview Questions": "What was one mistake that you did and how did you fix it?"}, {"date": "11 Sept 2021", "title": "OR Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at VHC Health", "Interview Descriptions": "Met with department manager. - easy questions - showed me the unit and introduced me to staff.  Gave me a tour of the operating rooms. It was an easy going interview.", "Interview Questions": "How long have you worked in this field."}, {"date": "24 Jun 2021", "title": "Recruiter Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at VHC Health", "Interview Descriptions": "It was a 3 step interview process, all happened within a week. I was in touch with the recruiter via phone and email. She updated me on their decision every few days.", "Interview Questions": "Tell me about yourself and your current position and responsibilities."}, {"date": "31 Mar 2021", "title": "Web Content Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at VHC Health", "Interview Descriptions": "The most unprofessional interview experience I've ever dealt with. The person interviewing me didn't even show. Waited 20 minutes, just to be informed that he was not in that day. Definitely worth avoiding.", "Interview Questions": "He's not in today. Would you like to reschedule?"}, {"date": "29 Dec 2020", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at VHC Health", "Interview Descriptions": "I think the interview process was fairly easy you will get three interviews I did mine through FaceTime because of Covid-19 but it’s like any other interview process in the medical field", "Interview Questions": "Why do I want to work for the company "}, {"date": "16 Nov 2020", "title": "PRN RN Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at VHC Health (Arlington, VA)", "Interview Descriptions": "Long. Before I talked to a hiring manager I had to do a long (almost two hours) phone screen that was like a personality or strenths test. You can't really tell from the questions what strenth they're trying to measure.", "Interview Questions": "If your supervisor was doing something clinically wrong would you feel comfortable correcting them? How would you do it?"}, {"date": "14 Jan 2021", "title": "New Grad RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at VHC Health in Nov 2020", "Interview Descriptions": "Very straight forward interview process. I was emailed an invitation to interview a few days prior. The interview took place over the phone. I believe the interview was between 10 and 15 minutes!!", "Interview Questions": "Tell me a strength / area for improvement "}], [{"date": "19 Mar 2020", "title": "Environmental Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at VHC Health", "Interview Descriptions": "the hiring process is very long, I have been waiting for a call for 3 weeks, I would like to know why this process is very long, after a reference check and background check.", "Interview Questions": "experience"}, {"date": "17 Sept 2020", "title": "New Grad RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at VHC Health (Arlington, VA) in Mar 2020", "Interview Descriptions": "Match Day Event:\n1. Choose 2 units to interview with\n2. Go to the event\n3. Attend recruitment presentations\n4. Meet with senior staff \n5. Meet the managers on 2 units you selected\n6. Interview with manager\n7. Interview with peers\n8. On the spot job offers", "Interview Questions": "1. Why do you want to be a nurse on this unit?\n2. How do you handle conflict?\n3. What are your aspirations?"}, {"date": "28 May 2021", "title": "Case Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at VHC Health (Arlington, VA) in Mar 2020", "Interview Descriptions": "Apply online. There is a personality quiz that takes forever. They take this seriously. Answer as a team player.\r\n\r\nHR will call you and ask you how much you make and want. They'll ask why you are seeking a change.\r\n\r\nMajority of the 2020-2021 hires have no hospital CM experience. The people hired after me: came from bedside, owned a daycare (worked in a hospital a long time ago), stay at home wife (RN). If you have CM experience, you will probably get a job offer.\r\n\r\nYour first interview will be with director. He talks so much. The interview is him talking and needing an audience, more than it is about you and your experience. If you're an active listener, meaning letting director talk, he'll likely like you and you'll get invited to a peer interview. \r\n\r\nHe has already coached the group on the peer interview to accept you. They actually get penalized if they say anything negative.\r\n\r\nHR will do job offer by phone. If you accept, there is a drug test and background check.", "Interview Questions": "Where do you see yourself in 5 years? \r\nWhat's a tough case you've had?"}, {"date": "5 Aug 2019", "title": "ED Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at VHC Health (Arlington, VA)", "Interview Descriptions": "It was very calm, relaxing and straight to the point. The interviewers wanted to get a sense of my personality while they asked me \"what if\" situations. After the interview, they gave me a mini tour of the department.", "Interview Questions": "How will VHC help you achieve your goals?"}, {"date": "15 Jul 2019", "title": "Physical Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at VHC Health in May 2019", "Interview Descriptions": "Online application followed by an on site interview with HR, rehab managers, and staff members. Everyone was extremely welcoming and eager to show me what VHC has to offer! Overall a great interview experience!", "Interview Questions": "N/A"}, {"date": "22 May 2019", "title": "New Grad RN Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. I interviewed at VHC Health (Arlington, VA) in May 2019", "Interview Descriptions": "The facility OHR is really friendly and helpful. However the team that interviewed me had different opinions on questions and even the answers I gave - a couple staff members liked them and others disagreed with them, right over the table, in front of me. I couldn’t take the temperature of the process because it seemed all over the place.", "Interview Questions": "As a new nurse, how would you handle a stressful work environment in your own home situation?"}, {"date": "21 May 2019", "title": "Practice Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at VHC Health (Arlington, VA) in May 2019", "Interview Descriptions": "I applied and got a followup email for a phone interview the next day. I was phone interviewed by a recruiter, I had a phone screening, 2 skype interviews, and a full day of in person interviews", "Interview Questions": "Tell me about a time you had to deal with a difficult provider? How did you resolve the issue?"}, {"date": "15 Apr 2019", "title": "Biomedical Equipment Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at VHC Health", "Interview Descriptions": "Applied online. Completed phone screening interview (typical questions). Came for in person interview with supervisor, then followed by peer interview with panel. Received offer within days and then came in for health screening & drug testing. Obtained final offer and start date within two weeks of interview. Employer was in need of human resource.", "Interview Questions": "Focused primarily on situational based questions. \r\nHow do you handle conflicts/complaints from customers? Provide examples of scenarios.\r\nPrior technical experience?\r\nWhere do you see your self in 5 or 10 yrs?\r\nWhy do you want to work at the hospital? What relevant experience do you have to offer? How do you handle pressure from customers?"}, {"date": "28 Mar 2019", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. The process took 3 days. I interviewed at VHC Health in Mar 2019", "Interview Descriptions": "Quick and recuirter  is very responsive, respectful. Had interview for floor nurse and offered to apply for different  position since I have experience in that position as well. Waiting eagerly a for assessment interview.", "Interview Questions": "Why you preferred this position "}, {"date": "6 Feb 2019", "title": "New Grad RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at VHC Health (Arlington, VA) in Jan 2019", "Interview Descriptions": "I had an interview with hiring manager and then interviewed with peers on the same day for the new grad RN position. I got an offer from them within 2 days after the interview.", "Interview Questions": "Why you choose to apply job here?"}], [{"date": "31 Jan 2019", "title": "Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at VHC Health (Arlington, VA) in Dec 2018", "Interview Descriptions": "Received a call from hiring manager with some questions about my background and resume.  After the phone screening, I interviewed with the department managers and then a panel interview.", "Interview Questions": "Tell us about yourself"}, {"date": "19 Sept 2017", "title": "Performance Analyst Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at VHC Health in Sept 2017", "Interview Descriptions": "Very poorly managed recruiting office. Originally received an offer for 75, even though I said my minimum was 85. I got them to come up to 80. Then after they said they wouldn't go up any more, I accepted the offer at 80. Then I got a call 20 Minutes later saying the recruiting office had made a mistake and the offer wasn't for 80, but 77. I told them they needed to make good on their 80 offer. So the next morning they rescinded my offer. Very unprofessional and poorly managed.", "Interview Questions": "Why do you want to work at Virginia Hospital Center?"}, {"date": "9 Apr 2018", "title": "Staff RN Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at VHC Health (Arlington, VA) in Aug 2017", "Interview Descriptions": "Spoke with recruiter over the phone for approx 15 minutes.  She asked about my experience and told me about VHC.  Then met in person with PCD, followed by panel interview of 3.  Two RNs and secretary.", "Interview Questions": "Why VHC and this unit?  They asked all the typical questions found on the internet for RN positions."}, {"date": "28 Oct 2017", "title": "Physician Practice Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at VHC Health (Arlington, VA) in Jun 2017", "Interview Descriptions": "I was contacted via email and asked to schedule a Facetime interview with recruiter.  There was a slight delay in setting the actual date, but once the date was set, the interview process proceeding very smoothly.", "Interview Questions": "Salary expectation, comfort with commuting, what would I expect my biggest challenge to be in the role"}, {"date": "6 Jan 2021", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at VHC Health (Arlington, VA) in Jun 2017", "Interview Descriptions": "Most of it is a Peer interview. . . .Personality is very important. Right now interviews are being held over zoom. Get there early, parking is crazy. . . .", "Interview Questions": "Why do you want to work here. How do you work under pressure. Basic interview questions."}, {"date": "15 Mar 2018", "title": "Nurse Extern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at VHC Health (Arlington, VA) in May 2017", "Interview Descriptions": "Very short panel interview. 3 people total. Each one asked a series of questions from a list of generic, mostly behavioral questions. They explained the position and were very friendly. The process felt very short, but they were all kind and encouraging.", "Interview Questions": "Greatest strengths and weaknesses"}, {"date": "2 Mar 2017", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 1+ week. I interviewed at VHC Health in Feb 2017", "Interview Descriptions": "It started out with their open event for new grads. You meet four hiring managers from the unit of choice and hope they call back. It's kind of like speed dating. 7 minutes to speak with 4 managers. Because I really wanted to interview with one unit that kept being preoccupied with other people wanted to be interviewed by the same manager as well, I squeezed in a brief introduction (which made it my fifth interview) and some information about myself. She wanted to know more, and called me back through Human Resources to set up a formal interview with her on her unit. \n\nI was interviewed briefly by a recruiter who presented a packet of the benefits and other employee information. Took a walk to the unit hat I was going to have a formal interview by the hiring manager. A peer interview from several of the staff on the floor and then a brief orientation of the unit.\n\nDo expect rotating days and nights as a new grad. Starting pay is 26.10\n\nGreat health benefits from what I read and heard from the facility. \n\nI got the job right on the spot and I accepted.", "Interview Questions": "Tell me about yourself?\nWhy this unit?\nWhat do you know about this facility?\nTell me about a time you made a difference in someone's life?\nWhy this facility compared to others in this area?"}, {"date": "18 Jan 2017", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at VHC Health (Arlington, VA)", "Interview Descriptions": "Applied online and spoke with HR the next day.  Met with the Patient care Director and did a peer interview on the same day.  Was offered the position the next day and accepted", "Interview Questions": "What can you bring to unit?"}, {"date": "20 Dec 2016", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at VHC Health (Arlington, VA) in Dec 2016", "Interview Descriptions": "New Grad here: I was contacted by the talent agency and did a 20 minute interview on the phone. They asked me several questions: why they should hire me, what could i bring to the team, why the unit I chose, why did I like that field of nursing... Once that was finished, I was informed that they would like to have a 3 part in person interview. I had a 40 minute interview/crash course about important logistical aspects of the hospital (benefits, wages, health care). I had to provide 2 references, CPR card, License, my transcript, and when I received my nurses license. Then after that I had an interview with the nurse manager on the unit. She asked me several questions. Because she liked me I continued with on with a peer interview and spoke to 2 nurses on the unit which lasted 15 minutes. They told me about the unit and also asked me several questions. I was told that I would hear back from them in a week. I got a call the next day with a job offer. Being a new grad I was very excited to start my nursing career on the unit I wanted. New grads, please expect your starting pay to be $26 hourly, this is standard (but there is a night time differential). The interview process was long, but as long as you practice questions you should be fine. Show up prepared, dress professionally, and make sure you know how to sell yourself.", "Interview Questions": "Phone Interview:\r\n1) What can you bring to the hospital?\r\n2) What are 3 qualities about yourself?\r\n3) Describe a difficult situation in nursing and how you resolved it?\r\nNurse manager interview:\r\n4) What can you contribute to the nursing team?\r\n5) Why did you choose this field of nursing?\r\n6) Do you like day or night shift and why?\r\n7)What can you contribute to the team?\r\n-Why should we hire you?\r\nPeer Interview:\r\n8) Why ___ Unit?\r\n9) What can you bring to the team?\r\n10) Why did you choose nursing?\r\n11) Do you have any questions you would like to ask?\r\nMy Questions to them:\r\n1) what is the patient population?\r\n2) what is the orientation process like?\r\n3) what benefits do you offer your employees?\r\n4) what qualities do you look for in potential employees?\r\n\r\n\r\n\r\n\r\n"}, {"date": "26 Nov 2016", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at VHC Health (Arlington, VA) in Oct 2016", "Interview Descriptions": "Applied online and was contacted by a recruiter three days later. Had a mini phone interview with the recruiter which led to scheduling an interview with the nurse manager. Before the interview with the manager, I met with recruitment. They collected all the documents they asked for (references, CPR card, etc,) and then explained things about the hospital. They also give you information about benefits, which I though was kind of strange because I haven't even had my interview yet. We then walked over to the unit and I met with the manager. The interview with the manager felt more like a conversation which is always a plus! I came in a few days later to interview with the staff. They asked ten questions which were pretty simple (read from a piece of paper). The timeline from applying to the final interview took about two weeks.", "Interview Questions": "Can you give me three of your strengths and three of your weakness?"}], [{"date": "28 Jul 2017", "title": "Patient Care Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at VHC Health (Arlington, VA) in Sept 2016", "Interview Descriptions": "I applied online and soon received a phone call from HR for a phone interview. Then they called again and scheduled an in person interview in the recruitment office. After that I went for and interview with the Patient Care Director of the unit followed by a peer interview from RNs and PCAs on the unit. Then i got the phone call offering me the job followed by an email with everything in writing.", "Interview Questions": "How do you handle death?"}, {"date": "13 Nov 2016", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at VHC Health (Arlington, VA) in Aug 2016", "Interview Descriptions": "First contacted by recruiter and a week later another recruiter. Then interviewed with one manager but decided I didn't want to work in the area so was offer another interview on a different unit. This took a week to set up. I interviewed with manager and then peer interview. The questions were basic. The staff that were brought in to ask questions just read them from a sheet and they seemed stressed that they needed to go back to work but had to go to interview. The manager was friendly and positive. I regret not getting a tour of the unit and shadowing would of been nice to see before starting because now I know why the nurses were stressed. They are under staffed and the workload is unbearable!!", "Interview Questions": "What is the most important for you at work?"}, {"date": "21 Jun 2016", "title": "Registered Nurse Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 months. I interviewed at VHC Health (Arlington, VA)", "Interview Descriptions": "It was a long process. They had a New Grad Day (different day) where you could do a fast interview with their managers. I interviewed for two units, and got my second choice. They set up an interview with recruiter and then the nurse manager (same day), and then finally a peer interview (different day). The process was so long! lol You get a background check and drug test before being offered a position. I was offered a position, but declined.  Nice hospital, but not in my top choice unit.", "Interview Questions": "Why that unit? How did you handle a difficult situation?"}, {"date": "20 Jul 2016", "title": "Sitter/Constant Observer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at VHC Health (Arlington, VA) in Jun 2016", "Interview Descriptions": "Originally applied for the PCA position but did not have the experience. HOWEVER recruitment told me about the opportunity to work as a sitter and I agreed to an interview a week later. Interviewed the recruiter, unit director, and unit staff all on the same day. Received notice the next day of drug test, background check and references I needed to complete. Once completed I received a call from recruitment offering the position.", "Interview Questions": "How would this position help you achieve your long term goals?"}, {"date": "23 May 2016", "title": "Information Desk Clerk Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at VHC Health (Falls Church, VA) in May 2016", "Interview Descriptions": "Mrs.Nedy Fritzen , recruiter is AWESOME SAUCE! She made process very relaxing and everything moved fast. I met with her , and then unit Manager, next meeting with a different manager and unit staff member everyone was extremely friendly and hospital employees smoke numerous of times as we toured the hospital. Definitely a home based hospital .", "Interview Questions": "What will you bring to benefit the culture of the hospital?"}, {"date": "6 Apr 2016", "title": "Director of Information Technology Operations Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at VHC Health (Arlington, VA)", "Interview Descriptions": "I applied for a Director position and from application to offer letter the process took 6 weeks. In that time I was asked to come into the hospital for interviews six times within a month. I met with numerous leaders including folks from HR and a few members of the C-suite as well as peers of the role I was applying for. To say the process was comprehensive is accurate. To say that it was disjointed and poorly managed is also accurate.\r\n\r\nBecause the salary was not mentioned at the outset by HR, I used the six interviews as a process of discovery. The online job description was sufficiently vague and, it took several interviews to understand the true depth and breadth of the position. \r\nAdditionally, while interviewing at VHC, I was interviewing elsewhere and I let my recruiter know.  As the interview process was coming to a conclusion I let the recruiter know I may have multiple offers coming in at the same time.\r\n\r\nWhen I finally received the offer it was past 5 p.m. on a Friday. Despite her flattery about me being their top choice, I felt the compensation was low by about 10%-15%, which I expected as the beginning offer in a brief negotiation. Then, just before we hung up, the recruiter told me (a bit too firmly) that she needed to hear back by 10 AM Monday, giving me exactly one business hour to make my decision. That business hour was important because I had not heard back on my other offers by 9:30 AM on Monday so I called the recruiter to ask for another day to make my decision. She sounded shocked I would need another 24 hours after they had put me through a month -long interview process, but said she would ask the hiring manager. \r\n\r\nI reiterated that I likely had another offer coming in for consideration and wanted to make an informed decision. At this point the recruiter seemed to be holding back her anger when she stated that she wasn't aware I was considering other offers, that this was the first time she was hearing of this. I calmly reminded her that I had mentioned this before. I inquired about the compensation, indicating that I thought the offer was low based on my market value and my increased understanding of the role. I countered with a slightly inflated number knowing this was a negotiation and that we'd likely settle somewhere in the middle. In reality, I expected the final number to be around 10% higher than the initial offer.\r\n\r\nThis was when the recruiter really showed her teeth. She stated that while I was their number one candidate the salary was set in stone because I lacked knowledge of two key areas which, arguably, are two of my strongest. After six interviews and time with my resume, their assessment of me was completely off base. Red flag. She said there would be no negotiation. I said, \"OK, good to know” and stated that I would be back in touch later that day or the next with my decision. \r\n\r\nNinety minutes later I received an EMAIL rescinding my offer and letting me know they went with another candidate.", "Interview Questions": "Have you handled major systems replacements and worked to manage several other projects at the same time to ensure interoperability. "}, {"date": "30 Mar 2016", "title": "Outpatient Coder Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at VHC Health (Arlington, VA) in Mar 2016", "Interview Descriptions": "Received phone call from HR recruiting office and spoke with them briefly, answering a few questions about the job position. They called back and arranged an interview with the Department's Assistant Director. After submitting information for home addresses for the past seven years with HR for a background check, I went to my interview.  The interview consisted of normal discussion followed by a coding skills test. Later the same day, received a phone call from HR to arrange for a “peer interview” with fellow coders (still to come, so no info yet regarding whether job offered or not for question below.)", "Interview Questions": "What did I like about my previous job?"}, {"date": "3 Jan 2020", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at VHC Health (Arlington, VA) in Feb 2016", "Interview Descriptions": "Met with HR, then unit manager in her office, then peer interview with 2 staff members who were on the unit that day. I was there between 1-2 hours. Briefly toured the unit. The unit manager walked me out of the hospital. HR called to make the job offer a few hours after leaving the hospital.", "Interview Questions": "Summarizing relevant work experience and how it applied to the position"}, {"date": "22 Feb 2016", "title": "Patient Care Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at VHC Health (Arlington, VA) in Feb 2016", "Interview Descriptions": "phone interview, then in person interview with recruiter, then floor interview with manager and current employees on the floor. Was pretty relaxed setting, manager really enjoyed my company and the current employees really made me feel comfortable", "Interview Questions": "Why did you choose this job"}, {"date": "28 Dec 2015", "title": "Patient Care Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 6 days. I interviewed at VHC Health in Dec 2015", "Interview Descriptions": "Applied online. received a phone call 2 days later. (Which sounded like a slight phone interview) ...was called back the following week for an invite to interview hire process. Met with recruiting and the hiring manager. Received a letter in the mail dated the day after my interview...", "Interview Questions": "Why do you want to work here?"}], [{"date": "29 Jun 2016", "title": "Patient Care Representative Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at VHC Health (Arlington, VA) in Oct 2015", "Interview Descriptions": "Started out with a phone interview, then I had an interview with the department manager. After a couple of days received a call from the recruiter requesting to an peer interview. Couple of weeks later received a call that I was selected for the position.", "Interview Questions": "How would you have a conflict?"}, {"date": "3 Aug 2015", "title": "Hospitalist Physician Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at VHC Health", "Interview Descriptions": "1. Inperson interview done with management - Review job responsibilities and benefits.  Met with management. Short day - lasting few hours. Would have liked to talked to possible co-workers \r\n\r\n2. Personality interview done over phone - required by HR and done by all employees. Some off beat and bizarre questions", "Interview Questions": "Why Virginia Hospital Center?"}, {"date": "18 Jul 2015", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at VHC Health", "Interview Descriptions": "Long process took 3 weeks to a month. phone interview, then HR, then Manager, then peer interview (staff), then another phone survey/questionnaire/test. Each week was something new. I was lucky enough to get the face to face interviews done in one day. I've heard of some people taking two days.", "Interview Questions": "If someone less deserving than you got employee of the month what would you do?"}, {"date": "19 Jun 2015", "title": "Medical Receptionist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "The process took 5 days. I interviewed at VHC Health", "Interview Descriptions": "Interview process was unprofessional and a little unfair for me. I came in bright and early on a Monday morning to interview with the office manager of the position applied for. He wasn't there due to family emergency -_- so I had to speak to him over the phone in someone's office. Weird. And a little off guard. I felt as though they should have rescheduled for when he was actually able to meet with me face to face. Smh. Waste of my time and $5 of parking.", "Interview Questions": "Weaknesses? \nReason you left previous job?"}, {"date": "24 Apr 2015", "title": "Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at VHC Health (Arlington, VA) in Mar 2015", "Interview Descriptions": "I applied online and was called a little less than a week after I applied. I had a phone screening with HR and was selected to come in for a face to face interview with the hiring manager. I came for the interview, which turned out to be a panel interview because there were actually for 2 positions that were open. Less than an hour after the interview, I was called by the recruiter that they hiring manager wanted to proceed with the hiring process, which include checking a minimum of 5 references and a TalentPlus interview. References were submitted the same day. TalentPlus interview completed the day after. The TalentPlus interview is worse part of the process. They ask you a lot of questions to see if you are a good fit for the organization. I guess I wasn't a good fit because I haven't heard anything since. I've sent e-mails and made calls and never heard anything back.", "Interview Questions": "From TalentPlus - How do you generate profit? What advice would you give to an aide working in your facility? How neat are you? Do you get compliments on how neat your are? What would you do if you saw your co-worker give a patient food?"}, {"date": "28 Feb 2015", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at VHC Health", "Interview Descriptions": "I met with the hiring manager who asked me back questions Such as where do you see your self in five years etc. Then we went up to the nursing supervisor who told me a little about the unit and also asked basic clinical questions and experience.  You are then to complete a talent plus interview and a staff interview. Pretty simple stuff.", "Interview Questions": "Tell me about a time you exemplified leadership"}, {"date": "6 Mar 2015", "title": "ER Registration Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at VHC Health (Arlington, VA) in Feb 2015", "Interview Descriptions": "The first interview was with ER Manager in which I had to wait to interview after she was done with a meeting. Second interview consisted of an telephone interview which lasted 30 minutes. Third interview was with assistant director, director and two peers. All were on the same day but different times.", "Interview Questions": "Why should they hire me."}, {"date": "11 Jan 2015", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at VHC Health (Arlington, VA)", "Interview Descriptions": "I feel as though the process was very thorough. First, within a few days of submitting an application, I received a call from someone with the recruitment. There was a 45 minute prescreen/phone interview. She was friendly and very helpful with any questions I had.\nNext, I came in for an interview. I met with the same person I spoke with on the phone, she walked me through all of the great benefits of working with VHC and then walked a winding maze to the unit I was interviewing for. I did an interview both with the unit manager and then with a few staff nurses, which I can appreciate that they care about letting the nurses have a say on who they bring in and I can see the style of nurses that I can expect to work with. \nFollowinf the interview, came a Talentplus phone interview that I had to schedule. They said it would take about an hour, but I'm pretty open, honest, and straight to the point. Imagine my horror when it ended in 30 minutes. I thought I had lost my chance at a great hospital. \nAbout 5-6 days later, including a weekend, I got got a call with an offer.", "Interview Questions": "For the in person interview, just Google top nursing interview questions. That's what I did, and there was no question that I hadn't heard before from those lists. Be prepared!"}, {"date": "31 Jul 2015", "title": "Unit Secretary Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at VHC Health (Arlington, VA) in Jan 2015", "Interview Descriptions": "The recruiter was very polite and welcoming. She explained the expectations of the position, the needs of the department, and the mission of the hospital. It was all quite casual but very informative, encouraging experience.", "Interview Questions": "Why are you interested in working at Virginia Hospital Center?"}], [{"date": "27 Jan 2016", "title": "Orthopedic Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at VHC Health (Arlington, VA) in Jan 2015", "Interview Descriptions": "The interview was great. We got straight to the point and every detail was explained clearly. Met the staff and it was my kind of environment to work in. All in all I enjoyed the interview for the most part. The reason is most interviews over do it sometimes.", "Interview Questions": "Am I willing to get the work done?"}, {"date": "23 Aug 2014", "title": "Case Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 1 week. I interviewed at VHC Health", "Interview Descriptions": "The hiring process was pretty efficient.  Human resources was professional and appropriate.  Right after applying online, I got a call within a few weeks.  After the in person interview, I had to do a phone interview with a series of questions.  They are pretty much yes or no responses (with some short answer), but it is kind of like a personality test to see if you would be appropriate for the job.  A lot of the answers are common sense. Ex.\"What would you do if you saw an employee doing something wrong?\"  \"How would you handle a disagreement with your supervisor?\" etc.", "Interview Questions": "N/A"}, {"date": "20 Apr 2014", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at VHC Health (Arlington, VA)", "Interview Descriptions": "Ver involved interview process by HR, Supervisor of department, and staff in department. They hire a company to ask moral, decision making questions, that have no right or wrong answers?!", "Interview Questions": "I can't think of one in particular,  but some were very leading as do you smile a lot?"}, {"date": "17 Sept 2015", "title": "Clinical Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at VHC Health (Arlington, VA) in Nov 2013", "Interview Descriptions": "I submitted my resume, had screening interview with HR, then a Phone interview with potential supervisor. I traveled to the hospital at my own expense and then in person interview including peer interview.", "Interview Questions": "What value will you bring to the hospital?"}, {"date": "30 Sept 2013", "title": "Director of Radiology Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. The process took 5 months. I interviewed at VHC Health", "Interview Descriptions": "Interview process as follows:\r\n1 Behavioral Questions interview: Outside vendor\r\n1 phone interview: Director of HR\r\n1 onsite interview: including VP of HR, Director of Radiology Group, VP of Ancillary Services, COO\r\n2nd onsite interview: COO, CEO, VP of HR, Director of recruiting.", "Interview Questions": "Onsite interview were easy, the 1 hour and 15 minute behavioral questioning by an outside vendor was the most difficult part of all interviews."}, {"date": "8 Mar 2013", "title": "Clinical Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at VHC Health", "Interview Descriptions": "Iniitial interview was done during an open house.  It was harmless. I spoke to a couple of staff nurses and was then given a tour.  I returned for another interview with the PCD.", "Interview Questions": "They didn't ask me any clinical scenarios...just your basic 'What do you do when you have a problem with a co-worker?'"}, {"date": "20 Sept 2015", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at VHC Health (Arlington, VA) in Jan 2013", "Interview Descriptions": "I was called in for an interview and met with the PCD and then had a peer interview right after that. I liked having the peer interview because in a way it also allowed me to be able to interview the unit and the people and see if it would be a good fit for both parties. After this they then decided to hire me and immediately took me to do a drug test. It was pretty convenient because I did not have to go to another facility or arrange to come back another day and use up another personal day from my work. Keep in mind to put aside about 2-3 hours to be safe for the interview especially if you are doing peer interview as well that day. The nurses are working so it does not always happen quickly and you might end up waiting about 15 minutes to start the peer interview but it is worth the wait to get to meet some of your future fellow nurses and techs.", "Interview Questions": "Tell about a time when you had a disagreement with a co-worker and how did you handle it."}, {"date": "4 Aug 2015", "title": "Communications Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at VHC Health (Arlington, VA) in Jan 2013", "Interview Descriptions": "You will first be contacted by recruitment for a pre-screening interview by phone. Next, if your selected you will be invited to an in-person interview with the hiring manager. After the department hiring manager interviews you, you will be interviewed a second time by peers.", "Interview Questions": "Do you have any experience in customer service or call taking?"}, {"date": "30 Jun 2012", "title": "Patient Care Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at VHC Health (Arlington, VA) in Jun 2012", "Interview Descriptions": "applied online & was contacted 2 days later for phone screen, passed phone screen and had the in person interview with hr to do paperwork and the patient care director, another w/ staff on the unit, then got invited to do the talent plus interview, called 6 days later w/ offer", "Interview Questions": "Please illustrate a time when you had to make improvements."}, {"date": "18 Oct 2016", "title": "Coder I Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at VHC Health (Arlington, VA) in Jun 2012", "Interview Descriptions": "Four interviews! Four interviews! Four interviews! \r\nEven after an awesome resume and with a certification!\r\n1 I had an over the phone with recruiter\r\n2 I had an over the phone with director\r\n3 I had an interview in person with the two directors\r\n4 And then I had a peer interview with I think four or five people.", "Interview Questions": "How long have you been coding?"}], [{"date": "29 Feb 2012", "title": "Manager/Supervisor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at VHC Health (Arlington, VA) in Feb 2012", "Interview Descriptions": "Online application resulted in telephone interview lasting 45 minutes\r\n\r\nSelected to interview face to face with HR Recruitment and have professional references and photo ID.  Interviewed with 2 recruiters and had a tour of the hospital, took over 2 hours.  Both recruiters were warm, friendly, optimistic and appear to believe they work for the best organization.\r\n\r\nAfter passing the face to face interviews with HR, I was scheduled for a Talent Plus telephone interview that lasted nearly 90 minutes  asking questions to gauge if my personality would be suitable working at Virginia Hospital Center.   Some of the questions were personal and I felt uncomfortable with the style of the telephone interview as well as some of the questions.    The Talent Plus interviewer was very impersonal and fired off questions very quickly.  Told the hospital recruiter would follow up within 48 hours, but they would never release the results of the Talent Plus  interview to me or tell my why I was not considered for a position.   Even if they hired me, they still do not share the Talent Plus interview results.   \r\n\r\nIt's been weeks & no response from them.  Has not checked references or background check.\r\n\r\nThe Virginia Hospital Center bases all hires on their personalities, not necessarily the persons skills, education, qualifications or experience.   You are not permitted to meet with the hiring managers unless you pass the Talent Plus interview.   Very frustrating to go through all the interviews and the personality tests and get no feedback at all.   If you don't pass the Talent Plus test, you are barred from future employment at this hospital.   All internal staff must go through the same process for advancement or transfers,  if they don't pass the Talent Plus, they are never considered suitable for advancement.", "Interview Questions": "How do you handle departmental conflicts?"}, {"date": "25 Aug 2015", "title": "Unit Secretary Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at VHC Health (Arlington, VA) in Oct 2011", "Interview Descriptions": "It's a long process. You have to apply through HR and then follow up with both HR and the department in which you want to work before they'll interview you. And before you can get an in-person interview, you have to do an hour-long phone interview with a screening company that asks a bunch of open-ended questions about your character and integrity.", "Interview Questions": "Do you know what's involved in the role of a unit secretary?"}]]