[[{"date": "22 Feb 2022", "title": "Graduate Student Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Hobart and William Smith Colleges", "Interview Descriptions": "Explore the molecular orbital to account for the pigments’ respective single point energies. I will use the depicted molecular orbitals in conjunction with using an electrostatic surface potential to identify regions of high and low electron density", "Interview Questions": "What is a strength and a weakness?"}, {"date": "14 Sept 2021", "title": "Lab Technician Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Hobart and William Smith Colleges", "Interview Descriptions": "Had a zoom call with the head of the department, then was asked to an in person interview where I met faculty and was treated to lunch. Was a very pleasant interview experience", "Interview Questions": "Experience, problem solving, responsibilities, future plans"}, {"date": "16 Sept 2020", "title": "Animal and Plant Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Hobart and William Smith Colleges", "Interview Descriptions": "The process was streamlined. The position was mentioned by and discussed with professors. Afterwards I was introduced to my direct supervisor who instructed me on job requirements. After a successful introduction I was hired for the position.", "Interview Questions": "Are you able to fulfill the roles for this position?"}, {"date": "11 Aug 2020", "title": "Hydrilla Team Member Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Hobart and William Smith Colleges", "Interview Descriptions": "A couple of emails back and forth followed by a Zoom call. Was asked generic interview questions and about my watercraft experience. I was not asked about my experience identifying invasives at all. The focus was on ability to perform labor and to learn/ fit in with other employees.", "Interview Questions": "How much experience do you have boating?"}, {"date": "15 Mar 2019", "title": "Human Resources Associate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Hobart and William Smith Colleges (Geneva, NY) in Dec 2018", "Interview Descriptions": "I applied online. The portal was not very user friendly but not unmanageable. I received a call for an on site interview. Visitor parking was about a ten minute walk from the HR building. The interview was a panel of the director and three other human resources team members. The director was very brash and insulting. She would ask questions and then wave her hand in my face and say \"ok!\" if I took to long to answer. When I adjusted my answers to accommodate her she would ask me to explain more; when I did she would allow me a few more sentences before say \"ok! I got it!\". When I asked about the departments culture, one of the team members laughed in my face and said it was \"tense since (the director) came on. There is a lot of butting heads\". The other ladies sat their with tense smiles. I knew after the first questions I could not work for a director like that, and the tension in that room was so thick you could cut through it with a spoon. I think I could have worked nicely with the other staff, but that director is a nightmare! Then I never even got a no thank you letter, even after I sent a than you email. This place is a wreck! No wonder they can't find any quality candidates to fill this position!", "Interview Questions": "Can you create an ATS system?"}, {"date": "13 Oct 2021", "title": "O'Laughlin Ambassador Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Hobart and William Smith Colleges (Geneva, NY) in Sept 2018", "Interview Descriptions": "Multiple rounds of interviews. First is a group interview with a couple of people then form there you are given the tour guide manual and expected to remember it then give a mock tour shortly after being given the material itself.", "Interview Questions": "What is your favorite part about HWS"}, {"date": "20 Nov 2017", "title": "Librarian Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Hobart and William Smith Colleges", "Interview Descriptions": "After I applied online in July I received a phone interview in late August.  A month later I was invited for an in-person interview which included a full-day of interviews and a presentation. The process was lengthy and after I walked out of the interview room I never heard from the search committee again.  I never received a call to offer the job or else let me know I wasn't selected.  Additionally, the odd thing was that the interview included a session with HR to talk about benefits but at no point was I informed of the salary.", "Interview Questions": "The questions were very specific to the position. "}, {"date": "29 Mar 2018", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Hobart and William Smith Colleges (Geneva, NY) in Nov 2017", "Interview Descriptions": "I was the only person who applied. The professor thought my paper was similar to hers, which made our combination a good idea. It was pretty easy to get the interview done with her, it was not too bad.", "Interview Questions": "Do you want to work on this project with me?"}, {"date": "11 Sept 2017", "title": "Cafe Staff Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Hobart and William Smith Colleges (Geneva, NY) in Jan 2017", "Interview Descriptions": "Student employees needed to staff The Cafe. Must be flexible, able to follow direction, and provide professional service at all times. We will train for each position. Many different positions and shifts are currently available.", "Interview Questions": "What's required?"}, {"date": "26 May 2016", "title": "Assistant Director of Admissions Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 3 weeks. I interviewed at Hobart and William Smith Colleges (Geneva, NY) in Feb 2016", "Interview Descriptions": "Applied online by submitting a resume and cover letter. I sent a thank you note to the admissions office and the hiring HR representative. I didn't hear back until 3 weeks after I applied. I was invited to an in-person interview a week later.", "Interview Questions": "Due to the fact that this is typically a one to two year position, what do you plan on taking away from this position?"}], [{"date": "2 Sept 2015", "title": "Area Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Hobart and William Smith Colleges (Geneva, NY) in Aug 2015", "Interview Descriptions": "The interview process is extremely fair. Every person is asked the same questions. They ask about 10 questions in the interview and the interviewing staff is extremely nice and also answers all of your questions with honesty.", "Interview Questions": "What is your ideal staff?"}, {"date": "17 Aug 2015", "title": "Administrative Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Hobart and William Smith Colleges (Geneva, NY) in Apr 2013", "Interview Descriptions": "They are very timely with their response and very curtious. Amazing location and provides great feedback. You feel as if you are having a conversation more so than an interview.", "Interview Questions": "How does your experience in the past translate to this current role?"}, {"date": "25 Mar 2016", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at Hobart and William Smith Colleges (Geneva, NY) in Apr 2012", "Interview Descriptions": "They ask you about yourself and what you like to do, what you have done throughout your high school career that sets you apart from the rest of the applicants, and why you would like to attend the Colleges. It is very relaxed and you only get interviewed by one person. The total interview was about 30 minutes and mine was done by another student worker working in admissions.", "Interview Questions": "Why do you want to attend the Colleges and what do you hope to major in?"}]]