[[{"date": "28 Dec 2022", "title": "Patient Care Assistant (PCA) Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Christ Hospital", "Interview Descriptions": "Easy phone interview. Set up interview via email then got the call. Went well and scheduled a in person interview. Nice and friendly phone person, didn’t attend in person interview due to scheduling conflicts.", "Interview Questions": "Am I in nursing school?"}, {"date": "22 Apr 2022", "title": "Surgical Support Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Christ Hospital", "Interview Descriptions": "Intro phone call first. Then on site tour of facility and job description walkthrough. Phone interview was a very normal intro style, they just want to get a feel for how you fit in to the company.", "Interview Questions": "Why do you want to work here?"}, {"date": "11 Apr 2022", "title": "Practice Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Christ Hospital (Cincinnati, OH) in Apr 2022", "Interview Descriptions": "It was a smooth interview process. All of the staff I met with were very nice. They asked great questions and made me feel comfortable. It was a work family atmosphere.", "Interview Questions": "What was my management style"}, {"date": "3 Mar 2023", "title": "Talent Acquisition Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Christ Hospital in Apr 2022", "Interview Descriptions": "The interview process was direct and straightforward. It was also a very seamless process in which they stayed in contact with me throughout their candidate selection with updates and/or next steps.", "Interview Questions": "How do you handle difficult situations?"}, {"date": "23 Apr 2022", "title": "Caregiver, CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Christ Hospital (Chicago, IL) in Oct 2021", "Interview Descriptions": "very detailed asked about my last position what i did and different scenarios  and how did i get along with the last employees that i worked with as well as how do i think my last employer would rate me or have to say about me", "Interview Questions": "what are your experiences in your last position "}, {"date": "23 Sept 2021", "title": "Phlebotomist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Christ Hospital", "Interview Descriptions": "Very nice, but put you on the spot. Very encouraging interviewers. Very easy to talk to. I have nothing further to say about this job interview, it was average to be brief.", "Interview Questions": "Why are you interested in this position?"}, {"date": "2 Jan 2022", "title": "Patient Care Assistant (PCA) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Christ Hospital in Sept 2021", "Interview Descriptions": "The phone call was very informative and they were quick to respond and follow up with the next steps. The questions asked in the screening were generic and the screening doesn’t take more than 15 minutes to complete.", "Interview Questions": "Tell me about yourself and why you are Interested "}, {"date": "13 Jul 2022", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Christ Hospital (Chicago, IL) in Jun 2021", "Interview Descriptions": "The interview process was comfortable and welcoming. I was directed to their objectives and accomplished what is needed to be addressed in the interview. There were many interviewees which made it more difficult in the beginning.", "Interview Questions": "how much is your patience?"}, {"date": "27 May 2021", "title": "Care Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Christ Hospital", "Interview Descriptions": "Once with HR once with Manager and once with each MD group, pretty informal done via Zoom very typical questions, multiple staff were on each call, Very pleasant experience, very pertinent questions", "Interview Questions": "real time scenarios and what would you do?"}, {"date": "4 May 2021", "title": "Clinical Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Christ Hospital", "Interview Descriptions": "Easy and friendly, they were nice and described the job well, no complaints really. Would recommend to others. Employees seem pretty happy and the environment there is nice as it is", "Interview Questions": "Why would you like to work specifically here?"}], [{"date": "26 Jan 2021", "title": "Cardiac Monitor Technician Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Christ Hospital", "Interview Descriptions": "Very professional. There was an interview on the phone and then an interview at the hospital followed by shadowing for 2 hours. Everyone was pleasant. Seems like a good place to work.", "Interview Questions": "Tell me when you were able to settle an uncomfortable situation between co workers."}, {"date": "22 Dec 2020", "title": "Access Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Christ Hospital (Cincinnati, OH) in Dec 2020", "Interview Descriptions": "The interview process took at least 2 weeks. Started with a phone interview screener with recruitment. I was then offered a video interview (due to COVID).  During the interview, I was asked to come shadow the department I applied for to get a feel of the department. Within a couple of days I was offered the position.", "Interview Questions": "Why do you want to work for Christ Hospital? "}, {"date": "4 Nov 2020", "title": "Registered Nurse Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Christ Hospital", "Interview Descriptions": "The interview process was very easy. First I had a phone call with HR and then the second interview was with the managers of whatever unit(s) you applied for.  Very casual and friendly interviews. Behavior-based questions.", "Interview Questions": "How do you deal with stress?"}, {"date": "29 Oct 2020", "title": "Medical Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Christ Hospital", "Interview Descriptions": "I went through a phone interview which involved going over my work experience. I then followed up with the manager of the department after that I shadowed first this position and then later offered a position.", "Interview Questions": "What could you bring to the work environment that would impact the company. "}, {"date": "17 Aug 2020", "title": "Pharmacy Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Christ Hospital in Jul 2020", "Interview Descriptions": "I applied on 07/17/2020. I was contacted on the 21st for an interview with HR. I had my first interview on the 29th. I proceeded to my second interview, which was a video interview due to COVID with the supervisors, it was scheduled on the 5th. I was contacted the 6th to fill out my references. I was contacted on the 7th from HR that she would like to schedule a time on the 10th to speak with me, and then I was offered a job on the 10th.", "Interview Questions": "Give me a time that you went above and beyond for a customer"}, {"date": "25 Mar 2020", "title": "Health Unit Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 days. I interviewed at Christ Hospital", "Interview Descriptions": "Very personable and relaxed, the manager was very friendly and gave a tour of the floor and allowed me to meet with staff that we’re working. I was also given the chance to ask sit and ask questions with current employees to get a better idea about what the job entailed.", "Interview Questions": "Have you ever worked in a high stress environment? How did you manage?"}, {"date": "8 Jun 2023", "title": "Immediate Response Lab Assistant I Phlebotomist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 9 months. I interviewed at Christ Hospital (Cincinnati, OH) in Dec 2019", "Interview Descriptions": "You should definitely study. I had a great connection with the interviewer and we automatically bonded. I was passionate about working in the hospital especially since I was applying to medical school and I think that showed not only on my resume but also during the interview. I didn’t have any experience in Phlebotomy but This Hospital is a teaching hospital so be prepared to get thrown in there. They train you pretty well. Had to switch to Third shift because I felt that the night manager was more patient and didn’t micromanage me like the other shifts managers. They would make things seem more complicated than it actually was. Once I was on Third shift, I thrived and the job immediately became a breeze. Overall, I enjoyed working at this hospital mainly because of the patients and making them smile everyday.", "Interview Questions": "Why do you want to work here? Tell me about yourself? Be prepared to answer questions about experiences on your resume."}, {"date": "15 Nov 2019", "title": "Surgical Support Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Christ Hospital", "Interview Descriptions": "Phone call and then in person. Was given a tour around the building and the OR to make sure it would be a good fit for me. Was an easy interview overall.", "Interview Questions": "Why do you want to work here?"}, {"date": "30 Sept 2019", "title": "Front Desk Agent Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Christ Hospital", "Interview Descriptions": "Very awkward. It was in the afternoon, and the person seemed like they had better things to do than to speak with me. I assumed that they were just interviewing a lot of people and over it.", "Interview Questions": "Why do you want to work here. "}, {"date": "10 Jun 2019", "title": "Nurse Residency Program Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Christ Hospital (Cincinnati, OH)", "Interview Descriptions": "I had a weirdly-hard phone interview. They asked me questions like \"what I have done to contribute to a health care network\". As a student nurse with no non-school experiences, this was very tough for me. All of the questions were about that hard. But I somehow got an in person interview, too. That, I thought, went way better. I shadowed in the ER for about an hour first which was very laid back and I was with a great and knowledgeable nurse. The interview portion also went great. The nurse manager was very easy to talk to and the interview felt more like a natural conversation. I left feeling very confident, and was told that I would hear their decision in one week. I never heard anything. Followed up in about a week and a half and another week after that. Never got a response. I was happy with the whole experience until I never got any closure.", "Interview Questions": "What was a time I had to set professional boundaries."}], [{"date": "17 Apr 2021", "title": "Nurse Consultant Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Christ Hospital (Cincinnati, OH) in Jun 2019", "Interview Descriptions": "Overall the process was very long as drawn out. Four interviews over the span of 6 weeks with very few updates during the process. I thought it was over and I wasn't going to hear from them again when I got a phone call offering me the job!", "Interview Questions": "Asked how I give  feedback to others and communicate identified areas of growth for others. "}, {"date": "15 May 2019", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Christ Hospital in May 2019", "Interview Descriptions": "The interview process consisted of a phone interview, and then a follow up shadow/interview experience in person. Christ was very prompt at responding to my emails and setting up the phone screen & interview. The HR department is wonderful and efficient.", "Interview Questions": "Q: Name a time when you had to deal with a difficult patient, and what was the outcome? "}, {"date": "1 Mar 2019", "title": "General Service Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Christ Hospital (New York, NY) in Feb 2019", "Interview Descriptions": "Applied online the was requested to give a good time for the phone interview. They ten proceeded to ask questions about previous work history and then went over job aspects of the job.", "Interview Questions": "What was a time when you had to fix a hazardous situation at work?"}, {"date": "19 Aug 2019", "title": "Patient Access Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Christ Hospital (Cincinnati, OH) in Jun 2018", "Interview Descriptions": "Apply online, phone interview, do well on phone interview advance to invitation to complete online typing assessment, pass assessment and receive phone call to set up in person interview with department manager. If selected for hire HR will call you and email you with an offer of employment.", "Interview Questions": "Why would you be a good fit in this role? "}, {"date": "14 Jul 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Christ Hospital (Cincinnati, OH) in May 2018", "Interview Descriptions": "I interviewed for the new graduate nurse residency critical care program with the managers of the MICU, SICU, CVICU, and PACU. All managers were very friendly and asked thoughtful but not too challenging questions.", "Interview Questions": "Tell me about a time you enacted a change in your workplace"}, {"date": "15 Mar 2018", "title": "Pharmacy Technician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Christ Hospital", "Interview Descriptions": "The interview process was very speedy overall. There was less direct communication with HR and more with the department itself. Everyone was friendly and it took a little over an hour to complete the in-person portion.", "Interview Questions": "Describe a challenging position you were in and how you overcame it?"}, {"date": "16 Feb 2018", "title": "Patient Care Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Christ Hospital (Cincinnati, OH)", "Interview Descriptions": "I applied online, and received an email almost immediately to complete a basic math skills test and personality test. About two days later, HR called to set up a phone interview. The phone interview was scheduled about a week out, and lasted approx 30 minutes.\r\n\r\nI received another call from HR a few days later to set up an in person interview. During the in person interview, I shadowed a PCA on the floor for about 45 minutes, and then sat down with the hiring manager.", "Interview Questions": "During the phone interview, it was all \"tell me about a time when....\" questions. Times when you've struggled and how you recovered, compassion, customer service, etc.\r\n\r\nThe in person interview was easy breezy (for me). Personal questions about why healthcare, why Christ, etc. I think the in person interview is for them to see if you're a good culture fit."}, {"date": "7 Nov 2017", "title": "Phlebotomist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Christ Hospital (Cincinnati, OH) in Oct 2017", "Interview Descriptions": "After filling out an online application, I received a call the next day to set up a phone interview. The phone interview was a week later and was  pretty easy and I then moved on to an in person interview the following week. The interview was fairly easy and went very well but I never heard back.", "Interview Questions": "Tell me about yourself"}, {"date": "28 May 2017", "title": "MA Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Christ Hospital (Cincinnati, OH)", "Interview Descriptions": "You fill out a lengthy online application.  If you are a possible candidate, HR will call and do a phone interview, if they feel you are a \"fit\" for the position they will bring you in for an in person interview with HR then if you still \"fit in\" they will set up an onsite interview with the manager of the office you applied for.", "Interview Questions": "Are you currently employeed? Do you smoke? what are your strengths?  what is your biggest weakness? How do you handle stressful situations? What did you like most and least about your most recent job? Have you ever had to deal with a co-worker that you did not get along with and if so, what did you do? They also have a written paper test that has a few math questions on it and some general but silly questions."}, {"date": "13 Jan 2021", "title": "Data Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Christ Hospital in Mar 2017", "Interview Descriptions": "Reasonable process. Met with team in freestyle interview then with Supervisor in another freestyle interview.  Friendly and comfortable and they relied on your credentials and mostly walked through a workday,", "Interview Questions": "It was freestyle with no scripted questions. "}], [{"date": "8 Feb 2018", "title": "Health Unit Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Christ Hospital (Cincinnati, OH) in Feb 2017", "Interview Descriptions": "I applied on the 10th of January  they emailed me to set up a phone interview for a few days later, after the phone interview she called back about 2 days later to set up face to face interview which was on the 1st of February after the interview they called me with the job offer a week later.", "Interview Questions": "Tell them some of my strengths "}, {"date": "12 Dec 2016", "title": "Speech Language Pathologist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Christ Hospital (Cincinnati, OH)", "Interview Descriptions": "There was one HR meeting that was off site of the main hospital that took forever and sent an unprofessional tone. Then a wonderful interview with the team's manager, onsite.", "Interview Questions": "How would you handle a challenging client/family."}, {"date": "30 Nov 2016", "title": "Patient Access Coordinator Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Christ Hospital (New York, NY)", "Interview Descriptions": "Interview process was very routine. You receive one call to come in and interview. You preform a typing test. You only need to be average in typing to pass it. You receive one more call to tell that you got the job.", "Interview Questions": "Why I wanted to work at Christ. \r\n"}, {"date": "14 Sept 2016", "title": "IT Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "The process took 3 months. I interviewed at Christ Hospital (Cincinnati, OH) in Sept 2016", "Interview Descriptions": "Positive experience form the beginning to the end.  Open and communicative environment that is welcoming. Great environment that is inviting.  Very open and honest. Human resources is awesome.  Great location.", "Interview Questions": "What is your age?"}, {"date": "5 Nov 2015", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Christ Hospital", "Interview Descriptions": "The hiring process included a brief phone interview with questions that were relatively easy. Most questions were about my background and some about my leadership experience. Then I came in and met a lot of people on the team. It took the interviewer a few days to call me back and give me a job offer.", "Interview Questions": "Leadership experience "}, {"date": "28 Jan 2016", "title": "IT Analyst Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 days. I interviewed at Christ Hospital (Cincinnati, OH) in Dec 2014", "Interview Descriptions": "Brief phone interview which entailed reviewing my resume. I was later called to schedule a face to face interview with HR. After the face to face it took several weeks to get me in front of the team to interview. The Group interview went as expected but took HR another month to even get back to me with a decision.", "Interview Questions": "Standard behavioral based interview questions."}, {"date": "20 Jul 2017", "title": "Scheduler-External Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Christ Hospital (Cincinnati, OH) in Dec 2014", "Interview Descriptions": "Online application process is very easy to complete. I transferred internally and took about 3 weeks. Initially applying, the process took almost 3 months; 2 months to be called after submitting my application, 2 weeks to have interview and 2 weeks for hire date. HR process takes too long from the initial application until the initial call. By that time, they may lose good applicants to other facilities, because it takes too long.", "Interview Questions": "How my previous work experience would be applicable to the job I was applying for?"}, {"date": "4 Nov 2015", "title": "Rating Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 4 days. I interviewed at Christ Hospital (Cincinnati, OH) in Dec 2014", "Interview Descriptions": "Interviewed with representative at Aerotek to assess my skills and interest in the position.  I was then scheduled to interview with the company where I would be placed. There I interviewed with two leaders for the department.", "Interview Questions": "How would I adjust to a role that was not in management."}, {"date": "5 Oct 2014", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied in-person. I interviewed at Christ Hospital", "Interview Descriptions": "three step process starting with mandatory online application, followed by email and phone interview, then the face to face interview was conducted in front of a panel. Entire process took months but following the panel interview and offer was given within approximately 2 weeks.", "Interview Questions": "what is your greatest weakness"}, {"date": "10 Jan 2017", "title": "Front Desk Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Christ Hospital (Cincinnati, OH) in May 2014", "Interview Descriptions": "HR rep emailed me to set up a phone interview. After that did a in person interview with HR rep, then interview with manger at floor or office, offer comes from that manger. HR handles the amount of money you will make. Manger will not increase salary, will tell you to refer to HR.", "Interview Questions": "basic interview questions "}], [{"date": "12 Apr 2014", "title": "Patient Care Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Christ Hospital (Cincinnati, OH) in Apr 2014", "Interview Descriptions": "Called three days after I applied for an interview on 5-south.  First you take a test to make sure you can read and do math at a 6th grade level.  Then you interview with an HR manager and if they like you they send you over to the hospital to interview with the unit manager.  Pretty informal questions, I also got a tour of the unit when we were finished", "Interview Questions": "Tell me about a time questions"}, {"date": "24 Jan 2018", "title": "Analyst Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Christ Hospital (Cincinnati, OH) in Apr 2014", "Interview Descriptions": "I applied online through the hospital website. I was contacted for an in person interview with HR which consisted of standard questions on work history. Then I was scheduled to meet with manager and 3 others from department.", "Interview Questions": "Describe a time you had to work with a difficult employee."}, {"date": "10 Oct 2013", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Christ Hospital in Jul 2012", "Interview Descriptions": "This was over a year ago.", "Interview Questions": "N/A"}, {"date": "5 Jul 2012", "title": "Clinical Analyst Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 6 weeks. I interviewed at Christ Hospital (Cincinnati, OH) in Jul 2009", "Interview Descriptions": "The HR department is not capable of screening the resumes of technical and IT people to accurately decide who meets criteria for jobs.  Thus, they never looked at my submitted resume to see if I fit what was a perfect job match.  A recruiter finally got me in the door.  Then the lawyers for the hospital and recruiting firm took almost 2 months to haggle things out since HR didn't want to hire me but I was the only qualified candidate in the city.  It was a mess.", "Interview Questions": "Tell me about yourself"}, {"date": "24 Oct 2012", "title": "Health Unit Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 months. I interviewed at Christ Hospital (Cincinnati, OH) in Nov 2008", "Interview Descriptions": "All applications must be completed online. Once a candidate is potentially chosen, they must complete basic computer, medical terminology, and office skills testing. If those tests are passed, then an interview is scheduled with HR, and then the specific department manager. In some cases, panel interviews are done.", "Interview Questions": "Please try to be as detailed as possible regarding the technical question, business case, etc."}]]