[[{"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "Best Employer in the N.Wales Housing Sector", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "14 Oct 2015", "job_title": "Project Wirker in Conwy, Wales", "duration": "N/A", "pros": "Well to start the wages are higher by £1/2 ph. Than other support / housing providers. Positive about disability (not just tokenism) they really live up to the company values, quality of service, real opportunities for career changes. Good Employee Benefits and deep pockets when it comes to staff training. At £10 per hour having worked for a few year, an 11 hour shift means full time wages on a 3 day week. Great for work life balance. Clwyd Alyn recruit the best. High qualified and experienced staff delivering supported living to mainly 16-25 year olds, as well as havering a seizable housing stock. They also have extra care schemes for 55+'s which I'd like to move to she in older. Great food, choice to cook in your in your flat if you want to. Support Workers on hand daily to organise activities. Quality and Dignity.", "cons": "No organisation is perfect. Anyone can come into a service and start picking holes. Here if there are failings, it's human error that then gets identified and addressed to not occur again. There's no covering up when mistakes are made. Management are transparent and inclusive and participative towards all team members."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Resident Services administrator", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "13 Jul 2016", "job_title": "Resident Services Administrator in Saint Asaph, Wales", "duration": "N/A", "pros": "Being part of a team, great wage, easy to travel to on public transport,", "cons": "currently under review so letting people go"}]]