[[{"date": "20 Apr 2016", "title": "Specialist Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Boley Centers (Saint Petersburg, FL)", "Interview Descriptions": "I got a full tour of the facility and then I had to fill out a piece of paper with a few questions on it, some of them I believe I had already filled out on the application.", "Interview Questions": "What is a strength you have that would help you with the position was is a limitation"}, {"date": "18 May 2015", "title": "Overnight Residential Technician Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Boley Centers (Saint Petersburg, FL) in Oct 2011", "Interview Descriptions": "To make a long story short: apply online, get an interview, get an offer, get finger printed, go through a back ground check, go to orientation, get drug tested; on average two months later you actually start working. When you interview, you interview for a panel of people that you will most likely never see again once you actually start working, with the exception of your supervisor, who you may see every couple of months. There are the general interview questions, however you must also be familiar with treatment models, working with the homeless, the mentally ill, addicts and alcoholics.", "Interview Questions": "What challenges do you expect to encounter working with the chronically homeless population?"}, {"date": "28 Aug 2014", "title": "Retail Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1+ week. I interviewed at Boley Centers (Saint Petersburg, FL) in Jun 2010", "Interview Descriptions": "Standard questions and easy to answer.  Non confrontational and easygoing.  Management is nice and will work with you.  Doesn't take more than a half and hour.  Not much else to say.", "Interview Questions": "N/A"}], []]