[[{"date": "22 Jun 2023", "title": "RN-BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Community Health Network (Indiana) (Indianapolis, IN) in Jun 2023", "Interview Descriptions": "2 interviews was a long process, HR contacted first. Panel of peers interviewed. Not real friendly or helpful in offering information. Interview had the traditional, boring questions. Applied in I deed.", "Interview Questions": "Boring traditional questions like “give an example of a time you had a conflict with a coworker and how did you handle it?”"}, {"date": "23 May 2023", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Community Health Network (Indiana) (Indianapolis, IN)", "Interview Descriptions": "Very easy phone interview first with HR and then a video call interview with department management and small team of nurses from the department. The HR interview was basic and the video interview with the department was ok. The hardest part was the questions from the other nurses. Ha they wanted to make sure they were getting a good teammate!", "Interview Questions": "How do you work in a team?"}, {"date": "13 May 2023", "title": "Associate Recruiter Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Community Health Network (Indiana) (Indianapolis, IN)", "Interview Descriptions": "Thorough process with several interviews with people at multiple levels. Begining with a recruiter, a member of the team and then a panel interview scripted questions were asked. The prices was lengthy but helped me to better understand the culture.", "Interview Questions": "Questions about changing industries to health care."}, {"date": "13 Jun 2023", "title": "Senior Applications Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Community Health Network (Indiana) (Indianapolis, IN) in May 2023", "Interview Descriptions": "Two part interview. One with the hiring manager and director followed by a second peer interview with five of your prospective teammates if they move you forward in the process. STAR questions were used extensively.", "Interview Questions": "Tell me about a time you disagreed with your direct superior. How did you handle it?"}, {"date": "26 Mar 2023", "title": "Provider Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Community Health Network (Indiana)", "Interview Descriptions": "Two team interviews were conducted about a week apart after an initial brief phone interview. One with 2 supervisors and one with 5 possible team members. The interviews were not stressful and allowed exploration of the various topics.", "Interview Questions": "Q. They looked through my education history, picked a course and asked me to describe what I had learned from it."}, {"date": "7 Mar 2023", "title": "RN Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Community Health Network (Indiana)", "Interview Descriptions": "The interview was good, the nurse manager was very friendly. It did not take much time, and they were very thorough. The nurse in charge of employee health was also very helpful. The basic questions were asked, such as what you would do in 'x' situation, experience, challenging experiences, etc.", "Interview Questions": "Can you explain one time you had difficulties with a patient or coworker? How did you handle it?"}, {"date": "25 Feb 2023", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Community Health Network (Indiana)", "Interview Descriptions": "Application - got an auto-email and then heard back from a recruiter Hiring Manager Interview - 1:1, done over Zoom (I lived out of state) Panel Interview with Nurses from the Team - was able to do over the phone, panelists asked easy questions.", "Interview Questions": "Tell me about a time that you had to interact with a difficult colleague resolved it."}, {"date": "5 Dec 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Community Health Network (Indiana)", "Interview Descriptions": "short and sweet I had a multiple panel interview with the managers from the unit there were multiple for my specific position . I was contacted not to far after and offered", "Interview Questions": "strengths and weaknesses were a main theme"}, {"date": "8 Sept 2022", "title": "Patient Care Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Community Health Network (Indiana)", "Interview Descriptions": "The interview process was Very friendly and professional I felt\nComfortable and excited about the company when I left. Interviewer seemed to care not only about me as a possible\nCandidate for\nThe job but also as a mother.", "Interview Questions": "When was a time where  you hand to handle stay calm under pressure. "}, {"date": "10 Oct 2022", "title": "CMA Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Community Health Network (Indiana) in Sept 2022", "Interview Descriptions": "The interview was extensive, a group of people that interview you around the same time. Very detailed questions that were asked to make sure you’re aware of the position and the expectations that are to be met.", "Interview Questions": "How do you handle conflict in the workplace? Tell me about a time you were asked to do something while you were doing another task, how did you respond? Tell us about a time in your life where you broke the rules?"}], [{"date": "26 May 2022", "title": "Data Scientist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Community Health Network (Indiana) (Indianapolis, IN)", "Interview Descriptions": "Joined as an intern, so I was interviewed on the basics and the projects that I did in my course work. They were pretty much looking for compatibility with the team and the work culture. So it was easy for me to be myself.", "Interview Questions": "MS in DS coursework and be strong in statistics basics."}, {"date": "5 May 2022", "title": "Physician Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Community Health Network (Indiana) (Indianapolis, IN) in Apr 2022", "Interview Descriptions": "This was a video interview with surgeon I would be working with. I previously had a call with the recruiter and then the practice manager. I am still in the process of now doing an in-person interview", "Interview Questions": "How did your past and the way you grew up prepare you to be a better PA?"}, {"date": "30 Mar 2022", "title": "Registered Ultrasound Technologist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Community Health Network (Indiana)", "Interview Descriptions": "Very informal. I was brought in for a part-time position, and during the interview I was told that they really needed to hire full-time instead. This caught me off guard and I said I would have to think about it.", "Interview Questions": "Can you work full time?"}, {"date": "8 Feb 2022", "title": "Applications Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Community Health Network (Indiana) (Indianapolis, IN)", "Interview Descriptions": "The interview was a 2-step process. I first met with the manager and then a peer interview is conducted if you move onto the next step. The process was delivered in a clear and concise manner.", "Interview Questions": "How do you handle conflicts? Provide examples."}, {"date": "7 Feb 2022", "title": "Hospitalist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Community Health Network (Indiana)", "Interview Descriptions": "Very easy and welcoming! Low key, low stress, more like a conversation. With recruiter and medical director. Asked the normal questions, nothing out of left field, I felt prepared. Mine was on zoom.", "Interview Questions": "What are your career goals "}, {"date": "17 Sept 2021", "title": "Housekeeping Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Community Health Network (Indiana)", "Interview Descriptions": "Courteous and professional, described details of position and what the hours were. They were not able to discuss exact pay, their HR is centralized and the salary is set by HR administration.", "Interview Questions": "Why are you leaving your current job"}, {"date": "15 Sept 2021", "title": "UC Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Community Health Network (Indiana) (Indianapolis, IN) in Aug 2021", "Interview Descriptions": "Interview process was smooth and personal\r\nInterviewer knew how to communicate and ask thought provoking questions. Would highly recommend this company to anyone interested in healthcare. Look forward to hearing results.", "Interview Questions": "How are you able to keep yourself engaged and productive throughout the day."}, {"date": "28 Jun 2023", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Community Health Network (Indiana) in Aug 2021", "Interview Descriptions": "It was a two step process with an interview with the unit manager and then a second peer interview with unit RNs and a PCT. They asked about my previous experience and also how I would handle certain unit scenarios. It was fairly easy process.", "Interview Questions": "What would you do if you felt there was a safety concern with a patient’s care."}, {"date": "28 Jun 2021", "title": "Clinical Pharmacist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Community Health Network (Indiana)", "Interview Descriptions": "The interview included pharmacists, technicians, students, as well as other pharmacists who called in. They went around the table asking questions in turn. Overall, it wasn't a difficult interview. It was more of a conversation", "Interview Questions": "A time I broke the rules "}, {"date": "25 Jun 2021", "title": "Youth Support Specialist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Community Health Network (Indiana)", "Interview Descriptions": "Applied online, received a call for a brief phone interview. Second interview was in person with the manager of the center. Interview was straight-forward and conversational, and I was given a tour of the center as well.", "Interview Questions": "How did you handle a difficult situation?"}], [{"date": "6 Jul 2021", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Community Health Network (Indiana) (Munster, IN) in Jun 2021", "Interview Descriptions": "It was an hour long interview that went over basic interview questions with the hiring recruiter and hiring manager from the floor. They opened with basic questions and eventually progressed to more open-ended questions. I felt that the questions focused on my personality style versus patient-care.", "Interview Questions": "Why did you decide to go into nursing?"}, {"date": "26 May 2021", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Community Health Network (Indiana)", "Interview Descriptions": "It was direct and to the point. I got a phone call from the Talent Acquisition manager that was a simple phone screen. Then, I was contacted by the hiring manager for a simple conservational phone interview. Then, I came in for a in-person one-on-one with the hiring manager. The final interview was a group interview with the team.", "Interview Questions": "Why do you want to work here"}, {"date": "28 Jul 2021", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Community Health Network (Indiana) (Munster, IL) in May 2021", "Interview Descriptions": "Quick turnaround after application reviewed.  Scheduling and references easy to submit.  No issues with timing.  Options given for position applied for,  Complete picture of organization given,  Low-key.  Not stressful .  Called with offer after references and background check.", "Interview Questions": "Why do you want to work for this organization?\r\n"}, {"date": "22 Apr 2021", "title": "Intern Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Community Health Network (Indiana)", "Interview Descriptions": "The interview was extremely straightforward and the interviewer could most likely see I was nervous. Despite this, they were extremely helpful and after asking about my interests and experience, they explained expectations and standard procedure.", "Interview Questions": "Why do you want to work in healthcare?"}, {"date": "2 Jan 2021", "title": "Social Work Case Manager MSW Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. I interviewed at Community Health Network (Indiana)", "Interview Descriptions": "Too long ago to remember. Believe it was done in a group then individual process. Believe that these processes vary upon individual management.              \r\n\r\nI don’t know what else to add", "Interview Questions": "Don’t remember as it was too long ago"}, {"date": "19 Jan 2021", "title": "Marketing Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Community Health Network (Indiana) (Indianapolis, IN) in Nov 2020", "Interview Descriptions": "The three rounds of interviews included first a 45 minute screening with HR via phone, followed by 1 hour with the hiring manager via video, followed by 1 hour with the team (panel), with a few days between. Feedback is given after final decision.", "Interview Questions": "Tell me about a time when you had to work with someone you found challenging."}, {"date": "16 Oct 2020", "title": "Patient Transporter Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Community Health Network (Indiana) (Indianapolis, IN) in Oct 2020", "Interview Descriptions": "I applied the the recruiter called me less than ten minutes later. We had a brief phone interview (about 15 minutes). \n\nShe passed my information along to the manager and gave me the timeline of about a week to hear back. I heard back in three days. I was invited in for an interview.\n\nThe interview itself was not difficult, and both managers were quite friendly. They did their best to make it a comfortable environment. They then invited me in to shadow the position.\n\nTheir questions are largely behavioral (familiarize yourself with the STAR format) but not difficult whatsoever. \n\nI shadowed with two people from the department for about three hours. During this, I had a peer-to-peer interview with two more people from the department (not managers). Everyone was very nice! \n\nI completed my reference check and was extended an offer. Unfortunately, due to a competing offer with another hospital, I had to turn down this opportunity. It was a difficult decision, but I got the sense that this department is very close-knit.", "Interview Questions": "Describe a time when you had competing priorities. How did you organize these priorities?"}, {"date": "16 Oct 2020", "title": "Patient Service Representative Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Community Health Network (Indiana) (Kokomo, IN) in Sept 2020", "Interview Descriptions": "Applied online and received a phone call from a recruiter a few days later. Basic questions (why did I want to work for their organization, why was I looking for a job, etc) recruiter told me she would forward my information to the hiring manager and if they wanted to move forward I would hear from them about scheduling a in person interview. \nI received a phone call the same day from the hiring manager to schedule an in person interview. This interview lasted literally 15 minutes. I was asked maybe two questions. The interviewer told me all about the job, schedule, uniform, etc. At the conclusion, I was told I would be contacted for a peer-to-peer interview. \nThe following week I went back for my second interview which was with who would be my two coworkers. They took turns asking me questions. The interview was a bit longer but I felt like the “peers” were a bit confrontational with their questioning. \nA week later I was told I was moving forward and asked for references. My references were completed within 48 hours and I was asked back for a THIRD in person interview as I was one of three final candidates. I get wanting to hire the right person and being thorough but three interviews is just overkill. Especially when the first two were spent asking very little about my skills and experiences.  \nI withdrew my application and moved on.", "Interview Questions": "Talk about a time when you had to handle a upset patient"}, {"date": "14 Aug 2020", "title": "Patient Registration Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Community Health Network (Indiana) (Carmel, IN) in Jul 2020", "Interview Descriptions": "Very thorough first with a phone call to see if your qualified. Second you receive another call from manager to offer you an interview. Third you meet with manager and supervisor for interview. Fourth you have 3 test to pass, Fifth you get a job offer if you pass the tests then they do back ground and reference checks. Lastly you have to have all health completed before start work.", "Interview Questions": "Tell me a time you had a conflict at your job and how did you over come it?"}, {"date": "30 Mar 2020", "title": "Project Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Community Health Network (Indiana) (Indianapolis, IN) in Feb 2020", "Interview Descriptions": "Applied for position, ten days later received a text from associate recruiter to set up a phone interview with hiring manager. Agreed upon time, then a couple of days later hiring manager called to change the time. Phone interview was terrible. Interview seemed rushed, cut off answers. Never expected to get an in person. I get there and am sat in a break room with other people before the hiring manager comes to get her coffee. I am then taken upstairs to a conference room with three others and hiring manager. Only they had not scheduled the room and there was another meeting that people were standing outside of the door waiting. Everyone had one question, rigid 30 minute schedule. Everyone introduced themselves at handshake. No mention of what they did on the team or their part in this process. No follow up, just a rejection email nine days later.", "Interview Questions": "How do you start a project?\r\n"}], [{"date": "27 Jul 2020", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Community Health Network (Indiana) (Indianapolis, IN) in Feb 2020", "Interview Descriptions": "Recruiter calls and sets up interview with unit manager.  Peer interview with nurses and techs.  Very structured questions. Then speak with manager about same questions. Very informal wearing scrubs.  Then shadow on the unit to follow around a nurse and get to experience med pass and assessments with someone who works there and get a tour of the unit.", "Interview Questions": "Tell me about a time when you went above and beyond for a patient. "}, {"date": "3 May 2021", "title": "Advanced Patient Care Technician Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Community Health Network (Indiana) (Indianapolis, IN) in Jan 2020", "Interview Descriptions": "Interview process was extremely long. Took 2 month after applying s to receive an interview, and it was not for the floor I originally applied for. Took 2 more months for job offer. Could not accept offer due to school schedule but was offered the position after school ended. Overall, the entire process took 4 months from interview to job start.", "Interview Questions": "Name a time where you witnessed an individual do something they were not supposed to do and how to handled it."}, {"date": "19 Aug 2019", "title": "Certified Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Community Health Network (Indiana) (Fortville, IN)", "Interview Descriptions": "Put my application in through Community website in 2010 and received a call two to three days later.  I had an interview in person a couple of days later.", "Interview Questions": "Why is there a gap in you employment history?"}, {"date": "14 Jun 2023", "title": "Pharmacy Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Community Health Network (Indiana) (Indianapolis, IN) in May 2019", "Interview Descriptions": "Manager interviews normally first and then peer interviews if management liked you. Most all interviews are scenario based questions. Tell me a time when…. Overall, general interview. Time for questions at the end.", "Interview Questions": "Tell me a time when you had conflict with a coworker."}, {"date": "29 Dec 2019", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Community Health Network (Indiana) (Indianapolis, IN) in Mar 2019", "Interview Descriptions": "The interview process is thorough, yet honest.  I really appreciated how much they genuinely care about who they are hiring, particularly for interns.  I have always been told that interns are replaceable, but at Community they made us each feel valued and listened to during our interview.", "Interview Questions": "How do you plan to use this experience in your future? "}, {"date": "13 Jun 2021", "title": "ICU Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Community Health Network (Indiana) (Indianapolis, IN) in Feb 2019", "Interview Descriptions": "Recruiter reaches out with a few questions about background and nursing interest. Then interview with manager and peer interview with 2 ICU nurses. With opportunity for 2 hour shadow experience on unit", "Interview Questions": "Tell me about a time you went above and beyond for a patient or family. "}, {"date": "28 Oct 2019", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Community Health Network (Indiana) in Dec 2018", "Interview Descriptions": "3 week process. Starts with HR then management will reach out to you to schedule interviews if interested. You then sit down with the unit manager and then peer interview if they see fit.", "Interview Questions": "How do you resolve a conflict with coworkers?"}, {"date": "9 Jul 2022", "title": "ESL/Hispanic Community Outreach Director Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Community Health Network (Indiana) (Indianapolis, IN) in Dec 2018", "Interview Descriptions": "Pre screening by HR department, interview was with three members of the leadership team. They was some offense taken when I asked them their philosophy of actual engagement and leadership, and attitude about community partnerships.", "Interview Questions": "They asked about the process of community engagement, familiarity with their work and the matrix structure."}, {"date": "18 Oct 2018", "title": "Anonymous Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Community Health Network (Indiana)", "Interview Descriptions": "I only had phone interview because job had changed from what they posted. Recruiter was very nice and asked general questions you would expect for a first round of interviews.", "Interview Questions": "Why do you want to work here? Why do you want this job? Salary expectations? Tell me more about what you do in your current position."}, {"date": "1 Nov 2018", "title": "Patient Access Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Community Health Network (Indiana) (Indianapolis, IN) in Oct 2018", "Interview Descriptions": "Applied online through the website. Received a call about a week later from the manager who briefly went over the position and my background.  A face to face interview was set up for a few days later. I met with the manager and supervisor who asked about my background and they went into more detail regarding the position, training, hours, etc. They asked if I had time to do a peer to peer interview. Since I did a peer to peer interview was completed with the other staff members.  After that they advised that I would hear back in a few days. I also had to pass a basic math, customer service and typing test. I took the tests and passed. In 2 days I received an offer which I accepted.", "Interview Questions": "Tell me about yourself?"}], [{"date": "23 Sept 2018", "title": "Talent & Organizational Effectiveness Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Community Health Network (Indiana)", "Interview Descriptions": "I had one phone interview with the Hiring Manager and one in-person interview with the whole team. Not too tough, just asked regular behavioral type questions. In-person interview lasted 30-45 minutes.", "Interview Questions": "Tell me three words your friends would use to describe you. "}, {"date": "31 Aug 2018", "title": "Pharmacist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Community Health Network (Indiana) (Indianapolis, IN)", "Interview Descriptions": "Phone interview followed a scheduled in-person interview. References were requested before meeting anyone. The interview was typical and people seemed very nice. Rejected before all references entered had a chance to respond. Requesting references before meeting me and rejecting before all had a chance to respond made the process seem insincere.", "Interview Questions": "What I like to do outside of work"}, {"date": "3 Jul 2018", "title": "Customer Service Representative( Revenue Department) Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Community Health Network (Indiana) (Indianapolis, IN) in Jul 2018", "Interview Descriptions": "Applied to this job about 3 weeks again. The interview was horrible. There was 3 of them in the room. 1st they were late and they did not apologize for being late. Then when we got to the interview room they all looked like they we’re tired from the day. Or like I had been wasting there time when I was answering the question. Idk if I got this job or not I don’t care at this point but I would not want to work here. It seemed like a very negative environment. It was  a waste of my valuable time to do this interview. I felt interrogated and asked questions they had nothing to do with the job. And on the application is says customer service. It says noting about collections.", "Interview Questions": "How do you fit an giraffe into a refrigerator with an elephant in it. What would you do if someone recived someone else mail. Would not work here. When walking in the call center every one looked stressed out."}, {"date": "19 Aug 2019", "title": "Health Advocate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Community Health Network (Indiana) (Indianapolis, IN) in Jul 2018", "Interview Descriptions": "I went through  a series of interviews including a phone interview, a one on one with my direct manager, and finally a panel interview. It was an extensive process that prepared me well for the job.", "Interview Questions": "Tell me about your experiences so far that relate to this position and make you a good fit. "}, {"date": "21 Jul 2020", "title": "Licensed Practical Nurse (LPN) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Community Health Network (Indiana) in Jul 2018", "Interview Descriptions": "Apply online, if a good fit, you will get a call back from an HR recruiter. They will talk more about the position with you & then send you to an interview with management. If they like you, then you go on to do a peer interview.", "Interview Questions": "Tell me about a time in your clinical experience that you had to overcome a difficult time and how you handled that. "}, {"date": "25 Jul 2018", "title": "Customer Service Representative Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Community Health Network (Indiana) (Indianapolis, IN) in Jul 2018", "Interview Descriptions": "Interview process was questions about your customer experience. My interview was cut short, so I couldn’t finish. I didn’t get a call back to reschedule, but I did receive a rejection email.", "Interview Questions": "Tell me about a time a customer you helped and succeeded?"}, {"date": "17 Jul 2018", "title": "Nurse Extern Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Community Health Network (Indiana) (Indianapolis, IN) in Jun 2018", "Interview Descriptions": "i received a phone call from HR after a week from applying.  After two weeks set up a meeting with the nurse manager. the next day got the peer interview.  Everyone was friendly and welling to help.", "Interview Questions": "Why nursing?\r\nHow you deal with hostile patient?"}, {"date": "18 Apr 2018", "title": "Patient Access Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Community Health Network (Indiana)", "Interview Descriptions": "Very formal, had to interview with the Manager first, then completed a peer interview.  The initial phone interview was with the team leader who asked the usual interview questions,\"why I applied for the position\".", "Interview Questions": "The interview was average, many of the usual interview questions.  The peer interview was informal."}, {"date": "6 Apr 2018", "title": "Corporate Communications Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at Community Health Network (Indiana)", "Interview Descriptions": "Right around the winter holidays, someone from HR reached out via email and said she wanted to do a phone interview. All she said was to call her sometime in the following two days. But because of the holidays and the fact I was working full-time, I wanted to confirm her office hours, so I sent her an email back. I didn't hear back the next day, so I decided to give her a call. She did not answer, so I left a voicemail....and she never ended up calling or emailing me back. So unprofessional and a complete turn-off for the entire organization. If your HR staff can't even handle basic communication, why in the world would I trust that you would be a good employer?!", "Interview Questions": "N/A"}, {"date": "6 Nov 2017", "title": "Developer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 4 weeks. I interviewed at Community Health Network (Indiana) (Indianapolis, IN)", "Interview Descriptions": "I got the job lead through a recruiter.  The interview process included two phone interviews and a face to face interview.  The face to face interview was in front of a panel of people.", "Interview Questions": "N/A"}], [{"date": "20 Aug 2020", "title": "Licensed Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Community Health Network (Indiana) (Indianapolis, IN) in Nov 2017", "Interview Descriptions": "Several interviews including peer interview.  Prompt feedback from interview. Flexibility scheduling interview.  Interview process included option for short tour of agency and introductions to some staff.  Style was conversational allowing for direct questions and responses.", "Interview Questions": "How would I describe my work ethic?"}, {"date": "18 Apr 2019", "title": "Life Skills Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Community Health Network (Indiana) in Nov 2017", "Interview Descriptions": "Not sure if my experience was typical, but I came in for two interviews: each one with two program managers from different teams. I was asked fairly standard interview questions (career goals, strengths and areas of growth, etc), along with questions about how I would handle specific situations with clients.", "Interview Questions": "What are your career goals?"}, {"date": "31 Oct 2017", "title": "Supervisor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Community Health Network (Indiana) (Indianapolis, IN) in Oct 2017", "Interview Descriptions": "It was ok and I believed that they would see the heart and determination that I could have brought to their organization. The experience that I had to lead and be apart of a successful group plan. But all they could see is that I didn't have all the skills that they all had at the table. They didnt see a dedicated worker they saw someone who wasnt them.", "Interview Questions": "What is one of your weaknesses?"}, {"date": "18 Oct 2017", "title": "Marketing Coordinator Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Community Health Network (Indiana) (Indianapolis, IN) in Oct 2017", "Interview Descriptions": "Very relaxed and comfortable.  Did not feel nervous or uptight.  Interviewee was very personable.  Don't really have thirty words to type so I am just going to put this in.", "Interview Questions": "N/A"}, {"date": "26 May 2018", "title": "Patient Care Technician Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Community Health Network (Indiana) (Greenwood, IN) in Aug 2017", "Interview Descriptions": "My now manager forgot i had an interview so had to reschedule for the next day.  Had a face to face with manager, and then sat time for a peer interview.", "Interview Questions": "Explain a time where you had to multi-task a difficult situation"}, {"date": "25 Jul 2017", "title": "ICU RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Community Health Network (Indiana)", "Interview Descriptions": "HR interview-- on the phone. Was the connected to manager of unit\r\nUnit Interview--15ish minute interview. Standard interview questions. Then had peer interview.\r\nUnit Peer Interview--3 RNs on unit asked questions. Followed by job shadow on unit.", "Interview Questions": "What makes you want to work at Community"}, {"date": "9 Nov 2017", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. The process took 3 weeks. I interviewed at Community Health Network (Indiana) (Indianapolis, IN) in Jul 2017", "Interview Descriptions": "I submitted my resume for a graduate school level practicum, received a call for an interview within 7 days, interviewed with the supervisor of the position applying for, received confirmation within 12 days.", "Interview Questions": "What do you do for self care? How will you balance your school and work while doing a practicum at this site?"}, {"date": "21 Jul 2021", "title": "Patient Access Representative Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Community Health Network (Indiana) (Indianapolis, IN) in Jun 2017", "Interview Descriptions": "We use the STAR interview process. It is VERY important to answer each part of the question. Tell me about a time when you... How did you handle the situation?  What was the outcome?", "Interview Questions": "Tell me about a time when a co-worker was not handling their share of the workload. What did you do and what was the outcome?"}, {"date": "22 Sept 2021", "title": "Certified Surgical Technologist Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Community Health Network (Indiana) (Indianapolis, IN) in May 2017", "Interview Descriptions": "It was a very brief process with minor questions. Felt like they were looking for a warm body, not really particular on education or experience. Entire interview wrapped up in less than 10 min.", "Interview Questions": "How do you deal with a difficult surgeon?"}, {"date": "1 Aug 2017", "title": "Registered Nurse Case Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Community Health Network (Indiana) (Indianapolis, IN) in Feb 2017", "Interview Descriptions": "Very easy. Submitted application and resume on line on Monday; a scheduler called me by Thursday. Interviewed in conference room with 2 administrators. Interview was around 50-55 minutes.  I felt both female managers were slightly immature and catty. The entire interview was uneasy and unorganized. Both interviewers seemed to have their own agenda for the function/role of this particular position. It was a newly created role and the managers were very conflictive about how they wanted the chosen candidate to fulfill the title. Just a very unpleasant experience all around.", "Interview Questions": "Describe a mistake you've made and how handled it and used it as a learning opportunity."}], [{"date": "27 Dec 2016", "title": "Patient Access Representative Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Community Health Network (Indiana) (Indianapolis, IN) in Jul 2016", "Interview Descriptions": "Asked basic questions overall the interview was professional. I looked like the manager was nice and organized in the beginning but her true colors came out after the first week.", "Interview Questions": "What were my weaknesses?"}, {"date": "11 May 2016", "title": "School Based Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 2 weeks. I interviewed at Community Health Network (Indiana)", "Interview Descriptions": "Easy, pleasant, the people who interviewed me were engaged and kind. The whole process was enjoyable, and I didn't feel like there were any \"trick\" questions. Overall I felt the process was transparent and appropriate. I did two interviews with a number of different individuals, and one with the main director of the program.", "Interview Questions": "Where do you see yourself in five years"}, {"date": "10 Apr 2016", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 5 days. I interviewed at Community Health Network (Indiana) (Indianapolis, IN)", "Interview Descriptions": "The interview was with 2 managers in a conference room. They were very personable and easy to connect with. The interview was very thorough, and I was questioned by how I would respond to many different types of situations.\r\nThat was over 10 years ago and I have to say I'm sure things have changed now that the peer interview has been added to the process.", "Interview Questions": "What is one of your weaknesses?"}, {"date": "26 May 2016", "title": "Administrative Secretary Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Community Health Network (Indiana) (Indianapolis, IN) in Mar 2016", "Interview Descriptions": "I was contacted first by a corporate recruiter, then an HR assistant, then I had the interview, then the interview was set up, then the interview. The interview only took about 20 minutes.", "Interview Questions": "Give me an example of when you felt overwhelmed and how you handled it. Give me an example of a time when you went above and beyond. Give me an example of when you disagreed with a superior and how you handled it."}, {"date": "27 Jul 2017", "title": "PMHNP Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Community Health Network (Indiana) (South Bend, IN) in Jan 2016", "Interview Descriptions": "Interviewed with four mgmt staff panel style. Answered questions about my past experience and things I would like to accoplish in the mental heatlh field. Also discussed the mission of the company and if I thought I would be a good fit", "Interview Questions": "Discuss a difficult scenario you were in and how you handled it "}, {"date": "18 Feb 2016", "title": "Experience Intelligence Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 8 weeks. I interviewed at Community Health Network (Indiana) (Indianapolis, IN) in Dec 2015", "Interview Descriptions": "Started with a phone interview after 8 pm.   Interview scheduled 2 weeks out due to holidays. Entire team participates in the interview, each responsible for specific questions.   Due to holidays didn't make a decision for several weeks.   Not sure position has actually been filled.   I believe they re-opened up again for more applicants.", "Interview Questions": "Don't remember specifics but definitely looking for STAR responses to every question."}, {"date": "9 Mar 2016", "title": "Life Skills Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Community Health Network (Indiana) (Indianapolis, IN) in Aug 2015", "Interview Descriptions": "The first interview was a peer interview which featured team members on the team you would be apart of it. The second part of the interview was an interview with the management team. The management team asked questions in regards to how you would handle yourself in certain situations, they ask about your experience and where do you see yourself going.", "Interview Questions": "They asked for you to take negative statements and turn them into strength based statement which can be tricky. The interview with management was based upon situational questions and background information."}, {"date": "26 Jun 2015", "title": "Environmental Services Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Community Health Network (Indiana) in Jun 2015", "Interview Descriptions": "I received a phone interview first then after that one I moved on to the 3 panel interview which was fairly easy they all asked questions about different situations that I've been in at previous jobs.", "Interview Questions": "Describe a time where I had to go above and beyond for someone ( family, friends, Co workers, customers)"}, {"date": "2 Jun 2015", "title": "Youth Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Community Health Network (Indiana) (Indianapolis, IN) in Jun 2015", "Interview Descriptions": "Fast and concise. After phone interview with corporate. Department will interview you  and make final decision from there. Corporate will then contact you with offer and proceedings henceforth if you accept offer. Drug test, CPS check and criminal background check etc", "Interview Questions": "How do you feel towards working with youth with behavioral issues?"}, {"date": "11 Sept 2016", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Community Health Network (Indiana) (Indianapolis, IN) in May 2015", "Interview Descriptions": "The first interview was with human resources it was pretty standard checking to make sure I was a viable candidate second interview was with nurse on the floor I think to make sure our personalities would match got to meet some coworkers got to see the floor got to hear detailed description of what the job would be like had to answer a lot of technical questions had to answer a lot of situational questions and was very nerve-racking", "Interview Questions": "Why do you want to work here instead of another place"}], [{"date": "16 Oct 2018", "title": "EVP Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Community Health Network (Indiana) (Indianapolis, IN) in Jan 2015", "Interview Descriptions": "very good interview process and thorough. they do the right due diligence3 not sure what else to add to these comments still not sure what to add to this page", "Interview Questions": "What are your best qualities"}, {"date": "29 Sept 2017", "title": "Analyst Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Community Health Network (Indiana) (Indianapolis, IN) in Jan 2015", "Interview Descriptions": "Initial interview with the hiring manager.  The second interview might be with a peer review panel.  The last might be with leadership from various areas.  The overall process takes weeks or more.", "Interview Questions": "Tell me about a time when you encountered competing task.  What was the task and how did you decide what would take precedence. "}, {"date": "19 Oct 2014", "title": "Patient Accounts Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Community Health Network (Indiana) (Indianapolis, IN) in Aug 2014", "Interview Descriptions": "I applied for the Patient Accounts Specialist which is an insurance billing position located in Castleton near Costco. I applied in July and got a phone call in August asking me to schedule an interview with the hiring manager. After 3 weeks of the first interview, I was asked to have a second interview (peers interview). I never got a reply if the job is going to be offered to me. I emailed HR, no reply. I emailed the hiring manager, no reply.\r\n\r\nI got an email later on from HR \"after 1 week from my email\" indicating that they are still interviewing other candidates, and I never heard back from them. They still have the position open.\r\n\r\nI like the hiring manager, she seemed diplomatic, I sensed the team lead in the peer interview was not that nice.", "Interview Questions": "How would you handle a situation where you are asked to do a task while you have multiple tasks on your schedule?"}, {"date": "16 Jun 2014", "title": "Associate Recruiter Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at Community Health Network (Indiana)", "Interview Descriptions": "Phone screen was first, then references and once that was complete went in for an interview with the hiring manager. The recruiter then contacted me to make an offer. I completed the background and drug screen. Started 2 weeks later.", "Interview Questions": "Behavior based questions can be tough!"}, {"date": "7 Apr 2014", "title": "Anonymous Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Community Health Network (Indiana) (Indianapolis, IN) in Apr 2014", "Interview Descriptions": "It took three weeks to get a call for an interview. Then once the rep called the interview was still a week later. There were two interviews. The first one was with the supervisor then the next was with to senior reps that have been with the company for a while. Very professional and laid back.", "Interview Questions": "No hard questions. The supervisor just wanted to know about my experience. Then they gave great information about the position and company. "}, {"date": "20 Jun 2015", "title": "Patient Access Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Community Health Network (Indiana) (Castleton, IN) in Apr 2014", "Interview Descriptions": "i attended a job fair, and the process moved along quickly and smoothly.  I took an assessment after my interview, which included basic math and customer service skills.  I then moved forward to meet with a peer interview, which included 3 peers.  They asked a multitude of questions in a round table type discussion - taking turns asking a couple questions each.", "Interview Questions": "where do i see myself in 2 years?"}, {"date": "17 Nov 2014", "title": "Patient Access Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Community Health Network (Indiana) in Feb 2014", "Interview Descriptions": "I had three interviews. First was with an HR rep, second was with management, and third was a peer interview. After all interviews were complete I was asked to submit five references online, 3 had to be managers.", "Interview Questions": "Asked for multiple examples from my work experience."}, {"date": "14 May 2015", "title": "Outpatient Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at Community Health Network (Indiana) (Indianapolis, IN) in Nov 2013", "Interview Descriptions": "I had an interview one-on-one with the boss and came back for a second interview with the team. The team asked a lot of application type questions.The individual interview was mostly seeing if my personality clicked with the boss's and answering my questions.", "Interview Questions": "Tell us about a time you disagreed with a co-worker?"}, {"date": "16 Jul 2013", "title": "Receptionist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Community Health Network (Indiana) (Indianapolis, IN)", "Interview Descriptions": "I became aware of a new position within Community that would give me standard hours and take me from part-time to full-time. I applied online and was called for an interview within a few days. Because I was already an employee, the testing and background checks were unnecessary to complete.", "Interview Questions": "\"What was the greatest difficulty you had to overcome and how did you accomplish it?\" Very difficult for me to answer because I didn't want to say something was difficult they considered easy and vice versa. I went with an honest answer and it worked."}, {"date": "6 Apr 2015", "title": "Certified Surgical Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Community Health Network (Indiana) (Indianapolis, IN) in Mar 2013", "Interview Descriptions": "Received a call for an interview within two days of submitting my application, met with director of department that same week, it was too hectic to shadow someone that day so I returned another day that week to shadow a current employee. Received a job offer call from HR in a matter of days. They didn't when I interviewed, but they now do a peer interview if you make it through the director or manager interview.", "Interview Questions": "What was a time that I faced adversity in the workplace and how did I handle it"}], [{"date": "27 May 2016", "title": "Patient Access Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Community Health Network (Indiana) (Indianapolis, IN) in May 2012", "Interview Descriptions": "First interview was with Patient Access Supervisor and Second was with the Manager, now I believe they do a peer review as well. They gave clear guidelines about the position and what all it would entail as well as hours and days available (not so sure they still do this now) Also gave you plenty opportunities to ask any questions you had about the position or benefits offered.", "Interview Questions": "Why do you want to work for this company?"}, {"date": "13 Mar 2015", "title": "Trainer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Community Health Network (Indiana) (Indianapolis, IN) in Mar 2012", "Interview Descriptions": "1st interview was with HR going over the position and my resume. 2nd interview is a 15 minute presentation that is assigned to you a week before the interview (You choose the topic). I think they do peer to peer interviews now.", "Interview Questions": "Regular interview questions"}, {"date": "7 Dec 2013", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 4 weeks. I interviewed at Community Health Network (Indiana) (Indianapolis, IN) in Feb 2012", "Interview Descriptions": "Was more then frustrating. First I was told I was not qualified for a Internal new grad RN position, after finishing my nursing degree, (I had 17 years of hospital clinical patient experience in mental health and laboratory).  Which I then found out why was because my old manager in the network gave me a negative reference, which she later apologized for because she did not want me to leave the department. Then the HR department thought I didn't show up for interview and job shadow when I in fact did. They confused me with another candidate. The final process was I was promised an addition pay for previous experience and education and was later told it would happen because management said no as it would create conflict with other employees.", "Interview Questions": "None to be honest. They did ask me a few questions about experiences outside of health care"}, {"date": "16 Sept 2016", "title": "Recruiter Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 7 weeks. I interviewed at Community Health Network (Indiana) (Indianapolis, IN) in Jan 2012", "Interview Descriptions": "Multi-person interview with questions about detailed work experience in human resources.  Situation based questions.  Typing and basic Excel testing.  Did not call my references but did have to give copy of official college transcript mailed directly from college.", "Interview Questions": "Tell us about your previously human resources experience."}, {"date": "11 Jul 2015", "title": "Clinical Liaison Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Community Health Network (Indiana) (Indianapolis, IN) in Apr 2011", "Interview Descriptions": "Multiple interviews, standard questions such as: why do you want to work for Community Health Network, what skills make you a good fit for this position, what would your peers say about you, in your past employment what managers have you liked and disliked and why.", "Interview Questions": "standard questions...why do you want to work for Community Health Network"}]]