[[{"date": "10 Oct 2022", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Anthony Nolan", "Interview Descriptions": "I submitted an application form, followed by one interview with a task - I was interviewed by two members of the team, and it was held remotely. I was provided with the outcome of the interview quickly by the hiring manager.", "Interview Questions": "Why do you want to work in this role?"}, {"date": "8 Oct 2022", "title": "Director of Register Development Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Anthony Nolan in Apr 2022", "Interview Descriptions": "I was head hunted by their Recruitment Manager on LinkedIn, sent a candidate pack and encouraged to apply for the role. I did, and was invited to a virtual interview led by their Chief Engagement Officer and their Director of People. I did note that the role had gone out to advert across various platforms at different times with different deadlines, which I did find concerning. The interview was pleasant. I was advised that if successful, I would be invited to a second interview, but was informed by email three days later that they wouldn’t be taking my application further.", "Interview Questions": "They asked about me, my understanding of their work, my experiences and how I’d leverage this experience to gain greater outcomes for the charity and the people who benefit from their work. "}, {"date": "21 Oct 2021", "title": "CTC Laboratory Scientist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Anthony Nolan in Oct 2021", "Interview Descriptions": "Panel interview, all members were friendly and supportive. It was a simple question and answer interview online - I had some technical problems at the start of the interview but everyone was patient and the rest of the interview went smoothly.", "Interview Questions": "What achievement are you most proud of?"}, {"date": "5 Nov 2021", "title": "Recruitment Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Anthony Nolan (London, England) in Sept 2021", "Interview Descriptions": "Really smooth, good communication before and after each stage, and all of the interviewers were lovely and welcoming and made me feel at ease throughout  - more like a conversation. Got to meet potential peers as well which was helpful to provide a slightly different perspective and get to know people I'd be working with if offered the job. Overall really positive!", "Interview Questions": "Approach to recruiting a diverse workforce and attracting people from diverse backgrounds to apply to jobs at the company.\nHow to ensure a best-in-class candidate experience."}, {"date": "20 Aug 2021", "title": "Laboratory Scientist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Anthony Nolan (London, England) in Jul 2021", "Interview Descriptions": "Applied online and got an invitation to interview within a week. I had 3 people in the interview over zoom and it lasted approximately an hour. Overall they were nice and professional.", "Interview Questions": "What are the pros and cons of working in an automate laboratory?\n"}, {"date": "14 Jun 2021", "title": "Senior Database Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Anthony Nolan (London, England) in Jun 2021", "Interview Descriptions": "Filled in application with many text boxes on their website. \r\nExplained my motivation for applying and what I knew about the job and company.\r\n\r\nReceived an email with an invite to an interview by video call.", "Interview Questions": "Why do you want to work here? What do you know about us?..Sent a MS Excel task which I could not make sense of during the interview and I said I could not complete and therefore would not continue. \r\nThey said it was only part of the interview so then went ahead . The interview started with two interviewers asking very general questions and asking several questions at once.\r\nThe third interviewer then joined the call towards the end and repeated the exact same questions I was asked earlier by the first two interviewer. I was then asked multiple questions at once again with one of the questions being another repeat . I pointed this out and the interviewer appeared annoyed and had a sarcastic tone saying \"shall I ask them one by one?\" I replied \"yes\". It has already been two weeks and I have not heard anything back so I assume I was unsuccessful, not that I would want to work at a company that conducts interviews like this."}, {"date": "26 Feb 2021", "title": "Talent Acquisition Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Anthony Nolan (London, England) in Feb 2021", "Interview Descriptions": "An unengaging interview process from an organisation which prides itself on being caring. \r\nI received an interview invite for 3 weeks ahead, with no pre-screening.\r\nThe interview itself was an in-depth review of my experience with a range of average and some trickier questions. The interview panel were friendly, created a relaxed experience and gave a positive overview of the company. \r\nHowever it was until the end of the interview that I got an overview and greater understanding of the position. \r\nIt took a further 3 weeks for them to tell that I have been unsuccessful for the role and they will not provide feedback due to volume of applicants. Which is very disregarding of the effort put into researching the company, the role and interview preparation.  Not to mention double standards, of expecting a high level of organisation research whilst not being prepared to put any effort into your candidate journey.", "Interview Questions": "What do you know about Anthony Nolan?"}, {"date": "9 Oct 2020", "title": "Data Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Anthony Nolan", "Interview Descriptions": "The interview was friendly with two people on the panel. There were couple of technical and competency questions and it was for an hour.\r\nBoth the panel members were randomly throwing questions.", "Interview Questions": "Describe one difficult situation you faced at your workplace"}, {"date": "2 Aug 2021", "title": "Cord Blood Collector Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Anthony Nolan (Leicester, England) in Jul 2020", "Interview Descriptions": "Online application, invited for interview in hospital with two managers.\r\nOne manager was extremely passive aggressive when I incorrectly mentioned something I researched about the company. For a charitable organisation it is disappointing to see such managers in positions. Left the interview extremely distraught", "Interview Questions": "What do you know about private and public cord blood collection?"}, {"date": "28 Jan 2020", "title": "Cord Blood Collector Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Anthony Nolan in Jan 2020", "Interview Descriptions": "Easy application process.\r\n\r\nWithin the interview it was carried out by two people.\r\nVery cold and negative interview, wasn’t greeted, never shook my hand, showed no interest in me nor doing the interview point blank.\r\nOne of the interviewers expressed she wanted to go ‘back home to her city’ \r\nDespite telling me they have a lot of people to interview so I would be contacted later after they were all conducted. \r\n\r\nTo then receive my ‘apologies but you did not get the job..’ email an hour after.  \r\nI have now found out they gave the job to the first person they interviewed. \r\n\r\nUnfair and awful interview.", "Interview Questions": "What do you know about Anthony Nolan?"}], [{"date": "11 Jan 2020", "title": "Quality Assurance Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Anthony Nolan (London, England) in Nov 2019", "Interview Descriptions": "Panel interview consisting of 3 staff; competency based questions and presentation. The interview room was very small and cramped - barely big enough to fit in 4 people.  It was also not set up for presentations so instead had to use laptop as the presentation screen located on the other side of the table operated by one of the panel - not ideal really. (Maybe this was part of the assessment). Few, actually no, questions tested the knowledge and experience asked for in the job description", "Interview Questions": "Why do you want to work at Anthony Nolan?"}, {"date": "23 Sept 2019", "title": "Public Affairs and Events Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Anthony Nolan", "Interview Descriptions": "45-minute panel interview with a take-home written test. Interviewed by two people, both at manager level, both of which were friendly and approachable. They made notes throughout the interview which could be slightly confusing.", "Interview Questions": "Name a campaign you have been following in the news over the past year and tell us what you liked/did not like about this campaign?\r\n\r\nOther questions involved situational-based questions and how you would respond to particular issues."}, {"date": "4 Aug 2018", "title": "Lab Scientist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Anthony Nolan (London, England) in Jul 2018", "Interview Descriptions": "It was daunting, it was a panel. All asking different questions rhat did not flow, there was even a business manager on the panel and asked “would you like to know what I do?” - overrall it was a bit daunting, scripted, all ready off questions to answer", "Interview Questions": "Why did you apply "}, {"date": "16 May 2019", "title": "Lab Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Anthony Nolan (London, England) in Mar 2018", "Interview Descriptions": "After my application was reviewed I was invited to a panel interview that consisted of competency based questions and test for knowledge. This was followed by the tour of the facilities.", "Interview Questions": "What can you tell us about Anthony Nolan?"}, {"date": "19 Mar 2018", "title": "Junior Software Engineer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Anthony Nolan (London, England) in Feb 2018", "Interview Descriptions": "It was mainly a technical interview with two senior developers.  They listened, asked relevant questions. They were easy to talk to.  They explained briefly if I coundn't answer any question. They gave good detailed answers to my questions.", "Interview Questions": "Javascript technical questions"}, {"date": "22 Jan 2018", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Anthony Nolan (London, England)", "Interview Descriptions": "I haven't yet heard the outcome of my interview, but I found the interview experience to be positive, and was happy with how everything went.\r\n\r\nMy interview began with a 10 minute powerpoint presentation about a research project I had conducted (e.g. a BSc or MSc research project) followed with maybe 5 minutes of questions.\r\n\r\nAfter this I had what i'd consider to be a pretty nice, standard interview for a lab-based job. \r\nQuestions topics asking: \r\n- why do you want the job/ work for us etc.?, \r\n- what can you tell us about the charity?, \r\n- what skills/experience can you offer? (and a few follow-up questions about key skills/techniques),\r\n- essentially, asking whether you can work as a team & independently?\r\n- do you have any questions to ask the panel?\r\n\r\nFinally I was given a tour of the lab facilities, which I found helpful - I like to see my potential place of work to get a judge of the facilities, equipment, office spaces etc.", "Interview Questions": "E.g. what skills/experience can you offer?"}, {"date": "18 Oct 2019", "title": "Graphic Designer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 1 week. I interviewed at Anthony Nolan (London, England) in Mar 2017", "Interview Descriptions": "Well structured and friendly interview with an opportunity to present your portfolio to showcase your work accompanied by relevant questions based on experience, your skills and what you'd bring to the organisation, followed by a design skill test.", "Interview Questions": "What will you bring to Anthony Nolan"}, {"date": "21 Apr 2016", "title": "Data Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Anthony Nolan (Hampstead, England) in Apr 2016", "Interview Descriptions": "I applied on their website using my CV and Cover Letter.\r\nI got an email after the closing date with attachment of documents to use in preparing for the interview.\r\nI got another email in less than a week telling me I was not successful.\r\n\r\nWhole process was about 2 weeks.\r\n\r\nSalary was about 32k.\r\n\r\nI did not get a feel of the company at all as the entrance looked like a prison. \r\n\r\nI sat at the reception for  while and was was then transferred to a bland looking meeting room.", "Interview Questions": "They asked loads of questions. About three pages of questions, scribbling quickly aswell to note the answers. It was like they were playing good cop, bad cop. One was smiling excessively and was way too nice. The other looked like she wanted to be somewhere else.\r\n\r\n-What do you understand by the role?\r\n-What other skills do you posses that are relevant to these role?\r\n-Give an example of how you have convinced people to change their ways of doing things?\r\n-Take me through your recent experience and how it fits into this role?\r\n-How do you work with a team?\r\n-Why are you leaving your current role?\r\n-How do you ensure the accuracy of your report?\r\n-Motivation for wanting to work at Anthony Nolan?\r\n-How do you get along with your team mates?\r\n-How will your colleagues/employees describe you?\r\n-How do you go about preparing a report?\r\n\r\n\r\nMany more question like that. I didn't think they were tricky. They were just asking them in quick succession.\r\n\r\nI asked them about career opportunities and they didn't sell it well to me. They just basically told me that the pay is good, people come here with different motivations, you'll gain valuable experience that will be useful somewhere else, basically, there is no real chance for growth and career development."}, {"date": "9 Apr 2017", "title": "Spporter Services Head Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Anthony Nolan (London, England) in Mar 2016", "Interview Descriptions": "submitted an application online, was asked attend  face to face interview  and asked to prepare a presentation and then prepare a strategic marketing presentation. I was then interviewed for 15 minutes, presented the presentation and then questioned on the presentation. after this invited back for a second interview to meet senior management", "Interview Questions": "What would my team say critically about me"}]]