[[{"date": "28 Feb 2023", "title": "Pension Consultant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Mercer University", "Interview Descriptions": "During the interview process, there are three rounds in total. The interviewers exhibit kindness and provide guidance to help candidates understand the company's working culture. If you have any questions or concerns about the company or the job position, this is a good opportunity to ask the interviewer.", "Interview Questions": "General actuarial questions related to this field"}, {"date": "3 Nov 2022", "title": "Admissions Counselor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Mercer University", "Interview Descriptions": "Over the phone interview. Was very brief. I was told I would hear something either by the end of the week or early the following week. They never followed-up, so I clearly never heard anything.", "Interview Questions": "Do I understand what the position entails?"}, {"date": "30 Sept 2022", "title": "Career Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Mercer University", "Interview Descriptions": "It was a day long process with multiple interviews throughout the day. Met with staff members but also senior administration and staff from other departments. Also included lunch and a campus tour.", "Interview Questions": "Tell us a little about yourself."}, {"date": "3 Feb 2022", "title": "Budget Coordinator Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Mercer University", "Interview Descriptions": "I me with a panel of department heads and one financial person from another College.  Took an exam in reference to budgets, requests for payment and personnel action forms.  Met with Dean one on one.", "Interview Questions": "Why I applied for position. "}, {"date": "7 Dec 2021", "title": "Clerk Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. I interviewed at Mercer University", "Interview Descriptions": "Depending on the position, you are interviewed differently. You may have one to 3 interviews. It may or may not be in a panel set up, typically with the chair heads or dean. Very quick but thorough process.", "Interview Questions": "what are your strenghts and weaknesses"}, {"date": "18 Aug 2021", "title": "Placement Student Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Mercer University", "Interview Descriptions": "Student placement in clinical rotations for physician assistant students; 5 year goal; education; experience; difficult situation; customer service; panel interview; STAR method was used. 2 day process.  waited 2 weeks for response about the position", "Interview Questions": "Strength and weaknesses;  tell me about yourself"}, {"date": "17 Aug 2021", "title": "Fellowship With Arbor Pharmaceuticals Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Mercer University", "Interview Descriptions": "It was a virtual interview with basic questions that gauged the overall interest of the applicant. The next step was an interview with the actual company associated with the fellowship.", "Interview Questions": "Why are you interested in medical affairs?"}, {"date": "30 Mar 2022", "title": "Recreational Sports and Wellness Supervisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Mercer University (Macon, GA) in Mar 2021", "Interview Descriptions": "Interview are in person. A panel of 3-4 current supervisors ask about 10 questions total. The process went how you would expect it to.  I received the job offer within a week.", "Interview Questions": "Tell me about a time you handled conflict "}, {"date": "18 Mar 2021", "title": "Event Team Member Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Mercer University (Macon, GA) in Jan 2021", "Interview Descriptions": "The interview consisted of asking questions about previous experience and problem-solving techniques, good and bad qualities about yourself, and how /what you would add to the Team. It was brief and short, not many questions, and there were notes being taken on the things you were saying written on a default sheet of paper that held the questions that were asked to all interviewees.", "Interview Questions": "Q: What would you say is one of your biggest weaknesses?"}, {"date": "5 Oct 2020", "title": "Admissions Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Mercer University", "Interview Descriptions": "Was called a few days after applying for an in person interview the following week. I had to give a presentation to the current admissions team and have a one-on-one interview with the Admissions Director", "Interview Questions": "N/A"}], [{"date": "19 Mar 2023", "title": "Physician Assistant Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Mercer University (Atlanta, GA) in Feb 2020", "Interview Descriptions": "Group interview was a debate style format debating between which is superior: international or domestic travel. The point was really to see how you cooperate with team members and how proficient you are at public/group speaking. 2 faculty members were in the room at the time of the debate.", "Interview Questions": "How would your classmates describe you?"}, {"date": "19 Jul 2019", "title": "Assistant Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at Mercer University (Macon, GA) in Apr 2019", "Interview Descriptions": "A lengthy process, with online interviews and campus interview day. A background check was required, as well as a presentation for the entire faculty. As the search committee did its job well, and I was well-suited for the job, I was easily able to answer their questions. I'm sure these questions would have been difficult for others who were not suited for the job.", "Interview Questions": "What can you offer our faculty?"}, {"date": "12 Nov 2018", "title": "IT Professional Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Mercer University (Macon, GA)", "Interview Descriptions": "Brief phone interview, scheduled face to face, and went onsite for interview within the same week. Meet the different IT teams,  brief tour of campus and that was it.", "Interview Questions": "What experience do you have with Microsoft Windows support"}, {"date": "27 Oct 2022", "title": "Assistant Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. I interviewed at Mercer University (Macon, GA) in Sept 2018", "Interview Descriptions": "Multiple rounds of interviews. Multiple phone calls and then was invited to campus for an in-person interview. The process went very quickly because they were trying to fill in the position quickly.", "Interview Questions": "Talk about a time when you had to overcome a particular challenge."}, {"date": "16 Jun 2018", "title": "Program Director-Medicine Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Mercer University (Macon, GA) in Apr 2018", "Interview Descriptions": "Received email for in person or skype interview for next few days. Interview canceled due to faculty emergency and then rescheduled again for same date. Interview panel with director and 3 members of the team. Interview panel was pleasant and they seemed to have genuine interest in getting to know me and my background. Questions were very specific to the job role and seemed to be specifically developed for a person with a background in student counseling and admissions. Job announcement did not require this type of background, but a program/project management one.  During interview, I was asked about my future career goals and about teaching classes. Teaching classes was also not apart of the job announcement. I explained my reasoning for my career goals and I was encouraged to look into teaching, more specifically with their program. Interview completed and I was told that a decision would be made over the next few weeks or so.  A little puzzled about the lackluster answer as I felt as though they were in a hurry (based on emails) to fill the position and schedule me for an interview. Very strict/rigid timeline provided for interviewing.  Received reject email a few weeks later thanking me and suggesting that I consider faculty positions.", "Interview Questions": "How would you contribute to Mercer Univesity's Mission?"}, {"date": "7 Apr 2021", "title": "Student Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Mercer University (Macon, GA) in Aug 2017", "Interview Descriptions": "The interview process was very easy. However, my interview evolved a group of interviewers. But, the questions were straight forward. They did throw in one random scenario question to see what type of creative response i would give.", "Interview Questions": "If a dog managed to get into the building, how would you handle removing the dog from the office?"}, {"date": "2 Sept 2016", "title": "Student Support Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Mercer University (Macon, GA) in Aug 2016", "Interview Descriptions": "It was a panel interview. I went very well. They asked the typical questions. I was scheduled for testing (typing, excel, etc) pretty quickly. The group interviewing me consisted of the supervisor, her supervisor, the director and her assistant.", "Interview Questions": "They asked what type of weaknesses and strengths i had. They also asked how I would handle having to cater to people with all different backgrounds that were having difficulties as it relates to the job."}, {"date": "17 Jan 2016", "title": "Admissions Counselor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Mercer University (Macon, GA)", "Interview Descriptions": "Very easy. Basic questions that were easy to answer. Did a phone screening on the phone. There were three people on the phone. They will ask you many questions and you will have to answer quick. But everyone was really nice the whole time.", "Interview Questions": "What is enrollment management?"}, {"date": "23 Oct 2015", "title": "Marketing Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Mercer University (New Brunswick, NJ) in Sept 2014", "Interview Descriptions": "It was an interview with numerous interviewers.  Each interviewer had a sheet of paper with questions on it to answer.  Make sure you brush up on your interview preperation as it is pretty intense.   Be confident but not cocky.  Try to relate all of the questions to the job and how it will benefit the university and not yourself.", "Interview Questions": "What do you think is your area that you need improvement on related to this job opening?"}, {"date": "9 Jun 2014", "title": "PharmD Program Student Interview", "results": "Declined Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Mercer University", "Interview Descriptions": "Apply online at the school's website for supplemental application, then selected for an interview. The interview process included an orientation, a  tour, an interview with a student and a faculty member.", "Interview Questions": "The questions are quite reasonable."}], [{"date": "12 Apr 2017", "title": "PhD Graduate Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 3 weeks. I interviewed at Mercer University (Atlanta, GA) in Apr 2014", "Interview Descriptions": "It went really well. It was easy but needed some preparation. It is expected to select the advisor even before applying to the school. My personality, IQ and knowledge in the subject were tested.", "Interview Questions": "Previous research experience"}, {"date": "2 Sept 2015", "title": "Human Resources Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Mercer University (Macon, GA) in Dec 2013", "Interview Descriptions": "Two interviews: First very generalized with two members of department, Second interview was a panel interview consisting of a review of my qualifications and the expectations of the position. Compensation and benefits were discussed. I was awarded $0.50 more than the advertised hourly rate on my offer of employment, which I requested in the second interview.", "Interview Questions": "1) Please explain any gaps in employment history. 2) What type of environment do you feel you work best in?"}, {"date": "28 Sept 2015", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Mercer University in Dec 2013", "Interview Descriptions": "Phone interview followed by a face to face with Assistant Dean. I was given a tour of the main campus and the campus on which I worked. I actually had two interviews. The second was with my department chair. The interview was semi-formal and was very enlighteing.", "Interview Questions": "How do you intend to balance teaching responsibilities with full time job?"}, {"date": "30 Jul 2015", "title": "Peer Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Mercer University (Macon, GA) in Aug 2013", "Interview Descriptions": "Fill out a form including 2 references. The form is what they use to decide if you are mostly qualified. The interview is pretty much your training and to see if you are personable enough to be a tutor. I wouldn't worry about it too much. They are only checking to see if you can hold a conversation.", "Interview Questions": "Have you worked as a tutor before?"}, {"date": "27 Jun 2017", "title": "Phonathon Caller Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Mercer University (Macon, GA) in Aug 2013", "Interview Descriptions": "I had a short interview with the supervisor and a student supervisor after submitting an online application using the Mercer University student employment database. They made an offer at the end of the interview, and I accepted.", "Interview Questions": "Tell me how to have dealt with a difficult person customer in a past position."}, {"date": "24 Apr 2014", "title": "Postdoctoral Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Mercer University (Atlanta, GA) in Jun 2013", "Interview Descriptions": "Short phone interview with one week turn around time", "Interview Questions": "N/A"}]]