[[{"date": "13 Jun 2023", "title": "Product Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Peabody (UK) (London, England)", "Interview Descriptions": "STAR based interview process, where situation, task, analysis and response was required. Friendly but thorough. Would recommend having a few examples in you back pocket. Understand company values - will help you get idea of the culture. Diversity based questions also usually asked.", "Interview Questions": "Situation based questions around the role"}, {"date": "8 Jun 2023", "title": "Product Owner Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 2 weeks. I interviewed at Peabody (UK) (London, England)", "Interview Descriptions": "Pretty relaxed albeit serious interview, done with Head of Product and Senior Product Owner together over Teams call. Good interview and felt like a conversation rather than an interview, which I liked.", "Interview Questions": "Describe career etc, What are your strengths..usual stuff"}, {"date": "14 Jul 2021", "title": "Bank Mental Health Support Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Peabody (UK)", "Interview Descriptions": "I applied online and was contacted for a remote interview (due to covid)after I submitted my application. Many situation based interview questions on areas such as safeguarding and ability to manage challenging behaviour.", "Interview Questions": "What is your understanding of safeguarding? "}, {"date": "8 Apr 2021", "title": "Anonymous Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at Peabody (UK)", "Interview Descriptions": "One stage interview.  Presentation and face to gace virtually. Informal and straightforward. Mostly got asked competency based questions so come prepared with some examples that you can use to answer the questions effectively.", "Interview Questions": "Describe to me the personality traits of someone in this role needs to have to succeed?"}, {"date": "6 Feb 2021", "title": "Community Engagement Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Peabody (UK) (London, England) in Nov 2020", "Interview Descriptions": "Brief application process. Interview was two hours long. First half involved a written task that then had to be presented to the interview panel. The task was to describe a project you would set up relating to the role you are applying for", "Interview Questions": "Why do you want to work for Peabody?"}, {"date": "4 Nov 2019", "title": "Support Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Peabody (UK) (London, England)", "Interview Descriptions": "It lasted roughly an hour. There was a short test and then a face to face interview. I was interviewed by a small panel. They were friendly and courteous and asked a variety of questions.", "Interview Questions": "Can you tell me about a time when you had a positive impact on one of your customers?"}, {"date": "22 May 2023", "title": "IT Project Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through a staffing agency. I interviewed at Peabody (UK) (London, England) in Jun 2019", "Interview Descriptions": "Face to Face at their Southwark Head Office. Two interviewers neither of which were from Human Resources. One was reasonable, the other appeared to have decided to offer the role elsewhere prior to my interview.", "Interview Questions": "What previous experience do have working for a housing association?"}, {"date": "30 Apr 2019", "title": "Recruitment Business Partner Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Peabody (UK) (London, England) in Oct 2018", "Interview Descriptions": "Application, online questionnaire, highlight of experience, talking to a member of HR, review of experience, talking through my experience and skills, selection process, reviewing. Arranging assessment, invitation to interview through email.", "Interview Questions": "Talk us through a time you have improved a process"}, {"date": "5 Jul 2018", "title": "Senior Human Resources Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at Peabody (UK) (London, England)", "Interview Descriptions": "I was one of 2 finalists and didn’t get the role as they were concerned that I wasn’t the right “fit” and would be frustrated by difficult employees. No evidence of this and I am very experienced and always flex my style and gave examples of dealing with difficult people before. the unconscious bias of HR leaders given in feedback was clearly age discrimination. Very unprofessional and disappointing.", "Interview Questions": "How would you right your own job description "}, {"date": "17 Mar 2021", "title": "Neighbourhood Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 3 weeks. I interviewed at Peabody (UK) (London, England) in Apr 2018", "Interview Descriptions": "Most likely involves a test. Written example of how you would deal with something. Most likely ASB / high profile complaint.\r\nUse examples highlighting what you have dealt with previously.", "Interview Questions": "Give an example of where you I’ve delivered excellent customer service. "}], [{"date": "28 Mar 2018", "title": "Collections Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Peabody (UK) (London, England) in Mar 2018", "Interview Descriptions": "I applied online and received a phone call a few days later inviting me to an interview, person I spoke to said she will email me to confirm date and location. The next day I called them as I had not received the email confirmation and the HR girl told me she had tried to contact me as they had to rearrange the date (I did not get a call or any other form of contact from them- why lie?)\r\n\r\nThe interview was chaired by a panel of two, interim head of collections and another collections manger. \r\nThe interview was composed of competency based questions followed by a few questions about myself. \r\nThe interview went well and I was able to connect with the interviewers. The confirmation email stated they would make presentation but this did not happen and no reason given as to why. \r\n\r\nI was told I would be given an outcome decision within a weeks’ time. After a week I emailed and called a few times but no reply to my emails and the their HR team is always unavailable when I call. \r\n\r\nVery unprofessional and not what I would expect from such a large organisation. \r\n\r\nI never expect all potential employers to give feedback but a short email to say I was unsuccessful would have sufficed.", "Interview Questions": "What i like to do  outside of work"}, {"date": "12 Apr 2018", "title": "Development Manager (Delivery) Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Peabody (UK) (London, England) in Dec 2017", "Interview Descriptions": "The interview was undertaken by two members of the development team. One Head of Development, the other a Senior Development Manager. Both were polite and professional. Generally, a formal interview focusing on skills and experience relevant to the role. I was not offered the role, but only found out after I chased numerous times having received no update four weeks after the interview. Then had to chase for feedback, which HR blamed on the ‘busy developmemt department’. Overall, left with a negative view of Peabody.", "Interview Questions": "Asked why I was interested in the role, what I knew about the project, why I wanted to leave my current position, and a series of competency questions related to relevant skills and experience. "}, {"date": "4 Oct 2017", "title": "Property Administrator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Peabody (UK) (London, England)", "Interview Descriptions": "2 on the panel, one very personable the other quite reserved. \r\nQuestions asked regarding skills required for role i.e data entry, telephone handling, customer relationship management systems experience. Super straightforward and relaxed", "Interview Questions": "What does exceptional customer service look like, describe it."}, {"date": "9 Feb 2017", "title": "Buidlng Surveyor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Peabody (UK) (London, England) in Jun 2015", "Interview Descriptions": "Applied online directly on company website, was sent a letter in the post requesting an interview. \r\nInterview structure was a basic 2 person panel Q&A interview which lasted 35 mins.  Head of Service plus department manager.", "Interview Questions": "How would you reduce number of complaints received from our client group?\r\nWhat do you know about our property portfolio ? \r\nWhat common building defects would you expect ?"}, {"date": "20 Mar 2015", "title": "Management Accountant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Peabody (UK) (London, England)", "Interview Descriptions": "the process entailed a mix of competency and prior work experience skills, had the hiring managers involved in the process. this was a 2 staged interview, first interview one week and week after the second.", "Interview Questions": "what are your strengths"}, {"date": "2 Jul 2015", "title": "Infrastructure Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. The process took 1 week. I interviewed at Peabody (UK) (London, England) in Jan 2015", "Interview Descriptions": "Applied via recruitment agent who pre screened with set questions.\r\n\r\n1 hour interview with Infrastructure Manager and Senior in an informal chat style interview.\r\n\r\nPrevious projects asked about.\r\n\r\nPersonal ideas of technology in use within the organisation were requested\r\n\r\nVery quick turn around time between interview and first starting.\r\n\r\nInterview was refreshing and was seen to if you could fit within the organisation rather than technical background check.", "Interview Questions": "Best way to move between SAN switches"}]]