[[{"date": "15 Feb 2023", "title": "Intern Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Conservation International", "Interview Descriptions": "Emailed me asking for interview and a bunch of questions. After I responded I waited over a week then followed up with another email. I never heard back and was ghosted", "Interview Questions": "When are you available to start?"}, {"date": "13 Jan 2023", "title": "Coordenador De Projetos Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Conservation International", "Interview Descriptions": "1 entrevista com RH Envio de 1 vídeo falando em inglês 1 entrevista com 3 gestores da área e de áreas parceiras (comunicação, institucional) + 1 coordenador de outra equipe", "Interview Questions": "Como você acredita que poderá contribuir com esse projeto?"}, {"date": "22 Nov 2022", "title": "Senior Director of Operations Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Conservation International (Ciudad de Mexico) in Oct 2022", "Interview Descriptions": "There were five rounds of interviews with indivividuals from senior management from different areas within the organization. Each interview lasted approximately 60 minutes and ended with an opportunity for me to ask them questions. Each interviewer was given a chance to ask questions", "Interview Questions": "What systems do you utilize currently?"}, {"date": "12 Sept 2022", "title": "Program Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Conservation International in Aug 2022", "Interview Descriptions": "The interview process at CI is advertised as concise and is the opposite. Took over a month to be invited for an interview, then a month of interviewing to be emailed that I didn't get the job. They contacted references for all of the finalists, not just the one they wanted. Just a complete mess and a waste of time. Avoid unless you're desperate. ", "Interview Questions": "Basic things -- first your availability and salary expectations, later they go into detailed questions about the position itself and your experience in the space."}, {"date": "1 Jun 2022", "title": "Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Conservation International", "Interview Descriptions": "Don't ask about the salary range as they prefer to remain untransparent and will mark it against you. You will go through a simple series of panel interviews that ask behavioral questions. You will have a mix of staff levels on the calls.", "Interview Questions": "What is your experience in office operations?"}, {"date": "21 Dec 2022", "title": "Finance Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Conservation International in Apr 2022", "Interview Descriptions": "Applied online. Was contacted a month later for an informal first round interview. Had a more formal second round virtual interview with multiple members of staff. Was completely ghosted after that.", "Interview Questions": "What experience do you have building out financial models?"}, {"date": "16 Jan 2022", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Conservation International", "Interview Descriptions": "Applied for an internship with the Moore Center for Science. I just had a 25-30 min video interview with my to-be supervisor, was contacted for references a few days later, and received an offer shortly thereafter. Simple and pleasant process.", "Interview Questions": "What's your experience with GIS software?\r\nWhat are you looking to do after you graduate? "}, {"date": "30 Nov 2021", "title": "Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Conservation International", "Interview Descriptions": "Basically, program coordinators, and senior management went about asking questions directly related to the project. Responses in terms of personal experiences were  expected. The panel were extremely friendly and accommodating.", "Interview Questions": "Give examples of how you went about resolving stakeholder feedback loops particularly in difficult situations dealing with multiple stakeholders"}, {"date": "24 Jun 2021", "title": "Consultant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Conservation International (Washington, DC) in Jun 2021", "Interview Descriptions": "Submitted an application and got an email from HR to arrange an interview with the hiring manager.  The coordination was easy and the interview process was smooth. The hiring manager was cordial, professional, and thoughtful during the entire interview.", "Interview Questions": "tell me about your past experience related to the job requirement"}, {"date": "15 May 2021", "title": "Corporate Interview Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Conservation International", "Interview Descriptions": "My interview was cut short because the interviewer felt my background wouldn't suit the position. So I'm not exactly sure why I was picked for an interview in the first place. This was definitely one of the more odd interview experiences I've had.", "Interview Questions": "Tell me about yourself etc."}], [{"date": "9 Jul 2021", "title": "Engineer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Conservation International (San Francisco, CA) in May 2021", "Interview Descriptions": "The interview was only 15 minutes long, and my interviewer asked only 3 questions. She was very nice, but I felt rushed to think about her responses and answer questions in only 15 minutes, including small talk!", "Interview Questions": "1. What jobs have you had in the past that are most similar to this role?"}, {"date": "14 Nov 2022", "title": "Civil Engineer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Conservation International (Santa Cruz, CA) in Apr 2021", "Interview Descriptions": "It was friendly. The interviewer asked applicable questions and had a strong handle on the needs of the job. Only at one point did they ask a vague question and seemed to be looking for a specific answer (in this case specifically about scheduling)", "Interview Questions": "To compare my previous experience to their initiatives and dive into my subject specific knowledge."}, {"date": "5 Mar 2021", "title": "Finance Associate Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Conservation International", "Interview Descriptions": "Nothing really difficult. Asked really specific questions about my experience, so I'm not sure how objective/standardized first stage interview questions are. They took awhile to respond after the first interview.", "Interview Questions": "Describe your experience working with financial information, grants, and data. "}, {"date": "26 Aug 2021", "title": "Communications Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Conservation International (Singapore) in Feb 2021", "Interview Descriptions": "Pretty casual interview, conducted by my future supervisor. She was very friendly and mostly asked me administrative questions like what I'd learned in school, my job experience, and my availability.", "Interview Questions": "1. What is your availability like?\n2. Have you learned about xxx in school?\n3. Tell me a bit more about what you know about xxx (related to conservation)\n4. Are you familiar with SEO?"}, {"date": "7 Jan 2021", "title": "Content Writer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Conservation International", "Interview Descriptions": "Although it was a lengthy interview process, it was timed well and I never felt like I was waiting or in the dark. Was able to negotiate salary after offer as well.", "Interview Questions": "About recent news in the conservation field"}, {"date": "25 Nov 2020", "title": "Country Program Director Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Conservation International (Suva) in Oct 2020", "Interview Descriptions": "The panel members asked questions taking turns which allowed time to adjust to the interview setting and questions. Adequate time was given to answers and ask questions or clarifications. The Fijian team and Panel were very accommodating.", "Interview Questions": "Strengths and Weaknesses of a person, Team work and strategies employed in difficult situations, Donor reporting, Proposal writing, funding proposals, Stakeholder relationship management"}, {"date": "22 Jan 2021", "title": "Project Manager (Manager) Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Conservation International (Nairobi) in May 2020", "Interview Descriptions": "The process was friendly, starting with an hour phone interview and later on a panel interview with five panelist. The interviewers were friendly. They were very specific on the kind of candidate  they were looking for and felt like they had somebody in their mind due to their rigidity.", "Interview Questions": "They were technical in their questions"}, {"date": "5 Mar 2020", "title": "Administrative Program Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Conservation International in Feb 2020", "Interview Descriptions": "Easy 20 minute phone interview - thought it went well. However they never responded to me to let me know that I was not selected to continue with the process.....", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "10 Mar 2020", "title": "Administrative Program Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Conservation International in Feb 2020", "Interview Descriptions": "Applied on a Monday and was emailed the following day to schedule a phone screening interview. The interview was with who I would be directly working for; he was extremely nice and professional. Phone interview lasted about 30 minutes.", "Interview Questions": "Why do you want to work for CI? "}, {"date": "6 Dec 2021", "title": "Landscape Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. I interviewed at Conservation International (Antananarivo) in Dec 2019", "Interview Descriptions": "I have been interviewed by 6 perons in total as three persons in face-to-face and 03 persons in virtual. Their connexion was not really good so you may miss some words but I guess it wouldn't be a problem for expert", "Interview Questions": "Technical question about how to ensure effective conservation in case of climate change mitigation in coastal area"}], [{"date": "25 Jan 2021", "title": "Annual and Planned Giving Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Conservation International in Nov 2019", "Interview Descriptions": "Was contacted for a phone screener and then an in-person interview a couple weeks later. Interviewed with the Annual and Planned Giving Manager and then three team members (don't remember all their roles but all three directly interfaced with the position). Whole process took about 45 minutes.", "Interview Questions": "Give an example of a misunderstanding with a coworker and how you resolved it."}, {"date": "3 May 2019", "title": "Auxiliar Administrativo/Auxiliar Técnico Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 4 weeks. I interviewed at Conservation International (Rio de Janeiro)", "Interview Descriptions": "Bem prático e dinâmico. Fizeram alguns perguntas pessoais e profissionais, como por exemplo como foi a sua última experiencia profissional e etc, em seguida foi solicitado uma redação com tema livre.", "Interview Questions": "Como voce trabalharia sob pressão"}, {"date": "8 Mar 2019", "title": "Executive Manager, Center for Oceans Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Conservation International in Feb 2019", "Interview Descriptions": "Conservation International ghosted me.\r\n\r\nI had two interviews with the Center for Oceans, a 30 minute first round interview and an hour+ long panel interview. I never heard another word from the Center for Oceans team after my second interview, despite me emailing them more than once for an update on the hiring process. Really poor manners after investing so much time and effort. This was over a month ago.", "Interview Questions": "Are you able to go with the flow?"}, {"date": "20 Nov 2018", "title": "Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Conservation International", "Interview Descriptions": "Short phone interview to make sure you're a real person and you know what the organization does. Then, an in person interview with a couple of people on the team you will be working with. After that they screen references, ask for a writing sample and then you wait! One very important thing. If you get offered the job remember to ALWAYS ask for a higher salary offer. No matter what your circumstances are, even if you don't have previous experience.", "Interview Questions": "Tell us, what do you know about Conservation International? About the team your're applying to be apart of?"}, {"date": "6 Nov 2018", "title": "Writer/Editor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Conservation International (Arlington, VA)", "Interview Descriptions": "I had an initial phone call, after which I was invited to come into the office. I was asked essentially the same questions, but the interviewer was very busy and it showed through some minor cussing on his part. It was frustrating because I didn't feel like I could actually showcase myself well or develop a connection. I then interviewed with a separate employee in-person as well as an employee who video chatted in. They were enjoyable and pleasant. They asked me a question that they called silly and without a good answer -- what is my favorite part of speech -- but then actually seemed impressed with my answer (and said so). This was followed by a writing test. About two weeks later, I received an email stating that I had not received the position. Upon further questioning, I was told that \"someone with your experience and trajectory might quickly outgrow the confines of the position.\" That was very frustrating and, frankly, not a great rationale in my mind.  But overall, the process was fine. It wasn't exceptionally bad or good. Just frustrating.", "Interview Questions": "What is my favorite part of speech?"}, {"date": "26 Aug 2018", "title": "Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Conservation International in Aug 2018", "Interview Descriptions": "I submitting an application online and was contacted for a phone interview. This interview lasted 30 minutes and was with two people who asked very standard questions. I was then asked for an in-person interview.  This was with the two people I had  spoken to over the phone, as well as the VP for the project. They took turns asking questions which were slightly  more detailed than the phone interview questions. From the visitor log, it appeared  they had brought in a  lot of candidates for in-person interviews. They asked for a  writing sample, and indicated they would be checking references  for the top two candidates. The whole process was very fast.", "Interview Questions": "What are your salary requirements? "}, {"date": "6 Sept 2018", "title": "Senior IT Services Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 2 months. I interviewed at Conservation International in Jun 2018", "Interview Descriptions": "Entire process very long and myself need to follow up the progress.Position for apply is Senior IT Services Manager but during 1st interview via video conferencing it had been mentioned as regional IT manager,2nd interview face to face with Asia Pacific Senior VP a very pleasant guy.There has been inconsistent on the position mentioned.Despite when asked for the progress of the outcome as myself already got 2 job offers with another 2 companies for me to decide which company for me to join,hiring manager went on silent mode with no reply on email, Skype message,phone call (which I called to CI HQ) and even hand phone. \nIn my impression, this has reflect badly on CI for the core value on the hiring manager and the process. \n\nThis is not a good company for you to consider if you got other better opportunity elsewhere, when dealing with IT hiring manager.", "Interview Questions": "IT technical question involving infrastructure."}, {"date": "24 Sept 2019", "title": "Grant Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at Conservation International in May 2018", "Interview Descriptions": "I responded on the job site with my application, resume and cover letter. I received a follow-up call and was called for an in-person interview. I also had a colleague who served as my referral for the position.", "Interview Questions": "I was asked: What are your experiences managing up, tell us about a time you handled a difficult conversation with a colleague, what are your interests for working in conservation"}, {"date": "24 Mar 2020", "title": "Intern Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Conservation International in Apr 2018", "Interview Descriptions": "A phone interview with only one team member from the Policy Center for Environment and Peace, at Conservation International.  This interview was for the Knowledge Management Intern position.  They did want to hire someone enrolled in school so not a position for recent graduates.", "Interview Questions": "Describe your past writing experiences"}, {"date": "30 Apr 2018", "title": "Foundations Relations Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Conservation International in Mar 2018", "Interview Descriptions": "I was selected to interview and scheduled a phone interview via email. The interview was not in person because I was attending university far from Washington D.C. The interview was uncomfortable, because I was asked very little about my experience and why I wanted to work there, and the interviewer just kept talking and gave me 5-10 minutes of the 25-30 minute interview to answer questions and then ask questions. It was strange and poorly organized on their behalf. Even if I had received an offer, I likely would not have accepted due to the strange interviewing process.", "Interview Questions": "Do you have any experience fundraising?"}], [{"date": "9 Aug 2017", "title": "Development Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Conservation International (Washington, DC) in Aug 2017", "Interview Descriptions": "First I had a phone interview with one member of the team the position would serve (it was supposed to be 15 minutes but mine ended up being about 25), then I sent them a writing sample and they asked to schedule an in-person interview with three of the people I would be serving in the position. This interview was supposed to be 45 minutes to an hour, and mine was about 45-50 minutes.", "Interview Questions": "Can you tell us some specifics about your fundraising and development experience?"}, {"date": "7 Oct 2016", "title": "Finance Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Conservation International in Aug 2016", "Interview Descriptions": "Phone Interview, after one week, face to face interview in CI offices. Interviewed by four people who were friendly. Two+ weeks passed before knowing what happened, then I was called and told I was preferred candidate. The Screening process for almost a month , this involved giving certificates, addresses of where I schooled and worked.", "Interview Questions": "why do you think you are the best candidate for this job?"}, {"date": "18 Jul 2016", "title": "Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Conservation International", "Interview Descriptions": "Applied online. Was contacted maybe 1 month later for a phone interview (screening interview), then because I did not live in the area, I interviewed via Skype two weeks later with the department director and mid-level staff. I had one final interview with HR maybe 10 days later via phone.", "Interview Questions": "Describe a time when you had to try and gain influence over a group of people among whom you were powerless."}, {"date": "31 May 2017", "title": "GIS Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Conservation International (Washington, DC) in May 2016", "Interview Descriptions": "Basic questions on why I want to work for CI, what is my GIS background, background on environment. Said they would contact me for next steps, as the person in charge of selecting was out of country. Had to contact the organization and they told me they selected someone else. \r\n\r\nThey could have sent an email or phone call to state they chose someone, especially when they said that they would reach out with their decision either way.", "Interview Questions": "Had a book with maps in it, was asked to describe what I saw"}, {"date": "4 Jan 2018", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Conservation International (Arlington, VA) in Apr 2016", "Interview Descriptions": "Online application, phone interview with internship supervisor, skype interview with internship supervisor.  Simple process with people who I was going to be working with so specific and technical questions were asked.", "Interview Questions": "Technical expertise and about academic research"}, {"date": "28 Dec 2017", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Conservation International (Arlington, VA) in Feb 2016", "Interview Descriptions": "We initially had a 30 min phone interview, the team members I spoke for were extremely friendly. At the end of the call they informed me that I was not qualified for that position, but they would put me in contact with a different scientist that was hiring for someone with my qualifications. Within two weeks I had skyped with the director and the hiring process had begun.", "Interview Questions": "Technical experience?\r\nWhy I wanted to work for their organization?"}, {"date": "20 Sept 2019", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 2 weeks. I interviewed at Conservation International in Jan 2016", "Interview Descriptions": "Le processus de recrutement est très encadré et répond toujours au même format: entretiens de présélection, vérification des références, vérification des informations / du casier, entretien bilingue avec le Siège puis offre de poste.", "Interview Questions": "Que pouvez-vous dire sur nos missions locales?"}, {"date": "14 Jan 2016", "title": "Communications Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Conservation International in Nov 2015", "Interview Descriptions": "One week after applying, I was contacted for a phone interview with an HR representative. The questions were standard, not particularly difficult, but the HR person I talked to was not very engaged (yawned while asking the questions!), and this didn't help me feel comfortable during the phone interview. They never contacted me to say that I did not make it to the second recruitment stage, which is not very professional... I was expecting more from CI!", "Interview Questions": "Standard questions, e.g. tell me about your college studies and your past work experience."}, {"date": "5 Oct 2015", "title": "Program Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at Conservation International", "Interview Descriptions": "One phone interview one in person with 4 different people \r\nEveryone seemed nice\r\nThe only problem was the process was slow, over a few months and they don't get back to you.\r\nThe interview questions were very basic.\r\nIt was hard to gauge what exactly they wanted.", "Interview Questions": "Where do you see yourself 5 years from now"}, {"date": "29 Aug 2015", "title": "Rights-Based Approach Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Conservation International (Washington, DC) in Aug 2015", "Interview Descriptions": "I was interviewed by a panel of 3 women who very pleasant and made me feel comfortable. The interview was in a large coference room and I had people sitting left and right of me. They asked a lot of questions about my technical qualifications and how I would handle specific situations during the internship. The", "Interview Questions": "What is you interest in the internship?"}], [{"date": "17 Jul 2015", "title": "Director, Ocean Oriented Initiative Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Conservation International", "Interview Descriptions": "It was a phone interview that they set up by email. 3 people participated, and 1 person was about 10 minutes late to the call. One person asked most of the questions, and collectively as a group they were polite and willing to answer questions. They never let me know, however, that I was not selected to continue in the process, despite telling me that they would get back to me in a week or two. Not a letter, an email, nada, even after I sent a thank you email to each of them. Was a pretty big turn-off.", "Interview Questions": "Can you talk about your experience managing projects."}, {"date": "31 Mar 2016", "title": "Climate Change Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Conservation International in May 2015", "Interview Descriptions": "I got an email requesting an interview done via phone. The interview lasted about 25 minutes. The interviewer said they had a few more interviews to conduct and would let me know within the next week if I got the internship. After the interview, I was contacted a few days later with the offer.", "Interview Questions": "What kind of research experience do you have?"}, {"date": "29 Dec 2014", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Conservation International", "Interview Descriptions": "Phone interview, followed by two team in person interviews. The first in-person interview was with a panel. And, the second in-person interview was with staff from some of the field offices", "Interview Questions": "Should you take this job, what would be the top five things you'd do first?"}, {"date": "18 Dec 2014", "title": "Field Position Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Conservation International", "Interview Descriptions": "Online application, email response, individual interview by phone, panel interview by skype. Very enjoyable discussions with several managers and directors to learn about their objectives and convey how my experience relates", "Interview Questions": "How would you work with local staff?"}, {"date": "10 Mar 2014", "title": "Finance Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at Conservation International (Arlington, VA)", "Interview Descriptions": "Phone, Video and in person interviews with mostly behavioral questions.  I interviewed with about 5 people.", "Interview Questions": "What can you tell me about conservation?"}, {"date": "5 Mar 2014", "title": "Manager Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Conservation International", "Interview Descriptions": "Why you want to work with us?", "Interview Questions": "N/A"}, {"date": "10 Mar 2014", "title": "Media Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Conservation International (Arlington, VA) in Feb 2014", "Interview Descriptions": "CI has a tough hiring process. I felt the interview was thorough and fair. But I will never pursue another opportunity with them. Why? Even though I didn't get the job, I think it's only fair that they get back to me and tell me. They never even wrote a 1-line email. I find that hurtful and frankly unprofessional.", "Interview Questions": "What I thought of Instagram. "}, {"date": "1 Nov 2013", "title": "Communications Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Conservation International (Arlington, VA)", "Interview Descriptions": "Smooth interview process which was helped by the fact they had been recruiting for this position for a long time and I was a good fit.  The quickly moved forward and provided relocation assistance.", "Interview Questions": "N/A"}, {"date": "2 May 2013", "title": "Finance Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Conservation International (Arlington, VA) in Mar 2013", "Interview Descriptions": "Submitted resume online, got called by hr, then a phone interview was setup, and after that a person interview was setup. After all paper work was submitted I got the job.", "Interview Questions": "What was the most difficult thing you have done. "}, {"date": "4 Jan 2013", "title": "Special Events Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Conservation International (Arlington, VA) in Nov 2012", "Interview Descriptions": "I had two interviews - one phone, and one in person. I was very pleased with how quickly they moved along - my in-person was within 2 weeks of my phone interview. Interview questions were very standard, nothing that I could not answer. Ultimately I did not get the job, but the person I interviewed with thanked me personally for coming in.", "Interview Questions": "Asked why I wanted to work with CI - this is difficult, because I think they are looking for some passion-inspired, overarching answer to why someone would want to work for a nonprofit, specifically theirs. "}], [{"date": "9 Jun 2009", "title": "Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 1 week. I interviewed at Conservation International in Jul 2008", "Interview Descriptions": "Applied for job and got an email back requesting a phone interview. We had the standard questions - why are you interested in this job, your work experience, etc.. This phone interview was only with one person - the coordinator of the team that I would be working with. That was successful and they asked me in for a second, in person panel interview, which consisted of the core members of the team. Pretty relaxed - it seemed like the second interview was mostly for finding out about my personality, interacting with me in person, and seeing my body language in addition to my answers for the interview questions.", "Interview Questions": "Why are you interested in conservation (my experience did not show any conservation interests or background)?"}]]