[[{"date": "8 Oct 2022", "title": "NCS Senior Mentor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at National Citizen Service", "Interview Descriptions": "A group assessment centre with role play exercises. All the prep is emailed prior but make sure to click all the links and read thoroughly as there was an activity I missed and hadn’t prepped for.", "Interview Questions": "Why do you want to work for NCS?"}, {"date": "19 Sept 2022", "title": "Assistant Team Leader Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at National Citizen Service", "Interview Descriptions": "Group interview with other ATL and TL, followed by an individual interview with two members of staff. The whole process lasted about two hours, very friendly and informal, asking about previous experience and scenarios and how I would respond. Ended up getting an offer for TL position.", "Interview Questions": "What challenges do you think you would face working with young people?"}, {"date": "23 Jan 2023", "title": "Assistant Team Leader Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at National Citizen Service (Bristol, England) in Jun 2022", "Interview Descriptions": "Virtual interview with 2 interviewers who were both really friendly. It lasted an hour with several questions including a role play and activity planning section. They were very accommodating as I could not attend an in person interview.", "Interview Questions": "How would you make activities inclusive and safe?"}, {"date": "9 Apr 2023", "title": "Assistant Team Leader Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at National Citizen Service (Derby, England) in May 2022", "Interview Descriptions": "Very informal and less intimidating. The questions were focused on why you want to work for them and the particular role you want. Also asked: Give an example of a time where you had to collaborate with others. Mostly motivational questions were asked. The interview took place on a Microsoft Teams.", "Interview Questions": "Give an Example of a time where you had to collaborate with others?"}, {"date": "9 Dec 2021", "title": "Digital Website Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at National Citizen Service (London, England) in Dec 2021", "Interview Descriptions": "Nobody turned up to the first interview - I was left hanging for 20 mins. Second interview was with only one person - bad practice, especially for a public organisation. Felt cheated by the whole process.", "Interview Questions": "Tell me about your background?"}, {"date": "29 Jun 2021", "title": "Assistant Team Leader Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at National Citizen Service", "Interview Descriptions": "Online, applied late so only had one interview. Very friendly and welcoming people, were open to my questions and gave detailed replies. Lots of scenario questions as well as the usual basic qs", "Interview Questions": "Why do you want to work here?"}, {"date": "1 Jun 2021", "title": "Team Mentor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at National Citizen Service", "Interview Descriptions": "I had an assessment day, composed of two assessed team working tasks and an individual interview. The interview was a panel of people asking questions and they were very friendly and engaging.", "Interview Questions": "Do you have experience working with teenagers?"}, {"date": "30 Apr 2021", "title": "Assistant Team Leader Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at National Citizen Service", "Interview Descriptions": "Very quick & interviewers were very kind and understanding; they made sure to check whether I had any questions I wanted to ask & were very considerate of my home situation", "Interview Questions": "N/A"}, {"date": "10 May 2021", "title": "Team Leader Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at National Citizen Service (Brighton, England) in May 2021", "Interview Descriptions": "It was a simple straight forward interview starting with an icebreaker presentation and 30 minutes of going through my own experience and proof of being able to work in the UK", "Interview Questions": "Experience working with young people"}, {"date": "6 May 2021", "title": "NCS Mentor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at National Citizen Service (Northampton, England) in Apr 2021", "Interview Descriptions": "I applied online and was able to pick a date. time and software for an online interview. I picked Zoom but there were other options. This allowed me to pick the time that most suited me out of the options and thus be at my best during the interview.\r\n\r\nThere was one online interview and one person taking notes and overseeing the interview. They introduced the company and the role I applied for. Then they asked the interview questions and I could ask my questions. They gave me feedback when I asked for it so I had a good idea about the interview outcome as it ended.\r\n\r\nAfterwards, I got an email confirmation couple of days later and the next phase included checking up with my two references that I gave them and a DBS check as this job involves working with children.\r\n\r\nAfter these went through I was accepted.", "Interview Questions": "What skills do you have that will make you a good NCS Mentor?"}], [{"date": "2 Mar 2021", "title": "Program Mentor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at National Citizen Service", "Interview Descriptions": "You take part in a group based interview starting off with a prepared presentation on why you are most suited to this job and why you applied. You are also asked to demonstrate an ice-breaker.", "Interview Questions": "Why would you like to work here?"}, {"date": "18 Apr 2021", "title": "Team Leader Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at National Citizen Service (Manchester, England) in Mar 2021", "Interview Descriptions": "Basic interview questions on zoom based on NCS competences. Experience working with young people. How you would deal with issue regarding safeguarding, remaining professional. Application submitted online then contacted to attend a zoom interview lasting around 30minutes. If offered the job training days are required.", "Interview Questions": "Describe your experience with working with young people "}, {"date": "29 Aug 2020", "title": "Social Action Manager Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at National Citizen Service", "Interview Descriptions": "There was a presentation then one to one interview and group discussions. Everything but the one to one was in a group. Had to be very smiley happy and talk a tive.", "Interview Questions": "Asked about certain situation with young people and how I would deal with that"}, {"date": "9 Nov 2019", "title": "Team Mentor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at National Citizen Service", "Interview Descriptions": "Role play and scenario based. They would give examples of scenarios that could happen on a residential for example, and ask you how you would react. They also asked you to deliver speeches/team building exercises as if you were on the job.", "Interview Questions": "What would you do if..."}, {"date": "5 Oct 2019", "title": "Summer Programmer Administrator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at National Citizen Service", "Interview Descriptions": "Funny how my first experience got taken down, NCS did not like the reality of what I said I am assuming. I applied for the fast track scheme in around May, they took 3 weeks to get back to me considering I wasted time doing a video interview and trying to get my application checked out soon as possible.\r\n\r\nWaste of time, and a poor unprofessional company. They should have the decency to actually  fast track your application, if they state they can. Bonus for not getting a job there, considering this got taken down before, so very shrewd people working there.", "Interview Questions": "Video interview"}, {"date": "24 Mar 2023", "title": "Operations Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 3 days. I interviewed at National Citizen Service in Jul 2019", "Interview Descriptions": "Single stage interview with really friendly team which was talent acquisition manager and EA to CEO. Typical interview questions on strengths, skills and experience and informal chat about why I wanted to work there and what my ambitions are.", "Interview Questions": "How does your experience relate to this role?"}, {"date": "27 Sept 2019", "title": "Head of Sales Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at National Citizen Service (London, England) in Jul 2019", "Interview Descriptions": "I applied from a job advert on totaljobs.com and was contacted around 1 week later. The first stage was a phone interview which was informal and a brief discussion on CV amongst other things. \r\n\r\nThe second stage was a face to face interview in their head office in London. I drove down  and had an interview with the director of sales and HR business partner. The interview went well and I was told that feedback would be given by end of the week. \r\n\r\nNCS never contacted me again despite the commitment and effort given on my behalf. I have repeatedly followed up on this but had no success in even getting an acknowledgement of an email. \r\n\r\nVery poor process from a big company and not one where I would want to work", "Interview Questions": "Can you tell me about a time you had to deal with conflict when dealing with a third party company. "}, {"date": "13 Sept 2019", "title": "Community Logistics Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at National Citizen Service (Manchester, England) in Jun 2019", "Interview Descriptions": "Webcam interview. Asked scenario questions, similar to the questions asked on the application form. Focus on your work experience with children, though for this role you hardly interact with children. There was also a training weekend.", "Interview Questions": "What difficult challenges have you faced and how did you overcome them?"}, {"date": "20 May 2019", "title": "Team Mentor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at National Citizen Service", "Interview Descriptions": "The interview was really relaxed and mainly consisted of a short presentation which you had time to prepare for and then questions which were aimed at a group. You only had to speak when you were confident to do so and a lot of the time we ran through scenarios of challenging behaviour or situations and how we would deal with that.", "Interview Questions": "How would you describe the relationship between mentor and the young people? \r\nHow would you deal with challenging behaviour?\r\n"}, {"date": "10 Apr 2019", "title": "Team Leader Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at National Citizen Service", "Interview Descriptions": "assessment centre - asked to conduct a ice-breaker which would be suitable for 15-17 year olds, group discussion, written assessment on safeguarding. Interviewers made it relaxed and a nice environment to be in.", "Interview Questions": "experience of working with young people"}], [{"date": "5 Apr 2019", "title": "Head of A Discipline Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at National Citizen Service (London, England)", "Interview Descriptions": "Thorough process and screen. Well structured. Relevant interviewees. Show cased competency based questions and the culture well.  Phone screen first, then 2 x rounds of panel interview, then meeting SLT member.", "Interview Questions": "Deep dived into the specifics of the role, the 'how did you do that'. "}, {"date": "5 Apr 2019", "title": "Support Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at National Citizen Service", "Interview Descriptions": "Completed online application including questions about experience and how you would incorporate inclusion into your role. Attended 4 hour assessment of around 8 people where we completed role play, created support plans, and did a pre prepared 2 min presentation.", "Interview Questions": "Why do you want to work as a support worker for NCS?"}, {"date": "22 Dec 2020", "title": "Team Leader Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at National Citizen Service (Chesterfield, England) in Apr 2019", "Interview Descriptions": "It was a very relaxed interview. The interviewer just went through my CV and asked me to elaborate on my experiences. She also asked me some questions about safeguarding and child protection.", "Interview Questions": "What previous safeguarding experience have you had? "}, {"date": "23 Jan 2021", "title": "Community Logistics Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at National Citizen Service (London, England) in Apr 2019", "Interview Descriptions": "Sent in my cv and cover letter, got invited to a group assessment centre and an interview on the day. Got an email letter saying I had been hired. At the group assessment centre we had to prepare a speech about health and safety, and we also did a number of exercises amongst each other.", "Interview Questions": "Talk about a time you faced conflict with someone you have worked with?"}, {"date": "17 Oct 2019", "title": "Youth Mentor & Presenter Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at National Citizen Service (London, England) in Apr 2019", "Interview Descriptions": "Group assessment felt more like a training session than an interview. Group discussion tasks and a very easy and forgiving role play\r\n I didn't feel any pressure and actually enjoyed the experience", "Interview Questions": "How would you handle this situation\r\nWhy did you do what you did \r\nHow did that situation make you feel\r\nHow could you improve things\r\nPlease give your speech "}, {"date": "14 Feb 2019", "title": "Support Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at National Citizen Service", "Interview Descriptions": "Very simple process. Applied very late for the program so did not have to do the usual assessment centre. Had a telephone interview which lasted about 30 minutes, then I was offered the job. The staff are very friendly and easy to get along with.", "Interview Questions": "Why do you want to work for NCS? how would you help a student fit on more? Safeguarding questions."}, {"date": "14 Dec 2019", "title": "Team Leader Assistant Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at National Citizen Service (Birmingham, England) in Feb 2019", "Interview Descriptions": "Not too difficult. the interview takes around 5 hours, there are a few exercises as part of a group such as role play and a presentation and then a final interview which is 1:1", "Interview Questions": "What experience do I have related to the job, how would I react if a kid went missing"}, {"date": "26 Jan 2021", "title": "Senior Mentor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at National Citizen Service in Feb 2019", "Interview Descriptions": "The main interview process was a group assessment. This involved taking part in ice breakers, personality questions, scenario acting and various activities to test certain skills and characteristics. It also tests your possible responces in likely scenarios.", "Interview Questions": "If you could watch one TV show or movie for the rest of your life what would it be. "}, {"date": "24 Nov 2018", "title": "Strategy Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at National Citizen Service (London, England) in Sept 2018", "Interview Descriptions": "Standard application, CV and cover letter. Next stage was a written piece as if you were an NCS employee, 1 page max. Interview with 2 people, one junior, one senior. Casual-looking office, dress code also smart casual.\r\n\r\nInterview involved the usual interview questions, why you applied, why the role suits you etc. Then an exercise involving graphs and numbers, relatively straightforward, then a linked exercise involving differently labelled maps of the UK and asked what inferences you could make from them ie. more NCS applicants from cities than countries on one map, explain why?", "Interview Questions": "Describe a challenge you faced in the workplace and how you resolved it."}, {"date": "19 Dec 2018", "title": "Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through other source. The process took 1 day. I interviewed at National Citizen Service (Birmingham, England) in Jun 2018", "Interview Descriptions": "Easy to apply . Just read the email carefully. You apply online and fill a questionnaire. When there you are asked questions and they get back to you next day.", "Interview Questions": "What would you do if your team all wants to leave and go home."}], [{"date": "14 Sept 2020", "title": "Senior Mentor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at National Citizen Service in May 2018", "Interview Descriptions": "Interactive ice-breaker games and hypothetical scenarios working of life working at NCS which was fun. We also done various group tasks and then was invited to a one to one interview. Its a pretty laid back enviroment where it seems the like the recruiters want you to just be yourself.  All in all it around 4 hours but very enjoyable.", "Interview Questions": "Your motivations for working at NCS."}, {"date": "12 Nov 2020", "title": "Senior Mentor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at National Citizen Service (London, England) in May 2018", "Interview Descriptions": "The interview process was fun and interactive. We were put into groups and where we were given hypothetical scenarios and had to use role play what we would do in the given situation. The interview process  lasted about two hours and it was accompanied with breaks and refreshments.", "Interview Questions": "They asked the reason for wanting to be a senior mentor and why the program NCS is of significance."}, {"date": "4 May 2018", "title": "Youth Support Worker and Team Leader Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at National Citizen Service (Chelmsford, England) in May 2018", "Interview Descriptions": "Invited to an assessment centre (6pm-9pm), make sure you bring ALL of the documents they request otherwise. Started off filling in paperwork then had a presentation by the wave leader. Then went onto do some group work games (make sure you show yourself as outgoing and willing to get involved) before 1 on 1 interviews.", "Interview Questions": "We've had over 200 applicants and only a few spaces, why should we pick you?"}, {"date": "21 Jan 2020", "title": "Assistant Team Leader Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at National Citizen Service (Exeter, England) in Apr 2018", "Interview Descriptions": "I got invited for a group interview. We were asked to prepare a quick game (something we had to do with the young people on the job). Upon arrival, we all introduced ourselves and took it in turns to lead an 'icebreaker'. During these, one at a time we were pulled for a chat with two interviewers. \r\n\r\nWas actually offered the position of Team Leader.", "Interview Questions": "What experience do you have working with young people?"}, {"date": "25 Jan 2019", "title": "Senior Mentor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at National Citizen Service (Reading, England) in Apr 2018", "Interview Descriptions": "A few hours, quick speech, group tasks and interview. Gave us a free lunch and some biscuits. Lots of opportunities to ask questions. You need a dbs check to work for them - they pay for this", "Interview Questions": "Example of a time you've had to make a big decision"}, {"date": "17 May 2018", "title": "APL Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at National Citizen Service (London, England) in Apr 2018", "Interview Descriptions": "Applied, got an assessment the same week. When going to the assessment, firstly had to do a speech for 3 minutes pretending it was the first day and I was introducing myself to the young people, then I had a 1-1  interview and group assessments throughout. Heard back the next week and was given the role.", "Interview Questions": "Name a time when you managed staff on a project?"}, {"date": "3 Jun 2018", "title": "Residential Programmer Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at National Citizen Service (Birmingham, England) in Apr 2018", "Interview Descriptions": "Online application and then group interview - 4 hours with around 12 in the group. I was sent a pre assessment task before the interview, which was to prepare a staff briefing. They were very strict on time as each person had only 3 minutes - they cut you off after this. I had a task involving a set of tasks that I had to prioritise, with the assessors throwing in curveballs every so often.", "Interview Questions": "What do you think you haven't been able to show today"}, {"date": "2 Nov 2019", "title": "Social Action Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at National Citizen Service (London, England) in Apr 2018", "Interview Descriptions": "I first applied for the Pastoral Leadership role. The Interview process consisted of an online registration with question asking to outline experience and motivation for role. If successful, they later contact you for a phone interview, and later an assessment centre where you are asked to prepare a speech to deliver to the young people. The assessment centre was a series of job-related tasks, teamwork activities , plus a 1:1 interview.", "Interview Questions": "What past experience do you have in this role?"}, {"date": "5 Sept 2018", "title": "Senior Mentor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at National Citizen Service (Reading, England) in Mar 2018", "Interview Descriptions": "Very long winded, said they were assessing you at all times - including breaks. Did lots of 'performance' activities in groups of 12-15 and pairs. These included activities such as icebreakers, role play, how you would adapt situations to be inclusive of all etc.", "Interview Questions": "Prepare a 2 minute presentation answering the question 'Why do you want to work for NCS The Challenge?'."}, {"date": "4 Apr 2018", "title": "Workshop Facilitator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at National Citizen Service (London, England) in Mar 2018", "Interview Descriptions": "After applying online and being invited to an assessment day, we were told to prepare a 3 minute presentation and warm-up activity. The process was 4 hours long and we did lots of group activities. It was a lot of expect and should have been a training day rather than an interview process. \r\n\r\nThe day itself was positive, but my issue was with the fact that we weren't given the courtesy of having a personal response or at least an indication of a typical shortcoming after giving so much time and effort. My annoyance stems from the fact they told us there was a place for everyone there. I thought almost everyone was suitable, except maybe one person who gave incorrect information on vocal warm-ups and the components of a narrative. \r\n\r\nI left feeling like I had done a good job and was proud that I had been myself, connected with other team mates, and was confident in each task I carried out. After finding out I wasn't successful, I felt judged on my personality rather than my ability to do the job well. It seems that they are looking for particular characteristics, so if you are loud, outgoing and extrovert, this is probably for you. \r\n\r\nIf you have years of relevant experience but are quieter or more introvert, then this is probably not what they're looking for, and as others pointed out afterwards, it probably wouldn't be a place I would be happy in if that is the only type of person they value in this position.", "Interview Questions": "Give a 3 minute presentation and deliver a warm-up activity for the group."}], [{"date": "11 May 2019", "title": "Mentor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at National Citizen Service in Mar 2018", "Interview Descriptions": "Easy, casual. Group task was just to see how we’d discuss and interact and to demonstrate our teamwork skills. Interview was casual and just asked basic questions so they could see what type of person you are", "Interview Questions": "What have you done to meet a difficult deadline "}, {"date": "10 Mar 2018", "title": "Team Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at National Citizen Service (Middlesbrough, England) in Mar 2018", "Interview Descriptions": "Good interview process \r\nInformal and made you feel comfortable\r\nReally nice people in interview\r\nHelp you in tasks and willing to take questions at any point\r\nGroup orientated tasks to involve everyone and begin to show other skills outside answering questions which was nice", "Interview Questions": "What would your biggest challenge joining NCS be?"}, {"date": "20 Feb 2018", "title": "Senior Mentor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 7 weeks. I interviewed at National Citizen Service", "Interview Descriptions": "The online application was lengthy but very straightforward and actually a good exercise to reflect on all relevant experiences. Didn't have to wait long to hear back about qualifying for the assessment centre. For this, I had to prepare an ice breaker activity and presentation on why I wanted the job. The assessment centre was a good experience with likeminded people, activities were very group orientated and emphasis was on teamwork, communication, etc. Heard I got the role a week later so all very timely and organised!", "Interview Questions": "How will you deliver the NCS curriculum throughout the programme?"}, {"date": "6 Feb 2018", "title": "Support Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at National Citizen Service (Manchester, England) in Feb 2018", "Interview Descriptions": "Online application which was accepted in 24 hours. A assessment day is then given which you need to sign up to on the online portal. Then a 4 hour assessment day involving group work, independent presentation, questioning and problem solving. The day involves 2 10 minute breaks overall it was quite a heavy day.", "Interview Questions": "Why do you want to work for the NCS programme with the challenge?"}, {"date": "19 Feb 2018", "title": "Senior Mentor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at National Citizen Service (London, England) in Feb 2018", "Interview Descriptions": "This is  a group interview, initially there are around 30 people and they are divided into groups of around 8-10. In your group, you first start with your ice breaker which you will have to conduct. After the ice breaker, you need to say why you want to work for NCS with a 2 minute time limit. This interview lasts a whooping 4 hours, and this takes around an hour for everyone to do. After that, they make you act out scenarios between mentors and children in groups of two, which is fairly easy as you get to discuss this with your partner and normally everyone is really nice. After this, they give you a campaign to present to everyone in the group and this normally shows your team work skills, so make sure to engage with the team and ask the person who's speaking the least their opinions. Fortunately, this is the only interview you will have so make sure to stay engaged, answer the questions and smile :)", "Interview Questions": "Why do you want to work for NCS?"}, {"date": "22 Mar 2021", "title": "NCS Mentor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at National Citizen Service (Worcester, England) in Feb 2018", "Interview Descriptions": "Group and individual interview, had to bring items along with me to use to describe myself, then had a group task and finally an individual interview with one member of the interviewers.", "Interview Questions": "To bring along an object that describes me "}, {"date": "28 Sept 2017", "title": "Wave Leader Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at National Citizen Service (Ipswich, England)", "Interview Descriptions": "Very informal and stressless. interviewers and manager were very easy to talk to, upfront and honest. I had many years experience so the questions common however the setting and way i was interviewed was very good.", "Interview Questions": "Asked examples of how I would handle safe guarding issues"}, {"date": "1 Sept 2017", "title": "Associate Manager Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 2 weeks. I interviewed at National Citizen Service (London, England) in Jul 2017", "Interview Descriptions": "I was given an interview at the Waterloo office. It is on the 7th floor and the lift is pretty small and quite old. If you are claustrophobic i would definitely ask if they can make other arrangements for this. The interview was a group interview for 4 hours where they had you doing activities such as role play, session planning etc. They also had individua interviews within the process.", "Interview Questions": "What do you do to motivate staff?"}, {"date": "13 Apr 2021", "title": "Team Leader Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at National Citizen Service in Jun 2017", "Interview Descriptions": "Application - informal chat - competency based interview. Pretty straightforward process as there's a lot of positions to fill. two round interview with informal chat to discuss experience followed by more formal competency based interview.", "Interview Questions": "Describe a time you've shown leadership "}, {"date": "14 Feb 2018", "title": "Support Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at National Citizen Service (Wilmslow, England) in Jun 2017", "Interview Descriptions": "Was invited to two recruitment events along with other candidates. Brief and pleasant process. No individual interview took place; the meetings were rather informative. Very informal and comfortable environment. I had a great time during the programme as well!", "Interview Questions": "N/A"}], [{"date": "20 May 2017", "title": "Accommodation Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at National Citizen Service", "Interview Descriptions": "-Group Interview,  Work in groups and pairs.\r\n- Have to act out certain scenarios and say what you would do in that situation. \r\n- Have to do a mini speech to the rest of the group. \r\n- Several tasks, you remain in the same group throughout, everyone in the group is applying for different roles so don't let this intimidate you.", "Interview Questions": "Give an example of how you dealt with a challenging situation?"}, {"date": "26 Jan 2019", "title": "Team Leader Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at National Citizen Service (London, England) in May 2017", "Interview Descriptions": "For the interview process it was in a few stages, firstly the Individual interviews, asking usual interview questions such as examples of past experiences and skills, they also had  group activities .", "Interview Questions": "Team working examples"}, {"date": "20 Jan 2018", "title": "Senior Mentor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at National Citizen Service (Preston, North West England, England) in May 2017", "Interview Descriptions": "Full assessment day with a group of 7 others. Had to prepare and deliver an icebreaker, roleplay several scenarios and work together to order the key qualities a Senior Mentor needs.", "Interview Questions": "What qualities do you have that you could bring to the role?"}, {"date": "22 Jun 2018", "title": "Team Leader Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at National Citizen Service (Leicester, England) in May 2017", "Interview Descriptions": "Phone call that lasted 15 mins, followed by an assessment day and a first aid training session. Final phone call and emailed contract. Very straight forward, eager to hire. Questions are very basic and ask if you have experience, if you do not then you might be demoted to assistant which isnt much difference.", "Interview Questions": "do you have experience working with teenagers or children?"}, {"date": "26 Nov 2018", "title": "Lead Mentor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at National Citizen Service (Maidstone, England) in Apr 2017", "Interview Descriptions": "Interview based on experience working with Young People, understanding of safeguarding and knowledge of NCS. Asked about own experience on NCS and working with Young People in a residential setting. Fairly informal, 2 interviewers.", "Interview Questions": "What do you understand by the word ‘Safeguarding’ ? "}, {"date": "19 Apr 2017", "title": "Team Leader Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at National Citizen Service (Ipswich, England) in Apr 2017", "Interview Descriptions": "We were put into groups of around 12 and had different activities to do throughout the day within our group. The whole interview took around 4 hours and we got told we will hear back within 7 days of the interview to let us know whether we were successful or not.", "Interview Questions": "how would you act in a certain situation e.g. if a male was in the girls only corridor"}, {"date": "2 May 2017", "title": "SalesForce Support Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at National Citizen Service (London, England) in Apr 2017", "Interview Descriptions": "Applied online via reed\r\nGot an phone screening by a recruiter and then asked to go to face to face interview\r\nemail setup for date of interview\r\ninterviewed on location at NCS head office", "Interview Questions": "Why do you wanna work for us"}, {"date": "8 Jun 2017", "title": "Team Leader Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at National Citizen Service in Mar 2017", "Interview Descriptions": "I went through a phone interview where the interviewer asked some basic questions on why I chose NCS and why I wanted to work with that company. Then she went through several scenarios and I had to reply on how I would react to them. They said they would be in contact but never sent any form of contact afterwards", "Interview Questions": "Why do you want to work with young people?"}, {"date": "7 Apr 2021", "title": "Assistant Program Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at National Citizen Service (London, England) in Mar 2017", "Interview Descriptions": "Initial group interview with different tasks and role play opportunities. Each group interviewee was taken out one by one to do their 1:1 interview. Standard competency questions during 1:1 interview, which lasted about 30 minutes.", "Interview Questions": "describe a time you have managed conflicting priorities "}, {"date": "12 Apr 2021", "title": "Assistant Leader Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 4 weeks. I interviewed at National Citizen Service (Bedford, England) in Feb 2017", "Interview Descriptions": "Following simple application submission there was an assessment centre with group interview and an individually-run session. The inidivdual session took the form of organising and teaching a physical activity to the group, along the lines of the physical activities we would be running with the young people on the job.", "Interview Questions": "Why do you want to work for NCS?"}], [{"date": "4 May 2017", "title": "Assistant Programmer Leader Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at National Citizen Service (Birmingham, England) in Feb 2017", "Interview Descriptions": "Group excersises, including role plays and presentations plus an individual interview. An enjoyable day but very tiring and felt like quite a bit to go through for one wave of work.", "Interview Questions": "What equips you for this role?"}, {"date": "13 Oct 2017", "title": "Senior Mentor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at National Citizen Service (London, England) in Apr 2016", "Interview Descriptions": "It was a fun interview in a group setting. Everyone was energetic and they provided lunch. The process itself lasted a few hours and I got a follow up email saying I got the job in a few weeks.", "Interview Questions": "Prepare a group starter "}, {"date": "17 Oct 2016", "title": "Assistant Programmer Leader Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at National Citizen Service (London, England) in Apr 2016", "Interview Descriptions": "Group Assessment House that was about 90 minutes and included about 20 other candidates. Questions and role plays were mainly about leadership, staff management and management of young people. Then, onto 1-1 interview that reviewed your cv and had you discuss your skills, knowledge and experiences. Questions were fair. Process was meant to be non competitive because of several posts on offer(although some candidates very competitive any way).", "Interview Questions": "How would you work inclusively with young people?"}, {"date": "6 Mar 2016", "title": "Senior Mentor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at National Citizen Service (London, England) in Feb 2016", "Interview Descriptions": "After filling in an extensive form you are invited to a group assessment centre.\r\n\r\nTypically the groups are assessed in 12s, but as my group was small, we had 8 people in each group.\r\n\r\nThere are three rounds.\r\nRound 1 - Roleplays where you pretend to be a Senior Mentor\r\nRound 2 - Questions (in a group) about your motivations, sharing a facilitated review session following  a scenario you are given before the interview\r\nRound 3 - Preparing a presentation to talk about your charity review, identifying key traits of a senior mentor", "Interview Questions": "Describe a situation in which you worked with a challenging young person. How did you deal with any issues that arose."}, {"date": "28 Nov 2018", "title": "Team Leader Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 months. I interviewed at National Citizen Service (Cirencester, England) in Feb 2016", "Interview Descriptions": "Took about 20 mins. Interview by a panel but all individuals were friendly and chatty so nerves were gone by the time the interview began. Found the interview a positive experience", "Interview Questions": "What activities would you conduct in the evenings of the residential "}, {"date": "3 Feb 2017", "title": "Senior Mentor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at National Citizen Service (London, England) in Apr 2015", "Interview Descriptions": "Half day assessment centre\r\nNo individual interview but lots of group activities including discussion potential solutions to behavioural problems and role plays where you have to interact with pretend young people.", "Interview Questions": "How would you support a young person that was being disruptive in group situation."}, {"date": "11 Feb 2017", "title": "Team Lead Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at National Citizen Service (Saint Austell, England) in Mar 2015", "Interview Descriptions": "Interview process was professional and of a suitable time.  No issue, The location was appropriate and clean, the interviewers were well mannered and well timed, the questions were relevant and appropriate to the job in question", "Interview Questions": "About my experience working with young people"}, {"date": "11 Apr 2016", "title": "Senior Mentor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at National Citizen Service in Mar 2015", "Interview Descriptions": "The interview was a group assessment day. You had to do a variety of role play activities to assess your ability to handle situations as a senior mentor. For example another person at the assessment would play a young person who is home sick and wanted to leave the programme and you would have to reassure them. Other activities involved leading review sessions to demonstrate your ability to facilitate activities and the programme sesssions. You would also have to run icebreaker activities for the group. Overall a fairly relaxed and fun day.", "Interview Questions": "They didn't have specific one on one questions, but rather wanted you to demonstrate your attributes through group activities. "}, {"date": "12 May 2017", "title": "Mentor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at National Citizen Service (Lincoln, England) in Feb 2015", "Interview Descriptions": "Job overview through a presentation - NCS values and the requirements of the job\r\nGroup task - build a bridge with straws\r\n1-2-1 interview (moderately formal, they clearly wanted to see my personality)", "Interview Questions": "What will be your biggest weakness on the program?"}, {"date": "26 Sept 2017", "title": "Project Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at National Citizen Service (Croydon, England) in Jan 2013", "Interview Descriptions": "There was a group interview, one to one interview and we had to do different challenges throughout the day. It was interesting but challenging. We also were given a lot of role play exercises.", "Interview Questions": "What was my previous experience ? "}]]