[[{"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Good starter higher ed job, once a close community; increasingly negative tenor", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "16 May 2014", "job_title": "Anonymous Employee in Rindge, NH", "duration": "N/A", "pros": "A chance to help students reach their potential by studying at a beautiful location in a community where the professors know their names. Four dollar lunches for staff. If higher ed is the industry for you, the Rindge campus is the only game in town if you live in the area and want a short commute.", "cons": "It doesn't feel nice here anymore, which makes it harder to give students that one thing that we used to do best--be us, a close-knit, communicative community with an identity."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 1, "Senior Management": 0, "review_title": "Higher Education Does Not Pay", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "16 May 2014", "job_title": "Coach in Rindge, NH", "duration": "N/A", "pros": "Working on a beautiful campus in Southern New Hampshire is hard to beat.  Overall the work environment is laid back and easy going.  While I was there the school was doing well and growing.  Unfortunately most small private colleges are taking a hit these days.", "cons": "I worked in the athletic department and the AD ruled with an iron fist.  Having previously been a coach himself I think he elevated up the company ladder to a position of management without the actual people skills to pull it off.  He was proud of the fact that his teams \"did so much with so little\" which really means, \"we don't pay much and don't invest much yet we overachieve\".  that can only go on  for so long."}], []]