[[{"date": "2 Jun 2023", "title": "Program Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Rochester Regional Health (Rochester, NY)", "Interview Descriptions": "Phone screen with HR recruiter and then in person interview with director and other office staff. Very conversational and comfortable. Situational type questions and then mostly just making sure a good team member fit.", "Interview Questions": "How well do you know excel"}, {"date": "21 Mar 2023", "title": "Clinical Audiologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Rochester Regional Health", "Interview Descriptions": "The interview process includes an interview with Human Resources, a phone interview with department head and office manager, then in-person interview. Questions included current interests, experiences, skills, and future opportunities.", "Interview Questions": "Do you have a New York state audiologist license"}, {"date": "25 Oct 2022", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Rochester Regional Health", "Interview Descriptions": "The interview process was good the first interview usually done by phone with the HR and it will take about 10 to 15 minutes after that the HR will share your information with the hiring manager and if hiring manager decided to interview you they will contact you directly and this is the second interview which is either via zoom or in person and overall it’s a smooth process", "Interview Questions": "Why are you interested in this roll and why do you want to work for Rochester regional health?"}, {"date": "25 Sept 2022", "title": "Environmental Services Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Rochester Regional Health", "Interview Descriptions": "I set up the interview, and was asked maybe 2, 3 questions by a manager that was there on her last day. This may have impacted the length and difficulty of the interview. ", "Interview Questions": "What do you know about UMMC?\nWhy do you want to work here?"}, {"date": "17 Jul 2022", "title": "Environmental Services Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Rochester Regional Health (Rochester, NY) in Jul 2022", "Interview Descriptions": "I would like to interview process  soon,l want to meet with team members talk about my future jobs,And  l am  also happy to join Rochester regional health team soon.when the team member ask question,answer question with team member contact with eyes.", "Interview Questions": "N/A"}, {"date": "27 May 2022", "title": "Material Handler Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Rochester Regional Health", "Interview Descriptions": "It was nice and easy and simple as well as straight forward. I remember questions being fair and it wasn't any rounds just one interview and I was good. After that I just waited for about 3days-week and I got an offer", "Interview Questions": "I forgot what they asked N/A"}, {"date": "4 May 2022", "title": "Physician Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Rochester Regional Health", "Interview Descriptions": "Multiple interviews with high ranking officials, which allowed a good perspective of how the overall system works. I also had a chance to meet with potential colleagues, staff, and administration.", "Interview Questions": "1. What do you hope to gain from your experience here?\r\n2. What skills do you bring that are unique to you?"}, {"date": "17 May 2022", "title": "Patient Care Technician Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Rochester Regional Health (Rochester, NY) in May 2022", "Interview Descriptions": "Easy to apply, friendly communications between a recruiter and the interviewer. Went to an in-person job interview at RRH. Welcomed by the staff and they were happy to answer all of my questions.", "Interview Questions": "Why do you want to work here?"}, {"date": "26 May 2022", "title": "Clinical Privileging Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Rochester Regional Health (Rochester, NY) in May 2022", "Interview Descriptions": "First get a call to describe the position and see if it fits your skills.  It usually takes up to 30 minute Zoom meeting.   If it goes well, you will be asked for a 2nd interview.", "Interview Questions": "How do you deal with difficult providers?"}, {"date": "30 Jan 2022", "title": "Diaylsis Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Rochester Regional Health", "Interview Descriptions": "The interview process was easy. It was very unformal. You shadowed the tech that's working. You ask questions and you get to see what they do on a day to day basis. After the interview you sit down and they asked if you liked the job. I didn't really have a interview it was more of a regular conversation. If they like you then you got the job and if not you get an email.", "Interview Questions": "Have you worked in Healthcare before?\r\n"}], [{"date": "5 Dec 2021", "title": "Flow Cytometry Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Rochester Regional Health", "Interview Descriptions": "I heard back from a recruiter maybe a day after applying for the position, which is rare nowadays. I looked at it as positive but immediately went back to Glassdoor to see if I could gain more insight. I was skeptical after receiving a call so quickly and also saw that there were no applicants event after the position had been open for more than a month.\n\nI had a phone screening with the recruiter and all went well until the topic switched to salary expectations. The recruiter talked up Rochester and RRH and how family-oriented the environment is (red-flag: usually means you're getting paid a \"competitive salary\" or a lot worse and supplemented with cheap pizza and gift cards). I had heard such but had also heard how rough Rochester and working for RRH can be. The recruiter talked more about the city than anything but also talked about how RRH is expanding its flow cytometry. I know everyone is trying to do this right now for NGS and cancer research. So, it was a red flag for me (profit and gov't subsidies to make more profit almost none of which gets to the staff in a significant portion). I was also told I'd be on the bench for a while before having an actual staff, which I was okay with to start but I started to get a feeling that I would be walking into a do-more-with-less situation, meaning that although they were currently looking for manager, they were probably more in need of a director or above (I would be able to fill those rolls too).  But trying to save on salary costs by hiring a manager, creating profits for RRH and the executives. Because that's what hospitals and labs do :). Expansion, mergers and acquisitions means that we're not growing. So, buy up competition and keep bringing in profits. It's always weird to me to get this feeling in a healthcare environment. But I was starting to get the feeling that staff reviews were going to be confirmed soon. \n\nRecruiter asked the usual questions (tell me about yourself, why are you applying for this role etc.) Then as usual with hospitals and lab related companies, rather than being upfront about salary range, I was asked about my expectations (another red flag). Unwilling to give this information, we moved on to some other questions, including more detailed ones that were more for the hiring manager. There were a few more questions and cordials, including questions about NYC certifications for med techs/ CLSs. I already knew the criteria but I was asked how quickly I could obtain the certifications. I said I'd have to get back but knew from previous research processing alone is 1-3 months.\n\nI received an email the next day from the recruiter with info about the certification process for NYC testing. I then responded stating time frames and asked more questions. GHOSTED at this point only to receive a generic message 3 weeks later that they were looking at different candidates.\n\nI say all this because this has been happening a lot lately and unnecessarily so. Commnication is key yet there's very little. Transparency is expected on the end of the employee yet silence from the employers. I've read about RRH from Glassdoor and this interview just confirmed it. It's a scam hospital system as usual. Hospital execs make profit. Leave the staff and patients in bad situations and move on to \"create value\" for other companies. It's really sad.\n\nIf you can avoid this place, please do. If you need a job, do it and keep in mind that your goal is to find better. So do something towards that and get away from this \"family-oriented\" city called Rochester and RRH.", "Interview Questions": "Tell me about yourself?\nAre you certified in NYC as med tech/CLS?\nDo you know anything about Rochester/RRH?\nWhat are your salary expectations?\n"}, {"date": "26 Jan 2022", "title": "Customer Service Billing Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Rochester Regional Health (Rochester, NY) in Nov 2021", "Interview Descriptions": "Simple. The supervisor went over the job responsibilities, and asked a couple of questions. Basically a conversation. Then a shadowing of someone on the job so I’d actually get a feel of what i would be doing.", "Interview Questions": "Describe a time when you had to solve a problem for a customer/patient/client and how you resolved it?"}, {"date": "25 Aug 2021", "title": "Social Worker Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Rochester Regional Health", "Interview Descriptions": "They took a really long time to get back to me in between interviews, strung me along through three interviews and then went with someone else. However, the people were welcoming and helpful.", "Interview Questions": "Can you give us a situation when you were in conflict with a client and how you handled it?"}, {"date": "9 Dec 2021", "title": "Physician Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Rochester Regional Health (Rochester, NY) in Jul 2021", "Interview Descriptions": "The team was very accommodating. Also, very organized. The chauffeur was very informative.  The lunch and hotel were ideal. The gift basket was very personalized.  Overall, one of the best interview experience.", "Interview Questions": "Why did you apply to Rochester?"}, {"date": "27 May 2021", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Rochester Regional Health", "Interview Descriptions": "I was interviewed by a group of 5 which seemed intimidating at first but it was actually the reason I chose to accept the offer over others. office is close and familial with staff employment 5 years+", "Interview Questions": "The most difficult question to answer was why i believe i was the right candidate "}, {"date": "15 Jan 2022", "title": "Appointment Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Rochester Regional Health in Dec 2020", "Interview Descriptions": "(12/2020) I applied for the position. I heard back for the recruiter that very day and had an quick phone interview. I was set up for a phone interview with the hiring manager and was hired on the spot.", "Interview Questions": "Customer service-type questions. Where I saw myself five years from now. "}, {"date": "1 Sept 2020", "title": "New Grad Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Rochester Regional Health", "Interview Descriptions": "It was with the nurse manager and a staff nurse. They were open and friendly to me throughout the process. I was able to shadow the floor nurse for a little while.", "Interview Questions": "Describe a situation you saw in clinical a?"}, {"date": "25 Feb 2020", "title": "Social Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Rochester Regional Health (Rochester, NY) in Feb 2020", "Interview Descriptions": "A phone call was first, and then an in person interview. The interview was very nice, and it was straightforward. Make sure you know the position that you are interviewing for.", "Interview Questions": "What is a quality that you would want to work on most. "}, {"date": "20 Jan 2020", "title": "Account Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Rochester Regional Health", "Interview Descriptions": "Quick and easy.  The system you apply into is very automated and easy to use.  I heard back within a few days and had an onsite after a phone call.", "Interview Questions": "Questions asked were about my experience and credentials for the role.  A few scenario based questions as well. "}, {"date": "14 Apr 2020", "title": "Internship Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Rochester Regional Health (Rochester, NY) in Dec 2019", "Interview Descriptions": "Brief assessment of my past jobs, and qualifications  and questions regarding my motives and goals as an individual. Followed by Description of what the job entails, and questions of why i would be able to fulfill the expectations.\r\n\r\n\r\n This was followed the usual Cultural malarkey, sprinkled with cutting edge corporate policy chatter.", "Interview Questions": "Why do you think you will be a good fit with our organization?"}], [{"date": "12 Apr 2023", "title": "FERC Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 3 days. I interviewed at Rochester Regional Health (Rochester, NY) in Jun 2019", "Interview Descriptions": "It was pretty fast! I received a call and was interviewed that same week. They told me the next day after the interview that I received the job. From getting offered the job I started training on the job about a week or two later.", "Interview Questions": "The standard “why do you want to work here?”"}, {"date": "16 Oct 2019", "title": "Web Communications Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Rochester Regional Health (Rochester, NY) in May 2019", "Interview Descriptions": "I submitted my resume and cover letter through indeed.com. Then, I emailed to follow up. I was contacted to schedule a phone interview. The phone interview went well. They scheduled another phone interview with a higher-up then I received my offer via email", "Interview Questions": "Why do you want to work in healthcare? "}, {"date": "6 Mar 2021", "title": "Patient Care Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Rochester Regional Health in May 2019", "Interview Descriptions": "Process was very quick! Interview was about 10 minutes and got an offer the very next day. I interviewed with a nursing manager on the unit I was hired to work on.", "Interview Questions": "Why are you interested in working inn healthcare?"}, {"date": "23 Apr 2019", "title": "Pct Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Rochester Regional Health", "Interview Descriptions": "Unfortunately i had to apply multiple times before receiving an interview. However the interview itself went great. My manager had me come in and shadow for two hours. After the intial shadow I met with the nurse manager and the charge nurse. They not only asked me about my work history but questions about me as a person which I appreciated.", "Interview Questions": "What previous health care or life experience have you had?"}, {"date": "10 Feb 2019", "title": "Software Engineer Co-Op Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Rochester Regional Health", "Interview Descriptions": "they conducted two rounds. First one was just basic about when I am available to join. How long can I stay? Second round was about my resume and what tachnologies I have worked with before.", "Interview Questions": "About the projects"}, {"date": "25 Sept 2018", "title": "Financial Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Rochester Regional Health (Rochester, NY) in Aug 2018", "Interview Descriptions": "Was given only one phone interview, interviewer seemed dis-interested.  Lasted only 20 minutes.  They seemed defensive, almost questioning why I would want to work there.  It was one of the oddest interviews I've had.", "Interview Questions": "Why would you want to work at Rochester Regional Health"}, {"date": "27 Mar 2018", "title": "Finance Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Rochester Regional Health", "Interview Descriptions": "You can apply online, the next step is HR will interview you, then the hiring manager will interview you, then you will have a peer interview.  It takes about 4 - 5 weeks.  They ask behavioral type questions.", "Interview Questions": "How do you deal with difficult people?  Why do you want to work here?  Tell me about yourself."}, {"date": "8 Aug 2018", "title": "Nurse Practitioner Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Rochester Regional Health (Rochester, NY) in Feb 2018", "Interview Descriptions": "I applied online and was contacted by a recruiter very quickly. Initially I had a phone interview. Then I interviewed with the team I would be working with. The process was very quick, perhaps a total of 10 days from initial application.", "Interview Questions": "Name a time when you had to manage a conflict with a patient or coworker."}, {"date": "21 Nov 2017", "title": "Operations Supervisor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Rochester Regional Health (Rochester, NY)", "Interview Descriptions": "Recruiting is quick and responsive, as is the manager. Moved quickly to peer interview. Compensation took a long time to craft a less-than-average offer. This is very disappointing. It would be a great place to work, otherwise", "Interview Questions": "What skills and experiences will you bring to help us improve operations and how have you applied them to affect change in other roles?"}, {"date": "28 Nov 2017", "title": "New Grad RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Rochester Regional Health (Greece, NY) in Nov 2017", "Interview Descriptions": "I applied online, and got an email from a nurse recruiter within the hour to schedule a phone interview. I ended up having an unofficial interview while on a unit during my capstone, and was offered a job (pending my passing the NCLEX, and going through a drug screening soon) before leaving the meeting. The interviewer was very personable, and wanted to make sure I found a floor that was a good fit, so she scheduled times for me to shadow several units in the near future.", "Interview Questions": "What three words would you use to describe yourself?"}], [{"date": "27 Sept 2017", "title": "Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Rochester Regional Health (Rochester, NY)", "Interview Descriptions": "A half hour one one one with area director and then given a week to wait for a response that never came and then an email notifying that I didn't get the job or another second interview.", "Interview Questions": "Are you comfortable using computers and different software."}, {"date": "24 Sept 2017", "title": "Access Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Rochester Regional Health (Rochester, NY) in Jul 2017", "Interview Descriptions": "I interviewed with 3 current supervisors in the department i would be working in. Interview was pretty straight forward and they asked numerous questions about my work history and why I was applying for the job", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "6 May 2017", "title": "Security Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Rochester Regional Health (Rochester, NY) in Apr 2017", "Interview Descriptions": "Basic interview questions were asked.  They wanted to know my experience, where did I see myself in 5 years, information explaining my education, coop experience and previous employment information.    They also asked me to walk them through a situation where I secured a dispute.", "Interview Questions": "Tell me about a conflict you had with a co-worker and how did you resolve it."}, {"date": "16 Dec 2018", "title": "Business Analyst Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 3 weeks. I interviewed at Rochester Regional Health (Rochester, NY) in Mar 2017", "Interview Descriptions": "Applied online. Received call from recruiter for telephone screening. Typical questions about current job and experience. Then received email from hiring manager for face interview. Offered came in lower then expected.", "Interview Questions": "Behavior team questions"}, {"date": "5 Apr 2019", "title": "Pct Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Rochester Regional Health (Rochester, NY) in Oct 2016", "Interview Descriptions": "The hiring process began with an online application followed up by a group interview. After the group interview it took them 2 months to get back to me and then I got a phone interview. After this interview I had a shadow on the unit and an interview with the nurse manager.", "Interview Questions": "Why do you want to work in the healthcare field?"}, {"date": "25 Aug 2016", "title": "New Grad RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Rochester Regional Health", "Interview Descriptions": "Interviews are based on behavioral aspects and experience. They utilize their team members from different disciplines in the interview process as well. They also give you the opportunity to shadow to see if you'd like the position.", "Interview Questions": "How did you handle a difficult situation and turn it into s positive experience for the patient or either used it as a learning experience to improve the way you deliver care"}, {"date": "6 Aug 2016", "title": "New Grad RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Rochester Regional Health (Newark, NY) in Aug 2016", "Interview Descriptions": "Friendly, down to earth managers and staff. Everyone seemed happy on the floors during tour of hospital. Played phone tag with recruiter for four days before getting in touch for official job offer.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "9 Jan 2019", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Rochester Regional Health (Rochester, NY) in Jul 2016", "Interview Descriptions": "I spoke with a nurse recruiter who was very kind and helped me find the job I wanted at the pay I requested.  Then I moved on to interviewing with the unit manager, and finally interviewed with a panel of nurses and techs.", "Interview Questions": "Name a time where you had to work with difficult coworkers and how you dealt with it."}, {"date": "13 Apr 2016", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Rochester Regional Health (Rochester, NY) in Mar 2016", "Interview Descriptions": "I waited in the waiting room upon arrival. Then I had a 1:1 interview with nurse manager in her office. After the interview I took a tour of the unit and met a few members of the staff. She gave time for questions and then walked me out.", "Interview Questions": "Tell me about a time you had conflict and how you resolved it"}, {"date": "29 Dec 2016", "title": "Physical Therapy Neuro Residency Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Rochester Regional Health (Rochester, NY) in Feb 2016", "Interview Descriptions": "Application Process via RF-PTCAS with a follow up phone interview where they chose final candidates for the position. Interview was two part panel interview with initial being inpatient followed by outpatient.", "Interview Questions": "Can you describe how you use evidence based practice in your everyday work with patients?"}], [{"date": "30 Nov 2017", "title": "Dialysis Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Rochester Regional Health (Rochester, NY) in Jan 2016", "Interview Descriptions": "Three person interview with short questions based on scenarios. You must dress formal. They will give you a tour of the building and make sure you express you want the job.", "Interview Questions": "whats a negative trait about you "}, {"date": "2 Apr 2016", "title": "Financial Counselor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Rochester Regional Health (Rochester, NY) in Jan 2016", "Interview Descriptions": "Very nice people, appropriate questions.  Took  almost 2 months to find out I was not offered position...Process took too long.  Company does not seem to want to promote from within.  Almost easier to obtain a new job at another health System.  I have received no less than 20 offers to be interviewed for numerous positions at Strong.  Went on 2 interviews with Unity to try and obtain a new skill set, (been at same job for 20 years!)...No offers for positions I was totally qualified for. Human Resources no help at all.  Will continue to pursue other options at Strong.  Don't even bother trying to move up in career there.  Waste of time.", "Interview Questions": "How do you handle a fast paced environment?"}, {"date": "9 May 2016", "title": "Biomechanics Co-op Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at Rochester Regional Health (Rochester, NY) in Nov 2015", "Interview Descriptions": "Interview conducted on floor. Began with a tour of the facility with explanation of what happens day to day. Throughout this time questions about hypothetical medical problems were brought up to determine knowledge of the body as well as background into product ideation and design. A small interview was conducted with head of department and then a large interview with floor supervisors were conducted. It was approximately 1.5 hours.", "Interview Questions": "Someone has had a stroke and resulted in an inability to move their distal extremities, how would you help this patient function in daily tasks such as eating, bathing, or combing their hair?"}, {"date": "16 Dec 2015", "title": "Unit Secretary Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Rochester Regional Health (Newark, NY) in Nov 2015", "Interview Descriptions": "I had a brief interview with the Nurse manager on the floor, she then asked 2 other employees (one that was already filling that position and a nurse on that floor) to interview me as well. They told me that they like to get multiple peoples opinion and if any of the people interview say no then you are automatically out of the running for the position.", "Interview Questions": "They asked how I was under stress since being in a hospital setting it is sometimes fast paced and stressful."}, {"date": "14 Aug 2016", "title": "Patient Care Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Rochester Regional Health (Rochester, NY) in Jan 2015", "Interview Descriptions": "Filled out an application form online HR contacted me several weeks later via email to schedule a group interview and from there I went to interview in the department. In the \"unit\" interview I met with some of the leaders of the floor and the manager. First I met with the Nurse manager and was asked similar questions \"why would I be a good fit?\" what kind of experience I had and what I knew about the facility. Then I was group interviewed by the staff on the unity they also asked similar questions and gave me situations I would be faced with to give me a better understanding of the position.", "Interview Questions": "Why do you think you will be a good fit here?"}, {"date": "19 Apr 2015", "title": "Clerical Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Rochester Regional Health in Jul 2014", "Interview Descriptions": "A very long wait to get an interview, hard to reach anyone in HR, interview was ok.  But once you get hired staff are not so kind to, they have their picks.", "Interview Questions": "What was the most stressful time you had on you last job, and how did you handle it."}, {"date": "12 Sept 2016", "title": "Support Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Rochester Regional Health (Rochester, NY) in Sept 2012", "Interview Descriptions": "I filled out the online application and was called by HR for a phone interview. After the phone interview I received a call from the manager for an in person interview, which lead to a peer interview with three staff members other than the manager.", "Interview Questions": "I was asked to describe a situation where I had to deal with an upset client or coworker and how did I handle the situation"}, {"date": "6 Sept 2016", "title": "Finance Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 5 months. I interviewed at Rochester Regional Health (Rochester, NY) in Aug 2012", "Interview Descriptions": "Easy interview process. Met with HR, hiring manager, peer. Was an expanded role from my current position and was excited about the enhanced opportunity. Challenges of the department were vastly understated or omitted during the interview process. Hiring manager was very flexible on start date.", "Interview Questions": "N/A"}, {"date": "1 Jul 2016", "title": "Executive Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Rochester Regional Health (Rochester, NY) in Jul 2012", "Interview Descriptions": "I got the interview so that Human Resourse could save face and actually interveiw an internal candidate, there is not much else to tell, the interviewers were very disinterested, not sure what else to say but will use up words, the interveiw was disheartening, not about skills and experience all about what Human Resources chooses to do", "Interview Questions": "Why do you want this job"}]]