[[{"date": "6 Jun 2023", "title": "Performance Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Baptist Health South Florida (Miami, FL)", "Interview Descriptions": "Phone interview with HR first. Then onsite interview. Group peer interview. They mostly asked behavior questions. It took about one hour. Starting from tell me about yourself. Why are you interested in this position", "Interview Questions": "How to deal with difficult situation. What you did, would you do anything differently and what did I learn."}, {"date": "3 Jun 2023", "title": "Nurse Practitioner Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Baptist Health South Florida", "Interview Descriptions": "Lengthy.. takes months and several interviews before a decision in made. There are also panel and peer Interviews where a multitude of questions are asked. HR did the first interview, then department interview with supervisor, panel and/or peer interview.", "Interview Questions": "Plenty of Scenario questions, strength/weaknesses etc."}, {"date": "22 May 2023", "title": "Clinical Applications Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Baptist Health South Florida (Coral Gables, FL) in May 2023", "Interview Descriptions": "Recruiter was wonderful, first interview went pretty well. Third interview was a dumpster fire - AVP that was hiring was disturbed when I stated I was looking for opportunities with growth potential. She (the AVP) turned pretty cold and heartless quickly when I stated this position would not be where I spend the remaining 20 years of my career; I would come in, fix the issues at hand and look to grow within the company...that turned her off big time. Other director attending interview was eccentric and definitely bowing down to his queen.", "Interview Questions": "Mostly technology operations questions - ITIL and ITSM related."}, {"date": "24 Apr 2023", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Baptist Health South Florida (Miami, FL)", "Interview Descriptions": "Peer interview with every person asking you a question. Like “how to handle a difficult coworker” “ why do you want to work here” “ example of teamwork” “ name an accomplishment you are proud of”", "Interview Questions": "How would you handle a difficult coworker?"}, {"date": "11 Apr 2023", "title": "Courier Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Baptist Health South Florida (Miami, FL)", "Interview Descriptions": "Called for a position but called one that fit my resume better. Expected to start tomorrow, also trying to look out for the other departments as well. Most positions over here seem pretty easy to get into.", "Interview Questions": "Basic interview questions like why do you want a job here"}, {"date": "6 Apr 2023", "title": "Secretary Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Baptist Health South Florida", "Interview Descriptions": "Cumbersome and behavior based questions but managers were straightforward and realistic of the expectations of the position. Sadly I outgrew the position rather quickly and moved on to another department", "Interview Questions": "Mostly behavior based questions which don’t really gauge a potential employees potential"}, {"date": "4 Feb 2023", "title": "Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Baptist Health South Florida", "Interview Descriptions": "Two part interview, one with two managers and then was asked back for a second interview about a week later with a panel. Straightforward and was able to get a good sense of the team’s culture.", "Interview Questions": "How do I handle difficult situations?"}, {"date": "12 Jan 2023", "title": "Registration/Financial Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Baptist Health South Florida (Miami, FL) in Jan 2023", "Interview Descriptions": "The 1st call, went very smooth-the recruiter/representative was warm, considerate asked targeted and appropriately probative questions, she then scheduled me to meet with the supervisors, and fellow interviewers within a week I was a bit nervous initially but they were direct, focused and very invested and interested in the process. It was obvious they were concerned with the KIND of person they wanted on the team.", "Interview Questions": "What is an example of a time you failed, what did you learn, how have you implemented your lesson in the future?"}, {"date": "23 Mar 2023", "title": "Clerk Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Baptist Health South Florida in Jan 2023", "Interview Descriptions": "The interview process was a peer interview.Very simple yet thorough.Typical interview questions such as how do you handle conflict with peers and are you a team player.What would make me a great fit for the company.", "Interview Questions": "How are you a leader?"}, {"date": "16 Oct 2022", "title": "Administrative Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Baptist Health South Florida", "Interview Descriptions": "The interview process was good. It’s a panel style interview therefore it’s important to understand the positions responsibilities and be prepared to answer difficult questions. My interview was via zoom so fortunately it was a very seamless experience.", "Interview Questions": "Tell us a time where you had a difficult situation at work and how did you resolve it?"}], [{"date": "3 Oct 2022", "title": "Financial Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at Baptist Health South Florida (Boca Raton, FL)", "Interview Descriptions": "Got an email from the recruiter after applying asking many more questions some of which were already answered in the application process. After responding and setting up a time and date to interview I got ghosted. Followed up 2 times and got no response then weeks later got a denial email.", "Interview Questions": "N/A"}, {"date": "1 Nov 2022", "title": "Senior Data Engineer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 5 weeks. I interviewed at Baptist Health South Florida (Miami, FL) in Oct 2022", "Interview Descriptions": "They rescheduled the interview twice with less than a couple hours notice, and didn't even bother asking if candidate was available for interview at that time. \r\n\r\nNo feedback even after more than 3 weeks of interview, job remains open at the career site and shows candidate is in consideration, no decline notice.", "Interview Questions": "1. Number of PTOs are only 12 per year other than national holidays, are you fine to proceed with this knowledge. 2. Questions around Data Modeling, Github CI/CD, Snowflake. 3. A trick question was asked by the Hiring Manager about a feature that doesn't exist in a software (Have you used Indexing in Snowflake?)."}, {"date": "27 Sept 2022", "title": "Clinical Partner (CNA) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 2 months. I interviewed at Baptist Health South Florida", "Interview Descriptions": "Job fair interview was held where there was a one on one interview with an HR recruiter then a month later proceeded to virtual interview with floor manager. Process took long, but there is a lot of people being hired lately. ", "Interview Questions": "How would you deal with when working with a difficult co-worker? "}, {"date": "13 Sept 2022", "title": "Surgical Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Baptist Health South Florida", "Interview Descriptions": "It is a panel interview with several situational questions. There are usually 3 to 5 people in the interview. It lasted about 40 minutes. The interviewers are looking for examples for your answers. Be as specific as possible.", "Interview Questions": "Make your resume come to life."}, {"date": "31 Aug 2022", "title": "Lead PFR Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Baptist Health South Florida", "Interview Descriptions": "super quick, three people, wasn't that hard, they ask u maybe three questions about customer service and then you wait outside with a bunch of people to get to the second interview. from there someone from hr calls you and then they let you know if you got the job", "Interview Questions": "how have you gone above and beyond for a customer?"}, {"date": "18 Dec 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Baptist Health South Florida (Homestead, FL) in Sept 2022", "Interview Descriptions": "Fast and easy. There are two interviews, the first is a general meeting, the second on is centered with managers of the unit you’re applying for. The recruiter keeps you updated throughout the entire process. They sent an offer within 2 weeks of the final interview.", "Interview Questions": "Tell me about yourself? You see a guy roaming around the parking lot with a hospital gown, what do you do?"}, {"date": "12 Oct 2022", "title": "Certified Medical Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 3 weeks. I interviewed at Baptist Health South Florida (Kendall, FL) in Aug 2022", "Interview Descriptions": "I feel like they are very racist and they don’t look at your qualifications but the color of your skin. Then they never follow up with you about the job you can write them and they don’t even respond back.", "Interview Questions": "What are my expectations for the job?"}, {"date": "7 Jun 2022", "title": "New Grad RN Residency Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Baptist Health South Florida (Homestead, FL) in Jun 2022", "Interview Descriptions": "I applied online, received a call 5 days later by the recruiter for a phone interview and was scheduled for a panel interview in 2 weeks with the department manager", "Interview Questions": "Client asking to see their dog"}, {"date": "13 May 2022", "title": "RN Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Baptist Health South Florida", "Interview Descriptions": "On zoom. Professional interview.  \r\nStarted on time and the interviewer asked me how my peers would describe me.questions-  Why Baptist? What clinical experience do you have?\r\nAre you flexible? \r\nWhat department are you interested in?", "Interview Questions": "Why Baptist? \r\nClinical experience during school? \r\n"}, {"date": "17 May 2022", "title": "Athletic Trainer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Baptist Health South Florida", "Interview Descriptions": "Very easygoing and understanding staff members. They genuinely care and listen to all that you have to say. Communication was consistent. They definitely are a well established company with the right goals in mind.", "Interview Questions": "When was there a time that you experienced a coworker who was negligent? What did you do to solve the issue?"}], [{"date": "27 May 2022", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Baptist Health South Florida (Boynton Beach, FL) in May 2022", "Interview Descriptions": "Conducted via Zoom, after having a phone call with recruiter. The interview was rescheduled twice on the hospital manager’s part. Asked basic questions like why you want to be a nurse, long term goals and a few clinic questions that are unit specific.", "Interview Questions": "Describe your clinical experience while in school."}, {"date": "19 Jul 2022", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Baptist Health South Florida (Miami, FL) in Apr 2022", "Interview Descriptions": "Easy, organized and collaborative . First interview was a panel, second interview was with direct supervisor and program director . HR was very responsive and prompt it didn’t take a long time to hear back", "Interview Questions": "N/A"}, {"date": "21 Feb 2022", "title": "Patient Transporter Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Baptist Health South Florida", "Interview Descriptions": "it was too fast, i felt rushed and like the person didn't want to really be doing interviews. i really wish i could have done the interview with someone else.", "Interview Questions": "why do I want to work for baptist "}, {"date": "23 Feb 2022", "title": "US TA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Baptist Health South Florida", "Interview Descriptions": "Three interviews. first you meet with manager, than with a panel, and lastly with administrators. For me it all happened in one day but it may vary. The Whole process from applying to first day is a about a month or more.", "Interview Questions": "Basic question to see if you fit in with the company’s mission statement "}, {"date": "18 Feb 2022", "title": "Patient Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Baptist Health South Florida", "Interview Descriptions": "It was a breeze and it  really gave you a feel for the job. Make sure to know how to problem solve and describe scenarios. Always be professional and it’s usually via zoom so for sure plan accordingly.", "Interview Questions": "How would you show empathy?"}, {"date": "5 Sept 2022", "title": "Certified Nursing Assistant CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Baptist Health South Florida (Miami, FL) in Feb 2022", "Interview Descriptions": "Interview first takes place with managers. Once that js completed you will have a follow up interview with peers which is called a (peer interview.) Once you are chosen HR will get in contact with you and provide you with an offer letter.", "Interview Questions": "Questions are asked about your experience and why you choose to apply for the position with the company. How did you hear about the position?"}, {"date": "16 Dec 2021", "title": "Medical Staff Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Baptist Health South Florida", "Interview Descriptions": "interview was fun, about 45 mins! very friendly people. cant wait to start with baptist health south florida. they asked about experience, pay, and travel. looking forward to my future there", "Interview Questions": "do i have experience ?"}, {"date": "25 Nov 2021", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Baptist Health South Florida", "Interview Descriptions": "Starts with screening interview with recruiter to give you a better understanding of what the job entails, followed by panel interview with the supervisor of the practice you're applying for and maybe 3 or 4 other leads.", "Interview Questions": "Usual questions like how you overcame challenges in previous jobs, what are your growth expectations in the position, etc. If you prep beforehand by researching expected interview questions for MAs you shouldn't have anything to worry about."}, {"date": "21 Dec 2021", "title": "Supervisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 4 weeks. I interviewed at Baptist Health South Florida (West Palm Beach, FL) in Nov 2021", "Interview Descriptions": "I applied online. Had a phone interview with a manager. Next day a Zoom panel interview was scheduled with a Supervisor, Director, and HR representative. Next day a meet and greet was scheduled with the same Supervisor and Director and The Medical Director. A week later I got a call from the AVP, it was a casual conversation. He informed me that I got the job the a few days later HR called with the official offer. From when I applied to when I got the offer is was about a month.", "Interview Questions": "They were all situational questions. “Tell of a a time… How did you act…. What was the outcome…. What did you learn from it….”"}, {"date": "3 Nov 2021", "title": "Pool Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Baptist Health South Florida in Nov 2021", "Interview Descriptions": "The interview was 15 minute long. It was a phone interview.   Was able to ask questions at the end. The interviewer was very nice and welcoming. The Interviewer answered my questions throughly.", "Interview Questions": "The interviewer confirmed some things like work experience on application. Asked when are you graduating and why you want to work the hospital you applied for. "}], [{"date": "8 Jan 2023", "title": "Administrative Fellowship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Baptist Health South Florida in Oct 2021", "Interview Descriptions": "Two interviews the first is phone interview and the final interview is on-site 30 minute panel interview. Mostly behavioral questions. I enjoyed the interview and the team. Everyone is super friendly. They also gave us a tour to the Johns Hopkins building.", "Interview Questions": "Tell me about an achievement you are most proud of."}, {"date": "13 Sept 2021", "title": "Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Baptist Health South Florida", "Interview Descriptions": "It was very dynamic and the people were very nice and accommodating. I felt comfortable and they were interested in knowing my background and experience.  The team seemed very cohesive and ready to take on to tasks in a fast paved environment.", "Interview Questions": "Technical questions about project managements processes "}, {"date": "25 Aug 2021", "title": "Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Baptist Health South Florida", "Interview Descriptions": "Pretty straight forward process overall - recruiter was kind, informative and great at following up throughout the process. Spoke with recruiter, hiring manager, 2nd level supervisor and then a final HR director", "Interview Questions": "How do you fit into organization's culture?"}, {"date": "13 Aug 2021", "title": "Paychometrist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Baptist Health South Florida", "Interview Descriptions": "Pretty lengthy, asked the typical what would you do in this situation, tell us about a time. Met with individuals who aerial currently in the role and then supervisors as well.", "Interview Questions": "Tell us about a time something that personally happened outside of work effect your work and what did you do to manage that and your tasks"}, {"date": "20 Sept 2021", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Baptist Health South Florida (Miami, FL) in Aug 2021", "Interview Descriptions": "My interview process went well. It was a panel interview. I was asked personal and behavioral questions. It was mostly to get to know me better. At the end I asked a lot of questions.", "Interview Questions": "Tell me a little bit about yourself"}, {"date": "30 Jun 2021", "title": "Imaging Scheduler Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Baptist Health South Florida", "Interview Descriptions": "the interview was conducted over zoom. it was a panel interview.  very thorough questions. job had great benefits, and great work hours. I was asked a series of questions.  the interview lasted around 1 hour.", "Interview Questions": "I can't remember the questions."}, {"date": "14 Jun 2021", "title": "CNE II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Baptist Health South Florida", "Interview Descriptions": "formal, professional, to the point. Quick response, panel interview common, allows for time to pass quickly. Questions were fair, about six people on panels. Leaders and peers joined panel. Overall positive experience.", "Interview Questions": "N/A"}, {"date": "30 Jun 2021", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Baptist Health South Florida in Jun 2021", "Interview Descriptions": "First interview was a phone interview and then the second one was a zoom interview.  Second interview asked two critical thinking questions, but were fairly easy in my opinion. Overall process took about a month and a half.", "Interview Questions": "What’s something you feel we should know about you?"}, {"date": "17 Feb 2023", "title": "Data Analyst Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at Baptist Health South Florida in May 2021", "Interview Descriptions": "That was a great interview experience. The manager offers many opportunities for growth. First, we mainly talked about the background and the open position. And there are some SQL questions and tests.", "Interview Questions": "SQL questions and some experience share"}, {"date": "15 Jul 2021", "title": "New Grad RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Baptist Health South Florida (Miami, FL) in May 2021", "Interview Descriptions": "It was a nice process, it was bit long but it was worth it at the end. everyone was very nice and it was easy to connect with the people interviewing.", "Interview Questions": "why did you chose baptist?"}], [{"date": "26 Apr 2021", "title": "Preschool Manager/Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Baptist Health South Florida", "Interview Descriptions": "First met with HR screener then met with District Director then met with 3 staff members  from the school that had the opening. Process took a long time. After 3 interviews and a lot of time, they didn’t bother to call or, even email to tell me that I wasn’t being offered a position.", "Interview Questions": "What is your management style?"}, {"date": "5 Apr 2021", "title": "Call Center Agent Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Baptist Health South Florida", "Interview Descriptions": "Difficult - a lot of interviews and irrelevant questions. If you pass the final interview you have to get your flu shot, take a drug test, and a health exam.", "Interview Questions": "I don’t remember honestly it was a while ago"}, {"date": "9 Mar 2021", "title": "Housekeeping Aide Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Baptist Health South Florida", "Interview Descriptions": "It was easy to get in. The work is alright if you mind your business. Cleaning can be rewarding just not something to retire in. Get in get some skills and training and then get out.", "Interview Questions": "Why do you wanna work here "}, {"date": "6 Mar 2021", "title": "Medical Dosimetrist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Baptist Health South Florida", "Interview Descriptions": "First I had an phone interview with HR; basically asking background info. Then, had a zoom interview with the supervisor of proton Dosimetry, director of Dosimetry and Chief physicist. After that because of COVID another zoom interview otherwise it would’ve been in person interview with the Physician Group, Dosimetry team, Physics team and then again with the supervisor, director, and chief.", "Interview Questions": "Where do you see yourself in five years?"}, {"date": "15 Feb 2021", "title": "Business Support Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Baptist Health South Florida", "Interview Descriptions": "After initial interview with the HR recruiter, you are contacted by the department to schedule a Panel Interview with the leadership team and fellow staff. Interviews are done virtually during COVID.", "Interview Questions": "Tell about a time that one of your coworkers was less cooperative than they should be. How did you handle the situation."}, {"date": "24 Feb 2021", "title": "Case Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Baptist Health South Florida (Miami, FL) in Feb 2021", "Interview Descriptions": "Long Process but great! Very detailed alot of questions about experiences. There is about 3 different levels of the interview process. Staff seems great and eagers to have more people join the team.", "Interview Questions": "How do you deal with multitasking?"}, {"date": "3 Mar 2022", "title": "Office Associate Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Baptist Health South Florida (Miami Lakes, FL) in Feb 2021", "Interview Descriptions": "Zoom panel interview. My role was COVID-related so they were desperate to fill the position. Simple common questions about personal and professional experience. THERE WAS NO ONBOARDING. For a job in a corporate office setting, especially in administration, it was really concerning that there was no guidance.", "Interview Questions": "Q: What's one of your weaknesses?"}, {"date": "29 Dec 2021", "title": "Pharm Technician Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Baptist Health South Florida (Miami, FL) in Feb 2021", "Interview Descriptions": "over the phone, considering it was during Covid. It was terrible but then I had an in person interview afterwards. Once again it was not terrible. I got an offer 3 hours after my in person interview", "Interview Questions": "What can you bring to the table "}, {"date": "18 Jan 2021", "title": "Registered Nurse, BSN Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Baptist Health South Florida", "Interview Descriptions": "Nobody showed up to my scheduled interview. Later I received an apology email where my name was spelled incorrectly, and an offer to reschedule. I felt this was very unprofessional.  Luckily I already had received multiple offers at another hospital so I was able to confirm that the integrity of the other hospital was superior.", "Interview Questions": "n/a the interviewer did not show up "}, {"date": "13 Jan 2021", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Baptist Health South Florida", "Interview Descriptions": "It is a Zoom Meeting Panel for three + management leaders that will take turns asking you questions.  The interview is usually 30 minutes and they will advise their departments HR person who the candidate will be.", "Interview Questions": "What are your strengths and how would be describe yourself."}], [{"date": "7 Jan 2021", "title": "Biomedical Technician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Baptist Health South Florida", "Interview Descriptions": "The interview process was simple, they asked the usual question, tell me about yourself, challenges I've faced, and how I receive criticism. Were very professional and also gave me some time to ask questions.", "Interview Questions": "How do you deal with criticism? "}, {"date": "16 Dec 2020", "title": "Customer Care Representative Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Baptist Health South Florida", "Interview Descriptions": "Group panel of about 5 employees and they asked typical interview questionss. Interview was rather quick and very brief.  The team seemed very nice and like a wonderful staff to be aorund.", "Interview Questions": "Common misconceptions about yourself in?"}, {"date": "12 Nov 2020", "title": "Discharge Planner Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Baptist Health South Florida (New York, NY)", "Interview Descriptions": "Had an impromptu  phone interview with the recruiter for the Boynton Beach hospital 3 days after applying. The recruiter seemed very friendly and informative and made the possibility of getting an offer after interviewing with the hiring manager likely and worthwhile. HOWEVER...once it got time to discuss compensation she very much low balled about $2-3 offering $23.28/hr.  I declined to move forward with an interview as their budget seems very small for an MSW with 5 years exp.", "Interview Questions": "Why are you relocating? How does your experience match this position? Compensation for this position requirements?"}, {"date": "10 Sept 2020", "title": "Financial Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Baptist Health South Florida", "Interview Descriptions": "The whole processes was lengthy but easy. They made you feel relax, however lots of scenario questions. And lots of what if and how would you handle certain situations . They give you time for questions and answer.", "Interview Questions": "How would you handle a difficult situation and what was the out come."}, {"date": "18 Nov 2020", "title": "Patient Scheduler Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Baptist Health South Florida (Miami, FL) in Sept 2020", "Interview Descriptions": "Interview process was efficient and smooth, roughly 1 month from application to job offer. HR was very helpful in breaking down different parts and aspects of your interview process. Usually a phone call from HR which is the first screening process, then a one on one or a panel interview will be conducted", "Interview Questions": "How did you make right in a difficult situation"}, {"date": "6 Aug 2020", "title": "Guest Services Concierge Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Baptist Health South Florida", "Interview Descriptions": "The interview process was straight forward with a HR representative calling to get some additional details about my experience. Once I was past that stage, due to COVID19, I had about an hour Zoom interview with the director. Most of the questions pertained to personality given the position requires a lot of customer service and multitasking.", "Interview Questions": "Some questions pertained to how I would handle situations. "}, {"date": "19 Jan 2021", "title": "Marketing Communications Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Baptist Health South Florida in Aug 2020", "Interview Descriptions": "Initial phone interview/phone screen with HR department. Zoom panel interview with hiring manager and department director. They mostly asked situational based interview questions. Followed up with HR and no response. Notified via email about 6 weeks later that I did not get the role.", "Interview Questions": "Tell me about a time when.... "}, {"date": "17 Sept 2020", "title": "Healthcare Strategy Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Baptist Health South Florida in Aug 2020", "Interview Descriptions": "Very lengthy drawn out process which included 3 separate panel interviews spread out over two and a half months. I met with various members of the team all who seem very interested in my qualifications but at the end of this process, I received a generic rejection letter. To top it off, they reposted the job a week later. I have years of experience with large healthcare firms and they were beyond doubt the least professional. Be very careful investing time into BHSF.", "Interview Questions": "Can you give you give me an example of your excel skills? Specifically what formulas do you have experience with?"}, {"date": "22 Jul 2020", "title": "Scholarship Interview Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Baptist Health South Florida (Miami, FL) in Jul 2020", "Interview Descriptions": "The application was simple, theres a packet on the website. About two weeks later i got called for the interview. It was via zoom due to coronavirus. There were three people, one man asking questions and two woman writing down notes. Very intimidating, typical job interview style questions.", "Interview Questions": "Tell us about a time a patient or customer was rude to you and how you resolved it. "}, {"date": "9 Sept 2020", "title": "Evs Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Baptist Health South Florida (Jacksonville, FL) in Jul 2020", "Interview Descriptions": "Drug test at local clinic. phone interviews, with questions that are typical at other interviews. very thorough hiring process with a video interview, 2 days of video training, and 2 weeks of following and shadowing a co-worker.", "Interview Questions": "How would you handle a difficult situation? or How have you handled a difficult situation?"}], [{"date": "4 Aug 2020", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Baptist Health South Florida (Miami, FL) in Jun 2020", "Interview Descriptions": "Applied and received a call and phone interview 2 days later. Was called for a interview the following week. Overall the interview was difficult but a good experience. A lot of scenario  questions were asked.", "Interview Questions": "Tell me about yourself?"}, {"date": "27 Oct 2020", "title": "Environmental Technician Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Baptist Health South Florida (Miami, FL) in May 2020", "Interview Descriptions": "So I got called by a recruiter for a first interview, who I will never forget because he really loved my interview and really tried to get me at baptist . I did about 5/6 interviews with baptist for this position and every interview I did not get ! They were very strict in every interview. My very last interview I was asked 1 question after the person who contacted me via zoom saw what I looked like .\n\nI knew deep down I would not be happy at baptist but I tried for the benefits . This company seems very robotic and not personable at all !", "Interview Questions": "Why should we hire you"}, {"date": "20 May 2022", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Baptist Health South Florida (Miami, FL) in Mar 2020", "Interview Descriptions": "very good experience super cool. I would recommend anybody to come here as staff are super friendly and paid well. interview process was easy and nice felt welcomed. The management is also great.", "Interview Questions": "Name a time where you left a memorable impression ?"}, {"date": "7 Feb 2020", "title": "Director Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at Baptist Health South Florida (Coral Gables, FL) in Feb 2020", "Interview Descriptions": "Step 1- HR Screening call\r\nStep 2 - In person interview with hiring manager\r\nStep 3 - Panel Interview with heads of other associated departments \r\nI just completed step 2, the time between step1 and step 2 has been 5 1/2 weeks.", "Interview Questions": "Where do you see yourself in 3 years?"}, {"date": "30 Apr 2023", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Baptist Health South Florida (Miami, FL) in Feb 2020", "Interview Descriptions": "For a position in the Case Management Department, you go through a panel 1 interview with a manager and then panel 2 is with supervisors and team leaders. The questions are situation based and they are looking for responses using the STAR method. A typical question is something like \"tell us about a time you had a disagreement with a coworker and how was the situation resolved.\" They may also go \"off script\" and ask you questions that are typical in most interviews.", "Interview Questions": "\"Tell us about a time you had a disagreement with a coworker. How did you react and how was the situation resolved.\""}, {"date": "3 Feb 2020", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Baptist Health South Florida (Miami, FL) in Jan 2020", "Interview Descriptions": "Prior being called by a recruiter a week had passed. Phone interview was on Wednesday and panel interview was on Friday of that week. Panel consisted of Nurse manager and assistant nurse manager.", "Interview Questions": "2 general questions, tell me about yourself and why Baptist? Followed by 8-10 scenario questions, nothing you wouldn’t know how to answer.  If you are a new grad they ask for situations that may have occurred in life where you had to handle a situation. The managers took turns asking questions. "}, {"date": "14 Jan 2020", "title": "Assistant Director Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Baptist Health South Florida (Jacksonville, FL) in Jan 2020", "Interview Descriptions": "Interviewer called and asked several questions about my current position as well as my interest, I provided the information that was requested of me. I am out of state so ideally the concern was my expectations on a career after I were to move", "Interview Questions": "What would be my salary range?"}, {"date": "8 Mar 2022", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Baptist Health South Florida (South Florida, FL) in Jan 2020", "Interview Descriptions": "Basic interview as with most employers, very thorough and pleasant.  No crazy questions just reviewing the resume and asking questions more personalized to the position being sought to see if you are the right fit.", "Interview Questions": "Why such a long gap in employment."}, {"date": "21 Nov 2019", "title": "Internship Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Baptist Health South Florida (Miami, FL)", "Interview Descriptions": "twenty minutes, interviewed at the campus, and one on one interview. \r\nit was pretty intense because everything was in a hurry \r\nthere are about three questions, describe teamwork, describe your hobby, then describe your other hobby", "Interview Questions": "describe teamwork that you had you like and a bad one "}, {"date": "4 Nov 2019", "title": "Patient Access Representative Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Baptist Health South Florida (Miami, FL)", "Interview Descriptions": "Interview process was long. First there was a phone interview and if you pass then you’re moved to the group panel interview which was very long but everyone was friendly.", "Interview Questions": "A lot of situational questions\r\nFor example: what would you do if "}], [{"date": "21 Dec 2019", "title": "HRIS Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at Baptist Health South Florida (Miami, FL) in Oct 2019", "Interview Descriptions": "Our students' resumes were sent to Baptist by our advisors. Baptist selected a few of us and came to our school to conduct interviews. One on one interview. Not hard", "Interview Questions": "What programming language are you comfortable with using? And what did you do with them?\r\nGo through your resume"}, {"date": "16 Jun 2023", "title": "Patient Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 6 weeks. I interviewed at Baptist Health South Florida (Miami, FL) in Sept 2019", "Interview Descriptions": "There is a phone interview which is pretty short and does ask some scenario questions, then I had a speed dating kind of panel. Where i sat a multiple tables speaking about 1-3 questions with different management.", "Interview Questions": "How did you correct an error? What was something you did to go above and beyond? How would you deal with a confrontational coworker? How would you respond to angry patient? How would you collect funds for treatment, patient is stating they have do not have funds to pay for"}, {"date": "17 Sept 2019", "title": "Director of Operations Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "The process took 6 weeks. I interviewed at Baptist Health South Florida (Doral, FL) in Aug 2019", "Interview Descriptions": "Very professional and friendly.  Was screened by HR 6-8 weeks before offer.  Had video conference with leadership team, panel with additional participants, one on one with hiring manager, another one one with CEO, and then a panel with a group of providers.", "Interview Questions": "What is your leadership philosophy?"}, {"date": "1 Jul 2019", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Baptist Health South Florida (Kendall, FL)", "Interview Descriptions": "An initial panel interview was made with a few staff members for a series of questions not specific to the profession. This was followed by another interview with the manager, educator and supervisor for a more direct and individual interview.", "Interview Questions": "Tell me about an experience where you had to adapt to a new change at work? What was it and how did you approach it?"}, {"date": "1 Jul 2019", "title": "Expeditor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Baptist Health South Florida", "Interview Descriptions": "Very professional typical interview questions. Text book interview questions can be learned and accustomed before hand. Very pleasant interview. No pressure. Really gave me an overview of how worklife would be working there.", "Interview Questions": "Why do you want to join our organization"}, {"date": "17 Feb 2023", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Baptist Health South Florida in Jun 2019", "Interview Descriptions": "3 separate and long panel interviews Questions were non related and boring They talked about themselves and could not care about asking me any real questions or having a real dialog. Job turns out totally different than. What the job description stated. More work and less pay and title with description nothing like what waspromised.", "Interview Questions": "Are you working full time?"}, {"date": "19 Nov 2020", "title": "Information Technology Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Baptist Health South Florida (West Palm Beach, FL) in Jun 2019", "Interview Descriptions": "Interview process was quick and easy. Not very difficult. But did ask a lot of questions during it. I answered All of the questions honestly and remained calm tried not to overthink", "Interview Questions": "What do you like to do "}, {"date": "15 May 2019", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Baptist Health South Florida", "Interview Descriptions": "HR called me a few weeks after applying for a phone interview. A week later they called to schedule the in-person interview. A week later was my interview. Then I didn't hear back from them for about three weeks. They called me with the job offer and I accepted it. Took another week to get cleared with my drug test and my lab results. One more week to actually start working.", "Interview Questions": "How would you handle seeing a person doing something they're not supposed to be doing?\r\nTell me about yourself?\r\nWhat are pros/cons about yourself?"}, {"date": "1 Jun 2023", "title": "Patient Experience Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Baptist Health South Florida (Miami, FL) in May 2019", "Interview Descriptions": "Received an initial call from a human resource rep and was asked some screening questions basically confirming what I listed on resume. Once confirmed they scheduled an in person interview.", "Interview Questions": "Tell me a situation that did not go your way and how did you react/respond to it."}, {"date": "24 Apr 2019", "title": "Patient Service Representative Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Baptist Health South Florida (Doral, FL) in Apr 2019", "Interview Descriptions": "Interviewed with different management staff in different sections. Then you had to wait for the next round of questions to go in . Nice people overall. Don’t deviate too much when answering questions", "Interview Questions": "What are your long term goals "}], [{"date": "14 May 2019", "title": "Donor Relations Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 5 months. I interviewed at Baptist Health South Florida (Coral Gables, FL) in Mar 2019", "Interview Descriptions": "4 interviews. 1 HR phone interview, 1 phone interview with the hiring manager, 1 panel interview with like 5 people (extremely intimidating) and final interview with an AVP. The panel was the hardest one because it's so hard to connect with 5 different people and sell yourself to 5 different people. The process took 5 months.  OH and they asked me to take 4 exams on Microsoft Office :)", "Interview Questions": "How do you deal with confidential information"}, {"date": "29 Jan 2020", "title": "Mid Level Provider Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Baptist Health South Florida (Miami, FL) in Mar 2019", "Interview Descriptions": "was interviewed by a manager that obviously just care about patient satisfaction and not my medical knowledge or experience. it was made abundantly clear during the interview that they value patient satisfaction over providing proper medical care.", "Interview Questions": "How do you respond to a patient that does not agree with your treatment plan?"}, {"date": "21 Aug 2021", "title": "Receptionist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Baptist Health South Florida (Miami, FL) in Feb 2019", "Interview Descriptions": "Computer guided questions, that seem designed to set you off or make you upset. IF you make it past the first \"interview\" you will get to the actual interview with another person. If that goes well there is another interview...", "Interview Questions": "why did you leave your last job...\nwhy didnt' you like your boss"}, {"date": "17 Jan 2019", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "The process took 4 weeks. I interviewed at Baptist Health South Florida", "Interview Descriptions": "Panel interview with behavioral like question they want to get to know you as a person so just be honest and study the company, have answers and be honest. Overall pretty easy experience", "Interview Questions": "Describe a time you did something above and beyond for your patient "}, {"date": "16 Jan 2019", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Baptist Health South Florida in Jan 2019", "Interview Descriptions": "Uncomplicated. Very professional. Straight and to the point. Interviewers were nice and made you feel comfortable. The interview was less than 30 mins. The phone call was received at the end of the week, and an offer was accepted. They were very reasonable.", "Interview Questions": "Name a difficult situation at work you experienced. "}, {"date": "20 Jan 2020", "title": "Pharmacy Resident Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Baptist Health South Florida (Kendall, FL) in Jan 2019", "Interview Descriptions": "You need to apply through phORCAS, submit 3 Letter of Recommendations, Letter of Intent, a Transcript and your CV. Requires a preliminary phone interview, and then an on-site interview..It is a very strighfowrd process once you follow instructions and read.", "Interview Questions": "What are your areas of interest?"}, {"date": "4 Jun 2023", "title": "Radiology Technologist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Baptist Health South Florida (Miami Gardens, FL) in Jan 2019", "Interview Descriptions": "Three total panel interviews that felt more like a Psych evaluation that an evaluation of abilities. Never contacted me on any of them to report whether I had been accepted or rejected...not a word. Interviewers were definitely not from the Imaging field I was interviewing for - and had no knowledgeable pertinent questions about the job. If you are a Caucasian male over 40 without Spanish speaking skills, don't waste your time. They make no attempt to hide that you must be Hispanic and bilingual to even be considered.", "Interview Questions": "What is your worst workplace attribute? ...a totally inane question that always gets the same stupid answer....\"I'm detail oriented to a fault\"."}, {"date": "11 Nov 2018", "title": "RN Supervisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Baptist Health South Florida", "Interview Descriptions": "I had a total of 5 interviews. A phone interview, 2 panel interviews, and 2 meet and greets where I met the staff and they asked me formal interview questions. Before my panel interview, I was given a leadership scenario and asked to prepare a 15 minute presentation.", "Interview Questions": "Tell me about a time that you had to juggle different assignments and how you handled it"}, {"date": "16 Sept 2018", "title": "Radiologic Technologist Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 3 weeks. I interviewed at Baptist Health South Florida", "Interview Descriptions": "Straightforward and simple. The recruiter called me for a computer literacy testing which I didn't fully pass. I was called 2 weeks later by another recruiter who was following up on the process. I was then asked to come in for the second time and an informal interview took place with the recruiter and the hiring supervisor;  I was offered a position the same day.", "Interview Questions": "Why are you interested in working for Baptist Health?"}, {"date": "7 Aug 2018", "title": "Patient Financial Representative Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Baptist Health South Florida", "Interview Descriptions": "Time frame from interview to hire. A month to a month and half.  Just answer the question, don't have a lengthy answer.  Stay on topic. Look the part.", "Interview Questions": "How did you go up and beyond to help a customer?  Were they satisfied? Have you ever disagreed with your manager? The outcome of the diagreenent? Why are you leaving your current job?"}], [{"date": "8 Aug 2018", "title": "Surgical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 5 weeks. I interviewed at Baptist Health South Florida (Miami, FL)", "Interview Descriptions": "The hiring process upon acceptance is good and expedite; the questions are the expected for the position and people were kind and friendly. They let you know the clothes protocol and they are punctual and you know if hire some minutes after finishing the interview", "Interview Questions": "Your weakness and strenghs "}, {"date": "1 Aug 2018", "title": "International Marketing & Communications Specialist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 3 months. I interviewed at Baptist Health South Florida", "Interview Descriptions": "The interview was very interactive. The people were great. I had a very nice time when I went in to interview. They all had great questions and I was able to meet almost everyone on the team. All of the team members were very nice. The interview process was pretty long.", "Interview Questions": "Do you think you're overqualified?"}, {"date": "2 Jul 2018", "title": "Patient Experience Advisor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Baptist Health South Florida", "Interview Descriptions": "Panel interview with one superior and three potential colleagues. Conversational, getting to know you atmosphere and then a few questions on experiences and situations and how you handled them. Fairly relaxed comfortable setting.", "Interview Questions": "Describe a time something went wrong and how you responded to the situation"}, {"date": "10 Jun 2018", "title": "Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Baptist Health South Florida", "Interview Descriptions": "I individual interviews and in recent years, panel interviews are also a part of the process. It takes a while to get into Baptist Health and many interviews along the way. But consider yourself lucky if you go through the interview process. Many have tried for years but have failed to get that far.", "Interview Questions": "What skills do you have that separate you from other qualified applicants?"}, {"date": "3 Mar 2022", "title": "Security Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Baptist Health South Florida (Miami, FL) in May 2018", "Interview Descriptions": "The interview process was lengthy but streamlined. Phone call, peer interview and then an interview with management. There were people who were hired without having any previous experience but management has changed hands since 2018.", "Interview Questions": "STAR questions mostly. What would you do if..."}, {"date": "2 Apr 2018", "title": "Physician Claims Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Baptist Health South Florida in Mar 2018", "Interview Descriptions": "Great recruiting team! Help me along the way made me feel very confidence.  The interviewing supervisor was very friendly and made me feel at ease during the interview. The panel was great, all very nice people.", "Interview Questions": "If I found out an error that I did before anyone else found out, what did I do?"}, {"date": "4 Feb 2020", "title": "Senior Contract Administrator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Baptist Health South Florida (Miami, FL) in Feb 2018", "Interview Descriptions": "First a phone screen, and then an 8 panel interview. The panel had directors, Sr. Administrators and Buyers. Lots of situational questions to explain you past experiences. Focus on the management aspect of the job.", "Interview Questions": "Describe a difficult Situation with  a customer?"}, {"date": "31 Dec 2017", "title": "ITRRT Support Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Baptist Health South Florida (Miami, FL)", "Interview Descriptions": "I was invited to take a phone interview after applying online for this position.  I researched the company values and mission statement and expressed my enthusiasm for learning more with the recruiter, but I believe she wasn't interested in hearing it. I ultimately  feel like every other word went in one ear and right out the other. At the end of the interview she mentioned very rudely, \"You will hear a response either by phone or email\", and abruptly hung up on me. About two weeks later I received a general non-selection email. Very negative experience with an unprofessional recruiter; I will not be wasting my time to apply to this company again.", "Interview Questions": "Describe a time you had to collaborate with others to solve an issue."}, {"date": "13 Oct 2017", "title": "Digital Marketing Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Baptist Health South Florida", "Interview Descriptions": "To begin the woman who interviewed me, Karen, seemed annoyed that she had to speak to me. This threw me off completely, I had never had an interaction with her before, other than confirming the phone interview from today on Wednesday afternoon. I let that go and tried to be myself, a generally upbeat person. Then she went through my experience, she didn’t have all of it, so I mentioned that there was more to my resume, in the nicest way I could muster, since all of her questions and her flippant attitude seemed unnecessarily accusatory and critical. She mentioned that I should go back and fill it in, hostility palpable in her voice. She opened my resume PDF, it only took her one click, and saw all of my experience. Six-years-worth for this particular position, she was still accusatory, but then the hostility reached a fever pitch, she saw that I still have a year and a few months to finish my degree, I took a break to have my son a few years ago. She became extremely derogatory, her commentary borderline insulting. I had to stop her and tell her that I was not interested in continuing the interview process with her company. Wished her luck on her search and hung up. She told me, “I would have to see if the people in the Marketing department would be comfortable working with someone like you. With no degree.” I am sorry, but they are clearly not vetting the people who are in the HR department at Baptist, which I assumed was a reputable company. I was mistaken as it turns out. Someone who has been in an industry for close to 7 years at this point, but not quite, is a professional and as such the treatment I received was as if I were uneducated, trash, who didn’t deserve a second of this person’s time. This was the worst interview I’ve ever been subjected to, from beginning to end. Although she was punctual.", "Interview Questions": "Do you have family members who work with Baptist Health?"}, {"date": "17 Aug 2017", "title": "File Clerk Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Baptist Health South Florida (Miami, FL)", "Interview Descriptions": "Long, but easy process. Was given a call to schedule an interview. Looking for parking and for the place was not easy. There were a lot of people there to interview; the waiting room was full. Was first given a typing test, which was really easy. You are given a second chance if you do not score well. Then return to the waiting room and wait to be called for the actual interview. The interviewer was very nice and pleasant. I felt comfortable and confident throughout the interview. She provides you with an estimated salary at the end. Received a call about 2 weeks later for a second interview.", "Interview Questions": "Describe a weakness?"}], [{"date": "16 Aug 2021", "title": "Cardiovascular Lab Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Baptist Health South Florida (Miami, FL) in Aug 2017", "Interview Descriptions": "Spoke to HR about possible open entry-level positions and was referred to cardiovascular lab for interview. Interview process involved walking through the hospital, accepting terms of employment and small interview with head of lab.", "Interview Questions": "Why do you want to work here?"}, {"date": "9 Jun 2017", "title": "Center for Research & Grants Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Baptist Health South Florida (Miami, FL)", "Interview Descriptions": "There were three interviews - first with the director, then the staff (these may have been the same day, I don't remember) and then with the hiring manager.  It was a little confusing - seemed like the hiring manager interview should have been first - it was very general and easy, but the job offer was made at the end of that interview.", "Interview Questions": "Why should we hire you instead of someone with more experience?"}, {"date": "31 May 2017", "title": "Talent Acquisition Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Baptist Health South Florida in May 2017", "Interview Descriptions": "Received email to set up a time to have a phone interview. Responded with mutually agreed upon time. The Director called me 30 minutes late and we rescheduled for the afternoon. I had to reschedule for the next working day. Had confirmation email from Director for the following morning at 8:30a.m. never received a phone call. I emailed to follow up to see what happened and have not heard back yet 5 weeks later. As a Director myself I find it interesting there was no follow up whatsoever. If Baptist is supposed to be so great this is sad.", "Interview Questions": "N/A"}, {"date": "11 May 2017", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at Baptist Health South Florida (Miami, FL) in May 2017", "Interview Descriptions": "Phone interview then a panel interview. At the panel interview, the manager asked the first question and as I answered he started looking at his nails as if he didn't care what I was about to say. Very rude.", "Interview Questions": "Describe a time you had to deliver negative news to a patient."}, {"date": "18 Feb 2017", "title": "Property Management Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Baptist Health South Florida (Miami, FL)", "Interview Descriptions": "There is 3 separate interviews. First with HR, then with the head of the dept then a conference style interview with the dept employees. All the interviews were pretty standard except the final one. I felt  nervous bc I was in a room with about 7 employees asking me questions while sitting at the head of the conference table.", "Interview Questions": "If someone in the office told you to keep a secret how would you handle it?"}, {"date": "27 Feb 2017", "title": "Medical Office Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Baptist Health South Florida (Miami, FL) in Jan 2017", "Interview Descriptions": "3 interviews, and after all that they sit and pick a person. Which was one that was working there already. So Why make me do all that??? If they know that they had a person all along. They could at least filled the other person's job because anyway they would need it filled.", "Interview Questions": "Why did you leave your last job?"}, {"date": "28 Dec 2016", "title": "Advisor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Baptist Health South Florida (New York, NY)", "Interview Descriptions": "General situational questions to see how well you've dealt with prior situations with customers and coworkers. For example, they asked to tell about a time you had a disagreement with a coworker and how it was settled.", "Interview Questions": "Tell me about a time you went above and beyond to satisfy a customer."}, {"date": "22 Nov 2016", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. I interviewed at Baptist Health South Florida (Miami, FL)", "Interview Descriptions": "Long, but intense. The group interviews can be very nerve recking. Although, if you focus on safety, following protocol, and teamwork you'll be fine.There are a few basic interview questions and then there are several situation based questions. Make sure you are yourself, smile, be eager to learn and work well with others. Baptist is big on everyone working together as a whole.", "Interview Questions": "Name a time when you did made a decision without speaking to management, what was the end result and what was the reason you made this decision knowing that it could be against protocol."}, {"date": "29 Oct 2016", "title": "BOS Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Baptist Health South Florida (Miami, FL) in Oct 2016", "Interview Descriptions": "Within a few days of applying for the position, I was contacted to participate in a phone interview. That interview was pleasent. The HR rep was very nice and very open about the position and what the department was looking for. Within the next week, I was then contacted to come in for a panel interview. I think this was probably the best interview I've been on. The panel was extremely open and easygoing. No pressure at all. I wish all interviews are the Baptist way.", "Interview Questions": "Situational questions based on previous work experience."}, {"date": "1 Oct 2016", "title": "Human Relations Consultant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Baptist Health South Florida", "Interview Descriptions": "After an initial phone screen, I progressed to a panel interview process. There was a good mix of questions covering experience and interest in the role and organization. The interview panel were engaged and used a balanced approach.", "Interview Questions": "Behavioral-based/situational-based examples of handling challenges using past experiences."}], [{"date": "30 Jul 2016", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Baptist Health South Florida (Miami, FL) in Jul 2016", "Interview Descriptions": "Applied and was called within a week, 2 interviews, one over the phone and one onsite with leadership and then with a panel of nurses. The process was smoth and everyone was very nice to me, including the recruiter. \r\n\r\nThey are all so proud of their hospital and welcome you right away to the \"family\" that you start feeling the need to be part of it almost from the begining.", "Interview Questions": "Name one situation in which you did something that was not expected from you. What was the outcome?"}, {"date": "9 Oct 2020", "title": "Fundraiser Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Baptist Health South Florida (Miami, FL) in Jun 2016", "Interview Descriptions": "The interview process was impersonal, the online application very cumbersome, three people called to set up the interview, the logistics to set up the interview took several weeks which made the entire process longer than average and a bit confusing.  The Human Resources personnel was professional but there was no follow up as originally promised. I you know you are qualified for the position I would suggest trying to contact someone internally as their per-screening seemed very generic.", "Interview Questions": "previous total contributions per year"}, {"date": "30 Apr 2016", "title": "Patient Scheduler Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Baptist Health South Florida (Miami, FL)", "Interview Descriptions": "Applied online two days later they called for an interview. The interview was a panel (3 people ) and they just asked behavioral questions. Two day passed and got a call that I had gotten it. I did my physical test and was hired within two weeks.", "Interview Questions": "Give an example of good customer service that YOU received ?"}, {"date": "7 May 2016", "title": "Corporate Charge Review Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Baptist Health South Florida (Miami, FL)", "Interview Descriptions": "I was recommended by a fellow worker from Blue Cross Blue Shield. I had a telephonic interview with the Utilization Review Manager who asked many questions on my experience history. The interview lasted approximately 40 minutes and I was hired the same day.He then scheduled a meeting for us to meet personally. It was a very professional interview.", "Interview Questions": "How many years of clinical experience do you have? Tell me about your experience as a Denials/Appeals Nurse, What exactly do you do as a Clinical Documentation Specialist?"}, {"date": "31 Mar 2016", "title": "Patient Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Baptist Health South Florida", "Interview Descriptions": "Panel interview ranging from 3-5 interviewers. Depending on the position, several interviews may be required. Generally warm and welcoming. Persons are called and scheduled ahead of time; flexible. Interviews take place at various locations depending on the position.", "Interview Questions": "Describe a time where you worked with someone else and their work style was different than yours. What did you do to ensure tasks were completed?"}, {"date": "10 Aug 2017", "title": "Student Nurse Scholar Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Baptist Health South Florida (Miami, FL) in Mar 2016", "Interview Descriptions": "The interview process was difficult but thurough. They asked a lot of situational questions to reveal your personality and to get to know your personality. May seem scary but just be professional", "Interview Questions": "What is your biggest weakness?"}, {"date": "24 Jan 2016", "title": "Patient Financial Representative Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Baptist Health South Florida (Miami, FL) in Jan 2016", "Interview Descriptions": "I applied online and took two assessment test. A week after I applied online I received a call to setup a phone interview for the following week. The day of the phone interview I got a call to reschedule the interview for the following week, again the day of the interview I got a call to reschedule the interview this went on for 4 weeks. After finally speaking to the recruiter I was setup for a face to face interview where I took a filing and typing test before meeting with a recruiter. While meeting with the recruiter she asked me several times if I knew anyone who worked at baptist and asked about jobs I never applied for. After the interview with the recruiter I recieved a call about 3 weeks later to setup a panel interview for the following week. The recruiter told me the position was a full time position at a certain location and it was for a patient financial representative. When I got to the interview the first thing the panel asked was if I knew anyone who worked at baptist. The panel then started interviewing me for a different job that was part time in a different location. I was very confused and annoyed. I later recieved four emails,one stating they were not interested the other three stating they want to offer me a job. They are very unorganized.", "Interview Questions": "Do you know anyone who works at baptist? "}, {"date": "28 Sept 2017", "title": "Staff Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Baptist Health South Florida (Miami, FL) in Jan 2016", "Interview Descriptions": "Interviewed at Baptist Doctor's Hospital- the manager was intimidating, made me second guess all my answers, I had experience with the patient population too and would have been confident providing care on the floor. Did not feel comfortable at all. Subsequently interviewed for a position at Baptist Main Hospital - very different experience. Manager and assistant manager were very personable, I could answer questions without feeling of judgment. Was hired to this position.", "Interview Questions": "What would your coworkers say about you? What is your experience as a nurse? More stuff that I can't remember. Nothing out of the ordinary. Maybe a scenario. "}, {"date": "25 Jan 2020", "title": "Concierge Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Baptist Health South Florida (Miami, FL) in Jan 2016", "Interview Descriptions": "Interview process usually consist of 2-3  separate interviews consisting of: interview with HR rep, Supervisor, and interview panel. Takes around 2 weeks to get a response or offer.", "Interview Questions": "Tell me about a time you had a difficult situation with a customer and or employee and how did you solve it? "}, {"date": "14 Dec 2016", "title": "HIM Prepper Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Baptist Health South Florida (Miami, FL) in Jan 2016", "Interview Descriptions": "Standard interview and just with the Supervisor and Manager of the Department. Did an initial interview with an HR Representative prior. Asked a couple of questions that were basic and focused on clerical work and productivity.", "Interview Questions": "If i'm comfortable working in a high productive environment?"}], [{"date": "8 Feb 2016", "title": "Versant Program Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Baptist Health South Florida (Miami, FL) in Dec 2015", "Interview Descriptions": "I had 3 interviews one over the phone second with a recruited person and third a panel interview. Everybody were extremely professional, but the whole process took about 3 months without any luck. I called several times to know who the process were going and nobody gave me a clue. \r\nFinally after waiting for such a long time and refusing several offers -because I thought that the interview were extremely good and I thought that the job was mine. I got an email saying that I didn't. \r\nOh well .", "Interview Questions": "Why you want to work in this company. \r\nHow did you see yourself in 5 years \r\nTell me about yourself"}, {"date": "8 Jan 2016", "title": "Patient Access Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Baptist Health South Florida (Birmingham, AL) in Nov 2015", "Interview Descriptions": "Applied online, took assessment, it took a little time as it was the end of the year and company was very busy taking care of year end numbers. I the had a face to face interview and it was not difficult at all. I  was hired at least 3 weeks after.", "Interview Questions": "Will i be willing to be flexible with schedule\r\nWas i a team player \r\nIf i ever had conflict on the job and how i handled it\r\nWhat type of experience did i have in customer service"}, {"date": "27 Oct 2015", "title": "Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Baptist Health South Florida (Miami, FL)", "Interview Descriptions": "I had 2 phone interviews; one was preliminary that lasted about 15 minutes, the other was more of an in-depth screening that took about 45 minutes.  I then had panel interviews that ranged from site-level teams, peers, and the executive team.  A case study was also required before meeting with the executive group.  The entire process took about 2 months.", "Interview Questions": "Tell us about a time when you had to make a decision that benefited the team more than it benefitted you."}, {"date": "30 Sept 2015", "title": "Patient Financial Representative Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Baptist Health South Florida", "Interview Descriptions": "I applied online and one week later I received a call from one of the recruiters asking me to come in for a filing/typing test and a preliminary interview. The interview was very straight forward. The recruiter asked me about myself, went over the core roles of the job and then asked me standard situational interview questions.\r\nThe hardest part of the whole process was actually getting the interview. The amount of cronyism at Baptist is ridiculous. If you don't have a friend or family member that works at Baptist, getting a face to face with a recruiter is next to impossible. smh", "Interview Questions": "What are your strengths/weakness. Situational questions."}, {"date": "26 Sept 2015", "title": "Critical Care RN Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Baptist Health South Florida (Miami, FL)", "Interview Descriptions": "In depth one on one and group interviews. So HR and your hiring manager will both interview you. Then there is a group interview which is tedious to say the least. That after a psychiatric profile exam, IQ test and an extensive background check.", "Interview Questions": "Ridiculous hypothetical questions about conflict management by HR. The group questions are mostly related to patient care in crisis situations."}, {"date": "23 Jan 2016", "title": "IT Administrator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Baptist Health South Florida (Miami, FL) in Oct 2015", "Interview Descriptions": "Very lengthy and details for the 1st; then a delay of 30+ days: they don`t seem professional and use a clumsy video sw instead of Skype.\r\nThe DB was not properly installed and they experienced a lot of performance issues, that they mis-diagnosed to the application.", "Interview Questions": "Basic questions: Performance for Weblogic, load balancers, Tuxedo and DBs"}, {"date": "29 Aug 2015", "title": "Business Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Baptist Health South Florida", "Interview Descriptions": "Began with a phone screening, followed by a 1:1 interview in person with hiring manager. Final step was panel interview with 3 future co-workers. Not overly difficult. I found all those I interacted with to be very friendly.", "Interview Questions": "Walk me through your resume"}, {"date": "12 Oct 2015", "title": "EHR Educator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Baptist Health South Florida (Coral Gables, FL) in Sept 2015", "Interview Descriptions": "I applied on the company website for two of these positions and received rejection emails shortly after. 3-4 months later I saw that the position was posted again so I applied online once more. I received phone call from a recruiter 2 months later to ask basic questions about my availability and whether I was still on the market. A few hours later on the same day I received a second phone call from IT team member to do a preliminary screening over the phone.\r\n\r\nI was told to schedule an in person interview a week later with the rest of the IT department. The interview was in a room with a group of 5 people including the director of IT, training team members, and other project managers. They went around the room to describe their different roles in the company and I was last to go to present myself. After explaining my job history, they each proceeded with reading questions off of a paper. Apparently the questions are required by the HR department. Most of the questions had nothing to do with the actual position in which you are applying. They are mainly situational questions, possibly to judge your character as a person. After each of my responses the team members jotted down notes or asked questions for further clarification.\r\n\r\nOverall I thought the interview went well....but I got a rejection email a couple of days later. Stating something to the effect of \"Although you bring an enormous amount of experience...we have decided to go with another candidate. Please stay in touch for future opportunities\". Big waste of time, and to top it off I received that wonderful email on my birthday. \r\n\r\nGood Luck", "Interview Questions": "Describe a situation where you saw a coworker doing something wrong at work. How did you handle this situation?"}, {"date": "7 Feb 2018", "title": "Patient Transporter Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 3 weeks. I interviewed at Baptist Health South Florida (Miami, FL) in Sept 2015", "Interview Descriptions": "I was interviewed by human resources first and then transfered over to the department where i was interviewed by the leading supervisor and peers, after brief questions I was told to wait outside to meet the manager of the department and after meeting the manager i was offered the job", "Interview Questions": "Am I able to work in a fast paces environment? "}, {"date": "23 Sept 2015", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Baptist Health South Florida (Miami, FL) in Sept 2015", "Interview Descriptions": "Got a call from the Human Resource 2 days after I applied online, she asked a couple of questions and scheduled me for an interview the following day. I took the typing test before having one-on-one interview with the Recruiter. Then followed another interview with the Hiring Manager and one of her colleagues on the same day. Almost all their questions are like give situations and what I did during those times. I was asked to come back for the final interview, same situational questions.Overall, it was a pleasant experience.", "Interview Questions": "What motivates you?"}], [{"date": "10 Aug 2015", "title": "Social Worker Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Baptist Health South Florida", "Interview Descriptions": "I applied online and was called for a telephone interview within a week. Had a face to face interview with management a week later, then a peer interview a week after that. Telephone and Peer interviews were pleasant. They were friendly and professional. Management interview was cold, The managers did not seem interested in being there.\r\nAfter third and final interview, I never got a response from them. two weeks later i reached out to the recruiter and i was informed i was not selected for the position. Never got a phone call or letter. I had to call to find out.", "Interview Questions": "what would you do ...?"}, {"date": "3 Sept 2015", "title": "Social Worker PRN Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Baptist Health South Florida (Miami, FL) in Jul 2015", "Interview Descriptions": "There were two separate interviews - one was with a panel of three supervisors, which included two MSW's and an RN and the second interview was two MSW's. The questions pertained to behavioral scenarios and about myself - no questions pertained to theorietical knowledge.  The questions themselves were not difficult, but the panel of judges made the interview more stressful than I had anticipated.", "Interview Questions": "Discuss a time when you did something wrong? What was the scenario, and how did you fix it?\r\nWhat changes did you suggest to employers and what was the outcome?\r\nHow would your pervious employers describe you?"}, {"date": "6 Jul 2015", "title": "Certified Medical Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2+ months. I interviewed at Baptist Health South Florida in Jul 2015", "Interview Descriptions": "Apply for multiple positions on line. Was called for a phone interview, follow by an interview by HR, Was interview at 2 different locations by the Office managers, then had a panel interview\nNow back to the waiting game \"if your elected\"", "Interview Questions": "What would you do if this? What would you do if that? \nAckward panel interview. 5 people on a round table just starring at you asking the same questions that the office manager asked on the one on one interview. \npersonally I felt like it was a waste of my time."}, {"date": "13 Apr 2017", "title": "Unit Clerk Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Baptist Health South Florida (Miami, FL) in Jul 2015", "Interview Descriptions": "About four interviews depending on the position one has applied for, questions are formal asked about past experiences, very friendly staff, interested in what one has got to offer for them to join the team", "Interview Questions": "How would you treat an agitated family member?"}, {"date": "3 Nov 2016", "title": "Executive Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Baptist Health South Florida (Miami, FL) in Apr 2015", "Interview Descriptions": "Interview was extensive.  Had to meet with many people.  It's probably easier to interview for the Whitehouse! Had to go through a panel interview.  Panel consisted of 6 people all taking turns asking the \"tell me about a time...\" questions.  Did not ask much about my actual experience or current duties/responsibilities.", "Interview Questions": "Mostly \"tell us about a time...\" type of questions.    "}, {"date": "2 Aug 2015", "title": "Donor Relations Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Baptist Health South Florida (Miami, FL) in Mar 2015", "Interview Descriptions": "Human Resources will interview you on the phone. They ask specific skill related questions.\r\nIf you make this cut, you will proceed to a panel in-person interview with the department. You will meet the in charge boss briefly. If you are a contender you will be asked back to speak more directly with the leadership team.", "Interview Questions": "What are some of the most challenges that you have had in the workplace?\r\nWhat are your plans in the next five years?"}, {"date": "22 Jun 2016", "title": "Patient Care Supervisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Baptist Health South Florida (Homestead, FL) in Mar 2015", "Interview Descriptions": "Panel interview that seemingly already decided.  I was told that I was sitting in correctly.  I answered all of the questions honestly and the way a good supervisor should answer.  Gave appropriate answers to difficulty questions.", "Interview Questions": "What would you do if presented with this type of situation."}, {"date": "14 Jan 2015", "title": "Human Resources Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. I interviewed at Baptist Health South Florida", "Interview Descriptions": "In depth process includes hiring manage and panel interviews.  Overall interaction was professional and positive.  The interviews started close to the schedule time and the hiring manager dedicated time to me.  All employees I met in the process were courteous and took the time to answer questions.  A very comfortable process overall.", "Interview Questions": "Asked a lot of questions about how I had handled situations in previous jobs."}, {"date": "27 Apr 2016", "title": "Audio Producer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 4 months. I interviewed at Baptist Health South Florida (Miami, FL) in Jan 2015", "Interview Descriptions": "I transferred from one department to another, so an internal transfer \"interview\" is not as in depth as an initial interview for a position.  There was a panel of about 5 high ranking individuals who I presumed would make the desicion.", "Interview Questions": "What do you do here?  Please explain how you help to organization. Etc"}, {"date": "3 Dec 2014", "title": "Clerical Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Baptist Health South Florida", "Interview Descriptions": "The process was easy. Applied online. Was  contacted via phone a couple of weeks later. Came in for initial interview. Was called for second interview a week later. I declined the second interview offer due to another job offer.", "Interview Questions": "What were your responsibilities in previous job?"}], [{"date": "12 Oct 2014", "title": "Administrative Assistant III Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Baptist Health South Florida", "Interview Descriptions": "long process.... need to be patience! I applies in June, got a phone interview ten days after, then skills test and I waited for one month or so for a panel phone interviews, then a face to face panel interview. after I left the panel I received a call from HR for another HR Interview, Got the job offer and then it took about 3 weeks for background check and physical test.", "Interview Questions": "Behavior questions.... Describe situations... Be specific."}, {"date": "14 Oct 2014", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Baptist Health South Florida", "Interview Descriptions": "I had one phone call, went in for an interview and received a job offer that same afternoon. They were very personable, easy to talk to. The entire process did not take long at all", "Interview Questions": "I did not find the questions difficult at all"}, {"date": "8 Oct 2014", "title": "Administrative/Clerical Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Baptist Health South Florida", "Interview Descriptions": "Two interviews. Neither one asked about my ability to do the job. Didn't receive a follow up after second interview and HR ignored my email asking for an update. Very unprofessional.", "Interview Questions": "Describe a time that you had to deal with an angry customer."}, {"date": "23 Sept 2014", "title": "Clinical Partner Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Baptist Health South Florida", "Interview Descriptions": "First you apply online and they send you emails. Then, it takes about 3 or more weeks to get back to you and they do a phone interview. After that you wait another 2 weeks to get a 1 on 1 interview and maybe a panel in the next few days. After that... its more waiting.", "Interview Questions": "their questions aren't hard they just ask a lot of situational questions. "}, {"date": "12 Sept 2014", "title": "Senior Systems Engineer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. The process took 1+ week. I interviewed at Baptist Health South Florida (Miami, FL)", "Interview Descriptions": "I was contacted by HR after applying directly with Baptist.\r\nFirst I spoke to HR, then a second call with HR for a technical test.\r\n\r\nPersonally I really did not like the way this was handled. Being a hiring manager myself, its so important to get to know the person in person.\r\n\r\nHR asked me 10 technical questions. EXTREMELY specific to one brand of technology software.\r\nI have been in IT for 15 years. I have passed the most extreme interviews with major tech companies sitting in front of a board of 5 top tier engineers and passed with flying colors. I have never been given a technical exam by an HR person that has no idea what they are asking.\r\n\r\nA day after my technical screening I got an email saying they are perusing someone that matches their job description more closely.\r\n\r\nThe technical screening did not cover 80% of the technology in the job description. The HR person couldn't even note my answers correctly. Frustrating.\r\n\r\nIts like hiring an engineer to design and build a car and asking what time of metal Goodyear uses in its tires.\r\n\r\nI was very interested in working for Baptist. Their loss.", "Interview Questions": "The entire process was not expected"}, {"date": "19 Sept 2014", "title": "Imaging Clerk IV Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Baptist Health South Florida (South Miami, FL) in Aug 2014", "Interview Descriptions": "Applied at Baptist so many times and always receive a reject letter. I was  finally contact by a recuiter. Who was great had a great personality.  We did a phone interview and then she called me back and scheduled face to face interview.  I was then interview by the radiologist department by two individuals.  Which went great. Two days later I waa called in for a peer interview.  The peer interview didnt go so well as I wanted it too. The group that interview me didnt seem interested. But I just keep on going with it. Few days later got in contact with the recuiter to see thw status of the position, but it was unsuccessful I couldn't reach her neither by phone or email. I left voice message and never received a call back nor an email back. So I just took it as I didn't get the position.  A month and a half later I received an email stating I wasn't selected.", "Interview Questions": "if you see your coworker doing something there not suppose to be doing what would you do?"}, {"date": "10 Jul 2014", "title": "Compliance Auditor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at Baptist Health South Florida", "Interview Descriptions": "very structured process, mostly revolve around behavioral questions, they give you a scenerio of a time you did XXX and then you need to defend your position.  I also received a written exam to assess my writing skills since the nature of my position entails heavy report writing.", "Interview Questions": "none, they were all pretty solid beahvioral and situational questions"}, {"date": "29 May 2014", "title": "HIM Scanner Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Baptist Health South Florida (Miami, FL)", "Interview Descriptions": "Long interview process, may take weeks. First go through phone screening, then you complete a filing/typing test, have to get through HR first who asks some common and easy interview questions including behavioral-situation questions, then panel interviews where you get marked to whether you make it to the next round of interviews or not.", "Interview Questions": "Common interview questions, for example- Tell us about yourself and your work experience"}, {"date": "29 May 2014", "title": "Patient Financial Representative Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Baptist Health South Florida in May 2014", "Interview Descriptions": "several interviews. one panel interview with 8 people  long process. I Was called to interview for other positions I did not apply for. still waiting on status it has been 3 weeks. But there is no way for me to know the status of the positions I did not apply for since they are not on the my jobs page online. seemed a little not organized. Interviews were in different places every time.", "Interview Questions": "Describe a moment when what you did to accomplish something did not give the results expected . How did you handle it?"}, {"date": "11 May 2015", "title": "Administrative Assistant II Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 8 months. I interviewed at Baptist Health South Florida in Apr 2014", "Interview Descriptions": "Dealing with some of the unprofessionalism has been quite frustrating. This was the second time after completing the face to face interview I was told that I would be having another interview with a Manager. I heard nothing and when you try to follow up with HR, they do not get back to you. During the interview, I was asked the basics and then a whole bunch of behavioral/situational questions including what does customer service mean to you and about professionalism which is sad when they do a horrible job displaying just that. I have all in all been left with a bitter taste of a company with such a high reputation.", "Interview Questions": "Tell me about yourself"}], [{"date": "1 Mar 2014", "title": "Secretary Pool Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Baptist Health South Florida (Sunset, FL)", "Interview Descriptions": "applied online, had to sit for office, excel, typing, and filing exams. Then sat with recruiter who looked over my resume said they would call me if they needed me to fill a spot. 2 days later i got the famous rejection email?", "Interview Questions": "N/A"}, {"date": "7 Feb 2014", "title": "Sleep Technologist Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Baptist Health South Florida", "Interview Descriptions": "Very detailed process. The panel interview process for a promotion is very extensive but not unpleasant.", "Interview Questions": "Have you ever failed in an endeavor ?"}, {"date": "8 Feb 2015", "title": "Patient Transporter Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 days. I interviewed at Baptist Health South Florida (Miami, FL) in Nov 2013", "Interview Descriptions": "The interview process for me was a great experience, I felt very confident and every person that interviewed me was very positive and welcoming. I never felt stressed or nervous because of how great Vanessa from Human Resources conducted the interview.", "Interview Questions": "Have you ever worked or volunteered in a hospital?"}, {"date": "21 May 2014", "title": "Administrative Assistant Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Baptist Health South Florida (Miami, FL) in Jul 2013", "Interview Descriptions": "Very long hiring and interview process. Questions on interview are generic. Recruiters are at times confusing with description and information they provide to prospect employee. Too many interviews. Too many people interviewing prospect. Location of interviews vary and sometimes at the hospital and no direction on where to go is given.", "Interview Questions": "Because you have a degree in a different field, how do you plan on using that skill for this position you are applying for."}, {"date": "18 May 2013", "title": "Patient Financial Representative Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Baptist Health South Florida", "Interview Descriptions": "Getting your application on an actual recruiter's desk, is by far the hardest part of the hiring process at Baptist Health of South Florida. If you do not have ties with someone who already works there or know someone in the HR dept., getting a recruiter to take your application into consideration is, almost impossible.  My best advice to qualified candidates waiting for an HR  recruiter to contact you for an interview: DO NOT WAIT around for a call. Be proactive and call HR yourself. Continue to apply and be persistent & consistent with your application. APPLY, APPLY, APPLY & CALL follow up with them after your application has been submitted. I have been applying to Baptist Health for quiet a while & when I say quiet a while I mean more than 12 months. Afraid that I would annoy the recruiters with my calls and inquires, and possibly having them discard my applications I never really called them. Later I realized that calling the HR dept can actually benefit you because who better that you to speak with them and explain to them that you posses the talent they are searching for? ....  To my surprise a recruiter actually answered the phone & I used that opportunity to professionally shine! Little said, the recruiter gave me a small phone interview and after asked me to come in & take the filling and typing test.  When I went in to take my exams, the testing process wasn't really explained in details.... so, you can only imagine how nervous and intimidated I became. IF YOU BECOME NERVOUS AND INTIMIDATED DO NOT LET THE RECRUITED SEE YOU DRIP A SWEAT! They want to see how well you work under pressure. The typing test was 5 minutes long ( If you are not a fast typer, I suggest getting a magazine & practice typing what you see quickly & with minimum errors. ) The Filling test is also easy, but just like the typing test, I would review a few tips and techniques to ACE your exam. I received a 100% on the filling and a rating of 62 WPM. The recruiter was not available for me to interview with once I completed my test, but I was told that the recruiter will reach out to me & schedule an interview. I'm confident that an interview will be scheduled & and an offer will be extended.", "Interview Questions": "Phone interview questions \r\n1) Why are you interested in working for Baptist Health of South Florida?\r\n2) Why do you want to leave your current job?"}, {"date": "27 Jan 2016", "title": "Valet Attendant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Baptist Health South Florida (Miami, FL) in Apr 2013", "Interview Descriptions": "Quick and easy. Just basic questions about why should I join the company and what would I bring to the company and information about myself and how I would be of an asset towards the company.", "Interview Questions": "Basic questions."}, {"date": "16 Jul 2015", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Baptist Health South Florida (Miami, FL) in Mar 2013", "Interview Descriptions": "You must apply online for the jobs available, if you meet the minimum requirements then a recruiter will contact you by phone to schedule an interview. First interview will be with the recruiter and the second one will be with the department which you apply for. The second interview will only happen if the initial recruiter feel you can be fit for the job.", "Interview Questions": "Tell me about a situation in which you must handle a difficult patients or family members. "}, {"date": "5 Apr 2013", "title": "Business Technology Consult Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Baptist Health South Florida in Jan 2013", "Interview Descriptions": "I had a interview in January and the recruiters who called me were not professional. They were laughing and talking while I was responding to their questions. They were not prepared to interview me.  It seemed like a joke and they wasted my time.", "Interview Questions": "I heard in the background while being interviewed... \" ask him if he knows how to us MS project?\""}, {"date": "5 Aug 2016", "title": "Physical Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Baptist Health South Florida (Miami, FL) in Jun 2012", "Interview Descriptions": "I went through HR first then was called to speak to the supervision and further to have a peer interview where therapist belonging to the staff asked me questions based on current events/scenarios.", "Interview Questions": "If while in ICU you receive a new order to perform a evaluation on a patient STAT. How would you proceed?"}, {"date": "1 Aug 2016", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Baptist Health South Florida (Miami, FL) in May 2012", "Interview Descriptions": "Intense, but productive. Started with a phone interview, then with Manager and Supervisors of the department. The final interview was a Peer interview that included about 7 members of the team.", "Interview Questions": "How did you deal with conflict with a coworker."}], [{"date": "30 Aug 2016", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1+ week. I interviewed at Baptist Health South Florida (Miami, FL) in Mar 2012", "Interview Descriptions": "Simple interview. Got the position right away after the interview. Nothing special, simple questions about character and experience. My interviewee was extremely nice and welcoming. The interview was done in the HR department, cannot remember the building. Although, instructions were sent in the email describing how to get there.", "Interview Questions": "How do you feel that you represent the values of Baptist Health?"}, {"date": "30 Mar 2016", "title": "Leadership Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Baptist Health South Florida (Miami, FL) in Mar 2012", "Interview Descriptions": "they thoroughly interview everyone and ensure that all your documentation is accurate.  If you do not have everything together Baptist will find out and end the process right away.", "Interview Questions": "why do you want to work for Baptist."}, {"date": "17 Dec 2015", "title": "Safey Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Baptist Health South Florida (Miami, FL) in Feb 2012", "Interview Descriptions": "panel of three, two interviews there wasn't anything worth mentioning just filling this out so I can continue what I'm trying to do trying to get 30 words so I can finish my other info for the important reason I'm on this site....", "Interview Questions": "just the usual stuff"}, {"date": "8 Apr 2016", "title": "Human Resources Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Baptist Health South Florida (Miami, FL) in Feb 2012", "Interview Descriptions": "The one-on-one interview was pleasant. I felt confident, not the least bit nervous. But the peer interview was a lot different. I never understood the point to these types of interviews; maybe it is to see how well you get along with others, but I was quite nervous during this interview.", "Interview Questions": "N/A"}, {"date": "6 Sept 2015", "title": "The One That I Have Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Baptist Health South Florida (Kendall, FL) in Jan 2011", "Interview Descriptions": "The interview was very straight forward. I went in and met with the manager and we spoke about experience. Then there were a few questions but overall it was very easy.", "Interview Questions": "How to process claims."}, {"date": "17 Jul 2014", "title": "Radiologic Technologist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Baptist Health South Florida in Aug 2010", "Interview Descriptions": "I applied on line, I received an email saying that they were reviewing my resume. Then I was called by phone to set up an interview. The first interview with HR representative, then a second interview with a panel.", "Interview Questions": "Situation questions"}, {"date": "31 Mar 2014", "title": "Care Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Baptist Health South Florida (Miami, FL) in Jan 2010", "Interview Descriptions": "Have to get through HR.", "Interview Questions": "N/A"}, {"date": "17 Sept 2013", "title": "Senior Secretary Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 5 days. I interviewed at Baptist Health South Florida (Homestead, FL) in May 2009", "Interview Descriptions": "My interview was amazing. I was treated in a professional manner, asked questions that pertained to my professional life only. The Manager was (now retired) a very professional and ethical person with excellent professional manners. Totally admirable.", "Interview Questions": "None were difficult"}, {"date": "26 Oct 2012", "title": "Scheduling Agent Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Baptist Health South Florida (Kendall, FL) in Mar 2008", "Interview Descriptions": "Lots of panel interviews with future co workers and supervisors.  Questions are standardized and based on scenarios and quoting past experiences.  They score you on a cumulative scale and then tier candidates to determine who makes the next round.  Three rounds total plus a one on one for final interview.", "Interview Questions": "If you were to receive an award in five years, who would give it to you and what would it be for?"}]]