[[{"date": "17 Apr 2023", "title": "Finance Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Leonard Cheshire", "Interview Descriptions": "Panel with the Head of Finance and The Operations Manager after a 5-question test (excel and subjective questions about partnerships, compliance and budget management). The offer came on the following day", "Interview Questions": "About compliance and partner agreements"}, {"date": "22 Feb 2023", "title": "Support Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Leonard Cheshire", "Interview Descriptions": "Took about an hour. Asked a few questions, and then given a tour of the building by a friendly resident and the manager. Then asked a few more questions. Positive experience overall.", "Interview Questions": "Why I was interested in the role, problem solving, strengths & weaknesses, etc... I was also asked about my previous experience."}, {"date": "22 Nov 2022", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Leonard Cheshire", "Interview Descriptions": "Quite straightforward - questions and scenario. Good contact from submission of application, the recruiter called to keep me informed of where we were in the recruitment process. Informed of decision the next day", "Interview Questions": "How would you meet CQC standards"}, {"date": "12 Nov 2022", "title": "Administrator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Leonard Cheshire", "Interview Descriptions": "Very good process, felt at ease with the interviewers and the questions asked, which were all relevant to the role and skills oriented. i have only praise for the way it was conducted.", "Interview Questions": "Previous Experience in relation to computerised systems"}, {"date": "24 Aug 2022", "title": "Head of Department Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Leonard Cheshire", "Interview Descriptions": "Initial call to short list with general questions, followed by face to face with a panal of 3 people. 10min presentation followed by competency questions which are scored on 1-3.", "Interview Questions": "10min Presentation - how you would approach your first three months "}, {"date": "15 Aug 2022", "title": "Domestic Support Worker Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Leonard Cheshire", "Interview Descriptions": "Simple questions involving things specific to the role, anything about the company and how to handle certain situations\r\nInterview process was easy to get through, staff were friendly.\r\nOverall, it wasn't that bad.", "Interview Questions": "What do you know about the company"}, {"date": "21 Jul 2021", "title": "Communications Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Leonard Cheshire", "Interview Descriptions": "Really easy process, applied online had an phone call with recruitment who discussed the role. Worthing a week I was asked to do an  interview, it was an average interview.", "Interview Questions": "What type of comms have you delivered "}, {"date": "19 Feb 2021", "title": "Change 100 Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Leonard Cheshire", "Interview Descriptions": "It was ok, I found the group activity pretty fun and it was nice to come with something already prepared. I found the interview pretty daunting because the interviewers didn't reply to my comments so I didn't know how I was doing. It was also over zoom.", "Interview Questions": "What is something that you are proud of and why?"}, {"date": "19 Aug 2020", "title": "Change 100 Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Leonard Cheshire", "Interview Descriptions": "Really casual interview process, very relaxed and welcome. Assessment centre was accessible and group interviews were not intimidating at all. We had a group session where we had to do a teamwork exercise, followed by an individual interview and questions", "Interview Questions": "What are you passionate about?"}, {"date": "12 Aug 2020", "title": "Support Worker Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Leonard Cheshire", "Interview Descriptions": "Applied online, invited in for an interview, received offer at the end of the interview.  Interview was Informal, basic questions. Didn’t seem overly interested.  Spoke more about personal life then about the job I applied for.  Not at all professional. Interview space should have told me a lot about the company; disorganised and messy!", "Interview Questions": "How long have you been with your husband? (Shocking)"}], [{"date": "26 Dec 2019", "title": "Digital Inclusion Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Leonard Cheshire (Bristol, England) in Dec 2019", "Interview Descriptions": "Had already started as a volunteer in their digital work. Interview held at some professional meeting rooms. One manager responsible for project not available for the interview. Task given was relevant.", "Interview Questions": "About communication styles and GDPR"}, {"date": "29 Aug 2019", "title": "L&D Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Leonard Cheshire (London, England) in Jul 2019", "Interview Descriptions": "The interview process was lengthy and I waited a while for a response. Having said that, from the positive experience I had, I didn't mind, I was just hoping the get the role as the new leadership team seem fantastic and are hugely supportive of staff learning.", "Interview Questions": "Can you describe a project that failed"}, {"date": "27 Apr 2021", "title": "Employability Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Leonard Cheshire (London, England) in Jun 2019", "Interview Descriptions": "It was a 2 person interview organised in a central location. Interview was conducted and there were 10 questions. They were typical to be expected questions around partnership working, developing plans to communicate with stakeholders, supporting clients and dealing with conflict, how to challenge negative behaviours, targets and kPIs.", "Interview Questions": "Please tell us about what experience you have that would enable you to succeed in this role?"}, {"date": "10 Jun 2019", "title": "Support Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Leonard Cheshire (Cardiff, Wales) in Apr 2019", "Interview Descriptions": "Interview was an hour or so long. Roughly several weeks after completing application form. They had a list of questions which were asked such as confidentiality, health and social care and general questions in regards to caring and supporting an individual.", "Interview Questions": "What would you do if a resident said they want to tell you something in private and made you promise you wouldnt tell anyone?"}, {"date": "20 Mar 2019", "title": "Maintenance Co Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Leonard Cheshire (Huntingdon and Peterborough, England) in Mar 2019", "Interview Descriptions": "Terrible, lady was very serious, questioned about mini-bus driving certificate, I didn’t need as was legal on my driving licence, asked about PAT Testing, they were funny as I only had a 1 day certificate, asked if I could change a plug, I mean really, were do they get these people from!, no real smile, when I left I turned the job down straight down, offered a better position elsewhere...", "Interview Questions": "N/A"}, {"date": "6 Feb 2019", "title": "Employment Advisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 6 days. I interviewed at Leonard Cheshire (Newcastle upon Tyne, England) in Jan 2019", "Interview Descriptions": "I applied online via their website and submitted a CV and cover letter.  First, I registered via their website and then I completed the application initial vetting questions very easily.", "Interview Questions": "Very unrelated to the Person Specification and extremely out of the ordinary? Usual iniital questions about Barriers individuals may face to accessing employment, Teamwork questions about how you would work with members of your team and give an example of a time when you worked with a team? Background questions about your own personal experience and why you would like to do this role/job? What challenges do you forsee and how will you overcome them? A very bizarre question about how you have managed a process before and what you did to complete a process? "}, {"date": "6 Apr 2018", "title": "Change 100 Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Leonard Cheshire (Wolverhampton, England)", "Interview Descriptions": "I was selected as one of the Change 100 programme internship candidate, and was summoned to Wolverhampton assessment centre. The process consisted of three stage: 1. 1:1 presentation about yourself, 2. Group exercise, 3. 2:1 interview. Every activity you do on a day is assessed, and although I wasn’t offered a position but it was a very pleasant experience where I met other driven, high calibre candidates. The atmosphere isn’t intimidating at all, and the questions are very straightforward.", "Interview Questions": "Tell us about the person you admire."}, {"date": "2 Sept 2019", "title": "International Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Leonard Cheshire (London, England) in Feb 2018", "Interview Descriptions": "Rather prolonged multi stage interview process which was totally unnecessary and repetitive questions  from senior  management. Not very well structured but informal in nature. Nothing taxing about it.", "Interview Questions": "Why do you want to work here? "}, {"date": "28 Jun 2017", "title": "Support Workers Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Leonard Cheshire (Aberdeen, Scotland) in Jul 2016", "Interview Descriptions": "The interview was in very friendly atmosphere.  There were two parts of the interview: spoken and written. The interview took about 1 hour time. The answer I got after about week time. The essential documents were processed for next 3 weeks. All gone very smoothly", "Interview Questions": "Do I know what is personal support plan"}, {"date": "4 Oct 2017", "title": "Programmer Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Leonard Cheshire (London, England) in Sept 2014", "Interview Descriptions": "online application form with cover letter and CV. Then one interview with presentation - 2 people on the panel - manager and department director. Only one stage interview. not overly difficult quesitons.", "Interview Questions": "My experience of programme management before"}], [{"date": "28 Jan 2016", "title": "Administrative Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Leonard Cheshire (London, England) in Jan 2014", "Interview Descriptions": "I was contacted within two days of the closing date to invite me to interview.  The interview was for the following week.  It was a relaxed interview and the interviewers were very friendly and put you at ease.", "Interview Questions": "Why are you interested in this role?"}]]