[[{"date": "19 May 2023", "title": "Public Policy Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at AEI", "Interview Descriptions": "Resume walk-through. Make sure you submit a cover letter they will read and ask questions about specifics. Be confident and curious. Will ask about how much time you can commit per week.", "Interview Questions": "Why you are passionate about the department / research?"}, {"date": "15 May 2023", "title": "Social Media Strategist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at AEI (Washington, DC) in May 2023", "Interview Descriptions": "This was a straightforward 30 minute interview where I was asked about my interest in the company, personal values, and why I would be a good fit for the role. We talked a lot about the company itself and what types of people/orgs I follow.", "Interview Questions": "Favorite AEI scholar, what news orginizations I follow, what my political ideologies are, what policies I am interested in, social media experience"}, {"date": "15 Apr 2023", "title": "Researcher Intern Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at AEI (Washington, DC)", "Interview Descriptions": "Greeting to the team's senior researcher. Discussed the interest in this position and how is it like to work with the team. Also, have some introduction to their scholar researching system. After meeting with the researcher, there is another meeting with the HR manager.", "Interview Questions": "Show your interest in this position, and how you contribute to the team. How much do you know about our scholars and their research? How do you value your skillset on the statistical tools?"}, {"date": "28 Feb 2023", "title": "Research Associate Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at AEI", "Interview Descriptions": "First interview with HR. (Brief phone call). A timed test assessment in STATA with research and analysis skills. Interview with the manager (1 hour) Interview with 4-6 team members (4 zoom calls)", "Interview Questions": "1. Why AEI. 2. Questions related to the code written in the testing assessment. Why you chose this method. If you had to pick only 3 observations from your test what would they be. 3.Explain in detail about any research project of your choose. Methods used, process and conclusion. 4. Where do you see yourself in 5 years."}, {"date": "3 Sept 2022", "title": "Summer Honors Program Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at AEI", "Interview Descriptions": "One interview, 30 minutes with two members of the Academic Programs team. Interview conducted virtually. Straightforward process with reasonable response time. Fair interview process with reasonable questions and good interviewers.", "Interview Questions": "What in your opinion is the most important political issue currently?"}, {"date": "27 Oct 2022", "title": "CRM Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at AEI in Aug 2022", "Interview Descriptions": "Concise and not too long. they give you an opportunity to share your background fully and doesn’t feel rushed. They are prepared and come with their own curated questions for their applicants.", "Interview Questions": "Q: How does your passions and the work done in the role align."}, {"date": "16 Jul 2022", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at AEI", "Interview Descriptions": "Heard back very quickly after submitting my application.  The interviewer, however, was one of the most unprofessional recruiters I've ever met. She was absolutely unfocused and aloof.  It totally felt like talking to an emotionless robot. And at the end of the interview, she sounded very unwilling to let me ask any questions. I still respect the organization but will never apply for a single job there again.", "Interview Questions": "weakness and strength\r\n\r\nWhy AEI?\r\n\r\ntell me about one time you overcame something difficult"}, {"date": "8 Aug 2022", "title": "Research Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at AEI in Jul 2022", "Interview Descriptions": "In total, I had four interviews with AEI. The first interview was with an HR manager, the second with an administrator affiliated with the research project that was hiring, and then the third and fourth were with the lead researchers of the research project.", "Interview Questions": "(Note: all questions are paraphrased)\n\nWhat appeals to you about AEI's ideological stances?  \n\nWhy do you want this position? How does it connect to your other career goals?  \n\nHow do you keep you and your work organized? \n\nThere were also numerous content questions based on the project that I would have been working on. \n"}, {"date": "25 Jul 2022", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at AEI in May 2022", "Interview Descriptions": "I applied in May and heard back within two days to schedule an interview. Had a second interview a few weeks later and then was asked to do a data assessment in June. Never heard back from them. \n\nThey took forever to respond between each step. They also asked a few weird questions in the two interviews that felt like I was being tested on my knowledge of the company.", "Interview Questions": "Do you have any favorite scholars at AEI?\nWho is the head of ___ department?\nWhat policy change would you make?"}, {"date": "26 Sept 2022", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at AEI (Washington, DC) in Mar 2022", "Interview Descriptions": "One fit interview. This was a thirty-minute long interview asking about my resume, why I am interested in AEI, and my areas of interest.  The interview was with a research assistant for the scholar I applied to intern for.", "Interview Questions": "Why do you want to work here? "}], [{"date": "15 Mar 2022", "title": "Summer Honors Program Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at AEI (Columbia, SC) in Jan 2022", "Interview Descriptions": "Very straightforward! Submit an application by early decision or regular decision deadline and hear back according to submission deadline. One interview and then a decision. Interview based on first choice summer honors program course and potentially second choice.", "Interview Questions": "How does international education policy relate to US education policy?"}, {"date": "10 Dec 2021", "title": "Research Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at AEI (Washington, DC) in Nov 2021", "Interview Descriptions": "The interviewer was a RA who would also be the supervisor of the internship. Nothing unexpected. Questions include self-introduction, your interests and career plan, related research experience. The interviewer talked about the current project and asked how candidates contribute to the project.", "Interview Questions": "Why AEI,  Self-introduction, interests and career plan, and related research experience"}, {"date": "6 Oct 2021", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at AEI", "Interview Descriptions": "Had to first fo a phone interview and was then sent an additional task, varies based on department I hear. Wait a while to hear a response as well, applied to various internships within organization.", "Interview Questions": "Varies, some typical some not. Ex: Why AEI?"}, {"date": "12 Feb 2022", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at AEI (Washington, DC) in Sept 2021", "Interview Descriptions": "Loved interviewing for the American Enterprise Institute. For the internship position it was one interview that lasted less than 20 minutes. The interview was over the phone. I heard from them in less than a week after my interview.", "Interview Questions": "What was my experience with adapting to technological databases"}, {"date": "27 Aug 2021", "title": "Intern Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at AEI", "Interview Descriptions": "Two-steps application process. I submitted my internship application a month before I got the call to schedule an interview with the Research Assistant for the scholars I might be working with. They sent out both an email and updated my online app status once the decision was made. Took just under a week from interview to decision. Interviewed two weeks before the start date.", "Interview Questions": "How would you write a memo on a specific topic if a scholar asks for one, and what sources might you use?"}, {"date": "23 Sept 2021", "title": "Academic Program Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at AEI in Aug 2021", "Interview Descriptions": "I applied for the position online. One week later, I received an interview offer over the phone. The interview was just a quick 15-minute session with a recruiter where I answered some basic questions, but I didn't learn much about the position or organization. I was invited the next day for the second round of interviews with my supervisor. It lasted about 30 minutes and was more conversational in tone where I got to learn more about the position. I received an invitation the next day for 2 more interviews and a writing assignment (with 48 hours to complete). The assignment had 3 parts that were meant to show your planning, organizing, and writing skills. For the last 2 interviews, I spoke with 3 colleagues, with 30 minutes per interview. I received my rejection a little over 2 weeks after the last interview. The entire process took a little over 1.5 months. Overall, it was an enjoyable experience, and they were pretty good at communicating.", "Interview Questions": "What are you most excited about regarding this position?\nWhich scholars do you know of?\nTell us about an experience where you planned an event from start to finish.\nWhat would your previous supervisors say about you?\nWhat makes you want to leave your current job?\nWhy is it important for youth to get involved in policy?\nWhy this position?\nWhat type of teams have you worked in?\nWhat scholars do you follow with whom you don't agree with them?"}, {"date": "26 Jul 2021", "title": "Media Relations Associate Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at AEI", "Interview Descriptions": "Two step interview. The first interview was just a phone screen about general behavioral questions. The second interview was a written test for an hour where you are required to read a paper and write a report to be published in the media.", "Interview Questions": "Writing a media pitch in one hour"}, {"date": "14 Jul 2021", "title": "Market Research Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at AEI", "Interview Descriptions": "Submitted resume and cover letter. Heard back in 2 weeks for an interview with the research assistant for the program. Heard back with offer in 1 week. Pretty straightforward questions about qualifications and interest in the research topic of the scholar", "Interview Questions": "Walk me through your resume."}, {"date": "25 Apr 2022", "title": "Editorial Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at AEI (Washington, DC) in May 2021", "Interview Descriptions": "The interview process consisted of several steps with different members of Editing, Communications, and even Design. It was a great way to get acquainted with the people I would be working alongside.", "Interview Questions": "What about AEI specifically appeals to you?"}, {"date": "11 Apr 2021", "title": "Summer Honors Program Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at AEI", "Interview Descriptions": "Ask specific questions about current political events and the courses you applied for. Do not expect questions like \"what are your goals?\" \"tell us about yourself\". They will ask direct questions that test your political knowledge and analytical skills", "Interview Questions": "Q. How do the military capabilities of the US and China weigh against each other and who will win a war between them? "}], [{"date": "6 Apr 2021", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at AEI", "Interview Descriptions": "One phone call with a resident fellow, hirer was interested in workplace behavior and experience relevant to the internship. Be yourself and you should be fine, they are most concerned with how easy and reliable you are to work with.", "Interview Questions": "Tell me about a time you failed at something"}, {"date": "5 Aug 2021", "title": "Summer Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at AEI (Washington, DC) in Apr 2021", "Interview Descriptions": "An AEI research associate reached out to me approximately two weeks after I submitted my application to schedule an interview, and I was offered a position soon after. It was a very chill process.", "Interview Questions": "Why are you interested in X policy area? Describe a time that you had to make a difficult choice."}, {"date": "15 Mar 2021", "title": "Director, Strategic Partnership Events Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at AEI in Mar 2021", "Interview Descriptions": "I  was really unimpressed by the interview process. While the interviewer asked me fairly thoughtful questions, she was unable to provide any meaningful information about the position I was interviewing for. She knew very little about the day to day responsibilities, scope of work, and how the position functioned with the Executive Office. \n\nI didn't get an offer, so it could be that she was unimpressed with me and did not want to divulge further details about the job, but it was a strange interaction and left a bad taste in my mouth.", "Interview Questions": "If you were to host an event outside of DC, where would you do it? (No information on audience, size, make up, etc. was provided, though, which most people in events would know makes that question pointless to answer...)"}, {"date": "10 Aug 2021", "title": "Media Relations Associate Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at AEI (Washington, DC) in Feb 2021", "Interview Descriptions": "Had two interviews- one with an HR rep and another to test my writing skills. First was about 30 mins and second was an hour. Followed up after the second and didn’t hear back for months. Finally, the HR rep I had been in contact with sent an email that didn’t even seem to be intended for me? Bizarre experience.", "Interview Questions": "Which of our scholars are you familiar with?"}, {"date": "25 Jun 2021", "title": "Press Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at AEI (Washington, DC) in Jan 2021", "Interview Descriptions": "Multiple interviews, writing test, conversations with different team members! The interviews themselves weren't that hard however the writing test was very unique. Overall a good experience though and good practice.", "Interview Questions": "Have you ever worked directly with the press?"}, {"date": "31 Dec 2020", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at AEI", "Interview Descriptions": "Had to review concepts in Microeconomics and Econometrics as well as come prepared having read a short paper to discuss. The interview was initially regarding my resume and prior experience and then questions regarding the assigned paper.", "Interview Questions": "Why do you want to work at AEI?"}, {"date": "15 Dec 2020", "title": "Internship Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 3 weeks. I interviewed at AEI", "Interview Descriptions": "I received the interview invitation 3 weeks after I submitted my resume. It was a 30min phone interview. Nice interviewer and normal process if you ask me. The interviewer started with the current project they were working on so you can take some quick notes and talked about how you skills are related to the project. Make sure there is no background noise.", "Interview Questions": "Tell me about your self?  Experience with statistical software? Skills and knowledge related to the specific project they are currently working on?  "}, {"date": "28 Jun 2021", "title": "Media Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at AEI in Dec 2020", "Interview Descriptions": "Emailed me after ~3 months to schedule a video interview for a winter internship starting in January. It was a quick video call, 2-1 that lasted about 45 minutes. They emailed me a couple days later saying I got the position", "Interview Questions": "Tell me about yourself, experience, fit for the role, what do you know about AEI"}, {"date": "14 Oct 2020", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at AEI", "Interview Descriptions": "Interviewed during COVID-19, so the interview process may differ.  1st round was a general informational over the phone, and the second round was about a specific rotation with a recruiter.", "Interview Questions": "What's the most pressing policy issue in today's world"}, {"date": "23 Sept 2020", "title": "Research Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at AEI", "Interview Descriptions": "Relatively easy. Asked me questions about my university degrees and dissertation. We also discussed current affairs with questions on Middle East and North Africa politics. The recruiter also asked me questions to test my knowledge on threats that face American national security", "Interview Questions": "Describe yourself in three words"}], [{"date": "9 Aug 2020", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at AEI", "Interview Descriptions": "The whole process includes a short phone call interview and a written task. I really enjoyed both since the contents and the person who interviewed me was very nice. The written task is a bit complex as I spent half a day thinking and doing it. It was fun.", "Interview Questions": "your background, your interest, and your skills."}, {"date": "2 Aug 2020", "title": "Summer Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at AEI", "Interview Descriptions": "I applied online and they got back to me in a week. They asked me to elaborate on my experiences, my knowledge of issues in the field, and my language skills", "Interview Questions": "Why do you want to intern for AEI?"}, {"date": "2 Sept 2020", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at AEI (Philadelphia, PA) in Aug 2020", "Interview Descriptions": "First, I submitted a cover letter, resume, transcript, and writing sample to the website portal. Next, I had a phone interview where the first portion was a behavioral interview and the second portion was a technical interview.", "Interview Questions": "What do you know about the AEI?"}, {"date": "2 Jul 2020", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at AEI", "Interview Descriptions": "The process consisted of multiple rounds of interviewers and skills assessment. They were quick to reach out and schedule next round interviews. Have to be proactive about reaching out if you don't hear anything. That's how I found out they went with another candidate. Wish they would have reached out to me so I didn't hold onto false hope for so long.", "Interview Questions": "What is the most important policy issue facing the US?"}, {"date": "25 Jun 2020", "title": "Editorial Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at AEI", "Interview Descriptions": "I applied for this position online. I had an initial phone interview with a recruiter. Our conversation was very friendly. After the initial interview, I was invited for a video interview about a week later.", "Interview Questions": "Why AEI? \r\nWhat is your five-year plan?\r\nCan you please walk me through your resume?"}, {"date": "20 May 2020", "title": "Research Assistant/Associate Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at AEI in Apr 2020", "Interview Descriptions": "The interview process included four rounds of interviews: 1) recruiter, 2) program manager, 3) current research assistants, 4) scholar. I applied online in early March and finally heard a decision mid-May. The decision came three weeks after the final interview. In between there were a few hiccups-- For example, I was rejected for being over-qualified (which was fair, I'm not a new graduate)... and then a week later they asked for another interview.", "Interview Questions": "I have your resume in front of me. Walk me through it."}, {"date": "4 Mar 2020", "title": "Intern Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at AEI", "Interview Descriptions": "Applied October and got back to me around February.  Two people interviewed and lasted for around 30 minutes.   Mostly basic questions and make sure know the scholars", "Interview Questions": "Why AEI? "}, {"date": "21 Oct 2021", "title": "Research Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at AEI in Mar 2020", "Interview Descriptions": "It was a very brief informational interview asking about my qualifications and interests relevant to the project I was working on. The interview lasted about 15-20 minutes and I heard back about a week later.", "Interview Questions": "What are your experiences relevant to the position?"}, {"date": "19 Jan 2020", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at AEI", "Interview Descriptions": "The interview process is okay. The RA or the interviewer will ask you questions related to your prior experience, your background, interests, and other details. I would recommend to just be yourself in the interview process.", "Interview Questions": "N/A"}, {"date": "1 Feb 2021", "title": "Internship Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at AEI (Washington, DC) in Jan 2020", "Interview Descriptions": "There were multiple phone interviews, there was an an introductory call and then a longer call afterwards.  I did not like that I had to follow up for a response on the decision myself after many weeks of waiting.", "Interview Questions": "Tell me a little about yourself. "}], [{"date": "3 Dec 2019", "title": "Internship Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at AEI in Nov 2019", "Interview Descriptions": "Phone interview that asked me about the head of the project without any details disclosed in the job description. The internship I interview basically does information mining, a labor-intensive work that isn't what I was looking for.", "Interview Questions": "Have you read about XXX's writing? How do you think of it?"}, {"date": "2 Sept 2019", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at AEI", "Interview Descriptions": "I got a voicemail asking to call back after I submitted an essay and resume application. I called back and scheduled a time to talk with the intern coordinator. The call was very friendly and informal and just went over why I wanted to apply to AEI and little about my previous internship and how that figured in.", "Interview Questions": "Who is your favorite Scholar"}, {"date": "31 Aug 2019", "title": "Editorial Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at AEI", "Interview Descriptions": "Applied online through the AEI website. Several weeks later, I received an email and was scheduled to receive a phone interview from employees in the AEI editorial department.  The phone interview consisted of about 10 minutes of QA about my resume, past editing experiences, and my overall interest in the editorial industry.", "Interview Questions": "What did you learn most from your past editorial experiences?"}, {"date": "26 Aug 2019", "title": "Summer Honors Program Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at AEI", "Interview Descriptions": "I had a phone interview. The phone interview was primarily a behavioral screening. Then I was contacted three to four weeks later for a skype interview. The skype interview was an assessment of my background and prior work experience. Finally, I was contacted again for a final video interview. The final interview was an assessment of content knowledge", "Interview Questions": "Why AEI"}, {"date": "23 Aug 2019", "title": "Digital Marketing Associate Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 days. I interviewed at AEI (Washington, DC) in Aug 2019", "Interview Descriptions": "This was a really straight forward interview overall- they didn't ask anything out of the ordinary or anything overly specific. I do wish that they talked a little more about the actual position to give more background in addition to the job posting.", "Interview Questions": "Tell me about a time when you made a mistake."}, {"date": "28 Jul 2019", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at AEI (Washington, DC)", "Interview Descriptions": "The Interview earlier was an excellent person who knew a lot about the department that I was applying for and I was delighted to hear and learn so much about the company with the work atmosphere is like as well as getting a really in-depth understanding of what my day-to-day tasks would look like. Also I was really thankful for the opportunity to get to ask very direct questions of what the company looks like in regards of motion and the flexibility in moving up. I have not heard back yet about how I will place or if I will get the internship but all in all the interview was a very good experience and one of the best interviews I think I’ve had on behalf of the organization that’s interviewing me.", "Interview Questions": "What is one accomplishment on your resume that you’re most proud of?"}, {"date": "19 Jun 2019", "title": "Research Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at AEI", "Interview Descriptions": "I had a phone interview. It went smoothly and was very quick and friendly. The woman who interviewed me made me feel very comfortable. All of the questions on this site were asked.", "Interview Questions": "What is one current event you are following right now?"}, {"date": "16 Jun 2019", "title": "Former External Affairs Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at AEI", "Interview Descriptions": "Interview conducted via phone. It was quite a nice experience. They asked about some relatively general interview questions, regarding past internships, experiences in communication, etc. No need to worry too much about it.", "Interview Questions": "Asked some general questions "}, {"date": "22 May 2019", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at AEI (Washington, DC)", "Interview Descriptions": "The internship was with the Critical Threats Project. I was required to read an article in my foreign language and translate it line by line. I would make sure you have a strong grasp of the vocabulary required to translate news articles.", "Interview Questions": "Translate this article."}, {"date": "16 May 2019", "title": "Program Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at AEI (Washington, DC)", "Interview Descriptions": "Meet with scholar, HR, and COO David Gerson. The scholar is the most subject-matter intensive. HR gives you an overview of AEI culture and benefits. The meeting with David Gerson is relatively brief and conversational.", "Interview Questions": "The interview was largely conversational. No tough questions."}], [{"date": "3 Jun 2019", "title": "Communication Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at AEI (Washington, DC) in May 2019", "Interview Descriptions": "I applied for the position online. I did two rounds of interviews over the phone and then finally a round of interviews at AEI in Washington. First round was a general HR phone screen.  Second interview was a little more focused on the specifics of the position.  Final round at their office consisted of approx. 10 interviews with various execs, program managers, and assistants.", "Interview Questions": "Why AEI? (Compared to other Washington think tanks) "}, {"date": "12 Apr 2019", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I applied online. The process took 3 weeks. I interviewed at AEI", "Interview Descriptions": "Two interviews, one with the Talent Team, then another with the specific department if passed along. Most of the questions were about my experiences, with a few questions to guage my interest and knowledge about public policy (e.g. who is your favorite columnist/writer on public policy?)", "Interview Questions": "Why do you want to join AEI this summer?"}, {"date": "10 Apr 2019", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at AEI", "Interview Descriptions": "Getting the interview was fairly easy, was contacted by AEI about two weeks after I applied.\r\nPhone interview with HR agent--very quick, only lasted about 20 minutes.\r\nThe person conducting the interview was very friendly, commenting after every answer.", "Interview Questions": "What is your strength? Your weakness?"}, {"date": "18 Sept 2020", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at AEI (Washington, DC) in Mar 2019", "Interview Descriptions": "There was only one round and it was a phone interview with my future managers/supervisors.  It was very straight forward and they asked the basic questions about my experience and studies.", "Interview Questions": "How are you qualified for this role?"}, {"date": "15 Jan 2019", "title": "Research Associate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 3 weeks. I interviewed at AEI", "Interview Descriptions": "5 rounds, mostly behavioral. First with HR, then a program manager, then with another research associate, then some written assessments, then with head of the department then with the scholars. Written assessments may not be required, dependent on the scholars. Be familiar with scholar work.", "Interview Questions": "Are you familiar with AEIs research ?"}, {"date": "12 Apr 2019", "title": "2019 General Staff/RA Positions Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at AEI in Jan 2019", "Interview Descriptions": "30 minute phone call with a person from the talent development team, had to wait several months before more jobs became available on their job board, still in the process", "Interview Questions": "strengths and weaknesses"}, {"date": "28 Jan 2019", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at AEI (Washington, DC) in Jan 2019", "Interview Descriptions": "15 minute phone screening interview about openings/positions that will be available in the next six months or so. They have a multi-stage process in hiring, and they said they would notify me in a few months if there are any openings.", "Interview Questions": "What are your biggest strengths and weaknesses?"}, {"date": "13 May 2019", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at AEI (Washington, DC) in Sept 2018", "Interview Descriptions": "I applied online and a week or two later I was contacted for a phone interview. In my experience, the phone interview was with the Research Assistant who would be my supervisor. I think this is true across the board. Interview lasted around 30 minutes and consisted of background questions and a few broad questions about my policy area. I was offered the internship the next day. I was told that my internship offer was much quicker than most - I wouldn't expect a one-day turnaround if I were you.", "Interview Questions": "If you could change one thing about K-12 or higher education, what would it be and how would you do it?"}, {"date": "18 Jul 2018", "title": "Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at AEI", "Interview Descriptions": "First round with HR. Basic interview with standard questions. Then the department managers. Little more about yourself and career goals. The process kept going with  more people within the department talking to me.", "Interview Questions": "Knowledge of AEI scholars and their work. Understanding of news events."}, {"date": "30 Aug 2018", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at AEI in Jul 2018", "Interview Descriptions": "Very casual and typical phone interview questions such as background, experiences, etc. No more than 30 minutes and heard back in a week. I advise researching AEI scholars to be familiar with the specific work that they do.", "Interview Questions": "Why do you want to work here?"}], [{"date": "8 May 2018", "title": "Media Relations Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at AEI", "Interview Descriptions": "The interview process was very long. About three or four months from application. But overall wonderful people with thoughtful questions. Talked to a lot of people too so be ready for that!", "Interview Questions": "Why AEI?"}, {"date": "1 May 2018", "title": "Business Development Associate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at AEI in Apr 2018", "Interview Descriptions": "I received an email asking for an interview. It was a 30 minute Skype interview. The HR interviewer was rude and kept looking at the clock. She read questions off a sheet and did not seem interested in my responses at all. When I asked her questions about the role, she did not know the answers.", "Interview Questions": "I have your resume here, walk me through it."}, {"date": "26 Mar 2018", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at AEI", "Interview Descriptions": "Phonecall, very relaxed overall, pretty short, 30 minutes. Scheduled about a week in advance and then they gave me a job offer a few days later. 10 days to accept or deny.", "Interview Questions": "What are some policy issues you are interested in"}, {"date": "15 Mar 2018", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at AEI", "Interview Descriptions": "Applied online and was contacted the following week to have a phone interview. The interview was conducted by a RA for the scholar I would potentially work for; largely conversational and laid back process.", "Interview Questions": "Who is your favorite economist?"}, {"date": "11 Apr 2018", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at AEI in Mar 2018", "Interview Descriptions": "Interview went well, it was phone interview and they said they would get back to me within a week and its been over a month and I have still not heard back", "Interview Questions": "What are the policy issues that is facing the United states Currently?"}, {"date": "13 Mar 2018", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at AEI in Feb 2018", "Interview Descriptions": "After applying for the position online I received an email asking for an interview to discuss possible positions that were open at AEI, this included positions that I had applied for and some that I had not. The first interview was conducted over the phone.  The interview, for the most part, was no more than an informational discussion.", "Interview Questions": "What are you strengths and weaknesses?"}, {"date": "11 Dec 2022", "title": "Director of Government Relations Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. I interviewed at AEI (New York, NY) in Feb 2018", "Interview Descriptions": "Interviewing was effortless yet contructive. Individuals who interview will leave feeling enthused and eager to grow. Thoughtful execution of interviewing is a talent and guides the future of any institution/organization.", "Interview Questions": "Q: How do you prioritize your growth indididually, while symotaneously prioritizing the goal of growth and health in enterprise?"}, {"date": "4 Jan 2018", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at AEI (Washington, DC) in Nov 2017", "Interview Descriptions": "Two interviews, one with HR and another with the RA at the time. The response time throughout the process was slow: got a time for an interview the day of, and it took 3 weeks to get an email on the status of my application afterward. The HR interview was pretty standard, the second one was a lot more detailed.", "Interview Questions": "Q. Have you worked with statistical models?\r\nQ. Where do you see yourself 5-10 years from now?"}, {"date": "1 Aug 2017", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at AEI (Washington, DC) in Jul 2017", "Interview Descriptions": "Interviewed on Skype for a research position on the Critical Threats Project. Professional interview, normal questions, were very interested in previous experience and how it could apply to their company. I was left with a great impression of the organization. Good benefits (training, food, travel stipend) for an unpaid internship.", "Interview Questions": "How does this internship fit into your education and future goals?"}, {"date": "28 Feb 2018", "title": "Intern - Hourly Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at AEI in Jun 2017", "Interview Descriptions": "After submitting my resume online, I had a 20-25 minute phone screening interview. I was in DC the week after the interview (for unrelated travel) so they invited me in to meet my potential team and an informal second round interview.", "Interview Questions": "Why think tanks? Why AEI? "}], [{"date": "27 Jul 2017", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at AEI (Washington, DC) in Jun 2017", "Interview Descriptions": "Was contacted day of for a 30 minute phone interview. Interviewer was clearly walking somewhere or commuting home during the interview. Made it hard to hear, especially when there were sirens going by. Interviewer was enthusiastic and knowledgeable about the company.", "Interview Questions": "What were my experiences copy editing. "}, {"date": "11 Jun 2019", "title": "Program Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at AEI (Washington, DC) in May 2017", "Interview Descriptions": "Three round interview before decision was made.  It took a while to hear back after my last interview, about a few weeks.  It was interesting because other positions I had applied to at AEI, I thought I was more qualified for immediately rejected me. But a position I didn't think I would get, I actually got an interview for.", "Interview Questions": "Tell us your thoughts on our research - what, if any, research of ours have you read?"}, {"date": "4 Apr 2017", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 7 weeks. I interviewed at AEI (Gainesville, FL) in Apr 2017", "Interview Descriptions": "Applied February online, 25 minute phone interview in early April. The lady in charge of the Critical Threats Program interviewed me and explained the program first before we walked through my resume and she asked me a few other questions.", "Interview Questions": "Why do you want to work at AEI?"}, {"date": "30 Mar 2017", "title": "Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. I interviewed at AEI", "Interview Descriptions": "Had a brief phone interview and then a formal sit in interview with HR and program managers. The interview was very structured.  However, one of the interviewers was on the phone the whole time, which was a bit unprofessional and odd, given the respect I have for AEI.", "Interview Questions": "Why are you interested in working for AEI?"}, {"date": "16 Apr 2017", "title": "Research Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at AEI (Washington, DC) in Jan 2017", "Interview Descriptions": "Phone interview lasted about 40 mins, very friendly RA. \r\n\r\nHaven't heard back until I followed up (4 weeks after the interview), that's really upsetting. \r\n\r\nFrom my classmates who got an offer, usually, it takes 2 weeks to hear back if you have a chance to on-site interview.  Otherwise, their system will inform you till jobs filled. I received an automatic email when the interview passed 6 weeks.", "Interview Questions": "Did you have relevant research experience regarding Korean Economy? "}, {"date": "22 Jan 2018", "title": "Full Time Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at AEI (Washington, DC) in Jan 2017", "Interview Descriptions": "Applied online, heard back via email a few weeks later to schedule a 30 min phone screen. Questions seemed generic, but thorough - like I read in other reviews, whether applying for a research role or a support staff, you're asked about your own research and their scholars, so beware. Didn't make it through to a further round, but was satisfied by their updates throughout the process.", "Interview Questions": "Are you familiar with any of our scholars, if so, who?"}, {"date": "16 Dec 2016", "title": "Critical Threats Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at AEI (Washington, DC) in Dec 2016", "Interview Descriptions": "Casual and very informative experience. First the interviewer told me a bit about the work of the critical threats program and AEI as a whole. I later got to talking about my career trajectory and my experience doing research. It helps very much if you cite a report that AEI has worked on and draw some relevant conclusions from it. The interviewers are known to ask open ended questions.", "Interview Questions": "They asked about my experience doing research."}, {"date": "16 Nov 2016", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at AEI", "Interview Descriptions": "I had couple phone interviews that lasted around 30 to 40 minutes. The interviewers were all very friendly and helpful in answering my questions. We mostly discussed my research experience.", "Interview Questions": "Why AEI?\r\nResearch experience"}, {"date": "11 Nov 2016", "title": "Intern Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at AEI", "Interview Descriptions": "I was contacted for an initial phone interview with HR two days after I applied for a full time position. I had another interview the next day with staff members, and a third interview at the end of the week. I was told that I would hear back the next week, but I never did. I followed up the next week, and HR kept saying that they would get back to me in a few days but they did not. I did not hear that I had not been accepted for the position for over a month, despite being told that I would hear sooner.", "Interview Questions": "Why do you want to work at AEI?"}, {"date": "12 Aug 2016", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 6 weeks. I interviewed at AEI (New York, NY)", "Interview Descriptions": "The hiring process is long and intensive with multiple rounds of interviews with ascending leadership levels within the organization. They are very concerned with making sure candidates are a good fit.", "Interview Questions": "Why AEI?"}], [{"date": "10 Jan 2019", "title": "CTP Threats Project Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at AEI (Washington, DC) in Jul 2016", "Interview Descriptions": "Phone Interview - I was asked a few questions about my language ability and a research project that I had worked on. I was also asked how I work in groups and how I would potentially conduct a research project. They were very nice and I got the offer the next day", "Interview Questions": "What is a research project you have worked on in the past and how did you go about to conducting that research? Please explain the process step by step. "}, {"date": "8 Jun 2016", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at AEI (Washington, DC) in May 2016", "Interview Descriptions": "Straightforward interview process. I first interviewed in-person with an HR Representative, where I was mostly asked about my background, research,and skill set. I was contacted shortly after to schedule two half-hour phone interview with a research assistant and the director of the policy division. The director asked me one or two technical questions related to tax policy, and then mostly asked about my research. The research assistant asked me to analyze a spreadsheet of sample tax returns and analyze the results. I found this challenging because I did not really understand the problem that I was expected to identify. All interviewers were very nice and friendly.", "Interview Questions": "\"What variables did you think were necessary to control for in your study?\""}, {"date": "11 Sept 2018", "title": "Digital Strategy Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at AEI (Washington, DC) in Apr 2016", "Interview Descriptions": "Short phone interview,  spoke with the supervisor of team I applied to and he was very pleasant. The process took about 3-4 weeks as it was late in the year in April.", "Interview Questions": " asked about resume & why I wanted to work there."}, {"date": "25 Mar 2016", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at AEI", "Interview Descriptions": "Interview scheduled pretty quickly after application submitted and heard back from them within 2 weeks. Had to reply to offer within five days but was able to extend deadline by one week. Two people were on the call, they were very nice, interview was only 20 minutes long.", "Interview Questions": "Asked about language skills and research projects."}, {"date": "1 Mar 2016", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at AEI", "Interview Descriptions": "Phone interview - about 30 minutes with an HR person. Most of the questions were very nontechnical. One of the questions asked about why I chose to go to the school I currently go to. Another was about familiarity with their scholars, so be sure to look up some of the scholars and their work and be ready to talk about that.", "Interview Questions": "Are you familiar with any of our scholars?"}, {"date": "7 Oct 2016", "title": "Research Assistant Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. The process took 2 weeks. I interviewed at AEI (New York, NY) in Mar 2016", "Interview Descriptions": "I had a phone interview with an HR representative and overall I think their hiring process was somewhat unprofessional. Had to wait 30 minutes for the phone call, which was fine for me. She was an HR rep so I expected mostly screening questions, but there are also lots of questions related to personal research and even technical questions, so beware! In general it was an average phone interview and I think everyone who prepares a lot would easily pass this round.", "Interview Questions": "In you opinion, what is the most difficult issue the US economy is facing right now?\r\nTell me about your research topic."}, {"date": "13 Feb 2016", "title": "Summer Accounting Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at AEI (Washington, DC) in Feb 2016", "Interview Descriptions": "self introduction, questions related to your resume, your teamwork ability, your available time for this internship, the interviewer's explanation of the detailed duties for this intern position, the opportunities available for interns", "Interview Questions": "what are your strength and weakness?"}, {"date": "24 Mar 2016", "title": "Marketing and Communication Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at AEI in Feb 2016", "Interview Descriptions": "Walk Through Resume and some marketing metrics, also ask about steps for writing an academic paper. It is quite competitive for summer intern since there is only one slot for each department. Not a tough interview but get no response for several weeks. When I finally emailed them for results, I was told the position has been filled with other candidates.", "Interview Questions": "Explain AB Test"}, {"date": "7 May 2017", "title": "Research Associate Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at AEI (Washington, DC) in Feb 2016", "Interview Descriptions": "Interview process was lengthy: I had a phone screen interview with HR, followed by four phone interviews with the senior research associate, vice president, deputy director, and program manager for the department, all of which took two months to complete. Was invited for a day-long interview (all expenses paid) in DC to interview with all of those I had spoken to over the phone, as well as the two scholars the position was under and the CEO. Overall the interview process was well organized and the questions were not very difficult, but some of the higher level interviewers were borderline rude and it was made clear that they were looking for a candidate who agreed with their stances on foreign policy and politics in general.", "Interview Questions": "Have you had a chance to look at some of the research scholars on AEI's website, and whose work do you find interesting?"}, {"date": "23 Oct 2015", "title": "Event Planner Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at AEI", "Interview Descriptions": "I had a preliminary phone call with the HR manager to discuss the position and see if I was a good fit -- she asked me basic interview questions and asked for a writing sample. I was then invited into the office to meet with the HR manager, and she asked pretty basic interview questions. I was then invited in for a third interview where I met with the HR manager (again), the Director of HR, the three other event planners, and the Directors of Development. It was a pretty long, exhausting process -- and I was not offered the job.", "Interview Questions": "Tell me about your event planning experience. How many events, on average, do you plan each month?"}], [{"date": "8 Sept 2015", "title": "Development Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at AEI", "Interview Descriptions": "I submitted my application to be the Development Assistant, particularly as a grant writer for the writing team, and was asked for an interview a few days later. I had a first 20 minute phone interview with someone from HR. The next week I had a phone interview with a person from the development team who would be the direct supervisor for the Development Assistant. The following week I had an interview with the director of the writing team. I didn't make it to the last round, which would have been in person in DC with basically the entire Development team. All of the other interviews were over the phone because I was not local. The HR interview was pretty easy and straightforward, and the questions became more challenging and complex with each interview.", "Interview Questions": "With HR: \"Walk me through your resume.\"  \"Why are you interested in working for AEI and in this position?\" \"What are your strengths and weaknesses?\"\r\nWith potential supervisor: \"Tell me about yourself by walking me through your resume.\" \"How did you hear about/become interested in AEI?\" \"Are there any particular AEI scholars that you follow closely?\"\r\nWith director of the writing team:\"Tell me about yourself by walking me through your resume.\" \"Is there a particular kind of writing that you like to do?\" \"What do you think is the biggest public policy issue facing the US today?\" \"What would you say to a potential donor to convince them to contribute to AEI rather than a more action-based organization like an NGO?\""}, {"date": "3 Sept 2015", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at AEI (Toronto, ON) in Aug 2015", "Interview Descriptions": "I submitted the application online and HR sent me an e-mail the next day for a phone-screening with HR. One week later I cleared the phone screening, and booked a phone interview with the scholar. After the interview with the scholar I heard back within two days. \r\nThe whole process took about three weeks.", "Interview Questions": "Have I read any of the scholar&#039;s work? What did I agree/disagree with the scholar about?"}, {"date": "10 Feb 2016", "title": "Research Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at AEI (Washington, DC) in Jul 2015", "Interview Descriptions": "Very easy, I filled out application online which required resume, writing sample, and cover-letter. I crafted my cover-letter to what they were looking for as a candidate. The interview itself was quick and easy. It is important not to raise issues about asking for time off and to know as much as possible about the program you are applying to be an intern for.", "Interview Questions": "Why AEI?"}, {"date": "1 Nov 2015", "title": "Research Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at AEI in Jul 2015", "Interview Descriptions": "After they review my resume, they contact me in two weeks. I had only one phone interview with research assistant at the team I applied at AEI. They asked about what research projects or experience I had before. Also, they were interested in what kinds of programming I am able to use or utilize.", "Interview Questions": "Q: what kinds of research projects have you done before?\r\nQ: what kinds of datasets and programming did you use?"}, {"date": "18 Jun 2015", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at AEI (Washington, DC)", "Interview Descriptions": "The process started with a phone screen with HR, then another phone interview with a team member.  After this, I had an all-day interview in the office, meeting with several different people for interviews.  It was a long day, but everyone was nice and the questions weren't too difficult (many people asked similar questions throughout the day).", "Interview Questions": "Why specifically AEI?"}, {"date": "1 Jul 2015", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at AEI (Washington, DC) in Jun 2015", "Interview Descriptions": "Three phone interviews, then you go into the office and have a day of interviews with the human resources, research assistants, the fellow, and the director of the division. You get to eat lunch and know the staff who work there. It is a good experience to see if you fit the culture as well.", "Interview Questions": "Why AEI?"}, {"date": "4 Jun 2015", "title": "Staff Accountant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at AEI (Washington, DC) in May 2015", "Interview Descriptions": "Step 1: phone screening with recruiter, lasted for 30 minutes\r\nStep 2: phone interview with Accountant Manager then CFO, lasted for an hour, 30 minutes \r\nThe recruiter asked too many questions for phone screening, went into too much detail. Speaking with the CFO and Accountant manager was a very easy process. The staff of AEI is very friendly and approachable, makes the interviewee feel comfrotable. They didn't stick to the \"interview script\" and they really want to get to know you as a person. It was a rather pleasant and educational experience for me. Accountant manager asked a  simple journal entry question, and the CFO asked two behavioural questions that showcase your accounting knowledge at the same time.", "Interview Questions": "How do you account for insurance?\r\nIf you were to open a mall, what kind of strategy would you follow? \r\nIf you were to prepare a profit & loss statement for the mall, what would you include?"}, {"date": "2 Dec 2015", "title": "Accounting Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 5 weeks. I interviewed at AEI (Washington, DC) in Apr 2015", "Interview Descriptions": "Phone contact first, then email to schedule a day for on site interview. Good working environment . basic interview process, manager and one colleague interviewed me. No professional questions and technique questions. comfortable  interview process. Question like What I hope to learn from the internships,tell me about yourself.", "Interview Questions": "strength and weakness"}, {"date": "19 Oct 2015", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at AEI in Jan 2015", "Interview Descriptions": "A single 30-min phone interview between myself and the Research Assistants in my division. They were incredibly nice and inviting. Gave me a sense of the work I'd be doing as well as AEI's culture. It was a very pleasant experience and a personable applicant should have no issues, in my opinion. Good Luck.", "Interview Questions": "Tell us about yourself? Take us through a research experience? How would you got about collaborating on a complicated project?"}, {"date": "28 Dec 2014", "title": "Staff Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at AEI", "Interview Descriptions": "The interview process started with a human resources phone screen, followed by a departmental phone screen, and then a long day of in person interviews. The process was pretty organized and they definitely seem to have a method to this. It was definitely not a rushed process, but they made sure to keep in touch at regular intervals.", "Interview Questions": "How does this position fit into your long-term career goals?"}], [{"date": "10 May 2016", "title": "Research Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at AEI (Washington, DC) in Nov 2014", "Interview Descriptions": "I sent in my resume and a cover letter and to the HR person. After a few weeks I was contacted by the department to which I had applied. On the AEI website there is s a long range of internships available that are easy to scroll through and read the descriptions. After the phone interview I was accepted for the position.", "Interview Questions": "I was asked a lot of questions about my research methodology, how do I exactly to my research, what do I do when I find research that disagrees with what I am studying. I was also asked what were my favorite classes and why and what did I learn from them."}, {"date": "11 Oct 2014", "title": "Intern Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at AEI", "Interview Descriptions": "One interview at the office with two members of the team. Most of the time were going through my resume in details - prepare yourself with your own experiences and know everything you have done. It seems that the supervisor favor students with some work experience. The organization is pretty conservatism so be very professional at the interview.", "Interview Questions": "What are your strengths and weaknesses?"}, {"date": "27 Sept 2014", "title": "Accounting Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at AEI", "Interview Descriptions": "Mostly conversational interview. The interview pace was well controlled, basically went through resume, talked about experiences, not that behavioral questions but based on your particular experience. Interviewers were nice and less challenging. Hiring process are flexible. Got the chance to ask questions about the employer and the job. Suggest dress formal and being conservative.", "Interview Questions": "easy questions"}, {"date": "19 Aug 2014", "title": "Research Assistant Interview", "results": "No Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at AEI in Jul 2014", "Interview Descriptions": "I had 8 interviews, totaling about 7 hours. I met with human resources twice (the first and last interviews), an office manager, 3 research fellows/scholars, and 2 vice presidents. They wanted to make sure that I would get along with everyone that I would potentially be working with. The interview questions were fairly standard, although repetitive as each person tended to ask a lot of the same questions.", "Interview Questions": "If the current administration contacted you seeking advice on what to do (about any current crisis), what would you tell them the US should do?"}, {"date": "13 Jun 2014", "title": "Research Intern Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at AEI", "Interview Descriptions": "There were two phone call interviews scheduled. I got the offer 3 days after the second interview. The supervisors are nice. Questions included stata experiences, future plan, why AEI, etc.", "Interview Questions": "stata experiences"}, {"date": "5 May 2015", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 3 weeks. I interviewed at AEI (Washington, DC) in Jun 2014", "Interview Descriptions": "Behavior interview with HR, then lunch with rest of research team and interviews with various scholars. Took about half a day. All a very congenial experience. Heavy resume screening at the front end, so I was fortunate to get an interview. Very conversational, with heavy focus on past research and interest in the subject matter.", "Interview Questions": "Describe your prior research experience"}, {"date": "8 May 2014", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at AEI", "Interview Descriptions": "There were three interviews.  One phone interview, one in-person interview with another Research Assistant, and another in-person interview with the heads of the department.  The interviews were very focused on precise experiences and skill sets that matched the desired skills of the job posting.", "Interview Questions": "In five years, what experiences would you like to have had between now and then?"}, {"date": "18 Sept 2015", "title": "Economics Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at AEI in Apr 2014", "Interview Descriptions": "I was selected for a phone interview based on a resume I submitted through my university career website. The beginning of the interview was fairly standard (tell me about yourself, why do you want to work at AEI), but then they really went into depth about each item on my resume (what were the biggest challenges? what skills did you gain through this experience? what do you think this experience would add to AEI)", "Interview Questions": "Why do you want to work at AEI?"}, {"date": "1 Jul 2016", "title": "Communications Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 2 days. I interviewed at AEI (Washington, DC) in Mar 2014", "Interview Descriptions": "There will be at least two interviews and possibly a lunch. If you are moved up to talk with David Gerson, chances are good that you will be hired. Be honest and be yourself.", "Interview Questions": "Why is free enterprise important?"}, {"date": "31 Mar 2014", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at AEI (Washington, DC) in Jan 2014", "Interview Descriptions": "Applied through their website and was contacted several weeks later to set up an interview. First round was with HR and asked the basic questions like why you want to work here, experience, background etc. Second round was with a scholar and the questions were more specific.", "Interview Questions": "They were all pretty standard."}], [{"date": "5 Aug 2014", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at AEI in Dec 2013", "Interview Descriptions": "Questions were very straight forward.  Mostly asked about specific experiences from my resume and explained more details about the job. It was very much a two way interview and felt more like a discussion towards the end.  Interviews and internships vary greatly by department and scholar.\r\n\r\nI heard back about 2 weeks later that I got the position.", "Interview Questions": "Nothing unexpected"}, {"date": "29 Jul 2013", "title": "Human Resources Coordinator Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied through a recruiter. I interviewed at AEI", "Interview Descriptions": "I had a two part interview, the first part was with the HR Generalist and the second part was with the head of the HR department. They both asked the same general questions. They seemed to take the position very seriously and stressed that the next stage of the interview process would be a lot more intense. Other than that it was a pretty straight forward first interview.", "Interview Questions": "How would your friends describe you?"}, {"date": "6 Jun 2013", "title": "Development Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at AEI", "Interview Descriptions": "First had pretty standard interview with someone in HR, and then I interviewed with two staff members on the team. The HR interview was pretty standard, \"tell me about yourself\" and what are your strengths, weaknesses, etc.  Everyone I interviewed with was friendly and courteous.  The interview with the staff members was laid back and more like a conversation than formal interview.", "Interview Questions": "Nothing challenging, other than it felt less like a formal interview than I was expecting. "}, {"date": "26 Apr 2016", "title": "Research Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at AEI (Washington, DC) in Jan 2013", "Interview Descriptions": "A Research Assistant made a phone interview. Standard interview questions: What's your weakness and strength, why the internship, do you have any data  analysis experience, etc. No hard or technical question. The research intern is supposed to work for an in-house scholar, but I didn't get speak with the scholar during the selection process.", "Interview Questions": "What's your weakness/strength"}, {"date": "15 Jul 2015", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at AEI (Washington, DC) in Nov 2012", "Interview Descriptions": "Submitted resume and writing samples to one department. Received email from a different department suggesting I might be a better fit and went through a phone interview. Hired the next week.", "Interview Questions": "Views on market, economic principals"}, {"date": "20 Aug 2012", "title": "Development Intern Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at AEI", "Interview Descriptions": "Applied via email with resume and cover letter, approached within a week regarding a phone interview. Phone interview ~30 minutes, heard back a week later that I got the position.", "Interview Questions": "Standard questions"}, {"date": "22 Jun 2010", "title": "Financial Advisor Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at AEI in Jun 2010", "Interview Descriptions": "Two round interview process", "Interview Questions": "What are your strengths and weaknesses?"}]]