[[{"date": "8 Apr 2023", "title": "Software Engineer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at AAAS (Chennai)", "Interview Descriptions": "Good and the work environment is good . Interview is bit hard but overall it's good and friendly environment and i am happy to be part of that company .", "Interview Questions": "Nil nil nil nil nil"}, {"date": "16 Feb 2023", "title": "Developer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at AAAS", "Interview Descriptions": "it was good. Highly appreciate for the process of interview . Timely feedback can mean the difference between an engaged and disengaged employee. When employees believe that their work is important, they become more loyal to the company.", "Interview Questions": "not difficult only basic questions"}, {"date": "22 Nov 2022", "title": "Research Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at AAAS", "Interview Descriptions": "Applied and about three weeks later scheduled an interview. An HR screening phone call was the first step. The first interview was less than ten minutes. And not the usual go over your resume questions. A panel video call interview was the second step.", "Interview Questions": "Salary expectations? What makes you a good fit?"}, {"date": "23 Sept 2022", "title": "Managing Producer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at AAAS", "Interview Descriptions": "Applied online, had a phone screen a couple weeks later (before the close date). Was told I would be recommended on to the next stage, which would include a test assignment. Had a week to complete, then had two panel interviews (one with just the immediate team, one with larger group). Offer came within a couple weeks after the panel interviews.", "Interview Questions": "What would you change about our products?"}, {"date": "21 Jul 2022", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at AAAS (Washington, DC)", "Interview Descriptions": "Contacted by HR staff who asked general questions. A few days later, had a phone interview with the managers. Then (because this was pre-pandemic), we had an in-person meeting too, and finally a few weeks later they offered me the position.", "Interview Questions": "Why do you want to work here?"}, {"date": "14 Jul 2022", "title": "Editorial Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at AAAS", "Interview Descriptions": "I had an initial interview with a Talent Acquisition Associate, where I was told about the specific team I would be joining and the management team. Following this, there was a second interview with the two managers, which involved answering pretty typical questions about my experience, expectations, etc.", "Interview Questions": "Do you have any experience storyboarding/ creating a plan for an academic journal?"}, {"date": "23 Nov 2022", "title": "Science Technology and Policy Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 7 months. I interviewed at AAAS (Washington, DC) in Apr 2022", "Interview Descriptions": "The interviews are a multiple round selection process. The semi-final interview is a combination of a briefing /memo and behavioral interview questions, about 30 mins total. The finalist interviews are a multi-day matching process with the individual hosting gvt agencies", "Interview Questions": "How would you work to integrate a category like race into EJ considerations, given recent federal restrictions on screening for protected classes like race in fed toolkits?"}, {"date": "3 Dec 2021", "title": "Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at AAAS", "Interview Descriptions": "Met with positive energy and professionalism. The director of the department met with me and was very knowledgable and passionate about their projects and campaigns. They were very helpful in answering my questions during the interview and in my follow up emails. I ended up taking the position and spent 4 happy years at this company.", "Interview Questions": "Describe a scenario where you had to make a tough decision."}, {"date": "26 May 2021", "title": "Program Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at AAAS (Washington, DC)", "Interview Descriptions": "I was interviewed three times. First, by Human Resources; second, by the supervisor; and third by a panel that included the director and other associates. The interviews consisted of questions about my interests, perspective, experiences, and approach, as well as an opportunity to ask questions and introduce myself further.", "Interview Questions": "How have you dealt with failure in the past?"}, {"date": "12 Apr 2021", "title": "Editorial Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at AAAS (Washington, DC) in Apr 2021", "Interview Descriptions": "I applied for the role in February 2021 and didn't hear back until April 2021. I was initially contacted by an HR representative for a phone screening. We discussed my salary requirements and some basic questions about the role. A day later I was contacted to set up a Zoom interview for the position with 2 of the managers. After the interview had concluded, I was told they would be talking to other candidates and that I would hear from them in the next few weeks. Unfortunately, I was sent an automated message within 24 hours from HR saying I had been rejected. The message did not even have a recruiter's name (\"Insert Recruiter's Name Here\" is what it said) and mentioned that they had moved on with a different candidate. Only an hour later I noticed that the job had been reposted on LinkedIn.", "Interview Questions": "What kind of team do you prefer to work with?"}], [{"date": "29 Oct 2020", "title": "Program Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at AAAS", "Interview Descriptions": "Interviewed with HR recruiter, who was very kind. He did a good job explaining the position, which it turns out I didn't want. Interview focused on my qualifications and interest in the position.", "Interview Questions": "Most focused on my qualifications, no trick questions."}, {"date": "1 Oct 2019", "title": "Associate Editor for STM Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at AAAS (Washington, DC) in Sept 2019", "Interview Descriptions": "Applied online and received an email about 3 weeks later asking for a phone interview the same day (~30mins).  Immediately following the phone interview I was given an editorial test to be completed in 4 days.  It consisted of reviews of recent pubs, hot topics, theme ideas, etc.  After two days passed, I was invited for an interview on site in a week.  It all moved fast.  The onsite interview was exhausting but everyone was nice to talk to.  A lot of redundant questions like why editing.  It was stressed that this is a demanding work place because of the sheer amount of workload (manuscripts submitted + weekly pub deadlines).  There was a manuscript test during the interview day to assess your ability to review fast and be able to decide if you would reject or accept the paper, why, and who would be possible reviewers.  Not hard but time consuming and you get an hour so come prepared with a method for reviewing fast - practice at home with manuscripts that are out of your scope of expertise/interest.  Heard back few days later and asked to please have a great weekend (I'm guessing this was a nice way of saying thanks no thanks :))\r\n\r\nReally wish they'd offer a gift bag for all the folks they reject since it's such an exhausting and time consuming interview process.  :P", "Interview Questions": "Why do you want to be an editor?"}, {"date": "29 Jul 2019", "title": "Program Associate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at AAAS (Washington, DC) in Jun 2019", "Interview Descriptions": "I was interviewed with a panel that focused more on deficiency questions rather than what skills someone brings to the table. The women on the panel were not able to talk or ask me questions since the male director just took over the whole panel.", "Interview Questions": "Have you reviewed grant applications before? "}, {"date": "10 May 2019", "title": "Editorial Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at AAAS", "Interview Descriptions": "The leadership team that I would potentially be working with took turns asking me questions about my resume and my experience. It was a positive experience. The interview was 30 minutes.", "Interview Questions": "Why do you want to work in this role? "}, {"date": "15 Jun 2019", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at AAAS (New York, NY) in May 2019", "Interview Descriptions": "Had an initial interview/screen with an HR rep, followed by phone interview with manager, and two on site interviews with the manager and others on the team.\n\nReasonably fast process although the reference checks are a little excessive (probably around six weeks from application to offer). My references told me the calls lasted 30-45 minutes and they were expected to speak in detail and provide specific examples about how my job experience made me a great candidate. Just way more in depth than I've ever seem before.", "Interview Questions": "How do you implement change across teams?"}, {"date": "15 Jan 2019", "title": "Programming Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at AAAS", "Interview Descriptions": "Three series of interviews. First, there was the phone screening with the Lead Programming Analyst, who was the head of the Web Development team. Then there was an in-person interview with the Lead Programming Analyst which lead into two more interviews. The second interview in this full day series was with the Lead Programming Analyst team where they ask. you questions relating to your resume. Lastly, you meet with the Director of IT to discuss your role, expectations back and forth, to get an understanding of your fitting into the company and department.", "Interview Questions": "How would you go about fixing a layout on a specific website?"}, {"date": "13 Aug 2018", "title": "Editorial Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 5 weeks. I interviewed at AAAS in Aug 2018", "Interview Descriptions": "Found the position through Monster, posted by Beacon Hill Staffing Group. At first I didn't know who the \"client\" mentioned was, but I applied anyway. After an initial interview with Beacon Hill (a very pleasant experience in and of itself), I was turned to a member of the AAAS's HR, who told me about Science Advances, the publication I'd be working on. Though I felt that interview didn't go so well (I was nervous!), I was passed along to the Managing Editor, Philippa Benson. \r\n\r\nThis one-on-one interview was short (20 min) and curt, but I gathered that Dr. Benson is a professional, and she encouraged me to be open about the technical questions I had about the position. Two days later, I moved forward to an interview with a few members of the editorial team, all of whom were pleasant and professional. That same day, about two hours later, I was offered the position. A quick turn around time: 6 days total from the day I spoke with HR to the day I was offered the position. (Note: the overall time from initial application to acceptance was longer because details changed on the company side a week into the process.)\r\n\r\nIf interviewing for any editorial position, expect to have the typical questions regarding experience -- but I found questions from the interviewee were not only appreciated but encouraged.", "Interview Questions": "Do you have experience working with tight deadlines and quick turnarounds?"}, {"date": "16 May 2018", "title": "Marketing Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at AAAS (Washington, DC) in Apr 2018", "Interview Descriptions": "A recruiter called me and asked if I was interested in the position. He then scheduled a phone interview with the direct hire. A week after I was asked to come in for at least four hours to interview with colleagues in the office.  The recruiter called me after a couple of days to let me know that I didn't get the position.", "Interview Questions": "How much interaction did you work with this type of audience?  "}, {"date": "26 Sept 2017", "title": "Financial Analyst II Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at AAAS (Washington, DC)", "Interview Descriptions": "During the first week after I sent my application, I was asked to schedule phone interview. A week later, I was asked to come to the DC office for an in person interview.", "Interview Questions": "Describe your experience with Microsoft Excel"}], [{"date": "1 Sept 2017", "title": "Publishing Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at AAAS", "Interview Descriptions": "Phone interview; one of the managers called and we had a conversation about the company expectations and spoke about my previous work experience. There was time for questions afterward. Overall the atmosphere was very relaxed", "Interview Questions": "How will you translate previous job experience to AAAS?"}, {"date": "5 Sept 2017", "title": "Editorial Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at AAAS (Washington, DC) in Aug 2017", "Interview Descriptions": "I was contacted by the HR department about a month and a half after applying. The entire process after that took about one month to complete. I first interviewed with their talent acquisitions coordinator via phone. She asked me normal screening questions regarding my salary requirements, my background, and skills. She also asked me to rate my technical skills on a scale from 1 to 10. A few days later I was contacted about a second in-person interview. That interview was with my direct supervisor and the head of the department. They were very friendly but straightforward. Half of the interview was comprised of normal questions, and the other half was behavioral/scenario questions. These questions posed situations where I would be faced with a difficult task or problem and I had to tell them how I would solve it.  At the end, there was plenty of time for me to ask questions. They also gave me a chance to say some last words about myself that I might not have covered during the interview. After the interview, I had another brief meeting with the HR coordinator to debrief the interview. Two days later  I was contacted to send references and a degree verification release form. About 6 business days later I received an offer.", "Interview Questions": "What do you know about the company?"}, {"date": "25 Jul 2017", "title": "Communications Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at AAAS (Washington, DC)", "Interview Descriptions": "The interview process was pretty straightforward. There was a screening call, and then a phone interview with members of the team. Overall,  it was a very pleasant and positive experience.", "Interview Questions": "Do you have a scientific background?"}, {"date": "25 Apr 2018", "title": "Business Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at AAAS (Washington, DC) in Jan 2017", "Interview Descriptions": "First interview with the HR rep. Assuming goes well, an in-person interview follows with your would-be supervisor and other relevant team members. Questions are a good mix of personality and work history. No more than an hour and a half.", "Interview Questions": "What traits would you look for in this position if you were the hiring manager?"}, {"date": "18 May 2016", "title": "Associate Editor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at AAAS (Washington, DC) in Apr 2016", "Interview Descriptions": "One month after submitting my application, I received an e-mail with an editing exercise.  I was told I had 2 weeks to complete it.  A couple of weeks later, I followed up, and they told me they were still reviewing applications.  Two months later, I have not heard back from them.  I initially applied in February!", "Interview Questions": "No interview - just an editing exercise using a sample paper"}, {"date": "6 Oct 2016", "title": "Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at AAAS (Washington, DC) in Mar 2016", "Interview Descriptions": "in prospective boss's office, it was relaxed but professional. he was very friendly and open, which made me feel like I could be open and ask questions as well. the interview left me feeling comfortable and confident", "Interview Questions": "why are you interested in AAAS?"}, {"date": "4 Nov 2017", "title": "Communications Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 3 weeks. I interviewed at AAAS (Washington, DC) in Dec 2015", "Interview Descriptions": "It was a pleasant interview process with the heads of the departments where I was applying as well as HR conducted their own separate interview. It's a process, but quite pleasant.", "Interview Questions": "About my desire to work for the company and normal interview questions"}, {"date": "29 Oct 2015", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at AAAS", "Interview Descriptions": "asked questions regarding background, reasons for interest, and how i learned about the specific position. interview was over the phone and fairly straight forward. questions seemed to be more about fit as opposed to technical details", "Interview Questions": "why aaas?"}, {"date": "8 Jun 2015", "title": "Copy Editor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at AAAS (Washington, DC) in Feb 2015", "Interview Descriptions": "Very standard process. From submitting the application to receiving an offer took about a month all in all. I applied online, then a few weeks later they contacted me and sent me an editing test. After I did the test they asked to set up an interview. At the interview I met with HR first and then met with two senior editors in the department. After the interview they asked for professional references, and I received an offer about a week later.", "Interview Questions": "Questions were very standard. They asked a lot of questions about previous work experience and how it applies to this position."}, {"date": "15 Dec 2014", "title": "Communications Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at AAAS", "Interview Descriptions": "I applied online and was contacted 1 week later for an interview. I was asked to provide writing samples in advance of the interview. When I arrived, I first met with the HR manager, who asked mostly about work history, related job skills, strengths/weaknesses and other standard interview questions. Next, HR administered a timed editing test on the computer. The time allotted for this test was not nearly long enough to get through the whole document, but I suppose they wanted to see how quickly you can work. Next, I met with the hiring manager who asked about my experience specific to this position. The manager also shared details about the position. I", "Interview Questions": "What would your current or former bosses say is an area where you need improvement? "}], [{"date": "22 Oct 2015", "title": "Editorial Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 7 weeks. I interviewed at AAAS (Washington, DC) in Oct 2014", "Interview Descriptions": "A brief (30-minute) phone interview with the managing editor of one of the journals at AAAS. It was a very casual and enjoyable, yet informative conversation and we discussed my experiences in writing, editing, and copy editing, as well as what I wanted to pursue professionally after the internship. We also discussed some of my coursework and how it had aptly prepared me for an editorial position.", "Interview Questions": "What new ideas/changes do you want to bring to the Journal?"}, {"date": "27 Jan 2015", "title": "Editorial Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at AAAS in Jul 2014", "Interview Descriptions": "I sent in a standardized application and my resume online. A week or so later, I got interviewed by the two people in charge of my department. The interview was very casual and friendly. I was asked about my technical skills, experience, people skills, foreign language skills, and the applicability of my (non-science) graduate degree.", "Interview Questions": "I don't think any of the questions asked were particularly unusual. It was mostly how my previous experience applies to this position, and what I did during my graduate degree. "}, {"date": "24 Mar 2015", "title": "Science & Technology Policy Fellow Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at AAAS (Washington, DC) in Mar 2013", "Interview Descriptions": "For the semi finals, we were asked to write a briefing memo and prepare to defend our memo before a panel interview. The interview lasted 30 minutes with ten administrators and committee members. The first five minutes were spent summarizing and answering questions about my memo.", "Interview Questions": "How would I address anxious funders who grow impatient with the R&D process?"}, {"date": "1 Mar 2013", "title": "Intern Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at AAAS", "Interview Descriptions": "Sent in online application, heard back in about two weeks with request to schedule a phone interview.", "Interview Questions": "No unexpected questions."}, {"date": "20 Feb 2013", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at AAAS (Washington, DC) in Aug 2012", "Interview Descriptions": "On site panel interview", "Interview Questions": "What's your weakness"}, {"date": "24 May 2012", "title": "Financial Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at AAAS in Mar 2012", "Interview Descriptions": "I met with the HR department first and went through the typical interview process. I was then brought upstairs to meet with various other department heads. It was pretty straight forward and laid back. I got to learn about the company and they got to learn about my background as well.", "Interview Questions": "Why do you want to work here?"}, {"date": "30 Apr 2012", "title": "Program Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 2 weeks. I interviewed at AAAS in Aug 2011", "Interview Descriptions": "I interviewed three different times - once with the entire team, once with my direct supervisor, and once with the program director.  Everyone was extremely nice and helpful and they made the interview an enjoyable experience.", "Interview Questions": "What is the most difficult decision you've had to make in the workplace?"}, {"date": "29 Jun 2011", "title": "Finance Department Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 1 week. I interviewed at AAAS (Washington, DC) in Mar 2011", "Interview Descriptions": "I came to work with this company as a temp through the Aerotek Employment Agency.  When i finished my initial assignment I was moved to another supervisor.  She liked my contributions and asked if I would be interested in working full time.  I had to interview 1 on 1 with human resources, but as I was already working this job, it was not a very difficult interview.  I was even told by the interviewer, \"This is my first interview.\"", "Interview Questions": "What's something you want to learn about this company while working here?"}, {"date": "21 Jan 2011", "title": "Publications Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at AAAS (Washington, DC) in Mar 2010", "Interview Descriptions": "An inexperienced HR employee (who was leaving the company in 2 weeks) did a perfunctory interview after I had waited for over 45 minutes for her boss to break free. It was the most general of interview questions, not specific to the job I was applying for in any shape or form. The HR person took few notes and seemed totally uninterested in what she was doing. She escorted me to the elevator for the next round on interviewers and didn't even introduce me to them. The vp and art director in this interview made it clear that I was overqualified for the position and said \"you'd be bored here.\" Then the vp said \"you know that this department has to \"pay for itself\" by charging back to other departments within the association. I told them that I had managed a department of 6 people in a similar situation for a contracting firm but they seemed focused on the fact that I was not coming from exactly their type of departmental structure. After I asked a few more questions about the role I would play, they indicated that it would be insignificant and basically it would be a paper pusher and administrative position. The offices were very crowded and tiny, unexpectedly because they had moved into this new building recently. Their were workspaces crammed into what should have been walkways.", "Interview Questions": "How are you going to make this department pay for itself?"}, {"date": "10 Feb 2010", "title": "Editor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at AAAS (Washington, DC) in Aug 2009", "Interview Descriptions": "initial communication was phone call interview, followed a week later by a second phone interview, followed about 2 weeks later with a formal in house interview that took 8 hours. everyone was really nice, polite, and delighted to meet and speak with me.", "Interview Questions": "best paper this year in the field and why"}]]