[[{"date": "12 Jun 2023", "title": "Assistant Professor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Southern Utah University (Cedar City, UT) in Apr 2023", "Interview Descriptions": "The interview process is very thorough. There was a screening interview that took place over Zoom. Then there were three individual meeting with 3 deans, teaching observations, and a interview panel with three professors.", "Interview Questions": "Why do you want to come teach at Southern Utah University?"}, {"date": "6 Jun 2022", "title": "Online Adjunct Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Southern Utah University", "Interview Descriptions": "Had  two phone interviews. Great Team. I really loved using Canvas to teach my online class. Had used Moodle before. Easy to use and very user friendly. Good students. My HOD was very kind", "Interview Questions": "why did you choose this job"}, {"date": "17 Mar 2021", "title": "Physical Building Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Southern Utah University", "Interview Descriptions": "fun process that involved getting asked a question and then stikking with it and enjoying life. Easy time. Do it again and again. I was very impressed with the process.", "Interview Questions": "Why do you wanna work here"}, {"date": "28 Sept 2020", "title": "Event Coordinator and Graphic Designer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Southern Utah University (Cedar City, UT) in Jan 2020", "Interview Descriptions": "I submitted a resume online through the SUU job search section on my student portal, received a call about setting up an interview, went to the interview, and was later notified that I received the job over email.", "Interview Questions": "If you were put in charge of coordinating an event for the Dean of the College, what are some ideas you would have for scheduling, themes, and design? "}, {"date": "6 Dec 2019", "title": "Certified Flight Instructor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Southern Utah University (Cedar City, UT) in Dec 2019", "Interview Descriptions": "The interview was held at the college's flight school campus at KCDC and consisted of a panel of four employees to include the chief flight instructor.  I was told beforehand that I would be asked a series of HR questions to get to know me and that I would have to teach two topics from a list they provide at the interview, one I get to choose, one they chose.   The oral part of the interview lasted approx 1 hour and contained a lot of questioning.  After the oral interview I was asked to stick around for a flight check interview in the school's Cirrus SR-20 aircraft.  I had no experience in this make and model and they understood that and was told that they would be looking at my general airmanship skills.  The flight lasted about 45 minutes and consisted of the usual aircraft checkout stuff, slow flight, stalls, steep turns, emergency descent and a landing.  At no time did they really say whether they liked what they saw and were pretty much silent other than telling me what maneuver to perform.  In the end of the flight the chief pilot shook my hand and asked if I had any questions.  I didn't, and he said he would call within a couple days.", "Interview Questions": "Why do you want to work here?\r\nHow many checkride failures have you had?\r\nWhat is your best quality as a flight instructor?\r\nWhat is your worst quality as a flight instructor?\r\nTell me about a time you violated a regulation or got into an unsafe situation?\r\nHave you ever had an accident/incident?\r\nWhat is lift?\r\nWhat is angle of attack?\r\nWhat are your future plans as a pilot beyond instructing? "}, {"date": "7 Jan 2021", "title": "CSIS Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Southern Utah University (Cedar City, UT) in Aug 2019", "Interview Descriptions": "It is a conversation with the Department Secretary. If you're a solid student and friendly with the professors, you'll make a great fit. Reaching out to the Secretary is your best chance of being one the first considerations", "Interview Questions": "What is your grade point average GPA"}, {"date": "27 May 2019", "title": "IT Helpdesk Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Southern Utah University (Cedar City, UT) in Dec 2018", "Interview Descriptions": "Communicated through email, I met with a board of representatives in the cafeteria immediately after another interviewee. I arrived with my official portfolio and extra resumes  and references for each person.", "Interview Questions": "how much experience have you had working with difficult people"}, {"date": "15 May 2018", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at Southern Utah University (Cedar City, UT) in Apr 2018", "Interview Descriptions": "Aside from the general interview questions, I was asked some newly developed questions the program director felt would be beneficial. Additionally, the atmosphere of the interview was relaxed and by combining both a face to face with a call in, it took away from the downsides of an over the phone interview.", "Interview Questions": "What is one thing that we will learn about you during this process?"}, {"date": "10 Apr 2019", "title": "Public Relations Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Southern Utah University (Cedar City, UT) in Apr 2018", "Interview Descriptions": "There was a brief interview with three of the current employees. They all asked various questions applicable to the job.  That mood was pretty casual since it was a student position job.", "Interview Questions": "What is your biggest weakness? "}, {"date": "8 Feb 2017", "title": "A&P Mechanic Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Southern Utah University (Cedar City, UT) in Jan 2017", "Interview Descriptions": "very unprofessional, I got a vibe that they were reading it from a text book. Which is a very big red flag on management level of experience and operation standards for the base line of the company. Its also unprofessional to curse a lot during the interview process from the people interviewing.", "Interview Questions": "basic google questions about conflicts on a floor and how to correct the situation. Telling me they have lots of conflicts on the floor."}], [{"date": "30 Sept 2017", "title": "Accounts Payable Clerk Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Southern Utah University (Cedar City, UT) in Mar 2016", "Interview Descriptions": "Quick process, I applied for a job in the same department (Accounting) and did not get it,  then a couple weeks later I got a call from another supervisor in the department, (Accounts Payable) asking for an interview. I went in for an interview a couple days later, and I was hired on the spot. Asked a few basic questions like work experience.", "Interview Questions": "Are you okay with repetitive projects aka scanning, sending emails, etc."}, {"date": "10 May 2016", "title": "Academic Advisor Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Southern Utah University (Cedar City, UT) in May 2014", "Interview Descriptions": "Nonqualified people were doing the interviewing...I know this because I was in the middle of an Internship.\r\nThe people acted like they didn't want to be there...\r\nQuestions were not organized and the people were not prepared.\r\nThey acted like they had their  minds made up before the interview even happened.", "Interview Questions": "Who did you admire and why?"}, {"date": "21 Dec 2015", "title": "Event Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 days. I interviewed at Southern Utah University (Cedar City, UT) in Apr 2013", "Interview Descriptions": "There were about 7 interviewers (my soon-to-be supervisors), and we gathered in a boardroom. They each asked their own personal set of questions, which reflected their personalities. They made you feel comfortable with their kind personalities, but also kept it a formal setting.", "Interview Questions": "They love to ask off-putting questions to get an insight for your personality and quick thinking. One question they asked was \"Do you believe Tupac is alive or dead? And why?\" (Good luck)"}, {"date": "13 Sept 2013", "title": "Digitization Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 6 days. I interviewed at Southern Utah University (Cedar City, UT) in Oct 2012", "Interview Descriptions": "I submitted the application in person and was asked a few questions about my qualifications. I heard back from them about three days later. Then I was asked to interview the very next day. The interview was only about 15-20 minutes long and conversation flowed easily. They asked the basic questions:\r\n\r\nWhat skills do you have to contribute to the organization?\r\n\r\nFormer experience? \r\n\r\nDesired hours?\r\n\r\nThey let me know that I might hear from them by the end of the week if I got the position, but I was called in the same day. A very pleasant surprise.", "Interview Questions": "\"What is your greatness weakness in the workplace?\" Was probably the most difficult question, but only because I wasn't quite prepared enough to answer in a way that I would have liked. "}, {"date": "8 Sept 2012", "title": "ESL Teacher Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Southern Utah University (Cedar City, UT) in Aug 2011", "Interview Descriptions": "There was no process.  My boss would have hired a monkey.", "Interview Questions": "N/A"}]]