[[{"date": "10 Aug 2022", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at College of American Pathologists", "Interview Descriptions": "The interview process was thorough, I met with the hiring manager and colleagues I would be working with closely. The last step in the hiring process was an interview with the VP.", "Interview Questions": "Asked about my work experience. "}, {"date": "2 Sept 2022", "title": "Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. I interviewed at College of American Pathologists in Aug 2022", "Interview Descriptions": "The recruiter approached me. I had the first round interview with the hiring manager and 2nd round panel interviews. The hiring manager said they are going to hire a product manager as previous  person only worked for 6 months and then left (returned to the former company). \nIt is a nonprofit organization but has sales reps. No 401K match for the first year, Less than one year= 0%,  1-2 years= 25%, 3 years= 40%, 4 years= 60%, 5 years= 80%, 6 or more years= 100% up to 5% match", "Interview Questions": "Why do you want to work here?"}, {"date": "21 Jul 2022", "title": "Senior Manager Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at College of American Pathologists (Northfield, IL) in Jun 2022", "Interview Descriptions": "Hiring process was incredibly long & time consuming. Over the course of several months I lost track of how many people I met with. Position was for FT Remote. Hiring manager casually mentioned in one of the many interviews that I would be responsible for travel expenses whenever they wanted me to come to their office across the country. I had never heard of a company \nasking this of its employees. However I was told this was negotiable throughout the process and during the final round I was told the company would cover them. When I received the job offer I asked to confirm the expenses were included in it, and was told no. What company expects employees to sign up for on-demand travel out of their own pocket with no details of frequency, duration etc? They would not even compromise and agree to any # for a cap on my out of pocket expenses. Any manager or company that does not understand how that can be a dealbreaker for candidates is probably not one you want to work for. Most frustrating is the company doesn’t respect your time enough to tell you the truth until you’ve wasted tens of hours with them.", "Interview Questions": "Be prepared to discuss why you’re really interested in the organization & position."}, {"date": "17 Feb 2022", "title": "Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at College of American Pathologists in Jan 2022", "Interview Descriptions": "Applied through a third-party recruiter.\nDid initial phone interview and then moved to 2nd interview with hiring manager.\nI was chosen to move forward to 3rd interview with HM and 2 directors that worked with position. The interviews were all video and roughly 30 minutes.\nWas not selected after the 3rd interview but was told that team would schedule 4th interview with finalist(s).", "Interview Questions": "What is your familiarity with Excel and how do you regularly use it?"}, {"date": "16 Dec 2021", "title": "Talent Sourcing Partner Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "The process took 1+ week. I interviewed at College of American Pathologists in Oct 2021", "Interview Descriptions": "The hiring and interview process was wrapped. Within a week. I met with 4 different leaders within the CAP, all who had a vested interest in my role.\n\nI was excited to learn how quickly things progressed upon completion of my final interview. They didn’t leave me waiting or wondering if I got the job. The hiring manager had a sense of urgency to fill the position but there was also a balance in prioritizing finding the right person for the opportunity. I am so happy I chose the CAP, and they chose me.", "Interview Questions": "There were many behavorial and situational questions also combined with questions about myself. The interviewers were very intentional in their interviews; asking specific questions about me as a professional and a person, to better understand who I was and how I aligned with the business and the CAP’s overall goals and core values.\n\nI appreciated each interviewer and the value they added throughout the process. I learned something new about the CAP after every interview."}], [{"date": "23 Nov 2021", "title": "Solutions Architect Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. I interviewed at College of American Pathologists (Chicago, IL) in Feb 2018", "Interview Descriptions": "multiple levels, at least 8-9 rounds. Can expect in-depth questions. also there will be managerial questions as well. started with primary screens and multiple interview teams evaluating you. after the technical rounds, there will be managerial rounds. Director-level employees take this assessment.", "Interview Questions": "technical and managerial. can expect in-depth technical questions. "}, {"date": "15 Jun 2016", "title": "Technical Specialist I - Surveys Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at College of American Pathologists (Northfield, IL) in May 2016", "Interview Descriptions": "Had a brief phone interview with HR about 4 days after I submitted an online application. About two weeks later I had an in-person interview with HR, the department manager, staff members who were in-person and working from home (via teleconference), and the department director. The questions were formal and pre-written. I believe my responses were being scored. At the end of the two hour interview, the director asked if I was keeping my options open for other positions outside of the company. I received an email about 2 weeks later saying other candidates are being considered for the position.", "Interview Questions": "How would you handle working with a team where all participants have different ideas on how to complete the task?"}, {"date": "20 Apr 2016", "title": "Marketing Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at College of American Pathologists (Northfield, IL) in Mar 2016", "Interview Descriptions": "A month ago I submitted my resume for a Marketing Specialist position at the College of American Pathologists (CAP). Had a very good phone interview with a Marketing person. Right after the phone interview, an HR person emailed me and asks me to come in for a face-to-face interview. The day before the interview; which was scheduled a week and a half prior, I emailed the HR person to confirm the next day’s interview. The  HR person didn't respond until almost 5 pm to tell me \"the Marketing person had decided to take a different direction with their team and they were eliminating the Marketing Specialist role.\"  I wonder when were they planning on letting me know that they were cancelling the interview?...when I showed up at CAP's office at 10 am the next morning. If I hadn't sent a confirmation, I suspect that's what would have happened.", "Interview Questions": "During the phone interview the Marketing person asked me if I could provide confidential documentation (Marketing Brief) from my former employer."}, {"date": "1 Sept 2015", "title": "Web Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 1 week. I interviewed at College of American Pathologists (Northfield, IL) in Aug 2015", "Interview Descriptions": "I first learned about the opportunity through a recruiter that works with CAP. I was connected with the hiring manager for a phone interview. The phone interview went well and I was asked to an in-person interview at their Northfield headquarters. I interviewed with three people: The HR director, the person whose role the new candidate would fill so that she would be able to move into a different area, and finally the hiring manager. The candidate before me (who ended up getting the job) was held over about 15 minutes into my interview slot. Obviously the hiring manager was impressed with this person. Overall I thought our conversation went well; I think the conversation with the previous candidate just went better and/or the skill set may have been a slightly better fit for them.", "Interview Questions": "I was asked how I would respond to certain scenarios that were apparently real scenarios that had happened - they wanted to know what steps I would take and any adjustments I might think of. This went well, and both the principal and the manager did a good job of explaining what the day-to-day tasks would be like."}, {"date": "12 Aug 2015", "title": "Marketing Content Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at College of American Pathologists (Deerfield, IL) in May 2015", "Interview Descriptions": "Long! I was expected to be in the office for 3.5 hours for my first interview. I met with two different panels of two people, and then with my potential manager (who's husband [a non-employee] walked in and interrupted the meeting). At the end, I was supposed to meet with a gentleman from HR, who never showed up.", "Interview Questions": "They didn't ask any questions that weren't basic, related to past experience, skills, etc."}, {"date": "25 Feb 2015", "title": "Finance Division Position Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at College of American Pathologists (Northfield, IL)", "Interview Descriptions": "Initial contact was voicemail left by a staffing specialist, who initially left my phone number as her call back number.  I then had a phone interview with another staffing specialist.  Woman was very pleasant, no difficult questions, gave a good indication of the culture, who would succeed, etc.  She said she would follow up if the hiring manager wanted to bring me in for an in person interview.\r\n\r\nI was called back within a couple weeks to schedule an in-person interview.  I was told 1:30pm, arrived at 1:15pm, and no one came to get me until 1:45pm.  Interview started with meeting with staffing specialist, then met with HR Business Partner for over an hour.  Nice person.  Very informative of the culture, training, expectations for managers and team members.\r\n\r\nNext was interview with hiring manager.  Met for over an hour.  Gave good indication of expectations, why role was open, where team was headed.\r\n\r\nI sent my thank you notes, received replies from two of the people I met with that I would hear from them \"next month\", and that I was \"in the running for the position\".\r\n\r\nI saw the job be reposted several times across multiple job boards.  I have yet to hear from them, despite the dreaded \"you're in the running\" comment.   After a month I followed up with an email to see where they were in the process and I have not heard back from them.  Obviously communication is not that important to them.", "Interview Questions": "Explain your management style."}, {"date": "28 Oct 2014", "title": "Finance Division Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at College of American Pathologists", "Interview Descriptions": "Long, drawn out and tetious.\r\nI interviewed with like 8 people.  Many of them asked me the same questions over and over again.\r\nThe whole process took an entire day.\r\nI didn't hear back from them for months and I never really knew why.\r\nOnce they made an offer, there was little negotiation on salary and they wanted me to start immediatly.", "Interview Questions": "N/A"}], [{"date": "12 Sept 2013", "title": "Consultant Interview", "results": "Declined Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied through other source. The process took 2+ months. I interviewed at College of American Pathologists", "Interview Descriptions": "Jerky and haphazard; unpredictable lapses in communication from their side", "Interview Questions": "We would like you to interpret our strategy for social media (but it kept changing)"}, {"date": "8 Apr 2015", "title": "Marketing Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at College of American Pathologists (Northfield, IL) in Sept 2011", "Interview Descriptions": "Staffing Specialist was professional, attentive, and knowledgeable. Accessible for feedback and status.  Overall, recruitment experience was positive.  I provided outstanding remarks and feedback on the interview steps during the process and upon hire.", "Interview Questions": "Probed deep into experience and applicable skills. Good overall explanation of the role and expectations.  Provided me an opportunity to provide specific work examples and experiences that would contribute to the overall success of the organization."}, {"date": "11 Sept 2012", "title": "Senior Java Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 5 days. I interviewed at College of American Pathologists (Northbrook, IL) in Jun 2008", "Interview Descriptions": "Phone interview only. This was 6 yrs ago. Spoke with Manager and Lead. Decent questions, good disposition. They are in it for the work you can do for them. Good people. I got the job and I was happy to work for them.", "Interview Questions": "N/A"}]]