[[{"date": "1 Jun 2022", "title": "Full Stack Software Engineer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Minerva Project (San Francisco, CA) in May 2022", "Interview Descriptions": "Interview process was very transparent and throughout the entirety of the process, always felt like they were looking out for me. Additionally, they had a quick turn-around on emails and updated me on the status of next steps, etc very quickly.", "Interview Questions": "System design questions (open-ended)\nPair programming\nSimple whiteboard question"}, {"date": "17 Feb 2023", "title": "Ops Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 5 days. I interviewed at Minerva Project in Jan 2022", "Interview Descriptions": "Great support system, space to take initiative, kind managers, peers I worked with were willing to onboard me fast. Overall a good experience for an undergrad learning the ropes of ops in an edtech setting.", "Interview Questions": "Fit was assessed based on work-study position"}, {"date": "18 Mar 2022", "title": "Software Engineer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Minerva Project in Sept 2021", "Interview Descriptions": "Call with Senior Engineer\r\n- Talk about past experiences\r\n- Trade-off design decisions in past\r\n- Question about how to optimize a slow product\r\nTake home assessment\r\n- Build an implementation of a game\r\n- Given test cases and detailed instructions\r\nEnded here for me", "Interview Questions": "Implement a Game in take home assessment"}, {"date": "12 Jul 2021", "title": "Software Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Minerva Project in Mar 2021", "Interview Descriptions": "Remotely interviewed in early 2021. The process took about 3-4 weeks from first contact to offer.\r\n\r\nThe process looks as follows:\r\n- Short friendly call discussing past experiences and culture fit, digging into some project specifics and technical topics related to a past experience of choice.\r\n- Take home programming and code design exercise, takes between 2-4 hours, no time limit.\r\n- Four consecutive calls with different people, going through: pair programming, architecture design, low-level code exercise (leetcode-similar), and behavioural questions.\r\n- Final call for offer extension and discussion.\r\n\r\nThe process was fun and the take-home exercise was particularly enjoyable. You likely get to meet 4-6 current engineers during the process and there is a lot of space for asking questions.", "Interview Questions": "There were many varied questions throughout the interview, and a lot of time was spent talking through my own experiences in designing systems, optimising for performance, etc."}, {"date": "12 Sept 2019", "title": "Associate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Minerva Project in Aug 2019", "Interview Descriptions": "I applied online. Then, I got an invitation of phone interview and in-person interview. \r\nBut after >1 month, the team never informed me anything regarding the result. No reply to my follow-up email as well. They do not seem organized nor do they seem professional.", "Interview Questions": "How do your boss, co-workers and friends describe you? "}, {"date": "18 May 2019", "title": "Software Engineer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 3 weeks. I interviewed at Minerva Project (Remote, OR) in Apr 2019", "Interview Descriptions": "I was approached by a 3rd party recruiting agency, who forwarded my resume to Minerva. They hiring manager reached out to me for a phone interview. That seemed to go well, and I moved on the completing a take home coding exercise. I spent about 5-6 hours on the coding exercise, submitted it and after a few days, they contacted me to set up a series of 4 one hour video interviews. The video interviews covered making an addition to the take home exercise, a system design discussion about a full stack architecture, live coding an algorithm in JavaScript, and a final interview back with the hiring manager for culture fit and any other questions. A few days after the final interview, I received a form rejection email from the hiring manager. I followed up with the hiring manager for additional feedback with no response. My impression of this interview is negative, because throughout the process, they seemed very interested in me and at certain points encouraged me to move forward in the process, wherein I spent 10 hours of my time even prioritizing it over other opportunities, and after receiving a form rejection email, they wouldn't follow up with additional feedback. Some of the interviewers also came across as cocky, arrogant, and pretentious.", "Interview Questions": "How to encode a string."}, {"date": "20 Aug 2019", "title": "Senior Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Minerva Project (San Francisco, CA) in Mar 2019", "Interview Descriptions": "I was introduced by a friend who already worked there. I had a phone interview with the head of product, who then set up a number of interviews with other staff - both engineers, but also product manager and curriculum developer, since I had an interest in the pedagogical aspects as well. All meetings were fully remote, since I was applying for a remote position. \r\n\r\nThe conversations went very well. I hadn't been sure about this job when I made the initial contact, but talking to the various people, I realised this was a group I really wanted to work with. I had spent several years working on an open-source project, so I didn't need to do any coding task, instead I wrote a short technical overview of the project and made a little demo video which I shared, and I was then invited to give a technical talk based on this project to all the engineers.\r\n\r\nThey made an offer very quickly, and we sent a few emails back and forth to clarify conditions, benefits etc. I think it only took about 2.5 weeks from I started the process, until I had signed.", "Interview Questions": "What is one technical challenge/accomplishment that you can tell me about?"}, {"date": "2 Feb 2019", "title": "Senior Marketing Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 8 weeks. I interviewed at Minerva Project (San Francisco, CA) in Dec 2018", "Interview Descriptions": "I sent in my cover letter and resume and week or so later I was Bcc'd on an email asking to schedule a phone interview. It seemed pretty obvious that I was one of many recipients of this email. I scheduled the phone interview, which was fine. The interviewer said \"like\" so much I started counting (17 times in the last 10 minutes of the phone call alone). The interviewer was clear about not knowing for sure what they were seeking. I was asked to perform a simple assignment and not spend too much time on it, and I sent that in a few days later. After 3+ weeks I hadn't heard anything, so I sent a follow up. Heard nothing back from that. Another 2.5 weeks after my first follow up I sent another, which triggered an automated \"thanks, but no thanks\" email. In total, it took seven weeks for them to tell me they were moving on with other people, and that was after a phone interview and after I did work for them. Not very impressive.", "Interview Questions": "What are you looking for in a workplace?"}, {"date": "31 Oct 2018", "title": "Manager of Student Services and Operations Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. The process took 1 week. I interviewed at Minerva Project (San Francisco, CA)", "Interview Descriptions": "I was contacted within one week of applying for this position. In the email I received, I was asked for my availability to interview and my salary expectations. Upon receiving my salary expectation (and likely the expectations of other San Francisco applicants), they turned around and replied by telling me that they assessed their original posting and now only want a coordinator.  The position was not changed on their website. \r\n\r\nI declined any further interview and recommend that others be wary of this company's likely underpaid positions.", "Interview Questions": "What is your salary expectation?"}, {"date": "31 Mar 2018", "title": "Faculty Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Minerva Project", "Interview Descriptions": "Applied in December for supposed January review. Review never happened. On asking for feedback, which is more common in academia, was given a non-functional email. Clearly, this is not a professional organization and not one even a semi-serious academic should consider.", "Interview Questions": "How d I talk to an actual person at Minerva!"}], [{"date": "29 Apr 2018", "title": "Software Engineer Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 3 weeks. I interviewed at Minerva Project (San Francisco, CA) in Nov 2017", "Interview Descriptions": "Standard process, pretty much: phone call, then a take-home assignment , then a panel of four onsite interviews in their HQ. Lunch was provided so I had some time to chat with the team. Nice experience overall!", "Interview Questions": "Interview questions were pretty well distributed: I remember talking about website performance, infrastructure problems and testing. Some interviews felt really casual and free-form (design on whiteboard), others were more structured and had a clear goal (design a small algorithm to do XYZ)."}, {"date": "2 Dec 2018", "title": "Software Engineer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Minerva Project (San Francisco, CA) in Mar 2017", "Interview Descriptions": "Company ghosted me after I spent half a day on their coding challenge.  This was a referral after having met some engineers in another setting, so I was surprised that this happened.  Process at that point had been a phone chat with an engineer on the team, then they gave me a take-home coding challenge.   I submitted it and followed up a few times, but they never got back to me.", "Interview Questions": "Generic OO coding challenge "}, {"date": "19 Mar 2015", "title": "Front-End Developer Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Minerva Project (San Francisco, CA) in Sept 2014", "Interview Descriptions": "The interview process with Minerva was kind of all over the place. The people at the company seemed to be very busy so there was often rescheduling of meetings and phone screens. However, once I had an on-site interview the process was great. Everyone I talked to was very kind, and they seemed very prepared.", "Interview Questions": "How would you work through a given UI design problem?"}]]