[[{"date": "15 Mar 2023", "title": "Administrative Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Florida Gulf Coast University", "Interview Descriptions": "I filled out an application and emailed it to the office, received and email back, set up and interview, heard back after that just a few days later with an offer.", "Interview Questions": "The questions were relative to the position and asked fairly."}, {"date": "4 Nov 2021", "title": "Accountant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Florida Gulf Coast University", "Interview Descriptions": "Usual process is phone contact, next a phone or skype interview, then an onsite interview which is almost always a panel of 3 people. The process is quite friendly and conversational. Describe a time where you made a mistake at work and what you did to fix .", "Interview Questions": "Tell us more about you and why you want this job."}, {"date": "22 Feb 2021", "title": "Ticket Operations Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Florida Gulf Coast University", "Interview Descriptions": "Very smooth, fast call the interviewer was very nice and understanding. Definitely would recommend to anyone looking for a part time job to make fast money. FGCU is very good at hiring international students and making the process very easy", "Interview Questions": "Experience in customer service and ticketing"}, {"date": "29 Jan 2021", "title": "Intramural Referee Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Florida Gulf Coast University", "Interview Descriptions": "You answer questions to your best knowledge. Most are scenario based and are set up to see how you would react in a situation. It was a very easy and relaxing interview.", "Interview Questions": "What would you do if two players were fighting?"}, {"date": "3 Dec 2019", "title": "Advisor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Florida Gulf Coast University (Fort Myers, FL) in Oct 2019", "Interview Descriptions": "Had a twenty minute phone interview with a search committee of four professionals from across the division.  The questions were very straight forward about the position and my experiences working in higher education. I did feel a little rushed in giving my answers as the hiring manager kept telling me how much time was remaining after each question was asked.", "Interview Questions": "Why would you like to work in this position?"}, {"date": "21 Oct 2019", "title": "Web Support Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Florida Gulf Coast University (Fort Myers, FL) in Dec 2018", "Interview Descriptions": "I came into the office to meet the team for an informal interview.  There was a panel of team members who took turns asking me questions. They were quick to communicate with me and very nice.", "Interview Questions": "Do you know how to optimize images?"}, {"date": "16 Oct 2018", "title": "Lecturer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied through other source. The process took 2 weeks. I interviewed at Florida Gulf Coast University (Fort Myers, FL) in Nov 2017", "Interview Descriptions": "A few interactions to determine if the subject of the lecture would be of interest to the students and if there is a need according to all the other courses offered at the time. Under these conditions, there is a possibility of a spot to be reserved but only if enough students register.", "Interview Questions": "Background to determine knowledge and credentials, then if enough people register, the lecture is scheduled"}, {"date": "21 Jul 2021", "title": "Administration Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Florida Gulf Coast University (Fort Myers, FL) in Nov 2017", "Interview Descriptions": "Four Interviewers (all female, but racially diverse), Very welcoming, Asked great questions, Was a student at the time and they made it clear at the interview that they would be very understanding of my studies.", "Interview Questions": "How would past employers describe you?"}, {"date": "23 Oct 2017", "title": "SG Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Florida Gulf Coast University", "Interview Descriptions": "Applied online, scheduled in face meeting interview. There was not an in depth description of the position but I was interesting anyway. It seemed that the position was already filled and I was there for no reason.", "Interview Questions": "Tell me about yourself? How do you deal with difficult people?"}, {"date": "21 Feb 2017", "title": "Applications Support Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Florida Gulf Coast University (Fort Myers, FL) in Feb 2017", "Interview Descriptions": "Panel based phone interview with an opportunity to ask questions of the panel at the end.  Each person would ask a question, then I would answer, then it was immediately on to the next question.", "Interview Questions": "Describe your experiences with writing SQL queries."}], [{"date": "27 Jul 2016", "title": "Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Florida Gulf Coast University (Fort Myers, FL) in Jun 2016", "Interview Descriptions": "Extremely lengthy. I felt led on, as I interviewed over a computer program and then with a panel over the course of 3 months. I didn't even get a response back for weeks after the panel interview and then the position was posted again, as if no candidate was chosen. Most people do not have months and months to wait and see if they got a position. Being a truly qualified candidate, I was not pleased with this process.", "Interview Questions": "I was asked at least 15 - 20 questions in the panel interview."}, {"date": "15 Jan 2016", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Florida Gulf Coast University (Fort Myers, FL) in Dec 2015", "Interview Descriptions": "They do a candidate pool and will choose from those people as to who will get the job. You will go into a meeting room, and there will be a hiring panel who will ask you several different questions. This can be pretty intimidating if you have never been in that sort of situation before. Then if they like you the primary decision maker will ask you in for a one-on-one interview. You will also have to get your fingerprints taken and pass a level two background check. Don't worry about DUI's though :)", "Interview Questions": "What do you know about the University?"}, {"date": "4 May 2018", "title": "Web Editor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Florida Gulf Coast University in Jun 2015", "Interview Descriptions": "Submit materials via a web form including resume, list of references, etc. If selected from pool of applicants, phone interview with one or more of the hiring committee. If selected from that group, in person interview including a presentation.", "Interview Questions": "Tell us about developing a web site using asp."}, {"date": "8 Aug 2017", "title": "Campus Reservations Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Florida Gulf Coast University (Fort Myers, FL) in Jan 2015", "Interview Descriptions": "Applied about a week later was called to the specific office. Interviewed with three people. They asked me about my costumer service experience. They gave me scenarios that are known to happen at the desk.", "Interview Questions": "Customer service? "}, {"date": "8 Oct 2014", "title": "Unspecified Interview", "results": "No Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Florida Gulf Coast University", "Interview Descriptions": "Usual process is phone contact, next a phone or skype interview, then an onsite interview which is almost always a panel of 3 to 8 people. In some departments you actually meet with several panels and individuals one after another over the course of a few hours.  Fairly extensive no matter what department you are applying for, and I have applied for several.", "Interview Questions": "Tell us about a position where you did not get along with a supervisor and how did you handle it. "}, {"date": "31 May 2015", "title": "Administrative Assistant - Procurement Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Florida Gulf Coast University (Fort Myers, FL) in Feb 2014", "Interview Descriptions": "Applications are weeded through by HR prior to department notification of qualified (per HR) applicant list.  Phase 1.  Routinely phone interviews performed by a team selected to complete interviews for the posted position.  Phase 2.  If selected, and onsite interview is scheduled where you meet with key personnel in the department.  Phase 3.  Finalists are traditionally called back to interview with department director and possibly other higher level staff.  This process can take anywhere from 2 - 6 weeks.", "Interview Questions": "How do you prioritize your work when several project deadlines are looming?"}, {"date": "6 Oct 2013", "title": "Course Facilitator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Florida Gulf Coast University", "Interview Descriptions": "Overall the process is extremely laid back and they are very understanding that this maybe your first job (if you have no job history / references). I walked in and setup an interview for the following week and then made a follow up appointment to see the course. Once I went through the first training I was offered the job. The questions during the first interview where very standard – why are you interested – past experiences", "Interview Questions": "If you where a type of cereal what type would you be?"}, {"date": "1 Jan 2016", "title": "Office Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Florida Gulf Coast University (Fort Myers, FL) in Jul 2013", "Interview Descriptions": "Single interview session with approx. 5 people on the panel. The interview process took approx. 50 min and after the first process was completed I was introduced to the Director of the department.", "Interview Questions": "Questions about my previous work experience."}, {"date": "1 Feb 2017", "title": "Office Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Florida Gulf Coast University (Fort Myers, FL) in Jul 2013", "Interview Descriptions": "The interview process was very pleasant and lasted approximately two hours. The interview panel asked typical interview questions regarding my work experience as well as some behavioral questions. Once the interview process began, I did not experience any stress; the atmosphere was very relaxing.", "Interview Questions": "What experience do you have with managing people? "}, {"date": "27 Feb 2013", "title": "Part-time Tech Support Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 days. I interviewed at Florida Gulf Coast University (Fort Myers, FL)", "Interview Descriptions": "I went in and applied for the position, and they already knew me because of some friends. Turns out friends are all you really need to get a job here.", "Interview Questions": "They didn't really ask me much. They asked what I knew about PCs. That's about it."}], [{"date": "4 Mar 2013", "title": "Student Research Analyst/Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Florida Gulf Coast University in May 2012", "Interview Descriptions": "The interview process is very straight forward. You would email the Director of the institution your resume and cover letter (if there is an opening available) and he'll call/email you to set an appointment if you caught his curiosity from your resume/cover letter.", "Interview Questions": "The interview questions are basic questions; going through your resume, getting a feel for your skill levels that are needed for the position, etc. "}, {"date": "22 Jan 2015", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 days. I interviewed at Florida Gulf Coast University in May 2012", "Interview Descriptions": "When trying to get hired, it is best to talk to a professor or mentor about any potential spots open in their labs. Often times, some grants will be available that they can utilize them to help improve upon a topic. For me, I found a topic that I enjoyed that my professor was willing to pay me to explore.", "Interview Questions": "The difficult question to ask is if you're comfortable without having a set schedule. Many times, I would have to tell myself to work a certain number of hours."}]]