[[{"date": "19 Jul 2023", "title": "Hiwi Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at ETH Zurich (Zürich)", "Interview Descriptions": "Informal conversation about experience up to this point and the possible project at hand as well as the academic and work background of the employer. We talked about the skills I may have that are relevant to the project as well as what other areas of research of the lab I could be interested in. The interview was very nice and engaging and gave a good overview of the scope of work as well as majority of the conditions.", "Interview Questions": "What was your technical experience at your previous job?"}, {"date": "5 May 2023", "title": "Marketing Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at ETH Zurich", "Interview Descriptions": "Two sessions: job fit and company fit. Fairly easy and pleasant. More of a conversation than an interview feel. In the company fit there was a case study, half a day on the job task that I had to present afterwards.", "Interview Questions": "Case study to solve on the spot"}, {"date": "30 Apr 2023", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at ETH Zurich", "Interview Descriptions": "None. Just apply for an open positipn early enough and if your grades were well in this lwcture you will get the job. Might help adding some previous recommendation letter.", "Interview Questions": "N/A"}, {"date": "26 Apr 2023", "title": "Internship Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at ETH Zurich (Zürich)", "Interview Descriptions": "We talked about CV, letter of motivation, and previous working experiences. As an intern, the choice of topic was very broad, leaving lots of opportunity of our choices. The interview atmosphere was great, not very strict.", "Interview Questions": "Why you chose this laboratory?"}, {"date": "19 Apr 2023", "title": "Researcher Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at ETH Zurich (Zürich)", "Interview Descriptions": "I applied for a Researcher position at the Center for Security Studies (CSS) at ETH. Unfortunately, despite my attempts to contact the designated person via email twice, I never received a response or a rejection email. \r\n\r\nRegrettably, this seems to be a recurring issue, as I previously experienced a similar lack of response from CSS. In fact, it appears that CSS has a pattern of ignoring applicants' follow-up emails and taking an unreasonably long time to send rejection emails, which is discourteous to candidates who take the hiring process seriously. \r\n\r\nAs a candidate who has been let down by the Center of Security Studies, I strongly suggest that the CSS review and improve its hiring practices. They should start to respect the ETH rules and recommendations regarding recruiting and treat candidates with the professionalism and courtesy they deserve. \r\n\r\nIn summary, be warned that the CSS's recruiting practices are subpar and that you may be in for disappointment and frustration if you apply for a position with them.", "Interview Questions": "N/A"}, {"date": "6 Apr 2023", "title": "PhD Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at ETH Zurich", "Interview Descriptions": "I had to prepare a 20 min presentation to give in front of the research group about myself and the researches I carried on during my studies. The presentation was followed by questions asked by the whole group. I then had a chance to talk to everyone individually", "Interview Questions": "They asked scientific questions about my research"}, {"date": "29 Nov 2022", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at ETH Zurich", "Interview Descriptions": "Informal discussion solely based on my academical performance. For most courses this is not competitive and quite easy to get in. Depending on the lecturer this can be kind of a technical interview, or a informal get together.", "Interview Questions": "Why do you want to teach?"}, {"date": "10 Nov 2022", "title": "PhD Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at ETH Zurich", "Interview Descriptions": "The whole process takes around 30 minutes and was conducted on zoom. There are two professors involved in the process and we started by some small talk. The overall environment and feeling are quite nice.", "Interview Questions": "Ask about previous research experience, especially related to the work of interest. Ask about my plan, proposal, and what I can contribute to the group."}, {"date": "4 Jan 2023", "title": "Doctoral Candidate Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at ETH Zurich (Zürich) in Oct 2022", "Interview Descriptions": "Der Lehrstuhl bezahlte die Reise und eine Übernachtung in Zürich, das Vorstellungsgespräch war sehr angenehm. Es bestand aus einer Präsentation sowie eines persönlichen Interviews mit Professor und Post-Doc. Das Gespräch war sehr freundlich und entspannt. Im Anschluss durfte ich noch mit Doktoranden des Lehrstuhls einen Kaffee trinken und mich informell zur Stelle austauschen, welches mir einen guten Einblick in die Arbeit und Atmosphäre am Lehrstuhl gegeben hat.", "Interview Questions": "Mussten Sie schonmal an einem langwierigen Projekt arbeiten und wie sind sie vorgegangen? Warum wollen Sie eine Dissertation schreiben?"}, {"date": "8 Mar 2022", "title": "Senior Scientist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at ETH Zurich", "Interview Descriptions": "Interview with the professor head of the group only followed by the meeting of the other group members. The interview was mostly about past research results, motivations for future research and career goals.", "Interview Questions": "Why do you apply for this position?"}], [{"date": "4 Aug 2021", "title": "PhD Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at ETH Zurich", "Interview Descriptions": "Smooth interview, found out about the facilities and the opportunities. Was asked about the research plans. Friendly staff, punctual interview. Happy to accept the offer. They were also quite adaptive of the covid situation and provide leeway in most cases.", "Interview Questions": "What I'm planning do to here."}, {"date": "25 Jun 2021", "title": "Postdoctoral Fellow Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at ETH Zurich", "Interview Descriptions": "Basic question that were from the field were asked overall it was quite easy and not difficult eventhough it is such an institute and was expecting everything to be way more difficult", "Interview Questions": "Why would you want to move to Zurich"}, {"date": "27 May 2021", "title": "Student Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at ETH Zurich", "Interview Descriptions": "Firstly, I received a paper to read and analyse following some indications they provided. Secondly, we had a Zoom meeting where we discussed my profile, my interests. The atmosphere was informal, relaxed and very encouraging.", "Interview Questions": "Talk about your background, about your bachelor thesis, the reason why I was applying to that job and my interests related to that position"}, {"date": "24 May 2021", "title": "PhD Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at ETH Zurich (Zürich) in May 2021", "Interview Descriptions": "there were two professors, who were both super nice and encouraging. it took about half an hour and was a plesant experience. Nothing too specail compared to ordinary Phd interviews.", "Interview Questions": "Tell us about yourself. ?"}, {"date": "19 Apr 2021", "title": "PhD Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at ETH Zurich", "Interview Descriptions": "3 rounds: 1. document review, 2. 1st interview with the project leaders (5-10 min long), 3. 2nd interview with the entire research group, where instead of skillset, a fit of the candidate is evaluated.", "Interview Questions": "What is the difference between false positive and false negative results?"}, {"date": "25 Nov 2020", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at ETH Zurich", "Interview Descriptions": "First, a Skype or phone call as an introductory meeting. Then, an interview in person with the Senior Researcher or Professor. You might also need to meet others within the research group, depending on the group.", "Interview Questions": "Your interests and research skills"}, {"date": "27 Jun 2021", "title": "Postdoctoral Researcher Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at ETH Zurich (Basel) in Apr 2020", "Interview Descriptions": "I applied for post doc position by submitting my document online. Then after 2-3 months I got online interview. It was general questions about my previous positions and my skills. After 1 hr I got an email and I invited to on-sight interview. In on-sight interview they asked for presentation and general discussion about their project.", "Interview Questions": "What type of skills you can bring to our lab."}, {"date": "27 Mar 2020", "title": "Student Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at ETH Zurich", "Interview Descriptions": "You simply apply by sending your application to the professors in the university directly. They, or their postdocs, contact you for a in-person meeting. The meeting is pretty chill and is designed more to realize your passion for the job. You'll receive the results soon after your interview.", "Interview Questions": "- Why project/field are you more interested to work in? \r\n- What you did choose our group? \r\n"}, {"date": "19 Feb 2020", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at ETH Zurich", "Interview Descriptions": "Short interview about my background, why I want to be a TA, and if I have ever taught before. Also, I got information how being a TA works, and what my responsibilities are.", "Interview Questions": "Why do you want to be a Teaching assistant?"}, {"date": "30 Sept 2020", "title": "PhD Student Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at ETH Zurich (Zürich) in Feb 2020", "Interview Descriptions": "The process was very relaxed, where we scheduled an interview at the University where we discussed my Master's thesis and why I would be a good fit for the program.", "Interview Questions": "What was your Master's thesis about?\r\nWhy would you be a good fit for the program? "}], [{"date": "18 Dec 2019", "title": "Organischer Chemiker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at ETH Zurich", "Interview Descriptions": "Der Vorgesetzte macht per Mail einen Termin ab an dem ich zuerst meine Interessen und bisherige Kredenzen verweisen sollte. Anschliessend wurden no detaillierte Fragen zu meinen vergangenen  Forschungen gestellt, danach war das Gespräch beendet.", "Interview Questions": "What is your experience in Organic chemistry?"}, {"date": "19 Nov 2019", "title": "Studentische Hilfskraft Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at ETH Zurich", "Interview Descriptions": "Sehr unkompliziert. Nach Einsendung der Unterlagen keine weiteren Gespräche. Sobald das Semester zu Ende geht, kann man sich auf das nächste Semester bewerben. Meistens braucht man nur ein online Formular auszufüllen.", "Interview Questions": "Die Noten mussten mitgesendet werden."}, {"date": "29 Oct 2019", "title": "Studentische Hilfskraft Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at ETH Zurich (Zürich)", "Interview Descriptions": "Ich habe mich online beworben. Ich glaube es gab viele Bewerbungen. Als ich eingeladen wurde wurde mir die Stelle genauer beschrieben und ich hatte dann die Wahl ob ich es wirklich machen möchte.", "Interview Questions": "keine"}, {"date": "1 Sept 2019", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at ETH Zurich", "Interview Descriptions": "Präsentieren einer Aufgabe in dem spezifischen Fachen, erklärungsvermögen wir analysiers. Noch zusätzlich Theorie Fragen um sicher zu stellen das sie Klar ist.  Die zwei Examinatoren sind fair. Man sollte die Aufgabe am besten Auswendig kennen, und sie live präsentieren.", "Interview Questions": "Aufgabe 1 Prüfung Teil 1 /2016"}, {"date": "5 Aug 2019", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at ETH Zurich", "Interview Descriptions": "first I send the cv and cover letter, then I had two Skype interviews. I moved for the master thesis and then I had the offer to stay as research assistant for six months", "Interview Questions": "tell me one of your strength and one of your weakness"}, {"date": "17 May 2019", "title": "Project Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at ETH Zurich", "Interview Descriptions": "I had a meeting with the research group where I wanted to work as a project assistant. I was asked a few questions and we reviewed my CV together. They made an offer in a week, and the procedure for work permit was started.", "Interview Questions": "In which projects did you work before?"}, {"date": "26 Mar 2019", "title": "PhD Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at ETH Zurich", "Interview Descriptions": "Contacted the professor directly via email, provided reference letters as requested and gave a group presentation of previous work. Then interacted briefly with other members of the group. After some waiting period, I received confirmation for job offer.", "Interview Questions": "Why I did a specific thing in the previous project"}, {"date": "2 May 2021", "title": "Admin Fachangestellter II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at ETH Zurich (Zürich) in Jan 2019", "Interview Descriptions": "In erster Runde \"klassisch\" kennenlernen (Werdegang, Motivation, Eignung, persönliche Ziele, zu erwartende Aufgaben, Arbeitsumfeld), in zweiter Runde mit Vorbereitungsaufgabe (kam am Abend vorher, der Zeitdruck war gewollt), Präsentation vor zukünftiger Chefin und HR-Mitarbeiter.", "Interview Questions": "Was lesen Sie? Wie informieren Sie sich? Wie würden Sie diesen Case lösen? "}, {"date": "14 Jun 2022", "title": "Technische Fachkraft Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 8 weeks. I interviewed at ETH Zurich in Jan 2019", "Interview Descriptions": "Good experience, direct contact with stakeholders. Questions were generally difficult but necessary to gauge the required skills. First interview with one person, after that with the team. Team interview was relatively relaxed. All via zoom.", "Interview Questions": "Write a list and a dictionary comprehension"}, {"date": "13 Dec 2018", "title": "PhD Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at ETH Zurich", "Interview Descriptions": "I was accepted for an interview with my potential supervisor based on my CV and prior experience. On the day I met him and the lab and was given an overview of potential projects and what others were working on.", "Interview Questions": "What's the mechanism of the Birch Reduction?"}], [{"date": "28 Oct 2019", "title": "Unterrichtsassistent Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at ETH Zurich in Oct 2018", "Interview Descriptions": "Kurze Vorstellrunde gefolgt von einer Beschreibung der eigentlichen Tätigkeit. Danach wurde meine Qualifikation befragt, aber da die einzige Voraussetzung das Absolvierung einer bestimmten Vorlesung war hielt sich die Befragung ziemlich in Grenzen", "Interview Questions": "Programmiererfahrungen in MATLAB"}, {"date": "28 Sept 2018", "title": "Phd Position Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 5 weeks. I interviewed at ETH Zurich (Zürich) in Aug 2018", "Interview Descriptions": "I contactd the professor. We had an informal meeting talking about the project and each others research interet. Finally, I was invited to an assessment day from 9AM to 5PM meeting almost everyone at the lab and holding a research presentation about my research. I got contacted the very next morning about their decision.", "Interview Questions": "Are you sure you want to do a PhD, do you know how frustrating it is and that you will loose 5 years of your life"}, {"date": "1 Aug 2022", "title": "Senior Researcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at ETH Zurich (Zürich) in Jun 2018", "Interview Descriptions": "Straightforward panel interview. Most of the questions asked involved expanding on my CV. In addition, I was asked about where I envisaged my research agenda developing in the next 3 to 5 years, and how this would fit into the research strengths of the institute I was applying to.", "Interview Questions": "What will be your main research foci in the next few years?\r\nHow will this compliment the existing research being undertaken at the institute?"}, {"date": "22 Dec 2017", "title": "PhD Student Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at ETH Zurich (Zürich) in Dec 2017", "Interview Descriptions": "spoke over Skype with the lab manager and PI. they were friendly and just wanted to get to know me and my work. scheduled a presentation at a lab meeting in 2 months where I will present my master's thesis.", "Interview Questions": "what is your favorite aspect of the human brain?"}, {"date": "9 Oct 2019", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at ETH Zurich (Zürich) in Aug 2017", "Interview Descriptions": "Ich musste eine Aufgabe vorlösen und dazu die Methoden erklären. Das so, wie es einem Studenten beibringen würde. Kurzes Vorrechnen. Mir wurden Fragen zu Szenarios gestellt, die auftauchen könnten während dem Unterricht.", "Interview Questions": "Was würden SIe machen, wenn ein Student das nicht versteht?\r\nWie würden sie das erklären?\r\nWieso kann man hier diese Methode nicht anwenden?"}, {"date": "17 Oct 2018", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at ETH Zurich (Zürich) in Jul 2017", "Interview Descriptions": "Das Vorstellungsgespräch bestand in drei Teilen:\r\n- Zuerst einen Programmierungstest der etwa eine Stunde gedauert hatte\r\n- Dann einen Excel-Aufgabe\r\n- Dann ei persönliches Gespräch mit dem Professor, einem PhD Studenten und einem Senior Research Associate", "Interview Questions": "- Wieso ETH Zürich, wenn Sie könnten ausserhalb der ETH mehr verdienen?\r\n- Erläuterung des Lebenslaufes\r\n- Frage nach den Programmierungskompetenzen (keiner von denen hatte eine Ahnung von Programmierung)\r\n- Was halten Sie von Zusammenarbeit?\r\n"}, {"date": "15 Jun 2017", "title": "Senior Researcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at ETH Zurich (Zürich)", "Interview Descriptions": "I had a personal interview. The offer was after 3 weeks. the Human Resource process took about 3 months to complete. This is because the position was offered in Singapore.", "Interview Questions": "career expectations. present a research plan. what would you do with 1 Million dollars?"}, {"date": "26 Mar 2019", "title": "Postdoctoral Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at ETH Zurich (Zürich) in May 2017", "Interview Descriptions": "firstly, online interview with Skype, then on site to give a presentation about my work, then personal talk about the contract , project and job requirement. expain why short time contract, and require to apply own fundings", "Interview Questions": "why you want to work on this project? "}, {"date": "30 Jul 2020", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at ETH Zurich (Zürich) in Apr 2017", "Interview Descriptions": "Short explanation on what will be expected. That was basically all it was about. Quite relaxed and friendly and not strict at all. Pre-selection already done before the interview so it was more some kind of getting to know each other.", "Interview Questions": "they didn't really ask me any questions."}, {"date": "7 Oct 2021", "title": "Post Doctoral Researcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at ETH Zurich (Zürich) in Jan 2017", "Interview Descriptions": "1 round - I was invited to give a talk and then I meet everybody from the lab (students and technicians). I had lunch with future colleagues and in the end I had a talk with professor who made me the offer.", "Interview Questions": "Normal questions: why you like the group, are you willing to relocate, salary"}], [{"date": "7 Oct 2016", "title": "Phd Student Researcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at ETH Zurich (Zürich)", "Interview Descriptions": "I was asked to prepare a presentation of the research project I had been working on. There were 3 junior and senior faculty members in the interview panel. The interview went on for about an hour testing my scientific aptitude and understanding. Then I had personal interviews with the group leaders I was interested to work with, where we had detailed discussions about their research interests and the tools and techniques they use to investigate them.", "Interview Questions": "What do you plan to do after your PhD?"}, {"date": "11 Dec 2019", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at ETH Zurich (Zürich) in Aug 2016", "Interview Descriptions": "We discussed the technical needs and overall approach to work \r\nIntelligent questions, some brainstorming and going over my CV \r\nOverall OK. \r\nIt was a good talk, with decision maker.", "Interview Questions": "Please describe your last project"}, {"date": "9 May 2017", "title": "Oberassistent Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 months. I interviewed at ETH Zurich (Basel) in Feb 2016", "Interview Descriptions": "Mein Salär hängt von Drittmitteln ab, d.h. die Anwerbung letzterer bestimmte über meine Einstellung. Da diese Anwerbung erfolgreich war, habe ich nun fuer die nächsten 3 Jahre eine Oberassistentenstelle an der ETH. Wa danach passiert weiss niemand, deshalb bin ich wieder auf Arbeitssuche.", "Interview Questions": "Wie sehen sie ihre berufliche Zukunft?"}, {"date": "5 Jan 2016", "title": "Genomics expert Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at ETH Zurich (Zürich)", "Interview Descriptions": "It was pleasant and relaxed. I was not asked about my family situation (in contrast to other jobs I have applied for in Switzerland). I think their estimation how well I would fit into the existing team was what mattered.", "Interview Questions": "What have you done in your PhD?"}, {"date": "22 Aug 2015", "title": "PhD Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at ETH Zurich (Zürich)", "Interview Descriptions": "Two rounds of Skype interview. Questions on courses and previous internships. Then visit to the lab, which included 3 rounds of interview and interaction with other members. Also included a presentation on Masters Thesis. Also explained an overview on the project topic. Questions mainly focused on core courses. Why is there a fifty word limit.?????? It is just tooo much.", "Interview Questions": "Backgoround in computer science"}, {"date": "20 May 2017", "title": "Postdoctoral Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. I interviewed at ETH Zurich (Zürich) in Jun 2015", "Interview Descriptions": "It's a 3-level interview process. The first one is submitting your credentials documents (i.e. CV, letter of intent, and references). The second is a 15-30 minutes interview over Skype. The third is a normal interview for up to 2 hours.", "Interview Questions": "- What was the thing you fascinated most about your PhD work, other than what you have mentioned in your CV or earlier interviews."}, {"date": "11 May 2018", "title": "PhD Student Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at ETH Zurich (Zürich) in May 2015", "Interview Descriptions": "very professional: first small talk, then I held a presentation for 20 minutes in the group; very clear requirements; nice food for lunch; the talk was a lot about my personality", "Interview Questions": "N/A"}, {"date": "12 May 2016", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 3 weeks. I interviewed at ETH Zurich (Zürich) in Feb 2015", "Interview Descriptions": "The guy responsible for hiring interns called me, presented the university department, told me what they do and what they expect from me and then he asked all kinds of technical questions, about software, processes, data to be used etc.", "Interview Questions": "What kind of software would you use to create maps?"}, {"date": "10 Oct 2014", "title": "Forschungsassistent Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at ETH Zurich", "Interview Descriptions": "Ich bewarb mich per E-Mail direkt beim Professor. Ich erhielt am darauf folgenden Tag eine Antwort und wurde zu einem Videointerview eingeladen. Das Interview dauerte etwa eine Stunde. Dann wurde ich nach Arbeitsproben und Referenzen gefragt. Kurz danach erhielt ich vom Professor das Angebot. Es dauerte länger, bis ich den formalen Vertrag mit der ETH erhielt.", "Interview Questions": "Nichts besonders Schwieriges, Fragen zu Forschungsinteressen, Grund meiner Bewerbung etc."}, {"date": "12 Oct 2015", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 5 days. I interviewed at ETH Zurich (Zürich) in Oct 2014", "Interview Descriptions": "Interview with the project leader at the office. First part in English, second part in German. He asked about my CV and my career goals. Then he gave me some detail about the project and project's objectives. The job involved some follow-up so he asked whether I was comfortable with phone calls in German.", "Interview Questions": "Where do you see yourself in 2 years?"}], [{"date": "11 Dec 2017", "title": "Doktorand Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at ETH Zurich (Zürich) in Jul 2014", "Interview Descriptions": "Presentation of my MSc research in front of the professors, Q&A session about the work. Presentation of the research interests of the group members, meeting with the prospective office mates.", "Interview Questions": "What was the biggest problem in your research so far? What are your current scientific interests?"}, {"date": "7 Jan 2017", "title": "PhD Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at ETH Zurich (Zürich) in Jun 2014", "Interview Descriptions": "Very much focused on my past research projects, the techniques i learned, and trying to figure out in what depth i had understood all of the projects that i had worked on. Then mostly focused on why i wanted to go into that specific area, and how my past experience have equipped me to embark on a PhD.", "Interview Questions": "Why ETH?\r\nWhy this [insert specific field]?\r\nTell me why you want to do a PhD.\r\nMany technical questions about past research projects."}, {"date": "20 Jun 2014", "title": "Verwaltungskoordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at ETH Zurich (Basel) in Jun 2014", "Interview Descriptions": "Ich erhielt ein Interview-Paket mit Ort und Datum, sowie E-Mail-Adressen und Telefonnummern meiner Interviewer, im Falle von Fragen.\n\nDas Interview war sehr gründlich, professionell und hatte eine großartige informelle Atmosphäre.\n\nAlles in allem waren die Belegschaft und die Interviewer freundlich und es ging eine sehr gute Stimmung vom Betrieb, den Menschen und vom ETH-Institut in Basel aus.", "Interview Questions": "Eingehende Kenntnisse darüber, der EU-Kommission Berichte vorzulegen, waren vonnöten."}, {"date": "7 Dec 2015", "title": "Doktorand Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at ETH Zurich (Zürich) in Jun 2014", "Interview Descriptions": "Es gab zunächst mehrere Skype-Interviews, in denen sehr spezifisch fachliche Inhalte geprüft wurden. Anschliessend wurde ich zu einem Vorstellungsgespräch vor Ort eingeladen, indem zunächst weiterhin mein Wissensstand getestet wurde. Anschliessend durfte ich vor der ganzen Gruppe eine Präsentation halten. Während des Tages hatte ich die Gelegenheit mit weiteren Mitarbeiter zu reden. Die Atmosphäre war generell jedoch locker.", "Interview Questions": "Warum bewirbst du dich bei uns?"}, {"date": "16 Oct 2015", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at ETH Zurich (Zürich) in Apr 2014", "Interview Descriptions": "It was first personal interview expirience, but went well smooth. As the interview was for a intern position within academia, the whole process did not take long and was solely based on related background knowledge check.", "Interview Questions": "A question specific to the field of the applied position"}, {"date": "26 Mar 2014", "title": "Wissenschaftlicher Mitarbeiter Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. The process took 4 weeks. I interviewed at ETH Zurich", "Interview Descriptions": "Das Interview war sehr einfach. Gleich am nächsten Tag wurde mir die Stelle angeboten. Die typischen Fragen, die zu erwarten waren - Inhalt Ihrer Studien, wie werden Sie sich in die Arbeitsumgebung einfügen, was bringen Sie dem Projekt etc.", "Interview Questions": "Keine unerwarteten Fragen, aber ständige Suche nach Schwachstellen."}, {"date": "31 May 2018", "title": "PhD Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at ETH Zurich (Zürich) in Mar 2014", "Interview Descriptions": "1 Woche nach Bewerbung, Aufforderung  ein 2-seitigen Forschungsplan zum Thema zu schreiben,\r\ndann einladung zum Interview\r\n2 persönliche Interviews, Motivation ist das wichtigste\r\nPräsentation vor der Gruppe halten plus Fragen (30 min)\r\nOnline Psychometrietest und quantitativen Test\r\nReferenzen werden überprüft", "Interview Questions": "Motivation wird überprüft. Die muss maximal stimmen"}, {"date": "7 Feb 2014", "title": "Postdoc-Wissenschaftler Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 months. I interviewed at ETH Zurich", "Interview Descriptions": "Der gesamte Prozess lief sehr effizient und professionell ab. Die Bewerber werden zuerst von der HR-Abteilung gefiltert. Dann werden die Portfolios der verbleibenden Kandidaten an den Professor geschickt, der die wenigen Topkandidaten (üblicherweise 3-5) auswählt, die schließlich zu einem Interview eingeladen werden.", "Interview Questions": "Was war die schwierigste Situation, mit der Sie in Ihrem letzten Projekt konfrontiert waren, und wie sind Sie damit umgegangen?"}, {"date": "19 Apr 2016", "title": "Postdoctoral Researcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at ETH Zurich (Zürich) in Feb 2014", "Interview Descriptions": "It was a skype interview with my future boss. The interview was conducted for 30 min or so in English. We talked about my background (from university) to current research interests.", "Interview Questions": "What's my research interest? What's my founding situation? Why did I choose the lab? What kind of skill sets, expertise, and technology can I bring?"}, {"date": "25 Jul 2014", "title": "Doktorant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at ETH Zurich (Zürich) in Feb 2014", "Interview Descriptions": "Erster Schritt: Ich habe einen Professor direkt angesprochen (Anschreiben als E-Mail, plus Lebenslauf im Anhang), und fragte nach einer freien Stelle. Zweiter Schritt: persönliche, größtenteils informelle Treffen - Einzeltreffen mit jedem Mitglied der Forschungsgruppe. Dritter Schritt: Ich hielt eine Präsentation (Thema: freie Wahl, aber zu einer früheren Arbeit) vor der ganzen Forschungsgruppe, dann wieder Einzeltreffen.", "Interview Questions": "Was ist die größte wissenschaftliche/technische Frage für mich, die ich gerne im Laufe meines Lebens beantworten/lösen möchte - vielleicht auch unabhängig von einem tatsächlichen Promotionsantrag."}], [{"date": "19 May 2016", "title": "PhD Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at ETH Zurich (Zürich) in Jul 2013", "Interview Descriptions": "Email to the professor -> Interview with presentation of previous research with research group -> Individual interview on possible research field with professor -> Offer of a position\r\n\r\nThe only issue experienced was that the reply to the inital email took quite a long time as the professor is quite often very occupied.", "Interview Questions": "General knowledge on the research field"}, {"date": "15 Dec 2017", "title": "PhD Student Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at ETH Zurich (Zürich) in Jun 2013", "Interview Descriptions": "0. Apply to a professor of your choice\r\n1. Personal meeting with potential supervisor\r\n2. Giving a 30 min presentation about previous work, e.g. MSc thesis\r\n3. Meet the head of department who asks harder questions", "Interview Questions": "Assuming knowledge of asymptotic constants in the error estimate of FEM (wrt meshwidth), find an optimal meshwidth which minimizes a cost function of the type error*computational cost"}, {"date": "6 Mar 2017", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at ETH Zurich (Zürich) in Jun 2013", "Interview Descriptions": "I first got a phone interview with a senior in the chair, then in the second round, they organize a skype meeting with some of the group members. The group members include several Phd students, the professor and two senior researchers. In the first interview, just some general questions to make mutual introduction. Second includes some questions regarding the master thesis.", "Interview Questions": "what is the subject of your master thesis?\r\nwhat is the methodology in your research?\r\nWhat skills do you think you can bring for the new research?\r\nDo you have some idea about our research interests?"}, {"date": "30 May 2017", "title": "POst-doc Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at ETH Zurich (Zürich) in May 2013", "Interview Descriptions": "Suite a  ma candidature spontanée au Professeur de laboratoire de recherche via le site internet de ETH zurich. Le premier contact, fut qu'il me réponde par email et me fixe un entretien telephonique suivi d'une invitation pour visiter le laboratoire.", "Interview Questions": "Questions techniques sur le poste"}, {"date": "28 Aug 2016", "title": "PhD Student Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at ETH Zurich (Zürich) in Apr 2013", "Interview Descriptions": "THe interview process was quite simple but one has to prepare in advance for some trickz questions.  They asked about my skills gained during my masters and bachelors studies and how u can correlate the present research work.", "Interview Questions": "why do u want to choose ETH"}, {"date": "16 Feb 2017", "title": "PhD Candidate Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at ETH Zurich (Zürich) in Mar 2013", "Interview Descriptions": "Very smoothly. I contacted a potential supervisor, then was invited to visit the group and to give a talk. after that I had a 1:1 interview where I had to elaborate on the future topic of my PhD", "Interview Questions": "Research during your masters degree"}, {"date": "3 Mar 2013", "title": "Doktorant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at ETH Zurich (Zürich) in Feb 2013", "Interview Descriptions": "Mein anfänglicher Plan war es, für die Promotion (ee@ETHZ) in meiner momentanen Abteilung zu bleiben, mein Doktorvater bestand allerdings darauf, dass ich mich für mehrere Stellen bewerbe, um meine Chancen zu steigern. Zufällig stolperte ich über eine offene Stelle für ein Projekt bezüglich eines Synthetic Aperture Radars, eine meiner heimlichen Leidenschaften. Da das Stellenangebot schon fast zwei Monate alt war, kontaktierte ich den Anbieter über E-Mail um herauszufinden, ob die Stelle noch verfügbar sei. Sie ermunterten mich, mich zu bewerben, und baten mich, ein Bewerbungsschreiben und eine kurze Stellungnahme zu meinen Forschungsinteressen zu verfassen. Zwei Wochen später wurde ich per E-Mail zu einem Interview vor Ort eingeladen. Zufälligerweise war das ein EE Student in der gleichen Schule, daher war es kein Problem, die ganze Forschungsgruppe für einen Nachmittag zu treffen. Erst traf ich mich mit dem Professor und einem Senior Wissenschaftler. Sehr nette Leute, wir haben kurz über meine momentane Situation gesprochen, meine Motivation, zu promovieren und meine Pläne. Man sagte mir bereits, dass ich der einzige Student des ETHZ sei und meine Chancen gut stünden. Anschließend gab ich eine kurze Präsentation meiner vorangegangenen Forschungserfahrung und eine höchst inspirierende Fragerunde. Schließlich bekam ich die Gelegenheit, mit einigen anderen Doktoranden und Post Doktoranden über ihre aktuellen Forschungen zu sprechen. Man bat mich, eine Woche auf ihre Entscheidung zu warten, und anschließend bekam ich ein Angebot.\n\nAlles in allem hatte ich einen sehr guten Eindruck. Ich brauche wohl nicht sagen, dass ich das Angebot angenommen habe. \n\nUpdate: Wir haben über meine Arbeitsbedingungen gesprochen. Das Projekt fängt im Juni an. Ich werde mehr schreiben, sobald ich anfange zu arbeiten.", "Interview Questions": "Warum wollen Sie promovieren? Wissen Sie, dass man als Ingenieur in der Branche viele gut bezahlte Jobs bekommen kann?"}, {"date": "25 Jan 2017", "title": "PhD Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at ETH Zurich (Zürich) in Jan 2013", "Interview Descriptions": "Ein nettes Gespräch über das bisherige Studium und über mögliche neue Projekte. Sehr freundliche und lockere Atmosphäre. Es kamen keine unangenehmen Fragen oder Provokationen vor. Stattdessen wurden die Forschungsgruppe vorgestellt und mögliche Themen für die Doktorarbeit vorgeschlagen und erläutert. Anschließend erhielt ich einige Forschungsartikel zum Durchlesen, die einerseits dazu dienten, sich detailierter mit den Forschungsthemen auseinanderzusetzen, andererseits dienten sie als Entscheidungshilfe für mögliche Projektthemen.", "Interview Questions": "Für welches Projekt würden Sie sich am meisten interessieren?"}, {"date": "26 May 2013", "title": "Forschungsassistent Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 5 days. I interviewed at ETH Zurich (Zürich) in Nov 2012", "Interview Descriptions": "kurzes Gespräch mit dem Professor", "Interview Questions": "die Frage betraf meine zukünftige Arbeit und was schon veröffentlicht ist"}, {"date": "6 May 2014", "title": "Doktorant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at ETH Zurich (Zürich) in Jul 2012", "Interview Descriptions": "Bewerben Sie sich schriftlich. Wenn sie Interesse haben, bitten sie Sie zum Vorstellungsgespräch. Bei Zufriedenheit beginnt der Einstellungsprozess.", "Interview Questions": "Konzeptionelle Fragen, die Sie vielleicht während der experimentellen Arbeit nicht so sehr wahrnehmen, Ihr Beitrag und was von Ihrer Seite innovativ war. "}], [{"date": "15 Feb 2014", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at ETH Zurich (Zürich) in Apr 2012", "Interview Descriptions": "1) Erstes Interview: Einführung und Kennenlernen\n\n2) Schicken Sie den Motivationsbrief so ab, dass er zu der Stellenbeschreibung passt (was Sie beitragen können)\n\n3) Zweites Interview: Fachkenntnisse werden überprüft und getestet", "Interview Questions": "Technische Fähigkeiten am Mac."}, {"date": "13 Oct 2015", "title": "PhD Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at ETH Zurich (Zürich) in Nov 2011", "Interview Descriptions": "Direct interview at the place, no phone interview beforehand. Meeting with the PhD advisor and 2 colleagues. No HR. Powerpoint presentation from Master studies in front of panel, followed by questions and discussions. Then discussion about the project related to the PhD position.", "Interview Questions": "What are your ideas about the phd project ?"}, {"date": "18 Feb 2015", "title": "Doktorant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at ETH Zurich (Zürich) in Nov 2011", "Interview Descriptions": "Zuerst ein etwa halbstündiges Telefoninterview. Ich wurde eingeladen, anschließend ins Labor zu kommen. Alle Ausgaben wurden bezahlt. Gespräch mit dem Supervisor und allen Mitgliedern der Gruppe sowie mit einigen anderen PIs aus dem Institut. Präsentation der Masterthese vor dem gesamten Institut. Sehr informell.\n\n\nDie Personalabteilung oder ähnliches waren nicht dabei. Keine Verhaltensfragen. Nur ein nettes Gespräch.", "Interview Questions": "Technische Fragen zu vorangegangener Forschung. Motivation."}, {"date": "1 Jul 2014", "title": "Doktorant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at ETH Zurich in Sept 2011", "Interview Descriptions": "An der ETH promoviert man nach dem kontinentalen europäischen System. Im Gegensatz zu dem angelsächsischen System, bei dem man den Bachelor-Abschluss macht und sich dann an einer Hochschule bewirbt, um anschließend einige Jahre in der Forschung zu verbringen, muss man an der ETH einen Master mitbringen, um promovieren zu können. Die Promotion selbst beinhaltet keine Kurse oder Qualifikationen, sondern besteht rein aus der Forschungsarbeit. Man bewirbt sich normalerweise direkt beim Professor, den man sich als Betreuer seiner Doktorarbeit wünscht.", "Interview Questions": "Im allgemeinen werden Sie dazu aufgefordert, eine Präsentation zu einem Thema Ihrer Wahl - typischerweise Ihrer Masterarbeit - zu halten."}, {"date": "18 May 2014", "title": "Postdoc-Wissenschaftler Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at ETH Zurich (Zürich) in Jan 2011", "Interview Descriptions": "Habe ein Angebot per E-Mail bekommen, aufgrund von Publikationen und weil ich den Professor auf Tagungen getroffen hatte. Wurde dann eingeladen, um einen Vortrag über meine Forschungen zu halten, und diskutierte mit dem Professor über ein kommendes Projekt. Wir sind auch mit ein paar Promotionsstudenten und Post-Docs mittagessen gegangen.", "Interview Questions": "Es wurden keine besonderen Fragen gestellt, nur die übliche wissenschaftliche Diskussion."}, {"date": "9 Sept 2012", "title": "Doktorant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at ETH Zurich (Zürich) in Nov 2010", "Interview Descriptions": "Normalerweise müssen alle Kanditaten für  nach Zürich kommen um sich dem letzten Interview zu stellen.", "Interview Questions": "Der schwierigste Teil von Zürich oder ETH Zürich ist es, das Wohnungsproblem zu lösen"}, {"date": "30 Jul 2013", "title": "Doktorant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 months. I interviewed at ETH Zurich (Lugano) in Sept 2009", "Interview Descriptions": "Habe eine Anfrage per E-Mail geschickt, mit einer Empfehlung von einem der Angestellten.\n\nWurde zum persönlichen Vorstellungsgespräch eingeladen. Gruppenseminar. Gespräch mit den Angestellten des Labors. Am Ende Gespräch mit dem Vorgesetzten des Labors.", "Interview Questions": "Technische Frage zum Seminar"}, {"date": "26 Nov 2012", "title": "Postdoc-Wissenschaftler Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at ETH Zurich (Zürich) in Aug 2009", "Interview Descriptions": "Erst E-Mails und ein Skype Interview, dann der Flug nach Zürich für ein persönliches Interview und ein Vorstellungsgespräch", "Interview Questions": "Warum Ihr derzeitiges Umfeld verlassen?"}, {"date": "13 Jun 2013", "title": "Doktorant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at ETH Zurich (Zürich) in Jun 2009", "Interview Descriptions": "Der Einstellungsprozess variiert von einer Abteilung zur anderen, möglicherweise sogar von Gruppe zu Gruppe, In meinem Fall gab es ein Gruppengespräch über meine Masterarbeit (etwa eine Stunde mit Fragen), dann 5 separate Gespräche mit meinem (zukünftigen) Vorgesetzten und mit Kollegen. Die Gespräche waren einfach Unterhaltungen, eigentlich flossen Informationen in beide Richtungen. Die wenigen technischen Fragen, die man mir stellte, bezogen sich auf meine Masterarbeit, demnach waren sie nicht wirklich schwierig.", "Interview Questions": "N/A"}, {"date": "18 Jun 2013", "title": "Postdoc-Wissenschaftler Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at ETH Zurich (Zürich) in Feb 2009", "Interview Descriptions": "Ich wurde von allen Mitgliedern der Gruppe interviewt (jeweils 1 Stunde lang) und dann vom Professor. Ich stellte meine vorhergegangenen Arbeiten vor. Die Vorstellungsgespräche waren hauptsächlich über ihre Arbeit und ein bisschen über meine; es wurde sehr schnell fachlich.", "Interview Questions": "N/A"}], [{"date": "31 Aug 2012", "title": "Doktorant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at ETH Zurich (Zürich) in Jun 2008", "Interview Descriptions": "Schriftliche Bewerbung, Vorstellung auf einer Konferenz, danach Einladung an die ETH Zürich zum 4-Augen-Vorstellungsgespräch. Einen Monat später bekam ich die Stelle.", "Interview Questions": "Modellierungskompetenz"}]]