[[{"date": "5 Dec 2022", "title": "Resident Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Bridgewater State University", "Interview Descriptions": "Apply through an easy application that can be done online, attend at least one information session (they provide 3-4 different sessions of different times), see if you receive a call and/or email to schedule an interview, then go in for an interview.", "Interview Questions": "How would you handle a difficult situation between two roommates?"}, {"date": "8 Nov 2022", "title": "Intern Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Bridgewater State University", "Interview Descriptions": "one round interview with a phone screening. Simple behavioral questions like \"tell me about yourself,\" \"what are your interests,\" \"what was your favorite class in college.\" Just prep with a friend and you should be good to go for the interview.", "Interview Questions": "Tell me about yourself What are your interests Why Bridgewater state"}, {"date": "16 Jan 2023", "title": "Marketing Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 4 months. I interviewed at Bridgewater State University (Bridgewater, MA) in Jun 2022", "Interview Descriptions": "It is a state university, so as with all state jobs, it can take several months for each phase of the interview process, which makes it challenging if applying to other places.", "Interview Questions": "What does Diversity, Inclusion and Equity mean to you?"}, {"date": "5 Feb 2021", "title": "Math Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Bridgewater State University", "Interview Descriptions": "The interview process was very smooth and seamless. The interviewer had a way to make me feel comfortable and seemed to care about making me feel at ease. They were conversational and cordial but also stuck to the main poinits they wanted to address.", "Interview Questions": "Tell me of a situation where you had to mediate colleagues."}, {"date": "14 Nov 2019", "title": "Event Planner Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Bridgewater State University", "Interview Descriptions": "I was interviewed by three event consultants who took turns asking questions. We sat in the office during a slower time for the interview and once the interview was over, I was allowed to ask questions just like any other interview.", "Interview Questions": "Name a time you were in a difficult situation  with a customer. "}, {"date": "19 Jan 2020", "title": "Web Designer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Bridgewater State University in Nov 2019", "Interview Descriptions": "I was told that I was a finalist in their interview process, and they asked me to do a phone interview.  Let me emphasize this was not with headhunters, this was with the actual people I'd be working with. Coworkers and boss.  I thought it was pleasant and cordial.", "Interview Questions": "Standard interview questions. I am posting this to let you know that after the phone interview I was told they would let me know what my status is, if i'd be moving to the in person interview or not.  They even told me the day they would get back to me. Well I never heard from them again. \r\nIn a way it's a good thing I didn't get this job. They've proven what \"professionals\" they are . I can only imagine what they are like to work with on a daily basis.  Just be aware of this if you apply."}, {"date": "3 Oct 2019", "title": "Visiting Lecturer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Bridgewater State University (Bridgewater, MA) in Jul 2019", "Interview Descriptions": "Dress business casual. Meet with the dean of the college you prepare to lecture for. The dean was very sweet and kind. Asked questions in regards to you as a person to get to know you a bit. Then goes on to see what type of person you are and why you are interested in teaching", "Interview Questions": "Q: Tell me why you would like to teach"}, {"date": "6 Feb 2019", "title": "Academic Coach Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Bridgewater State University (Bridgewater, MA) in Jul 2018", "Interview Descriptions": "To the point if you do research on the company ahead of time and have a strong belief with the school and its values. Takes a few days or weeks depending on the deadline of the application and when theyre looking to start people by.", "Interview Questions": "What were your difficulties in undergrad and how will that contribute to your role here?"}, {"date": "17 Feb 2016", "title": "Event Coordinator Role Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Bridgewater State University (Bridgewater, MA) in Feb 2016", "Interview Descriptions": "I had a phone interview with 6 people on the line interviewing me. The whole process was horribly done by the interviewers. It was like I was talking to a bunch of robots the whole time and they each went around and asked one question. The questions were fairly easy but I felt very rushed. They did not leave me enough time to ask them questions therefor the whole process was unprofessional, felt \"scripted\" and very rushed.", "Interview Questions": "How would you describe your management style and provide an example."}, {"date": "29 Jul 2015", "title": "Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Bridgewater State University (Bridgewater, MA) in Mar 2015", "Interview Descriptions": "Asked about my experience and knowledge on the topic. Needed a reference from professor and transcript submission. Spoke with professors who ran the whole process. Was told the process of what to expect from the job and what we will be doing as an tutor. Explained the risks that come with the job and what are unacceptable.", "Interview Questions": "What is your schedule?"}], [{"date": "5 May 2014", "title": "Web Developer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Bridgewater State University (West Bridgewater, MA) in Dec 2013", "Interview Descriptions": "First I had a phone interview then I was later called in for a formal interview. I was brought to a conference room with the hiring manager and one other person from the team as well as a couple other people from other departments. I was asked a series of questions and then had to explain and go over the work that I have done. After the interview was over they advised they would let me know if I got the job or not but the process can take months because it is an university.", "Interview Questions": "There was no difficult or unexpected questions it was pretty straight forward."}, {"date": "22 Jan 2013", "title": "Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Bridgewater State University (Bridgewater, MA)", "Interview Descriptions": "You fill out a simple application, and they schedule one interview with you.", "Interview Questions": "What do you feel most students struggle with in this subject?"}, {"date": "30 Jan 2016", "title": "Assistant Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Bridgewater State University (Bridgewater, MA) in Feb 2012", "Interview Descriptions": "Typical multi-day academic interview consisting of meetings with faculty, students, dean, and teaching/research presentations. Very busy interviews - be ready to discuss details of your pedagogy and how you can meaningfully include students in your research work.", "Interview Questions": "Suppose you gave an exam and over 50% of the class failed. What would you do?"}, {"date": "24 Feb 2013", "title": "Assistant Professor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Bridgewater State University in Feb 2012", "Interview Descriptions": "Long day but the staff was helpful and friendly.", "Interview Questions": "How do you feel about the area?"}]]