[[{"date": "19 Jun 2023", "title": "Machine Learning Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Wadhwani Foundation (New Delhi) in Jun 2023", "Interview Descriptions": "5 rounds: 1) Screening: Basic screening 2) ML foundations: ML algorithms, probability distributions, ML concepts. 3) ML Systems design: Case studies and grilling on system design 4) Coding: Coding round 5) AIMLE round: Probing on previous experience, approaches, contributions and results 6) Culture fit: Ambition, past exp., expectations etc.", "Interview Questions": "few Questions and case studies in ML system design approach. ML algorithms, probability distributions, ML concepts. coding k-means from scratch in object oriented fashion. resume based probing coding a back propagation for a function bag of words( leet code )"}, {"date": "15 Apr 2023", "title": "Bussiness analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Wadhwani Foundation (New Delhi)", "Interview Descriptions": "1st round aptitude 2nd paper pen code technical round for 3rd round 4th one is HR round you need to have good coding skills to get this job, they offer a good salary and good benefits", "Interview Questions": "very great interview to attend"}, {"date": "9 Jun 2023", "title": "ML Engineer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Wadhwani Foundation (Hyderābād) in Mar 2023", "Interview Descriptions": "first round was a online test which is complete proctored test and then people got filtered out from that round then follows second round it is technical interview where complete ml and deep learning topics were discussed then third round is another technical round where ml and deep learning topics were tested with some basic code", "Interview Questions": "what bagging and boosting in random forest?"}, {"date": "16 May 2022", "title": "Program Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Wadhwani Foundation", "Interview Descriptions": "1st round was of a assignment submission. The assignment was to do analysis and visualization of a dataset\r\n2nd round - interview with associate director\r\n3rd round - interview with program head", "Interview Questions": "Questions were based on assignment submission and skill level around the required skills like Excel, PPT others and people management"}, {"date": "3 May 2023", "title": "Business Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Wadhwani Foundation in Mar 2022", "Interview Descriptions": "It all depends on how confident you are! 1st round was more of an interaction than an interview. Just be positive and honest. Second round had technical questions based on SQL and AI. They were of basic level.", "Interview Questions": "No technical questions in 1st round. Basic topics about SQL and AI were asked. Most of the interview was about communication skills."}, {"date": "11 Mar 2021", "title": "Assistant Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Wadhwani Foundation", "Interview Descriptions": "The interview process comprised of technical, HR rounds. The HR coordinated it well over phone/in person. There was a written test, a discussion with manager for technical, followed by 2-3 HR rounds.", "Interview Questions": "Instructional Design, ADDIE model, Past work experience"}, {"date": "25 Jan 2021", "title": "Consultant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Wadhwani Foundation (New Delhi) in Oct 2020", "Interview Descriptions": "A peculiar experience! \r\nAfter wasting time in 3 detailed interviews, they realised my experience is way higher than the position I applied for hence they shortlisted someone with less experience. \r\n\r\nActually, in my opinion, all the rounds were good and promising but guess, my current salary was the bottleneck and have been able to find resources with fewer packages would have helped them. \r\n\r\n1 advice, please ensure that you're not wasting candidate's time in unnecessary rounds, even if there's 1 untick in the checklist of the desired candidate that you could spot at the beginning of the conversation then it's a no. That will save a lot of efforts on yours as well as on the candidate's end.", "Interview Questions": "Interview process - \r\n1. Peer round - to understand the background and role fitment. \r\n2. Hiring Manager round - to deep-dive on the work done and again, role fitment. \r\n3. Round with 1 of the founding/executive committee/counsellor - mostly on the cultural fit and behavioural round. "}, {"date": "11 Feb 2020", "title": "Product Role Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 3 months. I interviewed at Wadhwani Foundation", "Interview Descriptions": "They posted on a premium networking group on Facebook saying they are hiring fast for various roles- applied through the website, as instructed, and didn’t hear back for 3 months till I requested for an update. Email response cc’d another HR representative who’d handle my application to discuss “next steps”,  but no response for a couple of days again. After finally hearing back from them about the interview day and time, it is rescheduled again until the next day (without formal communication confirming so). Interview the day after was pretty standard followed by tentatively scheduling  the next call with their product manager for the end of the week. Followed up asking about the meeting time and day with the product manager and timeline for their hiring process, but no response ever since.\n\nHighly unprofessional and pretty disappointing considering they seemed to be working on some really cool projects.", "Interview Questions": "Tell us about your background, why you want to work with us etc"}, {"date": "6 Jun 2019", "title": "Fundraising Manager Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Wadhwani Foundation (Mumbai) in May 2019", "Interview Descriptions": "Rigorous hiring process  - first with a recruitment agency, then over separate calls with HR and function manager, followed by in-person interviews with function heads (one of whom actually seemed ill-prepared). I was due to have a call with another function head which was postponed twice and was then told I could meet him in person. I was then made to wait at the office for over 2.5 hours for a scheduled interview with this individual, after which I was told he was busy! \r\nAlso while the initial role was for fundraising, over the course of the interview process it became evident that fundraising was only a tiny part of it, and a majority of the work would encompass communications and PR.", "Interview Questions": "Come up with an outreach strategy for the organisation's varied target audience, what would you change on the website, what experience do you have with podcasts and videos"}, {"date": "18 Feb 2020", "title": "Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 days. I interviewed at Wadhwani Foundation (Bengaluru) in Feb 2017", "Interview Descriptions": "1st F2F by HR, Next Manager Technical.\r\nThey want to know how good your with business mindset with Engineering background.\r\nWadwani helps the startup company to set their goals. so they want someone how have vision and goal.", "Interview Questions": "Tell Me about Yourself?"}], [{"date": "21 Dec 2017", "title": "Web Content Manager Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 2 months. I interviewed at Wadhwani Foundation (Bengaluru) in Feb 2017", "Interview Descriptions": "The position I was hired for and what i was filled in for were different. The ceo who took my interview was ousted 1 month after i joined. People who interviewed me didnt had any clarity. They kept on digging about my skill but ultimately ely gave a different position and post.", "Interview Questions": "You have to manage multiple work under tight deadlines. "}, {"date": "17 Mar 2017", "title": "Senior Associate - NEN Ecosystem Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Wadhwani Foundation (Bengaluru) in Jan 2017", "Interview Descriptions": "I had a single round of interview after the initial reference/introduction mail from a colleague. I met the VP and Senior associate of the NEN ecosystem for the interview. It was a very informal and calm in terms of knowledge and skill queries but focused more on understanding and enthusiasm to work in building a vibrant startup culture.", "Interview Questions": "Tell us about your work experience in terms of startup ecosystem and entrepreneurship?"}, {"date": "4 Aug 2017", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. I interviewed at Wadhwani Foundation (Bengaluru) in Jun 2015", "Interview Descriptions": "The interview process was long but easy.First they told me I would have a telephonic round. Everytime they would schedule a time and no one would call. The HR has a very lackadaisical nature. You need to keep following up to get an answer. My process took two months.", "Interview Questions": "Interview was very general , a Telephonic round and then face to face. It was all revolving around the CV."}]]