[[{"date": "24 Aug 2022", "title": "IT Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Ipas", "Interview Descriptions": "First there was a scheduled call to discuss my experience and technical skills. Next we scheduled an interview on site to meet the team and managers. Meeting lasted around an hour and half.", "Interview Questions": "Job experience, technical questions and review with dept. manager."}, {"date": "28 Oct 2021", "title": "Senior Advisor Accessibility Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Ipas (Kampala)", "Interview Descriptions": "It was very interesting. But one of the most lengthy interview processes I have ever gone through. They must have been about five interviews at least. Mostly pleasant experiences. I was interviewed by teams from different countries. My real challenge was on the assignment (after I was hired); too much condescending attitude from the American based staff", "Interview Questions": "Its been a while since but they focused on difference aspects in different interviews: Technical character fitness, goals, etc."}, {"date": "10 Mar 2021", "title": "Program Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Ipas (Chapel Hill, NC) in Nov 2018", "Interview Descriptions": "Fairly straight forward interview process. Screening round with HR and then an all-day interview with several different members of the unit including lunch. Standard interview questions and I appreciated getting to meet multiple people in the organization. Going to lunch is always awkward during an interview so I don't think there's any way around that!", "Interview Questions": "What is your overseas experience?"}, {"date": "10 Aug 2020", "title": "Communications Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Ipas (Nairobi) in Mar 2018", "Interview Descriptions": "Very short, It was a panel of potential supervisors who were very nice and kind and gave me a safe space to express myself.\r\nThe wait time was also short as they had allocated me a specific time for the interview. I however did not manage to go further because i was not specifically accademically qualified for the position as i only had the experience.", "Interview Questions": "How did I overcome a challenge?"}, {"date": "18 Apr 2018", "title": "Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Ipas (Chapel Hill, NC) in Jun 2017", "Interview Descriptions": "Very friendly and engaging. Too many rounds from administrative staff to senior management.   The interview was in stages  ranging from  team members to technical units  and finally management. Questions asked by each team were similar and focused on team fit, knowledge of subject areas , leadership skills and the organization itself", "Interview Questions": "Describe a challenging situation and how did you handle it"}, {"date": "4 Feb 2015", "title": "Senior/Executive Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 4 weeks. I interviewed at Ipas", "Interview Descriptions": "Interview process was an all day affair.  Communication to candidates is very poor. Pay-scale for Senior and Executive positions below average.  Difficult to see an aggressive Senior/Executive be happy in this company.", "Interview Questions": "All standard questions.  Nothing outside the box.  "}, {"date": "11 Aug 2013", "title": "Program Associate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Ipas (Chapel Hill, NC)", "Interview Descriptions": "Phone interview followed by a series of very positive in-person interviews. I was very well qualified for the position. After interviews with program team, HR, and others, all of which went well, I was then kept waiting for more than four weeks before I gave up hope. Repeated (though reasonable) attempts to contact the hiring manager for an update were met with silence. Never heard anything concrete and I've since gone elsewhere. I was extremely put off by how the whole thing was handled. Extremely unprofessional. If that's how they treat potential employees, I'd hate to be an actual employee.", "Interview Questions": "N/A"}, {"date": "15 Aug 2013", "title": "Associate Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Ipas (Chapel Hill, NC)", "Interview Descriptions": "Expect a long process for phone interviews, week by week before hours (1-2 days depending on the level of the job) of face to face panels with every team member and linked staff in NC. Staff will be candid about the job including the challenges in the organization and team. Staff told me between 7 - 22 people interviewed them before being hired!", "Interview Questions": "With multiple one-on-one and panels of interviews, expect anything. From people who have not even read your CV and expect you to ask them questions, give you advice on the area (before you have an offer), to series of challenging behavioral situations from staff googling before they see you."}]]