[[{"date": "3 Feb 2023", "title": "Sales Associate/Cashier Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Houston System (Houston, TX) in Jul 2022", "Interview Descriptions": "The interview was through a phone call. The person asked questions relating to my experience. It was an easy interview and took no longer than about 10 minutes. . . .", "Interview Questions": "Have I worked at a retail store before?"}, {"date": "3 Nov 2021", "title": "IT Support Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at University of Houston System", "Interview Descriptions": "Interview was easy, used standard questions.  interview took place with 3 people in room. Tell me about yourself. What are your strengths, weaknesses? What do you study? When do you graduate?", "Interview Questions": "Tell me about yourself. What are your strengths and weaknesses. "}, {"date": "22 Jul 2021", "title": "Assitant Professor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at University of Houston System", "Interview Descriptions": "Initially, there was a phone interview, followed upon by email to invite for a campus interview.\n\nThe interview process was well planned,  and it was thorough.\n\nIt included meeting with existing faculty with complementary research areas, teaching-focused, and also faculty from other departments. \n\nIt also included a research seminar.", "Interview Questions": "Interview questions were too many to list here. But they were mostly standard questions one would be asked during an assistant professor job interview."}, {"date": "19 Oct 2021", "title": "Service Desk Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Houston System (Houston, TX) in Jul 2021", "Interview Descriptions": "Submitted my resume and received an interview in 2 weeks. The interview was easy and more related to your service experience and how do you solve solution. They gave me a couple of situation and ask me what I would do.", "Interview Questions": "What you will do if the patron ask for help but do not know exactly answer? "}, {"date": "21 Mar 2021", "title": "Administrative Role Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at University of Houston System", "Interview Descriptions": "Apply, they call or email, schedule and see them via zoom .  From there, they contact you via email if you are declined, that alone took about 3 weeks by the time they go through background checks etc.", "Interview Questions": "Why do you want to work here?"}, {"date": "25 Jan 2021", "title": "Physics Ph D Teaching Assistantship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at University of Houston System (Houston, TX) in Jan 2021", "Interview Descriptions": "The interview looks at past research experience, future research plans, and undergraduate curriculum. I did get questions specifically asking for the topics covered in certain physics courses. The interviewers were very willing to answer any questions about the program.", "Interview Questions": "\"Describe the upper division physics courses you took in undergraduate school.\" "}, {"date": "23 Mar 2022", "title": "Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at University of Houston System (Houston, TX) in Aug 2020", "Interview Descriptions": "Panel interview. Asked normal hr questions, they describe the position, ask you challenging questions about yourself. They ask about your experiences, what you would do in the role, etc. will walk you through premises and how the role fits in the organization", "Interview Questions": "Tell us about yourself \nAre you bilingual \nDo you work well under pressure \nWhat are your thoughts on customer service "}, {"date": "31 Jan 2021", "title": "Graphic Designer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at University of Houston System (Houston, TX) in Feb 2020", "Interview Descriptions": "At first, it was a normal interview with questions about why are you applying for the job and why you would make a good fit. Later, it was a set of questions, with an ability test, in which they reviewed if you could generate different designs utilizing Adobe Illustrator,  and Adobe Photoshop.", "Interview Questions": "What would you like to achieve when working here?"}, {"date": "25 Jan 2021", "title": "Fitness Zone Staff Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at University of Houston System (Houston, TX) in Feb 2020", "Interview Descriptions": "Very easy, just like a conversation.\nI emailed about the position and I got a reply immediately offering and interview and got the job right after. Just had to fill out a questionaire and pass a couple tests.", "Interview Questions": "My short tern and long term goals, why did I think I will be good for the position, my previous experiences if any, etc. "}, {"date": "22 Nov 2019", "title": "Undergraduate Academic Support Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 5 months. I interviewed at University of Houston System", "Interview Descriptions": "I applied online through to Google form the engineering college sent out and spent hours on my application writing the perfect essay answers. They didn't respond to me for months so I gave up on them but they contacted me about a month before the semester started saying I got the job! So I actually didn't have an interview, although I did have good recommendation letters.", "Interview Questions": "Why do you want to be a TA?"}], [{"date": "26 Sept 2019", "title": "Undergraduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at University of Houston System", "Interview Descriptions": "Typically a group of top staff that asks mainly behavioral questions. The questions were mainly around my resume and how I would handle situations with other staff members and with students in class and in the office.", "Interview Questions": "How have I handled a difficult situation with a student who was unhappy with their grade"}, {"date": "19 Sept 2019", "title": "Researcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Houston System", "Interview Descriptions": "Brief interview process, they want to see if you are someone who is willing to learn more than just your applied area of study. Looking for someone who wants to go above and beyond with creative ideas while saving on budget revenues.", "Interview Questions": "Are you motivated to learn more than just your area of study?"}, {"date": "6 Sept 2019", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at University of Houston System", "Interview Descriptions": "Received the job through a professor, no interview. Best way to get the job is to develop a relationship with a professor that has funding to sponsor graduate students. Received the job through a professor, no interview. Best way to get the job is to develop a relationship with a professor that has funding to sponsor graduate students.", "Interview Questions": "N/A"}, {"date": "13 Apr 2021", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at University of Houston System (Houston, TX) in Sept 2019", "Interview Descriptions": "It was very simple. Asked few question from the resume. \nIt was very simple. Asked few question from the resume. \nIt was very simple. Asked few question from the resume.", "Interview Questions": "Explain your projects you have worked on."}, {"date": "12 Nov 2019", "title": "TA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 5 days. I interviewed at University of Houston System (Houston, TX) in Sept 2019", "Interview Descriptions": "Design a circuit and implement that on the breadboard. develop a simulation on the software. this was the only question asked for the interview and it was easy to do this. this was the only question asked for the interview and it was easy to do this.", "Interview Questions": "Design a circuit and implement"}, {"date": "17 Jan 2020", "title": "Computer Vision Researcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at University of Houston System (Houston, TX) in May 2019", "Interview Descriptions": "The first stage was related to HR speaking with the recruiting manager and their team.\r\nSecond was related to pre screening as done by the required team members.\r\nThird and final was related to the Manager conducting the interview with the existing team member.", "Interview Questions": "Have you ever worked with the algorithms of Deep Learning ?"}, {"date": "29 Apr 2019", "title": "Program Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at University of Houston System", "Interview Descriptions": "It was pretty laid back and all of the interview questions came from a printed sheet of paper. They were all pretty standard questions.. seemed like something that came from an HR template.", "Interview Questions": "Tell me about a time when you were faced with a tough situation."}, {"date": "30 Jul 2019", "title": "Budget Analyst Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of Houston System (Houston, TX) in Apr 2019", "Interview Descriptions": "I applied online and after 3 weeks I received an email for and in-person interview. Interview was easy although they were not very forward with salary which is very low. The possibility to make more is there but it's gonna be very very slow.", "Interview Questions": "Why UH and not corporate America?"}, {"date": "24 Feb 2019", "title": "Financial Assistant II Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of Houston System", "Interview Descriptions": "The interview process went pretty quickly. I applied online and got a call within the next couple of days for an interview.  I got an offer about 2 days later.", "Interview Questions": "How is your customer service experience?"}, {"date": "13 Apr 2021", "title": "Resident Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Houston System in Feb 2019", "Interview Descriptions": "Process was good, interview was doable. Basically very situational and to the point. Just be yourself and be outspoken. You want to make an impression, but not scare people off.", "Interview Questions": "Rank situations from most emergent to least"}], [{"date": "8 Jan 2019", "title": "Program Coordinator II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at University of Houston System", "Interview Descriptions": "They take a long time to get back to you mostly because there are so many levels of approval needed.  Simple process once they get back to you.  I didn’t have difficult questions but it depends on who you are interviewing with.", "Interview Questions": "Do you have experience working in education? "}, {"date": "23 Feb 2023", "title": "Communication/Student Worker Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at University of Houston System in Jan 2019", "Interview Descriptions": "it is good and straightforward. They are quick in responding and hiring. Questions are typical. Highly recommend presenting your portfolio to get a higher chance of acceptance. Mostly contact via email.", "Interview Questions": "What makes you interest in this role? Introduce about yourself"}, {"date": "19 Feb 2019", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at University of Houston System (Houston, TX) in Jan 2019", "Interview Descriptions": "The interview was conducted by the professor that was looking for TAs. All in all, it was a fairly quick process and wasn't too formal. I didn't have to prepare too much for it, and the professor ensured that I felt comfortable.", "Interview Questions": "Do you remember some of the content that you learned in this class?"}, {"date": "14 Dec 2018", "title": "Ph D Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at University of Houston System", "Interview Descriptions": "I did not have any phone or face to face interview. I applied online on the university website. I provided all the documents that were mentioned in the admission process. Then I contacted one of the professors in my department and explained him my background. After a few months, I got the admission letter.", "Interview Questions": "Do you have any publications?\r\nWhich courses did you teach previously?"}, {"date": "22 Sept 2018", "title": "Instructional Assistant Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at University of Houston System", "Interview Descriptions": "I wrote an email to the hiring manager to introduce myself. Then, I got an email from him and make an appointment for the phone call interview. After the direct phone call interview, I got the position.", "Interview Questions": "Your excel Skills"}, {"date": "16 Aug 2021", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Houston System (Houston, TX) in Sept 2018", "Interview Descriptions": "Simpler straight forward interview process. Applied for the position and got a call after a week for an interview. There were three rounds of interviews, two on them were technical and the last one was HR.", "Interview Questions": "What is your motivation for this job?\nWhat to you feel about customer service?"}, {"date": "26 Sept 2018", "title": "Research Assistant Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at University of Houston System (Houston, TX) in Aug 2018", "Interview Descriptions": "send you an email first and let you choose a time, then schedule a phone call, will ask you several question, people are nice, you need prepare in advance", "Interview Questions": "describe the project you have done"}, {"date": "6 Jun 2018", "title": "Financial Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Houston System (Houston, TX)", "Interview Descriptions": "I left the interview feeling like it went fairly well but within 24 hours received a generic rejection letter. Looking back although I felt comfortable and felt the interview questions were easy, it wasn’t very conversational like most interviews I have. They were just taking turns reading questions off a sheet and writing my answers. Here and there I’d get a response to my answers. I really think they already knew who they wanted to hire and were just going through the motions. \r\n\r\nThere were some subtle clues that I didn’t pick up on until after I got rejected like after the interview, no one even walked me back to the elevators or main hallway. They just let me out of the conference room and asked if I knew how to get back myself and then immediately closed the conference door back. So I think they went straight to discussing me/my interview.\r\n\r\nI help with interviewing and hiring candidates at my current job and usually no one is immediately rejected unless they did something specific in the interview that really turned the team off... That could just be my jobs way but if I did do something wrong, I have no clue what it was. That’s why my only other guess is they already knew who they were going to hire and were just going through the motions... again my job doesn’t do that. They don’t bring a lot of people in to interview. Only top choices that they’re pretty sure they want to hire based on resume and phone interview. My job doesn’t like to waste their time or others.\r\n\r\nAnother subtle clue I got was that, when I asked, I was told I’d hear back within a couple of days whether I got the job or not, by email. If they wanted to hire me, it often takes longer than a day or 2 to even get references checked. I just hate when employers waste my time like that because I already have a full time job and have to waste PTO and/or work extra hours to make up the time. I had also let my references know I had an interview and they might be called, which I wish I hadn’t.\r\n\r\nAnother FYI, the campus is huge. Parking can be confusing and you will probably have a long walk from parking to where your interview is. I suggest planning to arrive 30 minutes before the interview start time because it may take that long to find parking and walk to the building. Also, you have to pay for parking and they didn’t validate or reimburse me at all. I’ve NEVER had to pay for parking for an interview. I think the fact I didn’t get it was probably a blessing!", "Interview Questions": "Why should we hire you over other candidates? Name 3 strengths and 2 weakness."}, {"date": "27 May 2018", "title": "Science Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of Houston System", "Interview Descriptions": "They were so nice and friendly. They talked a lot and also ask my my previous work experience. Also say several situations how to solve. I thought they wanna know do you have any capability of problem solving.", "Interview Questions": "How to solve questions"}, {"date": "16 May 2018", "title": "Personal Trainer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 days. I interviewed at University of Houston System", "Interview Descriptions": "Included an interview and a mock session using a mock client. 10 mins to write program and then 30 mins to take client through the workout. They will be looking for you to cue when form is broken and for you to be providing a positive and motivating environment for the client.", "Interview Questions": "Describe a time when a problem occurred and what you did to fix it."}], [{"date": "14 May 2018", "title": "Academic Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Houston System", "Interview Descriptions": "It was a panel interview with five individuals within the college. I was notified of the interview through a phone call. The panelist were very welcoming and asked questions targeted to their department.", "Interview Questions": "If you were hiring a team of advisors, what qualities would you want them to have?"}, {"date": "19 Jul 2019", "title": "Lifeguard Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at University of Houston System (Houston, TX) in May 2018", "Interview Descriptions": "300 yard swim, 5 min tread, brick retrieval. Then a basic interview not hard as they have high turnover.  The job is easy but the training and mandatory training is rough but paid", "Interview Questions": "Basic questions, not hard"}, {"date": "5 May 2022", "title": "Undergraduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at University of Houston System in May 2018", "Interview Descriptions": "The interview process was not bad. It was very fair. They wanted to get to know me. I had a good time interviewing. I highly recommend applying for this job.", "Interview Questions": "Why do you want this job?"}, {"date": "11 Mar 2018", "title": "Marketing Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at University of Houston System", "Interview Descriptions": "Met through campus job career fair. I was asked to send an email containing a cover letter pertaining to the position alongside  my resume. I was then called in for an interview.", "Interview Questions": "Tell us about yourself"}, {"date": "6 Mar 2018", "title": "Student Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at University of Houston System", "Interview Descriptions": "it was long and required a 3 min video about yourself. You can  get one of three interviewers. Your chances of acceptance vary depending on who you receive as an interviewer. Make sure to get to know the directors of the program before you apply.", "Interview Questions": "What is Entrepreneurship?"}, {"date": "18 Sept 2018", "title": "IT Systems Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of Houston System (Houston, TX) in Feb 2018", "Interview Descriptions": "I applied online and got a phone screening a few weeks later.  Then I got an In-person interview followed by an offer. The overall process was smooth and very friendly.", "Interview Questions": "Why do you want to work for the UH?"}, {"date": "3 May 2019", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at University of Houston System (Houston, TX) in Jan 2018", "Interview Descriptions": "Regular questions, research experience, relatively easy. the employee cared about what you can do in the lab.  I happen to have the experience and skill combined. One on one with the boss then showed around to the lab mates.", "Interview Questions": "Tell me about yourself, what do you see you in 5 years?"}, {"date": "28 Dec 2017", "title": "Production and Reporting Analyst Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at University of Houston System", "Interview Descriptions": "The interview process was very straightforward, I arrived at the building and asked for my interviewer, after a few minutes we walked to a meeting room and I was interviewed by the direct manager and a colleague. The interview questions were very standard behavioral type questions.", "Interview Questions": "How do you handle stress?"}, {"date": "6 Dec 2017", "title": "Housing Desk Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at University of Houston System", "Interview Descriptions": "The interview was quick, and my interviewer was very friendly. There are many behavioral questions, and they refer to your resume a lot. They asked me about 7 questions, and there was one about behaving in a group.", "Interview Questions": "What is one of your strengths and a weakness?"}, {"date": "16 Nov 2018", "title": "Admissions Representative Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at University of Houston System (Houston, TX) in Sept 2017", "Interview Descriptions": "The interview process was intense. It was long but the people were extremely friendly. There was a tour involved which I thought was welcoming and it began with breakfast, I thought that was awesome. The only thing that I did not like was that they were not clear about the job description before asking to make a presentation.", "Interview Questions": "How was a problem on the job that you solved?"}], [{"date": "28 May 2018", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at University of Houston System (Houston, TX) in Sept 2017", "Interview Descriptions": "It was good. They were friendly and will make u comfortable. Also, you can always ask for the feedback on the interview process. The manager will ask you more technical questions rather than behavior.", "Interview Questions": "Will you be able to manage your graduate studies along with this job?"}, {"date": "22 Oct 2017", "title": "Researcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at University of Houston System (Houston, TX) in Aug 2017", "Interview Descriptions": "It was very laid back, not nearly as many questions, almost as if they did not have a surplus of candidates. The person hiring you is going to be your boss most of the time.", "Interview Questions": "What experience do you have in your field"}, {"date": "30 May 2017", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at University of Houston System", "Interview Descriptions": "It was a one on one behavioral interview conducted by the director & the program manager. Very cordial yet very professional and objective interview. I had contacted the program manager through email, after reviewing my resume, they called me for an interview.", "Interview Questions": "What is your long term ambition?"}, {"date": "27 Sept 2017", "title": "Postdoctoral Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at University of Houston System (Houston, TX) in May 2017", "Interview Descriptions": "Saw the online posting on the professor's research website. Applied via email to the professor. Got replies and scheduled a phone interview. I presented my Ph.D. defense PPT to the professor and he asked questions.", "Interview Questions": "What can you offer me if you got this job?"}, {"date": "17 Oct 2018", "title": "Postdoctoral Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 4 days. I interviewed at University of Houston System (Houston, TX) in May 2017", "Interview Descriptions": "I stay in the same lab and everything is easy as we already know each other very well. In general, the professor may ask about your career plan after reviewing your resume.", "Interview Questions": "Ask about your career plan. What you want to do in the future."}, {"date": "20 Feb 2021", "title": "Copywriter Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Houston System in Apr 2017", "Interview Descriptions": "After submitting application, phone interview first then 2 weeks later in person interview with team. Learned more about the role, the team, and answered questions to best of my ability.", "Interview Questions": "What is your biggest weakness?"}, {"date": "30 Jan 2017", "title": "Intramural Sports Official Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 days. I interviewed at University of Houston System (Houston, TX)", "Interview Descriptions": "Hiring process is mainly training clinics to prove that you are competent enough to do the job and you have basic skills required for it. An understanding of the sport is vital to being successful", "Interview Questions": "Have you participated in intramural sports?"}, {"date": "17 Jan 2017", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 5 days. I interviewed at University of Houston System (Houston, TX) in Jan 2017", "Interview Descriptions": "Email contact based on qualifications. Asked questions related to my courses at my University. Asked questions on SQL, EXCEL, statistics and SPSS. Asked me one question on resolving a SPSS script error. They also asked me about my experience. Additionally they asked about the assignments as a research Assistant.", "Interview Questions": "Asked me questions on sql"}, {"date": "27 Jun 2019", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at University of Houston System (Houston, TX) in Jan 2017", "Interview Descriptions": "Apply for PhD or fill out a petition to switch to PhD from M.Sc.  Talk with the professor whose research you are interested in. Check out what prospects each research group has, so do talk with other PhD students.", "Interview Questions": "Are you married?"}, {"date": "14 Nov 2019", "title": "Fitness Attendant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at University of Houston System (Houston, TX) in Dec 2016", "Interview Descriptions": "One on one interview and then wait for the result if I got accepted to the group interview.  The group interview contained some group work, how to solve some problems as a group.", "Interview Questions": "Do you have any work experience? How do you handle a stressful situation? "}], [{"date": "11 Oct 2016", "title": "Proctor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at University of Houston System (Houston, TX)", "Interview Descriptions": "An interview was very quick - less than 15 minutes, i believe. 90% of the time she was describing the rules and position requirements. You have to work more on mid-terms and finals dates. NO tuition waiver at business CASA location.", "Interview Questions": "Asked what days and time am I available"}, {"date": "19 Sept 2016", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. I interviewed at University of Houston System", "Interview Descriptions": "It was a face to face interview with three person panel. It lasted for about 30 mins. As it was a C/C+\r\nTeaching Assistant position, there was a coding test too", "Interview Questions": "General c++ coding questions"}, {"date": "17 May 2017", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at University of Houston System (Houston, TX) in Sept 2016", "Interview Descriptions": "- Dressed in a Business Casual attire\r\n- The interviewer will review your resume and address your skills and work experience\r\n-Lastly she/he will describe the work that will be done in the office as a student worker\r\n-one on one interview\r\n-she will then review your skills and then talk to the Department Chair and give you a call", "Interview Questions": "How proficient are you in Excel?"}, {"date": "28 Feb 2018", "title": "Office Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at University of Houston System (Houston, TX) in Aug 2016", "Interview Descriptions": "It was a comfortable environment and they are understanding of your school schedule. They also understand that you may not have experience but will help train you to do the job correctly. Dont worry.", "Interview Questions": "What are some of your weaknesses?"}, {"date": "10 Jan 2019", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at University of Houston System in Aug 2016", "Interview Descriptions": "The interview process is very simple. It depends on the prior research experience. Interviewers are friendly. The process was done in a couple of hours. The result was also declared after the interview process.", "Interview Questions": "Do you have any prior research experience in this field?"}, {"date": "12 May 2016", "title": "Teacher LCC Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at University of Houston System (Houston, TX)", "Interview Descriptions": "Standard interview. There were 3 supervisors and 2 teachers present in the panel. Having so many people there made it slightly nerve-wracking, I suppose. Everyone was extremely friendly, however, and made me feel comfortable. The questions were by-the-book. I don't think they were allowed to deviate from the sheet they were looking at. They took turns asking basic questions about how I teach, techniques, how I work with others, handle a class etc....", "Interview Questions": "What does a class with you look like? (Something to that extent)"}, {"date": "26 Aug 2020", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at University of Houston System (Houston, TX) in Apr 2016", "Interview Descriptions": "I had one interview with two managers and it was really easy going and they really wanted to get to know me. They told me about their community engagement programs and what my role would be in helping them.", "Interview Questions": "What do you like to do to give back to the community"}, {"date": "17 Dec 2018", "title": "Building Supervisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at University of Houston System (Houston, TX) in Apr 2016", "Interview Descriptions": "I had already worked as a desk attendant for a year when my supervisor suggested I apply for a position as a building supervisor. After applying they had 4 panels of current supervisors and 1 panel of administrators interview in a round of \"speed dating\" style interviews.", "Interview Questions": "How would you handle a situation where its late night, the pro staff isn't there and a patron has a seizure during a zumba class?"}, {"date": "17 Mar 2016", "title": "Department Business Administrator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at University of Houston System", "Interview Descriptions": "A typical panel interview.  I saw at a table in a conference room with four other people.  They went in order and asked questions.  From interview to hire took about 3 weeks.", "Interview Questions": "Name your 3 biggest strengths... followed by, and your 3 biggest weaknesses."}, {"date": "24 May 2016", "title": "Program Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at University of Houston System (Houston, TX) in Feb 2016", "Interview Descriptions": "Met with a group of higher up staff. Everyone took a turn asking general interview questions, not intimidating, very nice. They seemed very interested in making sure they were picking the right person.", "Interview Questions": "What are your long-term and short-term goals?"}], [{"date": "23 May 2017", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at University of Houston System (Houston, TX) in Jan 2016", "Interview Descriptions": "It was a face to face interview with three person panel. It lasted for about 30 mins. As it was a C/C+\r\nTeaching Assistant position, there was a coding test too", "Interview Questions": "Do you know C language?"}, {"date": "7 Jun 2017", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at University of Houston System (Houston, TX) in Jan 2016", "Interview Descriptions": "The professor was very friendly and asked me why I was interested in getting the position of research assistant and that what my fields of interests were. The professors are very friendly and I would recommend visiting their websites or offices and inquire about opening of such positions.", "Interview Questions": "What are your research interests? "}, {"date": "16 Mar 2020", "title": "Equipment Manager Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at University of Houston System (Houston, TX) in Jan 2016", "Interview Descriptions": "Easy talk through about the daily activities. Laid back and chill, you basically need to work fridays and saturdays in season. It is a job that is paid by the month not by the hour. be prepared for extra hours in season.", "Interview Questions": "Why do you want this job?"}, {"date": "18 Jun 2016", "title": "Human Resources Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "The process took 2 weeks. I interviewed at University of Houston System (Huston, ID) in Jan 2016", "Interview Descriptions": "Overall very professional, very friendly and understanding non intimidating recruiters. I really liked how they welcomed me and gave me a tour of the campus, such as that wouldn't be necessary. Workers there seemed happy when I toured from department to department. The University of Huston seemed like they really honestly and genuinely cared about their employees. That's what made me want to work for them.", "Interview Questions": "Behavioral Based Questions"}, {"date": "10 Apr 2017", "title": "Personal Trainer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 3 weeks. I interviewed at University of Houston System (Houston, TX) in Jan 2016", "Interview Descriptions": "background information reguarding your experience in fitness and why it is you want to be a trainer. 1-2 week long shadowing process in which you observe current PTs on how they perform fitness assessments and training sessions.", "Interview Questions": "What makes you believe your a good personal trainer?"}, {"date": "12 Jan 2018", "title": "Ra Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at University of Houston System (Houston, TX) in Jan 2016", "Interview Descriptions": "There was one round of technical interview. Questions were mainly based on previous experience. there was no HR round of interview. however, a few personality based questions were asked. There was a lab test for the TA position.", "Interview Questions": "About my previous experience."}, {"date": "13 Sept 2016", "title": "Admissions Assistant I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at University of Houston System (Houston, TX) in Jan 2016", "Interview Descriptions": "Very brief, they asked why you applied for this position. There were about three people in the interview they were very nice. Asked if you know what FERPA is. Most of the questions were about how well you worked with others and with students. Like I said it wasn’t very long at all it was nice.", "Interview Questions": "Describe a time where you had to settle a complaint for a customer (i.e. faculty, staff or student)."}, {"date": "8 Nov 2015", "title": "Records Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at University of Houston System (Houston, TX)", "Interview Descriptions": "The first interview was very comfortable, even though there were three people interviewing me: two direct supervisors and their supervisor. About two weeks after the first interview, I was called for a second interview with the division director, which was even more comfortable and informal. The division director wanted to get a feel for my personality, so it was basically a 10-15 minute chat about random things, and he let me know at the end that I was recommended to be hired. I got a call the following week with the job offer!", "Interview Questions": "Tell me about your experience and how you feel it pertains to this position."}, {"date": "14 Oct 2015", "title": "Associate Director Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Houston System (Houston, TX)", "Interview Descriptions": "Applied online and had two interviews. The process took about 2 months. Everyone seemed pleasant and I was asked to attend a meeting. Seemed like a good idea at the time and figured it would give me a chance to meet my potential future coworkers. Unfortunately, since it was an actual meeting there was no engagement and no one asked me any questions nor I them. However, I sensed that I was being closely evaluated. In retrospect I should have politely declined to attend the meeting. A brief lunch would have been better and would have provided an opportunity for some engagement.", "Interview Questions": "Give an example of when your work was used to help make decisions."}, {"date": "25 Jul 2019", "title": "Program Manager's Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at University of Houston System (Houston, TX) in Oct 2015", "Interview Descriptions": "did a phone interview, then was called back to do an in person interview, was given an excel sheet and required to manipulate the data to answer certain questions.\r\nI submitted it and was offered the position the next day.", "Interview Questions": "how do you handle obstacles"}], [{"date": "27 Sept 2015", "title": "Communications Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 6 weeks. I interviewed at University of Houston System", "Interview Descriptions": "Recieved a call to set up and interview about 3weeks after submission. Interviewed by hiring manager and 2 other people in the department. Interview was straightforward typical questions and behavioral scenarios.", "Interview Questions": "name a time you had a conflict at work?"}, {"date": "16 May 2017", "title": "Office Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of Houston System (Houston, TX) in Sept 2015", "Interview Descriptions": "Consisted of applying online, waiting for a call, then coming into the office for a very friendly interview. Got back to me within the week. Extremely friendly staff that want to help you out.", "Interview Questions": "Previous work experience?"}, {"date": "1 Sept 2015", "title": "University of Houston IT Call Center Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at University of Houston System", "Interview Descriptions": "The interview was very straightforward, no brain benders, no ethical questions. Questions asked were about availability, previous work experience, and job recruiter tried to identify myself and see if I would be a good fit for her office's cultre", "Interview Questions": "basic questions about availability and previous work esxperience"}, {"date": "4 Oct 2018", "title": "Program Manager's Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 3 weeks. I interviewed at University of Houston System (Houston, TX) in Sept 2015", "Interview Descriptions": "first interview was over the phone\r\nsecond interview was face to face and i was given a project to take home and present to the supervisor the next day. \r\nThe project was an excel file where i had to format and use tools like pivot tables and formulas.", "Interview Questions": "what are your strengths \r\nwhat are your weaknesses\r\nhow do resolve a conflict?"}, {"date": "4 Nov 2015", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at University of Houston System (Houston, TX) in Aug 2015", "Interview Descriptions": "Just sending Emails, UH evaluated students, then based on their GPA, being international, being full-time, and any available previous employment records at UH made the decision.At the and they send us approval letter.", "Interview Questions": "are you full time student?"}, {"date": "4 Oct 2016", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at University of Houston System (Houston, TX) in Aug 2015", "Interview Descriptions": "The interview process was fairly straight-forward. I was asked basic questions regarding the skills that they were looking for. These skills were made known beforehand using a questionnaire that we were asked to complete one day before the interview.", "Interview Questions": "Hand-on skill using development tools."}, {"date": "18 Oct 2015", "title": "Instructional Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 5 days. I interviewed at University of Houston System (Houston, TX) in Aug 2015", "Interview Descriptions": "Basic behavioral questions, questions about information listed on the resume. Nothing much on details, it is usually a two member panelist and if you have precious experience on that field even better.", "Interview Questions": "What do you expect to gain out of this job at the end of one year"}, {"date": "31 Jul 2015", "title": "Web Developer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at University of Houston System (Houston, TX)", "Interview Descriptions": "Interviewed in front of entire department of about 6 people. Asked standard interviews questions about background and experience. Asked to recreate a webpage to assess skill level. Showed samples of previous work.", "Interview Questions": "What is your experience in building websites? What&#039;s your biggest flaw? Name a time you were faced  with a difficult decision."}, {"date": "3 Oct 2018", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at University of Houston System (Houston, TX) in Aug 2015", "Interview Descriptions": "Usually your program comes with a guarantee for placement for a certain number of years.  There was no interview process, since your program would just ask if you wanted a position in the upcoming semester.  You could then be placed as a research assistant or teaching assistant.", "Interview Questions": "Do you want a position?"}, {"date": "29 Jul 2016", "title": "Academic Support Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Houston System (Houston, TX) in Aug 2015", "Interview Descriptions": "They would would contact you after you submit the application, which includes your transcript and once you are on the interview they would ask you about your previous experiences as a tutor and you answer how have you dealt helping out people and how comfortable you feel tutoring certain classes. They also explained your roles and duties as a tutor and how would the working environment be.", "Interview Questions": "What where your previous tutoring experiences and where?"}], [{"date": "28 Jul 2015", "title": "Lecturer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at University of Houston System (Houston, TX)", "Interview Descriptions": "Hired through their online portal where applicants need to submit their profile and apply to a position.  Such a method doesn't provide a clear understanding of the preliminary timeline. There are no notifications signifying whether someone reviewed your application or not. However, in about 3 weeks I received a phone call during which we scheduled a meeting.", "Interview Questions": "Q: Questions about the area knowledge were asked by the immediate supervisor\r\nQ: Questions about teaching philosophy were asked by the chair of the department\r\nThere were a few general questions, like 'why do you want to teach here?' and 'describe your previous experiences'"}, {"date": "10 Jul 2015", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at University of Houston System", "Interview Descriptions": "The professors would ask about your background in BS/MS and tell you about their current project. For post-doc, they would ask for a presentation. Show them your enthusiasm for research and your interest and future plan. They would not technical questions if your previous research related to their research.", "Interview Questions": "Tell me about your background."}, {"date": "2 Oct 2019", "title": "Office Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at University of Houston System (Houston, TX) in Jul 2015", "Interview Descriptions": "One-on-one with director of Student Centers and then group interview with entire department heads. \r\nThe hiring process did take 6 months before I got a call back, but the on boarding process was really fast, within days the background check came back and I was able to work with human resources to sit the training modules and submit all paperwork and get my ID badge, etc.", "Interview Questions": "Some of the questions were: What's your work ethic like? How do you handle deadlines/stress? It was more of a conversational interview and while it was daunting meeting with a big group of people all at once, I liked them and they liked me. It helps to be specific with stories to answer questions."}, {"date": "29 Nov 2016", "title": "Petroleum Engineering Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 days. I interviewed at University of Houston System (Houston, TX) in Jun 2015", "Interview Descriptions": "it was quiet a unique process.Went in to turn in my resume but they had a vacancy and i could start the interview right then. They inquired about my past and already knew i was a former undergrad student", "Interview Questions": "there asked what hours i'd prefer"}, {"date": "20 Sept 2015", "title": "Instructional Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 3 weeks. I interviewed at University of Houston System (Houston, TX) in May 2015", "Interview Descriptions": "I simply applied by sending my resume to the supervisor and then I was scheduled an interview at her office. The interview is not much difficult. The interviewer asked me some questions about my background and my performances in school.", "Interview Questions": "Tell me about yourself?"}, {"date": "27 Sept 2017", "title": "Peer Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Houston System (Houston, TX) in May 2015", "Interview Descriptions": "I had an interview with a panel of advisers from the Bauer School of Business. I was then referred to an opening with the College of Liberal Arts and Social Sciences and was hired.", "Interview Questions": "How have your previous roles prepared you for this job? "}, {"date": "16 Aug 2018", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at University of Houston System in Apr 2015", "Interview Descriptions": "Based on academic credentials and basic behavioral questions. And mostly given to F1 student status students only. Through recommendation of the professor who's class you wan tot be teaching assistant under", "Interview Questions": "Basic questions and why into teaching"}, {"date": "13 Apr 2017", "title": "APM Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 3 months. I interviewed at University of Houston System (Houston, TX) in Apr 2015", "Interview Descriptions": "The overall process was very good. You basically start your interview the first day you join the program. You have to perform and show that you are capable of learning, working hard, and teaching. The opportunities that this positions opens for you are endless.", "Interview Questions": "Do you have any ideas?"}, {"date": "1 Nov 2015", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at University of Houston System (Houston, TX) in Mar 2015", "Interview Descriptions": "Actually graduate teaching and research assistants are assigned by their academic advisers (professors). If the professor is satisfied with your knowledge and background in his or her field of study, he or she will assign you as a teaching or research assistant. so each professor may interview the student in their own way.", "Interview Questions": "They asked me about the projects that I have been involved in. "}, {"date": "2 May 2016", "title": "IT Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at University of Houston System (Houston, TX) in Mar 2015", "Interview Descriptions": "It was 1:2 interview. Both of them have great knowledge about computers and pharmaceutics material. They will checked your resume and ask what would you do in specific situations. They asked about what would do about system hacking.  Do you have any knowledge about medicines", "Interview Questions": "What would you do if UH system is under attack by intruders?"}], [{"date": "10 Aug 2019", "title": "Protor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of Houston System in Mar 2015", "Interview Descriptions": "I got the notice, went in,  they ask about my school schedule. the interview went smoothly. Got my offer on spot. Came into work on the next day.", "Interview Questions": "N/A"}, {"date": "3 May 2016", "title": "Computer Lab Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Houston System (Houston, TX) in Feb 2015", "Interview Descriptions": "apply on the web, and wait for the interview call from the manager in about 2 weeks\r\nthe office is nice over there, and people are very nice and helpful on the day of interview\r\nthe manager interview you face to face, and ask about your previous work experience, and skills you have, and the salary problem", "Interview Questions": "your previous work experience, and skills you have, and the salary problem"}, {"date": "22 Feb 2016", "title": "Development Officer II Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at University of Houston System (Houston, TX) in Feb 2015", "Interview Descriptions": "Skype interview and 2 in person interviews. Second interview was a panel interview where they brought in all interview candidates to interview at the same time in the same room as a round table. Very competitive environment", "Interview Questions": "How would you describe your decision making"}, {"date": "6 Jan 2015", "title": "Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at University of Houston System", "Interview Descriptions": "I was called by my department chair, who had been my professor while a student.  She had supervised some of my research and actually recruited me.  I was soon to be named a Clinical AP, but  unfortunately, my area of discipline was moved to a different, difficult college.", "Interview Questions": "I do not recall any difficulty in the hiring process."}, {"date": "23 Jun 2015", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of Houston System (Houston, TX) in Jan 2015", "Interview Descriptions": "very easy and basic question related to course and usually taken by professor. all question asked has been answered very easily. my interview was in morning with one of easy going professor, I do not remember his name but he did not ask me many question. all question was belong to my course of work and project.", "Interview Questions": "very easy and basic"}, {"date": "19 Jun 2019", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 3 days. I interviewed at University of Houston System (Houston, TX) in Jan 2015", "Interview Descriptions": "was interviewed with faculty in his office and he asked me about my background and courses I have taken. He also asked me about my papers and their materials and methods", "Interview Questions": "Asked about my knowledge in TPD"}, {"date": "13 Dec 2014", "title": "Assistant Professor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 6 months. I interviewed at University of Houston System (Houston, TX)", "Interview Descriptions": "Job talk and meeting with faculty.  Gave a seminar met with the dean, discussed projects and programs I was interested in pursuing.  Met with student group.  Toured the city, Met with the Provost and departmental staff.", "Interview Questions": "Subject matter related, not relevent"}, {"date": "8 Mar 2016", "title": "Front Desk Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Houston System (Houston, TX) in Dec 2014", "Interview Descriptions": "-Apply online for position, then small interview briefly describing about previous experience about customer relationships etc. Then I answered with my previous work experience. \r\n\r\n- Senior desk assistant is the person who generally take the interview rather than SRA. \r\n\r\n- They are more interested if you are enthusiastic about working and if you have good communication skills as it is required for any desk assistant jobs.\r\n\r\n- Also they look for serious commitment that if we will be working in between 15-20 hours /week.", "Interview Questions": "Tell us about your experience in Customer relationship management?"}, {"date": "20 Oct 2015", "title": "Post Doctoral Fellow II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 3 months. I interviewed at University of Houston System (Houston, TX) in Nov 2014", "Interview Descriptions": "I emailed the PI directly in response to an ad for the position that was circulated.  You learn as much about the PI, his research interests and field of expertise, so you can determine if you are a great candidate to join his lab.  I met with him a couple of time to introduce myself, sell your qualifications.  I was also introduced to the current lab members, and learned more about the facilities available to the lab.  Finally, i was asked to give a presentation on my research expertise in an informal lab seminar.  Overall, it was an assessment by the PI and lab if i was a suitable addition to their lab, as well as your own assessment if you would be a great fit to the lab.", "Interview Questions": "What are your long term goals"}, {"date": "15 Oct 2014", "title": "Secretary II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at University of Houston System", "Interview Descriptions": "Interviewed by the Development department which consisted of the Development Officer and the Development Coordinator. Questions were based around secretarial duties and Microsoft programs. Getting on campus is a pain so I would suggest arriving thirty to forty minutes ahead so that you can find proper parking and the correct building. Know about the department you are applying for because you will be asked what do you like about the company/department.", "Interview Questions": "The questions were not difficult. The test on the computer to test my skills for emailing, creating excel files, setting appointments was the most difficult part."}], [{"date": "26 Jul 2015", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at University of Houston System (Houston, TX) in Oct 2014", "Interview Descriptions": "A skype interview for one hour on my engineering basics specifically on fluid mechanics, computational fluid dynamics. The interview was focused on how much i am willing to learn and work rather than how much previous knowledge i have on the subject.", "Interview Questions": "What software do i use to perform simulations for CFD"}, {"date": "16 Sept 2014", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at University of Houston System", "Interview Descriptions": "Interview process is straight forward. You are likely to have at least two interviews. If you find that you are unhappy with your graduate assistantship. I encourage you to explore other options. This can also be a strategy to gain experience in various areas.", "Interview Questions": "Be sure of your intentions in applying for the position. It is their ultimate goal to help prepare you for a future position. I would definite suggest applying for positions that relate to the professional position you want in the future."}, {"date": "1 Dec 2015", "title": "Residential Desk Service Supervisor (Bayou Oaks Community) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. The process took 2 days. I interviewed at University of Houston System (Houston, TX) in Sept 2014", "Interview Descriptions": "The interview began with a 1-on-1 with the asst. Housing Manager. Once that concluded, the next was a panel from 7 Residential Supervisors and 1 Central Supervisor. They asked a series of questions concerning programming, conflict resolution, motivation tactics, and innovation. The next phase was the have a 1-on-1 with the housing manager and then Executive Director of SHRL.", "Interview Questions": "How will you work with the Residential Life Coordinator (live in staff) to help grow, promote, and sustain student success. What experiences do you have to help in this task."}, {"date": "4 Dec 2014", "title": "Front Desk Assistant (Work-Study) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at University of Houston System (Houston, TX) in Sept 2014", "Interview Descriptions": "Applied on Cougar Pathway and was contacted about a week later came in for an in person interview with the Administration Leader to cover general questions about my resume and previous jobs. Next I was scheduled an interview with the Director of the Department and got the job on the spot.", "Interview Questions": "When are you available to work?\r\nAre you familiar with Outlook? "}, {"date": "13 Mar 2015", "title": "Student Tech Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at University of Houston System (Houston, TX) in Aug 2014", "Interview Descriptions": "Face to Face with real time problem solving. I was given situations and asked to tell my steps to that situation. Also I was asked to do some small problem solving task and monitored on the basis of my step thinking and implementing process.", "Interview Questions": "Real time problems"}, {"date": "26 Feb 2018", "title": "Front Desk Receptionist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at University of Houston System (Houston, TX) in Aug 2014", "Interview Descriptions": "The interview process was quite simple and it was a group interview. Everyone had an equal opportunity to speak. The questions were pretty simple and straight to the point.", "Interview Questions": "What do you understand by Customer Service?"}, {"date": "2 Jun 2016", "title": "Executive Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at University of Houston System (Houston, TX) in Aug 2014", "Interview Descriptions": "Panel interview at least five people. Lasted about 30 minutes. They were all very nice. They briefly described the position and the expectations that would be required. I only had one interview and found out I got the job about two weeks after the interview. A background check was performed and after that they made an official job offer via email. I accepted the offer, the salary was much better than I expected. I started the position two weeks later.", "Interview Questions": "Describe a time when you had to deal with multiple deadlines. Are you organized?"}, {"date": "31 Mar 2016", "title": "Instructional Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at University of Houston System (Houston, TX) in Aug 2014", "Interview Descriptions": "I was called and scheduled for an interview. the interview lasted for 1 hour. It was more about my past experiences and projects. It was technical and non-technical combination.\r\n\r\nA compilation of all the behavioral questions on this website.\r\n\r\n1. Tell me about yourself\r\n2. Strengths\r\n3. Weaknesses\r\n4. Why Amazon?\r\n5. How can you translate your skills towards Amazon?\r\n6. What experiences do you have that separate you from the rest?\r\n\r\nGroups/ Leadership\r\n1. Tell me about a time when you were leading a group, were assigned a goal, and did not reach it\r\n2. Tell me about a time when you had a group conflict and how did you overcome this conflict?\r\n3. How did your actions in a leadership role increase productivity?\r\n4. Tell me about a time when you dealt with an employee with poor performance\r\n5. What is your take on leadership?\r\n6. Tell me about a time when you had a group conflict and how you overcame this conflict?\r\n7. What kind of roles have you done that were leadership roles?", "Interview Questions": "To mention more about my projects"}, {"date": "9 Apr 2016", "title": "Instructional Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at University of Houston System (Houston, TX) in Aug 2014", "Interview Descriptions": "The interview was much of a friendly talk. They were recruiting students for a new project at the Energy Research Park (ERP). \r\nMy interview was for 45 minutes. It was more like sharing ideas about the stuff we know - Networking. We discussed a lot on the emerging technologies and what all to implement for the project coming up.", "Interview Questions": "Firewall concepts."}, {"date": "23 May 2017", "title": "Cashier At Student Centers Gamesroom Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 3 days. I interviewed at University of Houston System (Houston, TX) in Aug 2014", "Interview Descriptions": "Very brief interview. They do a bit of a personality test to see if you're capable of learning on the job, good with people and create an idea of your work schedule even if you have classes.", "Interview Questions": "What is your semester schedule?"}], [{"date": "8 Feb 2018", "title": "Student Office Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at University of Houston System (Houston, TX) in Aug 2014", "Interview Descriptions": "Very easy was asked basic questions\r\nWas asked about background experience and what my goals were\r\nThen introduced to the rest of the staff and went over the job duties I might have if I got accepted", "Interview Questions": "Tell me about yourself"}, {"date": "28 Feb 2017", "title": "Network Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at University of Houston System (Houston, TX) in Aug 2014", "Interview Descriptions": "interview process was good. 4 people took my interview, 3 rounds of technical and then HR. Interview was mostly about wireless networking, campus network architecture. How you build a campus network? Troubleshooting steps for wireless issue", "Interview Questions": "Wireless 802.11, Aruba, Meru access points, Controllers"}, {"date": "24 Jun 2015", "title": "Student AutoCAD Drafter Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at University of Houston System (South Houston, TX) in Jul 2014", "Interview Descriptions": "I got an email regarding job offer.\r\nI went through a drafting test in which the asked me to renovate a old existing construction drawing and was allotted 20 minutes to complete and fix the drawing according to their standards and scale. After that Project Manager interviewed me.", "Interview Questions": "What are your future goals ?\r\nWhat will you keep your personal and professional life separate at work place?\r\nHow will you manage work load and academic load together?"}, {"date": "18 Jun 2014", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at University of Houston System", "Interview Descriptions": "They filter your resume, so by the time you get an interview, it's about what kind of relevant experience you have and how well you get along with your interviewers.", "Interview Questions": "What kind of experience do you have working in an office setting?"}, {"date": "18 Aug 2015", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1+ week. I interviewed at University of Houston System (Houston, TX) in May 2014", "Interview Descriptions": "I was interviewed by two people, one professor and one program coordinator. They asked me simple questions such as how I handle difficult situations with others. It was a pretty straightforward interview, and they pre-screened everyone for academic merit.", "Interview Questions": "Have you ever had to deal with interpersonal difficulties in the workplace? How did you deal?"}, {"date": "3 Apr 2014", "title": "Graduate Teaching Assistant Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at University of Houston System", "Interview Descriptions": "The application comes along with the application to grad-school", "Interview Questions": "Usually TA is part of scholarship. They may ask if your English is qualified"}, {"date": "12 Oct 2016", "title": "Research Tech Supervisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at University of Houston System (Houston, TX) in Apr 2014", "Interview Descriptions": "i  had a skype interview and then a face to face interview.they presented me with a powerpoint of what the lab was doing in terms of research. i had a meet and greet with lab personnel.", "Interview Questions": "what salary do i expect?"}, {"date": "12 May 2015", "title": "Academic Support Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at University of Houston System (Houston, TX) in Apr 2014", "Interview Descriptions": "Very smooth interview. Didn't really ask difficult questions. Pretty much about databases, your basic knowledge on library procedures. A week after the interview I e-mailed the hiring manager and that is when I was offered the position", "Interview Questions": "Are you familiar with any library research databases"}, {"date": "1 Sept 2016", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at University of Houston System (Houston, TX) in Apr 2014", "Interview Descriptions": "whether you get the job is mainly based on your gpa. If you took some related courses and got high score, the professor will be more than happy to recruit you, good luck", "Interview Questions": "your interest and experience"}, {"date": "29 Mar 2014", "title": "Assistant Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at University of Houston System", "Interview Descriptions": "Usual conference, campus visit, drill.", "Interview Questions": "None, it was a pretty standard process."}], [{"date": "13 Mar 2014", "title": "Front Desk Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. The process took 5 days. I interviewed at University of Houston System", "Interview Descriptions": "I was asked several questions about behavior and personality. Also I was asked to submit two references from the previous employers.", "Interview Questions": "How would you resolve the conflicts between two employees?"}, {"date": "8 Feb 2016", "title": "Academic Advisor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at University of Houston System (Houston, TX) in Mar 2014", "Interview Descriptions": "You apply online, even though most departments already know who they're going to hire. I went through the interview process but told them more about what the job entailed than they knew. It was a waste of time but HR required that I go through the interview process.", "Interview Questions": "Describe a time when you took the initiative on a task?"}, {"date": "28 Feb 2014", "title": "Student Worker Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at University of Houston System", "Interview Descriptions": "In order to get hired, you are referred to a website depending upon the location you choose. Other locations would sit you down and ask your class schedule and what specific opportunities do you hope to find within the job you are interested in. Very few locations have an interview.", "Interview Questions": "What do you expect out of this job? "}, {"date": "31 Mar 2014", "title": "PhD Seeking Student Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at University of Houston System in Mar 2014", "Interview Descriptions": "via skype, two professors, they asked several questions like what area are you interested in? Why do you choose this university? Why do you choose this major? and then just introduce their program", "Interview Questions": "what area are you interested in? "}, {"date": "4 Feb 2014", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at University of Houston System", "Interview Descriptions": "At that time I already get into second round and wait for professors to pick, one Electromagnectic professor gave me an phone call and interviewed me ,all the process is basically free talk, the important question might be what is your GPA, what is your standing in class, How many courses have you take in Math or physics, what's your faverate area to research and study, future plan to research. basically free talk about your study and future plan,", "Interview Questions": "what are Maxwell equations ,told me about how did you understand them."}, {"date": "14 Apr 2017", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at University of Houston System (Houston, TX) in Feb 2014", "Interview Descriptions": "Five professors interviewed me simultaneously using Skype for about 30 minutes. Each of them introduce themselves and I introduce myself. Then they took turns to ask me questions. Then I ask them questions that haven't been discussed yet.", "Interview Questions": "Do you have any questions for us？"}, {"date": "26 Sept 2018", "title": "Research Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at University of Houston System (Houston, TX) in Jan 2014", "Interview Descriptions": "It's fun to talk with the professor who was hiring. First went through the lab before we started the interview. Questions were easy and almost all the topics were about the research itself. I felt very comfortable to answer these questions.", "Interview Questions": "What did you study in the graduate school?"}, {"date": "14 Jun 2014", "title": "Research Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. The process took 1+ week. I interviewed at University of Houston System (Houston, TX) in Jan 2014", "Interview Descriptions": "Note: this was at the law school. It was kind of a no-brainer, honestly, because I'd already taken two classes and knew the hiring professor well, plus I'd done well in his classes and made a point of being an active class participant. I don't know if he even interviewed anyone else, and I got the job.", "Interview Questions": "The only difficult question was determining when I could work for him amidst all my other myriad school responsibilities."}, {"date": "9 Sept 2015", "title": "Assistant Professor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of Houston System in Jan 2014", "Interview Descriptions": "it is not good. they ask some normal questions. And I give the answer. But they turn out to do not like that one. so they change the topic and ask another question. I try to answer them again. But they still not like that topic.", "Interview Questions": "so they change the topic and ask another question. I try to answer them again. But they still not like that topic."}, {"date": "13 Jun 2015", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of Houston System (Houston, TX) in Jan 2014", "Interview Descriptions": "Positions for Research Assistants are based on individual research for the Masters Program which are consistent with the needs and direction of federal funding for NSF research.  Hiring Managers are typically Associate Professors, with ongoing research in a dedicated field of study.  Potential candidates are identified by Project Managers or Associate Professors, which have hand selected exceptional Masters students based on professional experience and comprehensive understanding of Network Communication Engineering.  The Associate Professors interview selectively based on recommendations and resume screening processes.  \r\n\r\nOnce the candidates are narrowed down,  a face-to-face interview is conducted with validation of core components needed to continue existing research and configuration work for publication and presentation at multiple preselected conferences.\r\n\r\nResearch Assistant positions require ability to conduct complex network activites, detailed research in new networking technologies and exceptional public speaking skills for presentation of work", "Interview Questions": "Interview questions consist of technical and interpersonal scenarios which the Research Assistant will be required to execute.  Specific questions regarding programming languages, syntax, and documentation practices are discussed and used to determine level of proficiency in these areas.  Candidates are questioned on their professional and personal objectives to ensure there is alignment with the core Research goals.  \r\n\r\nSince research is a continuation of previous works, questions regarding publications produced from that department are asked."}], [{"date": "17 Sept 2015", "title": "Academic Advisor I Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Houston System (Houston, TX) in Dec 2013", "Interview Descriptions": "Phone interview conducted first, then a face to face interview. Questions were typical of an interview. The paperwork took the longest to get through because there are so many levels of approval required.", "Interview Questions": "They asked what were my strengths and weaknesses and what I liked most about being an advisor."}, {"date": "17 Nov 2015", "title": "Senior Technical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at University of Houston System (Houston, TX) in Dec 2013", "Interview Descriptions": "One of my friends recommended me for the job. They talked to their manager about me and how I was qualified. Got an email stating that I had an interview within a month of first talking to friend about interest in position, walked to the interview and had 2 interviews back-to-back, was offered job the next day I believe.", "Interview Questions": "What do you know about the job?"}, {"date": "14 Dec 2013", "title": "Executive Secretary Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at University of Houston System (Houston, TX) in Dec 2013", "Interview Descriptions": "The process was detailed and helpful", "Interview Questions": "Why should I hire you."}, {"date": "14 May 2015", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at University of Houston System (Houston, TX) in Dec 2013", "Interview Descriptions": "Had to meet with the professor several times to complete tasks in each round. Ask you basic skillset but mostly technical and expect much more knowledge as it gets tougher.", "Interview Questions": "Technology oriented questions. Programming."}, {"date": "28 Sept 2016", "title": "PhD Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at University of Houston System (Houston, TX) in Nov 2013", "Interview Descriptions": "Skype interview with professor. Professor will ask questions. Ask for the project you have participated in and ask you present your work. After presentation, discuss about the on going project in the research group. If your are a strong background student, you probably get the position after interview.", "Interview Questions": "What you can contribute for our group?"}, {"date": "18 Mar 2014", "title": "Proctor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at University of Houston System (Houston, TX) in Nov 2013", "Interview Descriptions": "1 interview", "Interview Questions": "it is easy interview, just general question"}, {"date": "30 Aug 2013", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at University of Houston System (Houston, TX)", "Interview Descriptions": "good and amazing experience with University of Houston", "Interview Questions": "you need to have higher GPA and higher GRE score"}, {"date": "18 Oct 2017", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1+ week. I interviewed at University of Houston System in Aug 2013", "Interview Descriptions": "First met with the Lab head for a short interview about research background, goals and what I wanted to do in next five years. After that met one of the graduate students in the lab and spoke for about thirty minutes.", "Interview Questions": "Do you have previous experience in a research lab. If so, please explain."}, {"date": "29 Oct 2015", "title": "Student Worker/Workstudy Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at University of Houston System (Houston, TX) in Aug 2013", "Interview Descriptions": "They asked me about my qualifications and my past work experience. \r\nMy interviewer was quite friendly and helped me relax. She offered me the job the same day.\r\nI worked there two years and learned a lot about running a office and becoming a better person.", "Interview Questions": "What have you learned from your past work experience? "}, {"date": "5 Aug 2015", "title": "Program Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at University of Houston System (Houston, TX) in Jul 2013", "Interview Descriptions": "Online application, followed by informal phone interview. \r\n\r\nFollowed by a panel interview of 5 people. Met 4 other people who I realized I would never work with because they are from different job functions (after I joined).\r\n\r\nThen a phone call to make sure that I am interested. Then the formal job offer.", "Interview Questions": "How do you handle an agitated employee, faculty, staff, or student?\r\nWhat would you do in your first year?\r\nWhat can you bring to the table that other candidates can not?\r\n\r\nWhat was your biggest failure?\r\nHow can you improve (very specific and technical process) function?"}], [{"date": "6 Oct 2016", "title": "Web Developer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 3 days. I interviewed at University of Houston System (Houston, TX) in Jul 2013", "Interview Descriptions": "My interview was less formal then others, but during a meeting between UT and UH I was a consultant and spoke with someone who was working for UH and we talked about my skills and abilities, he found that I would be a good fill for an open spot.", "Interview Questions": "What are the coding languages you are familiar with?"}, {"date": "17 Jun 2013", "title": "Instructional Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Easy Interview", "Application Type": "I interviewed at University of Houston System", "Interview Descriptions": "Let the professor know you are responsible and competent.", "Interview Questions": "N/A"}, {"date": "10 Jun 2013", "title": "Peer Advisor Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at University of Houston System", "Interview Descriptions": "first I handed in the application form in person and the application form was the first round interview. the second round interview is an one-on-one interview or a group interview", "Interview Questions": "how is your job hunting going"}, {"date": "13 Nov 2015", "title": "Desk Assistant Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at University of Houston System (Houston, TX) in May 2013", "Interview Descriptions": "Wasn't really an interview, just asked about school schedule. They were just trying to get a feel of who I was and if I was competent enough to do the position. Nothing major at all.", "Interview Questions": "What's your class schedule?"}, {"date": "23 Jul 2014", "title": "Program Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at University of Houston System (Houston, TX) in Apr 2013", "Interview Descriptions": "I interviewed with a panel of 5 people.  Since I already had experience with the company and knew some of the people on the panel, it was easy.", "Interview Questions": "Nothing difficult.  "}, {"date": "11 Dec 2017", "title": "PhD Graduate Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 4 months. I interviewed at University of Houston System (Houston, TX) in Apr 2013", "Interview Descriptions": "I e-mailed the professor who I wanted to work with. She e-mailed me back positively and asked me to do an interview on the phone. I did the interview and she basically asked about the department specific questions. She asked about my background, why I applied, what are my missions and visions, etc. I replied all the questions and she was very helpful for the application process. She was friendly and kind. She responded very quickly and answered all my questions.", "Interview Questions": "Why did you apply here?   "}, {"date": "17 Mar 2013", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Houston System (Houston, TX)", "Interview Descriptions": "Just try to talk with my current advisor, it's very easy", "Interview Questions": "none"}, {"date": "21 Feb 2013", "title": "Front Desk Associate Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at University of Houston System (Houston, TX)", "Interview Descriptions": "The Interview was extremely long. There was like 10 behavioral questions. Too many questions for a Library position. However, very simple question to see how you work with others.", "Interview Questions": "There really was no difficult question. If I had to choose it would probably be \"Name a time when you had to work with somebody who didn't want to work with you?'"}, {"date": "5 Feb 2013", "title": "Tutor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at University of Houston System (Houston, TX)", "Interview Descriptions": "Application\r\nInterview: kinda easy, make sure u speak good English, good knowledge on tutor subjects", "Interview Questions": "No difficult questions"}, {"date": "31 Oct 2015", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Houston System (Houston, TX) in Feb 2013", "Interview Descriptions": "I applied for PhD program at computer science department and attched my test scores (TOEFL, GRE) to my documents. I also contacted Prof gnawali as potential adviser. I had a skype interview mnostly questions about my resume and projects I did during my master. He asked to develop a simple application and submit the result to him by one week. after 2 weeks I received job offer.", "Interview Questions": "Why do you consider UH as you favorite job loation?"}], [{"date": "25 Jan 2013", "title": "Postdoctoral Fellow Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at University of Houston System", "Interview Descriptions": "just a phone interview... about research", "Interview Questions": "give me a question for experimental desgin"}, {"date": "1 Mar 2013", "title": "Program Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at University of Houston System (Houston, TX) in Jan 2013", "Interview Descriptions": "They brought in three people to interview me. They had three very diverse personalities. One was generally smiling and laughing with me. The second was kind of neutral but didn't seem particularly interested in me or being there. The third was totally negative and seemed to be in a bad mood.", "Interview Questions": "They ask the \"biggest weakness\" question, which I always think is a pretty silly question. You want to plead the fifth. "}, {"date": "18 Mar 2014", "title": "Student Worker-math Department Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Easy Interview", "Application Type": "I interviewed at University of Houston System (Houston, TX) in Jan 2013", "Interview Descriptions": "I didn't really have an interview because the lady that interviewed need someone right away. just asked what my schedule was right. Don't know how it is now..new management.", "Interview Questions": "what my schedule was"}, {"date": "27 Mar 2014", "title": "Instructional Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at University of Houston System (Houston, TX) in Jan 2013", "Interview Descriptions": "mostly technical questions and HR question like tell me about yourslef. what would you do in freetime. which technologies are you familiar, When and where did u apply those technologies,explain about your projects", "Interview Questions": "All the questions are easy"}, {"date": "22 May 2015", "title": "Teacher Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at University of Houston System (Houston, TX) in Jan 2013", "Interview Descriptions": "The interview process was very simple. I was recommended for the position by the person before me. My professor contacted me and asked was I interested and I said that I was. The whole process took maybe ten minutes total. The job was easy to get because of the connections I had.", "Interview Questions": "Would you be able to balance your coursework and the job at the same time?"}, {"date": "2 Nov 2015", "title": "Postdoctoral Fellow Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at University of Houston System (Houston, TX) in Jan 2013", "Interview Descriptions": "The interview process is essentially a formality. Hiring decision are made prior to actually meeting anyone, and are based on publication record, references, and personal connections. Research cares little for personality traits, like extroversion or even ambition. All they want is a proficient worker who doesn't mind the tedium of lab work. You could be full blown Autistic and it wouldn't matter. Anyway, the important thing is to have personal connections with whoever is running the lab. If you're on good terms with him or her, you'll probably get the job. It was important to speak honestly about you abilities, but not be hesitant to state that you are good at something.", "Interview Questions": "Can you keep doing what you did in the previous lab you worked in?\r\nHow long will it take before you're ready to start?\r\nWhen can you have this project completed by?"}, {"date": "4 Jun 2013", "title": "Peer Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 4 days. I interviewed at University of Houston System (Houston, TX) in Jan 2013", "Interview Descriptions": "fill form attach two lors and submit in the office..interview was a general 5 minutes hr asking about uh policies and website navigation", "Interview Questions": "nothing"}, {"date": "11 Aug 2015", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at University of Houston System (Houston, TX) in Jan 2013", "Interview Descriptions": "There was no interview, I was selected based on my research experience. I had to meet the program director and fellow associates. I was allowed to tour the university.", "Interview Questions": "What are your interests?"}, {"date": "31 Oct 2012", "title": "Java Developer Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at University of Houston System (Houston, TX)", "Interview Descriptions": "Mostly the questions were from the resume, how we speak and all. Confidence is the key.", "Interview Questions": "Nothing"}, {"date": "3 Apr 2014", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Houston System in Nov 2012", "Interview Descriptions": "Initial contact via phone. One Interview, panel interview conducted by three Managers, the Communications Manager, Resolution Specialist, and the Department Head. Communications Manager asked most of the questions while the Resolution Specialist took notes and asked follow up questions. Regular interview questions nothing out of the ordinary. The interview lasted about 30 minutes.", "Interview Questions": "Regular interview questions nothing out of the ordinary."}], [{"date": "22 Oct 2015", "title": "Department Business Administrator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at University of Houston System (Houston, TX) in Aug 2012", "Interview Descriptions": "The interview was conducted by a panel of interviewers who asked roughly 20-25 job related questions. Lots of follow up questions were asked based on my responses to truly assess what my knowledge level and experience was. At the end they provided me with an opportunity to ask questions of my own, and they all were very candid in their responses. The same day they called and asked if it was ok to reach out to my references. I informed them it was fine. They called me a few days later and offered me the position.", "Interview Questions": "How do you negotiate a large bureaucracy?"}, {"date": "23 Feb 2016", "title": "Desk Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at University of Houston System (Houston, TX) in Aug 2012", "Interview Descriptions": "very basic. General questions based on my resume. Nothing out of the ordinary. Asked me for my availability to work. Asked about my class schedule. Any experience working in a group. Any leadership positions held and situations where I had to overcome a problem with peers.", "Interview Questions": "Mention one instance where you had to take over as a leader"}, {"date": "10 Apr 2013", "title": "Instructional Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at University of Houston System (Houston, TX) in Jul 2012", "Interview Descriptions": "Applied on-line and had do a mock interview as the first step. Was called for an interview on-site later. Questions were simple.", "Interview Questions": "N/A"}, {"date": "13 Jun 2012", "title": "Student Operations Manager Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at University of Houston System (Houston, TX) in Jun 2012", "Interview Descriptions": "Very typical panel interview.  They took turns asking personality assessment questions as well situation-based questions. It was a semi-relaxed environment. They seemed very receptive to my ideas, which is what they were really looking for, as the department is undergoing an overhaul. At the conclusion of the interview, they asked if I had any input they should consider to make the position better, which I found interesting.", "Interview Questions": "What current policy do we have that you do not agree with?"}, {"date": "6 Jul 2016", "title": "Secretary I Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 2 weeks. I interviewed at University of Houston System (Houston, TX) in Jun 2012", "Interview Descriptions": "I was interviewed by two people from the development team. After that double interview I was taken on a small tour of the department. After the tour I was brought back to a desk that was setup for me to take a skills test. They had me use Outlook to send an email, calendar an event, and create tasks. Secondly, they had me use Word in which I had to create a memo and lastly I had to use Excel in which I had to use the formula to create totals for a spreadsheet.", "Interview Questions": "What do you know about our company?"}, {"date": "1 Sept 2015", "title": "Researcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at University of Houston System (Houston, TX) in May 2012", "Interview Descriptions": "Very pleasant and casual interview. Last for about 30mins. The questions included both general and job-specific questions. No surprises or difficult questions if you know what you are doing for the field you are working in.", "Interview Questions": "Tell me about yourself briefly"}, {"date": "1 Apr 2016", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at University of Houston System (Houston, TX) in May 2012", "Interview Descriptions": "One on one with the PI. The PI checked to see if research interest align and suitable amount of preliminary knowledge on subject matter obtained. The department does not have a shadow round in which graduate students jump from lab to lab during their first year to determine the most suitable lab position.", "Interview Questions": "Are you interested in cardiovascular research? "}, {"date": "10 Oct 2015", "title": "Resident Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at University of Houston System (Houston, TX) in Apr 2012", "Interview Descriptions": "There are a series of interviews. There is a group interview and an individual interview. In the group interview you want to stand out for the right reasons. Get to know the other people in your group, remember their names, be friendly.", "Interview Questions": "In your opinion, what is the most important issue for college freshman?"}, {"date": "4 Aug 2014", "title": "Marketing Associate Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 10 months. I interviewed at University of Houston System (Houston, TX) in Jan 2012", "Interview Descriptions": "Online application. 8 months wait. Then a phone call. Then 1 month wait. Then in-person. Then 1 months wait. Then offer letter, then 2 months wait to join.\r\nYes, the whole process took one year. I am not sure I made the right choice after joining.\r\n\r\nPost hiring, there was a disagreement between the hiring manager and HR on salary of the position. HR wanted to pay higher than hiring manager which was agreed upon by phone call. This caused further delay of 2 months. Finally got the offer with the promised higher salary from HR. \r\n\r\nThat was the first red flag.", "Interview Questions": "What are your plans to work?\r\nyes....it is not long term or short term, but just work. It was a question that I just couldn't answer..."}, {"date": "14 Jan 2016", "title": "Administrative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 months. I interviewed at University of Houston System (Houston, TX) in Jan 2012", "Interview Descriptions": "Started as a temporary employee. Process takes minimum of 2 months. Filling out the application and completing that process can take hours. It is grueling.  Seen from the other side as a department seeking an employee, the process can take just as long, especially if the position requires a \"committee\" review.", "Interview Questions": "N/A"}], [{"date": "17 Jun 2015", "title": "Postdoctoral Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of Houston System (Houston, TX) in Oct 2011", "Interview Descriptions": "Employers may conduct, including behavioral and situational interviews, group interviews, case interviews, panel interviews, stress interviews, technical, phone and video interviews, second interviews, and restaurant interviews.\r\n\r\nQuestions can vary from background information to brain teasers to see how an applicant has used their skills in the past or possess the ability to think and react under pressure. Some positions require multiple interviews in succession while others involve just one or more testing procedures.", "Interview Questions": "What is your current salary?"}, {"date": "23 Jun 2015", "title": "Adjunct Teacher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of Houston System (Houston, TX) in Aug 2011", "Interview Descriptions": "Email to set appointment; face to face interview that lasted between 30-45 minutes; offer the following day with clear steps and paperwork needed. This specific program is called the Language and Culture Center, and it belongs to the English Department.", "Interview Questions": "How would you make sure that cultural differences are respected?"}, {"date": "10 Nov 2011", "title": "Instructional Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at University of Houston System (Houston, TX) in Aug 2011", "Interview Descriptions": "The supervisor invited to his office", "Interview Questions": "Describe a phase where you introduced a change"}, {"date": "26 Aug 2015", "title": "Hall Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at University of Houston System (Houston, TX) in Mar 2011", "Interview Descriptions": "There was a group interview that was monitored. You were given a list of situations and had to provide how you'd settle it. Once you made it through this round there was a group panel interview and then a one on one interview.", "Interview Questions": "How would you handle an emergency situation with a resident?"}, {"date": "30 Oct 2015", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of Houston System (Houston, TX) in Jan 2011", "Interview Descriptions": "my supervisor called in and discuss about my research interests, we discussed about some of his researches and some of my ideas which might work for him. The whole process is pretty easy and it was not long, only took half an hour, and several days later I got an offer from the department.", "Interview Questions": "Why you have interest in the research in XXX"}, {"date": "6 Jan 2014", "title": "Associate Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Houston System (Houston, TX) in Dec 2010", "Interview Descriptions": "I saw the position advertised through a professional association. The closing date was that day so I took a chance and emailed the hiring manager about whether I should still apply since it was a sure bet that they already had a lot of applicants. The manager sent back an immediate reply that the department would welcome my application. Soon after I sent my resume and cover letter, I was invited for an interview cycle.", "Interview Questions": "Most of the questions were standard behavior-based interview questions (\"Tell us about a time when...\") with a couple more hard-hitting questions about why I wanted to work at UH. One interviewer didn't seem satisfied with my responses and no matter what I said, she kept asking the same question but phrased slightly differently each time. I was starting to get frustrated but I stayed calm and later I found out that she recommended that I be hired."}, {"date": "21 Sept 2012", "title": "Student Worker - Web Technologies Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at University of Houston System (Houston, TX) in Sept 2010", "Interview Descriptions": "The hiring process might take a while to get through.  Expect at least two weeks.  The interview is very casual.  It would be helpful to bring your previous work samples.  The interview questions can be technical depending on your position.  They will test your knowledge informally.  Other standard interview questions also get asked.", "Interview Questions": "What's your greatest weakest?"}, {"date": "8 Mar 2011", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 5 days. I interviewed at University of Houston System (Houston, TX) in Aug 2010", "Interview Descriptions": "It's isn't really a complicated interview. Tough for my position, I was interviewed by three different people. Generally the case is, you are interviewed by the person( admin or professor) who is hiring. The interviewer asked me about my previous work experience. Did I face any challenges, what are the tools and software I was proficient in.", "Interview Questions": "What is your experience with software languages and tools, did you use any and how"}, {"date": "13 Feb 2012", "title": "Psychology Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1+ week. I interviewed at University of Houston System (Houston, TX) in Aug 2010", "Interview Descriptions": "good and friendly, polite, supportive", "Interview Questions": "describe power"}, {"date": "13 Apr 2013", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at University of Houston System (Houston, TX) in Jun 2010", "Interview Descriptions": "The Interview process was based on mostly past experience questions, such as what kind of research work have you done in the past.", "Interview Questions": "When was one example where you dealt with safety issues."}], [{"date": "19 Sept 2013", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 2 weeks. I interviewed at University of Houston System (Houston, TX) in May 2010", "Interview Descriptions": "An advertisement was placed for student workers.  I responded, and received a phone call to schedule an interview.  I went to the interview, and interviewed with the department head, and then the manager I would report to.  All in the interview lasted about an hour and a half.  I received an offer within 12 hours of completing the interview.", "Interview Questions": "The most difficult questions were related to technical parts of the field - I was intimidated that I didn't have the knowledge; but the interview was more of an assessment of my personality at ethic than anything else.  "}, {"date": "17 Mar 2010", "title": "Undergrad Research Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at University of Houston System (Houston, TX) in Jan 2010", "Interview Descriptions": "I submitted my resume and transcript to the professor the position is under. A couple of days later, the professor emailed me to offer me the position. I would describe the culture as fairly laid back.", "Interview Questions": "There were no interview questions"}, {"date": "24 Jun 2014", "title": "Research Assistant Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 1+ week. I interviewed at University of Houston System (Houston, TX) in Jan 2010", "Interview Descriptions": "They just contact you and tell you that you need to come for an interview and then just like meet Dr. Renu Khator. Khator then she just checks out other candidates and then she approves if there are not any other smart candidates.", "Interview Questions": "There are no unexpected question but Khator has a test that you need to take. Each test is determined by the candidate's year of experience."}, {"date": "5 Mar 2010", "title": "Associate Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at University of Houston System (Houston, TX) in Oct 2009", "Interview Descriptions": "Met with the Department Head and discussed the advantages of the position and how I could best perform the duties.  It was important to have a clear view of where the program was and where it should be going. Specifics weren't needed just a clear plan for overall program growth.  Networking was a key to getting into this interview.", "Interview Questions": "Why do you want this position?"}, {"date": "21 Jul 2010", "title": "Educational Technology Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at University of Houston System (Houston, TX) in Aug 2009", "Interview Descriptions": "You get interviewed by three different groups that are split by the teams within the office.  It was important to have a collective decision and to see if you fit on each team well.  You were also interviewed by your direct supervisor.  The panel interviews were hardest.", "Interview Questions": "Are you a policy driven person or do you believe in expceptions?  "}, {"date": "18 Mar 2010", "title": "Web Applications Developer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at University of Houston System (Houston, TX) in Nov 2008", "Interview Descriptions": "The interview focused on basic OOP concept. Also with emphasis on providing technical support and maintaining existing website. You should also be familiar with deploying the website at their own Windows 2003 server. They have their own domain so must have knowledge about Active Directory and how to manage the domain. Also, you must be good at Adobe Photoshop and Indesign because during international conferences and delegation visiting atleast 3-5 times a year, you may be asked to create logos and also to create posters and/or create a booklet in Indesign.", "Interview Questions": "Why do you want to work for the education sector?"}, {"date": "17 Sept 2012", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 8 weeks. I interviewed at University of Houston System (Houston, TX) in Feb 2008", "Interview Descriptions": "For a PhD position there is no interview.  Just take the toefl and gre or gmat. prepare your statement of purpose.  collect all references. fill out online application. send out your materials. Phone to the secretary and follow up with your application. send emails to the faculty members and introduce yourself.", "Interview Questions": "Why is your GPA low"}]]