[[{"date": "30 Nov 2021", "title": "Support Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 1 week. I interviewed at Sense in Sept 2021", "Interview Descriptions": "I recieved a phone call offering me an interview for later the same day, I was then interviewed via zoom by two of the managers at the company.  The interview lasted around 30 minutes", "Interview Questions": "Why do you want to work for sense "}, {"date": "9 Apr 2021", "title": "Research Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Sense (London, England) in Feb 2021", "Interview Descriptions": "The interview process was pretty straightforward. \r\n\r\nI had been tasked to put together a presentation discussing key insights in data that Sense had provided. \r\n\r\nThe actual interview itself was a panel interview with three Sense employees, where I had spent about 10 mins presenting my findings. After that, we spent the rest of the hour going through typical interview questions.\r\n\r\nAfter this, I did not hear a word from Sense. I had spent over 3 days working on the task itself, and even longer preparing for the interview, and I didn't even get an email saying I was rejected! I chased the HR person who had contacted me initially about the interview but was ignored. \r\n\r\nIf you expect people to give up their time preparing for an interview and working to put together a whole presentation, the least they could expect is an email turning them down!", "Interview Questions": "How do you work in/motivate a team?\r\n"}, {"date": "4 Jun 2019", "title": "Team Leader Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Sense", "Interview Descriptions": "Video interview. Pre recorded interview quetions, had 3 minutes to answer question before moving onto next one. 6 questions in total.\r\nIf passing this, then invited to an assement day in store.", "Interview Questions": "Which manager influnced you career and how?"}, {"date": "8 Dec 2020", "title": "Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. I interviewed at Sense (Stockport, England) in May 2019", "Interview Descriptions": "Interview panel consisted area manger another home manager and two residents. I did not complete application form I sent email for the job I had seen and the area manager asked me to phone her, they were interviewing the next day so I was invited along. I think this was a disadvantage as I wasn't't able to prepare properly which I think was a big disadvantage. The interview consisted of completing 10 point questionnaire as well as the verbal interview", "Interview Questions": "What do you understand by person centred care"}, {"date": "21 Feb 2019", "title": "Manager Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Sense (Birmingham, England)", "Interview Descriptions": "Formal interview and presentation about company core values. I had to create a poster outlining the core values of the company, they loved it so much they said they were going to use it in future.", "Interview Questions": "How would you approach equality between staff and clients?"}, {"date": "20 Jan 2019", "title": "Administrator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Sense", "Interview Descriptions": "There was a timed excercise which involved completing 2 computer tasks, one creative/written and one about numbers, with very little time given for each one. This was followed by a generic 2:1 interview.", "Interview Questions": "What would you do if you saw a service user being treated badly?"}, {"date": "12 Oct 2021", "title": "Support Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Sense (Stockport, England) in Sept 2018", "Interview Descriptions": "Simple questions and answers about basic understanding of care ie the concept of individuals having capacity, confidentiality and the legislations. You need to show that you have the ability to support individuals to enhance their independency and work to promote their dignity", "Interview Questions": "How have you done teamwork"}, {"date": "7 Aug 2018", "title": "H R Administrator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Sense in Jul 2018", "Interview Descriptions": "Group interview session firstly.  Then formal interview the following week. \r\nIn the group session we were given two 'Job Adverts' in which we had to highlight the errors.  \r\nThen a group discussion on problem solving for everyday issues we would face if we were a HR Administrator. \r\nThe formal interview was a standard panel interview with competency questions and a couple of questions about why I want to work for sense, or what attracted me to the role \r\n\r\nI felt very uncomfortable in the group assessment.  One person in particular who works there I felt judged me to the point I felt I shouldn't be there and I wanted to walk out when we switched tasks. I felt very much like they just asked me to come along to fill a chair.  Wasn't a pleasant experience at all.  I was VERY surprised to have been asked back for the formal interview. \r\nAnother interviewee was also pointing out others who weren't saying much in the group session, in front of everyone else, which made me feel like she was out for the win.", "Interview Questions": "Can you tell me a time you worked as a team, personal or work life?"}, {"date": "25 Oct 2016", "title": "Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Sense (London, England) in Aug 2016", "Interview Descriptions": "Prepare a presentation and then attend an 'assessment day'.  It seemed that the organisation got a little carried away with an array of assessments, but had no clue as to how to properly administer or use them.  There was a laughable 'discussion' group that involved the CEO firing questions individually at 3 candidates sat in a row in front of her whilst being observed by no less than 6 note taking minions.  There were SHL tests, but having known each other's scores it was clear that these were not used in the recruitment process (why use them?) and an interview with the extremely condescending CEO.", "Interview Questions": "Fairly basic and mundane interview questions, although some questions were posed that showed an alarming lack of understanding of the actual sector."}, {"date": "2 Sept 2020", "title": "Project Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Sense (Caerphilly, Wales) in Jul 2016", "Interview Descriptions": "Fair and feedback given, the time between closed to applications and getting in touch was speedy and every step explained very clearly.  The interview panel made me feel at ease and company happy to provide communication support i.e reasonable adjustment.", "Interview Questions": "What would you bring to the role"}], [{"date": "23 Mar 2015", "title": "Content Development Writer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Sense (Kings Cross, England)", "Interview Descriptions": "This was not a good interview. I was asked to complete a written to test and then prepare a presentation to give to a panel. I was then told there was an informal interview. There was not. The panel proceeded to ask set questions from a piece of paper, that seemed very robotic and pointless for a Charity job. They were quick to get back with feedback through a phone call, but were incredibly ignorant. They congratulated me on how well I'd done 'seeing as it was my first ever interview.' I am in my mid 20s and have several jobs and successful interviews, as I had discussed in my job history review, so that was completely bizarre. They also then proceeded to give me tips on how to behave in interview, as they did not like the fact that I described myself as 'passionate and caring'. I found that strange and patronising for a Charity job.", "Interview Questions": "What is good copywriting?"}, {"date": "1 Apr 2015", "title": "Head of Retail Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Sense (Crayford, England) in Mar 2015", "Interview Descriptions": "The process was initiated by completing an online application. This was an easy process with few hoops to jump through except for the standard RTW information. I was informed that I had been shortlisted and invited to an interview. In the interim, there were psychometric, reason and mathematic testing. The interview process was to a panel of three. I was invited to deliver a presentation on \"how do you drive sales in a field based team\". I was given the opportunity to ask questions and was provided with encouraging responses.", "Interview Questions": "What do I believe the elements of the role to be?"}]]