[[{"date": "6 Feb 2023", "title": "Facilitator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Compassion International", "Interview Descriptions": "dépôt des dossiers en ligne sur leur site et après on vous contacts si votre dossier répond aux critères ; vous passer le test écrit si vous réussissez , après vous passez l'interview .", "Interview Questions": "pourquoi choisissez vous de vouloir travailler chez compassion?"}, {"date": "14 Mar 2023", "title": "Project Manager II Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Compassion International in Jan 2023", "Interview Descriptions": "Short screening interview on video platform HireVue, (3-4 questions), HR screening mostly about qualifications, testimony and cultural fit, Interview with hiring manager (more technical questions and \"tell me a time when\"), panel style interview", "Interview Questions": "Describe a project you've managed and the tools you used to stay organized"}, {"date": "13 Dec 2022", "title": "Communications Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Compassion International", "Interview Descriptions": "This was a two-part interview with a talent acquisition leader and a hiring manager. I found the leaders to be transparent, accommodating, and flexible. Overall, I came away with a great impression of the organization.", "Interview Questions": "Describe your experience with communications in a corporate setting."}, {"date": "13 Nov 2022", "title": "Marketing Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Compassion International", "Interview Descriptions": "The interview process was as expected and Sraight forward and included an HR screener, an interview with hiring manager, and a panel interview with people you would be working directly and indirectly with.", "Interview Questions": "Talk through a recent project, your role in the project, the process, and results."}, {"date": "8 Mar 2023", "title": "Trainer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Compassion International (Colorado Springs, CO) in Oct 2022", "Interview Descriptions": "Compassion has a very extensive interview process for entry level jobs. I put in a lot of time and effort into this interview process, only for them to hire an internal candidate. I had 5 separate interviews. A phone screening, zoom with a panel, two interviews with the panel in person, and the last interview with the panel and actual manager. I was asked to prepare something and review it with the panel for my third interview. This task took me a lot of time/effort to prepare for. When I went to review it with the panel, I felt that they did not prepare me for presenting the task. I left feeling incompetent and embarrassed and not expecting to continue in the interview process. I was surprised to make the final interview. I was also asked the same questions in almost every interview, which made the process frustrating. The whole process took over two months from start to finish. Each interview was over a week apart. After the last interview, it took them almost two weeks to let me know whether I had gotten the job. The process took way longer than I had anticipated or would expect in the interview process (again, for an entry level position). I think once you get hired, this company is amazing, but they are not super up front about how extensive the interview process can be. They should also be more up front about internal candidates. I would have left this interview process had I known the full scope of the situation. I have heard similar stories from multiple people who have interviewed with Compassion. I will not be applying to this company again.", "Interview Questions": "What previous experience will you bring into this position?"}, {"date": "7 Aug 2022", "title": "Project Director Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Compassion International", "Interview Descriptions": "Great interview. the panel were friendly. Asked many questions on the bible and left out the development questions within the Job description. Could not answer me on what work culture and career path growth.", "Interview Questions": "5 bible verses on children"}, {"date": "14 Jul 2022", "title": "Senior Manger Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Compassion International", "Interview Descriptions": "Many interviews. Group interviews as the final interview. Excessive process, for non C-Suite roles.\r\nFirst call is from HR. Next is setup with hiring manager. Finally, a group interview. \r\nYou have to be liked by the whole group to get the role.", "Interview Questions": "Tell us about yourself? \r\nTell us about what your current role?"}, {"date": "9 Jul 2022", "title": "HR Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Compassion International", "Interview Descriptions": "Very communicative and extensive. Lot of rounds. Overall it was a decent experience. The people were very kind and ask relevant questions. I have no complaints. Very professional. Did a good job answering questions.", "Interview Questions": "Why are you interested in this position?"}, {"date": "5 Jul 2022", "title": "Country Director Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Compassion International", "Interview Descriptions": "One online application, one predictive index assessment, one talent acquisition interview, one panel interview and one interview with management level and the Regional Director. The last interview was very tense and it tested my self-control not to mention my accurate knowledge of specific verses of the Bible. The Regional Director let me know, that the interview would be very \"inquisitive\" as in fact it happened.", "Interview Questions": "Tell me your favorite bible verse?\nShow me how you evangelize! \nWhat would you do if indigenous churches do not want to work with you, because you are newcommer in Compassion?\n"}], [{"date": "9 Aug 2022", "title": "Project Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Compassion International in Jul 2022", "Interview Descriptions": "Online video (asynchronous). Given a prompt, allowed 1 minute to review and 2 minutes to respond. No in person interaction for this portion of the review. It was awkward speaking to a screen without human interaction. There was no ability to go back and re-do the video if you messed up.", "Interview Questions": "What experience do you have working with international populations."}, {"date": "12 Jul 2022", "title": "MEAL Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Compassion International (Ligne, Hainaut) in May 2022", "Interview Descriptions": "Tres stressant mais ca va, attendez vous a des reports de date d'entretien. Mais ca fini par avoir lieu quand meme un jour. Attendez vous  a des questions en boucles", "Interview Questions": "Pourquoi doit-on vous prendre pour cette position?"}], [], [{"date": "4 May 2019", "title": "Facilitador Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at Compassion International (Fortaleza, Ceará)", "Interview Descriptions": "Passei por 3 níveis de entrevistas. No geral as entrevistas ocorreram de maneira simples e sem muitas pressões. A demora no resultado que deixa a desejar.", "Interview Questions": "Porque você acha que está apto para trabalhar nessa empresa?"}, {"date": "17 Apr 2019", "title": "Director of Development Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Compassion International", "Interview Descriptions": "The interview process started with an invitation to do a self-recorded video interview. This instantly put me off as it is a cold welcome to the organization. Automation in the HR process is inevitable, but it unfortunate when it is your introduction to the organization, and this is compounded when that organization is a nonprofit. \r\n\r\nSecond stage of the interview was a phone screening interview. Nothing out of left field here.", "Interview Questions": "How do you set goals?"}], [{"date": "17 Dec 2018", "title": "Senior Software Developer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Compassion International (Colorado Springs, CO) in Nov 2018", "Interview Descriptions": "I applied online and was contacted within 2 weeks. My first interview was over HireVue where I recorded my response to about 4 questions. They included questions like “what is a recent project you worked on and go into as much detail as you can about each layer,” “describe your contributions to any open source projects,” and “what is your experience with Agile.” The second interview was through CodeView with 2 programming questions with the first being 20 minutes and the second being 40 minutes – you can choose what language you write. The next round of interviews was with an IT manager over Zoom where I was asked technical questions like “what are some of the big things going on in the tech industry right now,” “describe full stack development,” and some other questions about my development experience and specific projects on my resume – overall it felt pretty casual which was nice. Next interview was through Zoom with about 3 people from the development team where I was asked more specific questions about object oriented design, the software development lifecycle, my experience with version control, how I handled conflict in projects before, etc. The last interview was with 3 managers where they asked me what kinds of things I wanted/did not want to work on, and some questions from previous interviews. Of course, you get a lot of opportunity to ask questions along the way.\r\n\r\nOverall, Compassion is a great company to interview with and work for!", "Interview Questions": "(40 minutes) Return the number of primes in a given interval. For example, given string “[1,6]” you should return 3"}, {"date": "22 May 2019", "title": "Human Resources Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Compassion International (Colorado Springs, CO) in Nov 2018", "Interview Descriptions": "Wonderful!  Everyone was positive and helpful along the way.  We had an initial phone screening after I applied, did a Hire-Vue interview, and then came onsite.  I was well taken care of the entire process.", "Interview Questions": "Tell me something that God has been teaching you lately"}, {"date": "9 Jul 2018", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Compassion International", "Interview Descriptions": "The interview process was very competitive, but you can  tell how much they care during the hiring process to find the best fit candidate. You first have to apply with an online application, then if you are moved forward the next step in a video recorded interview. It was very easy to do on your home computer or laptop. If you are moved on, the next step is an interview with a Recruiter to narrow down the applicants in your field. The final interview is usually down to just a few candidates and is with the supervisor who would be hiring you. You then receive a call from the Recruiter who interviewed you in step three if you receive an offer.", "Interview Questions": "Name a situation where you had to deal with conflict and how you handled it."}, {"date": "18 Aug 2019", "title": "Estagiário Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at Compassion International (Fortaleza, Ceará) in Jul 2018", "Interview Descriptions": "Três etapas com a última sendo com o supervisor do setor. Durante o processo foram feitas perguntas pessoais e por ser uma Organização Cristã, foi perguntado em quais ministérios estava engajado e se eu entendia muito bem a missão que a Instituição exercia.", "Interview Questions": "Você tem certeza que possui o que é necessário para essa vaga?"}, {"date": "8 Jun 2018", "title": "M& E Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Compassion International (Accra)", "Interview Descriptions": "Interview with 3 member panel followed by a thorough exam. \r\nThe interview opens with asking the candidate to say a Christian prayer (obviously not a working environment for non-Christians)\r\nThe questions were quite difficult to understand/ambigous and several times had to ask for an explanation.\r\nOne panelist consistently challenged and downplayed my work experience and seemed to make it a point to call into disrepute my work experience which could easily be verified from my current supervisor.\r\nDecided half way during the interview this was probably not my ideal working environment .\r\nA follow-up call suggested that they would want to visit my current working organization for referrals (weird?)\r\nWas invited for a second interview with the director. Few minutes prior to that was asked some very uncomfortably probing questions about my family (relationship with my parents and family etc). Meeting with director was very brief, (15-20 minutes). Contacted within next four weeks about non-offer.", "Interview Questions": "Do you have a good relationship with your father (WHAT???).\r\n"}, {"date": "10 May 2018", "title": "Partnership Facilitator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Compassion International (Dhaka)", "Interview Descriptions": "Job vacancy advertisement in different magazines, apply through hard copy and got a call from office over phone if selected for interview. A written test will be followed by a viva in front of an interview panel. It may also take a second viva if required. The whole process may take two weeks to four weeks.", "Interview Questions": "What is your experience of salvation?"}, {"date": "19 Feb 2022", "title": "Auditor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Compassion International (Nairobi) in Mar 2018", "Interview Descriptions": "Online and physical. There is a mix of online questions and as you advance through the stages, you receive an opportunity to have a one-on-one interview with the top management.", "Interview Questions": "1. What will you do differently if offered the position of an auditor."}, {"date": "7 May 2018", "title": "Partnership Facilitator Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 5 months. I interviewed at Compassion International (Kampala) in Feb 2018", "Interview Descriptions": "The Interview involved two steps. Aptitude and oral. 3 months passed after interview for aptitude And I was called for oral. They ask biblical questions and others. They have never given me feed back. 2 months now", "Interview Questions": "What bible guide do you study. Give is two bible scriptures."}, {"date": "28 Jan 2018", "title": "Software Development Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Compassion International", "Interview Descriptions": "First, I filled out an application online. This was proceeded by a video interview, then a chat over the phone with somebody about my faith, and finally an interview with department managers over Zoom", "Interview Questions": "Tell me about your faith"}], [{"date": "9 Jan 2018", "title": "Research Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Compassion International (Colorado Springs, CO)", "Interview Descriptions": "Very lengthy interview process completed in a few weeks (maybe a month total). Phone screening with a recruiter, hiring manager, another team member. Once those were passed brought out a few people to interview in Colorado. There was another 3-4 interviews, then one final video interview after. \r\nThought it was good they were so thorough but was definitely more than I've experienced before.", "Interview Questions": "First screening a few faith questions and role related. Some technical but a lot situational. How you would handle different scenario's and what your approach would be. "}, {"date": "24 Jun 2022", "title": "Finance Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 7 months. I interviewed at Compassion International (Kampala) in Jan 2018", "Interview Descriptions": "Written test, Christianity interview and oral interview. They don't provide feedback after interview and will take time to know what the results are. Kind of biased in field recruitment. Questions like what is your commitment to God? How do you maintain commitment with God.", "Interview Questions": "How do you read the bible?"}, {"date": "13 Nov 2017", "title": "Translator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Compassion International (Santo Domingo)", "Interview Descriptions": "You get an exam to test your language ability, and a form to fill out with personal details like phone number, age, full name, the basic stuff; they tell you that you are free to go after the exam,", "Interview Questions": "N/A"}, {"date": "11 Nov 2017", "title": "Photojournalist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Compassion International in Oct 2017", "Interview Descriptions": "After sending my resume, I was contacted by the HR Representative via email, a friendly person.  The HR representative explained the steps to follow during my application. \r\n\r\nAt first, you will answer some questions prepared for you while you are recording videos of your answers. No worries, they send you a link including a code to access a website where they have the questions.\r\n\r\nIf you make it after the first round, the HR representative will contact you for a video. If the HR representative approves your application, the next step of the process is being interviewed by the Hiring manager.\r\n\r\nThis Org. is very friendly. You only have to be a professional in your area of work. \r\nGood Luck!", "Interview Questions": "Faith, Testimony, photo techniques, and journey preparation."}, {"date": "27 Mar 2018", "title": "People Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 months. I interviewed at Compassion International (Bandung, West Java) in Oct 2017", "Interview Descriptions": "The interview session was too brief and to me it seems like the user and HR have already got their conclusion before having an interview session with me, and so the interview was conducted for formality purposes only.", "Interview Questions": "tell us about your leadership experiences?"}, {"date": "10 Oct 2017", "title": "IT Support Manager - Latin America Region Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Compassion International (Santo Domingo) in Sept 2017", "Interview Descriptions": "Video Interview via Hirevue app, in which they prepared some questions that I had to answer by recording myself and at the end, all the videos of all questions packs and send to them", "Interview Questions": "Tell me something that, in your managing experience, it represented a deep challenge to you"}, {"date": "10 Apr 2017", "title": "SDS Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Compassion International (Santo Domingo)", "Interview Descriptions": "They take the time to know you, learn your skills, strengths, and place you were better you are prepared for (in most of the cases). Also they are willing to wait for you if you are what they are looking for.", "Interview Questions": "Talk about your previous jobs"}, {"date": "10 Mar 2017", "title": "Market Research Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Compassion International", "Interview Descriptions": "There was an introductory interview with a recruiter on the phone which lasted about 30 minutes and then an hour phone interview with the hiring manager. I applied for two intern positions and was given an interview for just one.", "Interview Questions": "Talk about a time that you failed and how you responded to that. "}, {"date": "10 Feb 2017", "title": "Office Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Compassion International (Colorado Springs, CO) in Jan 2017", "Interview Descriptions": "The process was lengthy but fairly easy. I had 3 interviews. The first was on the phone with HR, the second was on the phone with the Hiring Manager, and the third was in person.", "Interview Questions": "Faith and experiential job based questions. Prepare for typical \"tell me about a time when.....\" types of questions."}, {"date": "18 Jul 2017", "title": "IT Software Developer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Compassion International in Jan 2017", "Interview Descriptions": "After filling out the application I was asked to answer some question via HireVue, from there I was called by the recruiter and then by the managers who would be overseeing me.", "Interview Questions": "No technical questions but questions about problem solving and my faith"}], [{"date": "24 Jan 2017", "title": "Regional Walk Field Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 2 weeks. I interviewed at Compassion International in Jan 2017", "Interview Descriptions": "Found listing and applied online. Had an initial phone screening call followed by a second phone interview. Next was an in person interview at the home office. Was interview by team of three. Pleasant experience.", "Interview Questions": "Mainly asked worked experience and situational questions."}, {"date": "4 Aug 2017", "title": "Administrative Assistant III Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Compassion International (Colorado Springs, CO) in Dec 2016", "Interview Descriptions": "First, I received an Initial e-mail. Then, we set up a phone call interview with recruiter. Another 2nd round phone call interview with recruiter. Lastly, I met the hiring manager and supervisor for an in-person interview. The next day, I got an e-mail to call them, and they told me I was hired.", "Interview Questions": "Describe a challenging experience at work, and how you overcame it."}, {"date": "28 Dec 2016", "title": "Accounts Payable Clerk Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Compassion International (Colorado Springs, CO) in Dec 2016", "Interview Descriptions": "Compassion starts with a phone interview during which they indicated to me how many candidates were being interviewed (3 others in my case) and get your basic faith statement and brief job history.", "Interview Questions": "Tell me about a time you were able to provide excellent customer service?"}, {"date": "20 Jul 2016", "title": "Quality Assurance Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Compassion International (Colorado Springs, CO) in Apr 2016", "Interview Descriptions": "Since Compassion is faith based, I had a phone interview with HR around my personal faith and then had an in house interview with the supervisor.  My resume did not seem to be as important as attitude and the ability to be flexible and teachable.", "Interview Questions": "What do you perceive as the biggest negative perception of a QA team and what might you bring to the team to help counter balance that?"}, {"date": "29 Jan 2016", "title": "Vision Trip Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Compassion International (Colorado Springs, CO) in Sept 2015", "Interview Descriptions": "I interviewed, made it through several levels, didn't get the job, but was told I was a top finalist & they really liked me.  A second position opened up & they wouldn't even contact me back to tell me I didn't get the job.", "Interview Questions": "Why was a good fit for the position."}, {"date": "28 Jul 2015", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at Compassion International in Apr 2015", "Interview Descriptions": "Referred to position by an employee. I believe that expedited the interview process. I've heard from many others that the application process takes much, much longer - months, not weeks. From applying to hiring took 3 weeks.\r\n\r\nStarted with an easy phone screen with an HR recruiter. Then a one-on-one interview with the hiring director the next day. Finally a group interview with other managers on the team two days later.\r\n\r\nOffer was given on a Friday and I was given the weekend to consider it. Did not negotiate salary. Accepted the position the following Monday.", "Interview Questions": "How do you handle serving several teams with conflicting deadlines?"}, {"date": "22 Apr 2015", "title": "Mobile Experience Regional Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Compassion International (Colorado Springs, CO) in Apr 2015", "Interview Descriptions": "Submitted resume online, received a call for an interview with HR, moved to 2nd interview with Director, and then brought in for interviews with various people of the team.  The people were all very nice.  Seemed liked a great place to work.  Highly recommend Compassion.", "Interview Questions": "Emphasized team dynamics & experience in events"}, {"date": "11 Feb 2015", "title": "Senior Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 1 day. I interviewed at Compassion International (Colorado Springs, CO)", "Interview Descriptions": "I had one interview which I was told I would get a call back. I did not receive a call back until I made an inquiry. I come to find out that they had already selected another internal employee and only went through the process to place the other individual into the position.", "Interview Questions": "How are you qualified?/\r\n\r\nWhat types of issues have you dealt with in previous positions"}, {"date": "3 Mar 2015", "title": "Intern Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Compassion International in Jan 2015", "Interview Descriptions": "First, there was a quick video interview that was submitted to hiring managers. Second, I was contacted via phone for a general interview with the intern recruiter. Third, I was contacted by the department manager for a more specific interview. Everyone was very friendly and easygoing.", "Interview Questions": "Nothing too difficult. Mostly questions about your faith."}, {"date": "5 Oct 2015", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Compassion International (Colorado Springs, CO) in Jan 2015", "Interview Descriptions": "The initial application includes several short essay questions and requires you to upload your resume.  The next step is to complete a video interview (HireUp). There were about three questions and they were all behavior based- short and concise is best! Then I had  a thirty minute phone screen with HR and ended with an hour long phone interview with the hiring manager. The process moved pretty quickly and all interactions with the organization were friendly.", "Interview Questions": "What do you know about Compassion?"}], [{"date": "23 Jan 2016", "title": "Intern Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 4 weeks. I interviewed at Compassion International in Jan 2015", "Interview Descriptions": "The first round has brief essay questions that are completed along with resume, faith statement, etc. The second was an initial phone screen with HR. Following the screen, spoke with a director of the department.", "Interview Questions": "Q: How have you made your faith your own?"}, {"date": "4 Sept 2015", "title": "Strategic Business Partner Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Compassion International (Colorado Springs, CO) in Nov 2014", "Interview Descriptions": "Over the last few years I have applied for a couple of different positions.  The first position I never heard anything from them, the only way I knew they were no longer interested was by checking their website and finding the application had moved from open to closed (which that in and of itself took 3-4 months).  The second time it was a similar experience.  Then after they closed my second application they called me and asked if I would be interested in a similar position.  We discussed the position and found it aligned almost identically with what I was currently doing.  They had me fly to their office and meet with the various people in the department and with people this position interacted with outside of their department.  The people were very nice and it was a very encouraging experience.  This disappointment came in when at the end of the day I was finishing up with the executive recruiter and he was discussing next steps, I asked him what the timing would be in hearing back from them.  He said \"You are exactly what we are looking for, if I have may way you will have the job and we should be able to get in touch with you by the end of the week, possibly the beginning of the following week.\"  Well I didn't hear back from them for more than two weeks and it was by email.  My belief is if you fly to an organization for a face to face interview, you should be given the courtesy of a verbal conversation when not selected.  I ended up calling them to understand better what happened since I was told I was basically an ideal candidate.  It was a good conversation and I don't have any hard feelings, but it was a bit confusing and I felt I got several mixed messages.", "Interview Questions": "Why are you looking to work for us?"}, {"date": "9 Oct 2014", "title": "Email Marketing Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Compassion International in Mar 2014", "Interview Descriptions": "Had an initial phone interview which I thought went well although much of it was directed at your faith and coming to know Christ.  Which based on the organization and what they do is fair but it did seem as though being a \"professional Christian\", if you will, played a bigger role during the interview than talking about your actual job skills. Overall the experience was negative because even though I thought the interview went well I heard absolutely nothing in regards to next steps or in this case that they had chosen another candidate.", "Interview Questions": "\"What steps do you (have you taken) to make your faith your own?\""}, {"date": "23 Oct 2014", "title": "Mobile Experience Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Compassion International in Feb 2014", "Interview Descriptions": "Applied through their website. Initial phone screening was pretty basic. Second round was detailed questions about data analysis experience, and some general questions. HR was very good about contacting me, and were sympathetic over the phone, when they informed me another candidate had accepted the position. This is a great organization!", "Interview Questions": "How do you define excellence?"}, {"date": "8 Dec 2014", "title": "Director Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Compassion International in Jan 2014", "Interview Descriptions": "Applied online through website, got email asking to set up phone interview. Spoke on phone with HR person, then the put me onto head of department for another interview on another day. Both went well and as expected. Asked about faith, life, work experience. Really wanted to push the importance of being 100% behind their mission specifically.", "Interview Questions": "You basically need to be 100% into the mission of Compassion (not just the idea but the process / org chart / etc). They explained the internal org chart which was a little unexpected based on what I thought the position was."}, {"date": "28 Jan 2018", "title": "Part Time Marketing Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Compassion International (Colorado Springs, CO) in Jan 2014", "Interview Descriptions": "The interview was a two-part process. I was called in for one interview where I was interviewed by a single manager, and then I was called back for a second interview where I was interviewed by a panel of people. The interviewers were kind and the process was conversational and not very formal. They were more interested in my experience than my education.", "Interview Questions": "Have you joined a local church?"}, {"date": "11 Sept 2015", "title": "Country Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Compassion International (Colombo, Western) in Oct 2013", "Interview Descriptions": "There were more than 30 applicants according to the Regional Vice President then. 3 interviews held, and two were finalized. None of the two finalists were selected but one who had no qualifications and failed at the first interview was selected finally. This was reported to the whistle-blowing system but accepted the RVP's decision as final.", "Interview Questions": "What weaknesses do I see in the overall management of the organization?"}, {"date": "24 Jul 2013", "title": "Senior Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 3 months. I interviewed at Compassion International (Colorado Springs, CO)", "Interview Descriptions": "Compassion International has an insane hiring process. Because of the fact that they are a completely faith based organization the law determines that belief is a BFOQ (Bona Fide Occupational Qualification). The statement of faith is often scrutinized beyond what is fair. If you cannot articulate your Christianity in terms of Evangelical, protestant, conservative theology you probably are better off not applying. I had a total of 5 interviews then I had a mock performance interview for public speaking.", "Interview Questions": "Tell me about how you came to know Jesus"}, {"date": "28 Jan 2013", "title": "Events Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Compassion International (Colorado Springs, CO)", "Interview Descriptions": "Phone screening interview, followed by an in-person interview with HR and office manager. Questions were very general. Initial interview to gain insight on applicant's spiritual foundation and if he/she would make a good match for Compassion. Questions also focused on work style, how one handles stress and inter-office relations. Also asked to highlight work experiences.", "Interview Questions": "Tell of a time when you made an innovative new process and tell us about it.  Most questions were general, not particularly difficult."}, {"date": "3 Aug 2015", "title": "Marketing Specialist Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Compassion International (Colorado Springs, CO) in Nov 2012", "Interview Descriptions": "It was extremely personable and friendly, but not at all challenging or forward thinking. All of the questions were canned, rigid, and can be found on a top list of questions to stop asking job-seekers.", "Interview Questions": "What's your greatest weakness?"}], [{"date": "22 Apr 2012", "title": "Financial Forecasting Intern Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Compassion International (Colorado Springs, CO) in Feb 2012", "Interview Descriptions": "A generic phone interview is conducted by the human resources department in which the same questions are asked to all applicants for summer internships. From these interviews, three or four candidates are selected to continue on to a secondary phone interview which is specific to the internship they applied for.", "Interview Questions": "What are three things you feel that you would be able to offer to the organization if you were hired to this position?"}, {"date": "12 May 2015", "title": "Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Compassion International (Colorado Springs, CO) in May 2011", "Interview Descriptions": "It took several months to hear back after the submission of my CV. The interview process had several rounds, and multiple people were involved. They seemed to cover all their basis. Overall, more rigorous than others I'd experienced, which I think is a good thing.", "Interview Questions": "They ask about my Christian faith. This is non-negotiable. "}, {"date": "30 May 2013", "title": "ISDS Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Compassion International (Colorado Springs, CO) in Apr 2009", "Interview Descriptions": "Compassion's hiring and interview process, at least for me, was very smooth and hassle-free. As with most jobs, networking certainly helps: Compassion receives thousands of applications a month as it is one of the most desirable Christian ministries to work for in the world. I recall about a two-week window from when I applied to when I was hired, but this is not typical -- most applicants wait at least three months to receive an initial phone call if they're being considered.\r\n\r\nThe interview itself was calm and enjoyable overall -- my position was basically entry level and the interview questions were therefore what you would expect: \"Tell us about a time when you had a conflict and how you resolved it,\" \"What are your strengths and weakness?\" \"Where do you see yourself in five years?\" etc. Their favorite questions seems to be \"What are you passionate about?\"\r\n\r\nAfter the interview, which was probably about 45 minutes, they got back to me the next day and offered me the job. Again, an atypically fast hiring process from start to finish, and I enjoyed it.", "Interview Questions": "\"What are you passionate about?\" Make sure your answer is substantial and meaningful. For example, don't put all your chips on the fact that you're passionate about Ultimate Frisbee."}]]