[[{"date": "1 May 2023", "title": "Operations Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Metropolitan Thames Valley (Farringdon, England)", "Interview Descriptions": "The interview process involved submitting a cover letter as part of the application process, followed by an invitation to attend an in-person interview upon being selected. During the interview, standard questions were asked, but despite multiple attempts to follow up afterwards, no feedback was provided.", "Interview Questions": "Example of providing data and trend reports to Management Example of building and maintaining positive working relationships with key internal and external stakeholders"}, {"date": "24 Oct 2022", "title": "Data Quality Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Metropolitan Thames Valley (London, England) in Sept 2022", "Interview Descriptions": "2 Stage interview: - First stage interview with the Head of Data to talk about my experience and for him to talk me through the role and so that I understood what I'd be doing and if the role was a good fit for me. - Second was with the Team Lead and an in-depth technical assessment of my knowledge of their technologies and my technical capabilities. It was all very friendly and more of conversation around my skills and understanding of technologies. It was also good to get a very clear understanding of the scope of the role and possible development in the future!", "Interview Questions": "A series of questions around : - SQL scripting - Identifying Data Quality issues. - Stakeholder management - Translating business requirements into technical requirements."}, {"date": "21 Dec 2021", "title": "Income Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Metropolitan Thames Valley", "Interview Descriptions": "Competency based questions preparation needed in advance, it’s a good idea to print out all of the relevant job role information and have this to hand before the interview to refer to.", "Interview Questions": "Competency based questions were asked"}, {"date": "14 Jul 2021", "title": "Sales Progression Administrator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Metropolitan Thames Valley in Jul 2021", "Interview Descriptions": "Dreadful and discriminatory. Totally unprofessional closing questions asked. What do you like to do in your free time...Do you like a drink?\r\nHow many gin and tonics can you take? Reported this directly to Chief Executive so this can never happen again and she can get across the shocking culture in this department.", "Interview Questions": "What do you like to do in your free time...Do you like a drink?\r\nHow many gin and tonics can you take?"}, {"date": "31 Mar 2021", "title": "Junior Ruby Developer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Metropolitan Thames Valley (London, England) in Mar 2021", "Interview Descriptions": "Had a 30minutes video call with the CTO. Was friendly, relaxed and  just went off my CV. 2nd stage was a 2hrs coding interview. Started with a code review in ruby which was very simple (30 minutes), then had 90minutes to build a Rails application and questions at the end. Know your controller-model-view, adding data to your database etc. Ensure you know how to use your github too (It's obvious but just incase) . Overall, it's not hard, just go over your rails and you should be good.\r\n\r\nThe con is, after the interview, no feedback is provided which I think leaves a bad impression on the company, regardless how nice they are at each stage. Considering the time you spent preparing and all the effort that goes into applying for a job. I think it would be really nice if companies spared at least 5minutes to explain why a candidate isn't selected, especially if you keep saying you 'really enjoyed this interview' at the end of it. I think it's somewhat respectful.", "Interview Questions": "What you are working on.\r\nDo you have knowledge of docker, AWS(they said it's not needed but asked anyways)\r\n"}, {"date": "10 Mar 2021", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Metropolitan Thames Valley in Feb 2021", "Interview Descriptions": "Hear back form the manager via telephone call. Then had an interview via teams with two managers. I also had to complete an assessment straight after the interview and have it sent back to them within half an hour. I heard back the results the next day.", "Interview Questions": "Give me an example when you have asked someone for a favour "}, {"date": "13 Feb 2021", "title": "Third Line Support Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Metropolitan Thames Valley in Jan 2021", "Interview Descriptions": "Spoke with recruiter first. Then received an email from the manager asking if I had 15 minute to spare on that day of the first interview, so wasn’t prepared and not told in advanced from the recruiter or the company. All questions asked were technical at a quick pace. Approach of these quick interviews were unprofessional and clearly don’t care about me since they didn’t ask in depth of how I can fit as an individual.   They didn’t even ask if I wanted to ask questions.\nI found out I didn’t get it after a week from the recruiter and expressed my opinion. Then only to find out a few days after the company replied back with a generic statement that I didn’t get it.", "Interview Questions": "What do you know about this company?"}, {"date": "17 Aug 2020", "title": "Complaints Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Metropolitan Thames Valley", "Interview Descriptions": "Fine, friendly people, nice office. Social Housing company (not for profit), looking for care and compassion whilst being business minded. Overall, a good experience, staff seamed happy enough which was a positive sign.", "Interview Questions": "How do I deal with my team"}, {"date": "16 Jan 2021", "title": "Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at Metropolitan Thames Valley in Jul 2020", "Interview Descriptions": "15 minute presentation followed by an interview by 2 senior managers. Lasted just over an hour. Pleasant experience, fair questions.   All done over Zoom. They took ages to come back to me; almost 8 weeks. They re-adverstied the role whilst telling me things were taking longer because of Covid and that they had a couple more interviews booked (I could see the advert online). Thought that was wildly dishonest. A real shame, because besides that it was a pleasant experience.", "Interview Questions": "How would you manage difficult stakeholders "}, {"date": "5 Jan 2020", "title": "Customer Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Metropolitan Thames Valley (Nottingham, England) in Dec 2019", "Interview Descriptions": "Really relaxed atmosphere in the interview. The panel consisted of 2 people and started with a 30 minute writing assessment that involved answering a complaint (this was point scored post-interview). This was followed up with a discussion about my experience and suitability for the role. Questions were all relevant and I was given plenty of opportunity to elaborate and ask questions if required.", "Interview Questions": "Name a time where you had to use your power of persuasion to influence a managers decision. "}], [{"date": "22 Jun 2020", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Metropolitan Thames Valley (London, England) in Oct 2019", "Interview Descriptions": "I was contacted shortly after sending in my CV,  and invited for an interview. The process was quite seamless. The interview itself was quite tough, as the job was at Senior level. However, the interviewers were lovely. There was a task to do beforehand, which I really got stuck into, as it gave me the chance to get to know the company, and to see what the job would be like.", "Interview Questions": "What makes you resilient? "}, {"date": "22 Oct 2018", "title": "Service Charge Officer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Metropolitan Thames Valley", "Interview Descriptions": "Interview was okay, however the best part was the interviewer contacted my employer without consent, he has a friend working at my current employer, his friend went onto my manager and said I had a interview! CEO has ignored my e-mails too.  Please be careful as they will get in touch without consent.", "Interview Questions": "N/A"}, {"date": "26 Sept 2018", "title": "H R Administrator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Metropolitan Thames Valley (Southgate, England) in Jul 2018", "Interview Descriptions": "Applied online with CV and a personal statement/reasons why you think you would be good for the job. Was not told of interview outcome I had to contact them.", "Interview Questions": "Tell me about yourself"}, {"date": "31 Jan 2018", "title": "HR Business Partner Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Metropolitan Thames Valley (London, England)", "Interview Descriptions": "I completed the on line application process and heard back within 2 weeks. My interview date was quite flexible as they had a number of days they were seeing a candidate. I called a day before to secure the time and venue . \r\n\r\nThe stage 1 interview it self was another person . I found the interviewer to be impersonal and cold . There were ackward moments like on the way to the interview room. I tried to engage in small talk just to make it more naturally but did not get anything back.  The experience I will be taking away from this company is that the interviewer (who is the brand of the organiser) appearing cold and unapproachable . There was also only 1 interviewer making me that  she was looking for someone who she can get on with rather than what you have to offer. In my opinion the interviewer did appear to come across  Very hard faced with no intention of wanting to build any kind of rapport.", "Interview Questions": "The interview questions were competency based . Eg Tell me about a time when you were challenged by a manager , have you dealt with data ? "}, {"date": "15 Sept 2017", "title": "Customer Service Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Metropolitan Thames Valley", "Interview Descriptions": "Was quite a lengthy process. An online test was completed prior to being offered an interview. The day of the interview was around three hours. Very friendly and welcoming. Though the outcome is still unknown.", "Interview Questions": "Tell me about a challenging manager."}, {"date": "13 Sept 2017", "title": "IT Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 7 weeks. I interviewed at Metropolitan Thames Valley", "Interview Descriptions": "Via a portal from an agency.  There was an initial call with the agent about my experience and information about the organization. Two rounds of interviews,  one general and the other competency based. They had typical drill down questions based on past roles and what they were looking for.", "Interview Questions": "Tell me about a time you ... (based around job spec)"}, {"date": "12 Feb 2019", "title": "Complaints Handler Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Metropolitan Thames Valley (Nottingham, England) in Sept 2017", "Interview Descriptions": "Written assessment, presentation, three person panel. Nothing that makes the company stand out ahead of any other. Panel consisted of people that had been with the company for years and it showed. No experience of anything outside of the company and stuck in their own ways. I now understand why the reviews are not great. Spent three hours with them and not even a 'thanks but no thanks' was provided. Two requests for feedback were ignored. If this is interview stage, I only imagine how bad employees are treated.", "Interview Questions": "Tell us about a difficult situation you resolved. "}, {"date": "26 Jul 2017", "title": "Assistant Management Accountant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. I interviewed at Metropolitan Thames Valley (London, England)", "Interview Descriptions": "In person interview followed by MS Excel test. The interview process was straight forward and easy. The Excel test was not hard, you don't have to be an expert to do well.", "Interview Questions": "The interviewer gradually increased the difficulty of the technical questions until I got one wrong."}, {"date": "16 Oct 2016", "title": "Senior Care and Support Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Metropolitan Thames Valley (London, England)", "Interview Descriptions": "Applied online. Four weeks later they called me for an interview. One week after the call I went for an interview. The interview had two parts, first a case with answers and the second a normal interview. The two ladies where very nice and the environment was very relaxed. After one hour of interview I was out.", "Interview Questions": "What would you do to help a user that comes to the service?"}, {"date": "16 Aug 2018", "title": "Management Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "The process took 1 week. I interviewed at Metropolitan Thames Valley (London, England) in Nov 2015", "Interview Descriptions": "Was interview, panel was 2 people, didn’t have a idea how to interview was taking calls and texting - Ended up just discussing anything, very easy process as panel was so bad at the process", "Interview Questions": "What could you bring to metropolitan "}], [{"date": "16 Mar 2016", "title": "Customer Service Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Metropolitan Thames Valley (Nottingham, England) in Jul 2015", "Interview Descriptions": "Easy, straight forward, more on the job interview than formal interview, friendly staff / management who interviewed, offered drinks and friendly team when walking through the office for the interview, didn't feel nervous.", "Interview Questions": "Name me three good skills"}]]