[[{"date": "27 Oct 2022", "title": "Instructional Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at College of DuPage", "Interview Descriptions": "This was a very straightforward, simple, and comfortable interview process. Phone interview followed by one in person interview. They asked your basic interview questions. Everyone was very friendly and welcoming. Very good experience overall.", "Interview Questions": "How would you handle a student who is getting emotional and angry during your interaction?"}, {"date": "9 Jan 2023", "title": "Outreach Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at College of DuPage in May 2022", "Interview Descriptions": "Invitation to a phone interview with the director, followed by invitation for a zoom interview with director, followed by an invitation to interview with the team via Zoom. It was overall a great experience and everyone was very kind and approachable.", "Interview Questions": "What was a project that I directly led or organized, what were steps that I took and what was the results? What type of leader are you?"}, {"date": "24 Mar 2022", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at College of DuPage", "Interview Descriptions": "Interview process was an average interview like most general interviews, staff were really nice as well as positive throughout the whole process. Overall environment was a positive experience, highly reccomend.", "Interview Questions": "Tell me about yourself?\r\nPrevious experience?"}, {"date": "24 May 2021", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at College of DuPage", "Interview Descriptions": "During the interview,  I was first given some additional information about the college and the position. Next, I shared projects from my personal portfolio that showcased my expertise and teaching experience. Then, I gave a 15 minute teaching demonstration they had asked me to prepare on a topic of my choice. Finally, they had a few interview questions to ask me, and I had an opportunity to ask questions as well.", "Interview Questions": "What was a difficult work/teaching situation you encountered in the past and how did you respond?"}, {"date": "8 May 2018", "title": "Data Entry Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at College of DuPage", "Interview Descriptions": "The interview was fine but their HR dept is very slow. Expect to wait months before hearing anything? Questions include topics like team work, balance, organization, etc. Each interview will be conducted by your specific hiring manager so there will be a lot of variance.", "Interview Questions": "How do you balance conflicting priorities"}, {"date": "6 Mar 2018", "title": "Student Affairs Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at College of DuPage", "Interview Descriptions": "The process was very long, but the interview was not challenging.  There was a basic presentation component and Q/A, but questions were pretty straight forward.  HR is always a challenge to work with in higher education.", "Interview Questions": "Where do you see yourself in 5 years"}, {"date": "8 Sept 2017", "title": "Instructor, College Or University Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at College of DuPage (Glen Ellyn, IL)", "Interview Descriptions": "Once the hiring committee is interested in a candidate, the next step is a Skype, or in-person interview with the hiring committee. If the committee is still interested in the candidate, the next step is an in-class teaching demonstration. The outcome of these steps determines next steps.", "Interview Questions": "What is your teaching philosophy?"}, {"date": "24 May 2017", "title": "Humanities Professor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at College of DuPage", "Interview Descriptions": "The hiring process involved a video chat interview followed by a teaching demo. The video chat was about 20 minutes long. The hiring committee was in a conference room and it was distracting because they did not cover the door, so you could see people walking by the glass door constantly throughout the interview. They took turns asking questions and the associate dean did not participate beyond taking notes throughout the interview. I was not invited for a second interview, although they told me that second interviews would involve a day long campus visit with a teaching demonstration for one of the full time faculty members' classrooms. I applied in the fall, I was called in March to schedule an interview on two days notice, and was not notified until May 19th that the search had been closed. The entire process seemed to be unorganized and lacked consideration of the applicants.", "Interview Questions": "How do you view the role of Community Colleges in Higher Ed? How do you promote diversity in the classroom? What motivates you? How do you define humanities?"}, {"date": "8 Apr 2017", "title": "Adjunct Faculty Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at College of DuPage (Glen Ellyn, IL)", "Interview Descriptions": "Typical interview. Met with the Dean, was asked questions about teaching philosophy and classroom management. I answered the questions and provided my qualifications. We made small talk. Then, the interview was over.", "Interview Questions": "What is an example of when you had to deal with a difficult student and how did you handle the situation? "}, {"date": "15 Dec 2019", "title": "Police Desk Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at College of DuPage (Glen Ellyn, IL) in Jan 2017", "Interview Descriptions": "It was easy brief not hard simple understandable bare minimum effort and low expectations aswell as little experience was required for a free day of a free food drink and free coffee and a yes but", "Interview Questions": "Why"}], [{"date": "9 Dec 2015", "title": "Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at College of DuPage", "Interview Descriptions": "Asked about the role of the teacher in a community college and how it differed from teaching in a university.  A teaching demonstration was required and then several questions were asked about the demonstration.  After interviewing with faculty, several interviews happened with administration.  Curriculum and committee opportunities were discussed.  There were many questions about previous teaching experiences and how they related to the current job opening.", "Interview Questions": "What are the roles played by a community college instructor?"}, {"date": "11 Jun 2015", "title": "Adjunct Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at College of DuPage", "Interview Descriptions": "Because I was referred through from a friend working at the College at the time, I did not have an interview at all. I was hired based on my credentials. Once hired I was reviewed the same semester, Summer 2013 and was given feedback. Since then I have been teaching every semester.", "Interview Questions": "Discussed credentials and timings available to teach via email with the dean. She was amazingly nice and understanding of my job commitment and allowed me to start classes once I was more open."}, {"date": "14 Sept 2016", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at College of DuPage (Glen Ellyn, IL) in Jun 2014", "Interview Descriptions": "The interview was very relaxing and calm.  The room wasn't too big and the number of people I met with was reasonable for the job expectations.  During the interview, questions were well thought out and appropriate.", "Interview Questions": "What is your strength as an instructor?"}, {"date": "1 Mar 2014", "title": "Clerical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at College of DuPage", "Interview Descriptions": "No interview was made due to knowing a professor who needs assistance to supervise an engineering seminar on a weekend. Due to my collaboration with my future supervisor, I later did work on the side during the weekends prior to the year ending and being hired on the spot as a student worker.", "Interview Questions": "Nothing ever happen with questions."}, {"date": "10 Sept 2018", "title": "Program Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at College of DuPage (Lisle, IL) in Jan 2014", "Interview Descriptions": "Very straight forward.  It was a phone interview and then I met with the office leadership.  The questions asked and the general format were standard HR in nature.", "Interview Questions": "What is your client interaction style?"}]]