[[{"date": "2 Jun 2023", "title": "OFFICE SPECIALIST Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 days. I interviewed at Baptist Health (Florida) (Jacksonville, FL) in Apr 2023", "Interview Descriptions": "The process in my experience has been not bad at all. Received a email regarding setting up an interview within less than a week. Was able to schedule interview time a few days later. That same day after the interview a few hours later I was informed by the recruiter that I got the Job!", "Interview Questions": "Tell us a little about your self What would you say the best thing you would bring to this office? Would you be okay working (office schedule and times)"}, {"date": "22 Feb 2023", "title": "Medical Records Clerk Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Baptist Health (Florida) in Feb 2023", "Interview Descriptions": "I have had the first interview so far with a recruiter, and it went well. I have the second interview coming up soon, and I believe after the second interview, they will let me know if I have been selected or not.", "Interview Questions": "How did you come across this job posting? How does your background relate to this position? What are you looking for compensation wise? Are you comfortable with the commute? Why would you like to work for Baptist? Why do you think you would be the best fit for this role?"}, {"date": "26 Oct 2022", "title": "Medical Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 6 weeks. I interviewed at Baptist Health (Florida)", "Interview Descriptions": "First off it’s almost impossible to get an interview with this place. Then I finally get one and the interviewers didn’t even ask me questions about my skills or experience. She told me about all the things the Drs don’t like and how two other employees no longer work there because they lied in their interviews and then said she would be in touch. Never was. Didn’t even give me a business card like most do or reply to my email thanking her for the interview. This is what happens when you have office managers working there 22 yrs. Rude.", "Interview Questions": "Why do you wanna work for Baptist ?"}, {"date": "25 Oct 2022", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Baptist Health (Florida)", "Interview Descriptions": "Interviewed by the manager first, then peer interview after. They use situational questions. With Baptist culture, they will always want to know if your personality would fit in the company", "Interview Questions": "How do you work under pressure?"}, {"date": "7 Sept 2022", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Baptist Health (Florida)", "Interview Descriptions": "Panel of three. Hiring event. It was by appointment in which I was not aware of by recruiting manager or if you walked in you had to stand and wait.", "Interview Questions": "Why do you want to work here?"}, {"date": "3 Jul 2022", "title": "Registered Nurse, MSN Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through a staffing agency. I interviewed at Baptist Health (Florida)", "Interview Descriptions": "Slow. There is lack of communication during the process. Limited availability for orientation classes. The date for start kept being pushed farther out. I was not told much about the dynamic of the unit.", "Interview Questions": "N/A"}, {"date": "17 Jun 2022", "title": "Patient Care Technician Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Baptist Health (Florida)", "Interview Descriptions": "Panel style interview, 3 different employers introduced themselves and provide information about their departments then each proceeded to ask interview questions. Then I was given the opportunity to ask questions.", "Interview Questions": "Why do you want to work at Baptist?"}, {"date": "4 May 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Baptist Health (Florida)", "Interview Descriptions": "3 interviews: one with nurse manager, one with the director and one with two other nurses on the unit. Completed all 3 interviews in one day. Overall, a comfortable interviewing situation.", "Interview Questions": "What made you interested to work in an ICU?"}, {"date": "31 Mar 2022", "title": "Emergency Department Tech - Peds/Nights Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Baptist Health (Florida) (Jacksonville, FL) in Mar 2022", "Interview Descriptions": "Applied online through the Baptist website. Then was contacted by the HR department to set up a Webex interview. In the interview, I spoke with three people (two ANMs and one supervisor).", "Interview Questions": "Have you ever worked with kids? How do you feel about restraining for procedures? Can you tell me about a time you've had to interact with a worried/stressed/emotional/angry parent?"}, {"date": "13 Sept 2022", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Baptist Health (Florida) (Jacksonville, FL) in Mar 2022", "Interview Descriptions": "Everything began with a virtual interview. The facility to which I applied typically uses a panel interview approach (the applicant interviews with all of the hiring managers for Med-Surg, or PCU, etc.).", "Interview Questions": "What made you decide to leave {previous speciality} and work in {current role}?"}], [{"date": "27 Jan 2022", "title": "Psychiatrist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Baptist Health (Florida)", "Interview Descriptions": "There was a nice dinner with psychiatry medical and administrative directors, another day trip to the department, tour and lunch, spoke with future colleagues and few easy interviews and orientation meetings - great experiences!", "Interview Questions": "Basic questions, nothing too bad"}, {"date": "21 Dec 2021", "title": "Nurse Residency Program Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Baptist Health (Florida)", "Interview Descriptions": "Before the interview I spoke with a recruiter about what setting I was interested in. I participated in a WebEx interview with a panel of four nurse managers from that specified area. I was asked behavioral based interview questions.", "Interview Questions": "Nursing involves a lot of teamwork, what is an example of a time you worked well with a team and a time when you had a conflict with your team? "}, {"date": "15 Dec 2021", "title": "Nutrition Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Baptist Health (Florida) in Dec 2021", "Interview Descriptions": "Very simple and quick. Typical interview questions we’re asked, description of the job was explained  and a tour of the kitchen was given. Overall, the  interview lasted about 30 minutes.", "Interview Questions": "What is something I am currently working on?\r\nDescribe a time when I was given feedback and how did I responded\r\nDoes any of my previous jobs entailed customer service?"}, {"date": "22 Aug 2021", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Baptist Health (Florida)", "Interview Descriptions": "Several interviews in the process, takes a couple of weeks, but very thorough. Their process is slow but good.  Director, manager and team interviews.\nFirst two were Director and supervisor, once you get to the next one it is a team (peer) interview.", "Interview Questions": "Typical discussion of your previous applicable experience and how do you see yourself fitting on this team."}, {"date": "22 Jul 2021", "title": "Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Baptist Health (Florida)", "Interview Descriptions": "I was asked the basic interview questions and never received feedback after the interview. The process took 3 weeks to get a call after submitting an application. Nothing stood out about the interview for being super positive.", "Interview Questions": "I was asked the basic strengths, weaknesses, etc."}, {"date": "27 Feb 2021", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Baptist Health (Florida)", "Interview Descriptions": "Pre recorded interview, followed by virtual interview on zoom. Very easy to follow process and laid back. Pre recorded interview allows you to answer as many times as you need and re record.", "Interview Questions": "Why did you choose nursing?"}, {"date": "29 Nov 2021", "title": "Psychiatric Social Worker/Mental Health Evaluator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Baptist Health (Florida) (Jacksonville, FL) in Jan 2021", "Interview Descriptions": "Interview process was average with some difficulty there were a panel a interviewers. Scenario based questions and explanation of skills was required. Overall was a good experience. The hiring process was a little longer than others but good.", "Interview Questions": "Questions regarding ethics and mental health"}, {"date": "31 Oct 2020", "title": "Certified Surgical Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Baptist Health (Florida) (Arcadia, FL)", "Interview Descriptions": "I received a call from a recruiter and had my interview set up for the next day (video interview). On the company’s side, video wasn’t working, so it ended up being a phone interview. I interviewed with the department manager and 2-3 other people. Things started simple and the questions got typical, but a little bit thorough. I got lots of feedback and conversation between questions, so it wasn’t as intimidating as it sounds. I interviewed on a Thursday and then received a call back with an offer on Monday. I was given 48 hours to decline or accept. Overall, my experience with the interview/hiring process has been a positive experience and I can’t wait to start.", "Interview Questions": "So tell me about yourself"}, {"date": "12 Nov 2020", "title": "Covid Nursing Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Baptist Health (Florida) (Jacksonville, FL) in Jul 2020", "Interview Descriptions": "Online Video interview thought an app, recorded myself answering the three questions and then it send it to them.  Answers had to be under 3 minutes and was able to re-record them if I didn't like it", "Interview Questions": "why do you want to work at baptist\r\nwhy did you chose the career of nursing\r\nwhy do you think you would be a great fit for the nurse assistant role "}, {"date": "3 Sept 2022", "title": "Certified Nursing Assistant CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Baptist Health (Florida) (Jacksonville, FL) in Feb 2020", "Interview Descriptions": "Very laid back. Contact a recruiter over the phone. If selected you will get an initial interview with the department manager. Afterward, you may get an offering on the spot or another phone contact.", "Interview Questions": "How did you handle a difficult customer or a difficult situation? What did you do and how was the outcome?"}], [{"date": "12 Feb 2022", "title": "PCT/CNA Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Baptist Health (Florida) (Jacksonville, FL) in Jan 2020", "Interview Descriptions": "It was a very great interview process. Everyone was very easy to interact with. Know your information and having past job experience helps as well. Always stay true to yourself.", "Interview Questions": "Q: Tell me a little about yourself."}, {"date": "6 Jul 2018", "title": "Marketing Project and Traffic Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "The process took 6 weeks. I interviewed at Baptist Health (Florida)", "Interview Descriptions": "First interview was 20 or so phone interview with the recruiter. The following week met with the department head and that same meeting met with 4 members of the team in a panel type interview. Experience was fine and everyone was very friendly. It did take over a month to hear back regarding the position despite being told I would hear back within a week or so. I tried following up but even the recruiter had no updates until I finally got an email stating they had hired another candidate.", "Interview Questions": "What type of work environment do you prefer to work in?"}, {"date": "7 Jul 2019", "title": "R N Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Baptist Health (Florida) (Jacksonville, FL) in Jul 2018", "Interview Descriptions": "Brief but nice, friendly staff and nice looking place to work. Very large campus with many smaller locations and a variety of jobs. Would be a good place to work and get experience", "Interview Questions": "Years of experience "}, {"date": "1 Jun 2018", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Baptist Health (Florida) (Jacksonville, FL) in Apr 2018", "Interview Descriptions": "Met with the nurse manager for about an hour, then the director of unit for about 30 minutes.  It was all done in one day.  I got a call from the recruiter a week later offering me the position.", "Interview Questions": "How would you handle a patient that was yelling and cursing at you?"}, {"date": "31 Jan 2018", "title": "Web Developer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Baptist Health (Florida) (Jacksonville, FL) in Jan 2018", "Interview Descriptions": "The first interview was a 30 minute telephone interview with the hiring manager and Senior Developer. It was a relaxed feel. I didn't feel under pressure. \r\n\r\n2nd Interview was for 2 1/2 hours. The first hour was personality and situational questions by panel of 2. \r\n\r\nThe last 1 1/2 hour was a programming test. \r\n\r\n3rd Interview was about 30 minutes with the CTO. Mostly company related questions.", "Interview Questions": "What is your dream job? If you could work anywhere and do anything what would it be?"}, {"date": "1 May 2017", "title": "Patient Financial Services Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Baptist Health (Florida)", "Interview Descriptions": "A panel interview with 7 people!  Asked around 15 questions. Asked about my knowledge of health insurance plans. Asked your basic interview questions such as how would you handle certain situations etc.", "Interview Questions": "What are the 3 government funded insurance plans?"}, {"date": "15 Apr 2017", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Baptist Health (Florida)", "Interview Descriptions": "Interviewed with manager, coworkers, and nursing leadership.  In total, had 3 interviews which were completed in the same day.  Interview was relaxed and the typical behavioral and personality questions were asked.", "Interview Questions": "Explain a time you had a conflict with a coworker and how you handled it."}, {"date": "11 May 2017", "title": "Patient Transporter Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Baptist Health (Florida) in Feb 2017", "Interview Descriptions": "I received a callback and scheduled an interview within days of applying.  I interviewed with two members of the department's management team where the asked the usual situational based questions. They explained the positions and hours. They also talked about the incentives given for transporting patients in a safe and timely manner.", "Interview Questions": "How would you handle a difficult client?"}, {"date": "18 Oct 2016", "title": "Patient Access Representative II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Baptist Health (Florida) (Jacksonville, FL) in Oct 2016", "Interview Descriptions": "Very smooth 2 step interview process. First with HR then with the PAS manager. With the human resources department, questions were how to handle specific situations. Approximately 10 questions. With the PAS manager, only question, why do you want to work here and what do you know about the position as well as details of the position.", "Interview Questions": "Everyone is late from time to time. Give me an example of a good excuse and a bad excuse."}, {"date": "31 Dec 2017", "title": "CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Baptist Health (Florida) (Jacksonville, FL) in Sept 2016", "Interview Descriptions": "Panel interview, group of anms asked different questions about skills, past experience, had three interviews in one day with panels each time .very welcoming and friendly , meet the team and walk around unit and see whats its like .", "Interview Questions": "Why did i want to work there? "}], [{"date": "8 Feb 2016", "title": "CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Baptist Health (Florida) (Jacksonville, FL)", "Interview Descriptions": "Application submitted online through their HR app. Three months (!) later I was called to interview with the team supervisor. Lasted about 30 minutes. He asked what I was planning to do during my employment (was in nursing school, planning to begin a nursing career at the same hospital). Asked about some of my previous experience (EMT trainee).", "Interview Questions": "This was six years ago, I don't remember. But they expect to hire you long-term - even if you don't stay on the team you're hired with they expect you to stay with baptist for a good long while."}, {"date": "13 Mar 2016", "title": "IT Team Leader Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 4 weeks. I interviewed at Baptist Health (Florida) (Jacksonville, FL) in Jan 2016", "Interview Descriptions": "I applied through a staffing company. From initial contact to offer took approximately one month, including downtime during the Christmas holiday season. Aside from miscommunication regarding expected salary, from dealing with the staffing company to the meeting with the managers, it was a pleasant and processional process. After 2 rounds of phone interviews, a Skype panel interview and a brief face-to-face meeting while in Jacksonville for another meeting, I was extended an offer but had to decline due to salary concerns.", "Interview Questions": "Describe leadership skills that could be used to be successful in this position?"}, {"date": "29 Aug 2017", "title": "Medical Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Baptist Health (Florida) (Jacksonville, FL) in Nov 2015", "Interview Descriptions": "Talked to HR person who referred me to interview. I was interviewed by 2 people from the lab with typical questions about experience and education.  They asked what my qualifications were, where I went to school and what kind of laboratory tests I performed.", "Interview Questions": "How many years I had worked various places."}, {"date": "13 Nov 2016", "title": "Food Service Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Baptist Health (Florida) (Jacksonville, FL) in Sept 2015", "Interview Descriptions": "i applied 3 times the first 2 times i was denied and the 3rd time i got a call a month later to come in for a interview. i went in for the interview and was asked easy questions and basically wasnt talking much.", "Interview Questions": "What would make you a good employee"}, {"date": "20 Jul 2016", "title": "Certified Clinical Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Baptist Health (Florida) (Jacksonville, FL) in Oct 2014", "Interview Descriptions": "I interviewed for an outpatient practice. I was asked a lot of questions based on my resume. The interview lasted about 30 minutes and it was solely with the practice manager. She brought me into her office and gave me the background and history of the practice before starting off with her questions.", "Interview Questions": "Give me ways in which you adapt to a fast-paced working environment?"}, {"date": "24 Sept 2014", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1+ week. I interviewed at Baptist Health (Florida) (Jacksonville, FL) in Sept 2014", "Interview Descriptions": "I was referred by a friend and given an interview about 1.5 hours long.  First manager interviewed me than I was peer interviewed by another nurse.  I was asked several behavior and situation based questions and also what strengths/weaknesses.   The manager got back to me the next week for 2nd interview with nurse navigator and director of nursing. \r\nI recommend checking out their facebook page, lots of updating about events and community outreach.  I got some great talking points from there.  Also, they are submitting their application for Magnet status again.", "Interview Questions": "N/A"}, {"date": "14 Dec 2015", "title": "IS Systems Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at Baptist Health (Florida) in Sept 2014", "Interview Descriptions": "Thorough, engaging questions to me and an open forum for questions I had, very good communication, good and excellence.    Informative on expectations and the value of people resources", "Interview Questions": "How do I see myself as a benefit to the organization"}, {"date": "15 Aug 2015", "title": "Radiologic Technologist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Baptist Health (Florida) (Jacksonville, FL) in May 2014", "Interview Descriptions": "Standard interview procedure.  Received phone call from department manager answered questions about availability and experience.  Came in for face to face interview and did peer interviews.  Nothing out of the ordinary.", "Interview Questions": "Do you have reliable transportation?  Where do you see yourself in 5 years."}, {"date": "1 Aug 2018", "title": "Secretary Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Baptist Health (Florida) (Jacksonville, FL) in May 2014", "Interview Descriptions": "Peer interview with multiple directors which was intimidating. They were all asking random questions not related to one another. They also had interviews before and after me so the conference room waiting area, I was sitting with other candidates.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "8 Jul 2014", "title": "EHR Support Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Baptist Health (Florida) (Jacksonville, FL) in Apr 2014", "Interview Descriptions": "Quick interview and hiring process however I was an internal candidate. Hiring manager was very friendly and easy to talk to. I am pleased I took the position and would take it again.", "Interview Questions": "There were no difficult or unexpected questions"}], [{"date": "4 Oct 2014", "title": "Assistant Nurse Manager Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Baptist Health (Florida) (Jacksonville, FL) in Mar 2014", "Interview Descriptions": "Applied online, got a call from HR within 1 week. 3 separate interviews in all, each a week apart, including manager, director, nursing chair, etc. Everyone was very warm, kind and great conversationalist. The least intimidating interview I have ever been on in my nursing career.\r\n\r\nBecause this is a leadership position I was asked in nauseam leadership projects I was involved in previously. And although I have been a nurse a long time, this was my first leadership role so i had little to pick from. Other than that, behavioral questions.\r\n\r\nPeer interviews were the least favorite as the 2 nurses just read the questions on the form and offered no personal interaction. \r\n\r\nHR called with an offer within a week or so after the last interview, the nursing chair officer, who made me feel very comfortable the interview.", "Interview Questions": "No really difficult questions"}, {"date": "21 Sept 2013", "title": "Account Executive Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Baptist Health (Florida)", "Interview Descriptions": "Submit resume online then had a peer interview. Was given an offer in a few days", "Interview Questions": "No unexpected questions. Typical interview questions.\r\n"}, {"date": "6 Mar 2017", "title": "Patient Access Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Baptist Health (Florida) (Jacksonville, FL) in Aug 2013", "Interview Descriptions": "Applied online then completed a couple of aptitude and personality exercises.  Once completed, I was called for an interview with two Patient Access supervisors who asked questions regarding customer service and privacy situations and knowledge of insurance.", "Interview Questions": "How would I handle a patient's family who were upset during a medical emergency."}, {"date": "9 Aug 2013", "title": "Institutional Review Coordinator - Medical Staffing Interview", "results": "No Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Baptist Health (Florida) (Jacksonville, FL) in Jul 2013", "Interview Descriptions": "I applied online.  I was contacted for an interview within days of my application and asked if I could come in the next day for an interview.  I  live in another state, 1200 miles from Jacksonville, and indicated that I would need time to arrange flight, hotel, etc...  The caller acted surprised as though she didn't know my current location, although it was listed on the application.  The interview was scheduled for the following week (my expense).", "Interview Questions": "The majority of questions were not job-related.  The interviewer was questioning my desire to relocate and wanted more details about my relocation plans."}, {"date": "6 Jul 2015", "title": "ER Travel RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 days. I interviewed at Baptist Health (Florida) in Jul 2012", "Interview Descriptions": "Telephone interview. Very casual and professional. I first spoke with the manager of the ER then the Director, and was at ease with both of them. Of course they asked the clinical questions to verify your knowledge but they informative and answered all my questions and I was hired on the phone. I love this hospital and if you get a chance to work there take it! Make sure you know your skills and are polite and you will be in.", "Interview Questions": "They asked a few scenario questions that involved possible ER patient situations you would encounter."}, {"date": "26 Mar 2014", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Baptist Health (Florida) (Jacksonville, FL) in Nov 2011", "Interview Descriptions": "Found it to be detail oriented. Want nurses who will follow the rules precisely.", "Interview Questions": "Want to know how you will handle certain situations. Families and poor staffing."}, {"date": "28 Aug 2011", "title": "Senior Systems Analyst Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 1 day. I interviewed at Baptist Health (Florida) (Jacksonville, FL) in Aug 2009", "Interview Descriptions": "Panel of eight people. Various questions, skill sets, likes and dis-likes and know about certain applications", "Interview Questions": "What do you like the best support, managment or design?"}, {"date": "11 Jul 2013", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Baptist Health (Florida) in Apr 2009", "Interview Descriptions": "Had 2 interviews - the interviewer was friendly and approachable, and was ready to provide details about the job.  The interview was brief, and not a lot of formalities, which made me more at ease.", "Interview Questions": "I was asked \"what qualifies me to work on the particular floor,\" which I found a little intimidating as this was my first position after school."}, {"date": "26 Apr 2013", "title": "Patient Account Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Baptist Health (Florida) (Pensacola, FL) in Mar 2009", "Interview Descriptions": "had an interview with the supervisor then I had an interview with the team leads", "Interview Questions": "no difficult or unexpected questions"}]]