[[{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Best place to work for if you're looking for a career in impact", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "10 May 2023", "job_title": "Product Manager in London, England", "duration": "N/A", "pros": "Healthy company culture, the absolute best colleagues (no drama, people genuinely care about each other), really smart and thoughtful teams committed to doing impactful work. Company is truly committed to continuous improvement – management listens to employee feedback and takes action.", "cons": "Being a non-profit, salary and comps tend to be lower than you could get for same role elsewhere."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": 4, "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": 5, "review_title": "Amazing mission, great team", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "17 Jan 2021", "job_title": "People Director in London, England", "duration": "N/A", "pros": "It's incredible to be able to link the work I'm doing to the amazing things Founders Pledge is doing for the world. The team is excellent - intellectually curious, supportive and helpful. Sometimes the work we're doing is tough, but we're pushing the boundaries within charity/philanthropy and solving as yet unsolved problems is always going to be tough.", "cons": "Sometimes the sense of urgency is too strong which makes everything feel overly important."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Wonderful Experience", "rating": "5.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "29 Aug 2018", "job_title": "Programmes and Community in London, England", "duration": "N/A", "pros": "Wonderful company. Inspiring, intelligent and welcoming workforce with an impassioned desire to create genuine impact. The team have a distinguished community feel, even between international offices (ensured by regular conference calls and efficient communication). Founders Pledge's ethical values are reflected in the people that they employ, and in the processes which are implemented. The management of the Founders Pledge further reinforces this, and there is a real focus on ensuring the healthy work/life balances of their employees. I believe the senior team genuinely have the wellbeing of their employees at heart. Regular team meetings and metric tracking made it very clear and simple when meeting objectives. This is no doubt the reason for its fast growth with effective social impact - it was a pleasure to work at Founders Pledge.", "cons": "Perhaps the location of London offices initially seemed a bit inconvenient (Bermondsey) - although this was not a problem as there was the ability to work from home when needed and transport to Bermondsey actually very efficient."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Come for the intellectual curiosity, stay to make a difference", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "28 Aug 2018", "job_title": "Head of People in London, England", "duration": "N/A", "pros": "I started at Founders Pledge in January 2017 and it's been a bit of a whirlwind adventure. We were still sharing a small space in our trustee's office in Moorgate, London. I don't think I could have imagined how much we grew as a team in such a short space of time.\r\nSince I joined we've moved office a couple of times, finally making Bermondsey our home. Our team now includes a Research department, as well as offices in Berlin and New York.\r\nLike most young organizations, we've become a family. It's corny, but we're a group of friends who happen to work together. Work can be tough, busy, stressful, but it's never dull.\r\nI'm often asked what my favorite thing about FP is: We have a shared intellectual curiosity. Everyone here is curious about the world, how it works. We don't all think the same way, but we have a mutual respect for one another's views and are open to discuss these in detail.\r\nAnother perk is the perks: there weren't many options when I started, as is typical of young teams. But as we've grown we've brought in new benefits for the team as people have described a need; better holiday plans, a clearer sickness policy, LOTS of free food in the office!\r\nThe management style is also far more collaborative than other organizations I've worked at. There's always an open dialogue with team leaders and the Exec Team, and plans are put in place together so that everyone knows what they're working on and what is achievable.\r\nFP is a challenge, but it's one we like to get stuck into to!", "cons": "Being a young org, there are things FP can always improve on, such as a focus on individual's progression as it relates to their personal goals and ambitions. But generally, the Exec Team and FP as a whole are trying to improve how everyone can develop better as well as looking at our organizational mission."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Great if you want to make the world a (much) better place!", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "28 Aug 2018", "job_title": "Researcher in London, England", "duration": "N/A", "pros": "- Engaging work that enables you to have a large positive impact\r\n- Quickly evolving organisation\r\n- Friendly colleagues and a cheerful atmosphere in the office\r\n- Flexibility w.r.t. working times and working in the office or from home/remotely\r\n- Food and drinks provided in the office\r\n- Suggestions for improving employee experience are taken on board", "cons": "- Current lack of closed meeting and work spaces attached to the office (only one)\r\n- Can be noisy in the office sometimes (as it's one big room)"}], []]