[[{"date": "2 Jul 2023", "title": "Patient Care Navigator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Center for Elders Independence (Oakland, CA)", "Interview Descriptions": "Easy interview process. First got a call from superego schedule an interview. Questions were straightforward. Interviewed with supervisor, lead patient navigator and HR manager. Was asked about previous job experience, organization skills and problem solving skills. Took them about a week to get back to me.", "Interview Questions": "How would you describe your organization skills?"}, {"date": "2 Nov 2022", "title": "Occupational Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Center for Elders Independence", "Interview Descriptions": "Panel interview with members of the therapy staff and HR were present. Panelists were interested in the applicant, and provided insight into the companies values and mission, and insight into the patient population.", "Interview Questions": "How do you deal with a challenging coworker/participant?"}, {"date": "8 Mar 2022", "title": "Medical Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Center for Elders Independence", "Interview Descriptions": "I noticed alot of red flags in this phone interview but the main ones being: the role doesn't seem clear in terms of specific duties and responsibilities and on top of that your'e expected to help in front desk or do the role of the Aide at times and be willing to work overtime. I would not recommend if your'e looking for an MA job.", "Interview Questions": "Be prepared to answer like 25 different questions, the interview is so long."}, {"date": "20 Oct 2021", "title": "Executive Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Center for Elders Independence (Oakland, CA)", "Interview Descriptions": "The CMO was late, but otherwise the process was standard. They did ask me to do an assignment to make sure I could comprehend task. The assignment was simple. Met with CMO and VPO. The VPO was really laid back and seemed to understand his role and what he wanted in an assistant. The CMO was all over the place.", "Interview Questions": "What sets you apart from other EAs?"}, {"date": "30 Jun 2021", "title": "Patient Care Navigator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Center for Elders Independence (Oakland, CA) in Aug 2020", "Interview Descriptions": "Due to COVID restrictions, I had a multiple person Zoom interview that lasted 30 minutes.  After the interview, I entered an extensive screening process since I was approved to proceed with the hiring process after my interview.", "Interview Questions": "How do I solve multiple issues at the same time and how do I prioritize tasks throughout the day?"}, {"date": "8 Aug 2022", "title": "Patient Care Navigator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at Center for Elders Independence (Oakland, CA) in Jul 2020", "Interview Descriptions": "Panel interview with 3 different people over Zoom due to Covid restrictions.  Everyone was knowledgeable regarding the company and the job specifics.  Eager to hear my opinions and any suggestions to make the team more efficient. The whole group was enthusiastic regarding the work and the potential for a great teammate.", "Interview Questions": "In your previous experience in tech support, what would you bring to the table dealing with patients who are not tech savvy? "}, {"date": "20 Jan 2022", "title": "EHR LEAD Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Center for Elders Independence (Oakland, CA) in Dec 2019", "Interview Descriptions": "In person interview with management. I accepted the offer and a day later they called and told me that the position is no longer available as they had an internal meeting and decided not to hire for that position anymore. Very unprofessional of them.", "Interview Questions": "How do you deal with difficult staff?"}, {"date": "1 Mar 2019", "title": "Physical Therapy Aide Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Center for Elders Independence (Oakland, CA) in Jan 2019", "Interview Descriptions": "The staff was very kind and friendly. The interview with hiring management was average. They take pride in the work they do and expect prospective employees to do the same.", "Interview Questions": "How did you get interested in this line of work?"}, {"date": "23 May 2017", "title": "Communications Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 1 day. I interviewed at Center for Elders Independence (Oakland, CA) in Sept 2013", "Interview Descriptions": "Through a temporary service then recruiter contacted me then set me up to meet with the director of communications and marketing, there was very little about the job at and more about the supervisors personal life and what she has gone through, there wasn't a lot about what was expected, just what she liked and how she enjoyed diversity and where she was from and how she came to be at CEI", "Interview Questions": "how long have you been doing this"}, {"date": "4 Aug 2010", "title": "Senior Outreach Representative Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Center for Elders Independence (Oakland, CA) in Dec 2009", "Interview Descriptions": "Applied online and then delivered hard copy of application in person at their office. Passed phone screening interview, then was invited in for a panel interview and presentation. They asked me to prepare a PowerPoint presentation to demonstrate my skills in presenting information about their organization to the public.. People who work there are serious about their social mission of providing care to the Senior community.", "Interview Questions": "Behavioral, Role play on how do you tactfully ask questions to a low income senior about their eating habits if you were to look in their refrigerator and see that it is empty?"}]]