[[{"date": "29 Oct 2022", "title": "Project Manager Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Mastercard Foundation", "Interview Descriptions": "Three step interview process - screening with HR, technical interview where you’ll be asked to present a project you managed and interview with senior management. Each interview was about an hour long.", "Interview Questions": "What does humility look like in project management?"}, {"date": "26 Apr 2022", "title": "Finance Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Mastercard Foundation", "Interview Descriptions": "I had two interviews (both with the same two individuals), plus a pre-interview screening call with the HR department.\r\n\r\nBoth interviews were approx. thirty to fourty-five minutes and conducted at the office.", "Interview Questions": "Reason for wanting to join."}, {"date": "29 Jun 2023", "title": "Finance Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Mastercard Foundation (Toronto, ON) in Mar 2022", "Interview Descriptions": "The interview process only had one round and the interviewers asked many behaviour questions, and there were two interviewers. The whole process was supposed to be very quick and easy.", "Interview Questions": "what is your biggest strength?"}, {"date": "5 Nov 2021", "title": "Accountant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 1 day. I interviewed at Mastercard Foundation (Toronto, ON) in Dec 2020", "Interview Descriptions": "What Are Your Weaknesses? ...\nWhy Should We Hire You? ...\nWhy Do You Want to Work Here? ...\nWhat Are Your Goals? ...\nWhy Did You Leave (or Why Are You Leaving) Your Job? ...\nWhen Were You Most Satisfied in Your Job? ...", "Interview Questions": "Tell us about your exxperience"}, {"date": "26 Apr 2023", "title": "Finance Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. I interviewed at Mastercard Foundation (Toronto, ON) in Dec 2019", "Interview Descriptions": "it started with a panel nterview of 4 and then a final interview with the then controller. The whole interview was about two hours long. They were nice and straight forward", "Interview Questions": "TELL US A LITTLE ABOUT YOURSELF"}, {"date": "16 Aug 2022", "title": "Customer Support Engineer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Mastercard Foundation (Toronto, ON) in Aug 2019", "Interview Descriptions": "Short, brief interview with HR rep to gauge suitability for the job role. Job role included potential travel to an off-site client in a different state/province. Details about the client and their needs were vaguely shared, benefits sounded very promising.", "Interview Questions": "Are you willing to relocate?"}, {"date": "24 Apr 2022", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Mastercard Foundation (Toronto, ON) in Oct 2018", "Interview Descriptions": "Three rounds of interviews and one assessment for the internship. HR Screening over the phone and a written assessment, in-person interview with management, then In-person interview with director for a brief chat, but I think they had already decided to onboard me.", "Interview Questions": "Tell me about yourself?\nWhy are you interested in this organization?"}, {"date": "26 Mar 2020", "title": ", Programs Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Mastercard Foundation (Toronto, ON) in Jul 2018", "Interview Descriptions": "A screening phone interview, followed by phone interview from the direct manager manager and a video call after that. It was an intern position so it's not too in depth, but expect a few chats and the process to take a few weeks. I should mention I was in a different city and I had I been in the same city it is likely they would have suggested an in-person interview as well. Video call was the replacement for that.", "Interview Questions": "Tell me about yourself."}, {"date": "6 Mar 2018", "title": "Chief Communications Officer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Mastercard Foundation (Toronto, ON)", "Interview Descriptions": "Was done by a recruitment firm that was outsourced to fill this leadership team role.  I had a phone interview with an associate from the recruiter firm, who did not speak to me about the content of the role itself, the specialty of communications, or about the work and impact of the foundation.  Definitely was focused on ticking certain boxes including salary expectations, number of previous direct reports, size of budget managed, etc.  I had prepared extensively to talk about the work itself in the programs and what I would see as important to lead the communications.  However the phone interview did not go into any depth beyond the 10 minute checking of those specific parameters that I had already answered in the application questions/form that had been required.  I believe I did not meet certain ticked boxes so I did not proceed.  Such a pity that they didn't ask deeper questions about my visions on management, communications, financial inclusion in Africa, or the trends in private foundations today or other deeper things to assess my quality and fit for the role.", "Interview Questions": "How many direct reports did you have?  What size budget did you manage?  What salary do you have now?"}, {"date": "7 Oct 2019", "title": "PM Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at Mastercard Foundation (Toronto, ON) in Mar 2015", "Interview Descriptions": "I was headhunted. Then I met with the HR Manager and a number of staff and directors for three rounds of interview. I was headhunted. Then I met with the HR Manager and a number of staff and directors for three rounds of interview.", "Interview Questions": "N/A"}], [{"date": "21 Nov 2013", "title": "Intern Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Mastercard Foundation", "Interview Descriptions": "First, I have got a reply from them for a face-to-face interview date after my initial application, and we agreed on the time and date. The interview was in their office. I was early that day, and initially I was a little bit nervous.However, other interns near the front lobby actually welcomed me to with their smiling face. I was taken to a small room with two interviewers, and one of them actually talked some initial introduction and  interview process which helped me to open up and be bold about my ideas. The interview was about 45 minutes long, and we talked about many development, research and company issues.  Overall, I enjoyed it a lot.", "Interview Questions": "Describe yourself, most common and anticipated question, but I am always uncomfortable about it."}, {"date": "16 Sept 2013", "title": "Compliance Student Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Mastercard Foundation (Toronto, ON) in Feb 2013", "Interview Descriptions": "I was interviewed by a panel of 3 people. Crystal, Caroline, and the current co-op student. They asked me three questions: \r\n1. Tell me about yourself.\r\n2. What is your favourite subject?\r\n3. What is your least favourite subject?\r\nThe interview not very professional and no other questions were asked.", "Interview Questions": "What is your least favourite subject?"}]]