[[{"date": "17 Nov 2022", "title": "Surgical Technologist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 3 days. I interviewed at Wake Forest Baptist Medical Center in Nov 2022", "Interview Descriptions": "30 minutes, talked me through scheduling and on-boarding process. Asked about my background and why I wanted the job. Asked if I had any questions and told me someone would reach out in a few days.", "Interview Questions": "1. Tell me a bit about your background and why you want to come here (Wake Forest)"}, {"date": "9 Jun 2022", "title": "OSP Administrator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Wake Forest Baptist Medical Center", "Interview Descriptions": "The interview process wasn’t too bad. I talked to the assistant director on the phone and then had a series of interviews with other admins and other assistant directors. It was an interview on zoom.", "Interview Questions": "N/A"}, {"date": "9 Jun 2022", "title": "Registered Nurse, BSN Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Wake Forest Baptist Medical Center in May 2022", "Interview Descriptions": "Phone call for 30 min with a floor shift manager. Describe your current experience and motivation to apply at hospital and current specialty. Review skills and abilities that make you a great candidate to join as a new grad", "Interview Questions": "Personal, Interest, future related, Nursing motivation"}, {"date": "10 Mar 2022", "title": "Social Worker/Case Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Wake Forest Baptist Medical Center", "Interview Descriptions": "The interview was very easy, simple and relaxed. They were all very kind and helpful. I felt very comfortable although there were 6 employees interviewing me. Can not wait to start.", "Interview Questions": "Tell me a little about yourself. "}, {"date": "27 Apr 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Wake Forest Baptist Medical Center (Winston-Salem, NC) in Mar 2022", "Interview Descriptions": "Submitted application, was contacted by recruiter the next day, then talked to someone in-house on that same day, then an interview online the next day. The whole process was very fast and efficient.", "Interview Questions": "They spent time laying out the workplace and schedule"}, {"date": "28 Sept 2021", "title": "Fellow Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Wake Forest Baptist Medical Center", "Interview Descriptions": "Unfocussed, and no clear statement of how the mentors work to advance the candidates' career and professional development. Was bluntly told, the chances for advancement in this department are 'Zero'!", "Interview Questions": "What are your career expectations?"}, {"date": "8 Jan 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Wake Forest Baptist Medical Center (Winston-Salem, NC) in Jul 2021", "Interview Descriptions": "Interviewed virtually with 5 managers asking questions all at once. Each interviewer asked a few questions.  Was offered 2 different medical surgical jobs which I was allowed to choose from.", "Interview Questions": "Tell us about yourself. What do you do in a stressful situation? How do you handle the stress?  Do you think teamwork is important and why? "}, {"date": "3 Mar 2022", "title": "Lab Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Wake Forest Baptist Medical Center (Winston-Salem, NC) in May 2021", "Interview Descriptions": "The interview process was pretty straightforward. I previously worked with my interviewer in school, so I already had a well-established relationship. My interview was about an hour with general interview questions about why I wanted to work for Wake Forest Baptist Medical Center.", "Interview Questions": "Q: Why do you want to work at Wake Forest Baptist Medical Center?"}, {"date": "31 Jan 2022", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Wake Forest Baptist Medical Center (High Point, NC) in Apr 2021", "Interview Descriptions": "It was great interview they were nice and they have an amazing staff.  They have such a great company and they are very organized I would love to work for them one day. They also have such good staff members in they team.", "Interview Questions": "Where do you see yourself in 5 years ?"}, {"date": "10 Feb 2021", "title": "Certified Nursing Assistant CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Wake Forest Baptist Medical Center", "Interview Descriptions": "The interview process was straight-forward. The manager asked genuine questions to get to know me better. I was also asked to speak on behalf of my experience and what strengths or special skills I could bring to the new job.", "Interview Questions": "Why do you want to work here?"}], [{"date": "22 Feb 2021", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Wake Forest Baptist Medical Center in Feb 2021", "Interview Descriptions": "I had several interviews with different people. The entire interview process was  conversational. All participants were open, interested, involved and very respectful. I learned a lot about the position in question, future team members and the work done in general.", "Interview Questions": "Why are you interested in this position?"}, {"date": "14 Feb 2021", "title": "Nurse Practitioner Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Wake Forest Baptist Medical Center in Oct 2020", "Interview Descriptions": "Phone interview friendly but maybe a bit unorganized. She started asking me questions related to the wrong position and then it seemed to slow down and was awkward. I wasn’t asked to come for in person and I think maybe the position had been filled already and a mistake was made", "Interview Questions": "How long I’d been an NP "}, {"date": "20 Sept 2020", "title": "Registered Nurse Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Wake Forest Baptist Medical Center", "Interview Descriptions": "Cordial interview, nice facility, the  staff appeared to be taken care of. Good patient to nurse and CNA ratio on the floor. There was advanced technology at the disposal of the employees.", "Interview Questions": "How did you resolve a conflict with another employee?"}, {"date": "25 Aug 2020", "title": "Patient Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Wake Forest Baptist Medical Center in Aug 2020", "Interview Descriptions": "It was about four to five people interviewing me at once. They were all friendly.  They all asked about 2 questions each, and then asked me if I had any questions.", "Interview Questions": "Tell me about yourself.\r\nWhere do you see yourself in about 3-5 years?\r\nWhat are your strengths and weaknesses?\r\nWhy we should hire you? "}, {"date": "17 Jul 2020", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Wake Forest Baptist Medical Center in Jul 2020", "Interview Descriptions": "got contacted within days by recruiter. very nice and friendly. was easy to get in touch with and always replied to my questions and concerns. interviewed over skype and made me feel very comfortable", "Interview Questions": "are you willing to relocate"}, {"date": "11 Jun 2020", "title": "Lab Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Wake Forest Baptist Medical Center", "Interview Descriptions": "simple and straightforward, no curve ball questions, walking through experiences and resume. asked about my research and research techniques. not challenging or difficult, very speedy back and forth communication and hiring process completed within a month", "Interview Questions": "Why do i want the job"}, {"date": "9 Aug 2020", "title": "MED/SURG RN Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through other source. I interviewed at Wake Forest Baptist Medical Center (Winston-Salem, NC) in Jun 2020", "Interview Descriptions": "I was interviewed by 5 managers. I believe there is no uniform decision and there's bias. There is no continuity in the line and sets of questions. Was not given the job and nobody could say why. I personally think the hospital doesn't want nurses of skin color, maybe!", "Interview Questions": "All sorts of questions from different people jumping from one person to another"}, {"date": "28 Apr 2021", "title": "Phlebotomy Technician Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Wake Forest Baptist Medical Center (High Point, NC) in Nov 2019", "Interview Descriptions": "Unprofessional. I was interviewed by the Phlebotomist supervisor and another Phlebotomist. They were quite rude actually. They did request I draw blood from a plastic arm. They were only educated on  in hospital blood draws. They were unaware of send out testing protocols.", "Interview Questions": "Basic phlebotomy questions. Nothing interesting or hard to answer"}, {"date": "27 Mar 2021", "title": "Clinical Laboratory Scientist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Wake Forest Baptist Medical Center (Winston-Salem, NC) in Oct 2019", "Interview Descriptions": "Quick response time from recruiters (within an hour of applying). Interview was with the manager and assistant manager, and lasted about 45 minutes including at tour of the labs. Turn around time after the interview was quick as well and an offer was made within a couple of days.", "Interview Questions": "I was asked about my relevant experience and why I was moving across the country? "}, {"date": "13 Sept 2019", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Wake Forest Baptist Medical Center", "Interview Descriptions": "Straightforward interview with two managers that lasted less than 30 minutes. Offer extended within two weeks via phone and confirmation by email by HR. Overall a very positive interview experience.", "Interview Questions": "Standard 1 : 1"}], [{"date": "9 Jun 2019", "title": "Secretary Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Wake Forest Baptist Medical Center (Winston-Salem, NC) in Jun 2019", "Interview Descriptions": "General panel interview with multiple staff.  General interview questions. Lasted about an hour. Mostly discussed position and responsibilities.  Some questions about previous experience and several questions about how you would handle various situations.", "Interview Questions": "Give an example of a stressful situation at a previous job and how did you handle it?"}, {"date": "25 Jul 2022", "title": "Pool Attendant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Wake Forest Baptist Medical Center (Kernersville, NC) in May 2019", "Interview Descriptions": "The interview was a pleasant experience and not too formal. I felt comfortable with the employer and I was asked reasonable questions regarding my past experience in regards to working in groups and in a team.", "Interview Questions": "What was a time when you worked in a team and there was a problem that you worked together to overcome?\nIf you could describe yourself in three words, what words would you use?\nWhat would you do in a situation when there is an irate customer?"}, {"date": "23 Apr 2019", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Wake Forest Baptist Medical Center", "Interview Descriptions": "good people good place not so good money interesting work all the time i am just writing this to get to the reviews so hopefully this will be enough words and i can continue", "Interview Questions": "good"}, {"date": "7 Jun 2019", "title": "Audit Appeal Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Wake Forest Baptist Medical Center in Apr 2019", "Interview Descriptions": "I applied for the position online and within a few weeks received an email to come in for an interview. I was interviewed by the entire team, about 6-8 people. They were all very friendly. I will say the job description was not accurate for what the position was, which they explained in the interview would involve a lot of phone work with insurance carriers. This is the second time I have interviewed with this organization and have not received a thanks for no thanks email or anything. I find it very unprofessional to take time out of my day and drive over an hour for an interview and not even receive an email. I will not be applying to this organization again. Very thankful I received multiple offers from different healthcare organizations.", "Interview Questions": "How do you handle an angry customer?"}, {"date": "31 Dec 2019", "title": "Patient Nutrition Representative Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Wake Forest Baptist Medical Center (Winston-Salem, NC) in Apr 2019", "Interview Descriptions": "Interview was in cafeteria of hospital.  Interviewer went through some basic scenario questions. It was laid back and not to formal.  At the end of the interview, I was told that I would be recommended for the job.  However, it took about a month before I actually received final word that I was hired.  I was called and given details like pay and advised when the next orientation would begin.  I was forwarded new hire paperwork via email to complete and return.", "Interview Questions": "Tell me about a time that you had to work with a difficult person and what was the outcome?"}, {"date": "8 Dec 2022", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Wake Forest Baptist Medical Center (Winston-Salem, NC) in Apr 2019", "Interview Descriptions": "It was an easy interview process. I was sent the opportunity via email through my department email. I had to fill out a google form with my resume and my areas of interest in the projects they listed.", "Interview Questions": "Direct recruitment was done after reviewing my resume"}, {"date": "4 Dec 2018", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Wake Forest Baptist Medical Center (Winston-Salem, NC)", "Interview Descriptions": "I was contacted by HR to determine my needs and my areas of interest. Then the unit manager interviewed me. It was a month later when the unit manager called to say that she was having to repost the job through human resources and I should be hearing from them. HR called and I went in to fill out paperwork that week.  Have a paycheck stub with you for direct deposit.", "Interview Questions": "How do you handle critical care patients?\nWhat is your work experience?\nIs your schedule flexible?"}, {"date": "26 Oct 2022", "title": "Human Resources Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Wake Forest Baptist Medical Center in Aug 2018", "Interview Descriptions": "Easiest interviews I have ever participated in. Not just digging into depth of competency. Not much thinking outside the box, not very innovative, difficult to be promoted once you're there.", "Interview Questions": "Why do you want to work here?"}, {"date": "28 Jun 2018", "title": "Associate Project Manager Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Wake Forest Baptist Medical Center (Winston-Salem, NC)", "Interview Descriptions": "I was invited for an interview with the team not realizing I was from out of state. Went to the interview and to save time, they decided to do a second interview with me on the spot to be convenient and respectful to the fact that I was coming from 8 hours away. Standard interview. I first met with the management of the team and was your basic interview, tell me about your background, why do you want to work here, what interests you about the position etc. From there they found out I was from out of state and asked if I had time to do a second interview (which I said of course). Second interview was with other members of the team to (in my opinion and what I got from it) make sure I would be someone they could work with and that I would be compatible with them, I.E. a good culture fit. Communication was great. I received an offer in a timely manner and they allowed me plenty of time to decide (being a recent graduate) . Overall it was a very positive experience.", "Interview Questions": "Why are you interested in this position?"}, {"date": "14 Sept 2018", "title": "Communications Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Wake Forest Baptist Medical Center (Winston-Salem, NC) in Feb 2018", "Interview Descriptions": "It was a short interview and I knew before I left  that I would receive a call from HR. Once you accepted the offer it took about 3-4 weeks before orientation would begin. They rotate Nursing Orients and non clinical orientations.", "Interview Questions": "Previous Job experience and how I could implement it within this job role"}], [{"date": "20 May 2022", "title": "Medical Oncologist/Hematologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at Wake Forest Baptist Medical Center (Winston-Salem, NC) in Feb 2018", "Interview Descriptions": "Well organized, Fair. I  met with representatives of the groups I would work with.  Was shown around the cancer center and the hospital. A realtor presented me with buying/renting options in Winston Salem.", "Interview Questions": "About my research experience during fellowship  "}, {"date": "11 Dec 2017", "title": "Lpn Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Wake Forest Baptist Medical Center (Winston-Salem, NC) in Dec 2017", "Interview Descriptions": "Contacted by office manager and interview scheduled a few days later with office manager and RN. They were very detailed, polite, and positive. Called back for a second interview with providers. Seemed nice enough.", "Interview Questions": "Can you handle a busy clinic?"}, {"date": "4 Dec 2017", "title": "Research Study Coordinator Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Wake Forest Baptist Medical Center (Winston-Salem, NC) in Nov 2017", "Interview Descriptions": "Good interview, great benefits. People seemed really nice but were very busy and had to keep leaving at different times and coming back.  But over all they did not come across as being real bossy.  Explained everything about the job and the .", "Interview Questions": "Strongest quality trat"}, {"date": "29 Jun 2017", "title": "Data Collector Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Wake Forest Baptist Medical Center", "Interview Descriptions": "casual yet professional. team did a great job of explaining expectations and job role. they are awesome. had a great experience. i need to get up to 30 words so I'm going to keep on typing", "Interview Questions": "when are you due"}, {"date": "15 Jan 2021", "title": "Nurse Practitioner Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Wake Forest Baptist Medical Center (Winston-Salem, NC) in Jun 2017", "Interview Descriptions": "Efficiently done. Met with director of division and physician colleagues. Job description accurate. Timely offer of the position. Met with HR the same day.  Pay was appropriate and compensation reasonable.", "Interview Questions": "Why was I interested in mental health?"}, {"date": "18 May 2017", "title": "Computer Support Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Wake Forest Baptist Medical Center (Winston-Salem, NC)", "Interview Descriptions": "Someone from HR will interview, then the director and immediate supervisor interviewed me . After passing all required tests, I was notified and scheduled to come in to meet with Supervisor again. The Supervisor made an offer for the position and I accepted.", "Interview Questions": "\"What would you say in your biggest weakness?\""}, {"date": "10 Apr 2017", "title": "Secretary Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Wake Forest Baptist Medical Center (Winston-Salem, NC) in Mar 2017", "Interview Descriptions": "I received an email asking if I could schedule a time which I did.  I was interviewed by four people.  They made me feel very much at ease.  They asked questions solely based on their specific needs and seeing how I would meet those.", "Interview Questions": "How would you go about setting up a system for accomplishing tasks?"}, {"date": "22 Feb 2017", "title": "Patient Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Wake Forest Baptist Medical Center (Winston-Salem, NC)", "Interview Descriptions": "Initially I had a 1 on 1 Interview with the clinic administrator. Immediately following I had an interview with the two team leads. The last component was a tour of the clinic and introduction to the other staff", "Interview Questions": "How did my experience relate to the position?"}, {"date": "14 Feb 2017", "title": "Research Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Wake Forest Baptist Medical Center (Winston-Salem, NC)", "Interview Descriptions": "Not a typical interview from my experience.  You are given an itinerary with blocks of 15-20 minute interviews/meetings with numerous lab personnel.  Mostly people ask about your experiences and give an overview of the projects they are involved in and what their daily tasks are.  Felt more laid back than the typical interview Q and A.", "Interview Questions": "Not a typical Q and A, no standard 'interview questions' "}, {"date": "10 Feb 2017", "title": "Research Technician Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Wake Forest Baptist Medical Center (Winston-Salem, NC)", "Interview Descriptions": "One phone interview and one in-person interview with the PI, department chair, and a graduate student. The PI was extremely friendly and most of the interview process was making sure that I'd be comfortable with the responsibilities listed in the job description.", "Interview Questions": "Do you feel comfortable working overtime and weekend occasionally?"}], [{"date": "12 Jan 2017", "title": "Senior Professional Position Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 8 weeks. I interviewed at Wake Forest Baptist Medical Center (Winston-Salem, NC)", "Interview Descriptions": "Started with a phone screen, then in person panel interview that lasted two hours. Relaxed setting. I did not get the offer, which is fine, but I never received a follow up, just saw on the website that the position was closed.  I think it only common courtesy to at least send a regret letter or some type of feedback to a candidate with whom you extended an in person interview.  Unprofessional...", "Interview Questions": "Behavioral based questions...\"tell me about a time when...\""}, {"date": "9 Jan 2017", "title": "Rehab Tech Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Wake Forest Baptist Medical Center (New York, NY)", "Interview Descriptions": "I applied online and they contacted me a few days later via email to set up an interview. I went in for an interview that lasted about an hour, including a tour of the facility. I was notified via email about 2 weeks later that they had chosen another candidate for the position.", "Interview Questions": "Tell us about an experience at work where you had to overcome an obstacle. How did you handle the situation? "}, {"date": "19 Jan 2017", "title": "Patient Service Representative Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Wake Forest Baptist Medical Center (Winston-Salem, NC) in Jan 2017", "Interview Descriptions": "It started off good, until the supervisor was called away, and I was left with one of the nurse managers to finish interviewing with. She returned after we were done.", "Interview Questions": "Do you have a pretty flexible schedule? We have late clinic 2 days a week that run until 7pm."}, {"date": "31 Oct 2016", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Wake Forest Baptist Medical Center (New York, NY)", "Interview Descriptions": "Received a call scheduling an interview about 2 weeks after applying. Interviewed a week later on a Thursday and was offered the job the following Monday. Interview was one-on-one and pretty standard.", "Interview Questions": "•\tTell me about yourself\r\n•\tWhy are you a good candidate for this position\r\n•\tHow has your experience prepared you for this role\r\n•\tTell me about an authentic care moment\r\n•\tTell me about your last sick patient\r\n•\tTell me about a time you acted as a leader for a group and what was the outcome\r\n•\tTell me about a challenging situation, how you handled it and what was the outcome\r\n•\tWhat overwhelms you and why\r\n•\tWhat do you think are important attributes for someone in this role\r\n•\tWhat do you think is the most important quality for an ER nurse\r\n•\tHow do you handle disagreements with coworkers\r\n•\tWhy are you interested in working here"}, {"date": "2 Dec 2016", "title": "Ambultory Licensed Practical Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Wake Forest Baptist Medical Center (Winston-Salem, NC) in Nov 2016", "Interview Descriptions": "Resume sent in. Email from assistant nursing manager for interview. Called into first interview with Nurse manager, assistant nursing manager, PA, NP. Then called into 2nd interview 3days later.. process was about 1.5wks.", "Interview Questions": "Where do you see yourself in 5 years? What can our company do for you? What can you bring to our team? Do you believe in teamwork?"}, {"date": "4 Oct 2016", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Wake Forest Baptist Medical Center (Winston-Salem, NC)", "Interview Descriptions": "did a phone screen, then went in for two in person interviews and was almost told the job was mine.  Then there was NO follow up after interview, they decided to not hire position, but never conveyed that to candidates.  Held us on for two month and then just stopped answering calls and emails.  Very unprofessional in my opinion.", "Interview Questions": "Why did i want to work for Baptist"}, {"date": "13 Dec 2016", "title": "Professional Healthcare Representative Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Wake Forest Baptist Medical Center (Winston-Salem, NC) in Sept 2016", "Interview Descriptions": "I was contacted via email for a panel interview.  The interview lasted 2 hours and 45 minutes and was extremely detailed with multiple questions from three different people in a panel style interview.  The interviewers were very polite and nice but the interview was long with lots of provoking questions.", "Interview Questions": "What would your supervisors say your weaknesses are?"}, {"date": "18 Aug 2016", "title": "Financial Services Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Wake Forest Baptist Medical Center in Jul 2016", "Interview Descriptions": "Was interviewed by several hiring managers due to high volume of applicants. I went from table to table for 15 minutes each 5 times. at the last table was offered very casually a position I already have with a different company. I felt insulted although appreciated the gesture of an offer.", "Interview Questions": "Basic personality questions. Questions regarding PT interactions, Staff conflict, Manager disagreements. Where do I want to be in 5 years etc..."}, {"date": "22 Aug 2016", "title": "Receptionist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Wake Forest Baptist Medical Center (Winston-Salem, NC) in May 2016", "Interview Descriptions": "They called me and interviewed me and looked at all my records it was a very long two hour interview yeah some people just need a good time with the best of the day before", "Interview Questions": "Why did u apply?"}, {"date": "14 Apr 2016", "title": "IT Administrator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 5 weeks. I interviewed at Wake Forest Baptist Medical Center (Winston-Salem, NC) in Apr 2016", "Interview Descriptions": "The interview consisted of an initial phone screen by the recruiting company, followed a panel interview via phone and finally an on-site interview panel with my future teammates and brief individual meetings with management staff. Everyone I met with was cordial and professional. I felt like I was right at home.", "Interview Questions": "Describe your approach troubleshooting a performance issue."}], [{"date": "24 Mar 2016", "title": "NA I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Wake Forest Baptist Medical Center (Winston-Salem, NC)", "Interview Descriptions": "I applied for a position. I was called the next day for phone interview. After the phone interview, I had a interview on the floor I interviewed for. I met with the Nurse Manager. We did a tour and the interview was was very informal. Once we toured the unit, I was asked 2-3 questions. Called on a Fri had actual interview on Tues and offered position by Friday. I started 2 weeks later.", "Interview Questions": "What are your goals in the next 5 years if hired?"}, {"date": "2 Feb 2018", "title": "Director Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at Wake Forest Baptist Medical Center (Winston-Salem, NC) in Mar 2016", "Interview Descriptions": "Initial screen with Talent Partner on phone. Meeting with hiring manager and 4 of manager's peers in a group interview setting. About 1 week later received a call from the hiring manager telling me I was the pick. Talent Partner called later to make the compensation offer. I negotiated a slightly higher salary than initially offered", "Interview Questions": "Describe a time when you had to convince a manager to change directions on a project"}, {"date": "24 Jul 2019", "title": "Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Wake Forest Baptist Medical Center (Winston-Salem, NC) in Feb 2016", "Interview Descriptions": "Interviewed by floor's nurse manager. Introduced to other nurses and staff on the floor. Encouraged to ask questions. Interview was primarily one on one. Very laid back. Given a description on what a day to day process in the position would look like.", "Interview Questions": "How would you handle a conflict with a coworker?"}, {"date": "21 Apr 2017", "title": "Billing Specialist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Wake Forest Baptist Medical Center (Winston-Salem, NC) in Jan 2016", "Interview Descriptions": "The interview process was as anyone would expect. Applied online, received a call from HR to set up an interview date and time. Came to interview and met with a group of people discussed the position and role I would play in the department. The actual offer is where the problem came into play. At the time, Human Resources was short staffed and it took almost 3 months to get an official offer.", "Interview Questions": "Asked to list strengths and weaknesses."}, {"date": "11 Oct 2015", "title": "Graduate Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Wake Forest Baptist Medical Center (Winston-Salem, NC)", "Interview Descriptions": "Online application followed by invitation for in-person interview.  In-person interview consisted of dinner on day 1 followed by meeting with faculty and other students on day 2.  Questions asked throughout, some in formal settings, others in in-formal settings.", "Interview Questions": "Of the faculty members you have met so far, have you seen any that you are interested in working with?"}, {"date": "17 Aug 2015", "title": "Programmer Analyst I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 days. I interviewed at Wake Forest Baptist Medical Center", "Interview Descriptions": "Interview was one-on-one's with the team that I would be working for. This was held after the initial phone interview.  It was very relaxed and straightforward.  But realize that the hospital as a whole is divided off into many different areas, so I can't speak for the hospital as a whole.  Once hired, the New Hire process was absolutely FANTASTIC!  I felt like I knew everything I needed to know before day 1 on the job.", "Interview Questions": "General information technology questions."}, {"date": "18 Jun 2015", "title": "Housekeeping Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Wake Forest Baptist Medical Center (Winston-Salem, NC)", "Interview Descriptions": "Interviewed at open interview with a lot of potential employee's had to wait a long time if you won't ed to interview for more than one job because of the amount of people getting interviewed.", "Interview Questions": "What are your strengths and weaknesses"}, {"date": "10 Jul 2015", "title": "Patient Transporter Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Wake Forest Baptist Medical Center (Winston-Salem, NC) in Jun 2015", "Interview Descriptions": "Went to interview, then they showed me around the department I applied to. I got a call from HR the middle of the next week and they asked a few questions and they offered me the job on the phone. I then went on to the pre-employment process scheduled for the next week and I started a couple weeks after the initial offer was made.", "Interview Questions": "What do you do in your free time?"}, {"date": "22 Dec 2015", "title": "Environmental Services Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Wake Forest Baptist Medical Center (Winston-Salem, NC) in Apr 2015", "Interview Descriptions": "I went thru a two day orientation and then put to work 3 days later. While working the first week I noticed that the things that was quoted to me about the job was not true more work was added.", "Interview Questions": "Was I able to perform the work for whitch I am applying for"}, {"date": "15 Sept 2015", "title": "New Graduate RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Wake Forest Baptist Medical Center (Winston-Salem, NC) in Apr 2015", "Interview Descriptions": "You apply online and submit a resume with cover letter. In addition you are expected to provide two reference letters by mail and also to write a paragraph about your interests in nursing. If contacted, you are interviewed twice - by an HR representative and also by the nurse manager for your potential unit of hire.", "Interview Questions": "The questions were typical personality-based inquiries, as new graduates have little to no experience. I was asked about my experiences in nursing school, as well. In both interviews I discussed my self-perceived strengths and weaknesses, too. To be honest the HR interview lasted much longer and felt formal as compared to my nurse manager's casual interview style. I was able to meet staff on the unit  that I was hired to after interviewing with the manager. "}], [{"date": "14 Oct 2014", "title": "Summer ResearchBiomedical Engineering Department Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Wake Forest Baptist Medical Center", "Interview Descriptions": "The application process did not include any kind of interview. I was contacted by email after applying on in a very simple process. The faculty made clear that if more time was available next year they would prefer to do interviews, but they were mainly just looking for applicants with good research experience.", "Interview Questions": "N/A"}, {"date": "14 Apr 2016", "title": "CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Wake Forest Baptist Medical Center (Winston-Salem, NC) in Sept 2014", "Interview Descriptions": "Wake Forest Baptist Health applied online with indeed got a call a few days later. Was called in a few days later and spoke with a manager.Got I call a back for a second interview with the director met with her and was offered the position.", "Interview Questions": "Why do you think you would be helpful in this role?"}, {"date": "11 Jul 2014", "title": "Research Scholar Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Wake Forest Baptist Medical Center", "Interview Descriptions": "The interview process was pretty straight forward. I received an email form the program coordinator for a Skype interview. Did the interview with a group of professors. Then I was invited on site for another interview. I gave a face to face interview. I also met with several people from other department and three days later was offered the position.", "Interview Questions": "None that I can recall. It was all about what I have done and what I intend to do during my postdoctoral. They also asked about my career goals"}, {"date": "28 Aug 2014", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Wake Forest Baptist Medical Center in Jul 2014", "Interview Descriptions": "Online application. Head of department called me personally to arrange a face to face interview. I met with him one week later. Then interviewed with three other people in the office. I was offered the job two week later, accepted, and started two weeks after that.", "Interview Questions": "There were no unexpected or difficult questions during the phone or face to face interview."}, {"date": "17 Feb 2015", "title": "CNA II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Wake Forest Baptist Medical Center (Winston-Salem, NC) in Jul 2014", "Interview Descriptions": "Very brief and informal, in fact I was more so interviewed by  CNA that worked on the floor. The nurse manager only asked a few questions and I met another nurse manager. They did not do any behavioral interviewing type questions.", "Interview Questions": "Just general questions about my experience in the hospital"}, {"date": "22 Jun 2014", "title": "RN Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Wake Forest Baptist Medical Center (Winston-Salem, NC) in Jun 2014", "Interview Descriptions": "I applied on the company website and was called for an interview 3 days later.  Then I went to the interview 2 days after that.  Following that interview I was called the same day to come in for an interview with HR.", "Interview Questions": "There were no hard questions in my opinion."}, {"date": "9 Jul 2014", "title": "CNA I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Wake Forest Baptist Medical Center in Jun 2014", "Interview Descriptions": "I applied online. Called the same day to set up interview. I had an interview 3 days later on a monday. Called back Friday to meet with Recruitment.  Met with recruitment following monday. Recruitment offered the job by tuesday. And I start the 28th. Quick hiring process but start day was a month down the road.", "Interview Questions": "Why do you believe you would be a good aspect to our team?"}, {"date": "15 Sept 2015", "title": "Food and Nutrition Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Wake Forest Baptist Medical Center (Winston-Salem, NC) in Jun 2014", "Interview Descriptions": "Simple and easy questions. They discussed everything about the job process. They were nice and respectful. They asked about my schedule and discussed the work hours. We discussed the job environment.", "Interview Questions": "Why would I be a good fit for the job?"}, {"date": "17 Mar 2014", "title": "Licensed Practical Nurse Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Wake Forest Baptist Medical Center (Winston-Salem, NC) in Mar 2014", "Interview Descriptions": "Downloaded application sent in via mail. Was called for first interview. Never called back for second interview.", "Interview Questions": "How do you rate yourself as a person?"}, {"date": "17 Feb 2014", "title": "Lab Tech II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Wake Forest Baptist Medical Center (Winston-Salem, NC)", "Interview Descriptions": "They took a long time to fill the position.", "Interview Questions": "My most problamatic question was the typical where do you see yourself in 5 years question."}], [{"date": "9 Jan 2014", "title": "Rad Tech Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Wake Forest Baptist Medical Center", "Interview Descriptions": "Apply online.  Interview with HR first, then if they determine you qualify, you are set up to interview with the department hiring manager.  During the department interview you meet the staff and they get an opportunity to ask questions.  If selected, you will get a formal offer, first by phone then in writing.", "Interview Questions": "Standard questions were not unreasonably difficult"}, {"date": "8 Jan 2014", "title": "Staff Sonographer Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 2 days. I interviewed at Wake Forest Baptist Medical Center", "Interview Descriptions": "no interview I was a contract employee", "Interview Questions": "N/A"}, {"date": "24 Mar 2015", "title": "Postdoctoral Fellow Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Wake Forest Baptist Medical Center (Winston-Salem, NC) in Nov 2013", "Interview Descriptions": "You come in and give a presentation of your research and maybe some ideas for projects in the lab you are applying to. This usually occurs during one of their weekly lab meetings and you present in front of the PI (your future boss) and lab members (your future co-workers).", "Interview Questions": "What project will you be doing in this lab?"}, {"date": "8 Oct 2013", "title": "Nurse Practitioner Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. The process took 3 months. I interviewed at Wake Forest Baptist Medical Center", "Interview Descriptions": "I am from out of state and work at a large, academic institution.  I was looking to move to NC for family reasons and offered an in person interview after applying online several months prior with no word for all those months.  They had told me they would reimburse my flight (they did not, they didn't even pay part of it- after the interview I never got a response to my query) but they did put me up in a hotel.  The interview was 2 days long and was extremely personal in nature.  No one asked any professional questions and instead asked about my spouse, my children, what I did outside work, it felt very intrusive.  The other NPs and PAs seemed unprofessional and one was dressed inappropriately (short skirt, low cut shirt).  I got the impression NPs and PAs were there for the physicians' amusement.  Additionally, the HR person was very abrupt and the salary range they proposed was crazy low.  This is not the place to go if you are an NP with any self respect for sure, I felt degraded.  I know a physician who works there who was able to tell me that they felt I was \"blonde but not bubbly blonde\" so it wouldn't work for them.  I wasn't interested anyway but I was unhappy that I had to go through a friend to even hear anything.  I flew all the way there and then they never contacted me ever again, not even an email.", "Interview Questions": "A physician asked \"Do you have school aged kids?  Will you be putting your kids in Catholic school?\""}, {"date": "8 Jun 2013", "title": "Administrative Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Wake Forest Baptist Medical Center", "Interview Descriptions": "Lame.  Job had no similarity to the job posting or the information communicated by the department chair.", "Interview Questions": "None; seemed too busy to be bothered with interviewing."}, {"date": "22 May 2013", "title": "Marketing Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 3 weeks. I interviewed at Wake Forest Baptist Medical Center", "Interview Descriptions": "Had an initial interview where they wanted to get the overall feel for me and what I was looking for. They introduced me to the Wake Health brand and had a quick overview of their marketing map. We discussed ideas for the future and how my talents could be used in their setting.", "Interview Questions": "Where did I see myself in 10 years- that's always a hard one for me! "}, {"date": "11 Dec 2016", "title": "Senior Vice President Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 4 days. I interviewed at Wake Forest Baptist Medical Center (Winston-Salem, NC) in Mar 2013", "Interview Descriptions": "Wide variety of people interviewed me, from the university to town businesses and political leaders.  Friendly but probing interviews, reflecting obvious commitment of town and university to the project.", "Interview Questions": "How are you prepared to undertake this role which has many constituents of the university and town?"}, {"date": "30 Jan 2016", "title": "OT Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Wake Forest Baptist Medical Center (Winston-Salem, NC) in Jul 2012", "Interview Descriptions": "I was interviewed by a panel of staff. They mostly asked questions about my clinicals since I was a new grad. They also asked some hypotheticals as well. Overall it was a very easy interview and everyone was very pleasant and easy to talk to. However, after the interview I had to call and email several times before hearing back about the job offer.", "Interview Questions": "They asked if I had experience working with certain populations."}, {"date": "18 Jan 2016", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Wake Forest Baptist Medical Center (Winston-Salem, NC) in Apr 2012", "Interview Descriptions": "Thorough, precise, and professional, the hiring managers were very professional take their time allowed me to answer my questions completely had extra questions to ask me which I felt like give them a better idea of who I am initially at the beginning let me describe myself to you know my background how I started in the nurse find joy nursing and the entire time I was not pressured and I remained calm the entire time.", "Interview Questions": "Have you had previous ER experience?"}, {"date": "7 Jul 2014", "title": "Clinical Studies Coordinator Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Wake Forest Baptist Medical Center (Winston-Salem, NC) in Mar 2012", "Interview Descriptions": "Interviewed with 3 physicians and a panel of 3 employees.  As it turned out...the other employees were salaried.  I got hired as hourly.  Not a fair place to work.", "Interview Questions": "Why do you want to move to this position?"}], [{"date": "30 May 2014", "title": "Research Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at Wake Forest Baptist Medical Center (Winston-Salem, NC) in Nov 2011", "Interview Descriptions": "I knew a post-doctoral fellow, who allowed me the opportunity to work on their project. I then emailed the scientist above him for permission, was granted it, and met them in person to talk about the position. It was very casual.", "Interview Questions": "No questions were asked."}, {"date": "10 May 2012", "title": "Research Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Wake Forest Baptist Medical Center (Winston-Salem, NC) in Dec 2010", "Interview Descriptions": "Participated in a phone screen with boss and another faculty member.  Extended an offer for a full day of face-to-face interviews and presentation describing my thesis work.  Met with 5 faculty members on an individual basis.  Gave a 1 hr seminar on my previous research.  Went to lunch with other research fellows in the group.  Went to dinner with another faculty member.", "Interview Questions": "What are your career goals?"}, {"date": "4 Mar 2014", "title": "RN Float Pool Nurse Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Wake Forest Baptist Medical Center (Winston-Salem, NC) in Feb 2010", "Interview Descriptions": "You apply on-line then they call you in for an interview and then hire you if they want to. The first time I applied here they were very slow to respond. I had to apply 3 times before they called then they acted like they were desperate for nurses and I said well why didn't you all call sooner. So they seem a little un organized. Some people actually had to go their as travelers, meet the manager, before they applied to permenant job so they could get in. All this happened about 4 years ago hopefully it changed.", "Interview Questions": "They asked things like where do you see yourself in 5 years, in 10 years? Or what are your strengths or weaknesses and how will they benefit the company?"}, {"date": "13 Dec 2013", "title": "Medical Billing Coding Management Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Wake Forest Baptist Medical Center in Jan 2010", "Interview Descriptions": "was very easy.", "Interview Questions": "You just have to prepare for any Question and be ready."}]]