[[{"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "I love my job", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "23 Feb 2022", "job_title": "Medical Assistant in Elma, WA", "duration": "N/A", "pros": "Team work, you learn a lot from the providers", "cons": "I wish we had better retirement match."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Run", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "25 May 2023", "job_title": "Would Rather Not Say in Elma, WA", "duration": "N/A", "pros": "None, there are no pros", "cons": "Low pay not team environment."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Run away, this is not a safe place. Do not fall for the illusion", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "15 Feb 2023", "job_title": "ARNP in Elma, WA", "duration": "N/A", "pros": "Leaving as rapidly as you can.", "cons": "Everything. Horrible management with no attachment to reality"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "The worst hospital I have ever worked for!!!", "rating": "1.0", "reviewer_affiliation": "Current Employee", "job_date": "25 Jan 2021", "job_title": "Nursing in Olympia, WA", "duration": "N/A", "pros": "Coworkers, location, new facilities, beautiful community", "cons": "Corrupt administration. There are people in admin positions that have absolutely no clue who their employees are. They refuse to work with a union to get a bargaining agreement and stall all meetings and in turn blame it on the union. They don’t believe in fair market pay, they don’t offer fair benefits across the board. They will fire anyone who ever goes against the admin. Managers have no control over their department. What Josh and his sheep say goes or else. They have a woman as chief experience officer but she doesn’t do anything with patient experience. They like to claim “Summit Strong” but they are so far removed from their employees. 7-9 nurses quit the emergency room in less than a weeks time. Now they offer very large sign on bonuses but can’t seem to give adequate wage increases. This “critical access” hospital is going to turn into a glorified medical building for urgent care and outpatient services. They are destroying this place and they don’t care. They have management meetings to basically do nothing productive. The cafe is a joke, they serve the most outrageous and off the wall meals that people just stopped buying all together. They make major changes without speaking to the employees it directly affects, then it fails and then it’s on the employees to find solutions. This place is a joke. Do yourself a favor and don’t work here! You will be so disappointed!!"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "Employees are treated poorly and HR holds very little power", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "4 Apr 2019", "job_title": "Anonymous Employee in Elma, WA", "duration": "N/A", "pros": "A lot of employees that work here are kind, hardworking, and honest.", "cons": "Most leadership roles at Summit very blatantly do not care for their employees. It has been told that management is told from the beginning of being hired that they are to always side with their own and to disregard employees below them should any problems come up; if this is not true then it is a clear picture as how management is viewed by the employees here. When an employee has a concern, management will pretend to listen or ignore what you have to say altogether. I have been here for nearly four years and my pay is only $0.25 higher than the starting pay for my position. I have been personally asked by a past manager if I REALLY was sick after calling in, and no they didn't have good reason to ask this. I have personally seen photos of what the kitchen looks like after the kitchen would close for the day in the SPMC building, which included mold in a lot of food containers, meat left out on the counters, uncleanliness, and many more health violations; to my understanding, this was brought to the CEO's attention and he decided to ignore the problem. Our turnover rate is high, one the reasons being that employees are tired of being disrespected and undervalued."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Fun place to be!", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "22 Apr 2019", "job_title": "Anonymous Employee in Elma, WA", "duration": "N/A", "pros": "Great cafe, fun events for staff, learning new programs, loved my coworkers. Summit is on a good path and will keep growing to serve the needs of the community.", "cons": "The workload is heavy, but rewarding."}], []]