[[{"date": "N/A", "title": "Certified Surgical Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Hospital for Special Surgery (New York, NY) in Mar 2022", "Interview Descriptions": "Video call with a couple of PCDs ans well ans HR and discussed the position and what HSS has to offer. Allowed question to be asked and very straight forward", "Interview Questions": "What was a conflict you had on the OR and how did you resolve it?"}, {"date": "7 Jul 2023", "title": "Patient Access Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Hospital for Special Surgery (New York, NY)", "Interview Descriptions": "Long process. Interviewed 3 times. During the interview process I was asked about the company, if I’ll return back to school to further my education. I had 2 virtual interviews and one in person.", "Interview Questions": "Am I flexible with my schedule"}, {"date": "2 Jun 2023", "title": "Physician Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Hospital for Special Surgery (New York, NY)", "Interview Descriptions": "3 interviews. First with HR. Second with PA Director where he wants to get to know you. Third with the director again with an assistant where they ask you clinical questions.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "21 Mar 2023", "title": "Bioinformatics Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Hospital for Special Surgery", "Interview Descriptions": "I first received an HR call, and then I met with the team. I was then asked to do a small take home coding project. At the end, they made a call again.", "Interview Questions": "Interviewed about R, python, pipeline and etc."}, {"date": "25 Mar 2023", "title": "Intern Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 3 weeks. I interviewed at Hospital for Special Surgery in Feb 2023", "Interview Descriptions": "A one on one interview asking mostly behavioral questions. Asked about my career goals post graduation and my previous experiences. Very straightforward and nice. One round and a quick turn around.", "Interview Questions": "Tell me a little about yourself? How have you worked in groups to better a project? Tell me about a challenge you faced and how you overcame it"}, {"date": "4 Jan 2023", "title": "Development Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Hospital for Special Surgery (New York, NY)", "Interview Descriptions": "I went through 4 rounds: a screening with HR, then a 1:1 interview with the hiring manager, followed by an informal interview with potential coworkers, and lastly I went through an interview with a senior manager. The whole process took about ~3 weeks. Everyone was friendly and responsive, seemed like a great environment with career development.", "Interview Questions": "Why HSS? Why healthcare? Why development? How do you stay organized? Would you enjoy building relationships with donors?"}, {"date": "1 Feb 2023", "title": "Building Service Aid Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Hospital for Special Surgery (New York, NY) in Jan 2023", "Interview Descriptions": "I had a Couple of interviews, apply online, interview by hiring manager and with staff. Then interview with the director. Overall look forward to about 3-4 interviews. Be patient it’s not a quick process.", "Interview Questions": "Tell us about your work experience?"}, {"date": "25 Oct 2022", "title": "Director Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Hospital for Special Surgery", "Interview Descriptions": "Long, disjointed, confusing, inadequate in terms of response from HR, long drawn out timelines and extended no replies. So I decided to run with the races and seek help. It all worked out great.", "Interview Questions": "what would you do differently in your current role?"}, {"date": "28 Aug 2022", "title": "Summer Intern Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Hospital for Special Surgery", "Interview Descriptions": "Wasn't given an interview due to lack of qualifications - eg a high school degree only required and was an Ivy League BA holder... It was interesting to note that I was rejected very quickly despite being overqualified.", "Interview Questions": "Educational qualifications and degrees I had attained"}, {"date": "26 May 2022", "title": "IT Director Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Hospital for Special Surgery", "Interview Descriptions": "Interviewer showed up a bit late, I went through a recruiter. To be honest I am just writing this because glassdoor needs this to unlock its features. What else can I say?", "Interview Questions": "Asked the normal questions, pretty average experience."}], [{"date": "26 Jan 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Hospital for Special Surgery", "Interview Descriptions": "For the new grad orientation and residency, you will have an interview with HR and then a panel interview. Be sure to prepare questions about why you'd want to work there. I would definitely research the hospital and see if they've gotten any recent designations or awards", "Interview Questions": "Priorities question, about which patient is more acute/which one I would assess first"}, {"date": "2 Dec 2021", "title": "Biostatistician Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 3 months. I interviewed at Hospital for Special Surgery (New York, NY)", "Interview Descriptions": "2 phone screenings by hiring manager and colleague. 3 times on-site interviews (2 times with surgeons/physicians, 1 time for 5 one-on-one interviews with core members). whole process lasted for more than three months.", "Interview Questions": "why do you apply this job?\r\nhow do you see yourself in 5 years from now?\r\ndo you know power analysis?\r\ntell me more about your school project."}, {"date": "24 Jun 2022", "title": "Database Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Hospital for Special Surgery (New York, NY) in Dec 2021", "Interview Descriptions": "The HR contact repeatedly told me that I would hear from the team by certain days and there was no follow-through. No reply to my email with the requested work material. Unprofessional 1st Interview", "Interview Questions": "I asked if the manager had good communication skills and his boss yelled out no over the call. Let's just say things went downhill after that."}, {"date": "2 Oct 2021", "title": "Nurse Practitioner Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. I interviewed at Hospital for Special Surgery", "Interview Descriptions": "The interview process is a lot. Total of 7 references. 4 for HR and 3 for credentialing. Te interview with the manager is easier than the interview with HR. I feel HR tries to intimidate you so you can say you don’t want the job anymore or give up", "Interview Questions": "Tell me about yourself \r\nWhat would your coworkers say about you and what would they say you need to improve on? \r\nWhen did you go above and beyond for a patient? "}, {"date": "25 Sept 2021", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Hospital for Special Surgery", "Interview Descriptions": "Initial call with that led to a follow up call. Discussed relevant experience and the fit with the position. Both calls went well which led to a summer internship. The experience was phenomenal.", "Interview Questions": "Talk to me about your relevant experience"}, {"date": "18 Aug 2021", "title": "Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Hospital for Special Surgery", "Interview Descriptions": "It is worth noting that references were requested before offer letter. Coordinated with HR and hiring manager independently but offer came from HR manager.  Flexible for in person and phone meetings which was great.", "Interview Questions": "What is your 5 year plan professionally?"}, {"date": "4 Aug 2021", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Hospital for Special Surgery", "Interview Descriptions": "I love this place! If I could I would stay here forever! \r\nThe best part is how great they are with their staff.\r\nDuring Covid they kept us safe and didnt layed us off!", "Interview Questions": "Don’t remember the interview process"}, {"date": "13 May 2022", "title": "Registry Data Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Hospital for Special Surgery (New York, NY) in Aug 2021", "Interview Descriptions": "Preliminary interview was held virtually with the current co-ed team for this role. There was not much engagement  from the team members, other than the Manager asking general interview questions. The next phase was a job task aid on Excel. The individual tasked with giving me my assignment was a day late in the delivery, which cut my production time in half before the due date. This didn't seem fair, considering other candidates probably had a full 2-days to complete the assignment. General sentiments: the Interview process for this role seemed lazy with low morale among team members.", "Interview Questions": "Basic level questioning & a Job Task Aid using Advanced Excel tools. "}, {"date": "9 Nov 2021", "title": "Project Manager, Office of Diversity, Equity & Inclusion Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 8 months. I interviewed at Hospital for Special Surgery (New York, NY) in Jul 2021", "Interview Descriptions": "I applied to the position in February, but was not contacted until mid-June.  I began interviewing in early July.  I was advanced to a second interview in late July.  I was then asked to complete a test assignment, after which I was invited to a third round of interviews, meeting an additional three people in late August.  Then they 'ghosted' me.   I was never made aware they made a hiring decision and when I reached out via email to inquire whether they had made a hiring decision, my email went unanswered two weeks before I received an abrupt response that a decision was made \"some time ago,\" and someone should have contacted me.   \n\nI check my spam folder routinely and received every other communication from them, except the email informing me that they decided to go with another candidate.  This is one of the reasons why candidates distrust test assignments.  They wasted several hours of my time having me meet with 6 different people at 45 minutes each, not including the time spent on the test assignment and then never had the decency to inform me that they decided to go with someone else.   \nEveryone I met was very nice and it was extremely disappointing that the process I experienced was so disorganized and dysfunctional.\n\nWhen I asked for feedback, I was told that everyone was very impressed by my interviews and credentials, but the consensus was the role might be \"too junior for me.\"  Throughout each of the interviews and even in submitting the test assignment, I was constantly told that this was \"a highly visible\" (and newly created) role that would be reporting to the Chief Diversity Officer as well as Senior Leadership of the Enterprise.   I'm not sure why I would have gone through such a lengthy interview process for a role they apparently thought I might be overqualified for.  During my very first interview when salary was discussed, I was told very confidently that they were \"quite comfortable\" with my requested range and even the tone the interviewer used implied that I might have been asking too low.  I was even emailed benefits information the same day to persuade me on why I should consider them as a prospective employer.   I truly wish them well.  As a hospital they have a wonderful reputation in terms of patient care; however, here are clearly some hiccups in HR that need to be corrected.", "Interview Questions": "I was asked about my experience managing projects and how I keep track of and prioritize assignments.  I was asked how the enterprise could support me in continued learning.   The test assignment was to craft a communication coming from the Office of Diversity, Equity & Inclusion on adding pronouns to email signatures and provide explanation of why this is important. "}, {"date": "29 Jul 2021", "title": "Clinical Research Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Hospital for Special Surgery in Jun 2021", "Interview Descriptions": "1 hour interview.  The team was very friendly and professional.  Something I really appreciate was how easy the conversation went. It was great to discuss not only the strengths of this position, but to highlight the difficulties as well.", "Interview Questions": "All questions based on my CV experience."}], [{"date": "25 Feb 2022", "title": "Unit Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 months. I interviewed at Hospital for Special Surgery (New York, NY) in Jun 2021", "Interview Descriptions": "It was a warm and friendly interview experience. It was remote on zoom with members of the staff leadership. The environment is nice and questions are welcomed and encouraged. Once you complete the interview if you are selected you will begin onboarding  and modules. Then you will be asked to work daily as part of the orientation process. The orientation period varies per person.", "Interview Questions": "Why do you want to work here? \r\nWhat are some strength and weaknesses?\r\nHow is your commute going to look like?\r\nCan you work early ie. get here at 7am or leave at 12pm?"}, {"date": "4 May 2021", "title": "Registered Nurse Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Hospital for Special Surgery", "Interview Descriptions": "HR phone interview was scheduled not long after application submission. The recruiter called me for a 20 minute interview. At the end of the call they scheduled my second interview  with nursing management", "Interview Questions": "What kind of work environment do you thrive in? What is required to be successful in nursing?"}, {"date": "7 Jul 2021", "title": "Service Line Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Hospital for Special Surgery (New York, NY) in May 2021", "Interview Descriptions": "I applied online in April 2021. I went through three rounds of interviews within three weeks. All three of the people who interviewed me  were really great and very friendly.", "Interview Questions": "Tell me about yourself\r\nWhere do you see yourself in 5 years?\r\nWhat are some of your strengths/weaknesses?\r\nWhy do you want this position?"}, {"date": "14 Mar 2021", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Hospital for Special Surgery", "Interview Descriptions": "Interview process was a zoom interview call with the people who held the position and then the supervisors afterwards. It was a total process of around 2 weeks. It was positive overall.", "Interview Questions": "Name a time you've done something for the first time. "}, {"date": "28 Feb 2021", "title": "Medical Secretary Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Hospital for Special Surgery", "Interview Descriptions": "It was a pretty good experience, manager was very attentive and professional. Overall very nice place to work for. Very clean and modern, benefits that are offered are also great.", "Interview Questions": "My previous work experience ."}, {"date": "17 Jun 2021", "title": "Administrative Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Hospital for Special Surgery (Jacksonville, FL) in Jan 2021", "Interview Descriptions": "That interview was very quick and easy but the company is a little disorganized being as though they are still growing They call me for an interview it is they called me three days later", "Interview Questions": "Why do I wanna work there"}, {"date": "5 Feb 2021", "title": "Marketing Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Hospital for Special Surgery (New York, NY) in Jan 2021", "Interview Descriptions": "Virtual interview with a panel of people. Everyone was very friendly and accommodating. Questions were fair and pretty standard for this type of role. Seems like a nice place to work.", "Interview Questions": "Name a time you dealt with a challenge between two different teams?"}, {"date": "16 Jul 2020", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Hospital for Special Surgery", "Interview Descriptions": "The screening interview was a pleasant experience with the typical interview questions. It was about 15 minutes and the interviewer was nice. This was a phone screening. The interviewer also told me about the job description and what to expect with the next steps.", "Interview Questions": "What are your strengths and weaknesses?"}, {"date": "3 Aug 2020", "title": "Marketing Intern Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Hospital for Special Surgery in Jul 2020", "Interview Descriptions": "Felt very casual. Interviewers were nice and seemed very supportive. Questions weren't too tough and they really seemed to love their times at HSS.  Job description seemed easy enough but I guess they were looking for people with more experience.", "Interview Questions": "What's your experience with HTML and MailChimp?"}, {"date": "27 Jul 2020", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Hospital for Special Surgery (New York, NY) in Jun 2020", "Interview Descriptions": "The interview process with HR went smooth.  The interviewer asked basic questions such as tell me about yourself, what are your strengths/weaknesses, why did you choose this hospital", "Interview Questions": "what are your strengths ?"}], [{"date": "9 Apr 2020", "title": "Lpn Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Hospital for Special Surgery", "Interview Descriptions": "Everyone was helpful and the interview went smoothly. First you meet with HR and then the nursing manager and clinical coordinator. Be prepared to answer basic interview questions and sound confident.", "Interview Questions": "Why do you want to work with us ?"}, {"date": "7 Nov 2019", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Hospital for Special Surgery (New York, NY)", "Interview Descriptions": "Process took about 2 months from application to hire date. I was reached out via e-mail to come in for an interview. Interviewed with 4 doctors from the department. About two weeks later, HR asked me for my references. After my references went through I got an offer and accepted. Interview process was smooth and quick.", "Interview Questions": "Tell me about yourself"}, {"date": "29 Oct 2019", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Hospital for Special Surgery", "Interview Descriptions": "sat in  a room with the volunteer coordinator and she looked over my resume and asked me why i wanted to become a volunteer at HSS and about my previous experiences volunteering", "Interview Questions": "why do you want to volunteer at HSS"}, {"date": "21 Sept 2019", "title": "Mobile Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Hospital for Special Surgery (New York, NY)", "Interview Descriptions": "I was interviewed by two managers and was hired on the spot which is rare. We sat in a room 1:1. There is a HR screening process which include referrals and drug test following the 1:1 interview.", "Interview Questions": "How can you help add to HSS culture "}, {"date": "19 Oct 2019", "title": "Sports Safety Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Hospital for Special Surgery (New York, NY) in Sept 2019", "Interview Descriptions": "The phone interview was fairly straight forward. In-person interview after that was also fairly straight forward. They asked about what you have done and a run-through of your resume.", "Interview Questions": "Run through your resume and skills"}, {"date": "26 Sept 2019", "title": "Licensed Practical Nurse Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 months. I interviewed at Hospital for Special Surgery in Jul 2019", "Interview Descriptions": "I applied online and they didn’t call me. Luckily I knew someone that worked there and was able to give my resume to management and then I got an interview. After my interview I received an interview date for HR. I met with her not very pleasant we discussed benefits, pay and hours. I provided my references and was told I should hear back in one week. I never heard back from them. I’ve emailed plenty of times an nothing. Very unprofessional.", "Interview Questions": "If I was to contact tour job what is one thing they would say you should improve on?"}, {"date": "25 May 2019", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Hospital for Special Surgery", "Interview Descriptions": "They really went into detail of my resume and asked me to explain whatever they are interested in. The whole process is not intense at all and this interview would last about one hour.", "Interview Questions": "Tell me about yourself"}, {"date": "29 Apr 2021", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Hospital for Special Surgery (New York, NY) in Apr 2019", "Interview Descriptions": "Overall it was a great experience. The only issues I have are that I wish I got more hands on, got to observe more and wish we got paid, even if it wasn’t a lot.", "Interview Questions": "How would my friends describe my personality? "}, {"date": "25 Feb 2019", "title": "Administrative Secretary Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Hospital for Special Surgery", "Interview Descriptions": "Hiring process took about a month with 3 separate interviews. The hospital is not easy to get to, and I was given the wrong address for my second interview. Be sure to give yourself adequate time to get here.", "Interview Questions": "What type of work environment are you looking for"}, {"date": "14 Feb 2019", "title": "Registered Nurse - Operating Room Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Hospital for Special Surgery (New York, NY) in Feb 2019", "Interview Descriptions": "Applied online. Emailed Human Resources. Received an email and a phone call from Human Resources asking questions about what I was looking for. Scheduled an in person interview the following week. Had the interview with HR and was asked questions for about 15-20 minutes.  HR then set me up in a cubicle to take a medication administration test and if you pass you move on to the second part of the interview. I passed it and was sent to a different location to meet with the units manager for a second interview in the same day. The unit manager asked generally the same questions that HR asked.", "Interview Questions": "Tell me about yourself. Tell me about your experience.  How do you handle difficult situations at work. Where do you work now? What do you know about us at HSS? Three words your peers would use to describe you? "}], [{"date": "10 Apr 2019", "title": "Desktop Support Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 1 week. I interviewed at Hospital for Special Surgery (New York, NY) in Jan 2019", "Interview Descriptions": "Very easy laid back and they make you feel comfortable. I only had to interview with one person.  I went into the managers office. They gave me the offer the next day.", "Interview Questions": "Where do you see your self in 5 years, how many certificates do you have. How would you handle multiple projects at once. What would you do if you had 3 pressing issues at the same time. What would you do if you had to escalate."}, {"date": "1 Mar 2019", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Hospital for Special Surgery (New York, NY) in Jan 2019", "Interview Descriptions": "I had an initial phone interview with the vice president at HSS. Then, they offered me another phone interview with a team member. The phone interviews followed by an on-site interview where I met most of the team members.", "Interview Questions": "Tell me about yourself."}, {"date": "23 Jan 2019", "title": "IT Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Hospital for Special Surgery (New York, NY) in Jan 2019", "Interview Descriptions": "respond time is extremely fast and manager was humble and easy going. We had a long talk about how i started working in my department and what can i offer to department. i was asked about my skills and how did i learn it.", "Interview Questions": "asking for what skills i have obtained in my previous job"}, {"date": "8 Apr 2019", "title": "Research Assistant Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Hospital for Special Surgery (New York, NY) in Jan 2019", "Interview Descriptions": "I applied online through the HSS website to multiple RA and CRC positions. A couple weeks later I got a call from a physician researcher in the Radiology department. He asked a couple standard questions about my background and interests in research. I followed up on the call later that day with a thank you email to which I got no response. To my surprise, the physician called me a couple weeks later asking to have me come in for an in-person interview. The interview was pretty relaxed, and I drove most of the conversation. After meeting with the physician, I met with the research coordinator of the department and interviewed with her. Overall it was a relaxed interview, I got offered the position and was forward to HR for references and salary negotiations. Unfortunately I couldn't accept the position because of how low they were paying  (they started at 35k a year, I countered at 50k and that was pretty much the end of it) as I had other offers which were higher.", "Interview Questions": "Whats your background, where do you want to go in your career, why do you want to work as an RA in this department, when can you start, etc."}, {"date": "21 Nov 2018", "title": "Patient Access Representative Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 4 weeks. I interviewed at Hospital for Special Surgery (New York, NY) in Nov 2018", "Interview Descriptions": "I applied online and received a call 3 weeks later. The entire process took 4 weeks. The job description outlined stated they were looking for someone with at minimum a high school diploma and at least 1-2 years of healthcare/MD office experience. I had read a review left not to long ago before interviewing where someone was hired and had a little less than 6 months experience. I assumed I would be ok since I had almost 2 years  and a bachelors degree. Boy was I wrong and this interview was a complete waste of time. I interviewed for the position and I don’t believe they are looking for experience instead I’d say a specific look. No questions asked about my experience and how I can contribute to the position. The entire interview was focused on keeping the patients happy. I had to intervene a few times to compare experiences to show how qualified I was. From my interview with the two hiring manager I was asked to walk 3-4 blocks down to meet with HR. Upon arriving I had to keep saying through intercom I was here to see HR. The receptionist kept asking who was I there to see however no name was provided in my invite all it read was to report to the address and ask for HR. I stood outside for 2 minutes which seemed like forever since the it was a bad snow day this day. The women I interviewed with was busy focused on my degree rather than my experience. She just kept asking how it pertained to the job. I of course had to keep reminding her of my job experience in which I kind of knew at the moment I didn’t get it and didn’t bother pushing any further. Luckily I have a job but this interview serious was a waste of time. My application that was submitted obviously deemed me as a qualified candidate so why not focus on what I can offer?", "Interview Questions": "What does your degree have to do with the job?"}, {"date": "9 Jul 2019", "title": "Intraoperative Neuromonitoring Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 3 days. I interviewed at Hospital for Special Surgery (New York, NY) in Nov 2018", "Interview Descriptions": "Met with an individual her title was HR employee recruitment interview we met in the office I war a suit but no tie,  a pocket square as an accessory and a watch and chestnut brown shoes.  Not stressful at all very calm enjoyable interview  and the person that interviewed me was extremely nice", "Interview Questions": "Past occupations educational history and some personal questions"}, {"date": "11 Oct 2018", "title": "Research Engineer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Hospital for Special Surgery", "Interview Descriptions": "Applied for the position through an online application. Brief skype interview was conducted with multiple people. Questions surrounded the description of  the position and asking about background information. Not much correspondence after the interview", "Interview Questions": "Mainly questions regarding background and potential fit in the position"}, {"date": "23 May 2022", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Hospital for Special Surgery in Oct 2018", "Interview Descriptions": "I interviewed with HSS a total of three times. They were not very flexible in terms of scheduling interviews that would fit my availability. The Director that interviewed me was very late to our meeting and kept me waiting for quite some time.", "Interview Questions": "Why are you seeking new employment?"}, {"date": "3 Sept 2018", "title": "Patient Care Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Hospital for Special Surgery", "Interview Descriptions": "Applied online, received a link to schedule a phone interview that day which occurred the following day. HR was upfront and transparent in explaining the interview procedure and on boarding procedure since I was on a time crunch. I had an in person interview the day after the the phone interview and after the HR interview had an interview with 2 patient care directors at the hospital. I received an offer the next day and began the on boarding process. \r\n\r\nFyi on the online application it says a minimum of 1 year na/pca experience and I had less experience (about 7 months at the time) and still was interviewed. Having experience with epic was a major talking point in all my interviews with HSS.", "Interview Questions": "What do you know about HSS? "}, {"date": "3 Dec 2018", "title": "RN Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Hospital for Special Surgery (New York, NY) in Sept 2018", "Interview Descriptions": "Meet with an HR employee, take a 50 question basic medication exam, meet with manager.  You must have an original copy of your highest degree diploma and nursing license", "Interview Questions": "The medication exam was the same as the one listed on RN. com"}], [{"date": "2 Aug 2018", "title": "Patient Care Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Hospital for Special Surgery in Jul 2018", "Interview Descriptions": "Overall the process took about two weeks. Interviewed with HR one week and on the floor the next week. Both interviewers we're very friendly and answered all the questions that I had about the role.", "Interview Questions": "Pretty standard i.e: tell us about yourself, past experiences, strengths, weaknesses, 5 year plan.  "}, {"date": "17 Nov 2018", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Hospital for Special Surgery (New York, NY) in Jul 2018", "Interview Descriptions": "2-step interview.  Recruiter first and follow up with team interview. Quick response.  Need 5 references.  Just be yourself during the interview. The interviewers were professional and friendly.", "Interview Questions": "Tell us about yourself. Why make you choose HSS?"}, {"date": "26 Oct 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Hospital for Special Surgery (New York, NY) in Jun 2018", "Interview Descriptions": "HR phone screen, followed by HR in person interview (pre-covid) and a med test. Second round was an in person panel interview with a nurse educator and multiple potential nurse managers", "Interview Questions": "Where do you see yourself in five years?"}, {"date": "26 Jul 2018", "title": "Value Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 4 months. I interviewed at Hospital for Special Surgery in Apr 2018", "Interview Descriptions": "The process took 3+ months, and I didn't have the offer. The entire process includes the phone interview with all team members, a data challenge, and a video onsite interview.  After the final round, they also asked me to provide 5 references for them. I keep following up with them for more than two months to express my interests and they just said they haven't made a decision. In the end, I didn't get the offer.", "Interview Questions": "Tell me about yourself."}, {"date": "22 May 2018", "title": "In-Patient Residency Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Hospital for Special Surgery in Apr 2018", "Interview Descriptions": "Applied via hospital's career job board at the end of Feb. Got a call about a first round interview at the end of March. This is was my first round interview", "Interview Questions": "Tell me about yourself"}, {"date": "29 Jan 2019", "title": "Supervisor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Hospital for Special Surgery (New York, NY) in Feb 2018", "Interview Descriptions": "Interview process went extremely well. Met with the HR recruiter and then met with the director and practice manager. I had a great experience meeting with all, and I felt like the interview went well.", "Interview Questions": "How would you supervise your staff? "}, {"date": "13 Apr 2018", "title": "Administrative Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 months. I interviewed at Hospital for Special Surgery (New York, NY) in Jan 2018", "Interview Descriptions": "Applied in November. Contacted by an HR Rep in December for an early-January interview. First met with HR, then with the head of the department I would work in. HR meeting lasted about 1 hour or so. Meeting with department head lasted maybe 30 mins. Introduced to some team members on the way out. Followed up with HSS once every 2-4 weeks with about 3 total emails sent in that time. The first two emails generated almost the same exact response - they're still looking at all the candidates, still interviewing, etc.... The third email did not get a response at all. I'm not sure whether or not I'm still in the running for the position. No communication in almost 2 months now.", "Interview Questions": "Tell me about your history and how you would fit into the open position."}, {"date": "3 Dec 2017", "title": "Assistant Director of Development Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 months. I interviewed at Hospital for Special Surgery (New York, NY)", "Interview Descriptions": "A friend knew the CEO and she asked him if she could put me in touch with him.  We spoke on the phone and then when a position opened up he had me come in and meet with him and the Director of Development.  I interviewed with the two of them separately and then a few other people and was offered the job within a week.", "Interview Questions": "Describe prior experience "}, {"date": "25 Oct 2017", "title": "Patient Care Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Hospital for Special Surgery (New York, NY) in Oct 2017", "Interview Descriptions": "I applied online and recieved a phone call about 3 weeks later. I missed it and had to call them back. I was set up for a face to face interview with the Director of the Department. Talent Acquisition are very professional and friendly people. The staff at the hospital were also very pleasant and helpful. Although i wasnt offered a position i'd still recommend anyone looking for a job to apply here!", "Interview Questions": "How do you deal with difficult patients?"}, {"date": "5 Apr 2018", "title": "Office Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 months. I interviewed at Hospital for Special Surgery in Sept 2017", "Interview Descriptions": "Fairly easy but lengthy. It took about 3 months to get a final answer. By then I thought I didn't get the position so I continued applying and interviewing with other companies", "Interview Questions": "Why are you leaving your current position?"}], [{"date": "26 Sept 2017", "title": "Physician Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Hospital for Special Surgery (New York, NY) in Sept 2017", "Interview Descriptions": "It was a meet and greet\r\nWe sat at tables and the interviewers came to sit and talk to us and we could ask any questions we wanted and we also told them things about ourselves individually. It was a pleasant experience.", "Interview Questions": "Tell us about you"}, {"date": "25 Jun 2017", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Hospital for Special Surgery", "Interview Descriptions": "30 minute phone interview. Generic questions like why do you want the position? What's your background? Tell me a bit about yourself.\r\n\r\n2 hour group interview. Prepped to go over a mock consent form.  They asked some behavioral questions.", "Interview Questions": "One thing you wish you could change the way you performed/completed something in the past."}, {"date": "21 Apr 2019", "title": "Network Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Hospital for Special Surgery (New York, NY) in Apr 2017", "Interview Descriptions": "it was a phone interview, and the process took 2 weeks. They also did background check to make sure i dont have any criminal record. The supervisor spoke to me on the phone and  the process did not take", "Interview Questions": "whats DMZ"}, {"date": "28 Feb 2017", "title": "Assistant Director - Special Events Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "The process took 12 months. I interviewed at Hospital for Special Surgery", "Interview Descriptions": "I first applied twice in late 2015 and never received a reply. I later applied for a similar role in late August 2016, and this time received a email from the sender \"Human Resources Auto Response\" that read:\r\n\r\nDear ,\r\n \r\nThank you for your interest in the position of Assistant Director - Special Events (2016-7801). While we were impressed with your background and experience, we have selected another candidate who more closely meets our needs at this time. Your information will be kept on file should we identify future positions that may be more suitable for you.\r\n\r\nNotice the \"Dear _______.\"\r\n\r\nClassy touch, eh?", "Interview Questions": "Nothing, they let the computer do all the work for them!"}, {"date": "12 Jun 2019", "title": "Patient Care Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Hospital for Special Surgery (New York, NY) in Jan 2017", "Interview Descriptions": "Long interview process, went to multiple locations interview with several individuals who all asked different questions, took a couple of different skill test, had to walk to the other location .  long wait to see HR", "Interview Questions": "My experience with paitent care"}, {"date": "15 Jul 2017", "title": "Community Educator RN Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Hospital for Special Surgery in Dec 2016", "Interview Descriptions": "The interview was set up in a relatively short time post application. Met with recruiter and department manager. The position was for a part time job. \nI was offered the job a few weeks later and inquired about an alternate orientation date because my schedule conflicted. \nI was called back a day later by them to rescind the offer because they REQUIRED the candidate to start ASAP. \nThis seemed very unreasonable for a part time job.", "Interview Questions": "Have you heard about our organization?"}, {"date": "3 Oct 2016", "title": "Nursing Student Externship Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through other source. The process took 4 weeks. I interviewed at Hospital for Special Surgery (New York, NY)", "Interview Descriptions": "Well, I simply called their HR & RN recruitment offices (I called all major NYC hospitals to find out and create an externship list).The person who answered was helpful and soon, I was scheduled for a 1st interview. It was a group interview with 1 administrator. She just told us about HSS. 1 q asked was what we knew about the hospital. I emailed a follow-up thank you, and received a 2nd interview. It was a group interview with 3 moderators (2 pt care directors, 1 CNS). They asked us the same questions so be prepared to have at least 3 different ans for the same q.", "Interview Questions": "-If you saw a PCT not wash their hands after pt care, what would you do?"}, {"date": "26 May 2019", "title": "Mobile Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Hospital for Special Surgery (New York, NY) in Oct 2016", "Interview Descriptions": "Very quick, professional atmosphere, and they provide you with all the details of the job. Managers were very friendly and quick process for hiring.  Gave a thorough walk through of the department.", "Interview Questions": "Why HSS?"}, {"date": "20 Sept 2016", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Hospital for Special Surgery (New York, NY)", "Interview Descriptions": "First, a phone call. Then I had two interviews in different parts of the HSS campus. From start to finish, this process took more than 2 months, and it only ended when they emailed to say that due to restructuring, they actually weren't going to hire for that position. Two months gone.", "Interview Questions": "Talk about previous research experiences."}, {"date": "20 Oct 2016", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 3 weeks. I interviewed at Hospital for Special Surgery (New York, NY) in Sept 2016", "Interview Descriptions": "Phone interview with the assistant director or research for their department of anesthesiology. A science background in undergrad was definitely held as a plus, but emphasis was placed on prior experience in clinical research. That said, my interviewer was professional and courteous, and invited me to the second step of the application process: a brief (strict word limit) critique of a peer-reviewed study that was relevant to the job role. After submitting my critique 3-4 weeks ago, I have not had any further contact after notifying them that I had received competitive offers elsewhere. That said, the interview process seems fair. Challenging, but absolutely fair and straightforward.", "Interview Questions": "What are your biggest 3 assets to any team, according to people who know you?\r\nWhat is your biggest weakness in a workplace setting?"}], [{"date": "15 Aug 2016", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Hospital for Special Surgery", "Interview Descriptions": "Simple, straight-forward. Interviewed with recruiter and nurse manager. HSS really wants to hire nurses who will maintain their image of dedication to patient/ customer-satisfaction in keeping up with their magnet designation. Very efficient staff, will respond quickly and give prompt update on whether or not they want to hire you (just a few days after interview).", "Interview Questions": "why nursing? tell me about a time you went above and beyond for a patient."}, {"date": "3 Aug 2016", "title": "Assistant Director Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Hospital for Special Surgery (New York, NY)", "Interview Descriptions": "Five or six interviews total including one with an external head hunter hired by the hospital. Very in-depth interview process. Found job on-line and started with a phone screen. Next was in-person with recruiter. Then interview with Director, then VP, then second interview with Director.", "Interview Questions": "A lot of questions about my professional and personal background. Emphasis on both skills and \"cultural fit.\""}, {"date": "7 Oct 2016", "title": "Licensed Practical Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Hospital for Special Surgery in Aug 2016", "Interview Descriptions": "Pretty good. Met with 3 higher ups at once. All genuine and pretty professional. Received quick feedback after interview and received good insight re: the position. \r\nBenefits, pay and everything related seemed great.", "Interview Questions": "How do you define team?"}, {"date": "25 Jul 2016", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Hospital for Special Surgery (New York, NY) in Jul 2016", "Interview Descriptions": "There was a phone screen, an interview with HR, and a final panel interview with another candidate. They were very responsive and welcoming during the interview process. Interview with HR were normal nursing interview questions - behavioral/personality questions. The panel interview included critical thinking clinical scenarios and how to escalate issues.", "Interview Questions": "Why do you want to work at HSS?"}, {"date": "12 Aug 2016", "title": "Clinical Research Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Hospital for Special Surgery (New York, NY) in Jun 2016", "Interview Descriptions": "Hiring process was pretty simple: I applied on their website and received responses within a week on average. The only downside to their website is that you have to apply with the same cover letter and resume - no tailoring it to different jobs (if, for instance, you want to apply for medical assistant as well as research). \r\n\r\nThe interview was straightforward. I met with the hiring manager, then met the research team, then spoke to one of the physicians who I would be working with had I received the job. They were very clear in their expectations of research assistants, which I appreciated.", "Interview Questions": "Can you agree to a two-year commitment?"}, {"date": "19 Sept 2016", "title": "Systems Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Hospital for Special Surgery (New York, NY) in Jun 2016", "Interview Descriptions": "Pretty much what other people said in their interview experience. \r\nIt started with phone screening, interview with HR, and finally interviews with managers. A very straight forward interview process. If you know your stuff, it's quick and painless process. Overall, a positive experience.", "Interview Questions": "How well do you know XXXXXXXX(Skill or experience)?"}, {"date": "19 Apr 2016", "title": "Physician Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Hospital for Special Surgery (New York, NY)", "Interview Descriptions": "Meet with Human Resources first to review your resume and discuss the terms of the position, salary, benefits, schedule, etc.   After that interview there was a second meeting (Same day) with the Administrators for the Physician assistant department.  Two Administrators were present during the interview, both prior PAs at the institution.   They asked questions like:\r\n Why did you want to become a PA? \r\nWhy do you want to join this hospital? \r\nWhat is your 5 year plan? \r\nWhat would you do if a patient had tachycardia post surgery?", "Interview Questions": "Why did you want to become a PA? Why do you want to join this hospital? What is your 5 year plan? What would you do if a patient had tachycardia post surgery?"}, {"date": "20 Jun 2016", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 months. I interviewed at Hospital for Special Surgery (New York, NY) in Apr 2016", "Interview Descriptions": "Applied through University, the process took 1 month. Interviewed at HSS on 4/21/16. Applied through my campus website, was contacted the next week for a skype interview. I did fairly well on the skype interview and the next day I was contacted to schedule an in person interview (which they apparently only did for 3-4 of their strongest candidaes) the next month. Had that interview on 4/21. I met with the physician as well as some other people in the department. They asked fairly straight questions and I thought I did pretty well. They told me that they had one more person to interview early May and that they would get back to me after. May came around and I received no response. I sent a follow up email on May 9th and I received no response either. While I understand if they went with another candidate, I would've appreciated it if they at least sent me an email saying I was not chosen instead of ignoring my follow up email since apparently I was \"final rounded.\"", "Interview Questions": "Q: What are your career goals? Describe the research that you were a part of in your Undergraduate Institution?"}, {"date": "13 Apr 2016", "title": "Clinical Research Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 months. I interviewed at Hospital for Special Surgery (New York, NY) in Mar 2016", "Interview Descriptions": "I received an email from the current research coordinator a few days after I submitted my resume confirming that I will be considered for the position. A couple of weeks later, I was invited to interview at the Hospital.  The interview environment was casual, and I met with the coordinator, a research nurse, and the principle investigator.", "Interview Questions": "What do you consider your strengths are?"}, {"date": "7 Feb 2017", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at Hospital for Special Surgery (Boston, MA) in Mar 2016", "Interview Descriptions": "I emailed the boss and then had a skype interview with him.  It was a very casual conversation where we discussed my background the the job details.  I was offered the job about a week later.", "Interview Questions": "Why this job?"}], [{"date": "8 Aug 2019", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. I interviewed at Hospital for Special Surgery (New York, NY) in Dec 2015", "Interview Descriptions": "Interviewed with a few people before employed. Initial interview with human resources. Then called back for follow-up interview with department head. Followed by several interviews with department directors. Sometimes with a group sometimes individually.", "Interview Questions": "Where do you do you see yourself 5 years from now?"}, {"date": "28 Apr 2019", "title": "Nurse (Pacu) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Hospital for Special Surgery (New York, NY) in Nov 2015", "Interview Descriptions": "PCD, charge nurse and nurse educator interviewed me as a panel. Nice, welcoming and not stressful.  We interviewed in PCD's office.  I also interviewed with HR the nurse recruiter before the panel interview. The HR person asked about what kind of things she thinks I'll encounter as a PACU RN.", "Interview Questions": "Name a challenging time at work and what you did? \r\nPrioritization question?\r\nwhy I left my old job?"}, {"date": "26 Jan 2018", "title": "Ar Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Hospital for Special Surgery (New York, NY) in Oct 2015", "Interview Descriptions": "Great experience, asked great questions, met with AD, supervisor as well as manager. Had two different interviews with HR as well. Was able to ask any question, felt comfortable and able to discuss future goals.", "Interview Questions": "What are you able to bring to the organization?"}, {"date": "1 Mar 2019", "title": "Office Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Hospital for Special Surgery in Oct 2015", "Interview Descriptions": "I had two interviews, my references were thoroughly vetted, I was drug tested.  I was provided a mandatory start date.  I was handled very professionally and as long as you can back up what is on your resume and present yourself in a way that you can be seen as part of the culture of the hospital, you can get through the process.", "Interview Questions": "Why did I want to work for the company and why should I be chosen of all of their applicants."}, {"date": "25 Aug 2015", "title": "Office Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 2 weeks. I interviewed at Hospital for Special Surgery", "Interview Descriptions": "I had five interviews, including one with HR. The questions were straightforward, but they are very thorough. It took two weeks before I received my offer. Be yourself & answer all questions honestly is my advise.", "Interview Questions": "Why should we consider you for this position?"}, {"date": "10 Aug 2015", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Hospital for Special Surgery", "Interview Descriptions": "I was interviewed by 4 people at a time. They asked rapid fire questions from general to specific. One of the interviewers made a face when I informed her that I would have to commute to work. The questions were kind of out there, but were mostly based on your prior research experience.", "Interview Questions": "Describe your prior research projects."}, {"date": "15 Dec 2017", "title": "Radiologic Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at Hospital for Special Surgery (New York, NY) in Aug 2015", "Interview Descriptions": "a lot of questions but nothing out of the ordinary. They asked me basic questions about positioning. Where did I go to school and where did I do my clinicals. They also asked me what I learned the most about how to treat patients and how social I was.", "Interview Questions": "How would you treat a patient that is very rude to you and you still need to perform the exam?"}, {"date": "4 Jul 2015", "title": "Physical Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Hospital for Special Surgery", "Interview Descriptions": "Stageset with various people in the department I would be working. shadowing of senior in position I applied for. Very good yet slow interview process\r\n\r\nHuman resources was a bit disorganized and took sometime to get back to me.", "Interview Questions": "What is my passion?"}, {"date": "13 Oct 2015", "title": "Practice Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Hospital for Special Surgery (New York, NY) in Apr 2015", "Interview Descriptions": "Sent via an Agency (who claims to have exclusivity to all positions). Once I am finally at my Interview, the person was late in meeting with me, I overheard her cursing & using profanity, demeaning language at her staff...then to top it all off, she did not know who I was nor had a copy of my Resume! I had to read thru my Resume and she was testy.", "Interview Questions": "She wanted to know what process & software I used for \"Billing\" & actually challenged that a software that I used in my previous employment did not exist."}, {"date": "3 Feb 2018", "title": "Unit Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Hospital for Special Surgery (New York, NY) in Apr 2015", "Interview Descriptions": "Apply online for the desired position. Once accepted you Meet with department manager for interview, went through hiring process for example blood test and drug test and get photo ID taken, orientation for 2 weeks which consist of learning about HSS and team building.", "Interview Questions": "How do you feel about blood?"}], [{"date": "18 Jan 2016", "title": "Revenue Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 1 day. I interviewed at Hospital for Special Surgery (New York, NY) in Mar 2015", "Interview Descriptions": "Terrible questions and horrible panel questions. Asked a lot of personal questions of which did not pertain to the job description. I was uncomfortable and did not understand why they questioned me until I interviewed with the VP of Finance.", "Interview Questions": "Confronted me about previous employer the interviewer knew whom I had a bad experience with."}, {"date": "17 Mar 2016", "title": "New Graduate Nurse Residency Program Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Hospital for Special Surgery in Feb 2015", "Interview Descriptions": "The first round of interviews for the new graduate nurse residency program is with HR who will then review your candidacy and set you up with nurse managers for a panel interview if you are chosen. If you make it to the second round panel interview, you and another candidate will answer questions asked by nurse managers and other nursing staff. The questions will assess clinical knowledge", "Interview Questions": "What are your strengths and weaknesses?"}, {"date": "22 Dec 2014", "title": "Senior Coordinator, International Learning and Training Center Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Hospital for Special Surgery", "Interview Descriptions": "I received a call for an invite to interview.  The initial call was about 10 minutes, where they mostly tried to understand my salary expectation and why I was leaving my previous job.  When I went in person, I first met with an HR representative, who told me about the hospital, gave me the details on the benefits I would be eligible for if I were hired (medical, dental, 401k, PTO, etc.) and then I was ushered over to the department that interviewed me.  Nothing terribly exciting or difficult involved and fairly straight forward.  I would be sure to ask about the hours involved, though, since this is a hospital and several departments run on a non-traditional schedule to cater to doctors and medical staff - this was my mistake.", "Interview Questions": "N/A"}, {"date": "27 Jan 2016", "title": "Registrar Physician Practice Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Hospital for Special Surgery (New York, NY) in Jan 2015", "Interview Descriptions": "It was lengthy because I received a lot of information. I expected more \"interview type\" questions but the person who interviewed me was very intrested in my questions rather than asking me.", "Interview Questions": "What are some of your responsibilities at your current employer?"}, {"date": "17 Dec 2014", "title": "Physician Assistant Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Hospital for Special Surgery", "Interview Descriptions": "I applied online and was contacted by HR within 2 weeks. HR staff is excellent. The first part was with  HR and 3 members of the PA department. The second part was with the PA director and lastly, with an attending on the service. All questions asked were expected and I was prepared for. The interviewers were professional and kind and enthusiastic.  They present HSS as a great place to work!", "Interview Questions": "One mistake you made and what you learned from it, most questions were expected."}, {"date": "20 Mar 2018", "title": "Patient Care Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Hospital for Special Surgery (New York, NY) in Oct 2014", "Interview Descriptions": "it was very swift, efficient, you knew right away if you got the job because they will tell you and also let you know what to do to speed up the on board process.", "Interview Questions": "what do you do if a patient is agitated and refuse your help? "}, {"date": "12 Jun 2014", "title": "Clinical Nutritionist Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 3 weeks. I interviewed at Hospital for Special Surgery", "Interview Descriptions": "It was fairly easy to make an appointment for the interview, but when I showed up 5 minutes early, they asked me to leave and wait in the hospital foyer upstairs because they were busy. It was not a good start. They seemed very unprofessional right off the bat. They asked a few basic questions, mostly about my availability but not much about my experience or clinical abilities.", "Interview Questions": "None. The questions were pretty standard and not very in depth."}, {"date": "18 Mar 2014", "title": "Client Services Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Hospital for Special Surgery", "Interview Descriptions": "I was free lance consultant before being hired", "Interview Questions": "name one negative thing about yourself and why"}, {"date": "23 Jan 2014", "title": "Customer Service Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Hospital for Special Surgery in Jan 2014", "Interview Descriptions": "Process took one week.", "Interview Questions": "N/A"}, {"date": "9 Dec 2013", "title": "Office Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Hospital for Special Surgery", "Interview Descriptions": "nice work environment. friendly employees.", "Interview Questions": "nothing difficult really"}], [{"date": "26 Jun 2013", "title": "CIS Analyst Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Hospital for Special Surgery", "Interview Descriptions": "The entire process was managed through their online system.  I was called by the office manager for that department to schedule a first in person interview.  When I arrived, the hiring manager met with me in a board room, while the 3 surgeons involved were paged.  It was a fairly intense interview with questions from all 4 of them.", "Interview Questions": "What discipline (ie RN, MD, other types of users) presented with the most difficulty training on the system."}, {"date": "20 Feb 2014", "title": "MR Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at Hospital for Special Surgery in Feb 2013", "Interview Descriptions": "Asked normal interview questions, some technical questions not hard.", "Interview Questions": "Was a very easy interview but there were 3 people in the interview."}, {"date": "15 May 2016", "title": "Registrar Physician Practice Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Hospital for Special Surgery (New York, NY) in Feb 2012", "Interview Descriptions": "Three managers interviewed me at once which was a bit nerve wracking but it went well I thought. It took a while to get a call back however. I got a call back maybe three weeks to a month after doing hte interview and was told I got the position.", "Interview Questions": "Why do you want to work here?\r\n"}, {"date": "26 Aug 2015", "title": "Rehab Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Hospital for Special Surgery in Mar 2011", "Interview Descriptions": "Pretty standard interview questions, strengths and weaknesses, tell me about yourself, why should we hire you, previous experience, resume questions, rank the different departments in preference order, tell me about a time when..., etc.", "Interview Questions": "Why do you want this job?"}, {"date": "28 Oct 2015", "title": "Systems Administrator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at Hospital for Special Surgery (New York, NY) in Feb 2011", "Interview Descriptions": "Apples via campus recruiting. 1st round phone interview within 2 weeks. Final onsite interview invitation the next day. Great tour of full facility. Everyone was really busy but managed to still be very nice and approachable. Given 30min case study that I was expected to present to panel afterwards. Overall challenging yet rewarding experience", "Interview Questions": "Tell me about a challenge you had to overcome"}, {"date": "7 Apr 2010", "title": "Licensed Practical Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 1 day. I interviewed at Hospital for Special Surgery (New York, NY) in Mar 2010", "Interview Descriptions": "HR was wonderful and very informative about the job position listed and also reviewed their benefits package.", "Interview Questions": "Why am I changing careers in my nursing career?"}, {"date": "2 Apr 2010", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Hospital for Special Surgery (New York, NY) in Jun 2008", "Interview Descriptions": "The interview consisted more of a conversation that was less about the job but more about us personally getting along well.  Since it was an entry level position anyway, I thought this was appropriate.  Great rapport, fantastic people, I was really excited about starting the job after the interview. I always received lots of good feedback and support from all levels.  I never had any negative feelings while working there.", "Interview Questions": "Tell me about yourself"}]]