[[{"date": "29 Jun 2021", "title": "Adjunct Faculty Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Triton College (Chicago, IL) in Jun 2021", "Interview Descriptions": "The dept chair and the dean together interacted with me on Zoom. It was a little difficult getting started because the first link did not work, so I had to find their email addresses and contact them in that way.", "Interview Questions": "more of an exchange of information than questions"}, {"date": "31 Oct 2019", "title": "Full Time Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Triton College", "Interview Descriptions": "First you needed to apply, then there was a panel interview, then you met with the president and interviewed.  It was very straight forward.  Took several months to hear. Onboarding was very easy and supportive", "Interview Questions": "what makes you grow as an instructor"}, {"date": "25 Sept 2019", "title": "Human Resources Generalist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Triton College (River Grove, IL) in Sept 2019", "Interview Descriptions": "I was in initially contacted by a recruiter to set up an interview. We were able to set up an interview a few days later. I arrived and interviewed with a panel of 5 people. They all had a packet with the preprinted questions they were to ask, I also was given a copy of the packet. There was zero deviation from the packet questions. After the interview I was told I’d be contacted by the same recruiter either way- whether they wanted to move forward in the interview process or not. I never heard from her again, either way, which was the most frustrating part. Please don’t tell me I’m going to be contacted either way if you have no intention to do so.", "Interview Questions": "Are you comfortable working with people with different backgrounds?"}, {"date": "10 Jul 2019", "title": "Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Triton College", "Interview Descriptions": "I interviewed with the search committee which consisted of members of my department, and then with the President and Vice President. The interview questions were fairly straight forward. Now they require a teaching simulation.", "Interview Questions": "What do you find challenging about teaching."}, {"date": "11 Mar 2020", "title": "Adjunct Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Triton College (River Grove, IL) in Sept 2018", "Interview Descriptions": "The interview was easy to manage and I felt welcomed. The follow up interview was a little more stressful, but also made me feel welcomed. The culture is clearly to behave invitingly towards potential new staff.", "Interview Questions": "Describe your teaching style."}, {"date": "1 Jul 2018", "title": "Student Services Advisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Triton College (River Grove, IL)", "Interview Descriptions": "The interviewers did not have any weird/out of the blue questions. I always find it funny, though, when you are applying for an advisor role, the interviewers are unprofessional. In this particular case, two of my interviewers yawned, and one of them even cut me off to see if the other interviewer was scheduled to come at a certain time (They had back-to-back interviews for two days - my guess is around 6 interviewees for this position/per day). In addition, I was told I was going to find out whether or not I got the job within a week, and...nothing, even after following-up.", "Interview Questions": "Scenarios, experience on public speaking, experience working with diverse populations, experience recruiting"}, {"date": "13 Jul 2018", "title": "Student Success Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Triton College (River Grove, IL) in Jun 2018", "Interview Descriptions": "Time from application to first interview took about 3 weeks. First interview was in a group, various people from the department and other offices were there. Process took approx 45 minutes. Additional written test was given after group interview.", "Interview Questions": "All questions were provided provided in writing to me as well as out loud by the various people around the table. No much interaction aside from the the written questions. The interactions were a bit awkward, the interviewers gave the impression that they were new at conducting this process. "}, {"date": "17 Nov 2018", "title": "Dean Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Triton College in Feb 2018", "Interview Descriptions": "My first interview was over the phone. The second interview was in person, on sight. Met wtih the faculty and staff members. Second interview on sifght. First interview over the phone.", "Interview Questions": "What do you know about unions and what experience do you have negotiating with them?"}, {"date": "10 Jan 2018", "title": "Adult Education Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. I interviewed at Triton College in Dec 2017", "Interview Descriptions": "Met for about 30 minutes with director, who asked questions about teaching community college students. Took about 15 minutes to teach a sample lesson in front of other staff. Met with Dean who discussed more about the school and asked a couple of questions.", "Interview Questions": "What is your teaching philosophy?"}, {"date": "3 May 2017", "title": "Dean Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Triton College (River Grove, IL) in Apr 2017", "Interview Descriptions": "I initially applied online for the position \"Dean\" and emailed 4-6 weeks later to come in to  interview with a panel of 4 team members, if I advance from there a 2nd interview with my direct support, the President and or Board of Trustees.", "Interview Questions": "How do I see mentoring as a benefit for a company"}], [{"date": "29 Jan 2017", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 5 days. I interviewed at Triton College (River Grove, IL)", "Interview Descriptions": "Talked over phone and then came in for in-person interview. It was weird they offered me the job over the phone but then I had to meet with the Dean because they were having internal issues. They asked me what my beliefs were and how I would conduct a class. also what my educational philosophy was.", "Interview Questions": "told me they liked the fact that my resume showed stability"}, {"date": "18 Apr 2016", "title": "Dual Credit Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 days. I interviewed at Triton College", "Interview Descriptions": "Applied online through indeed. I was called in to speak to the person hiring and got hired 3 days later. The process to make sure background check went through and on boarding took another week. Process was smooth and simple.", "Interview Questions": "How do you build rapport with the schools?"}, {"date": "7 Oct 2018", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Triton College (River Grove, IL) in Aug 2015", "Interview Descriptions": "Interviewed with the CIS Department Chair and Dean of the Technologies Program.  This was a face-to-face meeting in the Dean's office.  My resume was reviewed and questions were asked based in interest being hired for a current course vacancy for the fall semester.", "Interview Questions": "Experience and education in the field of Computer Science and Information Technology. What expert areas do you currently offer to Triton CIS for courses.  What technology or management certifications currently held that would allow additional course instruction."}, {"date": "29 Apr 2017", "title": "Director Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Triton College (River Grove, IL) in Feb 2013", "Interview Descriptions": "Very long process from first interview to last was 5 months. I started with a phone interview, many emails, then met the President and a Vice President. The phone interview was with an interview committee of 5-6 people. All Triton interviews are done with a committee.", "Interview Questions": "Tell about past experiences."}, {"date": "16 Jul 2015", "title": "Audio Visual Equipment Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Triton College in Aug 2011", "Interview Descriptions": "One of the easiest interviews I've ever had. My supervisor was extremely kind and friendly. Explained the job details, roles, and responsibilities. Asked about my schedule. This was a minimum wage job, so I don't think they were too strict with applicants.", "Interview Questions": "Do you want this job?"}]]