[[{"date": "26 May 2023", "title": "Donor Recruiter Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at LifeSouth Community Blood Centers (Gainesville, FL) in Oct 2022", "Interview Descriptions": "I reached out through their website via email and was able to promptly set up an interview the following week. The interview process was swift and professional and the interviewer was polite. I received a call the following week.", "Interview Questions": "Do you have any experience with market and/or customer service?"}, {"date": "5 Sept 2021", "title": "Licensed Blood Components Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at LifeSouth Community Blood Centers (Montgomery, AL)", "Interview Descriptions": "Two weeks after applying, I received a call for an interview. The interview was laid back and conversational. I felt free to ask any question during the interview and was given a tour around the work facility.", "Interview Questions": "What type of laboratory experience do you have?"}, {"date": "6 Apr 2021", "title": "Phlebotomist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at LifeSouth Community Blood Centers (Jacksonville, FL) in Apr 2021", "Interview Descriptions": "It was good better then other interviews I’ve been to with different companies. The interviews were very nice and straight forward. Basic question for an interview. Felt very comfortable and listened too.", "Interview Questions": "How would you navigate a difficult situation "}, {"date": "15 Apr 2021", "title": "Phlebotomy Technician Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at LifeSouth Community Blood Centers (Atlanta, GA) in Apr 2021", "Interview Descriptions": "Interview was held in a “junk” room and I sat at a table across the room from interviewers to practice social distancing. The interview process was lengthy for the types of questions asked and they kind of made the job seem like a basic job, not a job involving patient care. I felt like I was interviewing for a retail position at at a boutique. I was told I would get a call back but never did and I think that’s unprofessional.", "Interview Questions": "How did you handle a difficult situation at your last job?"}, {"date": "9 Feb 2021", "title": "Donor Support Technician Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at LifeSouth Community Blood Centers (Birmingham, AL) in Feb 2021", "Interview Descriptions": "Applied with indeed. Recieved a phone call to come in for an interview. That was on a Thursday. I was told I would be notified Monday if I got the position. Here it is Tuesday and no update.", "Interview Questions": "Basically verifying what is on your resume. "}, {"date": "7 Sept 2020", "title": "Donor Support Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at LifeSouth Community Blood Centers", "Interview Descriptions": "The process was easy. There were a Manager and supervisor.  Also it was a group interview.  Three candidates. And it lasted bout 30 mins. Easy questions. You will be contacted in about two weeks after interview.", "Interview Questions": "What are your strengths and weaknesses?"}, {"date": "5 Jul 2021", "title": "Call Center Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at LifeSouth Community Blood Centers (Gainesville, FL) in Aug 2020", "Interview Descriptions": "Did a lovely phone interview. They asked questions about my school experience and what my goals were for the future. There was a second portion to the interview usually, but I was offered a position after the phone interview.", "Interview Questions": "How would I respond to someone unhappy with the blood donation process?"}, {"date": "8 Feb 2021", "title": "Hospital Services Technician Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at LifeSouth Community Blood Centers (Jacksonville, FL) in Jun 2020", "Interview Descriptions": "unnecessarily extensive and drawn out . can take up to a month to hear anything back from the company on the status of your application. it can be frustrating waiting so long", "Interview Questions": "what is your preferred availability"}, {"date": "24 Aug 2019", "title": "Donor Service Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at LifeSouth Community Blood Centers (Mobile, AL) in Aug 2019", "Interview Descriptions": "It wasn’t a long interview prolly about 5 minutes at the most. The questions they answered were easy questions to give a great answer to. I got the job 2 minutes after my interview.", "Interview Questions": "Why do you wanna work for us?"}, {"date": "24 Jun 2019", "title": "Call Center Agent Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at LifeSouth Community Blood Centers", "Interview Descriptions": "I applied online, I came in three days later for an in person interview. It was a very smooth and quick process. The interviewers were very friendly and tried to make me feel as comfortable as possible.", "Interview Questions": "Describe a time you and a coworker had a disagreement? How did you resolve it? "}], [{"date": "9 Oct 2018", "title": "Quality Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at LifeSouth Community Blood Centers (Birmingham, AL) in Aug 2018", "Interview Descriptions": "Many stages in the hiring process.  First there was an on line test.  The online test was followed by an onsite interview.  The onsite interview was followed by a  phone interview with someone higher in the chain of command.", "Interview Questions": "Why do you want to work for Life South"}, {"date": "23 Oct 2018", "title": "MEDICAL Lab Technician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at LifeSouth Community Blood Centers (Madison, AL) in Apr 2018", "Interview Descriptions": "Basic get to know you type questions.  If I ever worked in a warehouse type of job?  How do I handle stress or problems at work.  How did I hear about this job and if I knew anyone at LifeSouth or had any family working at LifeSouth.  Where I studied at and what there program/classes were like.  They also wanted to know where I did my clinicals at.", "Interview Questions": "Do you like to work by yourself or with a group of people?"}, {"date": "18 Jan 2019", "title": "Donor Services Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at LifeSouth Community Blood Centers in Feb 2018", "Interview Descriptions": "It was an ok interview.  Management was more concerned about my personal life then my work history.  The good thing about the interview is I was able to take my drug test the same day.", "Interview Questions": "Could I balance my work and personal life?"}, {"date": "15 Sept 2017", "title": "Donor Recruiter Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "The process took 1 week. I interviewed at LifeSouth Community Blood Centers", "Interview Descriptions": "3 part interview. The initial in person interview consisted of a \"test\" with math and you have to write a letter to a client. The final part is a presentation for the 5 points for life program", "Interview Questions": "How do you stay organized?"}, {"date": "13 Sept 2021", "title": "Medical Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at LifeSouth Community Blood Centers (Gainesville, FL) in Aug 2017", "Interview Descriptions": "Apply through Lifesouth website. HR contacts you for a preliminary phone interview, and schedules an interview with managers. Hear back from managers within two weeks. Schedule on boarding with HR.", "Interview Questions": "Tell me about your qualifications for this job. "}, {"date": "8 Apr 2017", "title": "Hospital Service Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at LifeSouth Community Blood Centers (Atlanta, GA) in Feb 2017", "Interview Descriptions": "There was a preliminary quiz to assess previous knowledge of blood services and the requirements to maintain a safe inventory. After the quiz there was a 1:1 interview, although I was told there could be another applicant interviewing at the same time. The flow of the interview was relaxed and allowed me to confidently answer questions without pressure.", "Interview Questions": "Do you prefer to work alone or working a team structure?"}, {"date": "3 Apr 2021", "title": "Donor Recruiter Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at LifeSouth Community Blood Centers (Mobile, AL) in Feb 2017", "Interview Descriptions": "Easy conversational interview. Manager was on his way “out” and needed to fill position. I should have taken his question of “can you handle intense criticism?” as the red flag that it was.", "Interview Questions": "Can you handle pressure and criticism?"}, {"date": "31 Mar 2017", "title": "Phlebotomist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at LifeSouth Community Blood Centers (Atlanta, GA) in Sept 2016", "Interview Descriptions": "They have a few people take a test that the other employees grade you on then you and other potential employees are interviewed at the same time by 2-3 people. They ask generic questions then offer you a job in a week or so and you do a second interview with drug and smoke screening and then if you get the job you will start on their next orientation which is every few weeks", "Interview Questions": "Why do you want to work here? "}, {"date": "27 Jan 2016", "title": "Hospital Services Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 2 days. I interviewed at LifeSouth Community Blood Centers (Gainesville, FL)", "Interview Descriptions": "Was more of a conversation of general questions that any entry level job would ask you upon interview. I did a phone interview first then met with my supervisor and finished it with middle level management with a conditional offer.", "Interview Questions": "Tell me about a difficult situation and how you handled it?\r\nDoes blood make you nauseas?"}, {"date": "15 Jul 2015", "title": "Donor Services Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at LifeSouth Community Blood Centers", "Interview Descriptions": "Interviewed by about 3 people asking general customer service questions and how I felt about the blood donation process to save the community. It was basic questions like what would you do if a customer got upset or how would you respond to a donor incident etc. Not a hard interview at all. I had to talk to the regional manager and two team leaders during my interview.", "Interview Questions": "How would you handle a donor reaction"}], [{"date": "12 Jun 2015", "title": "Phone Representative Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at LifeSouth Community Blood Centers (Gainesville, FL)", "Interview Descriptions": "This was a typical interview.  It lasted about 40 minutes. There were two interviewers. Before the interview I was asked to take a short personality like survey online. They were very interested in previous sales experience.", "Interview Questions": "How will you translate your skills over the phone?"}, {"date": "27 Jan 2016", "title": "Donor Scheduling Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at LifeSouth Community Blood Centers (Gainesville, FL) in Apr 2015", "Interview Descriptions": "The interview process was very basic and she barely asked me any tough questions what so ever. Just make sure you dress Semi-Formal and have a great speaking voice and your good. Also it helps to know someone in the company already. Another thing, be sure to have at least one other reference like a previous manager or someone else.", "Interview Questions": "Name a time when you yourself had an important task with a group and how did you accomplish that task?"}, {"date": "1 Mar 2017", "title": "Team Leader Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 months. I interviewed at LifeSouth Community Blood Centers (Madison, AL) in Mar 2015", "Interview Descriptions": "They give scenerios and you explain how you would handle them. Normally you will do 2 to 3 interviews then a mouth swab. There was a two to three week waiting period between interviews and I was hired on my final interview", "Interview Questions": "What would you do!"}, {"date": "28 Mar 2019", "title": "Community Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at LifeSouth Community Blood Centers (Gainesville, FL) in Jan 2015", "Interview Descriptions": "Applied online, then completed a Personality Index assessment. Then was contacted by email to interview over the phone with a local manager. The questions were pretty simple and basic regarding my background and experience.", "Interview Questions": "What do you think you are able to contribute to this position? "}, {"date": "26 Aug 2015", "title": "Donor Services Tech Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at LifeSouth Community Blood Centers (Albertville, AL) in Sept 2014", "Interview Descriptions": "I was interviewed by the Manager at his office and asked a series of questions and then had to take a test. I was then called back and made an offer for the job", "Interview Questions": "One positive thing about you that would make you good at this job?"}, {"date": "20 Jan 2014", "title": "Phlebotomist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 6 months. I interviewed at LifeSouth Community Blood Centers (Gainesville, FL)", "Interview Descriptions": "I applied and did not receive a call back for about 6 months. I had actually assumed that I wasn't right for the position and had moved on in my job search. I got the call asking if I was till interested, set up an interview for two days later, and went through interview number one. In this interview we talked a bit about my work history and then I was given a basic test to measure math and comprehension skills. I was called back for my second interview three days later. I went in and was interviewed by a second manager. They were very friendly and laid back to speak with. I was offered the job about a week later.", "Interview Questions": "What makes you as an individual right for this career?"}, {"date": "24 Jun 2013", "title": "Donor Services Team Leader Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at LifeSouth Community Blood Centers", "Interview Descriptions": "The interview was a group interview with 4 people including myself. We first came into a group meeting room. Once we got in the room we had to take a basic math test with pen and paper. We had 45 mins to complete the assignment. There was a panel of 2 people to interview us. They asked basic questions which I'm not sure why they were interview questions.the process was very laid back and not as hard as I thought. They asked questions like tell me about yourself, what was your favorite subject in school and just random conversations. Never had an interview so laid back. We all talked for about 30mins and we where all let out. I got a call on Wednesday which was 4 days later that I had another interview. This second interview was with a higher end manager. This was a one on one interview. They asked supervisor questions like how would I handle being on the job and other people have been here longer than you how would you handle getting respect, what are my weakness and strengths.....after the interview she said she would call by Monday I interviewed on a Friday. She called Friday about 3 hours after the interview and asked could I come monday to do the drug test and other paperwork. You sign a lot of paper work and then to take the urine drug test can't put in your 2 week notice until after all results are in. They take a background check, credit check, urine test, driving record check. After you pass all you are officially hired ! Training is pretty easy but a lot of work then on the job you will go.", "Interview Questions": "Strong ness and weakness"}, {"date": "14 Jun 2015", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at LifeSouth Community Blood Centers (Huntsville, AL) in Oct 2011", "Interview Descriptions": "Casual. talked with one or two people and then met the staff. Took a long time to hear back from them. The online process was a nightmare. I should have known then what I was in for. Any company that doesn't take the time to have properly operating websites and hiring processes should give you a heads up about the conditions there.", "Interview Questions": "If I could handle multitasking"}, {"date": "15 Dec 2012", "title": "Resource Management Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 months. I interviewed at LifeSouth Community Blood Centers (Gainesville, GA) in Mar 2010", "Interview Descriptions": "Group interview followed by two face to face interviews all  after a basic math test. Lifesouth took two months to call back saying they were interested in hiring. Ongoing training requirements were very easy.", "Interview Questions": "What is your greatest weakness that could affect your job performance with Lifesouth?"}]]