[[{"date": "24 Mar 2023", "title": "Patient Access Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Emerus", "Interview Descriptions": "Very Easy going , just be yourself show your personality. They are looking for someone bubbly as you will be greeting patient’s when they first come in to the hospital", "Interview Questions": "Name a time you went above and beyond"}, {"date": "27 Mar 2023", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Emerus in Mar 2023", "Interview Descriptions": "Recruiters seemed knowledgeable and answered all questions accordingly. Also seem to work close with actual employers. Pay is very competetive. Benefits are average. Process starts with shadowing in facility and meeting staff.", "Interview Questions": "What is the reason you arw applying"}, {"date": "30 Nov 2022", "title": "Patient Registration Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 days. I interviewed at Emerus in Nov 2022", "Interview Descriptions": "A recruiter will call or text you if you are looking for a job. If you are. The recruiter will schedule the interview. When you come in for the interview. They will hand you a paper test of questions about insurance.", "Interview Questions": "What are you’re strongest and weakness from you’re last job?"}, {"date": "30 Dec 2021", "title": "SVP Operations Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Emerus (Seattle, WA) in Dec 2021", "Interview Descriptions": "The HR team was knowledgable and timely with communications.  They kept me updated, reached out with feedback.  They were clear about what they were looking for and the culture of the company.  I appreciated they were very clear about the culture and commitment to culture.", "Interview Questions": "What am I looking for in my next opportunity? "}, {"date": "9 Aug 2021", "title": "Accountant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Emerus", "Interview Descriptions": "Interview with the manager and the team member. They introduce the company, job description, and etc; then go over some basic and standard interview questions. Overall, pretty standard and smooth interview.", "Interview Questions": "What's your expectation at the company?"}, {"date": "13 Aug 2021", "title": "Recruiter Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 4 weeks. I interviewed at Emerus in Jan 2021", "Interview Descriptions": "5 Interviews was very lengthy, I was promised weekly pay and lied too Management Leadership and Training was non existent.  I would highly disapprove working with this company. please do not apply here if your looking for diversity", "Interview Questions": "Why do I want to work for Emerus?"}, {"date": "19 Feb 2021", "title": "Emergency Room Technician Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. I interviewed at Emerus (Las Vegas, NV) in Aug 2020", "Interview Descriptions": "I signed up for a hiring event interview but, could not get a call back from just applying. It was a phone interview but, very informal. Hiring manager made it up to be a really great opportunity.", "Interview Questions": "What is one instance where you had to deal with a difficult coworker?"}, {"date": "8 Sept 2019", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Emerus (El Paso, TX) in Sept 2019", "Interview Descriptions": "The interviewer makes me feel comfortable.  The questions are like normal conversations. Personal life experiences and nursing background are the topics discussed. They accommodate your time availability. Only negative is they are late for 40 mins from the scheduled time they set. Over all, it was an awesome experience. I got the offer right away", "Interview Questions": "Great traits I have as a nurse"}, {"date": "8 Sept 2019", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Emerus (Houston, TX) in Jul 2019", "Interview Descriptions": "Phone interviews with HR and Manager.  Then in person rounds of interviews.  There was information I was told during the HR screening that was not true when I was made my offer.  I asked them to address this and just received a rude answer and they never addressed why.  I don't know if any of this was passed onto the hiring manager.  HR also missed multiple steps along the way and I almost didn't even get to interview because of this.  If HR is the face of your company and negotiation process it helps if they come across professionally and it was not the case for this position.  \r\n\r\nI was also to be reimbursed some expenses and still have not been.  So a blessing I did not accept the offer.", "Interview Questions": "What would you do if.......?"}, {"date": "12 Nov 2018", "title": "Desktop Administrator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Emerus (Oklahoma City, OK) in Nov 2018", "Interview Descriptions": "Contacted via email to schedule a phone interview. Asked to fill out an application after they already had my resume. Interview ended abruptly when recruiter stated that I was highly compensated for my years of experience without even getting to know the work I did. Stated they could not match my current salary and ended our phone conversation without even discussing with me first if I was still interested despite the pay decrease. This was certainly the strangest and rudest interview process I have ever experienced. \r\n\r\nNext time, please be aware that people have different reasons outside of money for being interested in a role. Get to know the candidate before making incorrect assumptions and in the process making your company look bad.", "Interview Questions": "None - interview ended before the recruiter even asked questions because they decided I was too highly compensated at my current role to be interested in this position. "}], [{"date": "1 Mar 2018", "title": "Patient Access Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Emerus", "Interview Descriptions": "The manager briefly spoke with me in an office. It felt like a meeting with a new friend over coffee. Lots of focusing on character traits that were irrelevant to the job performance.", "Interview Questions": "What are your strengths and weaknesses?\r\nDescribe a time when your ability to multi-task was detrimental to your job.\r\nDescribe a time when you did not get along with a co-worker"}, {"date": "27 Apr 2018", "title": "Security Officer Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Emerus (San Antonio, TX) in Feb 2018", "Interview Descriptions": "Asked about qualifications, and why I would be a good fit for the position. The managers advised that they do not discuss pay and benefits because that is human resources department to discuss with you, if you were offered the position.", "Interview Questions": "Why are you a good fit for this position?"}, {"date": "20 Jul 2017", "title": "ED RN Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Emerus (Keller, TX)", "Interview Descriptions": "Pretty casual. Had to answer a few questions about dealing with conflict. Was asked to look at EKG strips and name the rhythm. They asked what hours and days I preferred, although that was irrelevant after I was hired. They don't let you have anything to do with your schedule. They hire anyone with a pulse.", "Interview Questions": "How to manage conflict....same questions as anywhere else. Asked what shift I wanted. "}, {"date": "9 Apr 2017", "title": "Patient Access Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Emerus (Las Vegas, NV) in Jan 2017", "Interview Descriptions": "From the online application, to the phone interview, face to face interview, to the job offer, in 2 months, was amazing. Every person I encountered either via phone, email and in person, were very engaging and personable.", "Interview Questions": "Would you prefer days or nights?"}, {"date": "18 Jul 2017", "title": "Emergency Department RN Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Emerus (Las Vegas, NV) in Oct 2016", "Interview Descriptions": "Panel of 5 Senior Nursing Leaders - The leaders sat in a semi-circle around me.  Each was handed a copy of my resume as they appeared to not have one already.  I had the sensation that a mass group text was sent and the company just randomly grabbed people to interview me.  It felt very uncoordinated.  The panel read from a scripted list of interview questions.", "Interview Questions": "What is your 5 year goal. \r\n\r\n\r\n"}, {"date": "22 Apr 2015", "title": "Physician Billing Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Emerus (The Woodlands, TX) in Mar 2015", "Interview Descriptions": "Direct interview and hire.  Discussed work roll experiences.  No, tell me about a time when...which most people have a made up answer for, rather than a real experience.", "Interview Questions": "Am I self reliant..no micro managing. To much to do, to have to stand over employees and demand they earn their pay."}, {"date": "23 Dec 2015", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 1 week. I interviewed at Emerus (Dallas, TX) in Jan 2015", "Interview Descriptions": "I received a phone call from an HR recruiter. She asked me some screening questions. She then scheduled a face-to-face interview with the facility administrator. The interview took about 30 minutes total and the typical interview questions were asked. Then came the offer, which was later the same day. I had to wait several days for a background check clearance, as well as an extensive Personal Reference Check.", "Interview Questions": "Why did you leave your last job?"}, {"date": "30 Oct 2014", "title": "Front Office Coordinator Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Emerus (San Antonio, TX)", "Interview Descriptions": "HR communicated constantly throughout hiring process . Was given  a lot of information , able to ask questions. Very welcoming and friendly. Was explained all about what the job would entail. Interviewers were very enthusiastic about Emerus so it really made me want to be a part of the company .", "Interview Questions": "Would I be willing to work night shift , weekends and holidays?"}, {"date": "19 May 2015", "title": "Biller Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Emerus (The Woodlands, TX) in Mar 2014", "Interview Descriptions": "Asked questions on previous employment and capabilities for this position.  It's been awhile since the interview, but I remember everyone being courteous, proffesional and energetic.  It was very casual and run of the mill interview.", "Interview Questions": "N/A"}, {"date": "10 May 2018", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Emerus in Jan 2014", "Interview Descriptions": "easy to  apply, good communication, was able to turn in my documents without issue, was kept in contact with recruiter, able to set up quick interview with the hiring manager", "Interview Questions": "experience "}], [{"date": "1 Nov 2014", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Emerus (San Antonio, TX) in Mar 2013", "Interview Descriptions": "The Recruiter was very efficient and kept up good communication through out the process. The intereview at the facility went smoothly and like any other, but the lag time between that step and the actual hiring even after I had been sent an offer and signed an acceptance was a little long. The super growth of the company caused some growing pains in their processes.", "Interview Questions": "The hospital manager repeatedly wanted to know if I felt comfortable working with such a skeleton crew and how I felt about resolving conflicts with fellow employees over and over. It is something to really consider before taking the position and not just saying \"Yes\" because you need or want a job."}, {"date": "20 May 2015", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. I interviewed at Emerus in Dec 2012", "Interview Descriptions": "Currently we are having Staff and Hospital administrator interview. When our facilty opened, we got interviewed by the Regional CNO and Human resources administartor. It was a great comprehensive interview trying to find the right people to start the great culture of Emerus.", "Interview Questions": "How you handle conflict with coworkers"}, {"date": "1 May 2014", "title": "Senior Recruiter Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Emerus (The Woodlands, TX) in Apr 2012", "Interview Descriptions": "I was called to schedule an in-person interview with the Talent Manager.  From there, I came in for a 2nd interview with the Director of HR and the COO.  Everyone was friendly and made me feel comfortable.  It was a lengthy process, but every time I checked in or sent an e-mail, I got a quick response with an update.", "Interview Questions": "No part of the interview was difficult.  It was more like getting to know one another, a conversation."}, {"date": "3 Nov 2014", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Emerus in Mar 2012", "Interview Descriptions": "inital communication was very quick. I applied one day and was called by the recruiter the next day. My interview was set up quickly. The interview was ontime and was typical of interviews. had a tour of the facility and met the employees on duty. It was a no surprises interview. The manager was friendly and answered all my questions without hesitation. I was contacted by the recruiter quickly afer my interview and the hiring process was not cumbersome of difficult", "Interview Questions": "what is the thing you like least about your chosen profession?"}, {"date": "19 Oct 2012", "title": "Front Desk Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Emerus (Tomball, TX) in Jul 2010", "Interview Descriptions": "The hiring and interview process was overall smooth and convienant. The only real concern I had, was that I was under impression I was interviewing for full time position. As it turned out, when I went to HR to sign paperwork, I was informed it would be for a part time position. I eventually went full time, but it was almost a year and half later.", "Interview Questions": "N/A"}]]