[[{"date": "31 Mar 2021", "title": "Receptionist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at AdventHealth Medical Group Central FL", "Interview Descriptions": "Quick and straight forward. Phone call initially and then an in person interview. I believe they do a virtual interview now instead of in person. Overall great process and happy with the company.", "Interview Questions": "Why Advent health medical group?"}, {"date": "2 Aug 2021", "title": "Therapist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at AdventHealth Medical Group Central FL in Apr 2021", "Interview Descriptions": "An HR recruiter called me with a bunch of generic behavioral questions. There was no real conversation, no feedback, and no opportunity to ask questions. After the interview, I was ghosted.", "Interview Questions": "Where do you see yourself in five years?\n"}, {"date": "6 Nov 2019", "title": "Billing Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at AdventHealth Medical Group Central FL (Ormond Beach, FL)", "Interview Descriptions": "Hiring process is thorough, they explain a lot in great detail. Interview was pretty easy and the manager did a great job at explaining what is expected of me. I was asked about my experience and what billing programs I am familiar with. ............", "Interview Questions": "What billing programs are you familiar with? "}, {"date": "8 Jun 2019", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at AdventHealth Medical Group Central FL (Orlando, FL) in Jun 2019", "Interview Descriptions": "From the first phone call with Sebi Colon the interview was amazing. I felt like I was a part of the team. During the interview i was able to meet the doctor and another medical assistant that I would be teamed with. The questions were fair.", "Interview Questions": "Why did I want to work for AdventHealth "}, {"date": "25 Apr 2019", "title": "Financial Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at AdventHealth Medical Group Central FL (Altamonte Springs, FL) in Apr 2019", "Interview Descriptions": "Applied directly on the website on a post from 2 months ago, and received a call from management for an interview within days of applying. I did not need my resume copy when I arrived to the interview because they had a printed copy, and the manager who interviewed me was very nice and pleasant.", "Interview Questions": "Describe a time when you had a difficult task and how did you handle it?"}, {"date": "16 Mar 2019", "title": "Office Supervisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at AdventHealth Medical Group Central FL", "Interview Descriptions": "The interview was very thorough. The representative was very knowledgeable and explained the position/company very well. I wasn't rushed to answer any questions and at the very beginning I got a tour of the facility which was very nice and welcoming.", "Interview Questions": "Name a difficult situation where you made a mistake and how did you fix the mistake?"}, {"date": "22 Mar 2019", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at AdventHealth Medical Group Central FL (Orlando, FL) in Mar 2019", "Interview Descriptions": "The moment i stepped into the office i noticed the professionalism. During the interview process i did not feel rushed. The manager gave me ample time to speak about my work experience, goals and explained very well how the company works.", "Interview Questions": "How many years of medical assistant experience i had. "}, {"date": "11 Apr 2019", "title": "Full Time Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at AdventHealth Medical Group Central FL (Orlando, FL) in Mar 2019", "Interview Descriptions": "It went amazing. Lindsey Lyon took the time to get to know me and ask me a lot of questions to see if I was fit for the position.  She gave me the opportunity to ask her questions if I had any. She took the time to walk me around the building and show me around.", "Interview Questions": "I was asked where do I see myself in five years. "}], [{"date": "20 Mar 2019", "title": "Finance Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at AdventHealth Medical Group Central FL (Maitland, FL) in Feb 2019", "Interview Descriptions": "The interview process was very professional and aligned with standard procedures from most other industries I've interviewed. I interviewed with a panel of 3 people which took roughly an hour. The interview consisted of basic questions about my experience and background. The final portion of the interview involved situational/behavioral questions ranging form ethics, customer service, dealing with stress, etc.", "Interview Questions": "Explain a situation where you had to talk down an irate person. How did you manage it and what was the outcome?"}, {"date": "18 Dec 2018", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at AdventHealth Medical Group Central FL (Orlando, FL) in Dec 2018", "Interview Descriptions": "Interview process was very quick and easy. The office manager that interviewed me, was very knowledgeable of the office day to day activities and explained very detailed the position I was applying for.", "Interview Questions": "They have a FHMG questionnaire that go by"}, {"date": "11 Jan 2019", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at AdventHealth Medical Group Central FL (Tavares, FL) in Dec 2018", "Interview Descriptions": "Once I had applied online, I was called on the phone and myself and the manager spoke.  She told me if all goes well, I will meet with her, and I ended up meeting with the Manager. She was great!  We talked more about the line of work and gave me an ethics \"test\" to see whether or not I was going to be hirable.  Well I guess it worked, because they made me an offer and I accepted.  I cannot wait to start!", "Interview Questions": "What did I like most about doing the work as a Medical Assistant"}, {"date": "15 Dec 2018", "title": "Float Receptionist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at AdventHealth Medical Group Central FL (Maitland, FL) in Dec 2018", "Interview Descriptions": "The interviewer contacted me by cell, and inquired if I wanted the position since I was selected. I responded \"yes\" and then she proceeded to tell me she would email me the steps I needed to take to insure myself as a new employee of their staff.", "Interview Questions": "What,if anything did I do wrong on my previous job and how did I handle it?"}, {"date": "28 Dec 2018", "title": "Practice Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at AdventHealth Medical Group Central FL (Orlando, FL) in Dec 2018", "Interview Descriptions": "Was called a few days after application for a next-day interview. Met with two leaders in my specialty and the interview lasted about 45 minutes. They do have a pre-selected packet of questions, which they run through with you. They were very open in their responses to my questions and were very up front about what they were looking for in a candidate and their timeline.", "Interview Questions": "They asked about my strengths, weaknesses, and why I would be an asset to their organization. They also wanted to know why I was leaving my current position."}, {"date": "20 Dec 2018", "title": "Medical Receptionist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at AdventHealth Medical Group Central FL (Orlando, FL) in Dec 2018", "Interview Descriptions": "The process itself was simple and efficient. I applied online and heard back within a couple weeks. It felt like I was interviewing with family which is rare, the office seemed welcoming and the management team seemed opened!", "Interview Questions": "Describe a time where a guest made your work difficult and how did you handle it?"}, {"date": "24 Nov 2018", "title": "CMA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at AdventHealth Medical Group Central FL (Orlando, FL) in Nov 2018", "Interview Descriptions": "The interview was very thorough, lasted about an hour. First the manager went into explaining about the company beliefs, policies, procedures, benefits. Then I was asked questions specific to my experience in medical field. Also had a brief meeting with one of the doctors.", "Interview Questions": "What made me choose working in the medical field "}, {"date": "15 Oct 2018", "title": "Floating Receptionist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at AdventHealth Medical Group Central FL (Maitland, FL) in Oct 2018", "Interview Descriptions": "The women that I spoke with was really kind and easy to talk to. I couldn't find the building at first and she was very patient with me as i found the building", "Interview Questions": "When was there a time that I forgot to do something and what was the outcome?"}, {"date": "10 Oct 2018", "title": "Training Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at AdventHealth Medical Group Central FL (Maitland, FL) in Oct 2018", "Interview Descriptions": "Contacted by Director for face to face interview. Then a panel interview with presentation was scheduled with the team where I gave a technical presentation. Once completed I then answered panel questions from the team. I also had the opportunity to ask questions of the team.", "Interview Questions": "If I were a car part, what part would I be? "}, {"date": "23 Oct 2018", "title": "Float Receptionist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at AdventHealth Medical Group Central FL (Maitland, FL) in Oct 2018", "Interview Descriptions": "One on one interview. They made you feel not nervous at all. Very open and easy going. Was able to ask many questions and the responses were everything I needed to know. They stated either way they would reach out to keep you informed on the status.", "Interview Questions": "They asked why I was leaving my current position"}], [{"date": "23 Mar 2017", "title": "Customer Experience Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at AdventHealth Medical Group Central FL", "Interview Descriptions": "I had a phone interview as soon as I answered the phone. I didn't even know what number it was. Then I met with James in person at one of the hospitals. He asked me about my goals and where I saw myself within the company. The last interview process was before a panel of 6 people and I have to do a Powerpoint presentation. They had already given me an idea of what to present on but it was completely up to me. I had to stay within a specific time-frame and finish my presentation completely.", "Interview Questions": "What attracted you to this job?"}, {"date": "2 May 2016", "title": "Medical Receptionist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at AdventHealth Medical Group Central FL (Orlando, FL) in Sept 2015", "Interview Descriptions": "Received a call for a phone interview about 2 months after applying. Had an in person interview asking about my qualifications. After that, I received a call about three days later with an offer for employment.", "Interview Questions": "Tell us about a time you had to work as a team. What was the outcome?"}, {"date": "24 Apr 2014", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1+ week. I interviewed at AdventHealth Medical Group Central FL in Feb 2012", "Interview Descriptions": "I received a call from HR and was asked if I would be interested in interviewing. I came in and interviewed with the director for the position, and 2 admin assistants. I was professional, wore a suit, and had my hair up. I kept my answers short and to the point. The director was friendly, and we got along. The 2 admin assistants were not so much. They came across as if they were the leadership hiring. It was quite uncomfortable. They asked me about my background and experience. The director was more about personality and fit, since this was for their admin assistant and she felt that the job could be handled, but working so closely with someone personality was the key.", "Interview Questions": "How clean is my car?"}]]