[[{"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Talented teammates!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "26 Feb 2019", "job_title": "Anonymous Employee in London, England", "duration": "N/A", "pros": "I've been working at The Health Sciences Academy for several years now and looking back I'm proud of how much I evolved and learned both personally and professionally. Time flies when you're doing something you enjoy, surrounded by kind-hearted colleagues. People who care about you. People with high integrity and high standards too. \r\n\r\nEveryone in our team is driven, have unique talents, a lot of energy and they challenge and inspire me to be the best I can be, day in and day out. \r\n\r\nHaving worked in large companies before, none of them cared as much for me and my colleagues as our managing director at The Health Sciences Academy. In here, you are a human being with aspirations and not just a number. You're not dreadfully clocking a 9-5 and just giving your livelihood away. The opposite. Everything I do and we do has meaning and impact and is designed to change people's lives for the better. And when I work late, it's my decision because in our team we like to get things done. \r\n\r\nAnother bonus is that I learn something new every day and I'm never bored.\r\n\r\nThere are many other things I love about our work at The Health Sciences Academy that I'm not sure this review will do it justice...\r\n\r\n- lots of freedom and flexibility \r\n- the projects I'm involved in challenge me to keep updating my skills \r\n- the joy of doing things that I'm naturally good at\r\n- there's never a shortage or work and new exciting projects to tackle\r\n- high tech tools to do my best work\r\n- emphasis on standards of excellent -- extremely high standards and I like that!\r\n- honest yet clever colleagues, with good values and their head on their shoulders\r\n- the chance to impact the company's plans and future so we can serve our learners, users and partners more powerfully, which can be very fulfilling\r\n- and the list goes on and on... and on\r\n\r\nI feel fortunately that I have found the right pace for me. The people I'm surrounded with have allowed me to be myself. Rather than putting on a mask and pretending to be someone you are not. And that is priceless. \r\n\r\nThank you team and thank you The Health Sciences Academy for being my extended family.", "cons": "We have our own meetings and internal channels for regularly addressing areas of growth and improvement, and our managing director always listens. Without obstacles there would be no growth and things would be so boring otherwise. When looking at our team, I can see that each of us thrives to get better every day, individually and collectively."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "A company that will teach you how to be the best that you can be", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "20 Feb 2019", "job_title": "Anonymous Employee in London, England", "duration": "N/A", "pros": "The Health Sciences Academy value and care for the people that work for them.  They give importance to what area of the job you're strongest and they will do their best to assign you tasks that will enhance that part of you.  The management is very hands-on and is open about helping anyone out on any roadblock they might have been experiencing. \r\n\r\nMost of all, they treat you like family.  They don't look at you as just some 9 to 5 guy. I feel that they look at you as someone with a family to support, with a career to flourish and with a life to live and they will treat you as such.", "cons": "Everyone can use a team building from time to time. Seeing the people they work with virtually in person and just having  a good time with them sounds like a great idea for me and I think this is something that we haven't done yet.  I wouldn't really call this a con for everybody in the team but I personally admire the people I work with and would absolutely grab the chance to meet them."}]]