[[{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 4, "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "Great place to work- very rewarding experience", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "18 Jul 2021", "job_title": "Nurse Manager in Bolton, ON", "duration": "N/A", "pros": "I had a great experience working at Marie Stopes. A passionate team all dedicated to a strong mission. Great culture and I learned a lot in my time there. I had a good relationship not only with my local team but from the corporate support office. Always felt I was heard and that I was valued. There were a lot of positive changes in the organization during my time there and it was great to see a genuine dedication to making things better.", "cons": "Could be challenging at times but always felt very accomplished at the end of each day."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 3, "Diversity and Inclusion": 3, "Career Opportunities": 3, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "Good people who are underserved", "rating": "2.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "19 May 2023", "job_title": "Customer Service Representative in Brisbane", "duration": "N/A", "pros": "I loved the people I worked with a lot", "cons": "Over worked and underpaid staff, who are not treated with respect by HR. Anti-union sentiment in some management. Lots of external hiring for positions which would benefit from someone with internal experiences"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 4, "Culture & Values": 0, "Diversity and Inclusion": 4, "Career Opportunities": 3, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "Just ok", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "16 May 2023", "job_title": "Registered Nurse in Melbourne", "duration": "N/A", "pros": "The important work being done for women.", "cons": "Management very money orientated which was disappointing for a not for profit."}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "N/A", "Work/Life Balance": 1, "Culture & Values": 0, "Diversity and Inclusion": 4, "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "Unpleasant", "rating": "2.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "24 Aug 2022", "job_title": "Associate Nurse Unit Manager in St Kilda East", "duration": "N/A", "pros": "Feeling like you’ve helped women. I made a good friend out of a work colleague. Salary packaging option.", "cons": "Worked with quite a few nurses with extremely poor clinical knowledge. Toxic environment & terrible management."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Wouldn't recommend to a friend", "rating": "2.0", "reviewer_affiliation": "Former Employee", "job_date": "27 Dec 2021", "job_title": "Anonymous Employee in Newcastle", "duration": "N/A", "pros": "Getting to work with caring and passionate people", "cons": "Bad wages, business model runs off exploiting people, began hiring people who couldnt care less about the job"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Terrible. Toxic culture. Poor leadership", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "3 Feb 2022", "job_title": "Head Office in Melbourne", "duration": "N/A", "pros": "Some good people with good skills", "cons": "Poor leadership. No direction. Toxic culture. Lots of backstabbing."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 0, "Diversity and Inclusion": 1, "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Bad management", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "27 Sept 2021", "job_title": "Senior Advisor in Melbourne", "duration": "N/A", "pros": "Ok if you’re passionate about sexual and reproductive health and women, and aren’t concerned about working there long term.", "cons": "Inexperienced managers. Poor work culture. Nepotism and favouritism is rife. No salary transparency."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Organisation does not take care of their staff", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "13 Jul 2021", "job_title": "Customer Service in Melbourne", "duration": "N/A", "pros": "Colleagues are the best and have made great friends", "cons": "Management treats workers on the phone poorly. Outsourced labour to contractors and made us work harder during a pandemic. Did not listen to our issues. Yelled at us to get on calls. Toxic call centre culture. Then when we tried to ask for better conditions they outsourced our labour. Made us feel worthless."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Needs a complete overhaul", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "5 May 2021", "job_title": "Anonymous Employee in Brisbane", "duration": "N/A", "pros": "It’s a job that pays money even if poorly paid", "cons": "Poorly paid unsupportive workplace. Not particularly interested in sexual health but focussed on abortions which is where the money is."}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": 4, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Fast-paced, stimulating and supportive environment", "rating": "5.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "20 Jan 2021", "job_title": "Anonymous Employee in Melbourne", "duration": "N/A", "pros": "A stimulating environment advocating for critically important issues; a very worthwhile pursuit. Supportive team environment.", "cons": "For some, the fast pace may be a con, but it may be stimulating for others."}], [{"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 5, "review_title": "Great work with a great team in Australia", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "31 Dec 2018", "job_title": "Staff Member in Melbourne", "duration": "N/A", "pros": "Great place to work if you’re looking for a challenge and a socially aware environment. The team and people make it great and differences are celebrated by very supportive managers. Lots of hard decisions to make and constantly changing environment so not for the faint hearted but you know you are making a difference. Executive is very approachable despite being clearly under a lot of stress. Vision and values are clear and there’s lots of organisational learning going on. Lots of opportunity.", "cons": "Few resources because of the area and non profit work so it can get stressful. Pay could be better so it’s hard to stay on and staff tend to move on or they are sometimes up and down. There’s lots to do and very limited resources so sometimes it can get very intense. You need to be focussed."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 1, "Senior Management": 0, "review_title": "Rainbow Capitalism Industrial Complex", "rating": "2.0", "reviewer_affiliation": "Former Employee", "job_date": "12 Jun 2020", "job_title": "Anonymous Employee in Melbourne", "duration": "N/A", "pros": "+ The National Support Centre (Client Service Advisor / CSA) team is incredibly well curated - it is truly inspiring and encouraging to work with such a large number of like minded individuals who are passionate about the sexual/reproductive health sector, and other sociopolitical values by proxy. However, the staff turnover is notably high within this team due to insufficient pay for the workload which offers little incentive to stay, or affects one's sustainable ability to stay, despite the (of course) rewarding experience of directly assisting and advocating for people who are accessing these services. The CSA role is hard work and the remuneration does not reflect this. Big burn-out energy. \r\n\r\n+ The office environment is fairly trans/gender diverse friendly; management go to a fair amount of effort to normalise the use of correct pronouns which is refreshing in a professional context. However, there is so much work to be done in terms of ensuring the services themselves are trans/gender diverse conscious. Specific individuals work tirelessly to educate others within the organisation and encourage others to use more inclusive language on our website, social media and when engaging with patients directly, but it hasn't caught on. This organisation has great potential to be more inclusive (for example, introducing streamlined care for LGBTQIA+ people and affiliated services), but The Executive team who have the ability to make changes are lagging in this regard. Add some resources on our website, change the language and acknowledge their existence and relevance within this sector. It's not that hard, and there have been enough conversations and suggestions made internally. I suggest you develop positions/a specific team of LGBTQIA+ identifying people to help implement these changes. As the largest abortion provider/sexual/reproductive health organisation in the country your hesitance to step away from women-centric rhetoric is sad, frustrating and outdated. Learn from Family Planning and 1800 My Options. \r\n\r\n+ The Financial Support team have worked so hard to develop various financial support pathways to assist people who are not able to comfortably afford services. I am so proud of and impressed by the amount of effort that specific individuals have put into creating these pathways and the acknowledgement that if a patient can't pay we must prioritise their right to access services regardless.", "cons": "+ Despite fronting as a NFP, this organisation is revenue driven and benefits monetarily as a private clinic, resulting in a questionable industrial complex (though it is understood that profits made contribute to the company's philanthropy sector MSI). CSAs are managed via KPIs (which are unfairly determined as they calculate how many total calls result in bookings, including enquiry and non-booking related calls) which is ethically questionable within this sector - ESPECIALLY considering Marie Stopes have put forward a White Paper on reproductive coercion. CSAs are tirelessly encouraged to ensure a patient finalises a booking when they first make contact - emphasising value for revenue over providing patients with unbiased options and information. Endless suggestions from CSAs have been made to remove KPIs, but concerns are always dismissed, and we are advised they are essential in tracking the organisation's progress. \r\n\r\n+ CSAs complete compulsory training at the beginning of employment to learn a large network of processes and responsibilities akin to the role. This huge breadth of information and knowledge is fantastic to learn, and processes are often changing and updating, but there are limited ongoing learning opportunities from there other than extra operational duties. While the role itself is a great learning experience, it would be great if the organisation included opportunities for external learning, such as suicide prevention training and trauma-informed care (which seems quintessential for us as frontline workers but has never been explored), or other sexual/reproductive health courses. There are many passionate people who are drawn to the role due to the nature of the sector, but the position itself doesn't lend much room for expansion, specialisation or qualification. The role is better suited to people who like working pragmatically within a strict structure, as closely adhering to their processes is a must. If you are particularly passionate about and engaged with intersectional, inclusive sexual/reproductive health rights, this role acts as a double edged sword - on the one hand you have a great opportunity to engage with patients, however seeing where improvements can be made and wanting to advocate for progressive changes will not work in your favour... Management will push you out. They want employees who can stick to the basics of the role, maintain targets and keep the revenue rolling in.\r\n\r\n+ There is a lot of emphasis placed on CSAs to maintain their mental health and work/life balance (particularly as they are responsible for first contact patient intake). This expectation is unrealistic due to limited internal resources, disproportionate pay to workload and KPI management tactics. The team itself are extremely emotionally supportive, but the organisation should go to MUCH more effort to offer more varied mental health support pathways to take the pressure off interpersonal relationships. Many CSAs have noted the EAP provider to be insufficient, and many find monthly one on one catch ups with management to be unhelpful and counterproductive as they are framed too heavily around \"performance\" analysis - contributing to toxic corporate call centre culture."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Marie Stopes Australia provides fantastic opportunities to deliver strong social outcomes.", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "14 Feb 2020", "job_title": "Financial Controller in Melbourne", "duration": "N/A", "pros": "There is a clear visionary strategic plan with the initiatives actively supported and demonstrated  by the Executive Team. We have a Managing Director who cares about people and takes them on the journey. As an employee I am treated well and this goes a long way.", "cons": "The challenge faced is the external stigma around abortion. Marie Stopes Australia continues to influence and advocate for choice and control of sexual and reproductive health."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "MSA - an incredibly worthy organisation. Truly, one of the best I've worked for in my career!", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "28 Apr 2020", "job_title": "Strategic Talent Manager in Melbourne", "duration": "N/A", "pros": "- My manager is one of those rare, true leaders that trusts me to do my job and allows me to get on with it. She also empowers me to take more on and respects and asks for my opinion.\r\n- Our MD has vision and he values feedback but also genuinely want to improve wherever possible and he always listens to reason. He is also incredibly accessible which for someone at his level, is not something I have ever had in any other organisation I have worked for. Overall, he runs a smooth ship and gives me confidence that we're doing well as an organisation.\r\n- During the COVID-19 outbreak, our executive team have done a stellar job of maintaining communication, keeping employees calm whilst still maintaining essential services. No one has lost their job yet within the organisation and everyone is committed to making sure it stays that way. A lot of other organisations haven't handled this situation nearly as well as ours and that's quite impressive! It also encourages respect for our leadership team.\r\n- The employees within the organisation have this unspoken bond that unite us all and it comes down to people genuinely believing in what we do. It's powerful and it's inspirational! It's really quite something to be a part of.", "cons": "- As with every organisation, there are always going to be a few bad apples. We just need to manage that a bit more and a bit better but this is something that the HRD is all over and continuously working on.\r\n- There are some significant communication gaps between the operational and the support office and overall in fact between teams etc. It's a known issue and is improving slowly, we just need to ensure that we continue to improve on this one.\r\n- Our nurses need to be paid more. Again, this is a known issue and is being worked on, but we need to make sure we don't get complacent and let good people leave before we really take action.\r\n- Some meetings that take place really aren't necessary and are a drain, especially on the executive team."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Marie Stopes Australia - Problematic Culture", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "3 Jan 2019", "job_title": "Anonymous Employee in Melbourne", "duration": "N/A", "pros": "- The people you work with at this organisation are incredible. Super passionate, incredibly competent and generous with their time. \r\n- The head office is a great, central location\r\n- Working here gives you an opportunity to work towards better social equality for a cause that's really important\r\n- COO is friendly, supportive and trying his best under what are obviously difficult circumstances", "cons": "- There has been a 50% turnover in head office staff within the past 12 months. At no point has management felt the need to address what is obviously causing this; a toxic working environment\r\n\r\n- The favouritism and nepotism are quite blatant. Personal friends of the CEO, Michelle Thompson, are hired for roles, while her staff favourites seem immune from any performance management for unprofessional conduct.  This can be seen from the high turnover of newer staff, but the longevity of preferred employees. \r\n\r\n- The organisation consistently hires incredibly competent and capable staff. The organisation's mission attracts people who are passionate. However these employees are micromanaged to the point where they have no real authority in their role. This also leads many staff to feel that their expertise, suggestions and work are not respected.\r\n\r\n- Concerns raised about serious mental health issues and staff burnout (which is not unexpected in what is obviously a very high stress industry) are routinely ignored. Often these concerns are dismissed as not existing at all. Management refuses to participate in any form of employee engagement surveying or other similar efforts that could determine staff satisfaction and wellbeing. \r\n\r\n- Michelle Thompson seems to have no ability to emotionally regulate and so staff are at the mercy of her constantly changing temperament. She regularly targets teams or individuals and conducts impromptu sessions of berating them in the middle of the open plan office. This does not improve staff morale. \r\n\r\n- COO receives no support from Michelle Thompson and often appears pressured into accomodating her demands. COO spends extensive hours in the office, while Michelle appears to arrive and depart at leisure, routinely disappearing for hours on end with no transparency as to any projects she is working. \r\n\r\n- Staff are rarely given updates as to what upper management are working on, which makes it difficult for them to be engaged in the journey or invested in the organisation's success. \r\n\r\n- Upper management often set unrealistic goals and targets, and then fail to provide the resources necessary to meet them. The overall attitude from Michelle Thompson is then that staff are not working hard enough to meet targets. These targets net Michelle a personal financial windfall, but staff receive no such benefits and often receive no acknowledgement for the long hours and high stress they invest in trying to meet these targets. \r\n\r\n- The organisation is NFP, so resources are limited, however the majority of staff are highly overworked and under-resourced for the roles they are given. It's not at all unusual for a staff member to leave and for their colleague to then be expected to work both roles without additional remuneration. Despite the lower staff salaries, no alternative incentives are offered, such as flexible working arrangements, additional annual leave, etc. \r\n\r\n- Upper management seems to be unaware that any of this is an issue, and regularly comment on the inability to retain quality staff. If they are aware of it, they refuse to acknowledge any of the above issues, and instead become hostile towards staff who express any dissatisfaction with the way the organisation is run."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Something special is going on there", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "30 Jun 2020", "job_title": "Nursing Unit Manager in Melbourne", "duration": "N/A", "pros": "Enthusiastic and hands on leader who is values driven and is focused on the right staff for the right stuff.\nOpportunities to have your voice heard and ideas to be actioned\nRipe to innovate", "cons": "Nursing pay rates not on par with public and private EBA but congruent with fair work Australia Nurses Award"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Nurse", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "10 Sept 2017", "job_title": "Nurse in Sydney", "duration": "N/A", "pros": "Good cause. Not for profit with global programs. Much needed service. Great team to work with. Satisfying job able to help women and families", "cons": "Paperwork gets in the way of patient care. Haphazard quality process. Focus kept changing as senior management turnover was high."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Communications Intern", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "24 Dec 2014", "job_title": "Communications Intern in Melbourne", "duration": "N/A", "pros": "Great culture, positive people, professional managers, interesting tasks", "cons": "I wish I could stay there after completing my internship"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Passionate, data driven development work", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "1 Aug 2020", "job_title": "Program Manager in Melbourne", "duration": "N/A", "pros": "Passionate, intelligent, engaged and generous staff committed to their work.", "cons": "Steep learning curve upon commencing"}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 0, "review_title": "underpaid", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "30 Aug 2020", "job_title": "Enrolled Nurse in Melbourne", "duration": "N/A", "pros": "staff, team, proximity to home", "cons": "very poor pay and due to this understaffed"}], [{"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Never work here", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "8 Aug 2020", "job_title": "Doctor in Townsville", "duration": "N/A", "pros": "None whatsoever that I can think of", "cons": "Many can’t list them all"}]]