[[{"date": "8 Feb 2021", "title": "Research Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Project Concern International", "Interview Descriptions": "Several rounds, starting with submitting a CV and short document with specific questions, followed by assignment and interview. Final round with Country Director. Time taken around a month, with weekly responses to each round.  Reference check also done.", "Interview Questions": "Changes to be made to an evaluation design for low budget"}, {"date": "11 Jan 2021", "title": "Coordinator Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Project Concern International in Nov 2020", "Interview Descriptions": "First round interview with HR, followed up with technical interview from two directors.  The HR interview was basically verbally checking I had all of the qualifications that were listed on the job description.", "Interview Questions": "How does this role fit into your future career goals?"}, {"date": "11 Apr 2018", "title": "Monitoring and Evaluation Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Project Concern International in May 2017", "Interview Descriptions": "I had applied through the online portal, and received an invitation for a phone interview pretty quickly (about a week) and an offer for the position later that day. The interviewer was the direct supervisor for the internship, and was very helpful towards answering my questions about the position and giving details on the projects that the intern would be working on.", "Interview Questions": "Why do you want to apply for this position/ work at PCI"}, {"date": "24 Sept 2015", "title": "Associate Technical Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Project Concern International in May 2015", "Interview Descriptions": "The Interview Process was long and required a series of interviews. \r\n\r\nThe first interview was an HR screening. This was very simple, asking basic questions about qualifications, salary expectations, language proficiency, etc. If you read the job description thoroughly, you'll see a couple target skills that you'll likely be asked about but, again, it is basic questioning and nothing in-depth. The entire interview lasted no more than 30 minutes.\r\n\r\nThe second interview was with the Director of the unit. The interview was relaxed and felt more like a conversation between colleagues than an interview. The breadth of discussion, while seemingly informal, was comprehensive and delved deeply into professional experiences, technical understanding of the work, and personal development goals. This interview was just over one hour.\r\n\r\nThe third interview was a written assessment. The aim of the assessment was to test communication skills, understanding of the field, and professionalism. There were three parts to the assessment and a quick deadline for turnaround. \r\n\r\nThe fourth interview was again with the Director of the unit. This interview was more structured. It went over the written assessment and additional questions stemming from it. Additionally, work styles and preferences were discussed. This interview lasted just over one hour.\r\n\r\nThe fifth and final interview was with one of the VPs. This interview was much more in-depth, lasting nearly two hours, and covered everything from professional experience to international travel to a discussion on why PCI versus another agency. This interview required you to defend your experience in relation to the position and discuss any deficiencies or gaps against what you can bring.\r\n\r\nAbout two weeks after the final interview, HR responded with a final Q&A and offer letter.", "Interview Questions": "Nothing was out of the realm of expectation, with the exception of one question: If you had a superpower, what would it be and how would it make you do your job better? All other questions stemmed from past professional experience and to the job directly."}, {"date": "2 Apr 2015", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Project Concern International", "Interview Descriptions": "Received an email within a week of applying, and an interview shortly after.  The interview was mostly about past experiences, and letting me know the roles and responsibilities of the internship program.  It was very straight forward and informative for how I would start my internship there.  No surprises.", "Interview Questions": "Just asked me about experiences listed on my resume"}, {"date": "24 Jan 2015", "title": "Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Project Concern International", "Interview Descriptions": "Overall, the interview process was long. It consisted of multiple parts. The questions were pretty straight-forward, nothing too surprising. However, there are two things that need to change. First, the hiring/interview team needs to get back to candidates in a timely manner. I found the way they conducted themselves to be unprofessional and rude. Second, if PCI does not want to hire someone based on a lack of skills and/or experience (which were never advertised in the job listing to begin with), do not continue leading the candidate through the interview process! Because clearly that decision was made early on in the process. It's just wasting the candidate's time!", "Interview Questions": "Most of the questions asked touched on skills and experience."}, {"date": "21 Feb 2019", "title": "Country Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Project Concern International in Jan 2015", "Interview Descriptions": "I was interviewed by a recruiter via skype initially then informally face to face with the Chief Operating Officer and Head of HR global, then I had  a further skype interview with a panel of senior managers which were more formal. The whole process took about 2 weeks. It was very thorough.", "Interview Questions": "They asked me about my experience with different donors and with managing fraud."}, {"date": "13 Nov 2014", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 months. I interviewed at Project Concern International (San Diego, CA)", "Interview Descriptions": "The supervisor reached out to my graduate program, so my cover letter and resume was sent to him directly. About a week later, the intern coordinator reached out to me and I was invited to come in to the office for an interview with the Program Officer and Program Director. The interview was pretty casual, probably because it was just for an internship. It took a while to hear back about whether I landed the internship because the Program Officer was out of the country for a while, and the office had a lot of interns at the time and they were unsure if I would have anywhere to sit.", "Interview Questions": "I was asked some specific questions about Excel commands and whether I could clean data"}, {"date": "16 Apr 2015", "title": "Operations Officer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Project Concern International in Oct 2014", "Interview Descriptions": "Applied online and a couple weeks later received invitation to interview over phone. Scheduled a time and never heard from the recruiter. Reached out by email and she replied she had been busy, and rescheduled for next day. At the time of the rescheduled call, interview was again late (20 min) and then seemed very rushed and borderline rude.\r\n\r\nAsked me questions and then seemed perplexed when I tried to give somewhat technical answers. Was very aggressive when discussing the salary and said that there was a strict range and that my current salary was outside the range.  \r\n\r\nIn after the interview, I did not expect to move forward with the second round and never even heard back from the recruiter. When I reached out to inquire about my status I received no reply.\r\n\r\nTip to organization, hire more professional HR staff. This makes your organization look very unprofessional.", "Interview Questions": "What is the largest budget you designed? Why PCI, why this role?"}, {"date": "3 Sept 2013", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Project Concern International (San Diego, CA) in Nov 2012", "Interview Descriptions": "Upon the intern induction I was pulled out for an interview. The interview lasted 30 minutes and was simple. I was offered the internship without further questions.", "Interview Questions": "All questions where easy. "}]]