[[{"date": "N/A", "title": "Graduate Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Rush University Medical Center", "Interview Descriptions": "Rush University Medical Center had a great interview process. It was very personable and the staff is amazing. I really appreciated how they interviewed us. It was super great. I really recommend it", "Interview Questions": "They asked me what my prior experience was"}, {"date": "13 Jun 2023", "title": "Application Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. I interviewed at Rush University Medical Center (Chicago, IL) in Jun 2023", "Interview Descriptions": "I reached out to an external recruiter about an Application Analyst (Tier 3) position on the University Applications team at Rush University. I was selected to move forward to an interview with the team. During the interview I was asked a lot of non-technical questions, especially about working with stakeholders. Two days after the interview I was told that they passed on me because I did not have the required 7 years of experience. Issues: 1. Don't put someone through the interview process if they do not have the necessary experience. Like, can your people not read a resume? 2. No tech questions whatsoever during the interview process, but apparently people who do have tech experience just don't check the boxes. 3. Stop wasting peoples' time.", "Interview Questions": "Describe working with stakeholders and how you handle working with non technical individuals."}, {"date": "4 Jun 2023", "title": "Clinical Quality Coordinator Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Rush University Medical Center", "Interview Descriptions": "Easy HR emailing; virtual interview with wonderful managers who seem passionate and engaged. They asked thoughtful questions versus basic and common interview questions, which I appreciated! They described the role very well and answered all of my questions. The only downside is there are minimal requirements for what could be a much grander position that can influence practice and outcomes.", "Interview Questions": "Tell us about a quality project? How do you respond to employees who aren’t on board?"}, {"date": "22 May 2023", "title": "Clinic Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Rush University Medical Center", "Interview Descriptions": "Spoke with recruiting for a 30 minute Phone Interview. Followed up two weeks later with a In Person Interview. Interviewed with the manager of the department. A week later was notified by HR with an offer.", "Interview Questions": "What is your strength and weakness"}, {"date": "16 May 2023", "title": "Employee Experience Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Rush University Medical Center in May 2023", "Interview Descriptions": "Strange. Was contacted by a recruiter in Chicago and they scheduled a 15 minute phone screen over video. The interviewer had a strange, unpleasant demeanor and said \"I'm going to be asking you questions\"....it was extremely rushed and lasted a total of 4 minutes. There was no room to elaborate or expand on answers. I felt it wasn't a true, genuine interview/screen but rather an opportunity for the recruiter to meet a quota. I had to send a follow-up email a week later to check on the status of scheduling an actual interview and was told they've moved forward with others. Despite being qualified for the job and having relevant experience, I was not given a fair opportunity to showcase that.", "Interview Questions": "\"What do you do now?\" \"What are your salary requirements\""}, {"date": "28 Apr 2023", "title": "Certified Nursing Assistant CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Rush University Medical Center", "Interview Descriptions": "Straightforward. A sit down interview in person and asked questions regarding work experience, situations that could arise, and personal experiences. Ultimately, the interviewer wants to get to know more of you to see if you are a proper candidate for the position.", "Interview Questions": "How would you deal with a difficult situation?"}, {"date": "25 Apr 2023", "title": "Occupational Therapist Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Rush University Medical Center", "Interview Descriptions": "Zoom call first with the principle and then an in person interview where you meet with the whole team. You are in person for about 2-3 hours. You sit in and observe a classroom for 30 minutes.", "Interview Questions": "Why do you want to work in a school setting?"}, {"date": "17 Apr 2023", "title": "Registered Nurse, BSN Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Rush University Medical Center (Chicago, IL)", "Interview Descriptions": "Recruiter reached out right away then interview with unit manager. Offer received within a week of interview. Onboarding took weeks and there is only one start date per month so if you don’t make it you have to wait an entire month to start", "Interview Questions": "Tell me about a time you had conflict in the workplace and how you handled that situation."}, {"date": "25 Apr 2023", "title": "Patient Care Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Rush University Medical Center (Chicago, IL) in Apr 2023", "Interview Descriptions": "After applying, I was contacted 4 days later for a phone interview. After that I was set up for an in person interview but didn’t get that position but I was offered another interview with a different department I had also applied for.", "Interview Questions": "What was a time you went above and beyond for a patient"}, {"date": "8 Apr 2023", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Rush University Medical Center (Chicago, IL) in Apr 2023", "Interview Descriptions": "The process has been very easy. Everyone has been kind and open. Quick response time and open to answering questions. The interview questions were standard and they were more interested in my desire for the position than specific skills or experiences", "Interview Questions": "Why do you want to work here?"}, {"date": "15 May 2023", "title": "Clinical Psychology Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Rush University Medical Center (Chicago, IL) in Apr 2023", "Interview Descriptions": "The faculty were open and friendly. Scheduling was done quickly via email. The interview was more of a conversation, rather than a series of questions. I enjoyed learning about the training opportunities.", "Interview Questions": "They asked about my goals for training."}], [{"date": "N/A", "title": "Graduate Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Rush University Medical Center", "Interview Descriptions": "Rush University Medical Center had a great interview process. It was very personable and the staff is amazing. I really appreciated how they interviewed us. It was super great. I really recommend it", "Interview Questions": "They asked me what my prior experience was"}, {"date": "29 Mar 2023", "title": "Educator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Rush University Medical Center (Chicago, IL)", "Interview Descriptions": "The interview process was very slow, taking months to first hear back. But once the process got going it was straight forward. Normal questions and process for an academic interview", "Interview Questions": "They asked about working with international students"}, {"date": "25 Mar 2023", "title": "Clinical Research Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Rush University Medical Center", "Interview Descriptions": "The interview process took a long time. First the recruiter emailed for an interview but didn't respond to my emails for about 3 months. Then I emailed her again. Then the interview process began which involved just 2 rounds. First was a phone call with general questions. Second round was taken by 3-4 members involving physician, senior level CRC and others.", "Interview Questions": "How do you handle stress?"}, {"date": "17 Jun 2023", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Rush University Medical Center in Mar 2023", "Interview Descriptions": "Phone call with mini interview, set up a virtual interview with manager, scheduled shadow shift, never heard back nor was my status updated in the system. Shadow shift was basically 2 hours shadowing another nurse and seeing the floor and demonstrating skill. Also seeing if you fit in. Thought everything went well but never heard back.", "Interview Questions": "Why do you want to work for us?"}, {"date": "25 Feb 2023", "title": "Certified Surgical Technologist (CST) Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Rush University Medical Center", "Interview Descriptions": "Easy standard questions be prepared with resume about 3-5 people will interview you. Management can do better but this is typically the way it is in this field. Value your employees.", "Interview Questions": "Why do you wanna work here. What is your biggest challenge. What have you accomplished in the past"}, {"date": "18 May 2023", "title": "Clinical Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Rush University Medical Center (Chicago, IL) in Feb 2023", "Interview Descriptions": "Waste time going down, gas is expensive. No follow up with yes or no. More than likely you have to know someone on the inside to get hired. My interview skills are immaculate.", "Interview Questions": "N/A"}, {"date": "9 Jan 2023", "title": "Medical Laboratory Scientist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Rush University Medical Center", "Interview Descriptions": "Zoom call. Asked about interests, experience, and licensure. Asked about career goals and extracurriculars. Spoke to supervisors and directors about their experience and the status of their employees. Asked about education and background", "Interview Questions": "What led you to medical laboratory science?"}, {"date": "20 Feb 2023", "title": "RN-1 Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Rush University Medical Center in Jan 2023", "Interview Descriptions": "the recruiter called me first and at the end of the call the 2nd interview was scheduled. I then met with the unit manager and was offered the position the following day", "Interview Questions": "a lot about my internship"}, {"date": "27 Dec 2022", "title": "Nurse Practitioner Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Rush University Medical Center", "Interview Descriptions": "multiple stepson interview with team initial panel with HR and them with management you'll also have to interview with the team and different roles. it is lengthy so be prepared to know it will take some time", "Interview Questions": "background and experience. strength and weakness"}, {"date": "19 Dec 2022", "title": "Pharmacy Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Rush University Medical Center", "Interview Descriptions": "I submitted my application via their career page and received a call from HR to schedule an in-person interview with the manager. I was asked to bring my resume, PTCB certification, and diploma on the day of my interview. I had an on-site assessment (primarily math and compounding questions) after meeting with HR.", "Interview Questions": "Do you have any work experience as a pharmacy technician?"}], [{"date": "8 Dec 2022", "title": "Patient Care Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Rush University Medical Center", "Interview Descriptions": "The interviewers were very nice and the interview it’s self was short and sweet . The engaged in conversation outside of the position . I felt like they really wanted to get to know me", "Interview Questions": "What are my short and long term goals"}, {"date": "8 Dec 2022", "title": "Research Lab Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Rush University Medical Center (Chicago, IL)", "Interview Descriptions": "One hour interview with managers, they asked questions about my past research experience and my current work behaviors. The interview went pretty quickly and they spoke at length about what type of research they are conducting.", "Interview Questions": "Tell me what a good day for you is at your job."}, {"date": "23 Nov 2022", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Rush University Medical Center", "Interview Descriptions": "Take months to respond to applicants and they do not use email to communicate. Went through an interview and shadowing process, but after I asked for information on compensation they never contacted me again.", "Interview Questions": "Typical questions related to clinical area"}, {"date": "7 Nov 2022", "title": "Intern Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Rush University Medical Center", "Interview Descriptions": "It was simple the management was wonderful. So ask very simple questions and just trying to see where your head is at and making sure you are a right fit for the company", "Interview Questions": "What was you previous job"}, {"date": "7 Dec 2022", "title": "Recruitment Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Rush University Medical Center (Chicago, IL) in Nov 2022", "Interview Descriptions": "I applied months before they contacted me for a first interview. After the first interview, I got a call back within a week to do a second in person interview and then got the job! In total, once I started interviewing, it took 3 weeks.", "Interview Questions": "What skills do you think you have that would be beneficial to this role?"}, {"date": "10 Oct 2022", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Rush University Medical Center", "Interview Descriptions": "Pretty standard behavioral questions. Typical strengths & weaknesses, \"tell me about a time...\", etc. There was two rounds of interviews and then the offer was made. Would recommend studying the organization thoroughly before heading into the interview", "Interview Questions": "Why would you want to work at Rush?"}, {"date": "10 Nov 2022", "title": "Director of Digital Engagement Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 days. I interviewed at Rush University Medical Center (Chicago, IL) in Oct 2022", "Interview Descriptions": "I submitted my application through their online system. It was extremely outdated and took very long to complete, so I followed up by sending my resume directly to the hiring manager. I was contacted the next day and had an HR screening the following week. The screening took exactly 13 minutes. That includes the minute or so to identify technical difficulties, the recruiter phoning me directly and me asking questions about the company--without the recruiter offering me the opportunity to do so. Honestly, it felt like a waste of both of our time. My prep was useless. She sounded as if she were reading from a script, so it was not conversational at all. I have nearly 25 years' experience and there was absolutely no way she had a sense of who I am in the few minutes that I actually spoke. The cut and paste decline was essentially the same as the cut and paste \"interview.\" Very disappointing for an organization I have used and admired for years.", "Interview Questions": "Why do you want to work here?"}, {"date": "21 Sept 2022", "title": "Early Intervention Service Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Rush University Medical Center", "Interview Descriptions": "Two sets of interviews. \nInitial intro questionnaire based interview \nSecond interview with the director of the center. \nInterview is standard. \nA lot of questions and very calm environment.\nInterview was not challenging. ", "Interview Questions": "How would your experience be useful with cases? "}, {"date": "16 Sept 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Rush University Medical Center", "Interview Descriptions": "Pretty typical interview process. Asked basic interview questions. Some questions were difficult but otherwise it   was a typical interview. Asked questions about me and my background. Only a couple off the wall questions probably thrown in to see how I think on my feet.", "Interview Questions": "What have you done in the last year you are proud of?\n"}, {"date": "7 Sept 2022", "title": "Summer Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Rush University Medical Center", "Interview Descriptions": "Phone Interview then  on site interview. Process was quick and easy. Time zone  difference made it a bit hard to line up since  I was still a student in a different state.", "Interview Questions": "Why do you want to do an internship in social work department?"}], [{"date": "12 Sept 2022", "title": "Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Rush University Medical Center (Chicago, IL) in Sept 2022", "Interview Descriptions": "In person interview in the directors office then there was a tour of the facility.  Very informal based on the position that I was interviewing for.  I do not think that this is fair and that people looking for employment do not have the time that is being taken away to gain access to their account ", "Interview Questions": "General interview question regarding background"}, {"date": "6 Aug 2022", "title": "NICU RN Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Rush University Medical Center (Chicago, IL) in Jul 2022", "Interview Descriptions": "The interview process sucks. I don’t get how they hire many new grad nurses but when an experienced RN applies they have “more qualified candidates”. Wont even allow an individual to show their potential. You literally have to know somebody behind the scenes to get a job there. Truly terrible.", "Interview Questions": "N/A"}, {"date": "14 Jun 2022", "title": "Physical Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Rush University Medical Center", "Interview Descriptions": "The process was very smooth and efficient. It was clearly well planned and thought out. They bring you on campus, interview you, and give you the opportunity to shadow. It was, in total, around 2-3 hours max", "Interview Questions": "Tell me about your previous experience"}, {"date": "11 May 2022", "title": "Evaluation Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Rush University Medical Center in Apr 2022", "Interview Descriptions": "Phone screen-Job task-final interview with multiple people-GHOSTING\r\n\r\nI enjoyed my conversations with the hiring manager and other search committee members. I have to say getting a response from them would take a while. It has been a month since my final interview and I just found out my application status changed to \"more qualified candidates\", which is a KIND way of saying no.", "Interview Questions": "Common questions you would expect from any interview."}, {"date": "13 Sept 2022", "title": "Administrative Coordinator Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Rush University Medical Center (Chicago, IL) in Apr 2022", "Interview Descriptions": "Got a call from HR. Went in for 1 interview with department head. HR did not tell me who I was meeting with or what the process was so I was surprised when I arrived. ", "Interview Questions": "They asked me when I would be willing to start. Seemed desperate. "}, {"date": "15 Mar 2023", "title": "Service Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Rush University Medical Center in Apr 2022", "Interview Descriptions": "Very comfortable interview process! Everyone was extremely friendly. First interview with HR over the phone, second with the CFC director over zoom. All the questions asked were relevant to the job, and the conversation felt really natural.", "Interview Questions": "Three words to describe you as an employee."}, {"date": "16 Mar 2023", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Rush University Medical Center in Apr 2022", "Interview Descriptions": "Very easy interview. The interview question was about my experience and which department I was interested in. They also asked if there’s anything I am uncomfortable with. Also, to describe myself.", "Interview Questions": "Which department would I like to work in and why?"}, {"date": "11 May 2022", "title": "Program Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Rush University Medical Center in Mar 2022", "Interview Descriptions": "The whole process was very disorganized from the beginning. They basically ghosted me after my final interview (3-hour Zoom call). People I talked to seemed really nice but the whole hiring process was pretty lengthy.", "Interview Questions": "Basic questions that you should expect from an interview.\r\nBe prepared to ask the interviewer questions.\r\n"}, {"date": "1 Mar 2022", "title": "Recruiter Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 6 days. I interviewed at Rush University Medical Center (Chicago, IL)", "Interview Descriptions": "It’s was a pretty easy process to get started. I applied using Easy Apply on LinkedIn. I heard back within a week to schedule a phone interview. \r\n\r\nI was a bit throw off when I logged in for the call, and was asked to turn on the camera. I was dialed in. I let them know that I would have to log in a different way. I had to download the app and then log it. The optics of this made me pretty nervous. After the interview, I reviewed the invite and it did say phone call screening. Rush should streamline that process. \r\n\r\nOnce I got logged in, I was told about how many managers they have, how much growth they have experienced, and they let me know that their systems aren’t the most user friendly. \r\n\r\nThey weren’t sure which specific position this role would report to. They made the position sound very unorganized and that it might cause frustration for people. By the end of the call, I was pretty sure that I would not be moving forward and it was reciprocal.", "Interview Questions": "Are you looking for a permanent or contract role?"}, {"date": "20 Feb 2022", "title": "Front End Cashier Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Rush University Medical Center", "Interview Descriptions": "First was an email for an interview, then a phone screening interview, and last a zoom interview. Job offered and Drug Screening. The hiring process took at least three to four weeks.", "Interview Questions": "Why Rush University Medical Center?"}], [{"date": "11 May 2022", "title": "Program Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Rush University Medical Center in Feb 2022", "Interview Descriptions": "screen with HR person for about 15 minutes, then 3 hours of zoom interviews with various people. Despite the long 3 hours the process itself was very organized and people were responsive.", "Interview Questions": "Questions were all reasonable and expected "}, {"date": "5 Jan 2022", "title": "Pediatric Genetic Counselor Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Rush University Medical Center", "Interview Descriptions": "After a quick HR screening phone call, I was able to have an interview with the two medical geneticists and genetic counselor all in the same day remotely. Each interview took 30 minutes.", "Interview Questions": "N/A"}, {"date": "17 Apr 2022", "title": "Nursing Assistant Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Rush University Medical Center (Chicago, IL) in Jan 2022", "Interview Descriptions": "Very easy. In person interview and only one round. Met with unit director for about 30 minutes to get to know me and my background in healthcare. Then we got into the interview process", "Interview Questions": "Time I dealt with conflict with a co-worker"}, {"date": "21 Feb 2022", "title": "Customer Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Rush University Medical Center (Chicago, IL) in Jan 2022", "Interview Descriptions": "The interview went very well. The interview was lengthy, but there were four different managers in the interview from different departments. They were all very friendly and went over the responsibilities for  each department.", "Interview Questions": "Tell me something about yourself "}, {"date": "24 Jun 2022", "title": "Associate Professor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Rush University Medical Center (Chicago, IL) in Jan 2022", "Interview Descriptions": "Zoom interview with faculty from different departments, campus visit with meetings class observation, and presentation. Meetings with chair and associate Dean. Everyone was helpful and supportive to answer my questions. Effectively described job expectations and made sure of a good fit.", "Interview Questions": "Tell us about a research program you would like to pursue here and how you might collaborate with other faculty."}, {"date": "6 Dec 2021", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Rush University Medical Center", "Interview Descriptions": "Fast and to the point.  Was focus on my experience and why I would like to work there. The rest was talking about the floor and how the floor runs", "Interview Questions": "Tell me how was your last shift? What type of pt did you had ?"}, {"date": "4 Oct 2021", "title": "Clinical Research Coordinator Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Rush University Medical Center (Chicago, IL) in Oct 2021", "Interview Descriptions": "I applied to this role and got an email from the hiring manager for phone screen after almost a month. It felt like they have decided already not to hire me and most of the conversation was regarding why I am not a good fit for this role.", "Interview Questions": "Q: What made you to pursue career in research?"}, {"date": "16 Sept 2021", "title": "Video Producer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Rush University Medical Center", "Interview Descriptions": "Very good and straightforward so far. Discussion with screener who knew what she was doing. But was slow to get back to candidates. They seem to be hiring for a new role so not all the questions were what I would expect from a more knowledgeable interviewer.", "Interview Questions": "Would you be comfortable working with video of surgery procedures?"}, {"date": "3 Nov 2021", "title": "Certified Pharmacy Technician Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Rush University Medical Center in Sept 2021", "Interview Descriptions": "Super chill and easy. Great staff and answer all questions you have. Not intimidating at all. Different than inpatient. manager and supporting staff are way more friendly. Definitely  worth a shot", "Interview Questions": "Do you have experience with EPIC "}, {"date": "23 May 2022", "title": "PCT I Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Rush University Medical Center (Chicago, IL) in Sept 2021", "Interview Descriptions": "The interview process is simple, fast, and easy. You will meet with more than one manager for the unit. Come dressed professionally and clean with your resume and cover letter in your hand", "Interview Questions": "What are your weakness and strengths "}], [{"date": "20 Sept 2021", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Rush University Medical Center (Chicago, IL) in Aug 2021", "Interview Descriptions": "I received a phone interview request ~2 weeks after applying, then had an in-person interview a week later. HR was very friendly, attentive, and organized. The unit manager was kind, personable, and energetic. The process was very easy.", "Interview Questions": "Describe a time you advocated for your patient?"}, {"date": "30 Jan 2022", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at Rush University Medical Center in Jul 2021", "Interview Descriptions": "So I applied months ago, but it was such a negative experience that I thought I should say something. I applied for an RN position, got an interview to meet with the a manager (in-person), and now it’s interview day. Okay, cool. I get there, check in, wait for the nurse manager to interview me. I greet and introduce myself, but can’t help feel like I’ve been immediately dismissed. Maybe I wasn’t what she was expected, maybe I don’t look like what she thought I would, maybe it’s my age, or maybe she just doesn’t care enough about this interview. As we’re interviewing/conversing, she gives me the most disinterested attitude as I ask questions. She tells me she will be right back as she had to go talk to a doctor that’s quitting. Erm, okay. She takes 15 minutes. I’m not exaggerating. I should’ve just left because it was such a waste of time. She comes back and asks the same questions she already did (likely wasn’t paying attention the first time around). Then she asks if I’d be willing to talk to some of the other nurses. The nurses are much more personable, nice, and engaging. I felt a click with them. After we peer interview, the nurse manager and I finish the interview. She tells me “to be on the look out”. I smile, thank her for her time and consideration, and I’m escorted back out as the interview is over. I don’t know. Everything felt negative. I’ve never had an interview conducted in such an unprofessional way and by someone so disinterested in the entire process. I wasn’t offered a position, but I did of course send a thank you e-mail to the manager and the recruiter. I later asked for feedback but never got a response. Overall a poor experience. It’s been about six months since then, but I what made me think of Rush and this horrible experience was their HR department. Last week I received a call from HR asking if I’d be interested in opportunities with Rush. Apparently they’re reaching out to people who have previously applied with them. I honestly don’t think I’d want to work for Rush knowing what I know now anyway.", "Interview Questions": "I’ll be back, I just have to say goodbye to a physician who’s leaving us, alright?"}, {"date": "12 Oct 2021", "title": "Procurement Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Rush University Medical Center (Chicago, IL) in Jul 2021", "Interview Descriptions": "Screener interview with HR then an in person interview panel with what seemed to be the entire procurement staff.  Interview went fine.\r\n\r\nNever heard back. Was very surprised to not even get a follow up email as I had good report with the recruiter from HR... not good enough I guess as he couldn't even be bothered to tell me they went in a different direction or respond to my follow-up messages.", "Interview Questions": "N/A"}, {"date": "27 Jul 2021", "title": "Per Diem Occupational Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Rush University Medical Center in Jul 2021", "Interview Descriptions": "The interview felt very nice and conversational. It was on zoom and two people interviewed me, but it it didn't feel stressful, and I got the sense that they're very invested in their organization and employees", "Interview Questions": "Explain your approach if you encountered a condition or diagnosis that you didn't know much about or weren't necessarily prepared for. "}, {"date": "21 Jun 2021", "title": "Patient Service Representative II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Rush University Medical Center", "Interview Descriptions": "Very smooth process it dint take long take most other work places. It was a little nervous at first but a good place to work. Also the people there were really friendly", "Interview Questions": "Why do you want to work here?"}, {"date": "21 Jun 2021", "title": "Regulatory Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Rush University Medical Center in Jun 2021", "Interview Descriptions": "I applied 1 month back in May. I regularly checked the application status and it was updated to \"filled position\" at the end of May. All on a sudden,  in late June 2021 I received a call with voicemail asking me to call back on that day regarding the position. I checked the application status online, this time it changed to \"Pending review\".  I was expecting a scheduling process when I called back in an hour but to my surprise it was an unscheduled surprise phone interview. Very unprofessional attitude! I spoke with confidence and nicely.  Shortly after hanging up, I checked the application status and it was changed to \"More qualified candidates\". That was fast! Wow! I am relieved to have not been selected in such an unprofessional department.", "Interview Questions": "Tell me about your experience "}, {"date": "12 May 2021", "title": "Biostatistician Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Rush University Medical Center", "Interview Descriptions": "Initially I had a phone interview. The HR scheduled for an interview and he forgot about it. Then he sent an email the following week stating he was busy and rescheduled it. Then after the HR round I had a skype round then an in person interview. After the in person interview they never got back to me or replied to my emails. They are so unorganized. I never knew such a reputed organization will be so unorganized. Even the schedule for the interview was sent in early hours of the same day as interview.", "Interview Questions": "What made you apply to rush?\nStrengths? Weakness?\nYour background?"}, {"date": "19 May 2021", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Rush University Medical Center (Chicago, IL) in May 2021", "Interview Descriptions": "The initial interview was set up over the phone, with a hiring staff member and lasted about 30 minutes. Following this interview I was asked to come in person to be interviewed by the unit directors.", "Interview Questions": "Why I specifically chose to seek a position on that floor. "}, {"date": "20 Apr 2021", "title": "Physician Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Rush University Medical Center", "Interview Descriptions": "This was an HR screening phone call. They asked a few basic questions, not very conversational literally just asked a question and then moved on to the next. Then they told me about the position.", "Interview Questions": "What is your desired salary?"}, {"date": "15 Apr 2021", "title": "Endocrinologist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Rush University Medical Center", "Interview Descriptions": "Straightforward questions with friendly interviewers, who made the process smooth and less formidable. Got a good sense of the hospital / clinic and the roles / responsibilities. Very good overall feeling", "Interview Questions": "Describe yourself as your friends would"}], [{"date": "11 Apr 2021", "title": "Medical Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Rush University Medical Center", "Interview Descriptions": "Looking for different jobs. something with a good salary. a close friend shared this one and I am happy to apply for it. interview was very easy. lets see if I receive a call from the in the future.", "Interview Questions": "Why did you choose rush"}, {"date": "20 Mar 2021", "title": "Legal Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Rush University Medical Center", "Interview Descriptions": "They wanted multiple references submitted prior to first interview. I was assured they could be from current organization because the references wouldn’t be contacted until sometime later in the process. This was inaccurate - they were contacted immediately and without notifying me (fortunately, I didn’t use anyone that I currently work with). \r\n\r\nThe instructions/details about the reference process were inconsistent between the recruiter’s email and on the reference platform. The recruiters responded to my call to  address these inconsistencies with an email and didn’t really address the concern. \r\n\r\nThe poor communication continued following the interview. It took multiple follow-ups to get an update. \r\n\r\nNo hard feelings, just sharing because would not have applied if I was aware of the issues related to reference process prior to submitting an application.", "Interview Questions": "Nothing out of the ordinary"}, {"date": "20 Mar 2021", "title": "Certified Surgical Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Rush University Medical Center", "Interview Descriptions": "Asked questions about myself and my work experience. They asked a few questions about what I would do in certain situations. They also gave me an input on what they expect from me and also the schedules and orientation hours.", "Interview Questions": "They asked me about how I’d handle situations"}, {"date": "25 Apr 2021", "title": "Research Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Rush University Medical Center (Chicago, IL) in Mar 2021", "Interview Descriptions": "The process took about a little but over a  month and was more or less simple. It was stressful waiting though. It starts to move faster after you've accepted your offer", "Interview Questions": "What are you strengths? and weaknesses "}, {"date": "5 Mar 2021", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Rush University Medical Center (Chicago, IL) in Mar 2021", "Interview Descriptions": "Recruiter reached out via email to record my responses to 5 questions. Then I got interviewed by 2 hiring managers. The interview lasted one hour, it was all based on behavioral questions.", "Interview Questions": "Why Rush?\r\n\r\nHave you applied anywhere else?\r\n\r\nTime when you made a mistake \r\n\r\nHow do you handle feedback "}, {"date": "23 Mar 2021", "title": "Registered Nurse 1 Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Rush University Medical Center (Chicago, IL) in Mar 2021", "Interview Descriptions": "Video interview first (question and then record your answer)\n- 5 pretty standard questions and you get 4 attempts per questions\nWith COVID, video interview with management\n- 1 hour long\n- The manager I interviewed with was so kind and made me feel very heard", "Interview Questions": "Tell me about yourself, let me get to know you."}, {"date": "16 Apr 2021", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. I interviewed at Rush University Medical Center (Chicago, IL) in Mar 2021", "Interview Descriptions": "It was simple and easy. It was not very hard at all. It was thirty minutes long over zoom. They asked me questions. I was offered the job a week later.", "Interview Questions": "Tell me about your background"}, {"date": "19 Feb 2021", "title": "Financial Analyst Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Rush University Medical Center (Chicago, IL)", "Interview Descriptions": "The application required three in-depth professional references, so your current managers/employers will obviously know you're planning to leave the company.  Oh well. Pleasant initial phone interview with a recruiter, followed by a phone interview with the hiring manager. This was followed by a third round of longer interviews with another recruiter, then the hiring manager, and finally a panel with the clinical team (this last round took altogether about 2.5 hours).  Honestly it would have been an overall positive experience EXCEPT for the drawn-out process/redundant interviews and the lowest salary offer not up for much negotiation. The same job posting has opened, closed, and reopened for months now...hmmm. If the job is that hard to fill - maybe it's time to reevaluate the interview process and pay candidates fairly.", "Interview Questions": "Tell me about a project that you're especially proud of and why?"}, {"date": "10 Jan 2021", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Rush University Medical Center", "Interview Descriptions": "Applied online, 2-3 weeks later got a call from HR to set up an interview with the unit manager the following week. It was an in-person interview, met with the manager and assistant manager. They were friendly and answered my questions in great detailed. Interview was about 15 minutes long.\nAfter the interview, I did have to email them a couple of times to follow up.", "Interview Questions": "Tell me about a time you made a mistake. \n"}, {"date": "8 Jan 2021", "title": "Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Rush University Medical Center", "Interview Descriptions": "I had an interview with the recruiter, then followed up with unit manager which was done over video chat. I got an offer by the end of the following week.", "Interview Questions": "Why are you interested in Rush?"}], [{"date": "23 Dec 2021", "title": "Physician Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 3 weeks. I interviewed at Rush University Medical Center in Jan 2021", "Interview Descriptions": "Met with each surgeon on Zoom. It was a really smooth process.  HR set up an itinerary with links which made it easy and organized. Very laid back meetings. Impressed with the process.", "Interview Questions": "Tell me about yourself and why you want this role. "}, {"date": "16 Dec 2020", "title": "Operations Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Rush University Medical Center", "Interview Descriptions": "Due to COVID -19 the interview was virtual. It was a really bad connection so I tried my best to answer questions. The recruiter reached out to me first to answer a few question, then she set up up with a interview with the office manager.  The interview process was pretty easy and fast.", "Interview Questions": "Why would I be a great asset to the team "}, {"date": "4 Dec 2020", "title": "Administrative Fellow Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Rush University Medical Center", "Interview Descriptions": "This process begins with the fellowship application service, followed by a phone interview conducted by a C-level leader, then a full week of intense onsite interviews. This is all managed within the NAFCAS system.", "Interview Questions": "If you were a hospital CEO, what 3 things would keep you up at night?"}, {"date": "3 Dec 2020", "title": "Associate General Counsel Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Rush University Medical Center", "Interview Descriptions": "The first round was a general phone interview. It lasted about a half hour, and it covered mainly background, education, and other general questions. I did not have an in person interview.", "Interview Questions": "Mainly general questions about background. "}, {"date": "15 Dec 2020", "title": "Nurse Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Rush University Medical Center (Chicago, IL) in Dec 2020", "Interview Descriptions": "Was called for an interview, easy setup, interview was quick via phone less than 10 minutes. Never heard back from\r\nthe manager or the HR recruiter especially after following up a day later no reply!", "Interview Questions": "Tell me about yourself. \r\nDo you have epic charting experience? "}, {"date": "28 Apr 2023", "title": "Associate Clinical Research Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Rush University Medical Center in Nov 2020", "Interview Descriptions": "I applied online and was contacted by HR. Had a ten minute conversation on why I wanted the job, salary expectations, etc. Then met with direct manager and research team who asked about experiences.", "Interview Questions": "What are your favorite and least favorite parts about research?"}, {"date": "23 Sept 2020", "title": "Certified Pharmacy Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Rush University Medical Center (Chicago, IL) in Aug 2020", "Interview Descriptions": "I mainly interviewed and dealt with an HR rep who was extremely nice and helpful. I had 2 phone interviews. One with my HR rep, and one with the pharmacist. Then I came In for an in-person interview with the pharmacist.", "Interview Questions": "How do I handle stress in the pharmacy "}, {"date": "7 Jul 2020", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Rush University Medical Center", "Interview Descriptions": "The interview started with a call from the recruiter explaining the process of orientation, hours and overview. Second was with manager and assistant manager. Given the circumstances it was over a webcam. Scenario based questions were a big part of the interview.", "Interview Questions": "What are your short and long term goals?"}, {"date": "12 Feb 2021", "title": "Kitchen Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Rush University Medical Center (Chicago, IL) in Jun 2020", "Interview Descriptions": "met with multiple people, including executive manager and the supervisor.  could not have been nicer! sat for about 2 hours total, given tour of facility, in depth conversations about structure, expectations and how they're growing etc", "Interview Questions": "how i handle stress and work in a team"}, {"date": "15 Jul 2022", "title": "Program Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Rush University Medical Center (Chicago, IL) in Apr 2020", "Interview Descriptions": "The interview had lots of rounds. All interviews via Zoom. The format of the interviews felt pretty formal. Lots of female leadership, which was awesome to see. I beleive you must complete 4 rounds total.", "Interview Questions": "Have you had experience working in a hospital setting?"}], [{"date": "5 Aug 2020", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Rush University Medical Center (Chicago, IL) in Apr 2020", "Interview Descriptions": "It was nice, or so I thought, average interview. The manager said she love how I interviewed and would be calling me back. To my dismay, she updated my status to \"More Qualified Candidate\".", "Interview Questions": "Why do you want to work here?\r\n"}, {"date": "3 Jun 2020", "title": "Community Outreach Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Rush University Medical Center (Chicago, IL) in Mar 2020", "Interview Descriptions": "The interview process was very long and unresponsive. They were quick to set interview for the very next day. I got through two rounds and interviews were very thorough. First interview is to see if you are qualified for the position and second interview is with colleagues who decide if you are someone that aligns with the goals they have in mind. Everyone was friendly and engaging. Problem was that every other week, they would say there will be an update at the end of the week but that went on for over 3 months.", "Interview Questions": "Some work may be repetitive and mundane, how are you in handling work that aren't interesting?"}, {"date": "21 Mar 2023", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Rush University Medical Center in Mar 2020", "Interview Descriptions": "2 rounds of interviews with staff to determine if you are a good fit. The team was nice and informative. Very laid back and welcoming. If you are selected, HR will send you a email with the offer", "Interview Questions": "What is your work style? Describe a time where you had to do multiple projects"}, {"date": "18 Dec 2019", "title": "Clerkship Coordinator Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Rush University Medical Center", "Interview Descriptions": "I met with 5 members of the team individually, and it took about 2 hours. They all asked a variety of question and all were very nice and easy to speak with. HR was the decided factor not to take the job.", "Interview Questions": "Why are you interested in this position? \r\nWhat prompted your career change? "}, {"date": "6 Nov 2019", "title": "Junior API Developer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at Rush University Medical Center", "Interview Descriptions": "This was ONLY the online application. I have not interviewed, I just finished the application.  The Rush career portal requires you to fill out your profile on their site, however users are logged out after only about 5mins. This caused me to lose my work on a section several times. Even my quick edits were not always saved. After 5 or 6 times of this, I was rushing through the application to just get all sections complete before it logged me out. The review profile before submit section is divided into to two columns, requiring tons of scrolling to review the info (usually one column, in my experience). This was very poor user experience, which I believe will cause the applicant pool to shrink due to people being fed up with the careers site.", "Interview Questions": "N/A"}, {"date": "10 Oct 2019", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Rush University Medical Center (Chicago, IL) in Oct 2019", "Interview Descriptions": "Interview process is fairly routine, if you get the chance to interview.  I've been applying for months and have received 3 interviews.  I was a finalist for 1 of the positions and ended up not getting it.  The recruiting department is so understaffed, that if you have a phone interview, it can be weeks til you get an email to request in an person interview.  Once you're there, it's fine and the interview questions vary due to who you're meeting with.  Be aware that for administrative positions, you'll test for over 2 hours and it takes longer when the computers continually crash.", "Interview Questions": "Questions vary as to who and what department or hiring manager interviews you."}, {"date": "23 Aug 2019", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Rush University Medical Center", "Interview Descriptions": "Started with an interview with human resources and then after followed up with the interview with the managers on the unit end with tour of the unit. Everyone was very welcoming and very excited to interview staff was friendly and leadership was very encouraging.", "Interview Questions": "Tell me about a time you went above and beyond to provide excellent patient care?"}, {"date": "6 Aug 2019", "title": "OR RN I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 4 weeks. I interviewed at Rush University Medical Center (Chicago, IL) in Aug 2019", "Interview Descriptions": "Set up a shadow day with the clinical educator of the OR after meeting him at my school's career fair. went to the shadow day and had a blast! Then after I got my IL RN license, I applied, emailed the people in OR. First was a brief phone interview. They asked some of the questions on the application and confirmed my desired salary. Went for an in person interview and most questions where situational bases.", "Interview Questions": "Why do you want to work in the OR"}, {"date": "27 Jul 2019", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. The process took 1 day. I interviewed at Rush University Medical Center (Chicago, IL) in Jul 2019", "Interview Descriptions": "I came in and waited in the lobby. I gave them my name and was greeted by the RN. I went to the back room and was interviewed by the lead MA & RN. It was about 15 minutes total. After the interview I was shown the floor and introduced  to the rest of the staff.", "Interview Questions": "Tell me about yourself.\r\nWhat are your strengths & weaknesses?\r\nHow do you handle difficult situations?\r\n"}, {"date": "5 Jun 2019", "title": "Project Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Rush University Medical Center (Chicago, IL)", "Interview Descriptions": "It was pretty quick and and easy and I received a job offer just days after the interview. This, however, is rare for Rush because they usually take a really long time to hire someone.", "Interview Questions": "N/A"}], [{"date": "10 May 2019", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Rush University Medical Center", "Interview Descriptions": "Rush University Medical Center does a very structured interview process. Met with Human Resources recruiter or staff and met with the hiring manager. The interviews are average length and can sometimes be conducted in groups.", "Interview Questions": "Describe how you would handle a conflict."}, {"date": "9 Mar 2019", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Rush University Medical Center", "Interview Descriptions": "The first time I interviewed, I  was living out of state. They had me come for an in person interview. Understandable. It was just a drive. Left Rush. When I interviewed to come back, I had to fly in for a routine staff RN position. Last min. Really expensive. Good thing I got the gig. Hope they don't ask anyone to do this except for candidates they are pretty sure they will hire.", "Interview Questions": "Standard interview questions. Tell me of a challenging situation with patient. Tell me your strengths, weaknesses, etc. "}, {"date": "20 Mar 2019", "title": "Postdoctoral Research Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Rush University Medical Center (Chicago, IL) in Feb 2019", "Interview Descriptions": "After being contacted by the manager, I was invited for an interview with the professor. This was all arranged in a nice and professional way. The interview itself was good, I was able to ask questions and get a chance to see how the lab was run and what the philosophy of the professor is.", "Interview Questions": "Experience in techniques\r\nGeneral knowledge of the field\r\nExperience in general"}, {"date": "26 Mar 2021", "title": "Call Center Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Rush University Medical Center (Chicago, IL) in Feb 2019", "Interview Descriptions": "Basic customer service experience is needed, very helpful to have references. It was one on one 30 minute interview involving questions related to customer service. How to react in high intensity situation.", "Interview Questions": "What steps would you take to de-escalate a situation?"}, {"date": "21 Jan 2019", "title": "Pharmacy Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Rush University Medical Center", "Interview Descriptions": "The Human Resource Department called me and set up an interview. I had an Interview with Human Resource and I then spoke to the management team of the pharmacy department.", "Interview Questions": "They asked standard interviewing questions. "}, {"date": "17 Jan 2019", "title": "Registered Nurse Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Rush University Medical Center in Jan 2019", "Interview Descriptions": "I contacted the unit director and applied online. I did my immersion on this floor, so I already knew the staff. I went to HR to pick up my packet, and they gave me directions to the unit. The interview consisted of about 10 behavioral questions, asking for specific situations. We went over my resume and experience.", "Interview Questions": "What was a time that a patient wasn't following the plan of care, and what did you do?"}, {"date": "21 Feb 2022", "title": "Physician Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Rush University Medical Center (Chicago, IL) in Jan 2019", "Interview Descriptions": "Went in to see HR for the first interview, asked me basic job questions. Then went to meet with someone from department to learn more. Was invited to another interview with the doctors of the clinic on another day, walked through the clinic. They were very through and nice.", "Interview Questions": "Why do you want to work in this field?"}, {"date": "14 Jun 2023", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 3 months. I interviewed at Rush University Medical Center (Chicago, IL) in Jan 2019", "Interview Descriptions": "the professor wanted to know if I am a fast learner and hard worker and if I can work in a team setting. He wanted someone who can work independently after training", "Interview Questions": "Tell me about yourself. What techniques do you know? When can you start?"}, {"date": "18 Dec 2018", "title": "Research Tech II Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Rush University Medical Center", "Interview Descriptions": "The initial meeting was with the HR department. After that there were individual interviews with supervisors and individuals with whom I would be working. After that I received no updates until I reached out and found that I would not be hired - later received an offer for the same job.", "Interview Questions": "Describe your previous work experiences/how they qualify you for this job"}, {"date": "17 Oct 2018", "title": "Administrative Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Rush University Medical Center (Chicago, IL) in Oct 2018", "Interview Descriptions": "After submission of my application I received a call from HR for a brief phone interview. During that call an in-person interview was scheduled.  The in-person interview was very professional. I meet with the HR person I spoke to then they walked me to the department the job I applied to was in.", "Interview Questions": "What makes you the ideal candidate for this position?"}], [{"date": "25 Oct 2020", "title": "Anesthesia Technician Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Rush University Medical Center (Chicago, IL) in Oct 2018", "Interview Descriptions": "Very friendly and eager to get you started working. Unfortunately I had to decline the offer because they wanted me to start within two weeks and I needed at least a month to relocate from LA.", "Interview Questions": "What kind of experience do you have in the OR and clinical setting? "}, {"date": "28 Sept 2018", "title": "Registered Nurse, BSN Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 7 weeks. I interviewed at Rush University Medical Center (Chicago, IL)", "Interview Descriptions": "I applied online and got an email to set up an interview 3-4 weeks later. There was some miscommunication about my initial interview. It was all set up but on the day of it they had to change the date. Finally when the interview came I had an interview with HR and department supervisor. It all probably took 45min to 1hr. After the interview they said I would get a response in 1 week. I waited almost 3 weeks to get a response. I had to email HR and the department supervisor 2 times to get an answer.", "Interview Questions": "What is most rewarding about nursing?"}, {"date": "27 Sept 2018", "title": "Registered Nurse - Operating Room Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Rush University Medical Center", "Interview Descriptions": "Very quick. Applied, and the following day I received a call from unit manager for a phone interview, then HR set up and in person interview within 2 weeks later.", "Interview Questions": "Why OR?"}, {"date": "25 Sept 2018", "title": "Pct Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Rush University Medical Center", "Interview Descriptions": "I applied online. I got a call from a recruiter, who was really nice and gave me some key points to mention during the interview with the unit manger.", "Interview Questions": "How do you handle difficult patient? "}, {"date": "9 Aug 2018", "title": "Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Rush University Medical Center", "Interview Descriptions": "Great HR. The process was smooth and organized. HR was a bit slow to respond but overall had no issues. Management was great and in contact with them. Orientation for hospital was lengthy but typical of the hospital environment", "Interview Questions": "Why should we pick you for this role?"}, {"date": "16 Nov 2018", "title": "Program Manager, Institute for Translational Medicine Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Rush University Medical Center (Chicago, IL) in Aug 2018", "Interview Descriptions": "In late-August I was contacted by the human resources talent acquisition consultant to schedule an in-person interview. I met with two Principal Investigators who asked me questions for ~1-hour in regard to my background and the job position. The evening of my interview, I was requested to complete a 5 person reference check and was contacted by the HR consultant 1-month later letting me know I was still a top candidate. After following-up 5 times with the PIs on the project and HR, I have not received any updates. It was not a pleasant interview process.", "Interview Questions": "Sample question asked: How do you manage your workload and competing priorities?"}, {"date": "18 Jul 2018", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Rush University Medical Center", "Interview Descriptions": "Epi Research assistant at Healthy Aging Program. Set a phone call with director. If accepted, there will be a training. After the training, it is the face to face interview.\r\nBut ACCUTUALLY, we only work at Rush but paid by other institutions.", "Interview Questions": "Five-year career plan"}, {"date": "1 Mar 2022", "title": "Finance Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Rush University Medical Center (Chicago, IL) in Jul 2018", "Interview Descriptions": "Phone screen with HR, phone screen with Hiring Manager, in-person with Hiring Manager and two additional leaders from Corporate Finance. Additional writing sample was required. Offer was made within two weeks.", "Interview Questions": "Why do you want to work here?  What do you know about Rush? How do you handle conflict in the workplace?"}, {"date": "20 Jul 2018", "title": "Patient Care Technician Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Rush University Medical Center in Jun 2018", "Interview Descriptions": "Very routine; 38 questions on a skills assessment and interview after. Recruiter was very nice, it all seemed like a fluid positive interview. Still waiting to hear back from them.", "Interview Questions": "Why do you want to be a PCT?"}, {"date": "29 May 2018", "title": "Patient Care Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Rush University Medical Center (Chicago, IL) in May 2018", "Interview Descriptions": "I interviewed two supervising directors on the same day.  First interview was great! Loved the director and I could really tell they cared about their unit.  Second was a little bit different - hard questions to answer.", "Interview Questions": "Where do you see yourself 5 years from now? "}], [{"date": "24 Feb 2022", "title": "Housekeeper Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Rush University Medical Center (Chicago, IL) in Apr 2018", "Interview Descriptions": "I met with head of housekeeping and then with a shift manager after background check I did a drug test administered in the hospital. after a month I was doing training modules", "Interview Questions": "Do you have previous experience in this department"}, {"date": "3 Aug 2022", "title": "Data Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Rush University Medical Center (Chicago, IL) in Mar 2018", "Interview Descriptions": "Met with team members , and largely focused on background and previous experience. Epic Knowledge is a huge plus, technical questions were database related… there was a really easy Excel Test too.", "Interview Questions": "Epic experience, and experience with relational databases. "}, {"date": "25 Mar 2018", "title": "Clinic Resource Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Rush University Medical Center (Chicago, IL) in Mar 2018", "Interview Descriptions": "Was contacted via email from a recruiter for a phone interview. Phone interview on 3/23. Interview seemed to be going well until I was asked my salary expectations. The recruiter seemed a little taken back when I gave her my response. The recruiter told me this position pays High Teens-Lower 20’s. Seemed like the interview ended on that note. I was told that the salary I was requesting would need to be approved and that if it’s approved I’ll receive a call for an on-site interview. I won’t hold my breath...", "Interview Questions": "Describe a time when you had to deal with an irate customer?"}, {"date": "28 Mar 2018", "title": "New Grad RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Rush University Medical Center in Mar 2018", "Interview Descriptions": "Had phone interview with general questions about current and long term interests, how I would handle some situations. Then met with a panel of 3 people who asked a lot more about background and clinical. Lots of questions about how to work with people of different types and problem solving. It was a little difficult since they were all asking questions but everyone was very friendly. They got back to me about it really quickly.", "Interview Questions": "Tell me about a time you had a difficult time with a patient."}, {"date": "26 Feb 2018", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Rush University Medical Center in Feb 2018", "Interview Descriptions": "So I interviewed for a Neuroscience staff nurse medical position. The interview was by far one of the worst interviews I’ve ever had. The director and assistant director are very unprofessional. They were 30 mins late to the interview. They didn’t give eye contact. They were fidgeting and playing with objects while interviewing candidates. They showed no hospitality. They were rude and their actions need to be held accountable. This is not a team/organization I would like to join.", "Interview Questions": "How many times have you called off within the last 12 months"}, {"date": "4 Jan 2018", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Rush University Medical Center", "Interview Descriptions": "Great interview process. It was very engaging and informative for a entry level position. I think the organization did a great job of recruiting candidates. It was very straight forward yet intense for an entry level position.", "Interview Questions": "What are your strengths?"}, {"date": "18 Dec 2017", "title": "Anonymous Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Rush University Medical Center (Chicago, IL) in Dec 2017", "Interview Descriptions": "Process was long. Applied online received an email to set up a phone interview about a week later. Had phone interview almost 2 weeks later and received an email about 2-3 weeks after that to schedule skills assessment. Took assessment and scheduled next interview same day as assessment which was for the next week. Had interview with 2 hiring mangers received phone call 2 days later with job offer.", "Interview Questions": "What do you do in your current job?"}, {"date": "29 Nov 2017", "title": "RN Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Rush University Medical Center (Chicago, IL) in Nov 2017", "Interview Descriptions": "I applied online and about 3 weeks later, I got an email for an interview request. I met with HR, signed in, they gave me a parking voucher and a map to the unit I was interviewing for. My interview was with the manager and assistant manager of the unit. It was a friendly environment and I was comfortable speaking with them. I didn't get to tour the unit but the nurse that let me in was very nice. I got the sense that the unit was very team-oriented, which they actually stressed a lot during the interview. Overall, it was a pretty easy interview with really great people.", "Interview Questions": "How did you deal with someone that was different than you?"}, {"date": "1 Dec 2017", "title": "Hospitalist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 4 weeks. I interviewed at Rush University Medical Center (Chicago, IL) in Nov 2017", "Interview Descriptions": "Scheduling interview took a month, but interview day itself was nicely coordinated. A couple of interviews were conducted via telephone, but rest were conducted face to face. Recruiter was very helpful.", "Interview Questions": "Why do you want to be a hospitalist here?"}, {"date": "3 Dec 2017", "title": "Registered Nurse Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Rush University Medical Center (Chicago, IL) in Nov 2017", "Interview Descriptions": "Interview went very well. All staff members were very welcoming. I was able to shadow in the operating room for a little bit after the interview process was over.", "Interview Questions": "Why do you think you are the best candidate for this role?"}], [{"date": "9 Nov 2017", "title": "Phlebotomy Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Rush University Medical Center (Chicago, IL) in Nov 2017", "Interview Descriptions": "After applying online. 3 weeks later i got an rush interview invitation. Then they sent me my rush interview date and reference link 3 days prior. Went to my interview now waiting on a call back", "Interview Questions": "Tell me about yourself"}, {"date": "19 Oct 2017", "title": "Phlebotomist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Rush University Medical Center (Chicago, IL) in Oct 2017", "Interview Descriptions": "Applied online.  Was emailed 2 days later with interview invitation. Had to give references prior to interview. Had my interview and got a call back with offer the next week.", "Interview Questions": "What does accountability m am to you?"}, {"date": "5 Jan 2018", "title": "Medical Coder Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 3 months. I interviewed at Rush University Medical Center (Chicago, IL) in Oct 2017", "Interview Descriptions": "It was a 2.5 month process, speaking with both first level recruiter, HR and then final interview with department supervisor.  Everyone throughout the process was very welcoming and friendly.  \r\nI was considered for a few different roles during the process (Coder, Auditor, Supervisor).\r\nWhile an offer was made there were a few items (ex. school partnership/project) which could not be met by Rush, which made the decision to decline difficult, but necessary.  Discussions were left open ended upon project completion and graduation.  I look forward to speaking with them later this year regarding possible employment.", "Interview Questions": "What would it take for me to leave my current job (in terms of $)?"}, {"date": "29 Mar 2021", "title": "General Surgery Clerkship Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Rush University Medical Center (Chicago, IL) in Sept 2017", "Interview Descriptions": "The process is lengthy. The applicant has about 4 interviews. The applicant will have to meet with the current coordinator, directors, and administrators. Then you have to pass a drug test and an excel test.", "Interview Questions": "Why do you want to work with medical students? "}, {"date": "24 Aug 2017", "title": "Clinical Research Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Rush University Medical Center (Chicago, IL) in Aug 2017", "Interview Descriptions": "Had a phone interview with the hiring director, then with HR to set up an in person interview. The in person interview took about 4 hours. I met with HR, then people that I would be working with (Research coordinators, research nurses, regulatory team and then the hiring manager who I spoke on the phone with) they told me I would hear back in a week and if not to contact them. I contacted them after a week and was told I was a top candidate but they were still waiting to make a decision. Have not heard back yet", "Interview Questions": "N/A"}, {"date": "1 Aug 2017", "title": "Clinical Research Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Rush University Medical Center", "Interview Descriptions": "Was required to meet with recruiter prior to interview. Waited over an hour for this person to get me face to face with PI. Interview was a little rushed otherwise fine.", "Interview Questions": "Why haven't you chosen a research area to concentrate in?"}, {"date": "3 Aug 2017", "title": "Registered Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Rush University Medical Center (Chicago, IL) in Jul 2017", "Interview Descriptions": "the interveiw process is long but easy going the people make it so comfortable. it was a great enviroment. you interveiw with 3 managers then you go to seleted departments for you and interveiw with a lead or manager for that department", "Interview Questions": "why do you choose to work for rush."}, {"date": "10 Jul 2018", "title": "Nursing Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Rush University Medical Center (Chicago, IL) in Jun 2017", "Interview Descriptions": "It was very long, almost 2 hours. Interviewed with the director of nursing and nursing manager of the floor. They were pleasant to talk to, a LOT of behavioral questions. Give me an example of a time when you did this and that, etc. Applied online, did a phone interview, then almost 5 months later, got a call for the in -person interview.", "Interview Questions": "Why Rush?"}, {"date": "10 May 2019", "title": "Lab Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Rush University Medical Center (Chicago, IL) in Jun 2017", "Interview Descriptions": "The interview was quick but thorough. The interviewers would ask questions pertaining to the position and why the applicant wishes to work there. They also addressed all responsibilities and conditions up front in case there should be any conflict. It felt more like a conversation, and the atmosphere was friendly and open. The only issue, is that it takes a while to hear back from the company after the interview.", "Interview Questions": "What do you believe are some traits that you have that may benefit our workplace and why?"}], [{"date": "17 May 2017", "title": "RN I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Rush University Medical Center in Apr 2017", "Interview Descriptions": "The whole process was pretty seamless. I first went to HR thinking I'd get an interview with HR but was told to go directly to the floor. There, I interviewed with 2 managers, both whom were very friendly. I instantly felt less intimidated because they were so friendly and personable. They assured me that they would get back to me by the end of next week (so the overall process of scheduling and hearing back was about 3.5 weeks).", "Interview Questions": "What type of research have I been involved in? (specifically regarding quality of care)"}, {"date": "4 Apr 2017", "title": "Pct II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Rush University Medical Center", "Interview Descriptions": "Needed to pass a test before interview with HR, went straight to interview with unit director after interview with HR. Each interview was one to one. Needed to give 3 references.", "Interview Questions": "\"Tell me how you dealt with stress?\""}, {"date": "16 May 2017", "title": "Medical Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Rush University Medical Center (North Chicago, IL) in Apr 2017", "Interview Descriptions": "They were very friendly there. The Interview was nice and brief. They mainly focused on personal questions and questions about my daily life and how i feel about the commute.", "Interview Questions": "Are you comfortable with the traffic?"}, {"date": "11 Jul 2017", "title": "Clinical Nurse Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. I interviewed at Rush University Medical Center (Chicago, IL) in Apr 2017", "Interview Descriptions": "I interviewed for the NICU. It took about two weeks after I applied to receive an e-mail from HR to schedule an interview. Then another week to actually coordinate and schedule it. When I arrived on the day of my interview, the HR rep was running late. By the time I completed an interview with HR, I had been there for 90 min. They then sent me upstairs to the NICU. I waited another half hour, then was given a tour of the unit and interviewed as we walked. Then I was given the third portion of the interview, which was with the assistant unit directors. That lasted about an hour. I was there nearly 4 hours total for the interview. Lots of behavioral interview questions.", "Interview Questions": "Do you subscribe to any nursing journals or organizations relevant to this job?"}, {"date": "10 Feb 2017", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Rush University Medical Center (Chicago, IL)", "Interview Descriptions": "Overall process took about 4 weeks. First is a screen phone call. Then an in person interview with the recruiter and then the unit managers. It was a great experience and now I am so ecstatic to START!!!\r\nThey also asked for references and transcripts from school.", "Interview Questions": "Why Rush?"}, {"date": "21 Aug 2017", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Rush University Medical Center (Chicago, IL) in Feb 2017", "Interview Descriptions": "It was pretty lengthy in my opinion. It was over a month before I actually started. I went through a three part process. Over the phone screening, interview with recruiter and then interview with hiring manager.", "Interview Questions": "Why do you want to work at Rush.? What are your goals?"}, {"date": "9 Feb 2017", "title": "Patient Care Technician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Rush University Medical Center (Chicago, IL) in Feb 2017", "Interview Descriptions": "I had a phone interview today and the HR recruiter was very professional and friendly. I was told I've been selected to interview with the unit director just waiting for a call.", "Interview Questions": "How do you handle stress in the work place?"}, {"date": "31 Jan 2017", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Rush University Medical Center (Chicago, IL) in Jan 2017", "Interview Descriptions": "I applied online and received an email with a request for times to arrange interviews. They then arranged a phone interview with a recruiter and an in-person with the managers of the unit. Very kind and asked engaging questions. All together a great experience, I haven't received an offer yet but I did just interview today.", "Interview Questions": "They asked me if I ever feel taken advantage of by my co-workers because I tend to be very helpful."}, {"date": "30 Mar 2021", "title": "Diagnostic Medical Sonographer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Rush University Medical Center (Chicago, IL) in Jan 2017", "Interview Descriptions": "Online process  then waited for a call then phone call and them a personal interview met with the director and then the manger and then the supervisor  questions where asked and my skills  where discussed", "Interview Questions": "How well did I know ob/gyn"}, {"date": "19 Dec 2016", "title": "Patient Care Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. The process took 1+ week. I interviewed at Rush University Medical Center (Chicago, IL) in Dec 2016", "Interview Descriptions": "I applied online 3 months before I receive a call from a recruiter I took a 38 question test that I passed. After passing the test I was set up for a interview with the director of the unit I would've been on", "Interview Questions": "How experience do you have in this field"}], [{"date": "25 May 2018", "title": "Patient Services Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Rush University Medical Center (Chicago, IL) in Dec 2016", "Interview Descriptions": "I was a student at Rush University.  The director of my program knew the director of my current department. She kept me in mind and gave my resume to my current manager. I was contacted via email to come in for an interview. I had two interview sessions, one with the leads of the call center and greeter position and one with the manager. I then went to HR and had to take a terminology test. Then I had to take a drug test and background check.", "Interview Questions": "Can you multitask\r\nAre you adaptable to change\r\nAre you an independent worker or team oriented\r\nAre you flexible to work different hours\r\n\r\n\r\n"}, {"date": "17 Sept 2016", "title": "Nurse Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Rush University Medical Center", "Interview Descriptions": "The interview process was what I would consider the standard for a healthcare system. Applied online and then waited to hear back from HR. HR contacted me about two weeks after I applied and I was scheduled for my HR interview in two weeks. After the HR interview, I was then scheduled for another interview with some of my future coworkers and then waited to hear back from HR, which took about two weeks.", "Interview Questions": "If we were to ask your previous manager, what three words would they use to describe you?"}, {"date": "29 Aug 2016", "title": "Pct Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Rush University Medical Center (Chicago, IL)", "Interview Descriptions": "First there was an online application with took about 30 minutes.  Then second, it was a phone call for an interview with Human Resources.  Then thirdly scheduled an one on one interview with the Director of the department.", "Interview Questions": "What clinical experience do you have?"}, {"date": "17 Jul 2016", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Rush University Medical Center in Jul 2016", "Interview Descriptions": "I applied 2 months before I received an email to interview. The entire scheduling process was through email. On the day of the interview, I went to HR, and received a packet with directions to the unit. The interview was one-on-one. Lasted about an hour. I'm still waiting to hear back. She said it would be a few weeks before HR contacted me.", "Interview Questions": "How would hiring you benefit our patients?"}, {"date": "18 Nov 2016", "title": "Physician Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Rush University Medical Center (Chicago, IL) in Jun 2016", "Interview Descriptions": "The interview process was long, but at the end of it I really felt like I had a good sense of who I would be working with and what the duties of the job entailed. I believe this is unique, as I often found myself being offered positions in which I had maybe met two or three people I would be working with/for and never felt completely comfortable accepting the position without more information/Face time with other employees. The interview process started with an online application followed by a phone interview. After the phone interview HR contacted me to set up an in person interview. First in person interview lasted all day and I met 10-15 different people for 30 minute interview slots. Then, I was contacted by the manager of the department to set up a second interview with people in leadership positions and a few other department members. A few days after, I received a phone call from HR offering me the position. The whole process took 1 month from online application to offer. Interview was professional yet casual feel with maybe a handful of typical interview questions, but most of all it was just a conversation about the position and an opportunity for the department to get to know you.", "Interview Questions": "Why do you want to work at Rush?"}, {"date": "12 Aug 2016", "title": "Staff RN Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Rush University Medical Center (Chicago, IL) in May 2016", "Interview Descriptions": "The hiring process for a new grad was very easy. I applied online and then had a call after a week. First interview was with an HR recruiter and the second with the directors of the unit I applied for. I was notified for an offer, but turned it down. Rush seemed nice, but I chose to go to another hospital that was a \"better fit\". From their questions, it didn't seem like the unit was going to be very supportive as a new grad.", "Interview Questions": "Tell me about a time when you didn't get along with a colleague and how you handled it."}, {"date": "28 Feb 2017", "title": "Supply Chain Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 4 weeks. I interviewed at Rush University Medical Center (Chicago, IL) in May 2016", "Interview Descriptions": "Process took 4 weeks. Applied online, then two face to face interview with Hr and Hiring Manager. the week after. I Had to take a math test. Overral an smooth process", "Interview Questions": "Math Test\r\nTell us about yourself\r\nWhy do you want to work for Rush?\r\n"}, {"date": "12 Apr 2016", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. I interviewed at Rush University Medical Center (Chicago, IL) in Apr 2016", "Interview Descriptions": "Received an email requesting interview date and time. Short interview with recruiter, then met and interviewed with hiring manager. After that, I toured the department and met with the other nurses. Everyone was so welcoming and nice.", "Interview Questions": "Why are you leaving your current position?"}, {"date": "31 Jul 2017", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Rush University Medical Center (Chicago, IL) in Apr 2016", "Interview Descriptions": "First, you'll get a call from a recruiter in the HR department. Then you meet with the lab manager and then 2-3 coordinators. the whole process takes about 5 hours to complete. Only one in-person interview. got a call back about 2 weeks later.", "Interview Questions": "why do you want this job?"}], [{"date": "30 Nov 2018", "title": "OT Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Rush University Medical Center in Mar 2016", "Interview Descriptions": "I applied online and got a call to interview a few weeks later, interview was with a panel consisted of rehab manager and OTs, they asked both clinical and situational questions. Everyone seemed friendly and competent.", "Interview Questions": "why OT?"}, {"date": "8 Feb 2017", "title": "NA II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Rush University Medical Center (Chicago, IL) in Mar 2016", "Interview Descriptions": "First applied online, the HR rep was wonderful, met with her at first. Since I was in my fourth term of nursing school many of the units were looking more for 2nd term since they could keep them longer. The HR rep made me a position with CSO (clinical staffing) and after that interview I met with the unit director and was offered the position! great process overall", "Interview Questions": "Why Clinical Staffing (float)?"}, {"date": "17 May 2017", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Rush University Medical Center in Jan 2016", "Interview Descriptions": "This horrible place ask to do more interview rounds than any other place in the world. It has a phone interview, writing three papers, 2 whole day MOCK trainings, and a reference check. And what's most funny thing is that, after you go thru all these, you get a $12/ hour PART-TIME JOB. People can wait tables and make twice as much, so bachelors and masters should stay away from wasting all your time.", "Interview Questions": "do you speak Cantonese"}, {"date": "15 Jan 2016", "title": "Supply Chain Data Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Rush University Medical Center (Chicago, IL) in Dec 2015", "Interview Descriptions": "Interview process was standard. Phone interview completed, followed by a face to face interview. Face to face consisted of Supply Chain Data Coordinator Manager, then a one on one with the Supply Chain Director.", "Interview Questions": "How would you handle an unsatisfied or irate client?"}, {"date": "9 Sept 2016", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Rush University Medical Center (Chicago, IL) in Dec 2015", "Interview Descriptions": "1st phone interview (interviewed originally for medical assistant position, but the recruiter saw my education background was more admin. She asked me if I wanted to pursue a clinical or admin career. I told her admin and she asked me to apply for different position and referred my resume to another recruiter.\r\n2nd in-person interview \r\n3rd offer (negotiations)\r\n4th skills assessment on Microsoft Office", "Interview Questions": "What was one thing or person you had conflict with and how did you handle it?"}, {"date": "29 Mar 2016", "title": "Patient Care Technician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Rush University Medical Center in Nov 2015", "Interview Descriptions": "Must complete and score at least an 80% on an approximately 20 minute multiple choice electronic assessment of Patient Care Technician relevant skills before proceeding to the face-to-face portion of the interview.", "Interview Questions": "I scored a 79% percent and was not considered further so received no questions. Very friendly and professional environment, but brush up on your CNA course material fairly well before your interview date."}, {"date": "15 Oct 2015", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at Rush University Medical Center (Chicago, IL)", "Interview Descriptions": "You'll interview with PIs and sometimes other research assistants. There aren't any crazy, challenging, trick questions. Just make sure you come across as motivated and excited about the research. Be prepared for a drug test and health screening (i.e., do you have your vaccinations) if you get an offer.", "Interview Questions": "You'll likely be asked about your previous research experience, as well as your experience working with urban populations. Just prepare for these, and you'll be fine! Also, be prepared to talk about your interest in PhD programs. They're not going to want to invest in you if you don't want to go the PhD route."}, {"date": "27 Nov 2015", "title": "Clinical Coordinator II Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Rush University Medical Center (Chicago, IL) in Oct 2015", "Interview Descriptions": "It was brief, felt like the interviewer already set in her mind that she didn't want to hire me by the way she was acting.  I had been working in the position as a temp for two months but didn't get the job because the doctor I was working for wanted some one more aggressive than", "Interview Questions": "What is my greatest strength"}, {"date": "8 Dec 2017", "title": "Temporary Support Associate Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Rush University Medical Center (Chicago, IL) in Oct 2015", "Interview Descriptions": "Received an email after a month of applying online requesting a phone interview. Scheduled a phone interview with HR within a week.  The process was easy but extremely lengthy.", "Interview Questions": "Standard questions relating to previous positions and your skills.  HR representative was pleasant and not intimidating. Did not ask situational questions. "}, {"date": "7 Nov 2015", "title": "Research Assistant- RES F Psychology Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Rush University Medical Center (Chicago, IL) in Sept 2015", "Interview Descriptions": "I had an interview scheduled with HR at 11:00 am. I got there about 15 minutes prior to the time and told the receptionist I had an interview with Terrance. I was directed to sign in and have a seat. There appeared to be 2 other  people scheduled to meet with him before me.  I was not seen by the HR person that scheduled my interview for 11:00 am until about 12:45pm. After waiting nearly 2 hours past my scheduled time, I was offered no apology for the blatant waste of my time and disrespect. Then I was asked to read and sign paper while tried to ask me questions at the same time. Maybe it was a competency test, but I was unable to do both. I ended only having a chance to answer 1 question before he took me over to meet with the project manager of the study. It was clear the project manager made her decision about me before I was asked any questions.", "Interview Questions": "Would you say that you're someone people are comfortable speaking with?"}], [{"date": "5 Feb 2016", "title": "Billing Coordinator Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Rush University Medical Center (Chicago, IL) in Sept 2015", "Interview Descriptions": "The interview process is thorough but not overwhelming. I first met with HR to go over my resume/application. That lasted about 10/15 minutes, I was then taken over to the department. Once at the department, I was escorted to three or four different people who conducted interviews that were about fifteen minutes each. Everyone I met with was great, which made the interview process easier than I had anticipated.", "Interview Questions": "The first part of the interview was specific, position related questions. They were pretty basic questions, just making sure you know your stuff. Most of it was small talk and them explain the position to me. Since I had experience and was still employed, most of them asked why I would leave my current company and what I could bring to Rush."}, {"date": "2 Aug 2015", "title": "Patient Access Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Rush University Medical Center", "Interview Descriptions": "The hiring process was simple and easy. The questions were not that hard and the supervisor made me feel comfortable. The interview did not last longer than 20 minutes. You will be given a your of the facility to get a better feel of the job.", "Interview Questions": "What is a copay, deductible and co-insurance?"}, {"date": "8 Oct 2015", "title": "Research Assistant II Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Rush University Medical Center (Chicago, IL) in Aug 2015", "Interview Descriptions": "I applied online and received an e-mail regarding an interview within two weeks. The interview process consisted of meeting with four different people: a person from HR, the head of the research department, the head of clinical trials, and the head of the epidemiological trials. All were extremely nice and friendly. \r\n\r\nFast forward a couple months and I have not heard back since despite attempts to contact them. I assume that I did not get the position. It would have been a positive experience if they would have at least notified me that I was not chosen.", "Interview Questions": "What is a specific example of teamwork in your previous positions?"}, {"date": "25 Jul 2015", "title": "Pharmacy Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Rush University Medical Center (Chicago, IL)", "Interview Descriptions": "A tech has to take a preliminary test  first before they can interview with an HR agent. After if they like you, you will ne granted a second interview with a Pharmacy Managers.", "Interview Questions": "What makes you qualified than other people on this specific job?"}, {"date": "29 Jul 2015", "title": "Patient Access Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Rush University Medical Center (Chicago, IL) in Jul 2015", "Interview Descriptions": "I applied online which was a pretty easy application which required an assessment after completion. About two weeks later I was asked to come in for a interview. I took a medical terminology test and typing test. I also signed an agreement for a background check that same day. I met with my two potential supervisors and they both interviewed me together. The interview was around 45 minutes (which we went over the allotted time because someone from HR peeped in twice to wrap up). After the interview 2 days later I was asked to submit 5 references via a website link. That was 4 days ago, got a call earlier today for a offer.", "Interview Questions": "Tell me a time you were in a conflict with a co-worker and tell me how you handled it?"}, {"date": "14 Sept 2016", "title": "RUMG Access Center Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Rush University Medical Center (Chicago, IL) in Jul 2015", "Interview Descriptions": "The interview process was very formal. The same questions where asked several times just in different ways. The person that conducted my interview was very soft spoken which my the process so much easier and less stressful.", "Interview Questions": "Why do you want to work for Rush?"}, {"date": "25 Oct 2017", "title": "Care Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Rush University Medical Center (Chicago, IL) in Jul 2015", "Interview Descriptions": "Met with management, staff from my floor.  Mostly informational, few questions for me.  Preceded by a phone interview.  Questions on practice experience and some hypothetical questions.  Process went very quickly.", "Interview Questions": "Are you comfortable with a job that is primarily discharge planning?"}, {"date": "28 Aug 2015", "title": "Support Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at Rush University Medical Center (Chicago, IL) in Jun 2015", "Interview Descriptions": "The recruiter contacted me via phone. We set up a time for me to come in for the interview. I had to take excel, word, and a typing test, then I after I met with the recruiter for the interview portion. You are given your scores from the testing during the interview. After the interview, I was set up for background/drug test/blood draw. After the results came back I was contacted again and told that I had the position.", "Interview Questions": "Tell them about yourself."}, {"date": "1 Oct 2015", "title": "Registered Respiratory Therapist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Rush University Medical Center (Chicago, IL) in May 2015", "Interview Descriptions": "Was called by HR, had interview set up with Department. Was made an offer by HR and told to come in a few weeks later for Orientation. Had to go in several times to get all paperwork done. Had to bring in proof of all degrees, licensure, testing, etc. Had to pass Health Screening.", "Interview Questions": "describe a difficult work situation and how you handled it.\r\nHave you ever made mistakes and how did you handle it"}, {"date": "10 Mar 2015", "title": "General Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Rush University Medical Center", "Interview Descriptions": "Spoke to recruiters at Career Fair. Asked them questions about their company, such as flexibility with transitioning potential employees and characteristics they looked for when hiring someone.  The interview process was similar to a \"normal\" job interview.  There was not a set-time (appointment).  Just a time range.  Otherwise, it was like other interviews, I've been on.  The setting was not as formal.", "Interview Questions": "What was my work history."}], [{"date": "22 Feb 2015", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 5 weeks. I interviewed at Rush University Medical Center (Chicago, IL)", "Interview Descriptions": "Was contacted via email with an invitation for an interview sent by HR. Day of interview I met with a recruiter who was extremely nice and helpful. I called her often regarding the interview process. She directed me to the NICU where I met with the assistant unit director who gave me a tour of the unit and then asked me questions. After the interview, I didn't hear for over a month what my status was and had to call several times to get any information. The only person who ever answered was the recruiter.", "Interview Questions": "Why Rush?"}, {"date": "15 Jun 2017", "title": "Clinic Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Rush University Medical Center (Chicago, IL) in Mar 2015", "Interview Descriptions": "I met with the manager just once after a brief HR phone interview. She had actually already hired somebody for the position that I applied to. However, since I was recommended by somebody else she considered me for another position. She was very easy to talk to.", "Interview Questions": "Why do you want work here?"}, {"date": "12 Feb 2015", "title": "Nursing Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Rush University Medical Center in Feb 2015", "Interview Descriptions": "The HR interview is first, which is very simple with just a few questions. The interview with the unit is much more time intensive. Mine was with 2 people, a unit director and an assistant unit director. Be prepared for behavioral interview questions! You must have situations or stories instead of just general answers, or they will tell you to say a new answer.", "Interview Questions": "Describe a time you made a mistake, what happened?"}, {"date": "30 Sept 2016", "title": "Nuclear Medicine Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Rush University Medical Center (Chicago, IL) in Jan 2015", "Interview Descriptions": "They were very professional and kind. Made me feel at ease and comfortable as well. They were punctual and did not keep me waiting and were not condescending at all.", "Interview Questions": "Why they should hire me as compared to all the other applicants ?"}, {"date": "7 Oct 2015", "title": "Research Assistant Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Rush University Medical Center (Chicago, IL) in Jan 2015", "Interview Descriptions": "The process seems vague and secretive, the recruiters or hiring managers never set the tone of the interview. The Q&A portion of the interview started immediately without providing any insight on the position, work environment or company history.", "Interview Questions": "Standard questions, some behavioral "}, {"date": "11 Dec 2014", "title": "Staff Nurse Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Rush University Medical Center", "Interview Descriptions": "I had two interviews, one with the MICU and one with the CICU. My experience with the MICU was not a very positive one but things went very well with the CICU. I was first called for an interview, then I had to provide 5 references that they had to verify. Then I interviewed over the phone with HR, and interviewed in person with the managers of the respective ICUs. Waiting for an offer was the hard part. Rush took about 3 weeks to notify me of an offer. I actually didn't think I received one!", "Interview Questions": "\"How do I trust you're not going to leave us after a year because you're an investment?\""}, {"date": "9 Jan 2016", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Rush University Medical Center (Chicago, IL) in Dec 2014", "Interview Descriptions": "It took a while to break into the hiring system as a new graduate. When I did receive an interview, I went to HR and interviewed with a recruiter. Then he walked me over to the unit to interview with two managers. I would recommend requesting to shadow to get a good feel for the unit. The interview itself was straightforward and very typical of nursing interviews.", "Interview Questions": "How do you deal with conflict?"}, {"date": "22 Apr 2015", "title": "Health Administrator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 3 days. I interviewed at Rush University Medical Center (Chicago, IL) in Dec 2014", "Interview Descriptions": "I was interviewed by the whole department, however it was not as intense as i thought it would be. Everyone was very professional but down to earth and wanted to know more about me.", "Interview Questions": "What do you see yourself in the future?"}, {"date": "23 Jan 2017", "title": "Biomedical Equipment Technician II Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Rush University Medical Center (Chicago, IL) in Oct 2014", "Interview Descriptions": "I didn't really have an interview process I was working for a vendor and was offered a job. I was in the hospital repairing ventilators when I was approached by one there BMETs and was impressed by my knowledge of the machine so he told me to call his boss.", "Interview Questions": "To hold off on 2 other job offers"}, {"date": "22 Jul 2014", "title": "RN Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Rush University Medical Center", "Interview Descriptions": "Applied online and received call from nurse recruiter. Interviewed in person with nurse recruiter followed by unit manager and a nurse on the unit. Interview questions consisted of patient scenarios and the typical behavioral questions.", "Interview Questions": "Patient ethical situation you encountered and how did you deal with it."}], [{"date": "20 Jul 2014", "title": "Administration Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied through other source. I interviewed at Rush University Medical Center", "Interview Descriptions": "I was a intern with Rush University Medical Center and was offered a job after the completion of my internship. During my internship I worked with various people throughout the organization. In addition to, I learned a lot about the organization and attend meetings with top exective management.", "Interview Questions": "N/A"}, {"date": "10 Jun 2014", "title": "Staff Nurse Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Rush University Medical Center", "Interview Descriptions": "First you meet with HR recruiter and then the manager on the unit/department you are applying for.  They asked what was my greatest strength and greatest weakness.  If I have ever been penalized at work before.  Tell me about a time when you went above and beyond.", "Interview Questions": "The recruiter asked me if I was applying to any other hospitals in the Chicago area.  I wasn't expecting that question.    "}, {"date": "21 Mar 2018", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Rush University Medical Center (Chicago, IL) in Jun 2014", "Interview Descriptions": "I interviewed with HR and also the unit manager of the floor.  Was able to take a tour of the unit and talk to the charge nurse and ask some questions after speaking to the unit manager.", "Interview Questions": "Where do you see yourself in 5 years? Tell me about a time you had a difficult situation and how did you overcome it?"}, {"date": "6 Feb 2017", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Rush University Medical Center (Chicago, IL) in Jun 2014", "Interview Descriptions": "First there was a phone interview with HR which was a farly simple screening process verifying work history and experience, next I went in for an in person interview HR. This was fairly informal, basic interview questions and the same day I met with the unit manager for an in person interview. During this time I was walked around the unit and introduced to other staff RNs where I was allowed to ask questions.", "Interview Questions": "What is your experience?"}, {"date": "13 May 2014", "title": "Registered Respiratory Therapist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Rush University Medical Center", "Interview Descriptions": "Was first notified by email with a date and time for initial interview. Met with department personnel/ no HR present. Everyone was very professional. Standard Q & A related to the job/ several scenario based questions and some HR questions. Who is your customer? How did you resolve a conflict between coworkers?", "Interview Questions": "No difficult questions, they did run through several scenarios to test knowledge/critical thinking"}, {"date": "7 Jan 2016", "title": "Reference Librarian Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 3 months. I interviewed at Rush University Medical Center (Chicago, IL) in May 2014", "Interview Descriptions": "The process is very thorough!  First there is an online assessment, then a phone interview, and then an in-person interview during which a candidate has to give a tutorial-type presentation.  It takes a long time to go through all of these steps but they have little turnover so it must work for them.", "Interview Questions": "Basic interview questions about previous positions, experience, etc."}, {"date": "29 Apr 2014", "title": "Research Coordinator Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Rush University Medical Center", "Interview Descriptions": "I applied online through the Rush employment website. They called me in for an interview after about a week. The interview process was pretty short and simple. Questions asked were mainly behavioral questions. The staff members were very nice and friendly. They got back to me with an offer within a week.", "Interview Questions": "Most difficult question was describing what your future goals are?"}, {"date": "30 Mar 2014", "title": "Clinic Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Rush University Medical Center", "Interview Descriptions": "Process takes 2 months if considered and one week to a month if not considered", "Interview Questions": "what is your weakness "}, {"date": "15 Dec 2015", "title": "Pct Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Rush University Medical Center in Mar 2014", "Interview Descriptions": "I interviewed with two people. The nurse supervisor and the assistance nurse supervisor. They played good cop bad cop. One was really nice while the other just sat back and looked at me with a blank stare.", "Interview Questions": "what are your strengths and weaknesses"}, {"date": "1 Feb 2014", "title": "Resident Physician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 9 months. I interviewed at Rush University Medical Center (Chicago, IL)", "Interview Descriptions": "It is the standard residency \"match\" process.  If granted an interview, there are about 5 interviews and they are one-on-one with some of the senior faculty.", "Interview Questions": "None.  The interviews were all very benign with questions like \"tell me about yourself\" or with questions asking me to elaborate on things listed on my CV."}], [{"date": "24 May 2015", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Rush University Medical Center in Feb 2014", "Interview Descriptions": "I went from being an unpaid intern to a paid research assistant so I did not have a formal interview. I would recommend coming very prepared for interviews at  Rush. Typically when we hire for a position a person will interview with at  least 3 people to determine their fit within our group.  Normally there is a second interview. Jobs at Rush tend to be difficult to come by so interviews are given at a employee referral basis mostly.", "Interview Questions": "No formal interview just promotion."}, {"date": "6 Jan 2014", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Rush University Medical Center (Chicago, IL)", "Interview Descriptions": "I endured two interviews for this position. They were a month apart. The interview did not go as planned. It seems as though the HR department dropped the ball, NOT the department for which I work. I interviewed with several people the first time, each in decreasing rank of importance. The second interview seemed unnecessary to hold in person. I was traveling from out of state. They offer absolutely no travel assistance and they seem unapologetic about it. Myself and former/current coworkers all feel as though the interviewers were not forthcoming with certain information about the job duties. One might even say that they purposely mislead interviewers into believing that the job is something that it is not. My best advice: ask as many questions as you can in as many different ways as you can for clarification purposes.", "Interview Questions": "\"Do you intend to continue your education in the field of [insert degree area]\""}, {"date": "6 Jan 2014", "title": "Tech II Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Rush University Medical Center", "Interview Descriptions": "Easy process, no real issues.", "Interview Questions": "I had a very informal interview, so I can't really say much."}, {"date": "5 Dec 2013", "title": "Accounting Clerk Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Rush University Medical Center", "Interview Descriptions": "I was already working for the company so when I applied for this position, the interview was more of an informative discussion about the job details and responsibilities.  The manager was very professional and I knew I wanted to work for her because she was very easy to talk to.", "Interview Questions": "Why should we hire you?"}, {"date": "30 Sept 2013", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied through an employee referral. The process took 3 days. I interviewed at Rush University Medical Center", "Interview Descriptions": "I was interviewed by three Directors, The Director of Johnston R. Bowman, The JRB Administrator and the Director of Health and Aging.", "Interview Questions": "I did not have any difficult questions."}, {"date": "24 Sept 2015", "title": "Project Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Rush University Medical Center (Chicago, IL) in Oct 2013", "Interview Descriptions": "I filed out the application online, and was contacting about a month later via telephone for the position. I received an itinerary that outlined what would take place during my interview.", "Interview Questions": "What role did I play in my last position."}, {"date": "22 Dec 2013", "title": "Medical Coding OutPatient Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 5 days. I interviewed at Rush University Medical Center (Chicago, IL) in Oct 2013", "Interview Descriptions": "Medical coding skills and memory electronic testing (no manuals)", "Interview Questions": "Nothing difficult or unexpected, the interviewer was very encouraging and professional."}, {"date": "11 Oct 2014", "title": "Project Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Rush University Medical Center in Sept 2013", "Interview Descriptions": "Very professional, organized, and structured interview process. You can tell that the company invests a ton of time in their recruiting process and values any and all opportunities to expand and grow their workforce. They will challenge you to make sure you meet their culture and leadership requirements, but they do so in a manner that is engaging and encouraging.", "Interview Questions": "Speak about a time in which you were faced with a difficult decision and how you managed to drive through meaningful change upon making that decision. "}, {"date": "1 Jan 2016", "title": "Pharmacy Technician Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 months. I interviewed at Rush University Medical Center (Chicago, IL) in Aug 2013", "Interview Descriptions": "Brief and to the point, i was asked about my previous employments and education. I was asked what experience and skills i had and what i can offer to their company if i was hired.", "Interview Questions": "Why i wanted to work there"}, {"date": "27 Oct 2016", "title": "Research Assistant II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Rush University Medical Center (Chicago, IL) in Aug 2013", "Interview Descriptions": "Talked with multiple levels of management and was given the opportunity to ask questions about the company during the interview. Also was asked about my research experience in undergrad.", "Interview Questions": "Why do you want to work with the geriatric population?"}], [{"date": "23 Jul 2013", "title": "IT Dweeble Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Rush University Medical Center (Chicago, IL)", "Interview Descriptions": "Interview process was very uncomfortable.   The questions about back ground and experience were of standard stuff, but I was very uncomfortable to learn I was expected to  spy on the the person I would report to (but secretly report up to the exec I interviewed with).", "Interview Questions": "Expectation that I was to spy on the person I reported to and make them uncomfortable with my expertise and experience.  "}, {"date": "12 Jul 2013", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at Rush University Medical Center (Chicago, IL) in Jul 2013", "Interview Descriptions": "The interview took approximately three hours.  You meet with a Department Manager, the Project Manager, and two Coordinators for the epidemiology studies.  The coordinator interview you at the same time.  All of them talked about the RADC and how it got started, the process for tracking the study participants and detail about all the studies for epidemiology and clinical trials in detail.  As an RA for RADC, your are only working with epidemiology not on clinical trails due to the need for complete focus on the clinical procedures and policies.", "Interview Questions": "How do you show initiative on the job?  This was very easy for me to answer and I know I got it right.  But, realistically, if someone did not show initiative on the job these days, you won't last very long with most employers and that will reflect in your work history."}, {"date": "7 May 2013", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Rush University Medical Center", "Interview Descriptions": "I met with the primary investigator of the studies I would be working on and got a tour of the department and lab. Once I was hired I had to attend orientation which was the first day of work. There was also a TB test and drug screening which is pretty standard for the health field", "Interview Questions": "What do you want to do after this position?"}, {"date": "4 Dec 2013", "title": "Project Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Rush University Medical Center (West Chicago, IL) in May 2013", "Interview Descriptions": "I received an e-mail with instructions to call and set up an interview. After the call I received an e-mail with instructions about the interview date I was scheduled for. After arriving for my interview I took some basic computer skills tests in a very cramped area. There were employees in cubicles on the phone that you could hear everything they were saying which I felt made it uncomfortable. Upon finishing I was instructed to wait in the lobby. I waited for 20 minutes then Interviewed with an HR representative in a very small cluttered office then was sent directly to the department to interview with the director and was not given directions to that department which was in a different building. Waited one hour to speak with him and that interview took about 15 minutes. He told me they were just starting interviewing for that position and I would hear back  in about 2 weeks to coordinate a call back interview. I waited a little over 2 weeks and heard nothing so I called HR to ask about the status and they told me they would get back to me. I received interviews and ultimately a job within the next month and never heard from anyone at Rush.", "Interview Questions": "How did you get here today? (I've been asked how traffic was before etc. but have never been directly asked how I got there)"}, {"date": "28 Aug 2017", "title": "Patient Care Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Rush University Medical Center (Chicago, IL) in Apr 2013", "Interview Descriptions": "It was quick after waiting to hear from them for a couple of months.  Took the test and had interview with HR then a department interview and I was in.", "Interview Questions": "They asked me basic interview questions about my background."}, {"date": "18 Jul 2016", "title": "Physician Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Rush University Medical Center in Apr 2013", "Interview Descriptions": "Met with medical director and the other physicians in my practice.  Prior to this there was a recruitment associate who emailed me and coordinated an interview.  After an initial meeting with the medical director I met with the 4 other providers. I also was invited to a group dinner.  After all of this I was offered a position and then met with the chair of the department to discuss salary and expectations.", "Interview Questions": "At the time I was a newly graduated resident.  I was asked about my interests."}, {"date": "19 Feb 2014", "title": "Secretary III Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Rush University Medical Center (Chicago, IL) in Mar 2013", "Interview Descriptions": "Very thorough interviewing process; I met with the recruiter first: wonderful, warm, encouraging human resource lady. She set up interviews with two different departments for me. She coached me on who I would be seeing. Physicians are very involved in the hiring process, which was nice. In each department, I met for a one-on-one with 1 administrative manager and approx 4 physicians.", "Interview Questions": "Because I mentioned I was a psych major in college, one of the docs quizzed me on photos of historical physicians on the wall. "}, {"date": "6 Dec 2016", "title": "Family Care Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Rush University Medical Center (Chicago, IL) in Jan 2013", "Interview Descriptions": "Phone interview and in person interview with the hiring manager. Typical interview questions and can you manage a high caseload. Can you do home visits in the community? Do you have a background working with a diverse group of clients? Do you have a car? Do you have a background working with kids?", "Interview Questions": "What experience do you have working with early intervention?"}, {"date": "29 Dec 2016", "title": "Certified Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Rush University Medical Center (Chicago, IL) in Nov 2012", "Interview Descriptions": "Welcoming as they gave me all the information of what could be expected of the organization and what was expected of me.  Also very motivational giving information for how the organization could help me in my future endeavors.", "Interview Questions": "Why I was looking for a new job?"}, {"date": "10 Aug 2013", "title": "Research Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 months. I interviewed at Rush University Medical Center (Chicago, IL) in Aug 2012", "Interview Descriptions": "The interview process was long and tedious. Work culture is very professional. HR department was supportive.", "Interview Questions": "Salary expectation!"}], [{"date": "3 Dec 2016", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Rush University Medical Center (Chicago, IL) in Jul 2012", "Interview Descriptions": "The interview process is actually rather simple. I applied for the position online, and the director of the department got in contact with me personally via email. He asked me to set up an interview time and date. Once I arrived, I was asked to wait in a small office. When the director was ready, he came in with my resume and cover letter, and we chatted and went through typical interview questions (e.g. tell me about yourself). Then we discussed my background and how I may or may not be a good fit for the job, and also about my career goals (especially with regards to the job I was interviewing for). Then that was it... I was told that he would be in touch with me once they have a decision.", "Interview Questions": "Q: How much recent experience do you have and what could you offer to us if we hire you?"}, {"date": "15 Jul 2012", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Rush University Medical Center (Chicago, IL) in Jun 2012", "Interview Descriptions": "Contacted via e mail. Never was called to confirm interview. All communication was done through e mail. Person contacting me for interview was not the person who interviewed me.", "Interview Questions": "I was asked which job i would prefer. This was difficult because my choice was between 2 jobs, if I gave an answer it could possibly prevent me from the other job."}, {"date": "1 Sept 2016", "title": "Pharmacy Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Rush University Medical Center (Chicago, IL) in May 2012", "Interview Descriptions": "Please prepare for a pharmacy calculation test.  This job requires you to do compounding and to know how to prepare your own calculations.  The interview consisted of basic questions and you have the opportunity to meet the staff as well.", "Interview Questions": "How would you handle difficult situations"}, {"date": "30 Dec 2013", "title": "Sonographer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 2 weeks. I interviewed at Rush University Medical Center in Mar 2012", "Interview Descriptions": "I faxed my resume because a contact said they might be hiring. I got a phone about a week later and was offered an interview. I had one interview and was offered the job about a week later. I interviewed with 3 people and met alot of the staff and toured the department.", "Interview Questions": "Why I was looking for a job. "}, {"date": "10 Jul 2013", "title": "Financial Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 3 months. I interviewed at Rush University Medical Center (Chicago, IL) in Jan 2012", "Interview Descriptions": "Three interviews, management took quite a long time to make a decision.", "Interview Questions": "Nothing comes to mind."}, {"date": "13 Mar 2013", "title": "Planning Analyst Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Rush University Medical Center (Chicago, IL) in Jul 2011", "Interview Descriptions": "The hiring and interview process was simple and standard. \r\n\r\n1. If interested, you will receive an e-mail from the HR department asking you for a telephone screening interview.\r\n2. Once that is completed, the Sr. Director will call you do a brief behavioral interview over the phone as well.\r\n3. There will be in person interviews schedule. You will have a behavioral interview with human resources first. Then you will be taken to the strategic planning area where you will meet with and be interviewed by the Sr. Director, Analyst, and Project Manager. You may meet and talk with the Associate VP as well. You may be asked questions about your analytical background and whether may be asked for some work examples.\r\n4. Upon completing this interview you will either be given an offer or someone will call and let you know that the team was not interested at this time.", "Interview Questions": "This was a simple interview. You may be asked about your analytical skills."}, {"date": "2 Apr 2011", "title": "Faculty Member Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Rush University Medical Center (Chicago, IL) in Feb 2011", "Interview Descriptions": "This was a typical faculty interview where I had dinner the night before and then had a day packed full of meetings with different faculty. I did a research presentation. Everyone seemed pretty nice. I haven't heard from them yet and have only been told that they are moving forward. It's been almost 2 months since my interview and it's getting a bit frustrating waiting. I wish they would tell me if it is administrative red tape holding things up or if they have offered the job to someone else and are just waiting to see how negotiations go through before telling the rest of the candidates 'no'. My feelings will not be hurt if they will just be honest about why it is taking so long to hear yes or no.", "Interview Questions": "An unexpected one was how I and my husband met/"}, {"date": "15 Nov 2010", "title": "Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Rush University Medical Center (Chicago, IL) in Sept 2010", "Interview Descriptions": "First, there was a phone interview.The second round was an interview with HR and then 4 30-min interviews with people of varying positions in the department. It was a very structured process which was nice. HR gives you benefits information and a little background of the department and the people you are going to meet before the department interviews. Each person is assigned a recruiter from HR. MIne was fantastic. She kept me updated through every step of the way and even called before my orientation to ask if I have questions.", "Interview Questions": "Give me an example of some data you had to analyze"}, {"date": "15 Mar 2014", "title": "Research Assistant II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Rush University Medical Center (Chicago, IL) in Jul 2010", "Interview Descriptions": "The Human Resources Department contacted me via telephone and made an offer.  There was not flexibility in negotiating a pay rate.  The department is very slow in the hiring process. Applicants need to be patient.", "Interview Questions": "What type of experiences could you bring to the department?"}, {"date": "27 Mar 2014", "title": "Project Coordinator Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Rush University Medical Center in Jul 2010", "Interview Descriptions": "Be prepared with patience. Hiring tends to be a long process.\r\n\r\nThe job description was very vaguely worded and it was a part time position and didn't specify how many hours. I applied without much information, but it worth it, because the position ended up becoming a full time position within a couple of months.", "Interview Questions": "The position required that I be bilingual, so there was an informal language test. "}], [{"date": "26 Sept 2014", "title": "Phlebotomist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 1+ week. I interviewed at Rush University Medical Center in May 2010", "Interview Descriptions": "You will have a on one interview with phlebotomy supervisor, lab manager, and one lead phlebotomist from day shift. You will be tested on knowledge of drawing order and tubes.", "Interview Questions": "Do you think you fit our rush motto \"I care and I connect\""}, {"date": "8 Jun 2013", "title": "SPD Stock Clerk Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Rush University Medical Center (Chicago, IL) in Mar 2009", "Interview Descriptions": "The hiring process is overly long, generally taking three weeks and several visits after the interview before you actually start working.", "Interview Questions": "My interview was basically a tour of the warehouse. "}, {"date": "7 Jul 2010", "title": "Physician Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Rush University Medical Center (Chicago, IL) in Feb 2008", "Interview Descriptions": "I had a rotation as a student with this service before i interviewed and so the interview process was very simple.", "Interview Questions": "N/A"}]]