[[{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "A great place to work", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "23 Jun 2023", "job_title": "Anonymous Employee in Cambridge, England", "duration": "N/A", "pros": "Doing lots of interesting work with great people.", "cons": "Nothing that I can think of."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "You will not find better", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "13 Jun 2023", "job_title": "Engagement Manager in Cambridge, England", "duration": "N/A", "pros": "- Amazingly intelligent and talented people who are kind, collaborative and hard-working. - People are driven by the mission and truly care about making a difference. - The CEO is excellent. He is particularly good at being open and transparent with employees. He communicates frequently with and seeks feedback from staff, so I have always felt involved and aware of what is going on and informed of the decision-making process. He also adopts an open-door policy, which I have appreciated over the years. - RPF is open to new ways of doing things and is ahead of the curve with organisational tools for staff. I have always had the tools I need to do my job well. - An afternoon each week is set aside for the whole organisation to focus on learning and development. Employees have the freedom to choose the courses or type of learning they want to do and are trusted to do it. - Unique programmes that are fun, engaging and respected. - Truly a people-first organisation. My experience has been that the management puts employees before the job. I have had a couple of experiences during my time at RPF when work was overwhelming and/or times were difficult and the Foundation did everything it could to support me. If you flag it, the leadership team will listen. The way the organisation handled covid was outstanding in my opinion. I felt so lucky to work here during that time. - Flexible working policy is great. People are respected and given the freedom to find a working pattern that works for them. - Collaboration is always encouraged and is embedded in the way we work. Our annual residentials (org away days) in particular are a great (and fun) way to connect with other teams away from the day job, and the organisational tools we use are always collaborative. - I have a disability and I have always found the Foundation to be extremely inclusive and considerate. - Medical insurance and a whole host of other benefits. - As I have mentioned above, people are kind at RPF but that's not to say that difficult conversations can't be had. I've had many frank discussions over the years to get the job done. Communication is key. In a nutshell, if you're thinking of joining the foundation I would say do it. It'll be the best decision you'll have made in a long time. I'm moving on, and despite being excited about my next adventure, I'm so sad to leave such a wonderful team and impressive organisation.", "cons": "There aren't many career progression opportunities and the remuneration is okay, but it's what you would expect working for a charity. There have been occasions during my time at RPF when my workload has been extremely high and unsustainable. However, this isn't necessarily a poor reflection on the Foundation. The projects I was working on were very complex and it wasn't easy to pull extra resources in. I also think that the leadership team has been better at keeping an eye on people's workloads since covid."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Inexperienced management leads to serious issues", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "3 May 2023", "job_title": "Learning Manager in Cambridge, England", "duration": "N/A", "pros": "- Some really talented people (though fewer now) - A great mission", "cons": "- Inexperienced management means that people are poorly utilised, decision-making is poor and there have been serious consequences to employees' mental health. - Lack of career progression; recent changes have made this considerably worse. - DEI issues are not understood by management and any attempts to raise awareness are met with defensiveness and denial."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Fun and rewarding place to work", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "27 Feb 2023", "job_title": "Anonymous Employee in Cambridge, England", "duration": "N/A", "pros": "The most collaborative, understanding and talented people I have ever worked with. Senior management are very open and decision making is fair. Employees are treated very well and everyone is committed to the mission. Together we achieve great things and everyone’s contribution is valued.", "cons": "Career progression and pay. As this is a charity you will be paid market rate for your role and there is no possibility to push this, unless up-skilling to a more senior role. It is therefore important that you are comfortable with the package offered from the outset."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 0, "Diversity and Inclusion": 0, "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Great people, not so great people management", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "31 Mar 2023", "job_title": "Project Manager in London, England", "duration": "N/A", "pros": "Lovely group of people, passionate about what they do.", "cons": "As has been reported elsewhere here, the organisation is not well managed."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Nice people, no focus", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "9 Aug 2022", "job_title": "Product Owner in London, England", "duration": "N/A", "pros": "Lovely people, nice mission and some effective programs that do real good.", "cons": "Plenty of programs that probably do little or no good and there's no way to work on oly the effective stuff. Very burecratic. Overall very high churn in the last few years."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Toxic Leadership Dragging Morale Through The Mud", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "21 Jan 2022", "job_title": "Manager in Cambridge, England", "duration": "N/A", "pros": "Outside of the leadership team and their chosen few, there are some really good people at the Foundation - passionate, talented people who really care about the mission and are crying out for proper leadership.", "cons": "I'll start with the low pay. Pay was less than half of what other companies in the area offer. Yes they're a charity, but a) other comparable charities still offer more, and b) they certainly find the money for a bizarrely large number of mediocre \"leaders\". They'll talk about passion and their mission, but that doesn't put food on the table (especially in Cambridge) and none of their other benefits are anything to shout about. \r\n\r\nThere is no performance-related raise structure - discretionary bonuses are pitiful, and entirely at the whim of the leadership team, meaning anyone who isn't close friends with their boss is going to miss out. There's also no hope of career progression - it's \"Dead Man's Shoes\" for every role, except (funnily enough) in the leadership team, where new roles seem to crop up every 5 minutes.\r\n\r\nThere's been a huge amount of employee turnover in recent years, and this is purely down to the company's toxic leadership, starting with the CEO. He plays favourites, hires his friends over more qualified candidates for leadership positions, and forces out anyone who dares to call out the mediocre results his methods are achieving. \r\n\r\nThe leadership talks a big game about taking employee feedback seriously, but the only action I saw them take was to bully and patronise anyone who left negative feedback, including trying to find out the names of those who left anonymous feedback (and not to clap them on the back and say \"well done\"). If you aren't smiling and saying how great everything is, don't expect to have many friends in high places. \r\n\r\nWhen allegations of racism were raised, the leadership promised to act but did nothing. When the question of a member of the Royal family being the charity's patron were raised, the leadership's only concern was of their own reputation.\r\n\r\nGood people are leaving in droves or going off sick with stress, and replacing them is getting harder and harder. I see there are some recent positive reviews here to push these more negative reviews out of sight, but don't ignore them."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 4, "Career Opportunities": 5, "Compensation and Benefits": 3, "Senior Management": 5, "review_title": "Amazing company", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "12 Aug 2021", "job_title": "Anonymous Employee in Cambridge, England", "duration": "N/A", "pros": "I've been working here for almost a year and I am continually impressed with the leadership team and all my colleagues. If you like to work somewhere purposeful, organised, and calm (but not boring or unproductive) then this is the right place for you. I would highly recommend it. I am really appreciating having private healthcare too.", "cons": "I previously worked at a more commercial organisation and I think, whilst the Raspberry Pi Foundation is a charity, it would be good to bring in more people focussed on the end user with digital business experience. The pay is comparably less than in the commercial sector (but the work/life balance gained makes up for this imo)."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 3, "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 3, "review_title": "Great opportunities to grow and develop", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "16 Nov 2021", "job_title": "People and Culture Manager in Bedford, England", "duration": "N/A", "pros": "- Flexible work culture \r\n- Supportive of training to develop skillset. Budget available. \r\n- Family friendly", "cons": "- Limited progression opportunities\r\n- Salaries not aligned to changes in the marketplace"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 4, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Overall enjoyed my time working here", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "26 Oct 2020", "job_title": "Events Assistant in Cambridge, England", "duration": "N/A", "pros": "Friendly colleagues from around the globe\r\n\r\nFelt like managers genuinely cared about your wellbeing\r\n\r\nGood mission to be working towards\r\n\r\nMakerspace in office\r\n\r\nGood coffee machine + free fruit and drinks\r\n\r\nOpportunities for staff to attend/volunteer at their events\r\n\r\nExciting projects to work on\r\n\r\nChances to improve digital making skills each month\r\n\r\nAccess to a variety of general improvement courses", "cons": "The Cambridge office could lack a communal atmosphere at times\r\n\r\nA lack of clarity on career progress\r\n\r\nChanges and decisions from upper management sometimes not well explained\r\n\r\nLower end of wages could be challenging for the Cambridge area\r\n\r\nThe Company has gone through a lot of growth and changes in quite a short period of time, I feel they are still trying to adjust to some of these changes/set staff expectations."}], [{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": 4, "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Empowering mission and values", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "19 Nov 2021", "job_title": "Anonymous Employee in Cambridge, England", "duration": "N/A", "pros": "A mission that resonates and challenges", "cons": "Growing all the time, which can pull on the culture"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Great company with a positive mission", "rating": "5.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "4 Apr 2021", "job_title": "Software Engineer in Cambridge, England", "duration": "N/A", "pros": "A great company, with lots of friendly people who are passionate about company's mission. Perfect place for anyone interested in ed-tech.", "cons": "Might feel a bit slow paced if you are not used to having work life balance :)"}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Bad", "Work/Life Balance": 5, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "Narcissistic Bigots", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "21 Sept 2020", "job_title": "Manager in Cambridge, England", "duration": "N/A", "pros": "Fresh fruit & soft drinks, good holiday allowance", "cons": "Inability to give feedback, Senior Management live in their own bubbles, No Progression, No appreciation for work done, Internal laziness killing the progression of the company"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Soul destroying", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "14 Jun 2020", "job_title": "Anonymous Employee in Cambridge, England", "duration": "N/A", "pros": "Free fruit in the office kitchen", "cons": "No opportunities for progression or payrises\r\nMiddle-management incompetence\r\nMiddle managers get paid 2x-4x what the people who do any work get\r\nEvery team is a silo\r\nMost employees love the first few months, then leave around 12-18 months\r\nManagement refuse to listen to the volunteer community and leave bottom-layer staff to fob them off\r\nCEO wants to be your mate despite bullying you"}]]