[[{"date": "30 Jan 2023", "title": "Economist II Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Conference Board of Canada (Ottawa, ON) in Nov 2022", "Interview Descriptions": "Started with a call from HR and then interview was set after a week. There were two interviewers, one was professional and very humble but the other one was extremely rude and unprepared. Her approach was extremely unprofessional and disgraceful. The other interviewer was feeling so uncomfortable that he mentioned to me \"interviews are not always fun!\" Better be unemployed than working with a mannerless manager. Pros: don't know any Cons: rude management, pays two third of what others pay in this field", "Interview Questions": "1.So you have written this in your resume , now tell me what do you know about this? (What an unprofessional way of asking) 2. How come you didn't mention this experience in your resume? ( Actually I did but she missed it at first sight) 3. Some behavioral questions"}, {"date": "20 Apr 2022", "title": "Research Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Conference Board of Canada", "Interview Descriptions": "The interview process involved a first short call with a human resource representative followed by two formal interviews with a panel of relevant staff members. I do not know if further interviews would have taken place if I had continued with the recruitment process (I eventually moved on from the process due to another offer). I thought the interview process was clear and the questions asked all made sense. There was also openness from CBOC in responding to the questions I raised. I would say that the multiple interviews can become taxing, clarity on the reasons for these steps would be a good thing to implement in the future.", "Interview Questions": "I was asked about my experience in the specific field of research, experience in being autonomous in my work."}, {"date": "21 Mar 2022", "title": "Economist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at The Conference Board of Canada", "Interview Descriptions": "So many interviews with different members. Very inefficient process. No wonder they have so many negative reviews.  I decided to not continue this process after the second interview. \r\n\r\nThe managers and senior members I met during my interviews seemed nice.", "Interview Questions": "Tell us about your experience with Eviews."}, {"date": "23 Sept 2021", "title": "Research Associate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at The Conference Board of Canada (Ottawa, ON) in Aug 2021", "Interview Descriptions": "I applied through Linkedin for the Research Associate position. I got two seperate interviews with the hiring managers. It took more than a month to arrange these meetings. It seems there were not a structured schaduale or plan for the recuitment process.", "Interview Questions": "Asked about technical software. They asked about my publications and what I did in my previous jobs. "}, {"date": "19 Jul 2021", "title": "Data Scientist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Conference Board of Canada", "Interview Descriptions": "Without any HR screening, I had my my first (and only) interview with three economist. The interview was relaxed and the interviewers friendly.\r\nI was told I would be contacted in two weeks; after three weeks, I contacted HR asking for news. HR said that they didn't make a decision yet, but I will be contacted when do.\r\nNever received and answer", "Interview Questions": "Question about databases, econometrics, and economics"}, {"date": "25 Jun 2021", "title": "Economist Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at The Conference Board of Canada", "Interview Descriptions": "Very informal and unprofessional. It turned me off- had to go through 6 interviews. I knew after the third one that it's not the place for me due to misalignment of expectations, poor career trajectory and a senior leadership that didn't know what it wanted from the role!", "Interview Questions": "What are your career expectations going forward."}, {"date": "4 Sept 2020", "title": "Economist (Economic Forecasting) Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at The Conference Board of Canada", "Interview Descriptions": "Entretien vidéo panel avec un HR Generalist, deux senior économistes\r\nPar skype Professional\r\nProcessus prévoyant entretien avec d'autres senior economist par la suite\r\nj'ai reçu une réponse 8 jours après l'entretien, ils étaient tous amicaux mais je pense que je ne les regardais pas assez dans les yeux", "Interview Questions": "Tell us about yourself \r\nExperience in Forecasting"}, {"date": "14 Aug 2019", "title": "Associate Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at The Conference Board of Canada (Ottawa, ON) in Jul 2019", "Interview Descriptions": "HR called aftera month also I had applied online and apologized for the late connection.  Did the pre-screening questions and surprised to find out how low the salary was but nonetheless accepted a second phone interview with the hiring manager and another HR.  A week later, I had the second phone interview with questions about my background.  I had another 3rd interview further explaining  my experiences.  I was told that I will have an answer within a week.  These people came back to me with written questions.  I felt a deception but I quickly did the questions and send it to them.  The same day i started reading the reviews on glass door and realise that this is not a place that I want to be working for.  Period!!", "Interview Questions": "Please tell me your experiences of your past roles?  are you a canadian citizen?"}, {"date": "12 Jun 2019", "title": "Internship Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at The Conference Board of Canada", "Interview Descriptions": "The interview was fairly easy, and the economists were pleasant to talk to. I was offered minimum wage for a position that requires a degree and relevant past experience. Pretty shameful practices if you ask me.", "Interview Questions": "Tell me about your past work experience"}, {"date": "10 May 2019", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Conference Board of Canada", "Interview Descriptions": "Quick  and to the point. Asked all the routine questions about MS suite of products and related experience and proficiency.  Professional approach and spent time talking about the organization and opportunity for longer term employment.", "Interview Questions": "Interested in my skill in Excel"}], [{"date": "20 Oct 2017", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Conference Board of Canada", "Interview Descriptions": "The hiring practice seemed to be taken out of an old HR 'how to hire' textbook from 1960.  Interviewer seemed distracted or disinterested in the dialogue process and more interested in checking each box that a series of questions had been asked and answered.", "Interview Questions": "Asked if I was married and had children."}, {"date": "22 Mar 2017", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at The Conference Board of Canada", "Interview Descriptions": "Phone interview with HR and hiring manager followed by in person and analysis and writing test. In person interview was frustrating because almost all the same questions were asked that came up in phone interview.", "Interview Questions": "Look at these charts and tell us what you see. "}, {"date": "21 Jul 2016", "title": "Economist Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at The Conference Board of Canada (Ottawa, ON) in Jun 2016", "Interview Descriptions": "Phone- a few HR questions, the rest were mostly questions on how I would analyze certain situations, and my writing experience \r\n\r\nIn person + written test- friendly interview, and test wasn't so bad. The management team seemed friendly and knowledgeable. \r\n\r\nProblem: haven't heard back from them, I interviewed over a month ago. I emailed 2 weeks ago (3 weeks after my interview!), and was told that they are still in the hiring process and I should hear back within a week. That was July 6th, it is July 21st now....... \r\n\r\nShows of a poorly run organization, or highly inconsiderate of other people's time.\r\nEither provide an accurate timeline for the final decision, or a final answer.", "Interview Questions": "What indicators would you need to examine and forecast the business sector in Canada (similar question to health expenditures in 20-50 years)."}, {"date": "31 Oct 2016", "title": "Meeting Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. I interviewed at The Conference Board of Canada (Ottawa, ON) in Apr 2015", "Interview Descriptions": "Met with three people, one from HR and one person from the hiring area.  Regular questions based on my CV. I was asked to come back for a 2nd interview with a the same two people plus a third manager from the hiring area.  I also received a salary screening call and had to complete a writing test.", "Interview Questions": "Tell about a time when you had to prioritize multiple demands for multiple people."}, {"date": "19 May 2016", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at The Conference Board of Canada (Ottawa, ON) in Sept 2013", "Interview Descriptions": "3 interviews, two by phone and one in person. Interview with director was fine, but she didn't end up staying with the organisation very long afterwards. HR disappeared as soon as the process was finished, no on-boarding. Their main concern was how many other competitions I was in and what other offers I had received", "Interview Questions": "Do you have a wife?"}]]