[[{"Recommended": "N/A", "CEO Approval": "Neutral", "Business Outlook": "N/A", "Work/Life Balance": 1, "Culture & Values": 3, "Diversity and Inclusion": 4, "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "Interesting job and work style.", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "29 Mar 2021", "job_title": "Project Manager in London, England", "duration": "N/A", "pros": "International, high speed environment and interesting professional challenges.", "cons": "Low work-life balance; managerial issues"}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 0, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Learned a lot, met great people, aimed high.", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "25 Oct 2020", "job_title": "Policy Director in London, England", "duration": "N/A", "pros": "Fast pace of work and can-do attitude of many people there", "cons": "Getting a bit too big as an organisation to be nimble"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 4, "Senior Management": 0, "review_title": "Poor management practices, inability to hold on to talent", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "1 Mar 2018", "job_title": "Policy in London, England", "duration": "N/A", "pros": "Great energy around the office, good pay, perks, and benefits relative to others in industry. People are generally warm and welcoming to newcomers.", "cons": "Management style is inconsistent. There are some terribly discouraging micro-managers who are extremely difficult to work with, while there are also some excellent ones who have faith in the - sometimes over- qualified - people they've hired to take initiative and do their job well. It's really a matter of luck who you end up with, and with turnover being so high there is no telling who you may have to work with in the future out of this mix of people. Commitment to working hard (including evenings and weekends) - that is, quantity of work - is rewarded well above quality of work. Despite constant discussion over improving work-life balance, very few managers help protect their juniors' personal time, partly because the people who are promoted to management are usually those that have shown little inclination to protect their own personal time.  This attitude  leads to a lot of the more talented people leaving after a year or two for more flexible working environments and opportunity for growth. Meanwhile, reinventing the wheel on earlier work and the inability to retain institutional knowledge creates a frustrating level of inefficiency and a lack of ownership in terms of the output produced. \r\n\r\nThe organisation is also very personality-driven in terms of upper management, and organisational mission and implementation of that mission is ever-shifting as a result. This leads to a general lack of professionalism and consistency at every level as leadership styles and accompanying expectations keep changing, which the organisation is no longer young enough to justify still experiencing."}], []]