[[{"date": "7 Feb 2023", "title": "Health and Wellness Program Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Alamo Colleges District in Nov 2022", "Interview Descriptions": "Communication was handled directly with the hiring manager and the process was actually quick and smooth until, after multiple interviews, there was radio silence. After completing what I was told was the last interview, I never heard another thing. I reached out and never received any communication back.", "Interview Questions": "typical behavior type questions, very conversational"}, {"date": "30 Aug 2022", "title": "Lecturer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Alamo Colleges District in May 2022", "Interview Descriptions": "I had less than one week to prepare a 20 minute presentation, to be given over Zoom. The presentation topic was very specific and required significant time and planning. During the zoom, I presented the slides. The time was kept and I was interrupted as time grew to a close. \n\nI was also asked about ten questions by a panel. None of the people on the panel were in my field, though they were in the same department.  \n\nAfter the interview, I was never given any feedback or response. The position just closed within the HR platform so I assumed it went to another candidate. \n\nI would say generally the process was very matter of fact with limited communication.", "Interview Questions": "Questions focused on equity in pedagogical methods and assessment, online teaching familiarity and sample types of assignments. "}, {"date": "25 Jun 2021", "title": "Peer Academic Coach Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Alamo Colleges District", "Interview Descriptions": "Was offered interview, never got scheduling information and never heard back about it. Got  a call and tried calling the person who interviewed me on the day of the interview, did not get through, never got alleged email with details.", "Interview Questions": "N/A"}, {"date": "25 Jun 2021", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Alamo Colleges District", "Interview Descriptions": "Remote; Ist interview with question and answer ; second interview with virtual lesson presentation. A group of 4-6 per interview. A call back and email was sent within 2 weeks. Yet, HR took 8 weeks to process my paperwork and establish a firm offer.", "Interview Questions": "What is your philosophy of teaching?"}, {"date": "14 Mar 2021", "title": "Certified Academic Advisor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Alamo Colleges District (San Antonio, TX) in Mar 2021", "Interview Descriptions": "The interview was conducted virtually on Zoom. I was provided the meeting ID and logged into the meeting. The first interview was with a committee of five staff members. The second  interview was with the Vice President and President.", "Interview Questions": "How would you ensure that you are inclusive of students of all backgrounds?"}, {"date": "26 Jul 2020", "title": "Math Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Alamo Colleges District", "Interview Descriptions": "Hiring process took about 3 weeks. Hiring tends to accelerate during the Winter and Summer breaks before the semesters begin. I was interviewed in front of a panel of people who asked about my previous experiences in the educational environment.", "Interview Questions": "What advice would you give a student if they felt discouraged in their studies?"}, {"date": "5 Oct 2019", "title": "Adjunct Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Alamo Colleges District", "Interview Descriptions": "It was really fast but relaxed.All the necessary questions were asked.I applied online and attended the job fair. A panel from the department asked general questions and scheduled for a teaching demonstration", "Interview Questions": "Asked to do a teaching demo"}, {"date": "15 Jun 2021", "title": "Marketing Specialist Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Alamo Colleges District (San Antonio, TX) in Oct 2018", "Interview Descriptions": "Interviewed with a panel fromn the PR / marketing department. It was a pretty standard interview but the main hiring manager was late and I had a hard time finding the office.", "Interview Questions": "What is your experience with graphic design programs in Adobe CS? "}, {"date": "14 Dec 2017", "title": "Adjunct Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Alamo Colleges District", "Interview Descriptions": "Met with a panel of 5 people.  It was very easygoing and they made me feel comfortable.  They did not discriminate against me being 9 months pregnant during the interview.", "Interview Questions": "Why do you feel are a good fit for this position?"}, {"date": "8 Feb 2018", "title": "Federal Work Study Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Alamo Colleges District (San Antonio, TX) in Dec 2017", "Interview Descriptions": "Human Resources Department will speak with you, asking about experience, work ethic, and asked to perform a background check. Then they will send you a link via email for a phone app for the background check process. Once the background is complete they will send your profile to various Departments. You may ask for a specific department or professor to request your services.", "Interview Questions": "What job experience do you have?"}], [{"date": "22 Mar 2017", "title": "Executive Assistant to the President Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Alamo Colleges District", "Interview Descriptions": "I received a phone call that from the Office of the President.  I won't say which location as currently 3 of the colleges are in search of an Exec. Asst. for their President as I type this.  However, the call I received seemed promising, was contacted to see if I was still interested in the position as they would like to speak to me via phone first.    I called back and left a message.  I didn't hear back and finally I was contacted with a date and time as to when I can expect a call back for our phone interview.  Day of phone interview, the scheduled time came and went.  I waited the courtesy 15 minutes and contacted them back once again to ensure that we would be able to meet.  No answer.  Left message to inquire if they need to reschedule and followed up with an e-mail.  I understand that the Office of the President is extremely busy, but when you have a department consisting of at least 3-4 support staff, one would think that a courtesy call or e-mail back to prospective candidates would be sufficient.  I hope I receive some kind of call because honestly this leaves a horrible impression of your department and support staff.", "Interview Questions": "Still waiting on phone interview that has yet to happen; even though allotted interview time has come and gone."}, {"date": "22 Aug 2016", "title": "Inventory Control Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Alamo Colleges District (San Antonio, TX)", "Interview Descriptions": "Call for interview, had a group panel of about three people and they asked the general questions and talked about the expectations of the jobs. The interview was norma not to many hard questions.", "Interview Questions": "What is your greatness weakness"}, {"date": "15 Jun 2016", "title": "Instructor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Alamo Colleges District", "Interview Descriptions": "It was a five-person committee with faculty from department and other departments as well.  Shared examples of assignments and syllabus. Answered specific questions related to the documents. Presented a teaching demonstration.", "Interview Questions": "Why do you want to work for Alamo College and this campus in particular."}, {"date": "2 Jun 2016", "title": "Internal Auditor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Alamo Colleges District", "Interview Descriptions": "great experience. phone interview with recruiter. then you meet with the CAE. and then he introduces you to the team without them present. It felt like all responses to your questions were direct and honest.", "Interview Questions": "some technical and some behavorial"}, {"date": "30 Jun 2016", "title": "Student Success Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Alamo Colleges District (San Antonio, TX) in Jun 2016", "Interview Descriptions": "I received a call approximately two weeks after I submitted my application. The second interview took place about three weeks after the first. The first interview was in person. The second interview request was an interview the next day. Since I could not travel at that time, I requested a Skype Interview. There was a problem with my connection, one of the interviewers kept asking me to move to one side or another, or to speak up because they could not hear me.", "Interview Questions": "Why do you want to work for Alamo Colleges?\r\nWhat qualifies you for the position?\r\nIf hired, what you would do within the first six months?"}, {"date": "18 May 2016", "title": "Adjunct Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 days. I interviewed at Alamo Colleges District", "Interview Descriptions": "Informal. Over the phone and in person. I knew the person who was hiring, so not a good review for outside hires. I think it is a low-key environment for interviews though based on whom I have met at orientation", "Interview Questions": "Education background? As I mentioned above the interview process was very informal for me as I knew the dean of the college that I was going to be working for. From the people that I have met while working there in orientations it seems as though the interview process would be easy"}, {"date": "7 Mar 2016", "title": "Security Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Alamo Colleges District (New Orleans, LA) in Feb 2016", "Interview Descriptions": "The interview process was carried out efficiently and effectively. It was blunt, nice, and simple. They explained what the job was and what I was going to be doing very plainly.", "Interview Questions": "What jobs have I worked in the past?"}, {"date": "29 Apr 2016", "title": "Office Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Alamo Colleges District (San Antonio, TX) in Feb 2016", "Interview Descriptions": "fill out application,  human resources,  email gets send to me,  interview in person, phone call to check on employment status, sending THANK YOU letter to company.", "Interview Questions": "Do I have transportation?"}, {"date": "26 Feb 2018", "title": "Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Alamo Colleges District (San Antonio, TX) in Jul 2015", "Interview Descriptions": "Very quick and to the point. You talk to a couple different people that will need to know if you are a good fit for the company. Overall, it was a great experience.", "Interview Questions": "Standard questions. Can you teach? What is your educational background? Do you think you will be a good fit for students and faculty? "}, {"date": "21 Apr 2015", "title": "Instructor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Alamo Colleges District (Universal City, TX)", "Interview Descriptions": "Online application, (needs about 5 separate documents) screening process performed by HR before hand, then personal interview by a panel and this was followed by a local teaching demonstration. The on site process took about 2 hours.", "Interview Questions": "Why do I want to teach for Alamo Colleges?"}], [{"date": "10 Oct 2019", "title": "Recruiting Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Alamo Colleges District (San Antonio, TX) in Feb 2015", "Interview Descriptions": "It varies between people and it can depend who interviews you, but be honest and you'll see that you'll do great. Provide great past experiences and be honest. Other than that, there's not much to it!", "Interview Questions": "What's your greatest strengths? "}, {"date": "16 Apr 2014", "title": "Department Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Alamo Colleges District (San Antonio, TX) in Aug 2013", "Interview Descriptions": "sat before 3 department representatives who asked me job specific questions as well as open ended situational examples.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "25 Jul 2013", "title": "Instructor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Alamo Colleges District (San Antonio, TX)", "Interview Descriptions": "The school had me come in to interview with no financial assistance.  The committee was late, ill prepared, and the followup HR experience was horrible.  It seemed that breathing was the only qualification for working in their HR department.", "Interview Questions": "Why do you want to work for Alamo Colleges?"}, {"date": "14 Apr 2017", "title": "Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Alamo Colleges District (San Antonio, TX) in Jun 2013", "Interview Descriptions": "Phone interview with predictable questions. That was followed by a face-to-face interview with a 20 minute teaching demonstration. The committee was about 5 faculty and staff who took turns asking questions from a prepared list of about 13 questions.", "Interview Questions": "Why do you want to teach at our college?"}, {"date": "26 Aug 2015", "title": "Lab Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Alamo Colleges District (San Antonio, TX) in Aug 2012", "Interview Descriptions": "committee of 3 people who will work as colleagues and/or supervisors, typical interview questions, straight forward but friendly,may say will have second interview with 1 person in charge or they will call/send an email to tell you your status, they will also give a time frame of when to expect an answer.", "Interview Questions": "Why are you the best applicant for the job?"}, {"date": "9 Nov 2015", "title": "Instructional Designer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Alamo Colleges District (San Antonio, TX) in Feb 2011", "Interview Descriptions": "3 tier interview basics interview example of work\r\neach level of interview is more challenging in practicum and knowledge challenged\r\nAddie model was examined in theory and relativity...questions designed to address weakness of model understanding", "Interview Questions": "How many years of design experience do you have"}, {"date": "18 Jul 2012", "title": "Computer Lab Tech I Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Alamo Colleges District (San Antonio, TX) in Jul 2009", "Interview Descriptions": "They were in a hurry to fill the position, so the hiring process went very quickly for me. They didn't ask any hard questions. Most were standard interview questions and some technical questions.", "Interview Questions": "What to do when a computer has a virus. "}]]