[[{"date": "21 Jul 2021", "title": "Human Resources Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at VillageCare", "Interview Descriptions": "initial phone screen, in person interview with Vice President of Humana Resources, Assistant Vice President of Human Resources and Human Resources  Manager.  Turn around time for a response was less than a week.......", "Interview Questions": "Tell me about processes you implemented?"}, {"date": "21 Dec 2020", "title": "Utilization Management Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at VillageCare (New York, NY) in Oct 2020", "Interview Descriptions": "I applied online and was contacted by the talent recruiter within about 2 weeks.  I was set up for a video interview with the dept manager and a staff nurse in the dept.\n\nThe interview itself went ok, there were no really difficult questions.  The dept manager was very friendly and did a few ice breaker questions to try to ease my anxiety.  Because I do something similar at my current job, most of the questions were about which processes I feel comfortable with and which I may need more training on.  \n\nThe thing that turned me off to this company was the staff nurse who was in the interview as well.  I had issues with my computer and wasn't able to connect to the video, they could only hear my voice.  I went out of the interview then back in 3 times before they came on and once when they were on the call.  I still couldn't get the video to work.  The staff nurse made this disgusted face and kept that face for at least a minute, you know that look.  Maybe she doesn't realize that sometimes people have issues with their computers at the worst times.  I'm trying to get another job, why would I purposefully not have my camera on?  \n\nThey never got back to me after that interview, not even a generic rejection email.  But I would have declined the job if they did offer it.  The nurse's facial expression was rude and made me feel bad.  I'm a nurse, not a computer tech, I don't know what to do if I can't get my camera to work after multiple attempts.  How do they react if their staff has technical issues? \n\nThey were telling me how impressed they were with my experience and the fact I'm in school for an advanced degree.  I realize interviewers just say that type of stuff, especially if they aren't an experienced interviewer.  But if this were true, they should have scheduled a follow up interview and by then my camera would be working (I got it working the next day after getting someone else to look at it).  \n\nAside from the nurse's facial expression, the interview was ok.  I would not apply to this company again, even for other positions, but the interview process was one of the easiest I have done as a nurse.", "Interview Questions": "They asked about what UM processes I feel comfortable doing and what I would need any trainings on."}, {"date": "2 May 2019", "title": "Social Worker Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at VillageCare (New York, NY) in Apr 2019", "Interview Descriptions": "Interviewing process was smooth. Met with the supervisor and then he had me meet the team the next day. Helped me to understand the organization better and what they were about.", "Interview Questions": "They asked me if I can choose to do anything, putting money aside, what do I see myself doing?"}, {"date": "30 Aug 2018", "title": "IT Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 months. I interviewed at VillageCare", "Interview Descriptions": "First you interview with HR then you interview with the manager.  They are your basic get to know you interview questions and how you would handle certain situations that may arise while working.", "Interview Questions": "How would you assist an upset caller?"}, {"date": "6 May 2017", "title": "Health Care Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at VillageCare", "Interview Descriptions": "Applied online and completed online application.  Got a call from HR to schedule to met with HR in corp office.  Then, met with dept supervisors.  A week or 2 later, HR called to make an offer.", "Interview Questions": "If you will be available to do expected OT a lot."}, {"date": "14 Mar 2017", "title": "Care Facilitator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at VillageCare (New York, NY)", "Interview Descriptions": "The interview was pretty basic, being that I already had the experience the questions were a piece of cake. I was told I'd be interviewed by one person and actually got interviewed by two.", "Interview Questions": "Do you know what the health home is ? "}, {"date": "21 Feb 2017", "title": "Licensed Practical Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 1 week. I interviewed at VillageCare (New York, NY) in Feb 2017", "Interview Descriptions": "I was searching online for a sub-acute rehabilitation center and I found VillageCare. I had called the Senior recruiter who advised me to apply online and email her my resume as well. Then she emailed me back with an interview date. On the day of my interview, I was given an short exam of about 16 to 20 questions, I cannot remember for sure. Then, I met with the senior recruiter and she interviewed me. After I was introduced to the nursing director, who also interviewed me.", "Interview Questions": "Describe a time you had to deal with a difficult resident and how did you handle it. "}, {"date": "4 Nov 2016", "title": "Case Manager & Health Coach Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. I interviewed at VillageCare (New York, NY) in Oct 2016", "Interview Descriptions": "The interview facilitator was Ms. Michelle Brown.  My first task was to join the other applicants in the case manager test taking room.   The room appeared too dim to read the test questions.  But, one of a case manage's duty is too work with the underserved.  The group and I were given instructions to take the written questionnaire.   Ms. Brown rentered the waiting room and summoned me to follow her, to the interview location.  The room was situated for a one on one conference.  We sat opposite of one another.  I was probed with questions regarding my past work experience.  A summation was provided discussing the needs of the human service non for profit agency.  Ms. Brown closed the interview with the statement, \"I will pass this information on to my boss.\" She breathed and smiled.  Ms. Brown stood up from her seat and said, \"thank you Ms. Guster.\" I was escorted to the elevator.", "Interview Questions": "The interview question was the story telling sort.  I was asked to discuss myself."}, {"date": "18 Sept 2016", "title": "Staffing Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 2 weeks. I interviewed at VillageCare (Wall, NJ) in Aug 2016", "Interview Descriptions": "Phone interview with Administrator went very well, In-person interview went well with both the administrator and Director of Nursing, we reviewed their needs and how I was able to help them accomplish their goals", "Interview Questions": "Questions about staffing numbers, FTEs review of employees time and attendance employee credentialing, new hire process."}, {"date": "24 Dec 2017", "title": "Care Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 5 days. I interviewed at VillageCare (New York, NY) in Aug 2016", "Interview Descriptions": "During the first interview with the recruiter, I was asked to fill out paper work;  address, state I.D., w-2, etc.  I was told I would be notified for a second interview with the Assistant Director of the program. Be prepared to answer challenging questions when you meet with the A.D.", "Interview Questions": "\"What made you apply for this position?\", \"What are you expecting to learn if given this position?\", and \"How would you resolve a conflict between staff?\" were asked."}], [{"date": "28 Jul 2016", "title": "Team Leader Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 2 days. I interviewed at VillageCare (New York, NY) in Oct 2015", "Interview Descriptions": "Interview process was straight forward and really fast moving. First you interview with the HR Recruiter briefly, and depending on the outcome of that interview, you advance. The next interview will be with whom will be your direct supervisor. After this interview you interview again with the person whom will be your supervisor, but also with the program director. The interview process was somewhat stressful as you are being walked around from office to office to meet with different people, and answer pretty much the same questions.", "Interview Questions": "Tell me about your past experience in the field.  What is a Health Home? A few \"what if\" scenarios. One being what if a client becomes belligerent while you're at their home. Are you able to to manage a team case load of approximately 150 patients and why?"}, {"date": "10 Apr 2014", "title": "Billing Coordinator Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at VillageCare", "Interview Descriptions": "Initial communication consisted of a short telephone call with a few questions & an interview date. Had one interview with HR & then met management of my dept who asked me a few pertinent questions.", "Interview Questions": "What is your biggest weakness."}, {"date": "2 Jul 2014", "title": "Licensed Practical Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at VillageCare (New York, NY) in Nov 2012", "Interview Descriptions": "I walked in did a skills test once you either passed or failed your skill test then you were able to get an interview right then and there. you were told if you got the job right then and there", "Interview Questions": "N/A"}, {"date": "9 Sept 2015", "title": "Supervisor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at VillageCare (New York, NY) in Feb 2011", "Interview Descriptions": "very brief, I was asked a few questions. I was called in for the interview then set a date to meet with my supervisor. when I met with her I then was asked a few questions about my previous job and how I would manage and how I deal with clients. I was also given a writing sample to develop a care plan.", "Interview Questions": "would I be able to manage to staff"}]]