[[{"date": "3 Feb 2023", "title": "Program Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Sinai Chicago", "Interview Descriptions": "There are at least three stages. 1. Phone screening 2. First interview 3. Second interview 4. Third interview (depends) Depending on the department, you’ll participate in a panel interview or one on one. You will meet a variety of team members within the rounds of interviews.", "Interview Questions": "Many of the questions were scenario based"}, {"date": "4 Oct 2022", "title": "Patient Access Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Sinai Chicago (Chicago, IL) in Jan 2022", "Interview Descriptions": "greeted nicely and was interviewed by a nice lady.. she actually wanted to talk more as a normal conversation and the questions were just sorta brought up. easy questions though.", "Interview Questions": "Where do you see yourself in 5 years"}, {"date": "1 Sept 2021", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Sinai Chicago (Chicago, IL)", "Interview Descriptions": "Received call from recruiter. Recruiter asked me questions about background and nursing skills. Recruiter set up interview with manager. Manager asked basic nursing questions. Received job offer. Set up orientation. Easy interview.", "Interview Questions": "How do you work as a team player?"}, {"date": "30 Sept 2021", "title": "PCT Patient Care Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Sinai Chicago (Chicago, IL) in Sept 2021", "Interview Descriptions": "Quick and right to the point.. I spoke with some of the nicest  people that did my interview they seem loving and caring I do recommend applying it was an video call", "Interview Questions": "Describe yourself in 5 words "}, {"date": "14 Apr 2020", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Sinai Chicago", "Interview Descriptions": "It was quick, friendly, and informal interview process. There are few formal questions as a new graduate. The hiring process was a bit disorganized because of coronavirus. But that was understandable.", "Interview Questions": "Name 5 things that describes you as a nurse."}, {"date": "12 Feb 2020", "title": "Project Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 3 weeks. I interviewed at Sinai Chicago (Chicago, IL)", "Interview Descriptions": "Initial phone screen with manager. This was followed by a phone interview with members of the team. Then, an in-person interview. Management was very responsive with scheduling.\n\nAfter accepting the offer, I was required to do a Health Screening; this may vary by position. \n\nAll start dates appear to be on Mondays and begin with orientation.", "Interview Questions": "Experience in case management"}, {"date": "29 Dec 2017", "title": "Clinical Staff Pharmacist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Sinai Chicago", "Interview Descriptions": "great overall. hr contacted and then i did a phone interview then onsite and i got the job\r\nmanagers were great and i would recomend\r\ni will continue to work for this company", "Interview Questions": "what i like to do in my free time"}, {"date": "2 Oct 2017", "title": "Intern Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Sinai Chicago (Chicago, IL) in Apr 2017", "Interview Descriptions": "interview process was to genuinely  steer the candidate to the appropriate learning environment and help them achieve most out of their experience in the hospital. very supportive and cordial staff.", "Interview Questions": "where do you see yourself 5 years from now?\r\nwhy the specific department? \r\n"}, {"date": "22 Mar 2017", "title": "Account Payable Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 2 weeks. I interviewed at Sinai Chicago", "Interview Descriptions": "Phone screening, followed by in person interview.  I met 4 people - about 30 mins with each person.\r\nAs I was a new graduate, most of questions are about how I work with people under pressures and how to deal with difficult people to get the result.  How to deal with ambiguities.", "Interview Questions": "Can you explain end-to-end process of accounts payable?\r\nHow to deal with difficult co-workers?\r\nCan you work overtime or weekend if necessary?"}, {"date": "13 Apr 2017", "title": "Patient Advocate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Sinai Chicago (Chicago, IL) in Mar 2017", "Interview Descriptions": "Four interviews were conducted with five people total. Though the interview process was not incredibly difficult, it was disorganized. When I first received the formal interview request, the letter included the wrong job and the schedule for the itinerary included the wrong date. Also, at the last moment the schedule and order in which I would meet the assigned people was changed. Ultimately they would have me travel a significant distance only to be met by a videoconferencing station in which I interviewed with 3/5 people I was meant to meet and interview with in person.", "Interview Questions": "What led you to apply for this position?"}], [{"date": "24 Sept 2016", "title": "Certified Nursing Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Sinai Chicago", "Interview Descriptions": "It was nice and polite conversation. The hiring manager was really nice, she explained a lot about the hospital and the policies. Nothing very specific in terms of the interview. How do you see yourself in the future? Questions from my resume: what did you do there and there? The interview was not really long.", "Interview Questions": "How do you see yourself in 5 years?"}, {"date": "16 Sept 2016", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Sinai Chicago in Sept 2016", "Interview Descriptions": "Applied online. Receive an email to schedule phone interview. The interviewer is nice and friendly and respectful. She asked question mostly based on my resume. For each question, she desired example and details.", "Interview Questions": "1. Why do you want to apply for this work?\r\n2.  Do you have experience working with social factors? What do you know about Sinai Urban Health Institute?\r\n3. Do you use ACCESS? \r\n4. How skillful you’re with Excel?\r\n5. Give me one example you use SAS.\r\n6. When can you start the work?\r\n7. What is the salary you are looking for?"}, {"date": "16 Aug 2016", "title": "Housekeeping Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Sinai Chicago (Chicago, IL)", "Interview Descriptions": "It was a very intensive interview but I was truthful and correct eye to eye contact and know what question to ask and the interviewers was straight to the point and it was what wanted so strive and strive and got the job.", "Interview Questions": "Why do I want to work for there company?"}, {"date": "12 Dec 2017", "title": "Senior Systems Analyst Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at Sinai Chicago (Chicago, IL) in May 2016", "Interview Descriptions": "Phone screen by recruiter.  In person interview 30 minutes,  met with rest of team along with unit manager, but meeting with CIO was cancelled.  Team meeting was positive, Manager meeting couldn't explain what position was specifically.", "Interview Questions": "What development experience do you have with NextGen"}, {"date": "9 Dec 2015", "title": "Unit Secretary Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Sinai Chicago (Chicago, IL) in Dec 2015", "Interview Descriptions": "I've been interviewed by a HR and then a stuff nurse. They both made me feel comfortable, it was a pleasant experience overall. It wasn't strict, more like a friendly conversation where they would throw in questions they wanted to ask.", "Interview Questions": "What are you looking for in a leader?\r\n"}, {"date": "13 Apr 2016", "title": "Unit Secretary Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Sinai Chicago (Chicago, IL) in Nov 2015", "Interview Descriptions": "I was asked to come back for a second interview, and then meet with a few of the nurses, and other unit secretaries. Everyone was very friendly, mostly the nurses. so overall it was not a difficult interview. I did not have to wait long for the training, which occurred fairly quickly.", "Interview Questions": "Why do you want to work here"}, {"date": "3 Jun 2016", "title": "HIE Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Sinai Chicago (New York, NY) in Sept 2015", "Interview Descriptions": "Initial Phone Interview with Manager of the HIE Interoperability team . This was followed by a face to face with Director of IT Operations which involved discussions of my past experiences and what I wanted to achieve in the future.", "Interview Questions": "How do you feel about engaging in a new line of work"}, {"date": "29 Apr 2016", "title": "Administrator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at Sinai Chicago (Chicago, IL) in Jul 2015", "Interview Descriptions": "The interview process was pretty vague and the manager didn't seem to eager to sit down and talk with me about any of the job duties. Although after viewing my resume he did see that I was qualified for the position and kind of relied on that. The first interview was over the phone and the second interview was in person.", "Interview Questions": "Why do you think qualified for this position?"}, {"date": "23 Sept 2015", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Sinai Chicago (Chicago, IL) in May 2015", "Interview Descriptions": "Did not feel like an interview. I prepared for it beforehand and when I got there I simply got a tour of the unit and was basically offered the job. Staff is all very friendly and the Manager is very nice. I felt very welcomed from the very beginning. The assistant manager is also very nice.", "Interview Questions": "Why do you want to work for Holy Cross?"}, {"date": "8 Oct 2014", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Sinai Chicago (New York, NY)", "Interview Descriptions": "The hiring process was a bit confusing.  They require a lot of paperwork, not just proof that you are a U.S. citizen, but also what schooling you went to, copies of paystubs, etc.  Despite furnishing all this, don't be surprised to get a hostile response when you dare to ask what all this information will be going, and who or what will be handling it.  It's OK for them to ask the world, but don't you dare question it.", "Interview Questions": "They are not clever.  Their questions run the usual \"why did you leave\".  Be careful on exposing yourself regarding your birthdate.  Although technically they are not supposed to ask that, they can find out easily by asking your highs school graduation date or asking for your H.S. transcript, which they do.  All this to be a secretary, is a waste of your time and talent.  They do not test for your typing or skill, which is odd."}], [{"date": "1 Aug 2014", "title": "Planning Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Sinai Chicago in Jun 2014", "Interview Descriptions": "The interview process was fairly straightforward and was conducted in a timely manner. First on-site interview took place approximately one week after application submission. The interviewer was very engaging and helped to make the interview a pleasant experience.", "Interview Questions": "What makes you want to be part of an organization such as ours (safety net hospital) as opposed to a larger organization with greater resources on hand?"}, {"date": "25 Mar 2016", "title": "Quality Assurance Supervisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Sinai Chicago (Chicago, IL) in Mar 2013", "Interview Descriptions": "Questions about decontamination, sterilization, and prep and package. Also talked about maintaining steam and sterrad records. I was also asked what computer programs had I worked with in the past.   I was asked had I ever Been in a leadership position before and where.  Finally, what would be the first thing I would do if I was to receive and offer for the supervisor position.", "Interview Questions": "How long was I a processing tech."}, {"date": "20 Apr 2016", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Sinai Chicago (Miami, FL) in Jun 2012", "Interview Descriptions": "i went in to be interviewed for the volunteer position. I was interviewed by both of the Volunteer coordinators. The experience was quite easy to coupe with. All in all, i would recomend any student in highschool to volunteer through Mt. Sinai hospital.", "Interview Questions": "How would you describe yourself"}, {"date": "11 Aug 2013", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Sinai Chicago (Chicago, IL) in May 2012", "Interview Descriptions": "Filing of Application, waiting for a call, setting an interview with hr recruiter, then interview with the manager and director, then to supervisor and staff,, Then this will go to finalizing if they will hire you or not", "Interview Questions": "What are your plans in the next 5 years"}, {"date": "20 Feb 2012", "title": "Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 1 day. I interviewed at Sinai Chicago (Chicago, IL) in Jan 2010", "Interview Descriptions": "Received an interview call with the HR through school's career services. Extremely bureaucratic organization with complex hirearchy!! Hiring process is completely haphazard and you never know who is right person to contact. All in all I would recommend constant follow ups, understand the organizational structure as well as job duties and responsibilities.", "Interview Questions": "Past experience with concrete examples to what, how and when."}, {"date": "6 Aug 2012", "title": "Systems Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Sinai Chicago (Columbus, OH) in Jan 2009", "Interview Descriptions": "random questions in a basic way. more detailed on the words of resume reading experience. not tricky or difficult ones just they want to follow their protocols. as far as i know person on the other hand is intelligent sufficient to be a recruiter for the particular position. overall good experience till now.", "Interview Questions": "why u are not moving with your educational carrier ? "}]]