[[{"date": "20 Jun 2023", "title": "Financial Planning and Analysis Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Capilano University (Vancouver, BC) in May 2023", "Interview Descriptions": "The interview process was very smooth and straight forward. I received a pre-screening call and at the end they proposed me to the next interview with a panel of three, the Director, and two finance fellows.", "Interview Questions": "They asked why Do I wanted to work with them, why CapU?"}, {"date": "4 Mar 2022", "title": "Marketing Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Capilano University", "Interview Descriptions": "There were 2 rounds of interviews:\r\nFirst interview is with your direct managers.\r\nSecond interview is with the team you will be working with and an HR advisor.\r\nThe entire hiring process took around a month.", "Interview Questions": "What programs do you have experience with?"}, {"date": "17 Feb 2022", "title": "Employer Engagement Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Capilano University", "Interview Descriptions": "A penal interview, started with a role play (pitching to an employer), followed by about 10 questions. \r\nThe interviewers are all very friendly, just by facial appearance you can tell that they want  you to success!", "Interview Questions": "Why you are the best candidate?\r\nWhat is your strength?\r\nWhat's your prefered management style?"}, {"date": "1 Mar 2022", "title": "Lab Supervisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 5 weeks. I interviewed at Capilano University (Vancouver, BC) in Feb 2022", "Interview Descriptions": "The interview was held over Zoom, and began with general questions going over my past work experience, teaching philosophy, and skillsets relevant to the position. I was also asked to prepare a 10 minute presentation based on a prompt related to the program that I would be working for. Afterward, I was allowed time to ask questions in return. Overall interview took less than an hour.", "Interview Questions": "This position often involves problem solving; could you give us an example of problem solving you did in the past?"}, {"date": "8 Sept 2021", "title": "Program Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Capilano University", "Interview Descriptions": "Very thorough and comprehensive with three interviewers attended and lasted for nearly one hour. Interviewers were easy to take to, and each interviewer came up with different questions from different perspectives.", "Interview Questions": "How do you handle stress and pressure?"}, {"date": "17 Feb 2021", "title": "Assistant Department Administrator III Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Capilano University", "Interview Descriptions": "Video call with five person panel. None of them were really interested in the interview. A while later I learned that the position was already aimed at an internal candidate. They do the interview with external candidates just as a smoke screen for the union.", "Interview Questions": "Tell me about yourself, why do you want to work here?,  Why do you think you will be successful in this job?  Weakness and Strengths? Difficult conversation with a manager. "}, {"date": "13 Feb 2022", "title": "Student Success Facilitator Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Capilano University (North Vancouver, BC) in Nov 2020", "Interview Descriptions": "I had one virtual interview that was 1 hour long, with a panel of 6 people. I had to prepare and give a 10 minute presentation about student success. The interview also included about 12 questions and most of these were complex multi-part questions like the example I'm sharing. It was a lot for just 1 hour and felt very stressful and tense to try to get through everything. As a separate part of the interview process, there was also an online eskills test to do at home, which took over 2 hours to complete. It was focused mainly on basic computer skills with lots of focus on typing skills. I did get the job though which is great but the interview experience wasn't the best.", "Interview Questions": "What are some of the key challenges that students in post-secondary institutions face? Outline personal or structural barriers to student success and retention. Identify key student engagement programming areas you would build to help break down those barriers and direct students to supports to address these challenges."}, {"date": "16 May 2023", "title": "Program Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Capilano University (North Vancouver, BC) in Feb 2019", "Interview Descriptions": "I was invited to technical testing first- where I was tested for different MS Suite skills. And then there was a written test. After that, there was a panel interview with 2 interviewers.", "Interview Questions": "What was your experience and education that make you qualify for the job?"}, {"date": "29 May 2018", "title": "Business Development Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Capilano University", "Interview Descriptions": "The interview process was short but efficient. There was a panel of 3 including one HR representative. I was surprised that I was hired after only one 30 min interview. They asked for 2 references.", "Interview Questions": "Do you have experience managing volunteers? Can you give us examples of how you have used social media and digital engagement platforms to engage with stakeholders? "}, {"date": "3 Jun 2017", "title": "Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied through college or university. I interviewed at Capilano University (North Vancouver, BC)", "Interview Descriptions": "Panel of five faculty member and the Dean. Needed to present a 15 minute teaching demonstration on a piece of literature. Questions were difficult and included spontaneous role-playing (i.e. interviewers pretended to be students creating challenging situations).", "Interview Questions": "Do you use a grading rubric?"}], [{"date": "17 Oct 2019", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Capilano University (North Vancouver, BC) in Mar 2017", "Interview Descriptions": "Submitted an application online.  Was contacted a few weeks after the application closed and asked for an interview.  The interview was a panel of 5 people mostly with behavoural type questions.  After the interview, there was a wait before asking for references.  An offer was made a few weeks later.", "Interview Questions": "tell me about yourself"}, {"date": "21 Aug 2018", "title": "Business Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 3 weeks. I interviewed at Capilano University (North Vancouver, BC) in Aug 2016", "Interview Descriptions": "Got the interview through recruiter. Had a brief conversation with one of the managers, afterward was invited to an on-site interview for an interview with Manager, HR and a colleague business analyst. Got offer after that.", "Interview Questions": "past employment, failed and successful projects from the past. "}, {"date": "4 May 2016", "title": "Systems Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Capilano University (North Vancouver, BC) in Mar 2016", "Interview Descriptions": "Submitted my resume and cover letter online. Got a call from HR requesting for onsite interview. It was a panel interview consisting of one HR personnel, IT head and IT supervisor. Questions were a mix of behavioral and technical. The interviewers were very pleasant and kind.", "Interview Questions": "How to explain technical stuff to non-technical managers"}, {"date": "28 Oct 2015", "title": "Maintenance Worker III Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. I interviewed at Capilano University (North Vancouver, BC) in Oct 2015", "Interview Descriptions": "Panel Members Interview including:\r\n\r\nManager, Facilities Building Systems\r\nForeman\r\nMaintenance Worker III – HVAC\r\nHR Advisor\r\n\r\nThey prepared a script and each one of them selected few questions among the list and asked in turns. I read blue prints, interpreted schematics, and answered tons of technical questions.", "Interview Questions": "How to troubleshot HVAC system \r\n"}, {"date": "3 Sept 2018", "title": "Continuing Studies Program Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at Capilano University (North Vancouver, BC) in Jul 2014", "Interview Descriptions": "Huge interview panel for the level of job I was applying for. 2 Managers, Office Supervisor and an HR person. That said, they were all very welcoming and gave me a great perspective of the job and the university.", "Interview Questions": "A student is trying to register for a course but they don't have all of the correct information or documentation. How would you handle this problem?"}, {"date": "7 Sept 2016", "title": "Program Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 3 days. I interviewed at Capilano University (North Vancouver, BC) in Jul 2012", "Interview Descriptions": "It was a straight forward conversation with two interviewers--the director and outgoing program manager. They asked about past experience as well as several situational questions. The interviewers were quite friendly and wanted me to do well. They kept things light and even offered a few amusing quips. The job requires working one on one with students as well as enforcing compliance with rules so they needed to make sure the new hire could do these things. It was important for me to show them that I could with examples from past experience.", "Interview Questions": "Why are you interested in this job?"}]]