[[{"date": "5 Jul 2023", "title": "Occupational Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Kootenai Health", "Interview Descriptions": "The interview panel included the manager and department staff. The questions were a mix of knowledge particular to the hospital setting and also general questions about problem solving and interpersonal skills.", "Interview Questions": "What laboratory values would you consider when completing a chart review?"}, {"date": "2 Apr 2023", "title": "Critical Care RN Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Kootenai Health (Coeur d'Alene, ID)", "Interview Descriptions": "Asked questions about my nursing career, described the job role, orientation process, educational opportunities, environment, types of patients. Interview was completed via zoom with 2 people asking questions. It was laid back and not difficult.", "Interview Questions": "Asked me to talk about myself and my nursing career"}, {"date": "26 Jun 2022", "title": "Schegistrar Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 1+ week. I interviewed at Kootenai Health (New York, NY) in May 2022", "Interview Descriptions": "Reached out to by a recruiter for position. Was kept well informed every step of the process from initial communication all the way through the offer and orientation stages of the process.", "Interview Questions": "What is your definition of empathy?"}, {"date": "9 Apr 2021", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Kootenai Health", "Interview Descriptions": "It was scheduled quickly, on very short notice. However the managers seemed kind. The interviews lasted approx 30 minutes each. I enjoyed hearing their point of views on kootenai health", "Interview Questions": "Describe a time you had a conflict?"}, {"date": "29 Jan 2021", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. I interviewed at Kootenai Health (Coeur d'Alene, ID) in Oct 2020", "Interview Descriptions": "One zoom interview with an assistant manager. Assistant manager was very nice and professional. Very easy to talk to. Got an offer a few days later. They were very flexible with my start day moving from another state.", "Interview Questions": "Tell me about yourself and your experience "}, {"date": "3 Feb 2020", "title": "CMA Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Kootenai Health", "Interview Descriptions": "Applied online, called by manager for interview, asked questions, called a couple days later with job offer, referred to HR for new hire packet and orientation information, NEO, then 2 week training", "Interview Questions": "What was a time you had to show great customer service?"}, {"date": "18 Jun 2019", "title": "Mental Health Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Kootenai Health (Coeur d'Alene, ID) in Oct 2018", "Interview Descriptions": "2 interviews. One with manager and second with charge nurse and other mental health specialist. It was a long process, but well organized.  From when I applied to when I began training it was about a 2 month process.", "Interview Questions": "Why did you apply for this position?"}, {"date": "16 Nov 2018", "title": "Office Coordinao Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Kootenai Health (Coeur d'Alene, ID) in Jul 2018", "Interview Descriptions": "Initial interview with 2 HR recruiters. Second interview with the hiring directors. I was made an offer 1 week after my second interview. After I accepted, I was forwarded on to HR for paperwork, bloodwork, and a drug screening.", "Interview Questions": "Describe your favorite things to do in your role. "}, {"date": "23 Aug 2015", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Kootenai Health", "Interview Descriptions": "Standard interview process and questions.   Behavioral and ethical questions asked.  I first interviewed for a Resource Team position, and by the end of the interview, the manager was looking online at their job postings to recommend other positions for me to apply for.  Nice of her, but kind of awkward!", "Interview Questions": "Standard behavioral and ethical questions."}, {"date": "29 Jan 2019", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Kootenai Health (Coeur d'Alene, ID) in Jul 2015", "Interview Descriptions": "Long distance, over the phone interview with general “get to know you” questions, organizational/time management questions, communication/people skills questions, and personality type questions.  A pretty straight forward, low stress interview.", "Interview Questions": "Describe to me a situation in which you handled a disgruntled patient or guest. "}], [{"date": "21 Aug 2015", "title": "Network Engineer II Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Kootenai Health (Coeur d'Alene, ID) in Jul 2015", "Interview Descriptions": "I applied online for the position, and got a call on Tuesday or Wednesday saying they were hoping to hire a candidate on Friday, and that they would like to interview me Friday.\r\n\r\nI spent too much time in the parking lot getting my suit ready, so by the time I entered the reception area I was probably a minute or two late.  The lady at the front desk answered said on the phone.  \"He just walked through the door now.\"\r\n\r\nIt was a panel interview with four people.  There was the person who scheduled the interview, as well as three people introduced to me as my co-workers.  We then went over HR questions, and job related questions.\r\n\r\nI am a software developer by training, and while I don't have experience with \"Network Engineer\" I tried my best to have an conversation with the interviewers about the job.  I asked them technical questions about the nature of the  job, and what specific problems they have to overcome.\r\n\r\nUnfortunately, I think I misread the nature of the interview.  The answers I got from work-specific questions were vague and evasive.  It felt like the interviewers were purposefully trying to tell me as little as possible about the position.  Through much prodding  I eventually learned that the position didn't require software development skills and that my interviewers were possibly not familiar with writing software.\r\n\r\nUnfortunately, most of the technical part of the interview centered around how I didn't have experience in this title at any of my previous jobs.  I grew frustrated and desperate.  \r\n\r\nAt the end of the interview, I asked my \"co-workers\" as many technical questions as I could in an attempt to \"talk shop\".  Unfortunately the interviewers weren't able to answer my questions.  My questions centered mostly around the particulars of the software implementation such as database replication and failure modes.\r\n\r\nAt the end of the interview.  I felt like the company gave me just enough rope to hang myself and then watched me set myself up for failure.", "Interview Questions": "What sort of experience do you have working in the role of Network Engineer?"}, {"date": "23 Mar 2016", "title": "Human Resources Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Kootenai Health (Coeur d'Alene, ID) in Jan 2015", "Interview Descriptions": "Applications are reviewed by recruiters and forwarded to Hiring Managers for their feedback.  Once a Hiring Manager chooses to move forward an interview is scheduled.  Depending on the position 1-3 interviews are held. References are requested during the interview process.  Once the Hiring Manager selects a candidate, the Recruiters calculate salary based on education and experience and make an offer to the candidate.", "Interview Questions": "I was asked why I wanted to be a part of the Kootenai Health Team."}, {"date": "17 Sept 2014", "title": "CT Technologist On-call Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Kootenai Health in Aug 2014", "Interview Descriptions": "I applied online and interviewed about 3 weeks later.  The interview was in a panel format with the manager and 4 employees, who I later found out were not CT techs, but representatives from the departments various other modalities.  According to the manager, they asked questions that they had come up with on their own consisting of the standard \"rate your strengths and weaknesses, describe how you resolved a difficult situation with a patient & coworker, ect.\" After the interview the Manager told me to expect a call the following week, which I never recieved.  When I called HR, they explained that the recruiter responsible for the position had been out all that week.  Eventually I was called back to \"job-shadow\" the CT techs, which the Manager explained to me was a way of making sure the department was \"a good fit\" for me.  After finishing the job-shadowing, I learned that there was at least two other candidates still in the running for the position.  The Manager told me I could expect a call back the following Tuesday, which I again did not recieve.  The recruiter finally called me back on Wednesday afternoon to let me know that I was not chosen for the position.", "Interview Questions": "What do your previous supervisors think of you?"}, {"date": "31 Jan 2017", "title": "Desktop Support Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Kootenai Health (Coeur d'Alene, ID) in May 2013", "Interview Descriptions": "I had three group interviews and the last with the CIO. They were all very nice. The key was to be very professional and prepared. Dress nice with a tie.", "Interview Questions": "How would you remove a virus?\r\n\r\nWhat to do if a monitor isnt working."}]]