[[{"date": "14 Apr 2023", "title": "Deputy Director Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Bill & Melinda Gates Foundation", "Interview Descriptions": "The entire process took Too long - took over 6 months for them to complete all the interviews and come back to me with offer and even then they were not coordinated", "Interview Questions": "Basic, simple, questions around leadership"}, {"date": "16 Apr 2023", "title": "Senior Program Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Bill & Melinda Gates Foundation (Seattle, WA)", "Interview Descriptions": "I did seven interviews with different members of the team covering a broad range of topics. Interviews were very cordial and relevant for the position. It was great to have the opportunity to speak with such a broad base of the team.", "Interview Questions": "What was I most proud of?"}, {"date": "5 May 2023", "title": "Program Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Bill & Melinda Gates Foundation in Apr 2023", "Interview Descriptions": "The process started off with the HM questioning why I would think I even belonged at the Foundation, due to my \"confusing\" background. I have a very diverse work history. She said \"hopefully\" I can figure out what it is I want to do. I was surprised I was moved to the final round of interviews after this. The final round consisted of 5 interviews lasting 30-45 mins. The hiring team was fine, but at times implied they were better and smarter than I was. I did my best to answer their questions with real examples and followed the STAR method. I followed up with the recruiter multiple times over 3 weeks with no reply. Finally, a manager reached out to me to let me know that particular recruiter didn't work there anymore, and I wasn't selected to move forward anyway. I would never interview here again after the way I was treated by recruiting and this particular hiring team in general. I wasted a lot of time and energy to be treated as \"less than\" by the hiring team and ghosted by recruiting.", "Interview Questions": "How do you prioritize tasks?"}, {"date": "10 May 2023", "title": "Senior Program Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 8 weeks. I interviewed at Bill & Melinda Gates Foundation (New Delhi) in Apr 2023", "Interview Descriptions": "Application on the Job Portal followed by short screening call by the recruiter and 45 min interview with the hiring manager. Both the interviews were based on the CV and hardly any technical questions.", "Interview Questions": "Describe the situation where the escalation on a teammate is needed?"}, {"date": "8 Feb 2023", "title": "Program Officer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Bill & Melinda Gates Foundation", "Interview Descriptions": "I applied through the Gates' Foundation website. A recruiter contacted me and arranged an interview. The recruiter stated to contact them at the beginning of the year as they were shutting down at the end of the year. I contacted the recruiter who stated that they would get back to me. I contacted them again a couple of weeks later and, again, they stated they'd get back to me. They never did. Ghosted.", "Interview Questions": "The typical screening questions concerning experiences."}, {"date": "27 Jan 2023", "title": "Human Resources Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Bill & Melinda Gates Foundation", "Interview Descriptions": "I went thru 9 interviews only to then receive a copy & paste from rejection letter from the Recruiter that was auto sent at 3a.m. I expected a higher caliber of feedback given the process took over 3 months, and I interviewed with every member of the HR Team as well as those who would be clients. From my candidate side, no one seemed to be on the same page and there were indicators of in fighting between previous, or maybe current, people on the HR team. Numerous interviewers emphasized that there was high turnover and a lot of change, but that \"things are getting better\".", "Interview Questions": "Tell me a time you dealt with a difficult client and what was the outcome. Tell me a time you had to use influence with a client and what was the outcome. How do you keep yourself organized. How do you work with a team. How do you build trust with your coworkers and pull your weight in group projects."}, {"date": "30 Jan 2023", "title": "Strategy Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Bill & Melinda Gates Foundation", "Interview Descriptions": "They took a while to get back to me but it was a straight forward process, with a screen, then first round, and then a panel. It was a long process though.", "Interview Questions": "What would your boss say about you in three words?"}, {"date": "18 May 2023", "title": "Senior Program Officer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Bill & Melinda Gates Foundation in Jan 2023", "Interview Descriptions": "When you have to give around 8 interviews for a role, it means that you expect the interviewee to invest a lot of time in the process. It is disappointing then when you come across interviewers that don’t have the right domain knowledge or haven’t even read your CV properly. While some of the people who interviewed me asked technical and relevant questions, others did not. In fact I spent one whole interview trying to convince the interviewer why the cause was important.\nAt the end of investing so much time and effort I wrote a thank you email to the hiring manager but wasn’t even given the courtesy of a response. Never applying to this company again!", "Interview Questions": "Case study question asking me to analyse data related to my domain"}, {"date": "1 Feb 2023", "title": "Senior Program Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Bill & Melinda Gates Foundation (Seattle, WA) in Nov 2022", "Interview Descriptions": "The interview process is one-on-one vs a panel on people. The employees were very personable and the interviews very conversational. Everyone was incredibly energizing and friendly. You can tell everyone is there for because they truly care about the mission and want to make a difference.", "Interview Questions": "How do you help build a team culture?"}, {"date": "3 Feb 2023", "title": "Human Resources Role Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Bill & Melinda Gates Foundation (Seattle, WA) in Nov 2022", "Interview Descriptions": "I had a video screening with the recruiter a week before Thanksgiving. The recruiter appeared distracted/bored during the interview and they eventually just turned off their video halfway through the call. They were also dressed in very unprofessional attire for an interview and interrupted me on nearly every question. They ended the conversation saying they would connect via email on next steps the following week.  I have yet to get that email. After following up twice over the course of a month, I gave up. \n\nThe Gates Foundation is a dream company, with an amazing mission, and considered a best place place to work. My interview experience fell way below that bar and my expectations. Do better.", "Interview Questions": "Tell me a time when you worked with a difficult leader. What was the outcome?"}], [{"date": "3 Aug 2022", "title": "Deputy Director Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Bill & Melinda Gates Foundation (Seattle, WA) in Aug 2022", "Interview Descriptions": "Amable, informativa, muy dispuesta y abierta a dudas. Preguntas adicionales a las típicas de tu perfil. Por ejemplo en Que área del puesto podría requerir apoyo adicional o fortalecimiento? Es la primera entrevista así que es más abierta y ofrecen también información del proceso interno etc.", "Interview Questions": "Es la primera entrevista,’ preguntaron áreas de fortalezas, que área requeriría más apoyo, como me intereso o que sabía de la Fundacion y que creo es una área de la Fundacion que requiere más atención.\r\n"}, {"date": "20 Sept 2022", "title": "Program Officer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. I interviewed at Bill & Melinda Gates Foundation in Aug 2022", "Interview Descriptions": "Many rounds of behavioral interviews and a slow process overall. Expect at least 2 months for most interview processes. Overall friendly interviewers who are on the hiring team and standard behavioral questions. ", "Interview Questions": "Tell me about a time you had to solve a problem creatively? "}, {"date": "22 Jul 2022", "title": "Associate Program Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Bill & Melinda Gates Foundation", "Interview Descriptions": "They do not often provide visas to international applicants and do not make this clear in the postings.  Check before applying.  Interview is easy.  Be prepared to answer why you are drawn to the Foundation.", "Interview Questions": "They do not often provide visas to international applicants and do not make this clear in the postings.  Check before applying.  Interview is easy.  Be prepared to answer why you are drawn to the Foundation. "}, {"date": "25 May 2022", "title": "Portfolio Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Bill & Melinda Gates Foundation", "Interview Descriptions": "Archaic. There was more concern with interviewers sharing their sets of experiences and ivy-league education than with clearly communicating or leading effective conversations. Some interviewers communicated clear disdain for internal processes", "Interview Questions": "Many multi-tiered questions were asked"}, {"date": "11 Jun 2022", "title": "Business Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Bill & Melinda Gates Foundation in Apr 2022", "Interview Descriptions": "Doing an online video interview. A good experience to enhance the interview skill and learned about the detail of the company. Doing an online video interview. A good experience to enhance the interview skill and learned about the detail of the company.", "Interview Questions": "Please tell us about yourself. "}, {"date": "11 Feb 2022", "title": "People Relations Manager/Human Resources Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Bill & Melinda Gates Foundation", "Interview Descriptions": "First interview with recruiter, hiring manager and upon passing those rounds, full interview of 6-8 interviews. Roughly a full day of interviews.\r\n\r\nProvided a good context of role, culture and environment.", "Interview Questions": "What is your process for identifying and overcoming bottlenecks in your projects?"}, {"date": "2 Sept 2022", "title": "Senior Strategy Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Bill & Melinda Gates Foundation in Jan 2022", "Interview Descriptions": "Organized! Received agenda in advance as well as details on who would be performing the agenda. Prior to the day of meetings, there were 2 screening calls, and ended with another call with the hiring manager.", "Interview Questions": "- why I want the job \n- why I want to work for the Foundation\n- Experience with DEIB"}, {"date": "29 Nov 2021", "title": "Senior Program Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 months. I interviewed at Bill & Melinda Gates Foundation (Seattle, WA)", "Interview Descriptions": "First interview with a recruiter and then a series of 3 interviews with increasing management individuals. They warn you the interview process is decently awkward due to a list of highly regulated questions. They are fairly basic questions mostly pertaining to how you handle change, initiative, and a flexible work environment. I reciprocated by asking about company culture and discussing working in a highly matrixed environment with a high degree of autonomy. They are really open to answering questions, but interviews are very time sensitive.", "Interview Questions": "Can you describe a time where you had a give someone the benefit of the doubt? Please be specific."}, {"date": "9 Dec 2021", "title": "Senior Program Officer, Health Systems Design, India Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 2 months. I interviewed at Bill & Melinda Gates Foundation in Nov 2021", "Interview Descriptions": "The hiring team has scant regard for the candidate's time investment.  I was requested to accommodate the hiring manager's work schedule during the festive season whilst I was visiting family. Despite promises to the contrary, the talent acquisition partner took over three weeks to revert citing inability to connect with the interviewer due to competing engagements and different timezones. The final email from her didn't include any feedback on interview specifics, just a stock rejection stating they had decided to go a different direction.\r\n\r\nMy interview with the hiring manager, which was supposed to be highly technical  (per the HR partner) appeared to be a rehash of my resume and almost too focused on gleaning my life story rather than delving into health systems design nuances.  The interviewer was more focused on my choice of universities and whether those were pedigreed enough. The conversation was neither thoughtful nor health systems development centred, as I had hoped it would be. In some cases, I found the questions somewhat patronising and rather sexist. All in all, it was a colossal waste of time.\r\n\r\nAs an aside, the interviewer was rather inarticulate. I was somewhat taken aback that he referred to my varied experience of living, studying and working around the world as having a 'chequered' past (?!), which has unflattering connotations. I am not sure they intended this but was shocked to see such mediocrity helming the Foundation, and this experience has certainly diminished my estimation of it as a prospective employer.", "Interview Questions": "Was your move back from the US to India a case of following your husband around?"}, {"date": "29 Oct 2021", "title": "Senior Business Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Bill & Melinda Gates Foundation in Sept 2021", "Interview Descriptions": "Conversational style interviews with 5 different team members spread over 4, 1 hour interviews. Very friendly and inviting. No curveballs, just open discussion of relevant experience and lots of opportunities to ask questions.", "Interview Questions": "What would be a challenge for you in this role? "}], [{"date": "19 Aug 2021", "title": "Senior Program Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Bill & Melinda Gates Foundation (Washington, DC)", "Interview Descriptions": "Several rounds of interviews, including with HR, the hiring manager, team members, and a “final round” interview. The interviews were dynamic and varied, and questions/responses were thoughtful. Going through the process does take time and energy, but there was clear and helpful communication about what to expect or do at each step. Also, everyone I talked to seemed to care about the issues/work, so regardless, it was a set of good conversations. Positive experience overall.", "Interview Questions": "Can you tell me about the proudest moment in your career? How about when you had to navigate a tough situation?"}, {"date": "15 Jul 2021", "title": "Senior Financial Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Bill & Melinda Gates Foundation", "Interview Descriptions": "Very long (+4  month) process with multiple rounds, some taking almost 6-8 hours. It was a little off putting how they seemed relatively insensitive to the candidates own time investment in the process", "Interview Questions": "What management style works best for you and why? "}, {"date": "15 May 2022", "title": "Software Engineer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 8 months. I interviewed at Bill & Melinda Gates Foundation (Seattle, WA) in Jul 2021", "Interview Descriptions": "This was the longest interview process I've ever had in my career. Each pause between communication from the recruiter was so long that each time I had forgotten that I had applied for the position. There was some serious turnover and dysfunction at the leadership level at that group and they had to farm out the recruiting and interview process to a third party company.\r\n\r\nSo at one point, I had decided to maintain communication with the recruiter because I was actually more curious as to where this 7+ month interviewing process was leading to - than the job itself! (And I was actually about to accept another offer but I really wanted to see where this was headed toward)\r\n\r\nThere was a take home assignment as a starting point for the evaluation. They give you a week to finish it, but I was able to finish it in 2-3 days on and off between downtime and evenings. It was actually kind of interesting.", "Interview Questions": "Take home assignment testing skills in basic SW development cycle tasks and data analysis."}, {"date": "9 Jun 2021", "title": "Program Officer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Bill & Melinda Gates Foundation", "Interview Descriptions": "I was an external candidate who interviewed for a LTE position. My interview with the hiring manager and her team went smoothly. However, another internal candidate came in at the last minute and they decided to go with that candidate.", "Interview Questions": "Tell us about yourself and why are you interested in this role."}, {"date": "6 Sept 2021", "title": "Program Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Bill & Melinda Gates Foundation in Jun 2021", "Interview Descriptions": "I was contacted by the recruiter after I submitted an online application and had a 45-minute phone interview with the recruiter. Then, I was invited for 30-minute interview with the hiring manager.", "Interview Questions": "What was your most challenging project?\n\n"}, {"date": "16 May 2021", "title": "Associate Program Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through other source. I interviewed at Bill & Melinda Gates Foundation", "Interview Descriptions": "I had a 7 hour interview with 8 people. It was really intense and designed to really get to the heart of the applicant. It was also very technical. During the interview I was often told that the position that I applied for was a couple positions below my current job at the time. Nevertheless, it was a great opportunity to get into the donor side of development work.", "Interview Questions": "How do you decide to solve problems when money is no longer a limiting barrier? "}, {"date": "10 Jun 2021", "title": "Program Officer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Bill & Melinda Gates Foundation in May 2021", "Interview Descriptions": "Interviewed for six rounds before being informed that the position I applied for was being cut and will no longer be filling that position even though I was likely going to receive an offer. Great way to add insult to injury. I was also surprised with a writing exercise that I was requested to complete a week before my final interview that really threw me off guard, wished my recruiter or the hiring manager would have given me a notice early in my interview process about a 90-minute writing exercise before asking a candidate to complete a critical writing assessment over Memorial Day Weekend.", "Interview Questions": "Various questions on racial equity/DEI and technical skills. "}, {"date": "11 Apr 2021", "title": "Senior Program Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 3 months. I interviewed at Bill & Melinda Gates Foundation (New York, NY)", "Interview Descriptions": "I applied online. Received email from recruiter. Did a screening interview with recruiters. Then a series of interviews with Programs, Communication and Advocacy staff. Finished off interviews with Directors. Overall great experience. Courteous, engaging and thoughtful conversations.", "Interview Questions": "How does my experience align with the Foundation"}, {"date": "26 Mar 2021", "title": "HR Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Bill & Melinda Gates Foundation", "Interview Descriptions": "The interview process was extensive, with a phone interview with recruiter and hiring manager.  The final round included 4-5 rounds of interviews (group) and three 1:1s with a variety of HR team members.", "Interview Questions": "How would you apply systems knowledge thinking in this role with process improvements? "}, {"date": "9 Mar 2021", "title": "Senior Programme Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 5 months. I interviewed at Bill & Melinda Gates Foundation", "Interview Descriptions": "Lengthy and subjective.  It took  10 interviews and 1 months of waiting and cost me an international call (to add $ to Skype) to Seattle only to be told that my experience is too senior.  The HR partner said that in the end, even though all the interview panels ( direct report, business partners, and the line manager's directorate) voted for me, the hiring manager was unsure.", "Interview Questions": "How do you measure the impact of installing toilets in remote places of Africa?"}], [{"date": "3 Mar 2021", "title": "Program Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Bill & Melinda Gates Foundation", "Interview Descriptions": "A few phone screens and an in-person some weeks later. The technical questions were fairly straightforward and the technical folks were very enthusiastic, but the two interviewers who asked business related questions were neither friendly nor seemed interested in being there", "Interview Questions": "What are acceptable grant endpoints?"}, {"date": "17 Jan 2021", "title": "Summer Associate Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Bill & Melinda Gates Foundation", "Interview Descriptions": "Process started with interview on campus with HR representative after submitting application. HR rep took notes on preferences for interest areas at the Foundation. Second interview was with prospective managers a few weeks later.", "Interview Questions": "How have you dealt with conflict in the workplace?\r\nWhat do you hope to gain out of this experience?"}, {"date": "2 Feb 2021", "title": "Program Officer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 7 weeks. I interviewed at Bill & Melinda Gates Foundation in Nov 2020", "Interview Descriptions": "Completion of a short questionnaire, followed by several calls from an HR consultancy service. It was not clear to me that the consultancy service identified the skills required from the posted job description, as the response was that they needed to clarify with the employer what specifics were needed.", "Interview Questions": "Are you eligible to work in the United States?"}, {"date": "17 Nov 2022", "title": "Program Officer Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Bill & Melinda Gates Foundation (Seattle, WA) in Sept 2020", "Interview Descriptions": "Very rigorous process. Interviewed with multiple members of the team, both leaders and peers. The process may take several weeks to coordinate due to availability. You will get a mix of both subject matter and leadership questions.", "Interview Questions": "Why the organization, and why the particular role"}, {"date": "10 Aug 2020", "title": "Grants Position Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 3 weeks. I interviewed at Bill & Melinda Gates Foundation", "Interview Descriptions": "So many zoom interviews and all for a contracts role. This is the Gates Foundation, right? Why soooo many contracts positions.. can you commit to hiring permanent staff? It’s not like your broke, c’mon.  If you want to go through a whole lot of hoops for a temp job when your well through the mid point of your career go for it. Otherwise go somewhere that values you. I won’t apply here again.", "Interview Questions": "Tell us how your experience and values align with our mission?"}, {"date": "16 Oct 2020", "title": "Senior Technical Advisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Bill & Melinda Gates Foundation in Aug 2020", "Interview Descriptions": "I found the position on LinkedIn, applied to it and sent an inmail to the HR director who posted the position. A couple of weeks later the HR director reached out to me through inmail without even reading my previous message telling me that he came across my profile on LinkedIn and he thinks I am a good fit (I had the same job responsibilities in my current role but on a larger scale and had many years of experience in the same field)\nI replied to him, he responded a week or so later asking to schedule a zoom interview.\n\nThe zoom interview was so unprofessional. I was dressed business casual for the interview while he showed up wearing a flea t-shirt and baseball hat. He had some family moving in his background all the time. He wasn't really concentrating with the discussion. His questions weren't technical of course because he was just an HR guy, but you can't tell the direction of the questions. It felt like he is just asking random questions. As I was out of the state, he told me that they have a relocation package and offered to give more details but we were running out of time so I told him I have some questions that I think it will be better to invest the time left on them.\nHe concluded the interview by telling me that he will talk with the hiring manager and get back to me in 4 days. 18 days later I sent him a follow-up email to see how the discussions with the hiring manager went.\nHe replied a week later telling me that they can't afford the relocation cost and decided to move forward with a local candidate. I told him I wasn't even looking for a relocation reimbursement and reminded him that I told him so during the interview but, of course, he never responded.\nObviously, this wasn't the real reason! And obviously it wasn't a technical reason.. I think their reason is something they can't tell me about. My guessing is that it was something about favoritism or special connections.\n\nBottom line: unprofessional, unpunctual and nontransparent. The name is big but it is definitely misleading.", "Interview Questions": "Tell me about your current responsibilities."}, {"date": "5 Aug 2020", "title": "Program Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at Bill & Melinda Gates Foundation (Seattle, WA) in Jun 2020", "Interview Descriptions": "5 zoom interviews with various members of the team.  Many of the questions were redundant. Overall fairly straight forward. Unfortunately, tend to go with internal hires or folx in administrative roles.", "Interview Questions": "How do you prioritize competing tasks?"}, {"date": "30 Nov 2020", "title": "Senior Communications Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. I interviewed at Bill & Melinda Gates Foundation in Jun 2020", "Interview Descriptions": "This was a long recruitment process, 4 steps that took about 6 months to complete. First with the recruiter, then hiring manager, then group interviews across the offices. Each interaction was professional, and I felt each person was keen to learn more about me and how I could fit in with the organization and team.", "Interview Questions": "How would you improve reputation management for the Foundation"}, {"date": "2 Sept 2020", "title": "Program Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Bill & Melinda Gates Foundation (Seattle, WA) in May 2020", "Interview Descriptions": "Great experience a little long but was a learning experience. Initially, I thought that it would be a quick process but we had back to back interviews and they took over 4 months. I was waiting for feedback for a long time.", "Interview Questions": "What made you want to work with  the foundation "}], [{"date": "19 Apr 2020", "title": "Internship Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Bill & Melinda Gates Foundation", "Interview Descriptions": "The process was good, more around the experiences that I have in life. Not too many technical questions but around why you want to join Bill and Melinda Gates foundation.", "Interview Questions": "Why do you want to join the foundation?"}, {"date": "1 Sept 2021", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. I interviewed at Bill & Melinda Gates Foundation (Seattle, WA) in Apr 2020", "Interview Descriptions": "3 stages, mostly behavioural questions around previous experience, best and worst project experiences, why are you right for the role. First round with HR, second and third rounds with program managers", "Interview Questions": "Why Gates? What’s a moment when you failed?"}, {"date": "15 Mar 2021", "title": "Program Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Bill & Melinda Gates Foundation in Mar 2020", "Interview Descriptions": "The process was very straight forward, and easy to schedule. The recruiter was very nice and helpful. The Bill & Melinda Gates Foundation does incredible work. \n\nAlthough it wasn't a role I was interested at the time, the recruiter was very understanding.", "Interview Questions": "What is your communication style? "}, {"date": "30 Apr 2020", "title": "Summer Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 3 months. I interviewed at Bill & Melinda Gates Foundation in Feb 2020", "Interview Descriptions": "There were two parts to the interviewing process. First was an initial phone interview with a representative currently working for the foundation where they gauged your aptitude for global health work and which teams you would best be suited for. Once passing that, you moved on to a 1:1 interview with the heads of each of the teams they recommended you for. It is the team heads that ultimately offer you a position. I definitely recommend coming prepared with relevant and thoughtful questions since your passion for the subject will set you apart in a pool where everyone has the same education.", "Interview Questions": "Are you familiar with our mission?"}, {"date": "26 Nov 2019", "title": "Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied through other source. The process took 3 months. I interviewed at Bill & Melinda Gates Foundation (Seattle, WA)", "Interview Descriptions": "This was a truly bizarre interview. Hiring manager was very responsive but never proved any updates and the timeline provided was off by months. I doubt I’ll ever receive a rejection. Interviewed in August and still no update.", "Interview Questions": "Why are you interested in the job."}, {"date": "9 Oct 2019", "title": "Program Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 months. I interviewed at Bill & Melinda Gates Foundation (Seattle, WA) in Sept 2019", "Interview Descriptions": "Spoke with HR originally for a different position, but told them that a programmatic role would be a better fit. He agreed, and had me apply pushing me past the initial phone screening to a 3 round interview which took around 2 hours over skype. In the end, I was their second choice, and their first choice accepted the offer. They wanted me to answer how I specifically kept myself organized, offering more detailed examples than what I had given. The second interview asked VERY obtuse questions that threw me off initially. Just be creative and work through the questions!", "Interview Questions": "Q: Working at Gates, there are many hats to wear. What are your favorite hats?"}, {"date": "8 Feb 2020", "title": "Senior Program Officer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Bill & Melinda Gates Foundation (Seattle, WA) in Sept 2019", "Interview Descriptions": "Overall, shocking experience. While some absolutely wonderful people are currently working at BMGF,  unfortunately, the place is filled with impressive CVs that match highly competitive, aggressive and completely toxic individuals. Such a huge disappointment. Lots of potential if this organization was more selective and hired people who are highly accomplished AND balanced souls.", "Interview Questions": "The onsite interview with several people was akin to being interrogated; hard-hitting, hostile and one-sided; it was not a 'conversation.'"}, {"date": "9 May 2023", "title": "Deputy Director Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at Bill & Melinda Gates Foundation (New Delhi) in Aug 2019", "Interview Descriptions": "Relatively short, with the interviewer doing more of the talking than I did. The interviewer clearly had a point of view regarding the reform agenda he wanted to push, so I was more in listening mode throughout much of the process.", "Interview Questions": "How can more pooled health funds be raised to cover health costs for the poor in India"}, {"date": "7 Jun 2022", "title": "Senior Program Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Bill & Melinda Gates Foundation in Jul 2019", "Interview Descriptions": "Patience is required for this long process. \nScheduled for interview over 2 months after applying. Interview with 4-5 different people, it is exhausting but felt fair. \nEach interviewer focuses on a different topic.", "Interview Questions": "How would your current coworkers describe you? "}, {"date": "7 Jun 2019", "title": "Graduate Student Summer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Bill & Melinda Gates Foundation", "Interview Descriptions": "Two rounds of interviews. The first was a short, general interview at my school. The second was a phone interview with the manager of the specific program I was interviewing for.", "Interview Questions": "Walk us through your resume."}], [{"date": "13 May 2019", "title": "IT Program Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Bill & Melinda Gates Foundation (Seattle, WA) in May 2019", "Interview Descriptions": "Applied online and then was contacted by contracted IT HR. Interviewed with the hiring manager we seemed to get along and I thought a clear understanding of the position was established. Next steps was an all day onsite interview with all teams this position would work with. At the end of the day met with Department Head. I sensed when asked once again what my \"strategy\" would be for the position that I would not be selected. I could only go with the job description and what I learned from the team members. I have had this kind of subjective question which resulted in the same declination before. Wondering if other female/minorities have encountered this tactic.", "Interview Questions": "What would your strategy be within the first 30 days?"}, {"date": "23 Jul 2019", "title": "Interim Program Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Bill & Melinda Gates Foundation in May 2019", "Interview Descriptions": "To summarize my experience: hurry up and wait. \r\nI had an initial call with the recruiter, who said they are looking to hire asap. The call took about 15-20 minutes and the recruiter sounded unengaged and uninterested. After two weeks he emailed me that he will be meeting with the hiring manager by the end of the week and will update me after their meeting. The following week I received a request for a phone interview with a team member who had very limited availability, and I was told that the interview had to take place that week since the hiring manager wants to hire some quickly. So I moved things around to accommodate their limited availability. I had a nice call with the team member, who said she will meet with the hiring manager the next day and I should be hearing back from the recruiter by the end of the week.  By the middle of the following week, after I did not hear back from the recruiter, I reached out to him, only to be told that he did not meet with the hiring manager yet and in any way, I shouldn't expect an answer that week because it was employee appreciation week. I was told that the recruiter will reach out to me the following week. Of course, I never heard back from him.", "Interview Questions": "Basic. Why do you want to work for the foundation, how do you prioritize tasks? "}, {"date": "27 Apr 2019", "title": "Program Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Bill & Melinda Gates Foundation (New York, NY)", "Interview Descriptions": "After applying got an email from hr with an intro of manager and to touch back with him for further interview process.. Got a call at an exact time mentioned by Mgr,after two days of the interview I received an rejection email. Not sure what they are looking for as I got rejected for the skills neither mentioned in JD nor asked in interview", "Interview Questions": "Info about Academic and work exp"}, {"date": "30 Jul 2019", "title": "QA Engineer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 4 weeks. I interviewed at Bill & Melinda Gates Foundation (Seattle, WA) in May 2019", "Interview Descriptions": "This place is super unorganized. They will waste your time with multiple interviews and then decide that they want to go a different direction. Do not interview for this company since they don’t care about your time and do not value people. \r\n\r\nNot only will they waste your time with interviews, they will require you to take a skills test.", "Interview Questions": "The different between joins "}, {"date": "3 Apr 2019", "title": "Accountant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Bill & Melinda Gates Foundation (Seattle, WA)", "Interview Descriptions": "The process was very fair and fast and did not waste anyone's time. They got to the point quickly and asked only questions that were to get to know me and how I think and act in varous situatons. It was fun and would do it a gain.", "Interview Questions": "How to sell a pen was a question where they wanted to see if I could create interest with such a simple thing as a pen. I think it is an often used question"}, {"date": "11 Mar 2019", "title": "Senior Salesforce Administrator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Bill & Melinda Gates Foundation (Seattle, WA)", "Interview Descriptions": "I had two phone screens (one with the recruiter, and one with the hiring manager) before being brought in for an on site interview. The day of my interview they changed my schedule from 4 interviews to two, one being a 4 person panel to interview me. I didn't necessarily mind this, but it was a bit jarring to not be aware until that morning that the schedule would be so different. The interview went well, and I received one follow up by the recruiter a week later about the timing of the decision. But the worst part of this interview process is the fact that they never followed up to let me know that I wasn't a fit - to spend all of this time talking to a candidate and then to just ghost them is unprofessional. To me it is really telling that a company doesn't follow up, and it raises a red flag on if they treat their employees well.", "Interview Questions": "They asked me to present a \"case\" or situation from a past Salesforce problem that I had to diagnose, develop a solution, and deliver it. "}, {"date": "8 Mar 2019", "title": "Program Officer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 3 months. I interviewed at Bill & Melinda Gates Foundation (New Delhi)", "Interview Descriptions": "The interview process at the Gates Foundation is pretty lengthy and some times frustrating. On an average there are 8-12 interview rounds. It can anywhere between 6 to 8 months to get a offer post you have applied for the job. The interviewers seem not to be aligned on the job requirements. It is advisable to ask as many questions as possible. Ask specific question on what to expect in terms of performance expectations, stakeholders, career growth and culture of the organisation.", "Interview Questions": "why do you want to join Development sector"}, {"date": "6 Apr 2019", "title": "Interim Communications Officer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Bill & Melinda Gates Foundation (Washington, DC) in Mar 2019", "Interview Descriptions": "Great - pretty casual and informative. What was upsetting is they never followed up to tell me that I wasn't selected. I have a friend at Gates who three weeks later told me two people started a couple of weeks ago - still no follow up communications to me from HR, which I thought was unprofessional.", "Interview Questions": "What do you think qualifies you for this role?"}, {"date": "24 Jun 2021", "title": "Customer Service Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2+ months. I interviewed at Bill & Melinda Gates Foundation (London, England) in Jan 2019", "Interview Descriptions": "easy and well looked after didnt do much asked easy questions. just be your self and you will be fine.  Just answer what you think is right, dont over do it.", "Interview Questions": "Have you had any experiance"}, {"date": "24 Oct 2018", "title": "Technicien électronique Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Bill & Melinda Gates Foundation (Djaména)", "Interview Descriptions": "nous avons eux a faire de notre parcoutr electomecanisque à la faculté des science exactes et appliquées de farcha je serais disponible pour vous servir en electronique oubien en informatique ou electricité", "Interview Questions": "on nous dit d'ajouté le cv"}], [{"date": "9 Oct 2018", "title": "Program Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Bill & Melinda Gates Foundation", "Interview Descriptions": "Was quite interesting and thr hiring manager was calm and friendly. Although a bit detached from what my current role was at that period.\r\n\r\nI felt the questions slightly did not relate to the job role. They also needed someone with a background in grant management while i had a back ground only in project management", "Interview Questions": "How to report validate the integrity of data coming out of the field across several locations without necessarily being there.\r\n What processes do I take when doing budget forecast"}, {"date": "9 Nov 2018", "title": "Deputy Director Global Analytics and Reporting Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 2+ months. I interviewed at Bill & Melinda Gates Foundation (Seattle, WA) in Oct 2018", "Interview Descriptions": "I met with the Hiring manager in Aug, he said the process would go quick, within three weeks.    It took two months from the time I met with him until they setup an interview loop.  The interview loop included some big titles, including CIO and CHIEF BUSINESS OPERATIONS OFFICER.      After loop they said that they would make a decision by end of the week.  Instead they added two more interviews via phone and dragged it out another two weeks.  Then they called me week after week and said they are working on a decision.  After two more weeks passed, they disappeared.  I sent an email to the recruiter multiple times and no response.   Finally sent an email to hiring manager as well asking him for some type of response.    Sent one last email to recruiter, explained I have other offers and need to make a call.  He immediately called me back and said they extend the offer to a different candidate.", "Interview Questions": "All the interviews were very generic type of questions, how do deal with conflict, my management style, my previous work experience, etc... "}, {"date": "30 Apr 2019", "title": "Senior Program Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Bill & Melinda Gates Foundation in Sept 2018", "Interview Descriptions": "For this role, we started with a phone screen with a recruiter, which was followed by a phone interview with the hiring manager. Had my candidacy proceeded, this would have been followed by an in-person interview.", "Interview Questions": "The screen with the recruiter was the usual fare, non-technical. With the hiring manager, almost exclusively technical questions related directly to public health. "}, {"date": "18 Apr 2018", "title": "Program Officer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Bill & Melinda Gates Foundation in Jan 2018", "Interview Descriptions": "Questions were based on top level experiences.  Because I had a couple other interviews and offers on the table, I asked to be updated as they progresses with interview rounds.  I was promised by HR that they would, because they value candidates' time.  Funny, because I was ghosted, despite attempts to get in touch.  Even if I bombed the interview (which I don't think be cause I was told \"good answer\" etc),  a professional courtesy of an automated rejection would be nice.", "Interview Questions": "Can you go through your time at company x?"}, {"date": "6 Nov 2018", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. The process took 6 months. I interviewed at Bill & Melinda Gates Foundation (Seattle, WA) in Jan 2018", "Interview Descriptions": "very rigorous, case study question on developing social issues, but very respectful. you need to have a good flow of thoughts, also it's a conversation we are all human no need to be crptic", "Interview Questions": "What will you bring to the team that other MBA candidates won't ?"}, {"date": "25 Sept 2020", "title": "CCM Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Bill & Melinda Gates Foundation in Jan 2018", "Interview Descriptions": "Called me on the phone and asked me 10 questions. The lady was friendly and hopeful, advised of next steps for second interview  received a call approximately a week later", "Interview Questions": "name a time you were under pressure"}, {"date": "25 Feb 2018", "title": "Intern Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Bill & Melinda Gates Foundation (Seattle, WA) in Dec 2017", "Interview Descriptions": "Applied for a role in their investments area. Had around 6 interviews that day. Everyone was fairly friendly. Mix of single and 2:1 interviews and almost all behavioral questions. Fairly quick communication in the whole process.", "Interview Questions": "Why do you want to work here."}, {"date": "23 Nov 2017", "title": "Strategy Officer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 months. I interviewed at Bill & Melinda Gates Foundation", "Interview Descriptions": "I had four rounds of interviews including two on-site in the Beijing office. In total six in-person or phone conversations, three of them with deputy directors. Every time I was told I have successfully progressed to the next round and I was the only one who made it to the final round.  However, it appears no serious decision was made throughout the process and I was simply asked to talk to more people to kick the can down the road.  All conversations were conducted in a very friendly and professional way but in the end, no offer was given to anyone and the post was left open over six months after it was posted with no immediate need to actually fill it. As a big fan of the Foundation, I was left with more admiration for its cause but serious doubt over its focus on efficiency and effectiveness.", "Interview Questions": "An example of how you helped to reach consensus."}, {"date": "18 Oct 2017", "title": "International Program Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Bill & Melinda Gates Foundation", "Interview Descriptions": "First round interview with a very friendly recruiter (contracted by the Foundation, not direct HR employee).  It was a pleasant conversation - not  so scripted though they asked specific questions about experience and qualifications.", "Interview Questions": "Where do you see yourself in 5 years' time?"}], [{"date": "1 Jul 2020", "title": "Senior Program Officer, Global Development Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 6 months. I interviewed at Bill & Melinda Gates Foundation (Seattle, WA) in Mar 2017", "Interview Descriptions": "The selection process is long - don't expect a quick resolution. The process I went through involved an initial screening call with the recruiting partners, then a brief and fairly relaxed phone interview with the hiring manager. The final (and main) event was a day of interviews in Seattle - a succession of 6 back to back 1 hr interviews, all 1:1, with a variety of people from across the organisation. They take hiring very seriously - after I'd accepted the offer and joined I participated from the other side and I can honestly say that the process is very well prepped, with lots of recruiter support, and the selection decisions are taken very carefully and after a good deal of deliberation. The whole process from my first screening call through to being sent an offer was about 6 months. The 1:1 interviews were more draining than difficult, mainly due to jet lag", "Interview Questions": "\"What's your superpower\" seems to be a commonly asked question"}, {"date": "14 Oct 2017", "title": "International Business Development Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Bill & Melinda Gates Foundation (New York, NY) in Jan 2017", "Interview Descriptions": "talking about me how will working in Gates foundation and how I think and I Change the programs , how I see the neww progrms and how I do it , of course I try to do best .", "Interview Questions": "N/A"}, {"date": "12 Mar 2018", "title": "MBA Summer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 months. I interviewed at Bill & Melinda Gates Foundation in Jan 2017", "Interview Descriptions": "The Gates Foundation only recruits from a select number of institutions. The first round is a phone interview with the HR recruiter, and the second round is with a manager on the program team with which you may work. Both rounds are via phone.", "Interview Questions": "How will this internship enhance your MBA experience?"}, {"date": "22 Oct 2017", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 4 months. I interviewed at Bill & Melinda Gates Foundation (New York, NY) in Dec 2016", "Interview Descriptions": "3 interview rounds, multiple types of managers, not very organized, expected no offer based on availability and then was pleasantly surprised a month later, need more touchpoints to see how this experience would be great for an MBA", "Interview Questions": "Passions? Connectivity to Gates? Previous Work Experiences, Situational/Behavioral Questions"}, {"date": "3 Jan 2017", "title": "Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Bill & Melinda Gates Foundation (Seattle, WA) in Nov 2016", "Interview Descriptions": "Telephonic & one on one interview, pleasant and very easy going on both interviews, though I was so nervous they made it so easy for me to express myself. I wasn't hired but I am positive this wasn't my last interview process with the organization.", "Interview Questions": "If we were to ask your current employer about you, what would he/she say?"}, {"date": "2 Dec 2017", "title": "Associate Program Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Bill & Melinda Gates Foundation in Jun 2016", "Interview Descriptions": "At the time of shortlisting I was in Rwanda and the initial shortlist  interview was over phone with HR in June 2016 and I was told it will be followed up by second round with the SPO. I was also suggested to ask any known colleague working in the foundation to send a reference note for me. In July 2016, I was informed by HR that I have not been selected for the next round. I was disappointed but have been applying all relevant positions fit to my profile since then. Hoping to get shortlist some day.", "Interview Questions": "How do you think you are fit for this role?"}], [{"date": "13 Feb 2020", "title": "Legal Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Bill & Melinda Gates Foundation (Seattle, WA) in Jun 2016", "Interview Descriptions": "I was hired as a contractor through an employment agency.  They coordinated all initial interviews.  There was the initial screening process through them, then phone screen w/ Gates, then an onsite interview with the team.", "Interview Questions": "I don't remember, but it was a very supportive and friendly interview.  More conversational than scripted. I will say though that this process is very specific to the team.  I had interviewed with other teams there that were completely different."}, {"date": "16 Nov 2015", "title": "Program Officer Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Bill & Melinda Gates Foundation", "Interview Descriptions": "I had a brief phone interview. The impression that I got from the organization is that they are very selective about who works there and feel that the people need to have a very impressive resume.", "Interview Questions": "What is the big problem that you would like to solve in the world?"}, {"date": "3 Nov 2015", "title": "Program Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Bill & Melinda Gates Foundation (Seattle, WA) in Oct 2015", "Interview Descriptions": "The whole process consisted of a recruiter screening call (recruiter was friendly and positive), a call with the hiring manager (I found her serious and hard to read on the phone), and a half day of in-person interviews (interview with other department lead, panel interview with team, one-on-one with hiring manager). After that, they checked my references and then made me an offer. The full process from application to offer took about 2.5 months.", "Interview Questions": "They asked a lot about my prior work experience and a lot of questions about how I would approach various challenges relevant to the job. I found the questions pretty easy, mainly because the role was a very good fit for my work experience. They knew what they were looking for and I found all the questions very relevant."}, {"date": "12 Oct 2015", "title": "Project Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Bill & Melinda Gates Foundation", "Interview Descriptions": "Phone calls and then made it through to a full day interview. During the full day interview the first person to interview me was just rude. She leaned back in her chair, arms crossed, looking out the window and didn't make eye contact. Clearly had no desire to like me. Tough....", "Interview Questions": "Details about what I thought I could bring to the project, my work history, why I wanted to be at Gates etc."}, {"date": "18 Sept 2015", "title": "Program Officer, Global Health Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 3 months. I interviewed at Bill & Melinda Gates Foundation (Seattle, WA)", "Interview Descriptions": "Same process as described by others, informal interview (telephone) with HR (senior recruiter), informal interview (telephone) with team lead, flown out for one-day interview with 7 members of senior staff, one-on-one interviews, on the hour, every hour. It is a long day but I enjoyed the opportunity to have one-on-one with different individuals as opposed to a pane.", "Interview Questions": "What do you bring to our team of experts, what would you change about this organisation, why do you want to work here."}, {"date": "8 Nov 2017", "title": "Senior Program Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Bill & Melinda Gates Foundation (Seattle, WA) in Sept 2015", "Interview Descriptions": "Initial phone screening by in-house HR recruiter.  One day/ 7 hours in-person, 45 minute - 60 minute 1:1 interviews with different staff with varied seniority and functions.  Two recruitment process status update phone calls initiated by the in-house HR recruiter following on the in-person interview.", "Interview Questions": "(subject matter expertise question) Of the proven and promising program strategies, where do see an opportunity to invest additional resources toward achieving scale?  "}], [{"date": "27 May 2015", "title": "Senior Program Officer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 5 weeks. I interviewed at Bill & Melinda Gates Foundation", "Interview Descriptions": "They tend to over-sell the position and hire over-qualified people, which results in disappointment and frustration afterwards. There's high leadership turnover and they are usually not forthcoming during the interview process. For Program Officer jobs, be prepared that a big percentage of your time will be spent on managing internal stakeholders and administrative matters as opposed external-facing work in the field with partners.", "Interview Questions": "Nothing out of the ordinary."}, {"date": "2 Sept 2015", "title": "Communications Officer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 3 months. I interviewed at Bill & Melinda Gates Foundation (Seattle, WA) in Jul 2015", "Interview Descriptions": "The process started with a phone conversation with HR, and was followed up with a few phone conversation with people from the team, then meetings on the Seattle campus. Each step of the way, I met incredibly smart and kind people who were all very happy to talk with me about the position. \r\n\r\nWhile the interviews were not challenging the process was three months long and ended in a no. Considering the length and time it took to get to this no...that is what is challenging. My biggest piece of advice would be: don't put your eggs all in this basket, regardless of how many interviews you have or how nice the people are. Keep looking and applying other places.", "Interview Questions": "Tell me about yourself in high school?\r\nAre you comfortable measuring your results, how?\r\nGive me a brief overview of yourself and how it relates to the job?\r\nWhat are we NOT doing that you think we should be?"}, {"date": "24 Apr 2015", "title": "Program Officer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Bill & Melinda Gates Foundation (Seattle, WA)", "Interview Descriptions": "I had two sessions of over 30 minutes interview on phone. It took a while to fix a date for the first interview with the HR recruiter. On both occasions, the questions were fair and both the HR interviewer and hiring manager very friendly.", "Interview Questions": "Why do you want to work for the BMGF?"}, {"date": "16 Oct 2015", "title": "Executive Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 1 week. I interviewed at Bill & Melinda Gates Foundation (Seattle, WA) in May 2015", "Interview Descriptions": "Detailed discussion of the most relevant global health and global development issues faced by the client. I was asked to prioritize invest areas for the Foundation and then detail how to address a chosen intervention and its cost-benefit.", "Interview Questions": "How would you apply technology innovation to the developing world?"}, {"date": "26 Feb 2015", "title": "Research Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 2+ months. I interviewed at Bill & Melinda Gates Foundation (Seattle, WA)", "Interview Descriptions": "The interview process is long and tedious, but I found the people to be very friendly and gracious throughout. Be prepared to answer the same basic questions about yourself for each person that comes in.", "Interview Questions": "why do you want to work here?"}, {"date": "21 May 2015", "title": "Senior Program Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Bill & Melinda Gates Foundation in Feb 2015", "Interview Descriptions": "All interaction with the HR staff was extremely professional and positive.  The initial screening phone call lasted about 45 minutes and involved a thorough explanation of the  organization and the position and then discussed my experience and goals. I was asked for specific examples of experiences that fit the profile they were looking for.", "Interview Questions": "What type of work environment are you looking for?\r\nBased on what we have discussed about the skills needed for  this position, what do you think your weakest areas are?"}, {"date": "8 Jun 2015", "title": "Program Officer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Bill & Melinda Gates Foundation (Seattle, WA) in Jan 2015", "Interview Descriptions": "I interviewed by phone first, which was standard. My in-person interview lasted all day, with one-on-one interviews from 4-6 members of the team. The interviews took place in various locations, but mostly in one of their small meeting rooms. At least one was by telephone-conference. \n\nFor such a high-end outfit I was a bit disappointed. They were late several times, had glitches with the technology, and at least one interviewer was rude, questioning my reasons for applying, and insinuating on the spot I wasn't cut out for the environment. \n\nI was notified by phone that I did not get the position and told it was going to someone else. Ironically, I have since seen the position posted multiple times.", "Interview Questions": "How might you address xyz problem?"}, {"date": "23 Mar 2015", "title": "Program Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Bill & Melinda Gates Foundation in Jan 2015", "Interview Descriptions": "I was invited for a phone interview for two different positions then had a follow-up interview in  person.  The phone interview lasted for an hour or so then the in person interview is several hours long.  The campus is nice, and people have been friendly.", "Interview Questions": "Why do you want to work for the BMGF?"}, {"date": "20 Oct 2015", "title": "Senior Communications Officer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 4 months. I interviewed at Bill & Melinda Gates Foundation (Seattle, WA) in Jan 2015", "Interview Descriptions": "I was screened by HR on the phone and then had a phone interview with the hiring manager. After that interview I didn't hear back for months, until they hired someone else.", "Interview Questions": "Write one tweet about yourself? (Really?!?!)"}, {"date": "5 Oct 2015", "title": "Program Officer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 months. I interviewed at Bill & Melinda Gates Foundation (Seattle, WA) in Dec 2014", "Interview Descriptions": "This was a long, drawn out process over a period of four months before an offer was extended.  It involved three trips to Seattle Washington and a series of phone interviews.  For the most part, the same people were seen, however there was always one addition durnig each in person interview. Overall it was a lengthy process from start to finish, and while a few of the interviewers were excellent in their questioning, the others were generally more interested in talking about their own experiences at the foundation.", "Interview Questions": "The normal set, experiences that would be relevant, etc.  They actually did more talking than listening."}], [{"date": "19 Feb 2015", "title": "Senior Program Officer, Global Health Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 days. I interviewed at Bill & Melinda Gates Foundation (Seattle, WA) in Dec 2014", "Interview Descriptions": "It was a series of back to back 1:1 interviews with key team members.  Nothing too difficult.  Some Interviewers were more prepared than others, for example, some clearly had only just glanced at my resume, while others had very specific questions.", "Interview Questions": "What was your leadership, technical, and disease specific experience?"}, {"date": "26 Nov 2014", "title": "Intern Interview", "results": "No Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Bill & Melinda Gates Foundation", "Interview Descriptions": "It was a one and one interview with the HR manager. She was very nice. The question was pretty behavioral questions. Why do you want to join? What is your career plan? She also asked about the community involvement and volunteer work.", "Interview Questions": "N/A"}, {"date": "30 Oct 2014", "title": "Program Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Bill & Melinda Gates Foundation in Oct 2014", "Interview Descriptions": "First is the initial phone interview with the recruiter. I had two for two different positions. They were both very different interviews. However the recruiters were really professional and knowledgeable about the position, and the foundation. I can respect a place and its employees when they are upfront and honest. After the first phone interview they said they would pass my information on to the hiring manager for review and then I would have another phone interview depending upon the review of my resume and notes from the first interview. The hiring process can take up to a couple of months.", "Interview Questions": "The questions really relate to why you want the job and how you feel you qualify. Review you resume and have an understanding of what they are looking for in a candidate."}, {"date": "17 Sept 2014", "title": "Project Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Bill & Melinda Gates Foundation", "Interview Descriptions": "No surprises.  Same standard interview questions from interviewer to interviewer.  \r\nGenerally nice, but stressed, people.  \r\nIt seemed to take them a long time to schedule the interviews, and they kept adding interview dates after saying the current one was the last one.  It became quite an investment.  \r\nThe facility was very nice.  Lots of windows.  But area traffic was horrendous.", "Interview Questions": "Describe your approach to a particular project related problem that had challenging political, executive management, stakeholder and internal relationship dimensions to it.   "}, {"date": "26 Jul 2014", "title": "Program Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 2 weeks. I interviewed at Bill & Melinda Gates Foundation (Seattle, WA)", "Interview Descriptions": "My interviewer (an HR employee) was incredibly rude. For instance, they asked me why my degree even mattered since I was applying for an administrative position, even though the administrative job description listed research directly relating to my degree field as one of the job tasks. Job interviews go both ways, and my interviewer did not portray the Gates Foundation in a positive light. At first I was disappointed that I did not get the job but looking back I am so glad that I do not work for the Gates Foundation if it has such a negative work environment.", "Interview Questions": "Why does your degree even matter since this is an administrative position?"}, {"date": "4 Aug 2014", "title": "Communications Officer Interview", "results": "No Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I interviewed at Bill & Melinda Gates Foundation", "Interview Descriptions": "First spoke with recruiter, then hiring manager. Hiring on hold while reorg communications department. Know that hiring can take time at the foundation. Really varies on the department, people hiring, etc. Everyone was always very friendly about me touching base.", "Interview Questions": "Describe yourself in college."}, {"date": "27 May 2014", "title": "Associate Program Officer Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Bill & Melinda Gates Foundation", "Interview Descriptions": "It took quite a while and involved many interviews (some with people I didn't ever interact with in the job), but it didn't feel excessively strenuous. There was not a homework assignment, but some questions required talking through a scenario. Because people are spread out, some of the interviews were over video conference which can be awkward.", "Interview Questions": "Nothing too unexpected."}, {"date": "16 Apr 2014", "title": "Senior Program Officer Global Development Interview", "results": "No Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 4 weeks. I interviewed at Bill & Melinda Gates Foundation (Seattle, WA)", "Interview Descriptions": "Interview started witha screening call from HR and went on to a full day of interviews. People that work with the position being offered came in and out of the room to interview throughout the day.", "Interview Questions": "N/A"}, {"date": "10 Mar 2014", "title": "Operations Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Bill & Melinda Gates Foundation (Seattle, WA)", "Interview Descriptions": "Hired on after being a temp for a few months. The organization decided I was the best fit for the position after months of periodic extension via a temp agency. So, the natural thing was to hire me, considering I'd done the job very well.", "Interview Questions": "N/A"}, {"date": "28 Apr 2014", "title": "Human Resources Business Partner Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Bill & Melinda Gates Foundation (Seattle, WA) in Feb 2014", "Interview Descriptions": "Within the following week of my application, they called me up.  So good timing in that regard.", "Interview Questions": "After 15 minutes on the phone with a recruiter, was deemed not a good fit without specifically pinpointing why I was not a good fit.  Also, I was mildly insulted when the recruiter mentioned they will keep me in mind if there is a \"lower ranking position\" in the same department that opens up."}], [{"date": "27 Nov 2013", "title": "Associate Program Officer, Global Development Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at Bill & Melinda Gates Foundation (Seattle, WA)", "Interview Descriptions": "I applied to the position through a former colleague and therefore got a response within a day. A half hour phone interview was scheduled for later that week. That call described the position in more detail and asked questions mostly relating to my employment history and specific skills, such as describing my experience with cost-benefit analysis. Following this interview, I was invited out to Seattle for an in-person interview with five members of the team. Each person had a different \"set\" or \"theme\" of questions to ask, such as culture (e.g. What's your work style?), motivation (Where do you see your career in five years?), and fitness (Describe a time you had to work on a project you knew nothing about. What did you do?). The role was also further clarified, and I was invited to ask questions myself. Because one of the team members was unavailable that day, I had a follow-up phone interview with him two days later that was more technical (e.g. What do you see as the biggest challenge in conducting cost-benefit analysis for health programs?). I received the offer one week after this phone call.", "Interview Questions": "\"If we hired another candidate instead of you, what do you think that candidate would have that you do not?\""}, {"date": "23 Nov 2013", "title": "Program Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Bill & Melinda Gates Foundation (Seattle, WA)", "Interview Descriptions": "Interview process was straightforward - five interviewers across four or five hours. Seemed to be a bit much for an assistant position, but is now the norm many places. Some of the interviewers seemed to be lost on the interview process and had trouble answering my questions. However, the interviewers were extremely candid about the negatives surrounding the job - which I was taken aback by.", "Interview Questions": "The scenario-based questions were tough, but as long as you know your experience and how it can apply, you should be okay."}, {"date": "13 Oct 2013", "title": "Program Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 5 weeks. I interviewed at Bill & Melinda Gates Foundation", "Interview Descriptions": "The interview process was long - 2 in-person and 1 phone interview. The last in-person interview was about 3 hours, meeting with 4-5 panels of different people who essentially asked the same questions. Several of the interviewers were unprofessional and most were currently in the same position as the one I was interviewing for. Only one senior-level person was present, even though the position supports several senior project officers. It seemed like the whole interview process was about finding someone who had the personality that would 'fit in,' while work experience wasn't heavily emphasized.", "Interview Questions": "What was the most difficult thing that happened to you in the last year?"}, {"date": "26 Apr 2017", "title": "Program Officer, Strategy Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. I interviewed at Bill & Melinda Gates Foundation (Seattle, WA) in Oct 2013", "Interview Descriptions": "4 case interviews, 2 behavioral interviews. Prepare questions around \"why gates\", \" why job\", what can you bring others cannot bring. Prepare for case interviews - break down the problem into logical pieces and follow through till the end of the logical branch. Your reasoning process is more important than the result.", "Interview Questions": "Think of cases in non-profit sector. "}, {"date": "18 Mar 2014", "title": "Associate Program Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. I interviewed at Bill & Melinda Gates Foundation (Seattle, WA) in Aug 2013", "Interview Descriptions": "I was contacted by a recruiter. I had a lengthy phone interview with the recruiter and then a lengthy phone interview with the hiring manager. I was invited out for a full day interview with about 5-6 members of the program staff. Entire process from first contact with recruiter to final decision was about 5 and a half months. The people were very nice from start to finish. You can tell it is a demanding environment and that the staff are extremely bright and passionate. I had a positive experience interviewing with BMGF.", "Interview Questions": "I was asked many things about strategy that I felt I would only know if I were internal to the organization. e.g., if you were faced with project proposal x or y, which would you choose? I was also given a business case in one of the interviews although the position was not a business-focused position. It was a bit out of place. I suppose they wanted to know how I think/reason/process new information. "}, {"date": "8 Jul 2013", "title": "Project Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Bill & Melinda Gates Foundation (Seattle, WA)", "Interview Descriptions": "phone interview", "Interview Questions": "none.  It was easy and very professional."}, {"date": "21 Jun 2013", "title": "Program Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Bill & Melinda Gates Foundation in Jun 2013", "Interview Descriptions": "A few weeks after applying online I was contacted by an HR recruiter and had an initial phone interview. Common questions-- Why do you want to work at the foundation, how do you deal with conflict, etc. If they were interested I would meet with 3 to 4 individuals for one on one interviews.", "Interview Questions": "A question was asked something to the effect of my experience with Capitol Hill politics."}, {"date": "31 Jul 2013", "title": "Human Resources Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Bill & Melinda Gates Foundation (Seattle, WA) in Jun 2013", "Interview Descriptions": "Process began with telephone interviews with recruiter and then hiring manager.  Was invited for onsite interviews with others in the Dept and also functional client group leaders. Great people, amazing work. I was disappointed not to be offered position to join the team, however will continue to watch the incredible outcomes the foundation supports in Global Health & US Education.", "Interview Questions": "\"If you wrote a book on how to be the best HR Business partner - tell me what is in your table of contents\"  Excellent question!"}, {"date": "7 Dec 2013", "title": "Program Coordinator Temporary Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through a staffing agency. The process took 2 weeks. I interviewed at Bill & Melinda Gates Foundation (Seattle, WA) in Jun 2013", "Interview Descriptions": "I contacted a temp agency that interviewed me.  They then sent me to another temp agency onsite at the foundation for a second interview.  That agency set up a third interview with the department.  The department interview was round-robin with three different people.", "Interview Questions": "Why am I going the temp route?"}, {"date": "9 Jun 2013", "title": "Business Systems Analyst Interview", "results": "No Offer", "experience": "N/A", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Bill & Melinda Gates Foundation in Jun 2013", "Interview Descriptions": "Was contacted by someone from HR. Friendly person who told me about \"the foundation\" which I already read about on website. I was sad that I was getting a sales pitch during my talk time.  First interview was 1 hour long. I was told the hiring process would be 60 or so days from today.  That is far to slow for me.", "Interview Questions": "What mistake have you made and what was the impact of the mistake?"}], [{"date": "22 Feb 2014", "title": "APO Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Bill & Melinda Gates Foundation (Seattle, WA) in Jun 2013", "Interview Descriptions": "Each interview had a very different description of the job...none of which was in the job description.", "Interview Questions": "General inconsistency. Very focused on new research without any interest in leveraging existing education research"}, {"date": "2 Aug 2015", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Bill & Melinda Gates Foundation in Apr 2013", "Interview Descriptions": "The beijing office posted internship opportunities on the Chinese social media site Weibo. Written an email to contact them, received quick response, soon had a telephone interview and later follow up telephone calls and email exchanges. I wasn't in Beijing at the time, so didn't have a face-to-face interview. all in all quite straightforward, as long as you show passion and ways you can contribute to the office.", "Interview Questions": "What is the most pressing issue that concerns you and how can Gates Foundation help"}, {"date": "12 Jan 2013", "title": "Program Officer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 months. I interviewed at Bill & Melinda Gates Foundation", "Interview Descriptions": "You are left alone in a room and each interviewer comes in and asks a series of questions for an hour and leaves. A boxed lunch is brought in at lunchtime that you eat alone. Usually, there are 6-7 such one hour interviews throughout the day.", "Interview Questions": "N/A"}, {"date": "18 Dec 2012", "title": "Project Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 1+ week. I interviewed at Bill & Melinda Gates Foundation (Seattle, WA)", "Interview Descriptions": "After an initial interview with the external agency and online MS Office skills assessment, multiple 1:1 interviews were held on campus with the members of the team with whom the selected candidate would be working. The campus is stunning, and everyone was professional and welcoming. LinkedIn was part of the post-interview due diligence, but none of the supplied references were contacted.", "Interview Questions": "All questions were related to perceived lapses in experience or skills with respect to the duties and responsibilities of the position, offering the opportunity to clarify and elaborate upon the information contained in the resume. "}, {"date": "3 Jan 2013", "title": "Business Analyst Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 3 months. I interviewed at Bill & Melinda Gates Foundation (Seattle, WA) in Dec 2012", "Interview Descriptions": "campus recruitment", "Interview Questions": "43.\tDescribe a creative solution to a problem you faced?\r\n44.\tWhat was the last technology you learned?\r\n"}, {"date": "19 Dec 2012", "title": "Senior Program Officer Interview", "results": "No Offer", "experience": "N/A", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Bill & Melinda Gates Foundation (Seattle, WA) in Nov 2012", "Interview Descriptions": "Applied online August 2012. Received first phone call 3 months later from hr recruiter for first screen. She spent the precious interview time to discourage me to pursue the process since I mentioned I had another opportunity coming soon. She was supposed to contact me back to answer some questions but she never followed up.  I learned online I was not selected...never ha'd opportunity to discuss my interest or background.  If you want to get a chance to reach the hiring manager....consider to lie on your current working status.", "Interview Questions": "Not expecting to have to deal with a purely administrative question.... The interview was supposed to review my credentials and interest.... I had to deal with unprofessional hr staff."}, {"date": "17 Sept 2012", "title": "Senior Program Officer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 3 months. I interviewed at Bill & Melinda Gates Foundation", "Interview Descriptions": "Two months after submitting my resume, I received an email on a Friday that the HR recruiter wanted to talk to me on Monday. Our 30 minute conversation lasted over an hour. Very ordinary interview with no difficult questions. He said he'd get back to me in two weeks and I was welcome to inquire via email in the meantime. I reached out at three weeks and it took him a week to respond.", "Interview Questions": "Nothing out of the ordinary was asked."}, {"date": "22 Jun 2012", "title": "Grants Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Bill & Melinda Gates Foundation in Jun 2012", "Interview Descriptions": "Applied online and was fairly quickly emailed by their recruiter who wanted to set up a 30-minute screening phone call.  When we spoke, the recruiter told me about the position, what they were looking for, the process, and asked for some clarification about my skill set.  She was very personable and warm, and told me each step of the process.  She let me know within a week's time what my status was regarding the candidacy for the position.", "Interview Questions": "None. Straightforward questions asked about experience."}, {"date": "29 Oct 2013", "title": "Grants Administrator Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Bill & Melinda Gates Foundation (Seattle, WA) in May 2012", "Interview Descriptions": "After submission of my application online it took about two weeks for a recruiter to reach out to me. After initial contact I went through two phone interviews and was then invited to Seattle for a full day of interviews. This took a full 8 hour day and consisted of 6 interviews 1 hour each. Some were 1:1 and others were 2:1. Each interview was different depending on the person. Some has specific questions, some wanted to talk through my experience. Overall just being at the Foundation for 8 hours was a little overwhelming. The interviews were pretty normal.", "Interview Questions": "clearly no one had read my resume or even cared about it. I had spell out everything that was already included on the resume, as well as the items you generally discuss. Make no assumption that any preliminary effort was made before each interview. "}, {"date": "17 Feb 2013", "title": "Graduate Intern Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at Bill & Melinda Gates Foundation (Baltimore, MD) in Mar 2012", "Interview Descriptions": "Submitted resume and cover letter through career fair.  Get a 30min interview after a week.  Most of them are general behavioral questions.  They want you to tell them your research experience.  What is your career goal and why do you want to work for them.", "Interview Questions": "no very difficult questions."}], [{"date": "23 Jul 2015", "title": "Program Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2+ months. I interviewed at Bill & Melinda Gates Foundation (Washington, DC) in Feb 2012", "Interview Descriptions": "Very long process.\r\nMultiple rounds of interviews with different levels ...\r\nMust care about the mission of the organization \r\nBe prepared to speak about projects you worked on ...\r\nMultitasking\r\nBeing able to put out fires\r\nOverachievers welcomed", "Interview Questions": "Why the Gates Foundation"}, {"date": "6 Oct 2011", "title": "Grants Administrator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 1 day. I interviewed at Bill & Melinda Gates Foundation (Seattle, WA) in Oct 2011", "Interview Descriptions": "I received an email advising a request for a phone interview. On the phone interview the recruiter immediately set my expectations that they are reviewing several candidates and that any information would not be relayed to me for a few weeks. The interview lasted about 45 minutes and consisted of general resume questions and scenario questions.", "Interview Questions": "Describe a creative solution to a problem you faced?\r\n"}, {"date": "1 Sept 2011", "title": "IT Support Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 6 weeks. I interviewed at Bill & Melinda Gates Foundation (Seattle, WA) in Jul 2011", "Interview Descriptions": "Applied directly on the Gates Foundation website. One week later I received an email from HR to schedule a phone interview with a senior HR person. All my interactions with the Gates Foundation during the interview process, was professional friendly and helpful, even when telling you you didn't make the cut they were friendly. The only issues I had I was the waiting 6 weeks to find out I didn't  make the cut to move on the next level.", "Interview Questions": "All questions related to experience on your resume."}, {"date": "2 Dec 2015", "title": "Program Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 6 weeks. I interviewed at Bill & Melinda Gates Foundation (Seattle, WA) in Jun 2011", "Interview Descriptions": "Very gruelling.   I was fortunate to have worked with a recruiter at the time.  We setup a time for me to meet with four different people.  Took another 2 weeks or so to hear back and the offer was made quite quickly.", "Interview Questions": "Why do you want to work here?"}, {"date": "22 Feb 2012", "title": "Deputy Director Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "The process took 3 weeks. I interviewed at Bill & Melinda Gates Foundation (Seattle, WA) in Apr 2011", "Interview Descriptions": "* Contacted by a recruiter.\r\n* 1:1 phone interview with recruiter.\r\n*1:1 interview with Gates HR recruiter.\r\n*1:1 phone interview with Director.\r\n* Series of in person interviews with 6 staff members. \r\nThe campus is absolutely awesome. It is LEED certified gold.   The work space is open and only the higher levels have closed office space. However, there are a lot of Focus Rooms where you can go to work.  They have a great cafe in a beautiful atrium. There is a coffee bar and a great selection of food. All food is organic. However it's not particularly cheap.  \r\nThe people, hit or miss. Seems like the average age is 28-38. There are a ton of folks who were at Starbucks or Microsoft.", "Interview Questions": "What can you offer our team, which is already staffed with experts?"}, {"date": "3 Aug 2011", "title": "Program Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 6 weeks. I interviewed at Bill & Melinda Gates Foundation (Seattle, WA) in Apr 2011", "Interview Descriptions": "I first heard from a recruiter about two weeks after applying online. I emailed a contact I have there as soon as I applied, and I think the referral I got from her helped me to get through the resume screening process (the recruiter later told me they had hundreds of applicants for the position). The recruiter set up a time to talk to me and told me to plan for about a 45-minute call. We ended up talking for less than half an hour, and it was all very basic (i.e. questions about my resume and background and lots of time for me to ask questions). She told me I would hear back the next week and the following week I got an email to set up a time to talk to the hiring manager. This conversation was around 45 minutes and was more questions about my resume and experience. A few days after that I heard from a different recruiter who set up a time for me to come in, and I spent four hours at the Foundation the following week (this is now a month after the initial contact). I spoke to the people I will be working with as well as higher-level people and the recruiter. Most of the questions were again about my background, and everyone I spoke to gave me time to ask questions as well. This is not an interview where anyone will try to trick you, and it's much more about making sure the person they hire is a good fit and is dedicated to the mission of the organization. It was overall a good experience and I would recommend focusing on why you are qualified and what you can bring to the position.", "Interview Questions": "How do you see your career progressing?"}, {"date": "10 May 2011", "title": "Program Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Bill & Melinda Gates Foundation (Seattle, WA) in Apr 2011", "Interview Descriptions": "I received a phone interview from applying online.  The phone interview went well and the Recruiter even mentioned that she as going to pass my information along to a Hiring Manager and asked why I hadn't applied sooner.  I felt that it was very positive.  However, I was not contacted and didn't received a response to any of my follow up emails for three weeks.", "Interview Questions": "They questions were very basic.  Please go over you resume ith me in detail and elaborate on your experiences.  Why do you want to work for the Gates Foundation?  What are you hoping to get out of our conversation?  "}, {"date": "31 Mar 2011", "title": "IT - Business Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at Bill & Melinda Gates Foundation (Seattle, WA) in Dec 2010", "Interview Descriptions": "I was pleasantly surprised at how well I was treated during the interview process.  They were very gracious in all e-mail to me, thanking me for considering employment there.  Given the recent economy and some people still not working, they treated me like I was considering them more than the other way around.\r\n\r\nI had a recruiter phone interview first.  Very nice woman and we had a good conversation.  (Now that I'm with the company, we still keep in touch.)  We discussed my past experience and qualifications.  Normal first interview type of questions.  At the end of that call, she discussed the salary and the benefits.  That was helpful.  I had been working at a for-profit for 14 years and thought I would be offered less money.  I was very surprised to find that I would be making at least as much, if not more at the Gates Foundation. Plus, the benefits are amaziningly better and there's a pension contribution that is given (not based on tenure or job level).\r\n\r\nNext, I was set up for all day interviews.  I was actually being considered for 2 different jobs.  I interviewed with 6 people that day in a conference room.  They very nicely had me pre-order lunch but I was in the conference room all day w/ no breaks.  Even my lunch was an interview.  I didn't eat much as it is awkward to interview and eat (plus, I would have no doubt gotten something stuck in my teeth and that was not the impression I wanted to leave w/ anyone!).\r\n\r\nI knew my chances were very good after that series of interviews.  I rec'd good feedback and thought I had a good showing.  However, I did go back for 2 more interviews late on a Friday afternoon.  It was to meet the director of the dept and a person who would be my co-worker (who wasn't available during the first round).\r\n\r\nAgain, things went well and I thought I might hear next steps the following week.  I was blown away when the recruiter called my cell phone before I had even arrived home.  I called her back and she verbally gave me the job offer on a Friday night at 6:30pm!  Throughout my experiences, everyone was really great, respectful, and complimentary. \r\n\r\nThe only thing that gave me pause was what I was hearing through my background research (I knew people who had contracted with the Foundation) and even existing employees mentioned this during the interview.  That is, that it can be a hard place to work and to get things done.  The reasons mentioned were that it is still a young company, working on process and organizational maturity.  I see that is true now that I'm here.  However, it's also exciting to be part of that building process.  It has a bit of a start-up feel.  People are really passionate and want to make a difference.  Both in the world through the Foundation's mission, but also at the company.  If you'd like to join a company where you can be part of the creative input to the processes, systems, and culture, you may like it here!", "Interview Questions": "Pretty basic interview questions for my role.  How would I handle this situation or give me an example of a time when you worked on..."}, {"date": "10 Aug 2010", "title": "Project Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Bill & Melinda Gates Foundation (Seattle, WA) in May 2010", "Interview Descriptions": "Initial phone w/ HR, followed by phone w/ hiring manager. 1:1 you sit in a room while people come to you. I ate lunch alone, in the room (it was explained that they seem to think that people like a breather to be on their own. er, lunch w/ potential co-workers is where you get a real sense of what it is like to work there.. so that was concerning). You do not get to see where you will work, or who co-workers are aside from those involved in the interview. Interview Qs depended upon the person, but for the most part clearly untrained in determining best fit. A few illegal Qs thrown in, but I think these were ignorance over intentional fact finding. Major attitude w/ junior peers, which is to be expected, I suppose. Not one person could clearly explain how things work or identify specific projects or tasks- everything described in a vague sort of way. I got the distinct sense that decisions are not made easily, or by any specific person or persons. The environment described as collegiate, but seems more like \"under managed\" is more accurate. Initial follow up emails were not responded to (probably because I wasn't going to be offered the job, but still. \"nice to meet you, too\" - is that so difficult?). I don't think they would've bothered to tell me that I wasn't going to be offered the position if I hadn't been diligent about following up. My criticisms are not coming from bitterness- to be honest, if I had been offered the job it would've been a difficult decision. Something was not right, and I got the feeling that I was not given an accurate picture of what the job really entailed (despite direct questioning) or what the environment was really like- it was like talking to politicians. To turn down an opportunity to work at Gates would've been major... I probably would've taken it and been miserable within a month.....so in the end best outcome...", "Interview Questions": "Do you get along with all types of managers? What managing style do you prefer?"}, {"date": "14 Sept 2011", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 1 day. I interviewed at Bill & Melinda Gates Foundation (Seattle, WA) in May 2010", "Interview Descriptions": "I responded to an internal university posting for a graduate research assistantship at the Bill & Melinda Gates Foundation. The announcement asked for a resume, cover letter, and a list of references. Two weeks after the closing date of the announcement, I was contacted by phone to schedule an interview. The HR representative disclosed that it would be a panel of three interviewers, and that the interview should take approximately one hour. I wore a suit and brought copies of my resume, along with a pad of paper and a writing utensil. The questions were scripted, with some room for follow-up questions, as necessary. As anticipated, the interview took about one hour. I was contacted one week later, being informed that I did not receive the position.", "Interview Questions": "Where do you see yourself professionally in five years?"}], [{"date": "3 May 2010", "title": "IT Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Bill & Melinda Gates Foundation (Seattle, WA) in Mar 2010", "Interview Descriptions": "The initial phone contact was positive and cheerful. The recruiter asked a set of questions related to my experience and background. There was no discussion of salary or organizational structure. She discussed the culture and my desire to work for a non-profit. I did find out the CIO was new. I made it to in-person interviews. I wasn't really impressed with the technical skill of the panel. The questions were junior. One of the senior interviewers asked me a technical question which I answered correctly. He told me I was wrong and gave me an incorrect explanation. \r\n\r\nThe manager of the group did not leave me feeling confident. He was rigid and acted kind of suspicious and threatened when I inquired about basic operational functions. \r\n\r\nI am OK with not receiving an offer. The professional background of the people on the team is very limited and it showed in the interview. I was not surprised given the feedback from a buddy who is a tech support guy for a product they own.", "Interview Questions": "Why do you want to work for the Gates Foundation?"}, {"date": "8 Mar 2012", "title": "Associate Program Officer Global Health Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 4 weeks. I interviewed at Bill & Melinda Gates Foundation (Seattle, WA) in Feb 2010", "Interview Descriptions": "Initial phone screen by HR, then a phone screen by the hiring manager, then a long day 8+ hours of 1:1 interviews. It was exhausting. \r\n\r\nThe foundation tends to hire on skills rather than issue knowledge, at least for the Policy and Advocacy Groups. If you can tell compelling stories that demonstrate those skills while peppering in some Global Health or Global Development knowledge, you will be better served than trying to play up yourself as a subject matter expert.", "Interview Questions": "Tell me about a time when you were able to change someone's mind on a particular issue."}, {"date": "24 Sept 2010", "title": "Business Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 4 months. I interviewed at Bill & Melinda Gates Foundation (Seattle, WA) in Feb 2010", "Interview Descriptions": "The group I interviewed was very busy growing and traveling, so the process took long. I had 2 phone interview, 1 all day interview and another half day interview. It took about a month to hear that I was not offered the position.  \r\nI really like everyone there.. it feels like an academic culture trying to become a \"company\" culture (ie faster, more efficient, etc).  I currently work in the for profit sector and the feel of the place was really different.  I really wanted the position and continue to look for positions at the Foundation. The pay would have been higher than my current position.", "Interview Questions": "Nothing difficult. Wanted to know about experience with Excel. "}, {"date": "28 Feb 2010", "title": "Program Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Bill & Melinda Gates Foundation (Seattle, WA) in Jan 2010", "Interview Descriptions": "I applied on-line and got a call back within a week.  Two phone interviews (about 1 hour each), then a day-long person-by-person interview at the office.  They basically parked me in a conference room and had a new person come in and meet with me every hour.  Lunch provided.", "Interview Questions": "Questions were mostly centered on my past experience.  Overall, it is difficult to say what was the most difficult question.  Most of my interviews were more \"getting to know you\" interviews"}, {"date": "12 Mar 2012", "title": "PO Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Bill & Melinda Gates Foundation in Jan 2010", "Interview Descriptions": "Interviewed with everyone on the team. Great questions to assure fit.", "Interview Questions": "Seems like this position is a step down for you, why would you want this?"}, {"date": "29 Mar 2010", "title": "IT Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Bill & Melinda Gates Foundation in Jun 2009", "Interview Descriptions": "Interview went well however they were looking for a more \"junior\" person.", "Interview Questions": "What are your strengths and weaknesses?"}, {"date": "11 Mar 2011", "title": "Program Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Bill & Melinda Gates Foundation (Seattle, WA) in Feb 2009", "Interview Descriptions": "I was surprised that I had to be brought in three separate times to interview.  Each time the recruiters were scrambling to find individuals to interview me (due to original people being out sick).  I was also surprised that during the interviews the people interviewing me were late, or not even sure of what they were asking/looking for in an assistant.\r\n\r\nTo be fair, 2 of the 4 people who interviewed me are no longer with the foundation (due to their own decision), and it was these two who were the least prepared.", "Interview Questions": "\"If person A asks you to schedule meetings, but then person B asks you to make travel arrangements, and then person C tells you to drop everything and do their tasks - what would you do and how would you prioritize?\""}, {"date": "28 Apr 2009", "title": "Program Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Bill & Melinda Gates Foundation (Seattle, WA) in Feb 2009", "Interview Descriptions": "You must complete a fair amount of paperwork, mostly regarding background check, prior to the 1:1 interview. The recruiting coordinators are responsive and provide clear instructions and directions beforehand, but there was no follow up regarding the decision in the end. You might need to check your \"status\" online instead.", "Interview Questions": "How do you feel about data entry? with data entry"}, {"date": "17 Jul 2011", "title": "Program Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Bill & Melinda Gates Foundation (Seattle, WA) in Jan 2009", "Interview Descriptions": "One phone call interview from HR. 4 1:1 interviews in a very McKinsey style. Now interview process consist of many more 1:1 interviews. They can be very repetitive.", "Interview Questions": "Some questions seem a little silly, but they are designed to observe your logical thinking. "}, {"date": "17 Jun 2010", "title": "Senior Program Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Bill & Melinda Gates Foundation (Seattle, WA) in Mar 2008", "Interview Descriptions": "applied on line. screened by phone.  invited to Seattle for full day of interviews.", "Interview Questions": "there wasn't really a hard question.  it was just that the day was long and it consisted of many back to back interviews.  I had to be able to be fresh and repeat information about myself in each interview.  hard to stay perky."}]]