[[{"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "SDM consulting", "rating": "4.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "12 Apr 2023", "job_title": "Manager in New Delhi", "duration": "N/A", "pros": "Genuine, driven team mostly based in Netherlands. Smart, kind, motivated people", "cons": "Chaotic strategy. Questionable utility of product"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Worst place to work- only pertaining to the Indian team", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "21 Nov 2021", "job_title": "Anonymous Employee in Gurgaon, Haryana", "duration": "N/A", "pros": "Good place to learn mediocrity, how to postpone work and to learn how to basically blabber when u dont have anything to offer\r\n\r\nYes it is international for namesake but if u want to go to the other locations, better be based out of those places, because the indian team has too much politics and a hierarchical approach that will never help u to go there\r\n\r\nInternational team is good (unfortunately, they aren't the people ull deal with during ur day to day job)", "cons": "Indian team is especially badly managed, unplanned and directionless\r\nThe biggest irony is that the person who heads the org ( in 2020) knows it very well but he is least bothered to fix it and if anyone tries to put it to this person, he/she will be met with a hostile/ no reply\r\nThose who are managers here, most of them, have no knowledge about conflict resolution and they say a lot about work-life balance but they'll make sure that u work on your holidays as well\r\nThere are people who only give reasons for results below comittment year on year, talk too much than they work, their programs have not shown any noteworthy results but they still get away with it, its fishy and not worth a serious person's time\r\nNo career growth- whatsoever!\r\nHighly unprofessional and absolutely zero work ethic, too much lies and to top that there's arrogance and rudeness especially towards those who are at lower levels\r\nAnd the so called leadership team is mostly the culprit\r\nThey dont have a product or a proper service to offer really\r\nAll they got is talk and colorful presentations which if one takes a good look at will know that its a big fat zero"}]]