[[{"date": "8 Oct 2022", "title": "Undergraduate Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Babson College", "Interview Descriptions": "Their procedures were very clear, which shows that this school is very organized and well established. Matches with their professional business reputation. No wonder why kids from this school's outcomes are that successful.", "Interview Questions": "Why Babson? Tell me about yourself"}, {"date": "10 Dec 2022", "title": "Associate Director, Content/Research and Instruction (Library) Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Babson College in Oct 2022", "Interview Descriptions": "Talent Acquisition contacted me for a 1:1 virtual interview, progressing to a second round virtual 1:1 meeting with the department’s director. Third and final interview was, again, virtual with Academic IT. Submitted references (survey format for those submitting references on my behalf) and completed Babson's \"new\" Manager Assessment simulation. I prepped for the simulation and though it wasn't straightforward or library-related in any way, I thought I did well. The simulation was centered on an important client who just launched your company's software, which was not working as expected. Part of the simulation also involved a live video discussion with an actor essentially playing the part of an employee who was not willing to do their load of the work. Again, I thought it went well. This is where it starts to get shady/dubious: the Talent Acquisition person calls to offer me the position and the proposed salary is the max in the range (range was $76-84k). In summary: three VIRTUAL interviews, I never meet the director in person, never meet the library staff, and, conversely, they never meet me, and Babson offers the max salary. This is where my identity comes into play: I'm not White, I understand Babson, like many higher-ed institutions, wants to get on the DEI marketing bandwagon, but it's unimaginable that a prominent business school would hire someone without ever meeting them in person AND offer them the max in the range. My gut certainly said this is illogical. In the end, I accepted the verbal offer, but a day or two later, I received a succinct email from Talent Acquisition stating the offer was contingent based on references and the manager assessment, to which I listened to my gut and inquired whether there was an issue with my references (the same references I've had for the last couple of jobs, which resulted in my getting offers from them and elsewhere). Talent Acquisition stated the combination of the references and manager assessment scores forced them to rescind their offer. And of course, HR cannot share the results of either. It would be interesting to see what readers of this scenario think, and how their respective identities influence their interpretation. Am I, BIPOC-identifying, reading too much into it and it was an objective, metric-based decision, or, did they have other candidates in mind and needed to have a non-White candidate as a finalist? (Mind you, HR stated that once hired, HR's Talent Development team would work with the person to improve areas as noted by the manager assessment. And I have worked in higher education for more than a decade; seven of those years in managing staff.) This is higher-ed and, most importantly, this is the higher-ed experience when you're BIPOC or identify from another marginalized group. You have no idea what the truth is, nor will you ever know. My lesson in this, for the umpteenth time: never trust PWIs if you're BIPOC -  listen to your gut.", "Interview Questions": "Typical library management questions. It was difficult to gauge the authenticity of the entire interviewing process."}, {"date": "26 Jun 2022", "title": "Academic Advisor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Babson College", "Interview Descriptions": "The interview process took about 1 month from initial contact to hiring. It started with conversations with managers/team members and then talking to HR. Positive interview experience from start to finish.", "Interview Questions": "How do you handle difficult conversations in which you’re delivering bad news?"}, {"date": "4 Jun 2022", "title": "Teacher Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Babson College", "Interview Descriptions": "This was one of the worst interview experiences of my life. I’ll spare the details leading up to it, but the day itself was long and tortuous. Eight-hours+ of interviewing with people who asked the same questions over and over again. Some of which made no sense in terms of what the interviewer was looking for in terms of an answer. Poor internet connection on campus for virtual interviews led to choppy dialog, videos in and out and having to repeat oneself over and over again. Following the long-day adventure, more interviews virtually the following week. Again, repeat questions asked. Then, weeks of silence just to be followed up with a generic “no thanks” email. \n\nThe killer was another candidate already worked there and was around on the interview day, so was told to act like I was a salesperson. Then, was told by many they really like to promote from within.  Awesome - glad to hear. \n\nIt seems like a more phased approach would have been more helpful and they could have weaned me out much earlier. But, we know that companies/academia like to have “options” or be able to prove why an internal candidate is the best choice, so am annoyed that I was the “fall person” to prove that. \n\nMaybe I was, maybe I wasn’t. But, it sure felt like a huge waste of time for all involved due to the poor planning overall.", "Interview Questions": "If a student wanted you to text them feedback, how would you handle that situation? "}, {"date": "28 Mar 2022", "title": "Advising Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Babson College", "Interview Descriptions": "Email, followed by phone interviews, had two or three phone interviews, followed by offer, reference check.\r\nTeam was kind but stressed - seemed concerned about finding someone quickly. \r\nTurned down offer due to receiving another offer which had better salary and benefits.", "Interview Questions": "Focused on advising background, skills, questions"}, {"date": "11 Apr 2022", "title": "Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Babson College (Boston, MA) in Jan 2022", "Interview Descriptions": "Phone Screen - Initial phone screen would lead to secondary interview with the VP and additional HR representative and get further into details of my background and experience in technology and program experience.", "Interview Questions": "Basic background and discussion of diversity"}, {"date": "10 Sept 2021", "title": "Sofware Engineer Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Babson College", "Interview Descriptions": "the single day had  3 rounds and a very friendly team and had very good experience discussing the role and responsibilities of the position. will recommend to a friend, Love the environment of the college.", "Interview Questions": "was asked about the experience with visual force"}, {"date": "1 Mar 2021", "title": "Assistant Director of Annual Fund Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Babson College", "Interview Descriptions": "three interviews (HR phone screen, two meetings with the team) spanning over an hour each time. Following those two in person meetings, I met with the SVP and the following few days I got a job offer", "Interview Questions": "I do not remember what the question was?"}, {"date": "26 Mar 2020", "title": "Janitorial Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Babson College (Boston, MA)", "Interview Descriptions": "I was looking to be hired as a janitor at babson college. I just moved to the area from portland maine. I was called on the phone for an interview to talk about my skills.", "Interview Questions": "Are you able to work overnight?"}, {"date": "18 Nov 2019", "title": "Summer Admissions Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Babson College (Babson Park, MA) in May 2019", "Interview Descriptions": "The process was very quick and easy. They are super nice people, just be honest, genuine, and show that you are responsible enough to be micromanaged. Other than that, you will be fine!", "Interview Questions": "Why Babson?"}], [{"date": "16 Apr 2019", "title": "Sustainability Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Babson College (Wellesley, MA)", "Interview Descriptions": "/It was a simple, online application and  a 15 minute interview where I explained what I had achieved in the past and what I wanted to do with this internship", "Interview Questions": "What do you want to change at this school?"}, {"date": "5 Mar 2019", "title": "Coordinator, Multicultural & LGBTQ Programs Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Babson College (Wellesley, MA) in Feb 2019", "Interview Descriptions": "I applied online for this position in January. I was contacted to schedule a phone interview a week later, which I did. That interview was delayed and rescheduled 3 times before the College was ready to conduct. Each time I had to be the one to inquire about their availability, often not receiving confirmations when I selected interview times. \r\n\r\nI conducted the phone interview in February with a member of the HR team and the direct supervisor. The interview lasted about 30 minutes, and went well. I was invited to proceed to the next round, which would have been an in-person interview. I was asked over the phone to email a list of my available dates for the the in-person interview. I did so promptly, and once again never received any follow-up or response. Having been a finalist for other positions, and receiving multiple offers elsewhere, I dropped it and let it go. I was no longer interested in the rescheduling and radio silence from Babson HR. As of a month later, I still have no received any further communication from their HR.", "Interview Questions": "Describe your experience working with diverse and underrepresented students. "}, {"date": "21 Jul 2018", "title": "Sustainability Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Babson College (Babson Park, MA)", "Interview Descriptions": "Intro interview, then project proposal interview. The interview was with the intern manager, the project proposal was with alex. We made a proposal for a project we would develop at babson.", "Interview Questions": "what do you need to work on?"}, {"date": "19 May 2018", "title": "Administrative Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Babson College", "Interview Descriptions": "Applied online, got an email requesting a phone interview with HR within a week.  Phone interview was just a screen to make sure salary, etc., was in line. On campus interview was friendly, conversational, not at all difficult.", "Interview Questions": "Tell us about one experience where things didn't go as planned."}, {"date": "23 Jan 2018", "title": "Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Babson College", "Interview Descriptions": "I applied through an employee referral and submitted my resume and cover letter online. I received an email about a week later with a request to do a thirty minute phone call with an HR manager and the program director. About 5 days after the phone interview, I received an email requesting me to come in for an in person interview. This lasted about 2 hours, and consisted of 30 minutes with HR, 1 hour with the director, and 1 hour with the rest of the team. Everyone was friendly and welcoming.", "Interview Questions": "What do you know about this position?"}, {"date": "30 May 2017", "title": "Accounting Clerk Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 2 weeks. I interviewed at Babson College (Needham, MA) in May 2017", "Interview Descriptions": "The process wasn't too bad. The staffing agency contacted me and were able to get me a phone interview within a couple of days. I later got emails about the times I should start. I began working the week after.", "Interview Questions": "Do you work well without having to be taught?"}, {"date": "15 Mar 2017", "title": "Lecturer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Babson College", "Interview Descriptions": "I had at least 5 meetings, including a phone interview. I had both 1:1 and group meetings, one a half day that I needed to talk off work.. Very positive reactions. Very qualified for position including I was teaching same courses at another Boston college. I was very surprised and disappointed that I got just an email saying I was not the chosen candidate...no explanation just \"we have decided not to offer you an appointment\". I asked for deciding factors and still received back a vague response.", "Interview Questions": "Why Babson?"}, {"date": "19 Mar 2017", "title": "International Market Research Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Babson College (Wellesley Hills, MA) in Feb 2017", "Interview Descriptions": "Single round of questioning that lasted for 30 minutes, he asked a few question that were relatively easy to answer particularly because i was passionate about the job and that was probable why i got it", "Interview Questions": "Why do i want the job?"}, {"date": "14 Sept 2017", "title": "Spark Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Babson College (Babson Park, MA) in Dec 2016", "Interview Descriptions": "Very straightforward. They asked me about why I wanted to be a spark tutor, and why I thought I would be a good one. It was me with three other interviewers (some of them were head tutors).", "Interview Questions": "Why do you want to be a spark tutor?"}, {"date": "29 Sept 2016", "title": "Marketing Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Babson College", "Interview Descriptions": "Started with a phone screen. From there came for a half-day, in-person interview. Met with people from HR, and the department I applied for. The whole process took about a month and a half from the time I submitted my application to the time I accepted the job. It was a great process overall. The only weird thing is that lunch was scheduled into my interview, but I was on my own. I thought that was bizarre and unlike other higher ed interview experiences I've had.", "Interview Questions": "Why Babson was a big one - multiple people asked me that throughout the day."}], [{"date": "5 Feb 2016", "title": "Program Manager, Executive Education Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Babson College (Wellesley, MA) in Jan 2016", "Interview Descriptions": "I had a phone interview with 2 hiring managers. Nothing overly in depth. It ended on a good note as they said I should expect an invitation to campus for a face to face interview. I received the invitation after the holidays. I was given a schedule of 3 half hour meetings-- one with a fellow program manager, one with the 2 hiring managers, and one with HR. \r\n\r\nI really wanted to want this job. The fellow program manager and HR rep were friendly. The hiring managers I felt no rapport with. They also had both written \"maybe\" so it was clearly visible on the printed copies each of them had of my resume. It just didn't enable a welcoming feeling. I had left my job at the end of 2015, which was since we had first spoken by phone. I updated my resume and started off by telling them the changes. One later said \"we come from the school where you don't leave a job until you have another one.\" At that moment, I knew this was not the job for me. The hiring managers seemed disconnected and buried with their own problems. I contemplated not going to the HR portion, but I did. A few days later I withdrew my application. I never heard anything either way so clearly it was not a fit on either side. I received a much better offer two weeks later so things do happen for a reason!", "Interview Questions": "Why Babson? "}, {"date": "8 Mar 2016", "title": "Program Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Babson College (Wellesley, MA) in Dec 2015", "Interview Descriptions": "I had a phone screening, and was then asked to come in for 2 in-person interviews. I followed-up after the second in-person interview and was told I would hear back soon. I received a basic form email the following week stating that they had gone with another candidate. This was completely understandable, as I do not think it was the best fit, but they could have at least sent a personalized email after I had participated in so many interviews.", "Interview Questions": "How do you feel about dealing with difficult people?"}, {"date": "28 Jul 2017", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Babson College (Wellesley, MA) in Oct 2015", "Interview Descriptions": "The office consists of a friendly environment with a lot of flexibility for you to grow at your own pace. Management is friendly and compassionate. There is a lot of room for growth and they offer exciting projects that encourage the entrepreneurial nature of the college itself.", "Interview Questions": "What motivates you?"}, {"date": "20 Sept 2015", "title": "Building Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Babson College (Babson Park, MA) in May 2015", "Interview Descriptions": "Short interview consisting mainly of personal details, goals and expectations. The entire process did not take more than thirty minutes. The main points were discussing what to expect and scenario-based questions to see how one would react in different situations that might be faced. Very relaxed atmosphere overall, great interviewers.", "Interview Questions": "What do you expect from your coworkers?"}, {"date": "6 Jan 2015", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Babson College", "Interview Descriptions": "I was called in for a first round interview and met with 2 managers, one of which being the person that would be my direct supervisor. It took a couple of weeks, but I followed up and was then called back for a second interview. The second time, I met with about half of the office, and spent almost a full day on site. I met with a few individuals at a time, and finished by meeting the director of the office. Thankfully, everyone was very welcoming and did not allow me to feel intimidated by their group size!", "Interview Questions": "Questions weren't too difficult, but a bit repetitive. Most were \"how can your past experiences help you in this position?\" but rephrased."}, {"date": "20 Aug 2015", "title": "Information Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at Babson College (Babson Park, MA) in Sept 2014", "Interview Descriptions": "One interview after applying on campus website. The process was quick behavioral questions that took a little over 30 minutes. After the interview, the supervisor asks to take a quick test that deals with the position.", "Interview Questions": "What previous experience do you have to accompany you in this job?"}, {"date": "28 Feb 2014", "title": "Project Coordinator, IT Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Babson College (Wellesley, MA)", "Interview Descriptions": "Had an initial phone interview with HR rep and hiring manager. Was brought in for an in person interview with same two people 2 weeks later. Hiring manager didn't show up that day so I had to come in 2 weeks later again to meet with him and his boss. His boss didn't show up this time so I had to come in a MONTH later to meet with him. (I am not making this up, this is how it really happened). With the 4 rounds of interviews done, then the waiting process began. I waited 5 weeks with no word whatsoever and no response from multiple emails to the HR rep. After finally getting a hold of her, she said the process got held up and they are still completing interviews. It has now been almost 4 months overall and the process is still ongoing. Needless to say I would never want to work there now after what I went through.", "Interview Questions": "basic interview questions... explain your background, why are you a good fit for this role, where do you see yourself in 5 years..."}, {"date": "28 Feb 2014", "title": "Horn Library Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Babson College (Wellesley, MA)", "Interview Descriptions": "Going into the interview the first question was about time management and how I was good at it. After clearing that I was asked to describe a time when I was in a high stress environment with work piling on and how I coped with it. Since it was a outward facing job I had to talk about my customer service experience too.", "Interview Questions": "Do you know how to use Millenium"}, {"date": "24 Mar 2013", "title": "Level I Technician Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied through an employee referral. The process took 5 days. I interviewed at Babson College", "Interview Descriptions": "Very easy- recommendation from a current employee.  Single interview after that.", "Interview Questions": "How would you deal with an angry customer who is being charged for the loss of their laptop?"}, {"date": "9 Apr 2014", "title": "Education Abroad Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Babson College (Wellesley, MA) in Oct 2012", "Interview Descriptions": "Hiring process is through the HR website. After their initial screening, the hiring supervisor selects candidates for phone interviews. An HR representative and the supervisor do the call jointly. A second round of interviews are done in person. The candidate meets with the HR representative, the supervisor and lateral potential colleagues for 30 minutes each. Background checks happen after offer.", "Interview Questions": "Describe what your first month in the position would look like."}], [{"date": "16 May 2012", "title": "Admissions Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 1+ week. I interviewed at Babson College (Easton, MA) in Apr 2012", "Interview Descriptions": "Very friendly interviewer. Short questions regarding previous admissions experience and heavy focus on \"why Babson\". Good impression of office culture.", "Interview Questions": "Could you get behind the mission of Babson as a business school?"}, {"date": "24 Jun 2012", "title": "Event Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 7 weeks. I interviewed at Babson College (Wellesley, MA) in Feb 2012", "Interview Descriptions": "I live out of state so I applied online and then was contacted for a phone interview.  After this interview I waited about two weeks and then was called for a 'final' skype interview which was with a group of 10 people.  I then waiting another three weeks before recieving a 'no' via email.", "Interview Questions": "What is the biggest mistake you have ever made?"}, {"date": "23 Jan 2013", "title": "Service Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 4 days. I interviewed at Babson College (Babson Park, MA) in Oct 2011", "Interview Descriptions": "I walked into the service center and asked if they were hiring. I was given an e-mail to reply to, and the next weekend I had a 1:1 interview with the Labmanager as he was known. From there I met with the next higher up, and interviewed with him, as well as went through a small skills test.", "Interview Questions": "Mostly questions regarding basic IT support and troubleshooting."}, {"date": "3 Aug 2015", "title": "Webster Center Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 3 days. I interviewed at Babson College (Babson Park, MA) in Aug 2011", "Interview Descriptions": "I knew that I wanted to work in the gym from the moment I qualified for the federal work study program. Based on the posting of available on campus jobs for the work study program and the supervisor listing for each job, I got the email address of the supervisor and emailed him expressing my interest in working in the Webster Center. He responded by email, and then we had a quick phone screening/interview before I was approved for the job.", "Interview Questions": "Why I wanted this position. They also asked for previous work experience, and how this work experience would make me a good candidate for the position."}, {"date": "27 Aug 2015", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 6 days. I interviewed at Babson College (Wellesley, MA) in Aug 2011", "Interview Descriptions": "It was a one interview process. My resume was looked over and they called me to schedule a 1 on one interview. It was quite easy and really relaxing.  They just want to know if the personalities mesh.", "Interview Questions": "Q: Tell me about yourself?\r\nQ: How would your friends describe you?\r\nWalk me through your resume"}, {"date": "29 Apr 2015", "title": "International Co-op Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 1 day. I interviewed at Babson College (Boston, MA) in Jun 2011", "Interview Descriptions": "I was asked a lot of scenario questions about students abroad and emergencies. I was also asked to share my own experiences living abroad and describe a time I dealt with adversity.", "Interview Questions": "What would you do if there was a natural disaster in x country where you had a student working and their parents called you panicked?"}, {"date": "12 Dec 2010", "title": "Developer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at Babson College (Babson Park, MA) in Nov 2010", "Interview Descriptions": "Interviewed on the phone. I think the main purpose of which was just to discover that I'd done the things I claimed I'd done on my resume.\r\n\r\nDrove in, registered my car with campus police, everyone on campus was really nice. Looked like a campus in Massachusetts in Fall. In other words, idyllic. Being there, it's easy to forget there's other countries that aren't as fortunate. \r\n\r\nThe interview itself was fantastic. Really felt like I knocked it out of the park. Just some guys talking about web solutions.", "Interview Questions": "Tell me about why you want to leave your present employer?"}, {"date": "21 Jun 2010", "title": "Admissions Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Babson College (Wellesley, MA) in Jun 2008", "Interview Descriptions": "the interview process was very fast and efficient. I was interviewed twice- one was one-on-one the other was a panel interview.", "Interview Questions": "How would you respond to questions about affirmative action if asked by parents?"}, {"date": "3 Feb 2010", "title": "Gym Custodian Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Babson College (Babson Park, MA) in May 2008", "Interview Descriptions": "I went in and spoke with the manager in charge of the gym.  It was more of a screening to make sure you are competent than an actual interview.", "Interview Questions": "Why would you be a good fit here?"}]]