[[{"date": "2 May 2023", "title": "Social Worker (MSW) Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Dartmouth-Hitchcock Medical Center (Lebanon, NH) in Mar 2023", "Interview Descriptions": "The interview process was smooth and well-coordinated. It was a step wise process where I first met with department heads and then with the social work team. Every person on the team was very welcoming.", "Interview Questions": "What was a difficult situation you faced with a patient and how did you deal with it?"}, {"date": "1 Sept 2022", "title": "Coach Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Dartmouth-Hitchcock Medical Center", "Interview Descriptions": "Phone interview and group interview, casual, friendly group.  The team was well rounded and thoughtful.  \nI was able to ask questions and get to know the team I would be working with.  The team seemed to genuinely like one another and their respective jobs.", "Interview Questions": "I was interviewed by the whole team, nice to see that everyone has input into hiring decisions."}, {"date": "24 May 2022", "title": "Genomic Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Dartmouth-Hitchcock Medical Center", "Interview Descriptions": "The interview was quick but thorough. The interviewers seemed invested and were friendly. The questions were nothing out of the ordinary and I was able to answer everything they asked.", "Interview Questions": "They asked about previous experience "}, {"date": "14 Mar 2022", "title": "Patient Access Representative Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Dartmouth-Hitchcock Medical Center", "Interview Descriptions": "Not only do you have to \"quick apply\" but you also have to then in turn transfer all of that same information to their recruiting system (see mindless algorithm) and then you interview. I've applied and advanced 3 times now and got a Zoom interview.  I'm clearly overqualified and so once I had my interview and met the person face to face it was clear I knew more about the hiring and on-boarding process than she did and it was clear I wasn't going to be hired.\r\nFast forward a few days regarding a different position, I was asked to complete additional information yet again, to which I did but did make sure to reach out to their HR department regarding being black listed after my initial interview.", "Interview Questions": "I was asked very general, bland questions. Mostly she just talked about the company and didn't seem to care about my responses."}, {"date": "26 Feb 2022", "title": "Clinical Research Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Dartmouth-Hitchcock Medical Center", "Interview Descriptions": "Did 2 interviews over online meeting. First two were with the managers and they were friendly - mostly just asking generic questions (why I want to work in clinical research, what makes me want to work at Dartmouth etc. )\r\n\r\nSecond round interview was with other team members. Very easy interviews and had a pleasant experience", "Interview Questions": "Why do you want to work at Dartmouth. What makes you want to work in clinical research"}, {"date": "8 Dec 2021", "title": "Clinical Laboratory Technologist III Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Dartmouth-Hitchcock Medical Center (Lebanon, NH) in Nov 2021", "Interview Descriptions": "The interview was done via WebEx meet. It was almost an hour long interview with the Hematology department head. After, they scheduled me on a 2nd interview with the team leads  in Hematology and Chemistry. A day after the 2nd interview,  I received a job offer.", "Interview Questions": "How do you manage stress"}, {"date": "20 Jul 2021", "title": "Clinical Research Coordinator Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Dartmouth-Hitchcock Medical Center (Lebanon, NH)", "Interview Descriptions": "It probably differs between jobs, but there were multiple rounds of interviews with fairly basic questions about the roles and what interested me about them/why I would be a good fit. Overall, nothing too stressful", "Interview Questions": "What interests you about this role "}, {"date": "8 Jul 2021", "title": "Medical Doctor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Dartmouth-Hitchcock Medical Center", "Interview Descriptions": "Met with several peers and leadership members. Lasted two days.  Average predictable questions. Friendly. Offered lunch with others in department. Travel to interview compensated.  Good benefits and pay.  Comprehensive medical\r\nAnd dental insurance.", "Interview Questions": "What do you consider your weakness? "}, {"date": "9 May 2021", "title": "Nurse Practitioner Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Dartmouth-Hitchcock Medical Center", "Interview Descriptions": "Recruiter called me after I applied from their website. I had an interview a week later, then got number of department chair and we set up a time to talk. Was then invited to the hospital for day of interviews. Was offered the job about one week later.", "Interview Questions": "How do you want to see the department grow with you as a part of the team? "}, {"date": "1 Apr 2021", "title": "Pharmacist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Dartmouth-Hitchcock Medical Center", "Interview Descriptions": "Formal, but relaxed.  Included a presentation for a process improvement project.  Toured the facility, and off-site location. Met with the department leaders for the formal interview part. It was one of the best interviews I went through, and the people were pleasant, creating a comfortable atmosphere.", "Interview Questions": "Describe a conflict with your coworker, and how did you resolve it."}], [{"date": "19 Feb 2021", "title": "Summer Internship Program Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Dartmouth-Hitchcock Medical Center", "Interview Descriptions": "It was a really great experience, the coordinators of the program were really interested in fitting candidates with the best possible position for them to be able to learn and grow within.", "Interview Questions": "They asked questions directed towards my experience through schooling and other work experience that was relevant to the positions I was interested in."}, {"date": "19 Jun 2021", "title": "Patient Registration Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Dartmouth-Hitchcock Medical Center (Lebanon, NH) in Oct 2020", "Interview Descriptions": "The interview process included an initial information conversation with a representative from HR and following that I had an interview with one of the Supervisors of the General Ambulatory Services department.", "Interview Questions": "What makes you different from other applicants that makes you a good choice for this position?"}, {"date": "28 Aug 2020", "title": "Cook Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Dartmouth-Hitchcock Medical Center", "Interview Descriptions": "Precessions was not that hard I I love to cook and I have a lot of experience in the kitchen and that’s what they were looking for so it was something that was that great opportunity", "Interview Questions": "Do have cooking experience and customer service?"}, {"date": "28 Feb 2020", "title": "Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Dartmouth-Hitchcock Medical Center", "Interview Descriptions": "One Phone screening and One In-Person interview with the team members and hiring manager. No technical/analytical questions were asked although it was an interview for an analyst position. The whole process took 3 weeks. The entire second interview felt very unstructured.", "Interview Questions": "Why D-H?\r\nWhere do you see yourself in 3 years\r\n"}, {"date": "19 Oct 2019", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Dartmouth-Hitchcock Medical Center", "Interview Descriptions": "Flowed pretty fast, had 3 interviews before hired, 1 phone, 2 in person. It was lengthy but worth it. I got the chanced to meet the whole team and was able to really see how the nurses work within the team", "Interview Questions": "Why don you want to be a nurse here"}, {"date": "12 Jul 2022", "title": "Social Worker (MSW) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Dartmouth-Hitchcock Medical Center (Hanover, NH) in May 2019", "Interview Descriptions": "The interview process was a phone interview and then two team interviews. The interview was informative, and I felt as if I met important people. I was able to get a sense of the culture, expectations, and team members.", "Interview Questions": "How do you communicate hard information"}, {"date": "12 Jul 2019", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Dartmouth-Hitchcock Medical Center (Lebanon, NH) in Apr 2019", "Interview Descriptions": "The interviewer said at the beginning \"I just want this to be a conversation.\" That really eased my nerves as a new grad RN. I didn't feel like she had set questions she wanted to ask. We bounced off of each other and asked questions very naturally. One of the best interviews I've ever had.", "Interview Questions": "Why do you want to work at DHMC?"}, {"date": "21 Nov 2022", "title": "Senior Clinical Secretary Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 2 days. I interviewed at Dartmouth-Hitchcock Medical Center (Lebanon, NH) in Apr 2019", "Interview Descriptions": "Professional and friendly interview process. Toured the clinic after chatting to meet additional staff members. Other Secretaries looked stressed and didn't make much eye contact. It was concerning but after I started I realized it was because they were extremely busy.", "Interview Questions": "What career goals do you have?"}, {"date": "12 May 2019", "title": "RN Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Dartmouth-Hitchcock Medical Center (Lebanon, NH) in Apr 2019", "Interview Descriptions": "went to a residency fair for multiple interviews. Dress code was pretty much business casual. Friendly staff. You get to go to the table for your scheduled interviews. There were two people asking questions.", "Interview Questions": "What did you do on the unit during your senior practicum?"}, {"date": "12 Mar 2019", "title": "Medical Imager Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Dartmouth-Hitchcock Medical Center", "Interview Descriptions": "The interview was done by two heads of the department. They each had a list of questions and would take turns, it ended up being more of a conversation then a question and answer type of interview.", "Interview Questions": "What type of management do you like or dislike, can you give an example? "}], [{"date": "10 Jul 2019", "title": "Physician Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Dartmouth-Hitchcock Medical Center in Mar 2019", "Interview Descriptions": "Took about a month to finalize interview date that would work for both parties. Interview lasted about 4 hours.  Overall was a pretty easy process. Took about one month to hear back which was a little frustrating.", "Interview Questions": "5 year plan "}, {"date": "12 Jan 2019", "title": "Registered Nurse Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Dartmouth-Hitchcock Medical Center", "Interview Descriptions": "Received an interview about a month after applying. Traveled for the interview and met with the clinical educators and they were wonderful. Very personable and answered all of my questions thoroughly. Nurse manager and staff member then interviewed me. The manager asked me a question, I began to answer as halfway through she interrupted me and proceeded to lecture me as to why I was wrong.", "Interview Questions": "There is a unit that is short staffed and needs help. You are asked to float to that unit with no experience with the patient population. How do you respond?"}, {"date": "18 Jan 2019", "title": "Front Desk Receptionist Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Dartmouth-Hitchcock Medical Center (Concord, NH) in Nov 2018", "Interview Descriptions": "In person  interview thought make sure you watch your interviews body language. I should have and in the end of it I hated my manager she was not good person", "Interview Questions": "None really just about your past experience "}, {"date": "21 Dec 2018", "title": "Patient Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Dartmouth-Hitchcock Medical Center in Sept 2018", "Interview Descriptions": "Filled out application online, got called in to the interview and then answered some questions. I then waited about four days to get hired. The interview process was easy and straightforward.", "Interview Questions": "What was the best experience in your life?"}, {"date": "24 Aug 2018", "title": "MA Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 3 days. I interviewed at Dartmouth-Hitchcock Medical Center (Lebanon, NH) in Aug 2018", "Interview Descriptions": "Hideously toxic crowd based brainwashing session. I had such hope for the hospital after Weinstein left—I was one of their most vocal critics, sometimes skating on thin ice for it. I decided to give it a chance after the transition only to learn “the new boss is the same as the old boss.” Saddest thing for our area. We have lost the soul of a beloved institution. Anyone not mainstream is chewed up and thrown out. Forced faux smile or die attitude. Propaganda video including dancing. Vapid, stepford wives hires—“I’M PART OF DARTMOUTH HITCHCOCK AND I’M PROUD!!!” complete with the glazed over eyes. Attempts to connect with recruiters or fellow candidates on an authentic level are immediately rebuffed. Does not matte how qualified you are, if you don’t brown nose from the second you walk in the door you are dead to them. Heartbreaking and ultimately detrimental to patient care. (I seek competence over obsequiousness in my care any day!) They are stuck on the “We’re the best and you will LOVE US DAMMIT!” attitude—without bringing the goods.", "Interview Questions": "Why do you want to work here?"}, {"date": "27 Jun 2018", "title": "Respiratory Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Dartmouth-Hitchcock Medical Center", "Interview Descriptions": "I had an in-person interview with the manager, supervisor and clinical educator. The interview was about an hour, with a tour that followed. They were not specific about the next steps in the process. I received an email later that indicated they were checking my references.", "Interview Questions": "Why did you get into respiratory therapy?"}, {"date": "8 Jun 2018", "title": "Program Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Dartmouth-Hitchcock Medical Center", "Interview Descriptions": "I interviewed out of state and was given the opportunity to do the first interview over the phone. The 2nd interview was on campus with a panel of members of the team.", "Interview Questions": "Tell me about your previous role and how  that work will be relevant in this position"}, {"date": "1 Oct 2017", "title": "Clinical Secretary Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Dartmouth-Hitchcock Medical Center", "Interview Descriptions": "I applied and interviewed for 2 different clinical secretary positions. The first clinical secretary position I did not get an offer for but made it through 2 rounds of interviews. The second clinical secretary position I only went through one interview. The interview for the second position involved meeting with the hiring manager for the department and also one other team member. They asked me general interview questions such as my strength and weaknesses, why I was looking for a career change, what I look for in a leader etc. Then I shadowed with the team I would be working with for about an hour. The shadowing was definitely the most interesting part and really gave me a knowledge of what the job entailed so that I could make a decision as well as them if it was a good fit.", "Interview Questions": "What do you look for in a leader/manager? "}, {"date": "14 Jan 2018", "title": "Nutrition Services Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 3 weeks. I interviewed at Dartmouth-Hitchcock Medical Center (Lebanon, NH) in Oct 2017", "Interview Descriptions": "Strange. Not at all polite or like any other interview I have had. No welcoming handshakes  or smiles when meeting interviewers. Received blank stares. Uncomfortable from the first to the last minute. Could not see working with such a group.", "Interview Questions": "What do you think you could contribute to our team?"}, {"date": "25 Oct 2018", "title": "EKG Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at Dartmouth-Hitchcock Medical Center (Lebanon, NH) in Aug 2017", "Interview Descriptions": "I started with a shadowing of the EKG Techs for about three hours. I went all over the hospital and got a feel for their position. I then was asked to come back after some time and sit with the head of the Cardiology department to discuss future goals and see if it was a good fit for both parties.", "Interview Questions": "Why cardiology "}], [{"date": "20 May 2019", "title": "Phlebotomist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Dartmouth-Hitchcock Medical Center (Lebanon, NH) in Jul 2017", "Interview Descriptions": "In an office and just holding a conversation. Stay happy and positive and they'll be happy and positive. Dress business casual and don't be surprised if you have to wait because they're slammed.", "Interview Questions": "Why do you want to come here?"}, {"date": "4 Oct 2017", "title": "Patient Service Representative Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Dartmouth-Hitchcock Medical Center (Bedford, NH) in Jun 2017", "Interview Descriptions": "It was interesting.  There were two people there instead of one.  They told me they were looking for people with experience in even though I had no experience other then daycare.", "Interview Questions": "What are you weaknesses"}, {"date": "30 May 2017", "title": "Clinical Secretary Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Dartmouth-Hitchcock Medical Center in May 2017", "Interview Descriptions": "Applied at the beginning of the month online, didn't hear back from DHMC until the 14th to schedule an interview. The interview was three days after the initial phone call. Interview lasted about an hour, I met with two members of the team- manager and physician. They were both very friendly and informative, the interview was more enjoyable than I picture it would be.", "Interview Questions": "What are some of your strongest weaknesses?"}, {"date": "21 May 2017", "title": "Cst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Dartmouth-Hitchcock Medical Center (Lebanon, NH) in May 2017", "Interview Descriptions": "Interview with both HR and the clinical team working in the department.  The entire process from start to finish was just under a month.  Overall what I gained is so much more than what I had to go through to get it.", "Interview Questions": "What was a time when I disagreed with a co-worker or had any turmoil with in my department, how did I handle it?"}, {"date": "12 Apr 2017", "title": "Certified Ophthalmic Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at Dartmouth-Hitchcock Medical Center (Hernando, FL)", "Interview Descriptions": "I was interviewed through a hiring agency for the Ophthalmology department.  I sent my resume in and from there it was a series of phone interviews and screenings.  The job offered great per diem pay, with phenomenal perks.", "Interview Questions": "How long I have been working in the Ophthalmic field?"}, {"date": "11 Mar 2017", "title": "LNA Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 3 months. I interviewed at Dartmouth-Hitchcock Medical Center in Mar 2017", "Interview Descriptions": "It took months to get an actual interview. I had to apply multiple times to various units before they contacted me to come in and meet with someone. The interview was a good experience though. There were two women that I met with, both extremely friendly. The interview took about 45 minutes and ended with a tour of the unit.", "Interview Questions": "Describe a time when you were working and had to think outside of the box"}, {"date": "6 Apr 2017", "title": "Senior Consultant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Dartmouth-Hitchcock Medical Center (Lebanon, NH) in Feb 2017", "Interview Descriptions": "All day interview meeting with many persons. They were not able to or not willing to show current work projects.  The entire interview process exceeded three months. I finally received a decline when I requested an answer. This despite continued contact from the HR screener. Their hiring manager could not be bothered to follow up or reply to their internal HR inquiries. It doesn't seem that they  do not have many qualified candidates for my narrow field. However, they are also not willing to pay market rate. HR screener indicated that a local candidate was chosen. However, knowing the rareness of my skills and experience I find it unlikely. Considering they paid for an on-site interview AND encouraged me to bring my family on the trip (at my expense) AND THEY set me up with a realtor during the visit sent messages that I was the preferred candidate. Such an extended interview process demonstrates little respect. Bottom line: they seem snobbish.", "Interview Questions": "Why do you want to move here?"}, {"date": "14 May 2017", "title": "Registered Nurse Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Dartmouth-Hitchcock Medical Center in Dec 2016", "Interview Descriptions": "Completed a phone and in person interview for an RN position. The phone interview with HR is super basic and has nothing to do with nursing. They seemed to rush me off the phone and couldn't care less about my responses. The in-person experience with hiring manager was a lot better, and I felt more valued, except for the pay. Yikes, it's low and the benefits are crummy with super high deductibles and out of pocket maximums. \r\nDisorganized, inattentive and unresponsive HR. The follow up was really poor.  HR couldn't answer basic information about the position and benefits and just didn't return my calls. One of the scheduled interview screening times they simply blew off which was unprofessional. It was difficult to reach anyone to answer my questions; which genuinely gave me the impression that I either wasn't going to be hired or that the position wasn't really available, neither of which was the case as I was ultimately offered a position.", "Interview Questions": "What are some of your strengths?"}, {"date": "7 Jan 2018", "title": "Nurse Practitioner Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Dartmouth-Hitchcock Medical Center in Oct 2016", "Interview Descriptions": "Initial phone interview with advanced practice.  I inquired thru the hospital site.  Reviewed  position availible.  Reviewed responsibilites and routine of curent staff.  Reviewed benefits and salary.  Discussion areas around hospital.", "Interview Questions": "Why I wanted to relocate.  Goals on career. "}, {"date": "9 Aug 2016", "title": "Environmental Services Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Dartmouth-Hitchcock Medical Center (Lebanon, NH)", "Interview Descriptions": "The interview was professional, thoroughly enjoyed the employees who performed the interview. Gained a lot of interest and was treated with respect. The HR department however had offered the position, I was given a start date, went through a physical, drug testing etc successfully and 3 day's prior to employment my offer was retracted. This is after I quit my job, I was confident with my start date as I completed all demands, and or requirements successfully and the process gave me plenty of time for a 2 week notice. Very unprofessional and lack of communication on behalf of the HR department specifically Patty.", "Interview Questions": "What are your strengths"}], [{"date": "14 Jul 2016", "title": "Clinical Secretary Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Dartmouth-Hitchcock Medical Center (Lebanon, NH)", "Interview Descriptions": "Phone interview, then there was a much more in-depth meet-and-greet with the rest of the team. Although friendly, the administrative staff were very direct and efficient, and I was placed in a conference room to meet with them in groups of three. We concluded with a tour of the department, and communication has been clear and consistent through the interview process.", "Interview Questions": "Describe the qualities that make you a good candidate for the position."}, {"date": "19 May 2016", "title": "Licensed Practical Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Dartmouth-Hitchcock Medical Center", "Interview Descriptions": "Very thorough and detailed. I interviewed with HR first over the phone, then I spike with the manager of the department, I then intereviewed with a second person in HR, a nurse from the floor, and the manager of Primary care.", "Interview Questions": "What made you want to work at DHMC"}, {"date": "25 Apr 2016", "title": "Registered Nurse Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Dartmouth-Hitchcock Medical Center", "Interview Descriptions": "Interviewed for new grad program. Great experience, very personable, flexible, and informative. Good starting pay with differentials. Questions were welcomed and thoroughly answered. Honestly the best interview experience I've had. I was called for an interview about two months after applying.", "Interview Questions": "Why do you want to be a nurse?"}, {"date": "16 Mar 2016", "title": "Pharmacy Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Dartmouth-Hitchcock Medical Center", "Interview Descriptions": "Getting an interview took forever. Multiple online applications, emails, calls.  Finally got a call  Slow process. 3 person panel.  Offer came next day. From application to start day was 6 weeks.", "Interview Questions": "General situational questions. Biggest success, name a time when you didn't live up to expectations"}, {"date": "24 Aug 2020", "title": "Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Dartmouth-Hitchcock Medical Center (Lebanon, NH) in Mar 2016", "Interview Descriptions": "The interview process was great. I was able to meet many people in the department and everyone asked great questions and made me feel very excited about the potential experience.", "Interview Questions": "What interested you about work in ....?"}, {"date": "2 Oct 2020", "title": "Physician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 months. I interviewed at Dartmouth-Hitchcock Medical Center (Lebanon, TN) in Mar 2016", "Interview Descriptions": "Standard Interview process for residency.  Online application.  Full day spent on site with other applicants.  A bit of a herd-like experience.  Overall a positive experience though.", "Interview Questions": "Pointed questions regarding my non traditional background"}, {"date": "18 Feb 2016", "title": "Pathology Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Dartmouth-Hitchcock Medical Center", "Interview Descriptions": "Interviewed by two people, they were both pretty friendly. The interview was very relaxed, they were interested in getting to know my personality and how I worked. Asked a few questions about my resume and prior work experience and then they told me about that job. I was given a tour of the facility and introduced to other employees.", "Interview Questions": "Describe how you handled a difficult work situation."}, {"date": "19 Jun 2018", "title": "Lpn Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Dartmouth-Hitchcock Medical Center (Concord, NH) in Feb 2016", "Interview Descriptions": "Easy, laid back. Left knowing I would be offered the job! They offered me food during the interview. Very nice people. More words to make this 30 separate words because it won't let me submit this otherwise.", "Interview Questions": "Why do you want to work here?"}, {"date": "30 Oct 2016", "title": "Medical Secretary Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Dartmouth-Hitchcock Medical Center (Manchester, NH) in Feb 2016", "Interview Descriptions": "I was contacted via telephone by the Human Resources department to let me know they were interested in having me come in for an interview. After I confirmed that I was in fact interested in the position, I was next contacted by the practice manager to set up a interview in the office. \r\nThe first interview was at the practice and lasted for approximately 45 minutes. The manager was extremely informative, professional and very nice. I actually enjoyed it! \r\nI returned for a group interview which included some of the employees I'd potentially be working with. I did appreciate the group interview to be able to meet my potential coworkers but the information was a bit redundant. \r\nUltimately we all got along very well and we proceeded with the job offer.", "Interview Questions": "How do you handle stressful situations, such as an irate patient. "}, {"date": "5 Feb 2016", "title": "Pharmacy Technician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Dartmouth-Hitchcock Medical Center in Feb 2016", "Interview Descriptions": "We talked about how important it is to have a professional team with no drama. We laughed throughout the interview. There was a test beforehand to see how you are with basic math. The people here seem happy to work where they do and committed to the success of their pharmacy. The interview was made up of two head technicians and the pharmacy manager. I am waiting to hear back but based on the interview, I would love to be welcomed into their work environment.", "Interview Questions": "what three words or phrases best describe you?"}], [{"date": "15 Mar 2017", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Dartmouth-Hitchcock Medical Center in Dec 2015", "Interview Descriptions": "I applied to a few jobs at DHMC and a recruiter from HR reached out to me about an administrative assistant role. I spoke with the administrative supervisor at the time and she asked me to come in for an interview. I interviewed and heard back from HR a week later and was offered the job.", "Interview Questions": "Would you be comfortable working independently? What experience do you bring to the table? "}, {"date": "14 Aug 2019", "title": "Receptionist Secretary Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Dartmouth-Hitchcock Medical Center (Lebanon, NH) in Aug 2015", "Interview Descriptions": "You meet with someone from the management team, depending on what position you are applying for. The questions were simple basic questions regarding why I wanted to position that I had applied for", "Interview Questions": "Why are you seeking  the position? How many years of experience do you have? Do you work well within a team as well as individually? "}, {"date": "9 Jul 2015", "title": "Medical Practice Management​​​​​ At CHaD Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Dartmouth-Hitchcock Medical Center (West Lebanon, NH)", "Interview Descriptions": "This was overall a great experience. The interview was geared towards my resume, what I was looking to get out of the internship and what skills I already had at the time. I was greeted by an administrative assistant at the door and upon meeting my interviewer (the director of CHaD) I instantly relaxed. She was easy to talk to and seemed genuinely interested in what I had to say. It paved the way for an incredible internship experience.", "Interview Questions": "What work experience do you have and how will it facilitate what you will be doing here?"}, {"date": "27 May 2015", "title": "Associate Provider Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 3 weeks. I interviewed at Dartmouth-Hitchcock Medical Center (Manchester, NH)", "Interview Descriptions": "Long interview process, split up into multiple days of meeting with various people throughout the facility.  Each day lasting 1-6 hours.   Parts of the interview were 1:1 and parts were in a group forum.  Conflicting updates on process and standings from administration and clinical personnel.    Follow up to interviews sub-par", "Interview Questions": "What do you consider your strengths and weaknesses"}, {"date": "19 Jan 2015", "title": "Nurse Residency Program Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Dartmouth-Hitchcock Medical Center in Jan 2015", "Interview Descriptions": "My initial contact was with a recruiter through the website.  We set up a time to interview the next day.  That went well, but then days later it turned out that candidates for this program weren't being handled any longer through this set of recruiters and I was back to square 1 with the process.", "Interview Questions": "Tell me a situation when you had to advocate for a patient in a way that went against another nurse or their action. "}, {"date": "2 Jan 2017", "title": "Imaging Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 3 weeks. I interviewed at Dartmouth-Hitchcock Medical Center (Lebanon, NH) in Oct 2014", "Interview Descriptions": "To long between interview and hiring. Did not explain what the job entitled fully. Needed a better focus   on the job and have a chance to ask other employees about the work.", "Interview Questions": "How well you work under stress"}, {"date": "10 Jun 2014", "title": "Housekeeper Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 4 months. I interviewed at Dartmouth-Hitchcock Medical Center (Lebanon, NH)", "Interview Descriptions": "It took several months to get a call for an interview. The interview process was in two stages. Once, with HR, just a simple overview and tentative offer. The second was with the head of the department. I had to pass a background check.", "Interview Questions": "I was asked, \"What do you prefer in a supervisor?\". "}, {"date": "4 Jun 2014", "title": "Project Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Dartmouth-Hitchcock Medical Center (Lebanon, NH)", "Interview Descriptions": "The interviewers were pleasant and easy to speak with; it was more conversation which is the kind of interview I prefer. At the end I asked about next steps and was anticipating a second interview to be scheduled the following week, but they ended up hiring internally without doing the second round. Despite this, I rather enjoyed the experience.", "Interview Questions": "No unexpected questions were posed. I was asked to describe a project that did not come out quite as I had hoped and what I would have done differently."}, {"date": "13 Apr 2015", "title": "Physician Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 5 months. I interviewed at Dartmouth-Hitchcock Medical Center (Nashua, NH) in May 2014", "Interview Descriptions": "I fist submitted my resume online.  A manager called me and asked me general questions.  I was invited for an interview.  On that day, I toured the office and met several of the staff members.  The staff, PAs and one doctor interviewed me. The manager emailed me several times and then I was invited for a second interview.  After that, I was invited to shadow the employee who was leaving.", "Interview Questions": "What do you imagine you will be doing in 5 years?"}, {"date": "14 Apr 2014", "title": "Research Coordinator Interview", "results": "No Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Dartmouth-Hitchcock Medical Center (Lebanon, NH)", "Interview Descriptions": "The interview was very low key.  They asked me \"Why DHMC?\"  \"Why the Research Coordinator position?\" and then asked me a lot about my interests and goals. Much of the time involved me asking them questions, which was very important.", "Interview Questions": "The most unexpected question was \"how long do you see yourself working here?\"  I thought this job was typically about a 2 year position.  They want someone for longer, and made that clear to me in the interview."}], [{"date": "26 Jan 2014", "title": "Human Resources Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Dartmouth-Hitchcock Medical Center (Lebanon, NH)", "Interview Descriptions": "Standard interview process and questions", "Interview Questions": "Nothing unexpected or difficult"}, {"date": "29 Sept 2017", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Dartmouth-Hitchcock Medical Center (West Lebanon, NH) in Jan 2014", "Interview Descriptions": "Pretty standard. Met with two supervisors. Overall very chill experience. Everyone was very kind and open. The office was simple and welcoming. Everyone was super nice. yeah, not a bad experience.", "Interview Questions": "strengths, weakness, organization?"}, {"date": "3 Jun 2013", "title": "Professor of Surgery, Plastic Surgeon Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Dartmouth-Hitchcock Medical Center", "Interview Descriptions": "This all took place 17 years ago. Initial contact was informal and then was invited for an initial exploratory visit.  That led to a second visit, more interviews/meetings, then job offer.", "Interview Questions": "I dont' recall anything unexpected or difficult."}, {"date": "17 Jun 2013", "title": "Supervisor Interview", "results": "No Offer", "experience": "N/A", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Dartmouth-Hitchcock Medical Center in Jun 2013", "Interview Descriptions": "Very professional and methodical. Had phone interview and virtual interview ..later was invited for face to face interview. I have not yet got a decision yet from the hiring department", "Interview Questions": "Nothing out of ordinary. Lot of critical thinking questions. Panel wants to make sure, the candidate is truly fit for the job."}, {"date": "1 Apr 2013", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 4 weeks. I interviewed at Dartmouth-Hitchcock Medical Center (Lebanon, NH)", "Interview Descriptions": "HR is going through transition right now so it is not the same as 7yrs ago. Submit an nonlinear application with resume and cover letter. Then I got a phone interview with a nurse recruiter. He then told me which units were hiring and I told him my interests. He set up interviews with the managers and had the interviews. Now it took them awhile to contact me before the phone interview so communication is not the greatest.", "Interview Questions": "Why do you want to work on the hardest floor in the hospital?"}, {"date": "23 Jan 2013", "title": "Statistical Research Analyst Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Dartmouth-Hitchcock Medical Center", "Interview Descriptions": "45 mins presentation first, interview committee included about 6 professionals. Then 3 one-to-one interview, 1 hr per each.", "Interview Questions": "None."}, {"date": "18 Oct 2012", "title": "Appointment Secretary Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Dartmouth-Hitchcock Medical Center (Nashua, NH)", "Interview Descriptions": "I had two interviews. The first was with my supervisor and the office manager. The interviewers had a packet of questions. There were probably 30 questions. The questions made you think, and were mostly about your thoughts on patient-centered care. The second interview was with one of the other employees I would be working with. This employee did not have any specific questions, rather just got a feel for my personality to see if this would be a good fit/good team.", "Interview Questions": "The most difficult question was how would you confront someone who is not pulling their weight/completely their work. "}, {"date": "1 Jun 2015", "title": "Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Dartmouth-Hitchcock Medical Center (Lebanon, NH) in Mar 2012", "Interview Descriptions": "Overall the interview process was pretty easy. It consisted of two parts: phone interview and in person meeting. The phone interview was with the hiring manager who asked a lot questions that targeted my personality, plans regarding careers development. The second part was an all day in person interview: I had 30 minute interview sessions with multiple people from the department that I applied to", "Interview Questions": "Why are you interested in working for Dartmouth-Hitchcock? Where do you see yourself in the future?"}, {"date": "25 Sept 2013", "title": "Systems Administrator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Dartmouth-Hitchcock Medical Center (Lebanon, NH) in Feb 2012", "Interview Descriptions": "Initial communications were by phone and I first had a phone interview with my direct manager and the director of the department. After making it through that interview I was brought in for an in-person interview with both of them and my 5 teammates. I was then brought back in for 1 more interview with my direct manager and 5 teammates. I heard back roughly 3 weeks after my last interview with an offer.", "Interview Questions": "1st question of the phone interview was what are my salary requirements."}, {"date": "28 Nov 2011", "title": "Donor Relations Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Dartmouth-Hitchcock Medical Center (Hanover, NH) in Sept 2011", "Interview Descriptions": "Very distant. Not certain this was a place I wanted to be as a result...", "Interview Questions": "Tell me about your fund-raising experience?"}], [{"date": "30 Sept 2015", "title": "Triage Nurse In DHMC Clinic Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Dartmouth-Hitchcock Medical Center (Lebanon, NH) in Aug 2011", "Interview Descriptions": "I was scheduled to meet with 4 interviewers.  These included : a physician, bone marrow transplant coordinator, practice manager,direct supervisor, I met with each one separately and the entire interview lasted approx one hour.  It was conducted in a comfortable room with a large conference room table.  I felt relaxed aand it was totally non threatening.", "Interview Questions": "what approach do you take in remembering how to problem solve"}, {"date": "12 Jan 2012", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Dartmouth-Hitchcock Medical Center (Lebanon, NH) in Aug 2010", "Interview Descriptions": "It was cordial. Hiring manager was open and friendly. Made me feel welcomed!", "Interview Questions": "Give example of a tough project you spearheaded and how you turned it around?"}, {"date": "7 Aug 2010", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 days. I interviewed at Dartmouth-Hitchcock Medical Center (Hanover, NH) in Jun 2010", "Interview Descriptions": "What my interests were, my post-grad plans", "Interview Questions": "What are you interests?"}, {"date": "31 Jan 2012", "title": "Nursing Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Dartmouth-Hitchcock Medical Center (Lebanon, NH) in Feb 2010", "Interview Descriptions": "I had one on one interview and a panel interview.\r\nIt was a warm and welcoming group. They asked me about my interest in this role and what do I bring to the organization. I was asked to highlight my skills and what do I struggle with.", "Interview Questions": "What do you bring to this organization?"}, {"date": "9 Jul 2009", "title": "Second Shift Blood Banker  Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Dartmouth-Hitchcock Medical Center in Apr 2009", "Interview Descriptions": "Interviewed with several people from top management down. Interview questions were mostly relevant except for the occasional idiotic question such as \"what are your weaknesses\". Finally interviewed with the techs with whom the new hire would eventually work. They looked tired  & seemed rather \"bothered\" and jaded by the whole process. Management nixed any ideas concerning research projects, which was odd considering D-H's ivy league-ish University aura and emphasis on research. In other words, they wanted a lab drone - no more than that. Their 3rd shift had no dedicated blood bankers so it would fall on 2nd shift to complete most of the work regardless of how late it became. In a level  trauma center it's ridiculous to NOT have dedicated bankers on all shifts - period. Lab tour was last and on seeing it, could understand WHY the blood bank crew looked tired and seemed ornery - it was the worst designed lab  ever  - anywhere, regardless of facility size in my almost 30 years of employment around the country. I couldn't imagine working there and suddenly felt sorry for the crew. The facility itself was posh and very patient/family oriented (read: lots of $$). My accommodations were posh as well. Was reimbursed handsomely for travel. But it was clear that little or no $$ had been relegated to the labs - and that the new hire would be a slave. I prayed that they would not offer the position to me, desperate as I was to get a job. Fortunately that prayer was answered and someone else (poor soul) was hired.", "Interview Questions": "What are your weaknesses?"}, {"date": "24 May 2012", "title": "Clinical Social Worker Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 3 days. I interviewed at Dartmouth-Hitchcock Medical Center (Lebanon, NH) in Jun 2008", "Interview Descriptions": "It seemed very poorly organized - at first the hiring manager said I could have the job, then spoke with upper management and came back to say that more interviews needed.  These were arranged, but one person could not participate so I needed to have a separate interview with her.", "Interview Questions": "they really did not have questions - it was more of a conversation with me asking them questions and presenting my ideas"}]]