[[{"date": "2 Jun 2023", "title": "Social Worker/Case Manager Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Cook Inlet Tribal Council (Anchorage, AK) in Aug 2022", "Interview Descriptions": "The interview process was great. They scheduled with me, sent link for zoom meeting, and gave me over an hour of their time. I was able to ask questions and get more information.", "Interview Questions": "Lots of \"tell us about a time\" questions."}, {"date": "26 Sept 2017", "title": "Receptionist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Cook Inlet Tribal Council (Chicago, IL) in Aug 2017", "Interview Descriptions": "I was asked to come to the school at 5pm at a morning job fair. I was also asked would I be interested in becoming certified in MOS. I said yes. When I got to the interview I was instructed on how to get free tuition to attend the school. I was then told that the position is being reviewed by someone else who has been interviewing for 3 weeks. I was told \"I don't want to mislead you but if something comes up we will call you.\"", "Interview Questions": "I wasn't asked any questions, I was mislead."}, {"date": "28 Oct 2016", "title": "Case Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Cook Inlet Tribal Council (Anchorage, AK) in Jun 2012", "Interview Descriptions": "The interview was a three person panel interview process with scenarios of workforce and life skills questions. It was to designed to find the best candidates to help provide services to the participants and a win/win. It costs money to hire/train/retain employees and if the candidates met the mission goals it was aligned to work for the organization, employee, and participants.", "Interview Questions": "Interview questions were behavioral."}], [], []]