[[{"date": "6 Jun 2023", "title": "Development Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Catholic Relief Services", "Interview Descriptions": "Treat potential talent like you would want to be treated. I had a screening interview, followed by another interview and a panel interview. When hiring for director level roles, don't make them jump through multiple hoops just to ghost them. I was shocked by the utter lack of professionalism by one of the largest NGOs. I went from really wanting to work for this organization to having zero desire to pursue future roles.", "Interview Questions": "Boiler plate questions regarding why CRS and relevant experience."}, {"date": "5 Apr 2023", "title": "Program Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Catholic Relief Services (Jerusalem, Jerusalem)", "Interview Descriptions": "Within a few weeks of applying, I received an invitation for a virtual interview. One-hour panel interview with two Country Program staff. Roughly 10 questions, mix of scenario-based questions and behavioral questions. I received an offer within about a week after the interview.", "Interview Questions": "What has been your experience using accountability mechanisms for safeguarding and protection mainstreaming?"}, {"date": "30 Apr 2023", "title": "Volunteer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Catholic Relief Services (Cairo, Cairo Governorate) in Mar 2023", "Interview Descriptions": "The process was easy, they contacted me and set the interview online, they were 3 One had the general questions The other two had the situational questions They were nice but unfortunately I didn’t get a job offer and i fail to know why to this point.", "Interview Questions": "The interview was simple. First they asked me what do i know about crs, what’s my previous job experience, why do i want to work with crs .. Second part was situational What would you do if you had a conflict with a colleague? What would you do if you’re in a session and the break is soon and the meals haven’t arrived yet? How would you reply if someone wants to ask a question in the middle of the session?"}, {"date": "20 Apr 2023", "title": "Media Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Catholic Relief Services in Feb 2023", "Interview Descriptions": "I applied online. About a week later, I got an email from the hiring recruiter asking to schedule an interview for the next day. It was about 30 minutes. Then, I got moved to the next stage which was speaking with the hiring manager for about 45 minutes. She only asked me two questions (Tell me about yourself, why are you interested in CRS?). These were very basic questions. For the rest of the interview, she wanted me to ask her questions about the interview. She started telling me about all of the amazing benefits of CRS and how it would be for me to work there, selling me the dream. It seemed as if I was the selected candidate the way the conversation went when she told me that next I would be meeting with the people I would be working with in another two weeks. After another long interview panel (about an hour) I asked about the next steps. I was told that they still had other candidates and was sorry that I'd have to wait a few weeks to hear back. One month went by and I waited. No phone call, email, or anything. But I trusted that they'd reach back. I reached out asking for an update and got no reply until I reached out again a week later, only to receive an email that said they had moved on to other candidates. I appreciate the opportunity. But I find it extremely frustrating when you lead someone on without being transparent and honest. They wasted over 2 months of my time. I learned to never ever wait for a company ever again. Trust me, if a company wants you they will hire you in no time. Not lead you on for 2 months...", "Interview Questions": "What makes you a good culture fit for CRS?"}, {"date": "20 Jan 2023", "title": "Procurement Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Catholic Relief Services", "Interview Descriptions": "Very detailed, several phases, requires thorough preparation. In the written part there is a case study to analyze in addition to other General and job specific questions as well as financial part and calculation. HR specialist very positive and inspiring person", "Interview Questions": "In which case did you avoid public procurement guidelines?"}, {"date": "8 May 2023", "title": "Director of Training and Development Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Catholic Relief Services (Baltimore, MD) in Jan 2023", "Interview Descriptions": "First, completed a 30 minute screening and then a one hour interview. The interview at first focused on the job description but then began to focus on the need to write position descriptions, which is what they seemed to need more than a Director of Training.", "Interview Questions": "All of the standard questions: Tell us a bit about yourself, what was the most challenging, what was the most rewarding, why do you want to work with use, etc."}, {"date": "14 Dec 2022", "title": "Programmer Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 3 months. I interviewed at Catholic Relief Services", "Interview Descriptions": "I don’t consider the hiring process very professional. First interview was virtual for 30 min. Then with a panel of 3. After 6 weeks of no reply I get a request for a written assignment. Then NO reply at all, and NO reply to my reminding emails!", "Interview Questions": "Very simple and straightforward technical, leadership and safeguarding questions."}, {"date": "24 Nov 2022", "title": "technicien Abris Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at Catholic Relief Services", "Interview Descriptions": "La salutation,l'information sur l'entreprise,pretention salariale,ma relation social, niveau d'etude, experience professionnelle,situation matrimonial, experience sur le poste en question,le dynamism,le respect hierachique,le rapport ,le feed back, informé avant d'agir,verifié les identités pour les distribution cash,appelé les beneficiaire trois jour avant la distribution,receptionné les materils d'abris d'urgence et faire un bordereau de reception ,faire la confrontation avec le bordereau de livraison.", "Interview Questions": "quelle est ta relations avec les collaborateur"}, {"date": "25 May 2023", "title": "Community Engagement Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Catholic Relief Services in Oct 2022", "Interview Descriptions": "I had several interviews in a 6 month time line. They will do one, then weeks will pass, no information, then they will contact me again and so on. It was a long process and at the end I found out that they hire an internal candidate. Is nice that they promoted withing the company, but if they were going to do that they didn't need me to get excited and go on a 6 month process.", "Interview Questions": "Even though is a religious organization, there was nothing related to religious believes, in a way it felt like they didn't care about that aspect and they mostly care about advocacy."}, {"date": "14 Sept 2022", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Catholic Relief Services", "Interview Descriptions": "The interview was conducted remotely. First, the interviewer spent several minutes just getting to know me and asking me personal questions about my resume. She did a wonderful job of making me feel safe and ready to share about my professional experiences.", "Interview Questions": "What is your experience with quantitative data analysis?"}], [{"date": "7 Jun 2022", "title": "Senior Project Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Catholic Relief Services", "Interview Descriptions": "Full time position to be based in the field office.  Candidates normally will go through a multi-stage process of selection, including written tests, face to face interviews/ or virtual interviews through microsoft teams. Normally the selection process is swift and smooth once the best candidate is noticed. Sometimes, there is a final process where the top two candidates meet the hiring manager", "Interview Questions": "Tell me why you think  you are the most qualified for the position?"}, {"date": "22 Nov 2022", "title": "Deputy Regional Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Catholic Relief Services (Nairobi) in Apr 2022", "Interview Descriptions": "Virtual interview, two steps. The interviewers weren't interested in putting video on. Lengthy and all kinds of therival questions. For such a high position they asked questions they can see and judge from the cv, which made me lose interest", "Interview Questions": "N/A"}, {"date": "21 Mar 2022", "title": "Technical Advisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Catholic Relief Services", "Interview Descriptions": "I have applied for multiple positions at CRS and was invited to interview for two of them. Took 3 months to get the interviews. Never heard again. Had one hiring manager say that HR apparently lost my application.", "Interview Questions": "Give an example of how you have handled conflict with staff you supervise?"}, {"date": "25 Jan 2022", "title": "Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Catholic Relief Services", "Interview Descriptions": "Fue un proceso extenso pero muy acertado y de mucho enriquecimiento personal. Las personas fueron muy amables y profesionales al momento de realizar las entrevistas y pruebas técnicas correspondientes, por lo que calificaría este proceso como una grata experiencia.", "Interview Questions": "Sobre mis estudios y experiencia"}, {"date": "25 Jan 2022", "title": "Intern Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Catholic Relief Services", "Interview Descriptions": "two successive interviews to get a position over the summer. The first is understanding CRS and its operations and what kind of work you are interested in and how it aligns with the mission. The second is more job specific.", "Interview Questions": "What do you know about CRS"}, {"date": "23 Feb 2022", "title": "Communications Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 2 months. I interviewed at Catholic Relief Services in Jan 2022", "Interview Descriptions": "I had a positive interview experience and was excited to accept their offer! The team I spoke with was friendly, and I could tell they are dedicated and passionate for their work. The overall process took ~2 months but was worth the wait.", "Interview Questions": "Describe a time where you worked with a diverse team and differing perspectives"}, {"date": "5 Dec 2021", "title": "Project Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Catholic Relief Services", "Interview Descriptions": "Test then interview. It was a situational interview based on the job description. Includes questions about leadership, team spirit, decision making process . I took around 45 minutes and it was panel of three people.", "Interview Questions": "Why you are a unique candidate for this position?"}, {"date": "18 Mar 2022", "title": "Head of Programming Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Catholic Relief Services (Baltimore, MD) in Dec 2021", "Interview Descriptions": "The interview process was very informal and friendly. It felt like a conversation more than an interview. My panel was country program and regional leadership. They came back with news that I could expect an offer in two weeks.", "Interview Questions": "How did my professional experience relate to the position?"}, {"date": "10 Jan 2022", "title": "International Development Fellow Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Catholic Relief Services (New York, NY) in Dec 2021", "Interview Descriptions": "This was the second stage of the Catholic Relief Services International Development Fellowship application process. It was a video interview that required 1 written response and 4 verbal responses. It was relatively challenging but can be done through strong preparation.", "Interview Questions": "What position would you be interested in after the fellowship? "}, {"date": "22 Oct 2021", "title": "Operations Adviaor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Catholic Relief Services", "Interview Descriptions": "Preliminary introduction with HR representative (30 min) and then a panel interview with members of the team (1 hour).\n\nThe interviewers were very personable and natural. They made me feel comfortable.", "Interview Questions": "What do you think will be the most challenging thing about this position?\n"}], [{"date": "14 Sept 2021", "title": "Prospect Research Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Catholic Relief Services", "Interview Descriptions": "The interview was remote (COVID times), and felt awkward as it was clearly one of the first times this person had conducted a job interview. They weren't very clear about what they were looking for, or how the job would be broken down, and several times questions were asked that I had already provided answers to. At the end of the interview I was told I would be contacted soon either way, as they respected my time. It's been over 6 months, and I have yet to hear back. Apparently their definition of 'soon' and 'respecting someone's time' is different from mine.", "Interview Questions": "What is your experience with relationship mapping?"}, {"date": "2 Apr 2021", "title": "Country Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Catholic Relief Services (Addis Ababa) in Apr 2021", "Interview Descriptions": "Would you please tell me how could be the steps of the recent Interview Process?  And tell me about the kinds of it. The three stages of the previous interview processes.", "Interview Questions": "Tell me also how could be the description styles of the recent Interview Questions?"}, {"date": "4 Mar 2021", "title": "Head of Programming Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Catholic Relief Services", "Interview Descriptions": "First interview with HR. Next round: Panel interview. Panel members respectful and interview organized. Questions asked in turn. About 10-15 questions. Technical and managerial questions. Organizational questions. Overall well organized process", "Interview Questions": "Your strengths and weaknesses standard question"}, {"date": "3 Feb 2022", "title": "Senior Project Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Catholic Relief Services (Kampala) in Mar 2021", "Interview Descriptions": "it was fair, started a little late. found a diverse team.  every interviewee was given a time for the interview. I had no idea if the answers i gave pleased or displeased the panel. But i had hope and i tried to exude optimism during the entire interview.", "Interview Questions": "N/A"}, {"date": "21 Feb 2021", "title": "International Development Fellow Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Catholic Relief Services", "Interview Descriptions": "I completed the interview as a recorded video. The questions were relatively difficult to answer with the time that was provided, however touched on many important aspects of the position.", "Interview Questions": "What do you see yourself doing three years after completing the fellowship?"}, {"date": "26 Feb 2021", "title": "Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Catholic Relief Services", "Interview Descriptions": "During COVID, so it was held online.\nAttendees were: My direct supervisor (project manager) and another in her similar position in the same department but for another team and the program manager was just an observer.\nQuestions revolved around skills, situations and few technicalities.", "Interview Questions": "Describe a conflict at work and how did you solve it?\nHow will you deal with the beneficiaries in different situations like (.....)?"}, {"date": "14 Feb 2021", "title": "Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Catholic Relief Services", "Interview Descriptions": "Two interviews has very clear process,  at first one HR patiently explains the process and asks good questions. At the second one there were three people, they had no admin question only about job responsibilities.", "Interview Questions": "What are my salary expectations?"}, {"date": "7 May 2021", "title": "Sr. Instructional Designer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Catholic Relief Services (Edmonton, AB) in Jan 2021", "Interview Descriptions": "The interview was okay, but they didn't provide a feedback. Even if someone was not selected, a mail to inform that is great. The panel was good but they could at least inform.", "Interview Questions": "Introduce yourself."}, {"date": "8 Aug 2020", "title": "International Development Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Catholic Relief Services", "Interview Descriptions": "Started with online submission of application followed by a language interview over the phone. Interview process was standard. The whole process took about 4 months from the time the application closed until hearing back.", "Interview Questions": "Strengths and weaknesses, compatibility with Catholic social teachings"}, {"date": "24 Jul 2020", "title": "Business Development Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. I interviewed at Catholic Relief Services (Antananarivo) in Jul 2020", "Interview Descriptions": "1st interview was with HQ in Baltimore over skype. 30 minute interview, simple straight forward questions and 2nd interview with local management team 3 people. It was one hour many STAR questions.", "Interview Questions": "When did you have an experience that someone did not fulfil their work duty?"}], [{"date": "19 Jan 2021", "title": "Head of Programming Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Catholic Relief Services in Jun 2020", "Interview Descriptions": "Very straight-forward interview with a panel. I interviewed for several positions before I was given one and it was clear for some I was the \"token\" interviewee so they could hire someone already in the system.", "Interview Questions": "What do you think are the most important aspects of your job? "}, {"date": "8 Apr 2020", "title": "Fellowship Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Catholic Relief Services", "Interview Descriptions": "It was an online recorded interview; a time frame and link were provided and you had to click through and respond to the pre-recorded prompts. There were 3 prompts and one writing exercise. The answers were timed and you were able to re-record your responses.", "Interview Questions": "CRS is an organization with a Catholic Identity; have you considered any personal conflicts with this? If none, how would you help a peer who is struggling with this?"}, {"date": "3 Dec 2019", "title": "International Fellow Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Catholic Relief Services (San Salvador) in Nov 2019", "Interview Descriptions": "You turn in resume and cover letter/statement of intent. If moved past round one, they'll invite you to an interview.  The next round consists of language interviews to ensure that you speak the language well. Finally, they'll send you to Baltimore if you make it to the last round of finalists.", "Interview Questions": "What are your professional goals in 2 years? "}, {"date": "18 Oct 2020", "title": "Senior Project Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Catholic Relief Services (Yaoundé) in Sept 2019", "Interview Descriptions": "Hiring was quick, generally 4 to 8 weeks. Involves application screening, a written test and an interview. The main focus during the interview was on the individual's behavioural competencies and managerial skils.", "Interview Questions": "What is your greatest weakness?"}, {"date": "29 Jul 2019", "title": "Technical Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Catholic Relief Services (Baltimore, MD)", "Interview Descriptions": "Swift interview process. Turnaround from interview to offer for this position was faster than normal for Catholic Relief Services. Questions were basic; no surprises; one of which definitely involved the typical STAR (situation, task, action, result) - format - expectation for answers. In many cases, a question is asked about one's awareness of the \"Integral Human Development\" framework, which serves as the basis for CRS's approach to response and development.  \r\n\r\nNote that generally little explanation was provided on the dismal realities on the generally poor quality of life in the highly segregated and unequal city of Baltimore. Unfortunately, in their defense, very little can prepare one for these apartheid-esque conditions and consequentially high-cost of living that serves as both a by-product and a mechanism for calcifying and perpetuating that segregation.", "Interview Questions": "Questions were basic. Not too far off the beaten path."}, {"date": "17 Jun 2019", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Catholic Relief Services (Cairo, Cairo Governorate) in Jun 2019", "Interview Descriptions": "At the beginning I sent my C.V and cover letter then received a phone call 2 weeks  later and at first there was a technical test for mathematical skills and Microsoft office knowledge then one month later an interview,", "Interview Questions": "The challenges that will meet you in this position, describe how your previous work experience and education level meet the requirements of this position. "}, {"date": "14 May 2021", "title": "Field Training Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Catholic Relief Services (Tacloban, Tacloban) in May 2019", "Interview Descriptions": "A panel was composed of the head of office, the sector supervisor and the HR. Questions were mostly what I do in my previous job to see if I fit for the position and situational questions to see if your values fit to the organization’s values.", "Interview Questions": "What were roles and responsibilities in your previous job?"}, {"date": "11 Sept 2020", "title": "Program Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Catholic Relief Services (Baltimore, MD) in May 2019", "Interview Descriptions": "Easy and straighforward. It took 2 weeks to get the final offer. I applied via their website. Interview in two rounds, HR and the Hiring Manager. They were nice and polite, allquestions were clear", "Interview Questions": "My experience with managing staff"}, {"date": "7 Apr 2019", "title": "Global HRIS Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "The process took 4 weeks. I interviewed at Catholic Relief Services (Baltimore, MD)", "Interview Descriptions": "The interview process was quick. The turnoff was that the employer knew i had an offer on the table and informed me it was between me and another candidate. They then checked my references and salary. Looks like they are going to make an offer. Then the story of the amount of candidate left to interview and recruiting timeline changed all of a sudden. Doesn’t look diverse from leadership.", "Interview Questions": "What attracted you to the role?"}, {"date": "1 Dec 2018", "title": "Learning Program Manager Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. I interviewed at Catholic Relief Services", "Interview Descriptions": "I am astonished that a faith-based organization would give their verbal word and rescind an offer. I have a squeaky clean background with excellent references. I was given a verbal offer, and later found out that the offer was rescinded for no real reason, other than  the position had gone to an internal candidate. I feel like my valuable time was wasted. I had another offer on the table from another organization and let it go. This was not professional and speaks poorly of the organization. I was given signs throughout the interview process that the culture seems to favor only people who are like them. Unfortunately, as an African-American woman, I believe they felt that I was too high energy, passionate and assertive. I was told that I was \"high energy\" and would need to be coached if I was in this role. In a time such as this, it's amazing that organizations and hiring managers are not being more inclusive. But, it seems that this hiring manager simply wanted someone who already knew how to fit in and conform to the nature of the organization. This is extremely disheartening that an organization that is meant to serve all types of people would single out those who are not enough like them.", "Interview Questions": "Tell me about yourself."}], [{"date": "23 Mar 2019", "title": "Project Coordinator/Program Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Catholic Relief Services (Baltimore, MD) in Nov 2018", "Interview Descriptions": "The interview is pretty standard. And there is only one interview (although this depends on who is the hiring manager). As for the interview itself, the panel will be alternating in throwing questions at you. There is usually around 10 questions. Questions are mixed — motivation, previous experiences related to the job, technical assessment, and soft skills (conflict management and supervision). You will not hear from the hiring manager about the interview. A recruiter will be the one telling you the results of the interview. Sometimes they give you feedback but sometimes they just give you a cold shoulder after an interview. Sometimes (as in my case), the interview was more of a formality since someone is already in mind for the job. They had to interview more than one candidate as part of the process (which is basically a waste of time for the applicant and the organization). And this has been a practice with international NGOs so nothing shocking there.", "Interview Questions": "How would you design the research method for this project?"}, {"date": "29 Oct 2018", "title": "Project Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Catholic Relief Services", "Interview Descriptions": "It was face to face interview and it took 45 min, they asked  questions related to the job description of the position, by the end of the interview they asked me when I can start working with  them", "Interview Questions": "Why are you interested in applying for this job ?"}, {"date": "24 May 2019", "title": "Head of Office Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Catholic Relief Services (New Delhi) in Sept 2018", "Interview Descriptions": "the interview was very comprehensive. there was written test followed by personal interview. The interview panel was very skilled and the whole process took more than one hour. The panel asked about my experience and my fit for the role", "Interview Questions": "Your fit for the position"}, {"date": "4 Jun 2022", "title": "Intern - Hourly Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Catholic Relief Services in Sept 2018", "Interview Descriptions": "Easy, normal HR question. the only con is the short notice contact before the interview. they called me a day before the interview. but the interview overall was okay. the interviewers were professional & friendly.", "Interview Questions": "How do you handle stress?\nTime management related questions"}, {"date": "17 Feb 2019", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Catholic Relief Services in Sept 2018", "Interview Descriptions": "I applied online for education and grants program and i was called after 3 weeks to go foe an interview. I was interviewed by 3 friendly workers.  The acceptance mail was sent after the interview with 3 days", "Interview Questions": "Does and don't in interacting with refugees"}, {"date": "11 Jul 2018", "title": "Fundraising Writer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Catholic Relief Services", "Interview Descriptions": "I was contacted by a PR person and a week later I was interviewed for an hour by a manager over the phone. I was then asked to take a three hour writing and editing test the following week. I was told I would hear from them within a week from taking the test but nobody contacted me. I wrote to ask the manager who interviewed me about the test and I was told they hadn't had a chance to review it. I waited another week and contacted the manager again but I got the same response along with the assurance that I would hear from them in yet one more week. Again, no one wrote or called. All in all, the process was extremely frustrating given the time it demanded and the highly unprofessional manner in which I was dismissed. If you take a candidate this far along in an interview process, the very least you could do is have the courtesy to inform him or her that you will be moving on/hiring someone else.", "Interview Questions": "Standard questions. What is your experience, why did you apply to this position, etc. "}, {"date": "18 Jul 2018", "title": "Measurement and Evaluation Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Catholic Relief Services in Jul 2018", "Interview Descriptions": "Rigorous. Focused questions about qualitative and quantitative skills. Prior experience in content area a plus. A 3 panel interview via Business for Skype with country representatives. Discussion about country conditions very helpful, company security for staff in country, and some discussion on housing choices.", "Interview Questions": "How would I develop a plan for the evaluation of data?"}, {"date": "11 Feb 2018", "title": "Team Leader Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Catholic Relief Services", "Interview Descriptions": "Apply online on the website career section , Invitation to Technical written  test after passing the test , Invitation to interview , after accepted in the interview , they send job offer if accepted they start hiring.", "Interview Questions": "Whats your information about CRS activities ?"}, {"date": "20 Jan 2022", "title": "International Development Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 5 months. I interviewed at Catholic Relief Services (Baltimore, MD) in Jan 2018", "Interview Descriptions": "A long multi-step process. Application round (submit cover letter and resume), recorded interview round (record your responses in a video interview to 5-7 questions), language test (in your second language via a third-party company), and in-person interviews/presentations.", "Interview Questions": "Where do you see yourself in 5 years? 10 years?"}, {"date": "9 Aug 2018", "title": "Monitoring and Evaluation Expert Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 4 months. I interviewed at Catholic Relief Services (Lusaka, Lusaka) in Dec 2017", "Interview Descriptions": "Consisted of both oral and written test centered on practical aspects of M&E, first participated in a skills test and then attended oral interviews, this was followed by 2 one-on-one interviews with the Country Representative, one interview with a consultant and one interview with the Head of programs as i was being offered a job a grade higher than the one i applied for", "Interview Questions": "Why do you want to leave your current job and company"}], [{"date": "19 Jul 2018", "title": "Domestic Finance Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Catholic Relief Services (Baltimore, MD) in Nov 2017", "Interview Descriptions": "The questions were not easy questions because you had to apply and think of yourself in a real life situations. I was interviewed and asked questions by four or more people which made it a little nerve racking.", "Interview Questions": "Think of a situation where you had to work in a team or group where one or two members were not holding their weight how did you react. "}, {"date": "1 May 2018", "title": "Regional Field Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Catholic Relief Services (Baltimore, MD) in Sept 2017", "Interview Descriptions": "Very brief and a bit unorganized.  Many companies advertise positions for which they already have an internal candidate groomed for.  I guess this is part of any hiring process, only that outside resumes-- no matter how strong the candidate-- were used to fulfill CRS' minimum screening requirements.", "Interview Questions": "Basic questions on the job itself, also knowledge of CRS."}, {"date": "28 Jul 2017", "title": "Finance Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Catholic Relief Services (Cairo, Cairo Governorate) in Mar 2017", "Interview Descriptions": "first the were test the they called for interview .The interview was about managerial skills  and technical skills . this interview also is describe what the job need and measure if I'm qualified to fill it or not", "Interview Questions": "How to motive your subordinates?  "}, {"date": "1 Nov 2017", "title": "Project Manager Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 3 months. I interviewed at Catholic Relief Services (Al `Ajūzah) in Jan 2017", "Interview Descriptions": "Comprehensive skills test\nFace to face interview with 2 program managers + HR member\nFace to face interview with head of programming \n\nThe very funny thing that these interviews was not consistent and it took me around 2 months between every interview and another and 6 months for the final feedback which is not accepted", "Interview Questions": "Situational question \nExperience questions \nCase study\nWrite reports"}, {"date": "4 Sept 2018", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Catholic Relief Services (Baltimore, MD) in Dec 2016", "Interview Descriptions": "Applied online, they got back to me the next day to set up an interview. The interview was pretty straight forward,  I was asked questions about my relevant knowledge and experience,  strengths, weakness etc", "Interview Questions": "Tell us about your previous experiences and how they match with the duties of this position"}, {"date": "30 May 2016", "title": "Award Management Officer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Catholic Relief Services", "Interview Descriptions": "Human Resources was very quick to get back to you in terms of setting up interviews.  However, I think the entire interview process was a little long winded. I felt strung along for over two months to be told I wasn't what they were looking for. I wouldn't call it a waste of time, because I learned a lot about the company and the staff were kind. I just think they could have been more transparent in what they were looking for so I could better prepare for the interview. I once went to an interview thinking it was for one position to be told they really wanted to meet to discuss varies possibilities and just wanted to see what I was looking for. Talk about confusion! In my mind, I'm thinking, It depends on what you need. You don't want to make any \"wrong\" answers in that situation. There also weren't any deadlines or official job descriptions present.  I've interviewed with many departments and so many people it was difficult to really figure out what they needed. I was even told I interviewed with them strongly so I'm still confused.  Although I'm disappointed, I would interview with them again if another position presented itself. They are still a good company to work for.", "Interview Questions": "If we called your former employer, what would be one thing they'd say that you could improve?"}, {"date": "6 Mar 2017", "title": "Marketing and Communications Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Catholic Relief Services (Baltimore, MD) in May 2016", "Interview Descriptions": "The hiring process was pretty easy. I submitted my resume and other information requested into the portal. I got a call several months later from HR to fix a time to speak with the Manager. First it was a phone conversation and then a meeting at the office.", "Interview Questions": "Why do you want to work in non-profit, giving your background in business?"}, {"date": "21 Apr 2016", "title": "International Development Fellow Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. The process took 3+ months. I interviewed at Catholic Relief Services", "Interview Descriptions": "Long, very long, and not always the most organized. There are multiple stages, starting with a CV and cover letter, then a skype interview, then a language proficiency test (Spanish, French, or Arabic), and then an in person interview. The entire process is handled by two staff members and they can lose track of dates and documents, so you need to stay on top of things.", "Interview Questions": "Biggest question to prepare for is why, specifically, are you choosing CRS over another NGO"}, {"date": "31 Jul 2018", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Catholic Relief Services in Mar 2016", "Interview Descriptions": "It's through a webcam with pre-recorded questions. They give you a certain amount of time to answer the questions. Some of the questions have to do with the Catholic religion since it is a Catholic organization but you don't have to be Catholic to work there.", "Interview Questions": "How do you identify with Catholic Social Teaching "}, {"date": "17 Feb 2016", "title": "Financial Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Catholic Relief Services", "Interview Descriptions": "Three to four calls with HR in regard to the position, health benefits and the mission of the organization. I later interviewed with a panel via Skype and then had a face-to-face interview.", "Interview Questions": "What would you like to work for a Catholic-based organization?\r\nFinance-related questions pertaining to my current position.\r\nWhich accounting software am I familiar with and use on a regular basis?\r\nWhether or not I speak different langua"}], [{"date": "24 Oct 2016", "title": "International Development Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Catholic Relief Services (Baltimore, MD) in Feb 2016", "Interview Descriptions": "Interviewing for the fellowship is a very long experience which includes an online application with short answer questions and basic resume information, a pre-recorded video interview, a Skype interview, a language test (Spanish, French, or Arabic), and finally an in person interview in Baltimore. \r\n\r\nFor the in person interview, it was a full day, with information sessions, a writing test, lunch, presentations, and a 1 hour panel interview with 3 people. The questions focused on past experiences, where they ask you to give examples of times certain things happened to you (you dealt with a difficult coworker, for example). Be prepared with lots of examples from several different work and school situations.\r\n\r\nFrom application to tentative offer, it was 5 months, 6 months for country placement (which you have little input on) and 7 months before background check was completed and offer finalized.", "Interview Questions": "What are some of the benefits and challenges of working for a faith based organization? Tell me about a time when [fill in the blanks]."}, {"date": "16 Jun 2020", "title": "Supply Chain Analyst Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Catholic Relief Services (Baltimore, MD) in Feb 2016", "Interview Descriptions": "The interview was done in two steps.  The first step was the technical part as they were looking into whether I fit the company's culture. The second interview was mostly to discuss benefits and for them to get a glimpse of your personality and interpersonal skills.", "Interview Questions": "How can you impact the company?"}, {"date": "7 Jan 2016", "title": "Head of Programming Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Catholic Relief Services", "Interview Descriptions": "Was contacted by recruiter by mail and phone stating that I urgently reply to request and fill out a questionnaire. I then waited some time for first interview. The second followed maybe two weeks later.", "Interview Questions": "Standard program quality questions and rather repetitive. They never tested my knowledge of the language for the country program which was surprising."}, {"date": "19 Aug 2015", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Catholic Relief Services", "Interview Descriptions": "I submitted an online application and was invited for a phone interview about a month later. About a week after the phone interview I was offered a position, without ever coming into the office.", "Interview Questions": "They asked about my experience and passion for advocacy."}, {"date": "7 Aug 2015", "title": "Monitoring and Evaluation Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Catholic Relief Services (Accra) in May 2014", "Interview Descriptions": "After the screening to shortlist a number of candidates (don't remember how many we were), a 3-member interview panel interviewed each shortlisted candidate. The candidates that passed this stage were further invited for a written test. After which, two top candidates were interviewed by the Country Representative and a final decision made on which candidate is the preferred one. The decision was said to have been made after consulting with the panel members that interviewed the candidates. The selected candidate is contacted by the Human Resource Manager through a letter signed by the Country Representative via attachment in an e-mail to the selected candidate.", "Interview Questions": "What goes into the preparation of an M&E plan?"}, {"date": "26 Apr 2016", "title": "International Development Fellow Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at Catholic Relief Services (Baltimore, MD) in Feb 2014", "Interview Descriptions": "It turned out to be a snow day for the interview day, so the CRS offices were closed and only a few staff showed up. Perhaps this is what negatively impacted the interview experience. During the panel interview, the interviewers sat very close with their reviewing sheet and their numeric scores to each of my answers were very visible. As you can imagine, this was extremely disconcerting. After the interview, I provided this feedback and CRS apologized and promised to remedy it for the next year.", "Interview Questions": "Would I be challenged by CRS' anti-contraception stance? "}, {"date": "17 May 2015", "title": "Copy Editor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 3 months. I interviewed at Catholic Relief Services (Baltimore, MD) in Sept 2013", "Interview Descriptions": "Had a lovely phone screen with the hiring manager. Was invited to a group interview that included executive from the division in which I would be working, an executive from the marketing dept., the publications manager, the website manager, and the web assistant. It was a relaxed interview with pertinent questions about my experience. One executive immediately made me feel right at home when he commented in a positive way about something on my resume that resonated with him.\r\n\r\nAlso interviewed with a smaller group---the team I ultimately would be working with.", "Interview Questions": "How do I handle competing publications priorities?"}, {"date": "12 Apr 2013", "title": "Program Manager Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Catholic Relief Services", "Interview Descriptions": "Preference given to applicants recommended by current staff", "Interview Questions": "N/A"}, {"date": "8 Mar 2013", "title": "Sis Specialist Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Catholic Relief Services", "Interview Descriptions": "I applied via the website and received an email from a Senior Recruitment Specialist a week later. The text of his message is below in quotes:\r\n\r\n\"Greetings from Catholic Relief Services. Thank you for your interest and application for our SiS Specialist position based out of our HQ office in Baltimore.\r\n\r\nI’m the recruiter for this position and I would like to schedule a brief call to go over the job description, discuss your expectations and review your employment history. This is the initial step in the candidate selection process that precedes a formal interview.\r\n\r\nWould you be available for a 30-minute call at 4:15pm EST on Friday, March 8th? I can also offer a 4pm EST time on Tuesday, March 12th as an alternate. \r\n\r\nPlease let me know if you are available and provide me with the best number, or Skype address, to contact you.\"\r\n\r\nI replied that I wasn't interested in having a conversation unless there was real interest on his part since I had nothing more to add which wasn't already mentioned on the resume or cover letter and the job description was pretty clear. Never heard back.\r\n\r\nNot sure what \"expectations\" he thought I had but I realize CRS is not Goldman Sachs. I applied because of my desire to help those in need. I was hoping to get an interview not spend 30 minutes on the phone so he could decide if he likes my voice. I think \"expectations\" was code for we don't want to pay you as much as you might want. I have two master's degrees - one from an Ivy League school with a 4.0 GPA,  the other earned with distinction from a D.C. school and a 3.8 GPA. I was also a Peace Corps volunteer and interned with the Bureau of Population, Refugees and Migration at the State Department. Despite all that, I can't get an interview? Sorry I can't walk on water. These guys are looking for perfection which is a shame because CRS does good work. Given the nature of their mission, the selection criteria should differ from that of a firm focused on its bottom line but I sadly that is not the case.", "Interview Questions": "Never progressed to the interview stage because the recruiter was trying to decide if I deserved an interview."}, {"date": "11 Jan 2013", "title": "Programme Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Catholic Relief Services (Ahmedabad)", "Interview Descriptions": "The interview was quite lenghthy which included one hour of written and almost 3 hours of preson interview. the interview panel constituted of key people from finance, program and HR. The hiring was based on the committment, my composure and knowledge and skills level. The interviewer also discussed about the personal and professional balance and willingness to travel to remote area.", "Interview Questions": "finance related questions"}], [{"date": "1 Jul 2015", "title": "Programmer Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Catholic Relief Services (New Delhi) in Apr 2011", "Interview Descriptions": "The interview process took nearly three hours with a written component and an interview with the head of office. Interviewers were quite courteous and made me feel comfortable.\r\n\r\nThey tool nearly 15 days to come out with a decision. Overall the whole process went on quite smoothly.", "Interview Questions": "What do you mean by development programming and about the church position with regard to family planning initiatives"}, {"date": "12 Jun 2015", "title": "International Development Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Catholic Relief Services (Baltimore, MD) in Mar 2011", "Interview Descriptions": "First you are pre-selected for a phone interview and an over the phone foreign language test (all applicants must speak English and one other language). If you pass this, you are invited to Baltimore for a multi-day interview process that includes a kind of \"who we are\" from the organizations (this way applicants can also decide if the organization is for them). The mutli-day interview included group work, a panel interview and some test/exercises.", "Interview Questions": "Nothing that you would not expect"}, {"date": "10 Dec 2010", "title": "Warehouse Supervisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 1 day. I interviewed at Catholic Relief Services (Harare) in Sept 2010", "Interview Descriptions": "I applied for an advertised post and was invited for an interview on a mentioned date which i accepted.We were eight of us and wanted to hire four persons.We filled interview forms with all our qualifications and work history.After the forms,we did group discussions on given topics and had to score marks.After group discussions we did individual presentation on a given topic for three minutes.After the presentation we then did oral interviews.We had to do practical test using computers with a time limit.", "Interview Questions": "There was no difficult question "}, {"date": "1 Oct 2013", "title": "Accounting Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Catholic Relief Services (Baltimore, MD) in May 2010", "Interview Descriptions": "Interview had three stages. First was a panel of interview which consisted of two managers and two director including supervisor. From the number of candidates interview panel selected two finalist. Each finalist had an additional interview with Director (direct supervisor) and then final interview with Chief Financial Officer.", "Interview Questions": "What are the challenges with sub-office common cost allocation and how you're going to approach it to ensure consistency and reasonableness of application among 50 different sub-offices"}, {"date": "14 May 2013", "title": "Project Accountant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 4 months. I interviewed at Catholic Relief Services (Lugazi, Kampala) in Feb 2009", "Interview Descriptions": "A job advert was put in one of the Uganda daily newspapers giving a submission deadline of two weeks. This advert run for three days. I was shortlisted for the first interview which was a written interview two months after the application deadline. One month later, I was shortlisted for the final interview which was an oral/panel interview. I was offered and accepted the job one month later", "Interview Questions": "The unexpected question was to give details of how to go about a situation when a superior gives me wrong instructions"}]]