[[{"date": "5 Dec 2022", "title": "Stagiaire Logistique Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Acted", "Interview Descriptions": "Entretien de 30 min général sur les motivation Test technique assez spécifique Entretien de 2 heures avec responsable logistique et quelqu'un de RH sur l'expérience liée à la logistique et sur les motivation", "Interview Questions": "- Motivation - Questions techniques liée à la logistique"}, {"date": "17 Dec 2021", "title": "Security Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Acted (Paris)", "Interview Descriptions": "Initial Interview was done from France by HR on Skype\n\nTotally incompetent HR who can't keep up with comments made.\n\nDo your research on protection of their staff - there is a lot of OSINT available and think twice", "Interview Questions": "Asking security questions which HR clearly has no understanding of\n\nInterview is posted on YouTube for anyone to see"}, {"date": "26 Nov 2021", "title": "Program Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "The process took 5 weeks. I interviewed at Acted", "Interview Descriptions": "I applied for a program manager position in an Afrian country. The HR interview was pretty straightforward and typical HR questions: self presentation, why ACTED, what would my previous employers say about me.\nThe second interview was harder. it was with 3 people: country director, HR in HQ and a project coordinator. \nIt was quite frustrating because they kept saying that they were interested in my profile, which gave me false hope, as I received an email 2 weeks later saying that I wasn't selected for the position.", "Interview Questions": "They asked technical questions on difficulties that I could encounter in distribution projects, how would I react if we crossed armed groups in the country, do I feel confortable dealing with armed groups and negociating access, and lots of \"what would i do in a specific situation\"."}, {"date": "17 Aug 2021", "title": "Environment and Climate Change Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Acted (Paris) in Jul 2021", "Interview Descriptions": "Phone interview.\nFriendly staff.\nDeclined progressing due to updated information that made the position not attractive. \nI explained that the offered salary was very low for international standards. HR mentioned their budget constraints, then I offered to do the assignment pro bono, but that option was not accepted.", "Interview Questions": "They provided upfront the maximum amount they could pay. It was below my expectations and I decided to withdraw myself from the selection process "}, {"date": "11 May 2021", "title": "M&E Intern Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Acted (Paris) in Feb 2021", "Interview Descriptions": "I had a 30 minute HR interview. The interviewer didn't turn on their camera while mine was on, which felt weird. The format was very much question, answer, question, answer. The interviewer was friendly and led the interview nicely - there were no awkward pauses. At the end of the interview  you had the chance to ask questions and they answered openly and transparently which I appreciated a lot.", "Interview Questions": "Straightforward questions that ask about your experiences, what you bring to ACTED, your career goals etc. What did you understand about the role as well. "}, {"date": "3 May 2023", "title": "Analyste Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Acted (Paris) in Jan 2021", "Interview Descriptions": "J'ai postulé à une offre via le site. Après avoir déposé mon CV et ma lettre de motivation on m'a contacté par mail. Le premier entretien s'est déroulé par téléphone", "Interview Questions": "Expliquez votre parcours scolaire et professionnel"}, {"date": "13 Nov 2020", "title": "Audit Interne Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Acted (Paris) in Nov 2020", "Interview Descriptions": "1er entretien (RH junior - 30 minutes environ)\r\nTest pratique - 2h \r\n2nd entretien (RH + Responsable audits internes - 50 minutes environ)\r\nLes entretiens se sont déroulés sur Skype. \r\nPas de questions pièges.", "Interview Questions": "Comment est financè ACTED?\r\nAttentes du poste?\r\nPourquoi ACTED?\r\nDans combien de pays intervient ACTED?\r\nQuestions spécifiques aux audits (qu'est ce qu'un logisticien, déroulement d'un audits, ...)\r\n\r\n"}, {"date": "17 Jul 2023", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Acted (Paris) in Oct 2020", "Interview Descriptions": "Really smooth One first interview with HR and second interview with Management. They know how to put you in a good situation and to make you less nervous. The timing was quite okay (less than 10 days in total)", "Interview Questions": "Why joining Acted? How you work in a team? Your best skills?"}, {"date": "16 Jan 2021", "title": "AME Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Acted (Paris) in Aug 2020", "Interview Descriptions": "Applied to position about 1 week after posted. Heard back from HR representative about 1 week later to be invited to first screening interview. First interview was with HR rep over Skype, audio only, about 45 min interview, interviewer was friendly and personable. We covered far more questions than I expected during the timeframe, but most were straightforward.  Asked detailed questions about experience - be able to speak to your experience as it relates to everything in the job description.  Very helpful to Look at other Acted interview reviews on glass door - all the questions mentioned were asked. \r\n\r\nA few days later I was invited to schedule a 2 hour technical test. Focused on monitoring and evaluation activities - both technical knowledge as well as applying M&E skills to a task and answering questions. There is a lot to complete in 2 hrs so time management is key and I think this was my downfall. The HR rep followed up shortly after to inform me that I did not move forward to the next stage (interview). Overall it was a positive experience.", "Interview Questions": "Something you’ve done in professional experience you are proud of?"}, {"date": "19 Dec 2020", "title": "M&E Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Acted (Paris) in Aug 2020", "Interview Descriptions": "The interview was via Skype. I was asked to turn my camera on but the interviewer keeps theirs off - they said it was broken but I knew from other reviews that it is always this way. It lasted for approximately 30 mins.", "Interview Questions": "What do you think is the role of the department for which you are applying in the activities of the NGO?   "}], [{"date": "5 Mar 2022", "title": "Chargé logistique Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Acted in Jan 2020", "Interview Descriptions": "Entretien rapide et faut être flexible sur la destination. Selon le contexte ma communication peut être bonne. \r\nAvant de partir en mission il faut idéalement avoir un call avec les équipes sur la mission.", "Interview Questions": "Qualité ? \r\nDéfaut? \r\nMise en situation "}, {"date": "2 Nov 2022", "title": "Intern Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Acted (Paris) in Jan 2020", "Interview Descriptions": "The whole process went smooth overall with good communication on Acted's part. I was notified that the interview would be conducted by Video Call and informed just a few days later of the outcome.", "Interview Questions": "If your previous colleagues were asked to describe you, what do you think they would reply ?"}, {"date": "27 Apr 2020", "title": "M&E Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Acted (Lille) in Dec 2019", "Interview Descriptions": "Après présélection : \r\n1ère étape :  entretien RH général \r\n2ème étape : test technique sur le Suivi & Evaluation\r\n3ème étape : entretien avec le futur maitre de stage, la responsable siège de Suivi & Evaluation et un officer RH senior.", "Interview Questions": "Forces et faiblesses "}, {"date": "14 Jan 2020", "title": "Stagiaire Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Acted (Paris) in Nov 2019", "Interview Descriptions": "J'ai eu un entretien téléphonique de trente minutes où l'on m'a demandé de me présenter et d'expliquer mon parcours. On m'a ensuite demandé de décrire ce que j'avais compris du poste pour lequel je postulais et de dire comment l'organisation était financée.", "Interview Questions": "Comment l'organisation est-elle financée ?"}, {"date": "22 Oct 2019", "title": "AME Officer Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Acted (Paris) in Jul 2019", "Interview Descriptions": "Weird, negative interview process, I've done it a few times. The recruitment officer (always an entry-level, sort of robot-like HQ staff member) calls and asks you to turn your video on, while they keep if off. Then they rattle off a list of pre-written questions (who are our donors? what do we do? how many times have you done an assessment? etc.) and transcribe your answers. It is unlikely they know anything about the actual position, or understand how your skillset relates. Save your technical prep for later interviews, because this is basically a checklist. If you manage to pass this troll under the bridge, then you get a technical test, and only after the technical test do you finally get to speak to people about the position who actually might know what they're talking about. \r\n\r\nActed is notorious within the sector for hiring early 20-somethings with little to no experience and throwing them into field-based positions that are over their heads (or, recruitment officer positions with no background in the humanitarian sector). It is also notorious for having a frustratingly silly hiring process. \r\n\r\nI will commend them for being very upfront about salary. The salary offered for an AME officer is like 1600 euros a month + a few hundred extra for expenses.", "Interview Questions": "Who are our donors? "}, {"date": "30 Jan 2020", "title": "Logistics Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Acted (Paris) in Jul 2019", "Interview Descriptions": "Premier entretien sur skype concernant les standards de l'entreprise et la motivation technique puis test de compétance puis entretien avec les directeurs recoupant thématiquement les deux entretiens precedants. Le dernier entretien dure environ 2 heures et les questions s'affinent progressivement pour atteindre les limites de mes compétances.", "Interview Questions": "Quels sont vos plus grandes reussites professionnelles?"}, {"date": "27 Apr 2019", "title": "Contrôle De Gestion Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Acted", "Interview Descriptions": "Un premier entretien de 20 min avec des questions Rh type par Skype. Si cet entretien est concluant, un test technique et enfin un entretien d'une heure au siège.", "Interview Questions": "Quel a été votre plus grand défi ? "}, {"date": "12 Apr 2019", "title": "Logistique Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Acted (Paris) in Apr 2019", "Interview Descriptions": "Le processus se déroule en 3 phases:\r\nEntretien RH de 20 minutes (motivations et expériences)\r\nTest Technique concernant des aspects logistiques \r\nEntretien RH + Responsable Logistique -> motivations et compétences techniques", "Interview Questions": "Expériences liées à la logistique \r\nComment est financé ACTED\r\nMise en situation face à des problèmes logistiques "}, {"date": "27 Mar 2019", "title": "Finance Officer Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Acted", "Interview Descriptions": "One way Skype interview, was a bit weird but the interviewee was lovely and the communication was easy to have. Overall it was a positive experience in my interview with ACTED.", "Interview Questions": "What interests you the most about the role and who are our donors. "}, {"date": "11 Dec 2018", "title": "Assistante Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Acted", "Interview Descriptions": "Skype avec vidéo (pour moi) mais sans vidéo pour ACTED pour un premier entretien avec une RH. Ensuite test et dernier entretien avec la personne en charge du service pour lequel vous avez postulé.", "Interview Questions": "Quelle est la réalisation dont vous êtes la plus fière ? "}], [{"date": "31 Aug 2018", "title": "Country Finance Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Acted (Paris) in Aug 2018", "Interview Descriptions": "Skype interview with junior HR staff.  Be aware that a Skype \"call\" means that it will be a one-way video call - the interviewer will be able to see you but you will not be able to see the interviewer.", "Interview Questions": "When will you be available to start?"}, {"date": "8 Jun 2018", "title": "Manager Position Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Acted (Paris)", "Interview Descriptions": "I was contacted for a position that was different from the position I applied for. I firstly had a preliminary interview with an HR Officer. It was an easy 30 minutes conversation. After a week a had a second interview with a panel (HR,  child protection manger, country representative ). The second one was a long and extensive conversation with more technical questions about the role and the challenges existing in the country.", "Interview Questions": "Tell me about yourself? \r\nWhat is your strength? \r\nWhy do you want to work for ACTED? \r\nHow your colleagues describe you?\r\nWhat is your salary expectation?"}, {"date": "5 Apr 2018", "title": "Auditeur Financier Stagiaire Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Acted (Paris) in Apr 2018", "Interview Descriptions": "La première partie de cet entretien s'est faite sur SKYPE , lors de cette première partie j'ai été questionné sur mes motivations pour intégrer l'entreprise , sur mes connaissances sur l'entreprise et le secteur des ONG. Ensuite des questions sur mon projet professionnel et personnel m'ont été demandé afin d'avoir une idée sur mon plan de carrière.", "Interview Questions": "Que connaissez vous sur Acted ? "}, {"date": "29 Nov 2021", "title": "Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Acted in Apr 2018", "Interview Descriptions": "Process rapide, clair et efficace\n1er entretien de pré-selection avec une Chargée de Recrutement d'environ 30 minutes (avec passage en anglais pendant l'entretien), puis test technique écrit, et 2nd entretien plus long, plus approfondi.", "Interview Questions": "Si je discutais avec vos managers, que diraient-ils de vous ?"}, {"date": "9 Mar 2018", "title": "Internship Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Acted (Paris) in Jan 2018", "Interview Descriptions": "I submitted a cover letter and didn't hear back after a month so got in touch with HR. They then offered me the opportunity to be interviewed for the role I applied for but in a different location.", "Interview Questions": "Q: How is ACTED funded?"}, {"date": "5 Sept 2017", "title": "Project Development Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at Acted", "Interview Descriptions": "Applied for a position in Tunisia for 12 months, was offered and interview for a position in Niger for 6 months. As I declined, saying I was not interested in working in Niger, I was told the position in Tunisia was fulfilled already. However I found, later on, the same position published on several website.", "Interview Questions": "Would you be interested in working in Niger? Tchad or Mali?"}, {"date": "31 Jan 2021", "title": "Project Development Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Acted in Sept 2017", "Interview Descriptions": "Le processus s’est déroulé en trois étapes :\r\n- Appel téléphonique (questions de base sur le profil)\r\n- Test écrit\r\n- Appel Skype avec les RH, le Chef de Mission et le référent technique du siège", "Interview Questions": "Question écrite: sur la base du scénario fourni, développez un logframe"}, {"date": "26 Jul 2017", "title": "Programmer Development Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Acted (Paris) in Jul 2017", "Interview Descriptions": "First, interviewed by HR for 30 minutes (general questions on availability, strenghts/weaknesses, accomplishments in y previous position). Second: received written test to be completed in 2hours. Third: invited for a final interview with the HR, HQ, and CO Director.", "Interview Questions": "Explain the working of the cluster system and if I believed it was useful. "}, {"date": "19 Feb 2018", "title": "Intern Logistics Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Acted (Paris) in Feb 2017", "Interview Descriptions": "Un entretien RH, un test technique (word, excel), un dernier entretien avec directrice/directeur pays, une personne RH et un responsable département. Tout le process peut se faire uniquement via skype et la mission peut être changée après même cet entretien", "Interview Questions": "Pourquoi la logistique? Pourquoi cette mission?"}, {"date": "6 Dec 2016", "title": "Stagiaire Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at Acted", "Interview Descriptions": "Un premier entretien RH de routine, un test technique avec documents à remplir selon l'activité du département, un dernier entretien avec un RH et un manager. Entretiens assez aisés. Se renseigner sur les spécificités de la fonction recherchée dans l'humanitaire et sur certaines des activités de l'ONG. Les tests techniques sont en rapport avec le programme de licence/master qui correspond à l'intitulé du stage.", "Interview Questions": "Quel est selon vous le rôle du département pour lequel vous postulez dans les activités de l'ONG ?"}], [{"date": "14 Jan 2017", "title": "Project Development Officer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Acted (Paris) in Oct 2016", "Interview Descriptions": "I had the first HR interview. The interview looked as a survey. My interviewer asked me questions and noted my short answers in her computer. She expected standard answers, she was not open to alternatives of the experiences ACTED expect.", "Interview Questions": "What my previous supervisor would tell about me?"}, {"date": "9 Jan 2017", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Acted (Paris) in Aug 2016", "Interview Descriptions": "This was a nice and easy process with 3 interviews.\r\nFirst a skype interview of 15 min followed by an interview with head of HR and then interview with team on the field", "Interview Questions": "Are you ready to go in any country?"}, {"date": "22 Jun 2016", "title": "Program Related Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Acted (Paris)", "Interview Descriptions": "The interview process was horrible. They play with your emotions and make you think you are doing horribly. When you finally stand up for yourself and tell them that they are acting unprofessionally they tell you that they are just testing you to see what you will do. This is not a great first impression of the company but it is an accurate one.", "Interview Questions": "It was less of a question and more of a statement. They told me that I was too confident during my interview. I believe this was because I was a woman and I was being interviewed by all men."}, {"date": "25 Mar 2016", "title": "Chargé de suivi et évaluation Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Acted in Mar 2016", "Interview Descriptions": "Premier entretien de sélection via skype. Durée 30min. Les questions posées sont générales, et ne sont pas techniques. La deuxième phase corresponds à un test technique demandé aux candidats (étude de cas pendant 2h). La troisième étape est un entretien avec les responsables opérationnels et des ressources humaines d'ACTED.", "Interview Questions": "Que dirait votre directeur à votre sujet si on l'appelait ?"}, {"date": "31 Mar 2016", "title": "Project Management Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Acted", "Interview Descriptions": "I sent my CV and was contacted within a week by email and asked to Interview on Skype. Quite hard questions were asked, I would recommend reading up on humanitarian work in depth first.", "Interview Questions": "Give an example of when you have used the project management cycle"}, {"date": "5 Sept 2019", "title": "Project Development Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Acted (Paris) in Mar 2015", "Interview Descriptions": "Entretien téléphonique, test, entretien physique à Paris et entretien skype avec le terrain. Ce processus vise à évaluer vos connaissances sur le secteur humanitaire (processus de reporting et PD, architecture, technique ...) ainsi que vos compétences de rédaction et d'analyse.", "Interview Questions": "Comment réagissez-vous à une situation de conflit ou de tensions."}, {"date": "28 Jun 2016", "title": "Co facilitateur Cluster Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at Acted (Paris) in Jan 2015", "Interview Descriptions": "4 ENTRETIENS : 2 avec le siège, 1 avec le terrain, 1 avec l'agence lead (Cluster).\r\n\r\nLes entretiens sont très ouverts. Les RH cherchent vraiment à connaitre le candidat afin de lui proposer une mission adaptée. Les entretiens de compétences sont assez simples mais à préparer pour le debriefing. Différentes propositions de postes peuvent être proposés par le RH. Toujours justifier le choix.", "Interview Questions": "iQuelles sont vos occupations hors emploi ? Quelles sont vos valeurs ? Pourquoi voulez vous travailler pour ACTED ? Que pensez vous des agences UN ?"}, {"date": "18 Oct 2017", "title": "Technical Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Acted (Paris) in Jan 2013", "Interview Descriptions": "First I had an interview via Skype with HR staff; This was followed up by an interview at HQ with HR and program staff. The time between application and interview was short - about 2 weeks.", "Interview Questions": "None of the questions was truly unexpected. They were mostly standard interview questions"}, {"date": "25 Oct 2015", "title": "FSL Program Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Acted (Paris) in May 2012", "Interview Descriptions": "I applied by email and they called me a few days later for an interview with a recriter based in Paris. Then I had to undergo another interview with the Regional Coordinator who at the time was acting as country director for the country I was supposed to go. The only problem was that I applied for Darfur and in the end I ended up in South Sudan, but this was not the organization fault as it was due to problems with the visa, a quite common  problem in Sudan.", "Interview Questions": "What is your expereince in livelihood?"}]]