[[{"date": "5 Apr 2023", "title": "Clinical Systems Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Lakeland Regional Health (FL) (Lakeland, FL)", "Interview Descriptions": "Easy-going nice people, who focus on your willingness to work. they offer more help and training. great team. good management. they are looking to fill their positions with good team members.", "Interview Questions": "Mostly work history and what you can do."}, {"date": "22 Feb 2023", "title": "Registered Nurse Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1+ week. I interviewed at Lakeland Regional Health (FL) (Lakeland, FL) in Jan 2023", "Interview Descriptions": "Good interview. Did not take the job. Many red flags, as it is right now with any Registered Nurse jobs in this country. Felt like I was god cause I got an interview and offer. Should not be that way.", "Interview Questions": "Why I want to work here."}, {"date": "17 Apr 2023", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Lakeland Regional Health (FL) (Lakeland, FL) in Jan 2023", "Interview Descriptions": "Star format, many levels - overall great experience - would recommend the process to anyone interested. This seems to be a great company and great experience. Interviews with managers were relaxed and helpful", "Interview Questions": "Prior experience in situations and general information"}, {"date": "12 Apr 2022", "title": "New Graduate RN Nurse Residency Program Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Lakeland Regional Health (FL)", "Interview Descriptions": "Everyone gets the same questions to make it equal.  It's usually panel-style with managers from various floors. Quick and easy process and they were prompt on sending out job offers.", "Interview Questions": "What makes you an asset to LRH?"}, {"date": "20 Jan 2023", "title": "Clinical Research Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 1+ week. I interviewed at Lakeland Regional Health (FL) (Waltham, MA) in Jan 2022", "Interview Descriptions": "Absolutely ridiculous process. Didn’t even have a live person interview me. It was a one way interview where they asked so many questions. Took me about 2 hours to complete just for them to not have the common decency of even reaching out after.  They ghosted me after the interview and when I’M THE OBE THAT REACHED OUT, that’s when they had the decency to tell me they don’t want to move forward. BS! They wasted so much if my time by letting me gather references  and call people to make them take surveys, knowing they weren’t going to even attempt to reach out to me after interviewing. Absurd. Bad communication, ridiculous interviewing style, and racist HR.", "Interview Questions": "How are your organizational skills"}, {"date": "16 Dec 2021", "title": "Clinical Systems Analyst II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Lakeland Regional Health (FL)", "Interview Descriptions": "HR screening, VP interview,  Director interview, Hiring manager and panel interview. All were great. I worked will all the people who interviewed me. Some not directly  but they were all very friendly and welcoming when I joined the team.", "Interview Questions": "Technical, logical, EHR/EMR, Practice Management Systems related questions, and some peripheral applications integrations."}, {"date": "7 Oct 2021", "title": "Data Architect Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Lakeland Regional Health (FL)", "Interview Descriptions": "Easy first interview with Director after the recruiter mtg. Second  interview with  Vice president. Third written test/tech interview was a bit challenging. Mostly on ETL processes with different scenarios.  Vice President and Director. were extremely nice and welcoming people.", "Interview Questions": "Why do think you would be a good fit for this role?"}, {"date": "16 Sept 2021", "title": "Tech Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Lakeland Regional Health (FL)", "Interview Descriptions": "Horrible,  poor communication by interviewer, waiting game, very unprofessional. Would not recommend to anyone wishing to provide for their family. Highly recommend looking elsewhere for emplyment where you will be appreciated", "Interview Questions": "When can you start your employment "}, {"date": "20 Sept 2021", "title": "Patient Access Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Lakeland Regional Health (FL) (Lakeland, FL) in Aug 2021", "Interview Descriptions": "The interview process was long and drawn out for me.  I submitted my application, and with in a couple of days got an email to schedule an interview. I scheduled an over the phone interview with the recruiter, and the recruiter never called me; an hour or so later, I got an email stating that she was out sick, asking to reschedule. I had my over the phone interview with the recruiter whom which was very nice. She really wanted to get me in based on my experience. She said that she was going to push my application to the hiring manager. A week to two weeks later I finally get a phone call later to schedule my second interview, and by that time, it sounded like they had already made their decision to hire me because the second interview was more or less questions and answers and a great relaxed conversation; later that day the recruiter called to finalize information with me and have me start the background check so that a offer could be made to me so that I could official start. Out of all the jobs I've had, this has been by far one of the fastest ones! They've moved quick!", "Interview Questions": "Tell me a time that you had a really difficult patient or guest, and how did you deal with it? What was the outcome? "}, {"date": "3 Jun 2021", "title": "Nurse Residency Program Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Lakeland Regional Health (FL) in Apr 2021", "Interview Descriptions": "A little unnerving but good. Wish I got offered a spot though. I don’t know why they make it so hard to get on here. I really want to work here", "Interview Questions": "Mindfulness service work ethic and perseverance "}], [{"date": "20 Mar 2023", "title": "Systems Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Lakeland Regional Health (FL) (Tampa, FL) in Oct 2020", "Interview Descriptions": "Phone screening, followed by phone interview with hiring manager. Interviewed with director of information systems and VP at the time, then team interview. Interview process took 4 weeks before an offer was presented.", "Interview Questions": "Electronic Health Records and clinical applications related questions."}, {"date": "8 Aug 2020", "title": "Nurse Residency Program Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Lakeland Regional Health (FL) (Lakeland, FL) in Aug 2020", "Interview Descriptions": "It was pretty easy, was asked about 5 questions, 3 people in the panel and it was via Skype since this is during the pandemic. Very nice ladies that interviewed me!", "Interview Questions": "Tell me about a time you wow’ed a patient "}, {"date": "7 Mar 2023", "title": "Patient Access Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Lakeland Regional Health (FL) in Feb 2020", "Interview Descriptions": "Pretty straight forward interview process. Basic behavioral questions and opportunity to ask questions about the role. Talked about the team, scheduling, starting pay and timeline to start the role. Do not worry about the interview, if you've worked in the role before, you'll be fine.", "Interview Questions": "Tell me about a time you had to work with a difficult patient?"}, {"date": "3 Jan 2020", "title": "RN Residency Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Lakeland Regional Health (FL) (Lakeland, FL)", "Interview Descriptions": "After applying it was fairly quick hearing back. The day of the interview they broke the groups up to morning and afternoon. I was in the morning which was from 8am-12pm. It was a panel of about 2-3 people interviewing and there was about 30 people interviewing at a time in different rooms. After the interview you were given a tour of the hospital and then they answered questions and had a couple nurses present who were previously in the new graduate residency.", "Interview Questions": "Tell me a time when you wow'ed a patient"}, {"date": "23 Dec 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Lakeland Regional Health (FL) (Lakeland, FL) in Sept 2019", "Interview Descriptions": "I got a call from the HR recruiter asking me about the positions I was interested in and was then scheduled to interview with the manager. I went in person (pre covid) to interview with the manager of the unit. It was very informal, and relaxed. I described my experience and strengths. I could ask questions and the interview took less than 1 hour. After I got home, i received a call with an offer within 2 hours.", "Interview Questions": "Why do you want to work here"}, {"date": "9 Nov 2018", "title": "PTA Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at Lakeland Regional Health (FL) in Nov 2018", "Interview Descriptions": "I was contacted via email by the HR department stating they would like to set up a telephone interview after they saw my resume on Indeed. I went through the online system and scheduled my telephone interview. At my scheduled interview time, my interviewer never called me. I called the HR number after 30 minutes had passed, then was advised my interviewer wasn't even in the office. Another HR employee took my name and number and said my interviewer would call me. I never received a call, email, or an apology from her or any of the other HR staff. I am very disappointed in the lack of professionalism their HR department shows.", "Interview Questions": "N/A"}, {"date": "15 Feb 2018", "title": "Medical Laboratory Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Lakeland Regional Health (FL)", "Interview Descriptions": "First you will received a call from the recruiter and he/she will send the information to the hiring manager. Then you'll received a call from the Administration and will have another interview with the Director, Manager and a Supervisor. Few days later, the recruiter contact you again offering the position.", "Interview Questions": "No difficult questions."}, {"date": "22 Jul 2018", "title": "Dietary Aide Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Lakeland Regional Health (FL) (Lakeland, FL) in Dec 2017", "Interview Descriptions": "The interview was brief and informative. I did not have to wait long. It was not nerve-wrecking, and the interviewee answered all of my questions. The questions were not hard at all.", "Interview Questions": "Tell me a bit about yourself, why should we hire you, where do you plan to be in 5-10 years?"}], [{"date": "12 Jul 2016", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Lakeland Regional Health (FL) (New York, NY)", "Interview Descriptions": "easy, efficient, but takes a while to get an offer.  would like to see quicker response times to applications.  need better signage in the hospital to be able to find human resources", "Interview Questions": "strengths and weaknesses"}, {"date": "27 Mar 2016", "title": "Lead Security Officer Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 5 days. I interviewed at Lakeland Regional Health (FL) (Lakeland, FL) in Mar 2016", "Interview Descriptions": "I applied for a management level position and they lied to me and said it is only an entry level position during the interview and they wanted to pay a lot less then is acceptable to me. So beware be sure you know what job they are interviewing you for.", "Interview Questions": "He asked a bunch of hard questions and expected me to have the text book answers memorized. They also asked you when you went beyond or above and your job duties. They also asked for a time you had a problem that there wasn't a set rules for and how did you resolve it."}, {"date": "19 Mar 2017", "title": "Registered Nurse Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Lakeland Regional Health (FL) (Lakeland, FL) in Jan 2016", "Interview Descriptions": "Do not seem to be impressed with nursing talent. Are more impressed to recruit nurses with zero experience. Ask a lot of \"what if questions\" and continue to make scenarios absurd enough that the original question is forgotten.", "Interview Questions": "How would I handle an irate surgeon."}, {"date": "9 Oct 2015", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Lakeland Regional Health (FL) (Lakeland, FL) in Jul 2015", "Interview Descriptions": "Got a call from recruiter who then setup a screening call with hiring manager. After screening call, I was asked to appear for a face-to-face interview. I got an offer second day.", "Interview Questions": "Mostly behavioral question and questions about my experience and management style."}, {"date": "26 Jul 2019", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 2 weeks. I interviewed at Lakeland Regional Health (FL) (Lakeland, FL) in Jun 2015", "Interview Descriptions": "You will interview with HR first and they ask typical questions. You will then interview with the director of the department that you will be under. There were no panel interviews.", "Interview Questions": "Which area of care is most preferred and which area of care is your least preferred?"}, {"date": "3 Sept 2016", "title": "Environmental Services Aid Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at Lakeland Regional Health (FL) (Lakeland, FL) in Dec 2014", "Interview Descriptions": "I had 3 interviews two face to face interviews and one over the phone inerview. My first interview was in person at a job fair that the hospital was having for Environmental Service department. My next interview was over the phone with one of the supervisors, my last and final interview was in person at the main office where i did all my pre-hire paper work and then with-in the next week I did my drug screen.", "Interview Questions": "What qualities can you bring to this company?"}, {"date": "21 Sept 2014", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Lakeland Regional Health (FL) in Aug 2014", "Interview Descriptions": "I am a new grad RN who is also new to the area. I applied online and was contacted the next week. First, I had an interview with the floor manager and team leader. I was called back for an interview with HR the following week and was offered the position.", "Interview Questions": "The most difficult question for me as a new grad was, \"tell me about a time when you brought a new idea to a supervisor and describe how it was implemented.\""}, {"date": "27 Aug 2014", "title": "Administrative Secretary Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Lakeland Regional Health (FL) (Lakeland, FL) in Jul 2014", "Interview Descriptions": "I was contacted a few days after the initial interview by the recruiter for LRMC.  On the second interview I was interviewed at the clinic by the manager, Maggie Gordon and James Sturgill,  They were both very pleasant.  I was one of 5 candidates interviewing for the position.  The job duties were discussed with me.  I was shown around the clinic which is very nice and the office staff was very friendly and seemed very happy to be working there.  I was told they would make a decision by the end of the week and let me know.\r\n\r\nAfter 4 weeks of hearing nothing, I emailed Mr. Sturgill to get a status.  He responded promptly that same day stating due to managerial changes the position was put on hold.  I really wanted this job as it would have been perfect for me.  I just wish they would have told all of the candidates as soon as they knew the position was put on hold.", "Interview Questions": "All questions asked by the recruiter were all scenario situations and how I would act/reaction to a situation or a solution to a problem.  What are my strong and weak points, etc."}, {"date": "30 Oct 2015", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Lakeland Regional Health (FL) (Lakeland, FL) in May 2014", "Interview Descriptions": "It took them a while to get back to me and scheduling was a bit rough -- they put all of this on one person and it was not in her job description. They were pushing her schedule to the limits already, so it was understandable. Really nice and responsive people - not interested in drilling you.", "Interview Questions": "Why do you want to go into the healthcare industry?"}, {"date": "12 Aug 2015", "title": "Health Unit Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Lakeland Regional Health (FL) (Lakeland, FL) in Apr 2014", "Interview Descriptions": "Many interviews to go through with HR, then interviews with the department managers. It is a lengthy process. Once the HR interviews were finished they would schedule an interview with the department. The department interview usually had 3 to 4 people in the interview asking questions.", "Interview Questions": "Where would you want to be in 5 years?"}], [{"date": "26 Jan 2014", "title": "Reimbursement Specialist Interview", "results": "Declined Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Lakeland Regional Health (FL)", "Interview Descriptions": "Went to school and great interview", "Interview Questions": "Management of today"}, {"date": "27 Dec 2013", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Lakeland Regional Health (FL) (Lakeland, FL) in Dec 2013", "Interview Descriptions": "HR staff nice and accommodating. Felt like they give false hope. Willing to give salary and benefits information up front, so no questions about what will be paid and expected.", "Interview Questions": "Was asked typical questions like \"explain a time when you....\"; \"give an example of a time when....\"; \"why do you want to be a nurse....\" \"what were your roles in your previous jobs\", etc."}, {"date": "2 Nov 2013", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 3 weeks. I interviewed at Lakeland Regional Health (FL) (Lakeland, FL)", "Interview Descriptions": "I first was contacted by HR to interview with the Nursing Recruiter in that office. That interview was considered a behavioral interview where they asked me questions, such as what would you in this instance? etc. Next after that interview was complete. I was contacted by HR the following week and was asked if I would like to interview in a particular dept. I accepted and then interviewed with the nurse manager of the floor. I was asked similar questions to the initial interview.", "Interview Questions": "Tell me a time when someone made a decision that you did not agree with and what did you do about it?"}, {"date": "11 May 2014", "title": "Pharmacy Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 3 weeks. I interviewed at Lakeland Regional Health (FL) (Lakeland, FL) in Nov 2013", "Interview Descriptions": "Hired from an externship. Interviewed by Human Resources only not the department I work for. As far as I am aware this is not the standard procedure. Usually you are interviewed by HR and the department.", "Interview Questions": "Standard, every interview basic questions about previous experiences and how you would or did handle the situation."}, {"date": "3 Feb 2012", "title": "Recruiter Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Lakeland Regional Health (FL) (Lakeland, FL) in Jun 2011", "Interview Descriptions": "I received an email in regards to the company and asked to complete an assesment. One completed, I was asked to provide references. I have a one on one interview with the hiring manager and then two others were brought in. After a week, I was called in for a 2nd interview with the Director. Another week passed and I was called by the hiring manager and told that I was not given the job.", "Interview Questions": "How would you deal with ambiguity in the workplace? "}, {"date": "29 May 2015", "title": "Quality Control Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at Lakeland Regional Health (FL) (Saint Joseph, MI) in Feb 2011", "Interview Descriptions": "Very specific on issues on process and situational cases.  Asked on relationships with co-workers, clients and superiors.  Touched on previous experiences at previous jobs and my desire/motivation to get the job.", "Interview Questions": "What would you do if encountered with a difficult co-worker?"}, {"date": "22 Aug 2012", "title": "Patient Care Assistant - Certified Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Lakeland Regional Health (FL) (Lakeland, FL) in Mar 2009", "Interview Descriptions": "This part was really good, an extensive interview, caring and talking about all aspects of the job and what they expect out of you.  They took me on a walk through the unit, and then talked to me about start date, and the training, and what was expected out of me", "Interview Questions": "What was my most difficult situation in the past during a customer service experience."}]]