[[{"date": "10 Jul 2023", "title": "Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of Idaho", "Interview Descriptions": "Average- a phone call first and then, in person interview in front of a panel of interviewers. During phone call, more general questions and during interview more casual questions of getting to know", "Interview Questions": "Why do you like teaching?"}, {"date": "10 Nov 2022", "title": "Payroll Specialist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Idaho", "Interview Descriptions": "Moderately long interview, with two pages worth of questions. The questions were often multi part questions. It was a panel interview, with four people interviewing me. They took turns asking questions.", "Interview Questions": "Describe what these forms are, and your experience working with them: W2, 941, W4."}, {"date": "5 Oct 2022", "title": "Student Conduct Administrator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at University of Idaho (Moscow, ID)", "Interview Descriptions": "Be prepared for several committee interviews, a presentation, perhaps a one-on-one with a second or third-level supervisor/final hiring authority, and ultimately a full day gauntlet if you make it past a first interview and get to on campus!", "Interview Questions": "The questions were not memorable and similar to how your experience fits with the role, what do you know about a specific subject, your approach to restorative justice, etc."}, {"date": "18 Mar 2022", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at University of Idaho", "Interview Descriptions": "The people who phone interviewed me were very kind and friendly. Asked great questions that were challenging but not aggressive. They explained the job well and answered all of my questions adequately", "Interview Questions": "How do you react to a situation involving conflict? Example?\r\n"}, {"date": "12 Oct 2021", "title": "Career Services Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of Idaho", "Interview Descriptions": "First round phone interview was about 10 questions and was conducted by a panel, second round on campus with more depth including presentation, q + a, panel interview, and one on one interview with supervisor", "Interview Questions": "Tell me a little bit about yourelf?"}, {"date": "16 May 2023", "title": "Career Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Idaho in Aug 2021", "Interview Descriptions": "The interviews across the University of Idaho tend to be very formal. I had close to 10 questions in the initial interview and a few minutes at the end to ask questions of the committee. The first interview was also on Zoom with 5 people, not including myself. The questions seemed very fair and allowed me to give examples of my job-related competencies.", "Interview Questions": "Tell us about yourself and what motivated you to apply to this position."}, {"date": "11 Feb 2021", "title": "Facility Attendant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at University of Idaho", "Interview Descriptions": "This is a group interview with 3-5 pro staff and student staff. They alternate asking a list of questions. Pretty straight forward of a process overall. Even though it is a student position, dress nice, it's the little things that make a difference.", "Interview Questions": "If a patron wanted to come in without their vandal card what would you do?  "}, {"date": "1 Jan 2019", "title": "Director of Career Services Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at University of Idaho", "Interview Descriptions": "The interview process was a pretty typical state application process: apply online with resume and cover letter followed by a phone screen interview, then an in person. The in person interview was multiple interviews across the same day. My favorite part was meeting engaged students.", "Interview Questions": "What experience do you have building or maintaining relationships with large companies?"}, {"date": "16 Oct 2020", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at University of Idaho (Moscow, ID) in Oct 2018", "Interview Descriptions": "Interview was a two step process. First was a phone call and the second was on site. The process was fairly similar to other institutions. I met with a number of faculty, staff, graduate students, and undergraduate students that I would be interacting with in the position.", "Interview Questions": "Reason for wanting to get a PhD."}, {"date": "7 Nov 2019", "title": "Postdoctoral Fellow Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at University of Idaho (Moscow, ID) in Jul 2018", "Interview Descriptions": "The interview happened through a zoom call from the employer. They asked me questions related to my research and few behavioral and competency-based questions to be comfortable in the group.", "Interview Questions": "Tell me what research projects you handled?\r\nWhat are your research interests and what project would you like to work on?\r\nWould you like to contribute towards teaching and grant writing?\r\n\r\n"}], [{"date": "5 Jun 2018", "title": "Lecturer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Idaho", "Interview Descriptions": "I had a Skype interview with a panel of professors and a director. Standard questions about teaching practices. I applied online and was contacted via email to set up a Skype interview, Fairly easy process", "Interview Questions": "tell us about yourself "}, {"date": "20 Sept 2018", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of Idaho (Moscow, ID) in Apr 2018", "Interview Descriptions": "Very simple, First step you got admission \r\n2nd: any of faculty professor who wants to hire you will contact you personally. \r\nIt may be an interview on email, skype or phone call.", "Interview Questions": "About your research interest and future direction"}, {"date": "6 Nov 2017", "title": "Building Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of Idaho", "Interview Descriptions": "It was a somewhat lengthy application process, but the overall interview experience was fairly pleasant. There were quite a few documents required in order to be interviewed and hired, including a letter of motivation and a background check. Friendly staff and supervisors.", "Interview Questions": "Why do you want to work here and how do you handle last minute problems with no superviso around?"}, {"date": "6 Sept 2017", "title": "Maintenance Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at University of Idaho", "Interview Descriptions": "The interview was very casual as I anticipated.  Interview committee consisted of two persons.  Personality and experiential questions were asked.  Employer contacted me within a couple of days from the interview date.", "Interview Questions": "Tell us about a time you had to work with a person you didn't get along with? How did you resolve this conflict?"}, {"date": "21 Sept 2017", "title": "Human Resources Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Idaho (Moscow, ID) in Jul 2017", "Interview Descriptions": "Applied online and received phone call to schedule an interview the next day.  Arrived for interview with 3 employees.  Interview questions were to be expected.  2 months later, zero contact.  The job has not been closed, I have not been declined, requests for contact have not been returned.", "Interview Questions": "Do you support the university or the employees?"}, {"date": "22 May 2019", "title": "Assistant Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at University of Idaho in Jul 2017", "Interview Descriptions": "30-minute phone interview with the search committee. Depending on the level of job, an on-site full day interview will follow. Standard interview process and questions. They were kind and welcoming.", "Interview Questions": "What are my top values?"}, {"date": "1 Aug 2016", "title": "Facilities Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Idaho (Moscow, ID) in Jun 2016", "Interview Descriptions": "I was questioned by three members of the facilities department roughly 5 minutes prior to my requested interview time (I had shown up early so this was a pleasant surprise).  They were professional and approachable. They went with another applicant but informed me a few days after the interview that I had not been selected which I greatly appreciated.", "Interview Questions": "What is your biggest weakness?"}, {"date": "10 Mar 2018", "title": "Writing Center Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at University of Idaho (Moscow, ID) in May 2016", "Interview Descriptions": "After greetings, we talked a little bit about why I wanted to intern and also job details.  I am then given a sample student's paper and had to perform a mock tutoring session on how I would help this student improve his paper.", "Interview Questions": "N/A"}, {"date": "20 May 2016", "title": "Research Aide Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at University of Idaho in Mar 2016", "Interview Descriptions": "The interview process was easy. The committee was kind and thorough. Mainly they just wanted to know about my research experience. They told me they were interviewing only 3 other candidates. Unfortunately, it took a very long time for them to fill the position. I interviewed the beginning of March and did not hear back until mid-May.", "Interview Questions": "Why do you think you are qualified for this position?"}, {"date": "27 Sept 2015", "title": "Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at University of Idaho (Moscow, ID)", "Interview Descriptions": "45 minute telephone interview; then daylong campus visit with teaching and research presentations, and individual 30 minute meetings with individual faculty, and a campus tour; start and end day with the Dean of the college. Pretty typical campus visit process. They are looking for \"fit\".", "Interview Questions": "Tell us what interests you about this position and why you think that you would be a good fit?"}], [{"date": "24 Sept 2015", "title": "Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of Idaho (Moscow, ID)", "Interview Descriptions": "Phone interview and then in-person Skype for second round. Panel interview with several staff members.  A lot of behavioral questions (\"tell me about a time when...\") were asked, and they covered the types of things called for in the written job description.  It is helpful to be sure to read the job posting closely and address all of the qualifications in your interview answers.", "Interview Questions": "Can you give an example of a time your received constructive criticism or feedback?  How did you handle it?"}, {"date": "20 Jul 2015", "title": "Temporary Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at University of Idaho (Moscow, ID) in Mar 2015", "Interview Descriptions": "it was face-to-face interview. it was my first time to face interview in USA. It was some management types questions and related to my fields. I tried to give all answers of the questions which was asking by Interviewer. And in first attempt I got the offer to work in reputed University.", "Interview Questions": "All questions are related to my fields."}, {"date": "26 May 2017", "title": "Academic Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of Idaho (Moscow, ID) in Jan 2015", "Interview Descriptions": "Panel of interviewers sits and asks you questions as a group. They just went through the list of questions and it was informal and comfortable. I think there were 4 or 5 people on the panel.", "Interview Questions": "What makes you uniquely suited to this position?"}, {"date": "28 Aug 2015", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 days. I interviewed at University of Idaho (Moscow, ID) in Mar 2014", "Interview Descriptions": "Short, sweet and to the point interview. I was quickly hired after the interview. Met with the employer one on one shortly after approaching them about an internship through a different program. While I didn't receive the internship, my employer quickly offered me a job after asking about what lab experience I had.", "Interview Questions": "What is your laboratory experience?"}, {"date": "19 Dec 2017", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 5 days. I interviewed at University of Idaho (Moscow, ID) in Oct 2013", "Interview Descriptions": "Simple interview on why I wanted the position.  Found the internship by a friend's recommendation and then followed up with the department that was hiring.  After applying the interview process took less then a week.", "Interview Questions": "What do you look to gain from the internship?"}, {"date": "16 Aug 2015", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at University of Idaho (Moscow, ID) in Aug 2013", "Interview Descriptions": "There was no real interview I talked with a professor that I was interested working with during my M.S. program and they had funding for a project that interested me so I applied to the College of Graduate Studies. I do believe that my experience was different then most peoples experience in that there are usually more people interested in a particular project.", "Interview Questions": "N/A"}, {"date": "11 Aug 2017", "title": "Sign Language Interpreter Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at University of Idaho (Moscow, ID) in Aug 2013", "Interview Descriptions": "Written application processed and interview with the Director of Student services with drug test and background checked after the intital interview and selected for the position and travel pay negotiated.", "Interview Questions": "Abt my experiences"}, {"date": "30 Aug 2015", "title": "Assistant Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at University of Idaho (Moscow, ID) in Feb 2012", "Interview Descriptions": "Apply online and got an interview. I got a call from the dept chair to arrange for the interview. The process was normal for an academic job. The interview went well. I got the job.", "Interview Questions": "What course would you like to teach? Describe your research"}, {"date": "6 May 2016", "title": "Graduate Student Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 months. I interviewed at University of Idaho (Moscow, ID) in Feb 2012", "Interview Descriptions": "I emailed the hiring professor and received a reply within a week. A phone/skype interview last 1 hour and it was very much a two-way interview. After sounding like a good fit, I was flown to Moscow, Idaho for an in-person interview, which lasted a day. I was given an offer withing a week of my visit.", "Interview Questions": "Common prospective graduate student questions: Why are you apply for graduate school? What are your career goals? Why do I want to work with the hiring professor?"}, {"date": "17 Nov 2015", "title": "Post Doctoral Researcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Idaho (Boise, ID) in Jan 2012", "Interview Descriptions": "easy, simple questions; prepare using basic interview guidelines; discuss the minimum requirements or “basic qualifications” those qualifications or criteria which was established in advance and advertised to potential applicants; main focus was made on preferred qualifications and skills and experience preferred in addition to basic qualifications, that was used to narrow down the pool of applicants. preferred skills, knowledge, abilities and competencies can describe a more proficient level at which the essential functions can be perfomed", "Interview Questions": "How do you work under pressure? What is your plan for the next 5 years?\r\neasy, simple questions; prepare using basic interview guidelines; discuss the minimum requirements or “basic qualifications” those qualifications or criteria which was established in advance and advertised to potential applicants; main focus was made on preferred qualifications and skills and experience preferred in addition to basic qualifications, that was used to narrow down the pool of applicants. preferred skills, knowledge, abilities and competencies can describe a more proficient level at which the essential functions can be perfomed"}], [{"date": "18 Jun 2015", "title": "Granduate Student Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at University of Idaho (Moscow, ID) in Mar 2011", "Interview Descriptions": "The interview was a brief meeting with the future principal investigator. This meeting lasted approximately half an hour. Previous experience as well as the current laboratory projects were discussed. Overall, the objective was to see if I would fit in as a new graduate student.", "Interview Questions": "Why are you interested in this particular research?"}, {"date": "18 Jun 2013", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 3 days. I interviewed at University of Idaho (Moscow, ID) in May 2009", "Interview Descriptions": "Interviewing as a Teaching Assistant was very straight forward.  If you passed the course with a favorable grade and reputation with the staff, you are eligible to become a teaching assistant in a future semester.  The professor and department submitted all necessary paperwork leaving you to focus on your responsibilities in the classroom.", "Interview Questions": "As mentioned above, My grade and professor relationship in the course was my only step to gaining the position.  I didn't have to answer questions."}]]