[[{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Room to grow, learn, and develop...", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "1 Nov 2022", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Ongoing professional development, strong work culture, and appreciation of work life balance. Good benefits and lots of room for promotions if you want to move up.", "cons": "The proximity to trauma can be draining sometimes, but also makes the work very purposeful."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": 3, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "A real career", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "5 Sept 2021", "job_title": "Victim Advocate", "duration": "N/A", "pros": "I have never experienced so much openness from a company before. When I started, I went through a ton of training unlike ever before. I met with everyone in the agency, even the CEO for two hours to learn about how the agency works. Everyone was so nice and still is. I've been here almost a year and still love it. My boss is always making sure I have what I need and my input is valued. I don't understand why there are so many negative posts on here. They care about helping victims, about us, and are very supportive.", "cons": "We have to work a lot of on call shifts. More now because we are still hiring advocates. BUT supervisors and even the CEO takes shifts to help out which is really nice."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": "N/A", "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Insincere", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "21 Feb 2022", "job_title": "Grant Writer", "duration": "N/A", "pros": "I can't think of any.", "cons": "Unless you \"fit\" with the Executive Director you will not last."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 0, "Diversity and Inclusion": 0, "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Could be a great place to work with a different CEO", "rating": "2.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "5 Jan 2021", "job_title": "Administrative in Akron, OH", "duration": "N/A", "pros": "Paid lunch and holidays. Some nice coworkers. The work is emotionally rewarding.", "cons": "I wish I had listened to the warnings. I agree with the opinions of other reviewers here, that the CEO has personality issues. She's very controlling. Authoritarian, condescending, and micromanaging. Awkward interpersonal and communication skills.\r\n\r\nBeing a CEO isn't just about technical abilities, it's about who you are as a person. And she doesn't appear to be right for a management job in social services. The comment another reviewer made about Leanne having stated that she considered being a prison warden makes so much sense. A job in corrections or the military would be more suited to her.\r\n \r\nLike other reviewers said she doesn't take staff concerns seriously. She seems to think that the way to solve office culture problems is to fire people who complain about the problem. This becomes more toxic in the context of the fact that she has appointed _herself_ as the hr dept. If you're thinking that having the CEO be the hr dept is not standard business practice, you're right. That should never happen. If the boss is hr, it makes it difficult for employees to get help when the boss is the problem.\r\n \r\nIt's amazing that the board accepts her explanations of why there has consistently been _so much_ turnover during her time in charge. It's not just advocate positions that are revolving doors, it's across the whole organization. Few people stay at vap long-term and I think that's more because of Leanne than the nature of the work. As you can see by her responses here, her main thing isn't to improve, it's to justify herself. As others mentioned, a boss encouraging employees to post positive reviews to offset the complaints is problematic.\r\n\r\nVictim services are an important community resource but if you're considering working for this agency, be prepared to deal with an organizational culture that's not good."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "N/A", "Work/Life Balance": 1, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Important service to the community but lacking the right leadership", "rating": "2.0", "reviewer_affiliation": "Former Employee", "job_date": "30 Mar 2020", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "VAP provides very important services and information to the community, assisting people through some of the most difficult times in life.  The work is very meaningful.", "cons": "The work, while meaningful, can be incredibly difficult on your mind and body.  Sometimes the best self care is not enough.  To make the situation more difficult, the top management can be oppressive and very dismissive of constructive feedback.  I rarely felt valued as an employee, and often was required to do many extra unpaid hours.  The executive director once told me she wanted to be a prison warden, so that's \"probably my leadership style.\"  That is unacceptable for a social service organization with high secondary trauma. Although the E.D. is highly skilled in many areas, being a servant leader with compassion is not her strong suit.  I did not feel empowered, but rather micromanaged, undervalued, and taken advantage of.  I have heard the same from other current and former employees."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Executive Director Doesn't Care To Fix Agency Issues", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "18 Jun 2020", "job_title": "Anonymous Employee in Akron, OH", "duration": "N/A", "pros": "It is a full-time job-I was grateful that VAP hired me and that I was able to gain experiences that have really helped me when it came time to move on to better things.", "cons": "Plenty of staff members have voiced their frustrations and concerns to supervisors, directors and the CEO and for some reason the issues continue to go unresolved. It was brought to the attention of the CEO that numerous interns were uncomfortable a certain member of the administration. It was brought to the attention of the CEO that a member of administration was engaging with allied professionals in an inappropriate manner, it was brought to the attention of the CEO that full-time staff were having issues/felt uncomfortable with specific administration. Instead of the CEO looking into this, only a few short days later that member of admin was promoted to a position that would oversee other staff. You can also tell the CEO wants to pretend there are no issues at this agency by the way she responds to every bad complaint on this site. Instead of taking responsibility and looking into things, she tries to give rebuttals as to how the agency is allegedly \"doing better\" (or attempting to do so) in those areas of concern. Ive heard horror stories from past staff and current staff. How many times can you say you're going to do better before you actually take the initiative to solve some SERIOUS problems within the agency."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "Hard but rewarding work", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "27 Jul 2020", "job_title": "Victim Advocate", "duration": "N/A", "pros": "The pay and benefits are good, especially compared to other local nonprofits.\r\n\r\nTrauma work is difficult but my supervisor always made sure I had what I needed to do the job and the opportunity to debrief and discuss any concerns that arise.\r\n\r\nFunding cuts across the state decimated the training budget but the internal education department provides ample opportunities on varying topics to continue licenses.\r\n\r\nThe agency underwent a massive policy rollout and became accredited recently. While the process was difficult to adjust to, the agency is better for it and many of the cons in the previous reviews are not relevant or have been mediated in some way.\r\n\r\nNo agency is perfect but this agency does try to be prepared and thorough in their plans, and is relatively transparent about why decisions are made.", "cons": "The direct service work, while rewarding, is difficult to maintain as a career due to its nature.\r\n\r\nThe flexibility asked of staff is sometimes difficult to manage to the work-personal life balance that is so important with trauma work."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Difficult job, but great place to work (if your heart is in the right place)", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "12 Jun 2020", "job_title": "Anonymous", "duration": "N/A", "pros": "Newly enhanced benefits, great training, and very meaningful work for people who are passionate about helping people who have experienced crime or trauma. Management has a lot of experience in victim services, and executive leadership is dedicated to moving the agency forward.", "cons": "This work is not for the faint of heart. It is not a place that you clock in/out and get a paycheck. Expectations from management are high, and if you are not performing to that standard, it will be addressed.\r\n\r\nThe only major issue I've experienced (and often become frustrated with) is communication. Sometimes it feels like things are over-communicated (or \"too many chefs in the kitchen\"), or things are not communicated at all (and people think it has been)."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Apply At Your Own Risk", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "17 Jun 2020", "job_title": "Staff Member", "duration": "N/A", "pros": "Benefits Package and generous PTO offered at the agency. The work is very meaningful, just ensure you practice self care to build resiliency as the work is also very hard.", "cons": "The work environment was very negative and concerns were not taken seriously when disclosed to leadership. The leadership team acted more as authoritarians rather than leaders to help guide the staff. Although the work is hard, I have learned after moving on from the agency and still working in a trauma related field that the overall atmosphere at victim assistance was actually more damaging to me than the crisis work in general. I am so happy to have moved on and know I am still able to continue to do this work in a professional environment where my supervisor understands what the work entails and knows how to be supportive to me and other staff."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Incredible Vision", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "15 Jun 2020", "job_title": "Senior Director of Education in Akron, OH", "duration": "N/A", "pros": "By well thought out planning, this agency has set it's self up to be successful as we face cuts to victim services (through Victims of Crime Act), enhance our technology and embrace our involvment in the current civil rights movement with humility and accountability.", "cons": "Being exposed to Trauma is a con. Its hard. There is nothing the agency can do to change that, but we CAN support staff when they share thier self care plans with us. We CAN continue to provide education to staff onwhat happens to our brains when we are exposed to trauma and suggestions in the aftermath. We CAN embrace new practices as our world evolves."}], [{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": "N/A", "review_title": "Great place to work but has \"kinks\" to work out", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "28 Apr 2016", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Rewarding \r\nMany opportunities for new trainings and learning experience \r\nPaid Vacation and Sick Leave Package \r\nAffordable Healthcare Insurance\r\nCares about well being of workers\r\nStaff retreats\r\nSupportive Environment", "cons": "No dental or vision\r\nLow pay but normal in this field \r\nOn call rotation for advocates\r\nHigh turnover"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 3, "Senior Management": 5, "review_title": "Great Place to Work", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "11 May 2017", "job_title": "Supervisor of Services in Akron, OH", "duration": "N/A", "pros": "The staff at this agency is very professional.  They care about each other, their clients and the Criminal Justice System.  They are very knowledgeable in the field.  Judges, Prosecutors, Police Administration, Lawyers, Police Officers and staff from other non-profit entities look to VAP for guidance in many areas.", "cons": "Being a non-profit, the salaries are low but the work satisfaction is high.  The salaries being low show that the people care about what they do as a profession."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "A Positive Experience", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "15 Jun 2020", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Welcoming and supportive co-workers\r\nStaff retreats\r\nStandard benefits for qualifying staff: medical, dental, vision, 401k\r\nBring-your-dog-to-work days\r\nFlexible PTO\r\nPowerful mission statement\r\nAgency continually strives for improvement\r\nAn attentive and supportive supervisor\r\nBeing located in downtown Akron (something I sought out)", "cons": "The only notable 'cons' I have are fairly petty:\r\n\r\nHaving to pay for parking (but I was informed of this before starting - to be expected when working for an employer located in a downtown setting)\r\n\r\nNo custodial staff - office cleaning (excluding the restrooms) and general maintenance is a shared responsibility of all"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Leadership is challenged mentally and emotionally", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "The population served is well deserving of services", "cons": "The executive director is emotionally and mentally challenged.   She does not have the skillset  to value her employees and does not have boundaries to separate employees personal life from work life.  She has fired and or been responsible for resignations of over 80 employees in the last 5 years.   She continues to sabotage coworkers relationships.  She has no business being an executive director of a victim centered agency bc she victimizes her own employees."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 5, "review_title": "Determined to Help Victims", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "13 May 2017", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "This organization not only focuses on the needs of victims, but it also addresses the the needs of their immediate family members that may have been affected by this victimization. Victim Assistance Program understands that victims can become discouraged to speak out due to fear and/or embarrassment. They look to both empower and encourage victims through reassuring them that they have a support team through this organization.", "cons": "They are working their very best to spread the word about this organization, but there are still not enough people that know they exist."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": "N/A", "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": "N/A", "review_title": "\"VAP- not what is used to be\"", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "19 Jun 2018", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "For the first 40 years of VAP's existence, many many victims were helped. The advocates were caring and dedicated along with the Founder and Executive Director.  The statistics speak for themselves.", "cons": "Since the new executive director took over in 2012, there has been an astronomical amount  of turnover. 70+ employees have either been forced out by weak leadership, resigned or fired.  Her leadership skills are lacking. She micromanages and is passive aggressive."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "N/A", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "The original mission has been lost.", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "25 Mar 2019", "job_title": "Advocate", "duration": "N/A", "pros": "The idea of this agency is a noble one and is needed in any community.", "cons": "Management, but especially the Executive Director, are not committed to the original mission of the agency,  nor its overworked and under-supported employees.  They are only concerned about a \"succeeding reputation\" and will throw any of its employees under the bus to accomplish that.  The standard of which this reputation is built on is not to help victims but instead to make the agency itself appear in a positive light and make the Executive Director look good.\r\n\r\nThe demands on and expectations for the Advocates are unrealistic, unhealthy and unappreciated.  Rules and policies are inconsistently enforced and the “open door policy” is a trap.  In the almost 4 years I worked there, I put all of my talents, energy and heart into helping each and every client as well as establishing innovative channels to make it easier for them to navigate the process because I believed in this agency and what it stood for.  It’s a shame the leadership is running it into the ground.  \r\n\r\nDr. Denton's original mission is lost and forgotten as the organization has become more important to management than the mission of helping survivors.   The turnover rate here is ridiculous and so many advocates have lost their jobs unjustly, been forced to or left no option BUT to resign, or pushed to the point of physical and mental exhaustion without any support that the employee wisely sought other job opportunities.  \r\n\r\nIf this agency has any chance of success (defined NOT by new offices/desks/headquarters and NOT at the expense of it's employees, but rather defined as continuing Dr. Denton's mission of helping victims) then the Victim, NOT the \"reputation\" of the organization and it's narcissistic, sociopathic Executive Director, needs to be the focal point."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Agency in need of an overhaul.", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "15 Jun 2020", "job_title": "Victim Advocate in Akron, OH", "duration": "N/A", "pros": "The one pro about working at VAP is that the work is very meaningful, you can very much make a difference in ones life during a very difficult time. I think the advocates take care of clients much more than they are taken care of by the agency. One thing that is hard about non profit world is that the pay is never enough, but VAP pays their advocates under what other social service agencies pay. And the on-call schedule which they are also required to do is not properly compensated which equals a poor work life balance.", "cons": "I had worked here for 3+ years and saw a complete turn over with the advocate team roughly 3 different times. This agency preaches that they are “trauma informed” but they are not, even in the slightest. Myself and about roughly 5 other advocate employees have left the agency due to feeling burnt out and under appreciated- and we all now work for other agencies, doing the same work that we did not know if we could continue to do when we were leaving VAP. I can say for myself that my mental health has improved drastically since leaving this agency. This agency is toxic and upper management is not good to it’s staff and also engages in gas lighting behavior. Which is interesting from an agency that works with victims of domestic violence? Advocates, are held to a much higher standard than anyone in upper management. It was often that I did not have time to take my lunch in the regular work day because I was stuck going on a call out, covering the front desk so a supervisor could eat or answering the hotline with little to no help from upper management because they were in “meetings” with each other that they could not miss.\r\nAnother example of the gas lighting behavior is that the agency loves to post on social media about being LGBTQIA friendly, and culturally humble and aware. When I was there, cultural humility was talked about once a year, in a mandatory training. where the President and CEO said she “did not see color”. I remember leaving this training so disappointed that I worked for an agency that is so backwards. I honestly had hoped that this agency could possibly change but now as I continue to hear from staff about how they are treated I don’t believe this is possible.\r\nSupervisors here micromanage to the point where I would receive a text asking where I was if I went to the bathroom. One supervisor in particular is the main reason in which I left. She is unprofessional and berates and yells at staff infront of other staff members. Her behavior is completely unacceptable and I mentioned this in my exit interview with the President and CEO and as I’ve heard from current staff, she continues to do these things. No wonder the turnover is so high. Not properly compensating your staff and also not taking care of them, in a trauma informed way, is why the advocate team who is on the front lines has only one person with more than a years experience. Employees should NOT be leaving an agency without having another job lined up, over a handful employees during my time there had done that which that speaks volumes to the type of work environment they actually have."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Overall Rating is a Lie- staff pressured to write positive reviews!", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "17 Jun 2020", "job_title": "Staff Member", "duration": "N/A", "pros": "The work is so important. You are truly on the front lines of assisting those in crisis through many stages of their healing. Learned a lot during my time, however a lot was self taught due to poor supervision (sometimes no supervision) and having to self teach.", "cons": "All current staff are periodically asked to leave positive reviews to boost the overall agency rating. Please look at all positive reviews through the lens of a current employee who may have felt pressured by leadership to leave one.\r\n\r\nThe agency has gone downhill over the last few years. No longer well regarded as “experts” in the community. Any person with experience has long since left and their hiring standards have decreased drastically. \r\n\r\nThe HR violations that go on at the agency are deeply concerning. No recourse as \"HR\" is CEO who has always sided with the side of her leadership because it is difficult for her to find anyone willing to work for her longer than a few months. Many employees have experienced sexual harassment and inappropriate interactions with both male and female members of leadership. Multiple supervisors would regularly discuss details of their love/intimate lives in front of staff, comment on the body/outfits of employees, and objectify other community partners in front of staff. Supervisors would even ask lower level staff members to set them up with community partners they found to be attractive. Leadership has been known to falsify time, effectively stealing from the agency. Consistent gaslighting of staff to make them feel as though they are the problem for speaking up. Leadership gossips with certain members of staff, sharing personal details about the supervision of other employees. No ounce of professionalism left in any member of leadership.\r\n\r\nNo support for grueling field. Promised for years they would implement proper supports but there was no follow through. This work can lead to lasting and serious mental health issues if no support is given for what is seen on a day to day basis. Hypocritical as they preach about “self care” and supporting those in crisis yet cannot and will not support their own staff."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Fulfilling Career with Opportunities to Make Important Connections and Positively Impact the Community", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "22 Apr 2016", "job_title": "Advocate in Akron, OH", "duration": "N/A", "pros": "Training Opportunities\r\nTeam Building Activities\r\nAbility to Constantly Learn New Things\r\nRewarding and Challenging\r\nGenerous Vacation and Sick Leave Package\r\nAffordable Healthcare Insurance\r\nFamily Focused\r\nCamaraderie", "cons": "Compassion Fatigue\r\nOn Call Rotation on Weekends and Overnights for Advocates\r\nNo Dental or Vision Insurance\r\nEmployee Turnover"}], [{"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Supportive Work Environment", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "11 May 2017", "job_title": "Advocate", "duration": "N/A", "pros": "Flexible and supportive environment, where co workers work together.\r\nGreat training opportunities!\r\nMeaningful work.", "cons": "Burn Out\r\nMust be O.K. with change because things are constantly changing and being adjusted. \r\nLower pay than private sector and government positions."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Leaders in Victim Advocacy", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "10 May 2017", "job_title": "Anonymous Employee in Akron, OH", "duration": "N/A", "pros": "Forward-thinking in providing victim services; Compassionate, caring, highly-skilled, and dedicated staff; collaboration with local organizations and entities creates a comprehensive approach to serving victims within the community", "cons": "Organization is outgrowing the current facilities"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Director of Professional Enhancement", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "21 Apr 2016", "job_title": "Director of Professional Enhancement", "duration": "N/A", "pros": "- well thought out strategic plan\r\n- board involvement\r\n- attention to self care", "cons": "Victim Advocacy does not pay what it should, however, this agency has made great strides in this area"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Program Coordinator", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "26 Apr 2016", "job_title": "Coordinator", "duration": "N/A", "pros": "- Outstanding work environment of compassionate and professional individuals that provide a much needed service to the community. \r\n- 401 K\r\n- Training\r\n- Family Focused", "cons": "- Pay is low but consistent with this industry."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 5, "review_title": "An agency that cares", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "19 Apr 2017", "job_title": "Victim Advocate in Akron, OH", "duration": "N/A", "pros": "Supportive Staff\r\nTraining Opportunities \r\nGiving back to the community is a priority of the agency", "cons": "I can't think of anything"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Terrible management", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "Some nice people over all the advocates are nice and so was the grant writer and counselor. It could be such a great place except for one person...", "cons": "...Leanne. She's a mess and really lacks a basic understanding of the way people need to be addressed and spoken to. She's just rude and doesn't even realize it."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "Crisis Intervention", "rating": "5.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "26 Jul 2016", "job_title": "Advocate in Akron, OH", "duration": "N/A", "pros": "Great organization... They really care... Really enjoyed working for them!", "cons": "Pay could have been better"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "Victim Assistance Program", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "14 Jun 2020", "job_title": "Victim Advocacy in Akron, OH", "duration": "N/A", "pros": "Open communication, receptive President, Open minded", "cons": "Stressful nature of victim advocacy work"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Forward-Thinking Agency", "rating": "4.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "22 Jun 2020", "job_title": "Supervisor", "duration": "N/A", "pros": "This agency provides better benefits and staff support than other victim service agencies in the area", "cons": "Paid parking and on-call is difficult."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Great Organization", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "17 Jun 2020", "job_title": "Victim Advocate in Akron, OH", "duration": "N/A", "pros": "CEO really cares about all staff and their well-being, allows flexibility for staff", "cons": "Paying for parking, no overtime*, divide between teams"}]]