[[{"date": "10 Jun 2023", "title": "PCT Patient Care Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Northwestern Medicine (Chicago, IL)", "Interview Descriptions": "Very quick, 5 questions! You have 3 minutes to answer your questions and 20 seconds to prep. So it was very easy to get your words out. Questions were easy and not challenging at all.", "Interview Questions": "What was a challenging thing you had to face and how did you over come it"}, {"date": "13 Jun 2023", "title": "Operations Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Northwestern Medicine (Chicago, IL) in Jun 2023", "Interview Descriptions": "The whole process took about 3 months from the submission of my application to my final interview. The job posting was vague (did not specify what department the role was for) and the talent coordinator did not seem to have a clear understanding of the role and what the department was looking for. Speaking to the talent coordinator, he mentioned to me that \"NMH is a political org so we will try to move as fast as we can but keep that in mind\". My first interview was a standard 30 minute behavioral interview with the hiring manager. Next, I was moved to a 45 minute technical interview with a program manager. Then I did not hear from NMH for 2 weeks untiled I was asked to come onsite for a 2.5 hour in person interview. They gave me the full agenda 12 hours before my interview where I was scheduled to speak with the hiring manager again, a 3 person stakeholder interview, then an interview with their analytics manager, and then a panel interview with 5 clinicians managers (this role was non-clinical). All of the onsite interviews were behavioral based and similar questions were being asked in each round. I later got feedback that I did not get the role because I did not seem \"overly excited\" for the position and that the interviewers felt I should have not asked about career progression within this specific role and NMH as an overall organization. I found the process to be slow and there was scope crept regarding the role that I did not find out until I was at my onsite interview.", "Interview Questions": "Why do you want to work at Northwestern Memorial? How do you tackle a task you've never done before? Where do you see yourself long term?"}, {"date": "22 May 2023", "title": "Patient Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Northwestern Medicine", "Interview Descriptions": "Smooth and professional, good questions and natural flow of conversation. Good listeners and top quality people. I highly recommend Northwestern Medicine. Come and check us out! Great group of people :)", "Interview Questions": "What are 3 of my top strengths?"}, {"date": "10 May 2023", "title": "Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Northwestern Medicine", "Interview Descriptions": "This started with a day of zoom interviews, followed by a 2nd round of zoom interviews. No in person option during the pandemic. Interview lasted from around 8-3pm. Normal questions!", "Interview Questions": "Why are you interested in our program?"}, {"date": "29 Apr 2023", "title": "Financial Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Northwestern Medicine (Chicago, IL)", "Interview Descriptions": "It is a quick interview process with basic interview questions. My interview process was remote and it is a team of supervisors interviewing you and asking you a set of questions.", "Interview Questions": "what are your strengths? tell us about a time you had a difficulty with a coworker at work and how did you handle it?"}, {"date": "13 Apr 2023", "title": "Emergency Department Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Northwestern Medicine (Chicago, IL)", "Interview Descriptions": "I was invited to do a first round interview using an online screening service, which was very confusing. It asks you to respond to several prompts for about a minute each with only 30 seconds to prep and no opportunity to re-record your responses. I thought I must have bombed that interview because it was so awkward speaking to no one in particular, but they called me back for a second interview over zoom with the managers of my department, and it went fine.", "Interview Questions": "I don't remember specifically what they asked, but a lot of it had to do with my previous work experience and how it might relate to the job. They then explained to me some of the flow of the department"}, {"date": "10 Apr 2023", "title": "Registerd Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Northwestern Medicine (McHenry, IL)", "Interview Descriptions": "HR was very knowledgeable and helpful. However, during the interview I realized they were not offering me the job I had applied to and tried recruiting me to different units. Tried to convince me to take a part time position. Despite this confusion, I still thought the interview went well but have yet to hear anything back from them about next steps.", "Interview Questions": "Asked a few questions about my goals as a nurse. Asked about evidence based practice."}, {"date": "5 Apr 2023", "title": "Medical Technician Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Northwestern Medicine", "Interview Descriptions": "Interview was three rounds: phone, in-person, and video call with head doctor. The team asked standard questions about self, previous experience (with medicine and specifically with the department specialization), and how you would handle difficult patients. Able to shadow with department", "Interview Questions": "How would you handle a patient who is uncomfortable with an invasive procedure?"}, {"date": "10 Apr 2023", "title": "Health Unit Coordinator (HUC) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Northwestern Medicine (Huntley, IL) in Apr 2023", "Interview Descriptions": "Interview went great for me, first they called me and did a quick phone interview and then we scheduled a virtual face to face interview with the hiring manager and then when the hiring manager felt that I would be a good candidate for the position he had me schedule a time to shadow the position itself.", "Interview Questions": "What is one weakness someone has told you that you had?"}, {"date": "21 Apr 2023", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Northwestern Medicine (Chicago, IL) in Apr 2023", "Interview Descriptions": "it was very formal and they asked me a lot of questions about nursing scenarios, why I wanted to be a nurse, and what would you do in this scenario.", "Interview Questions": "Explain a time when you went above and beyond for a pt. How do you work in groups? Which patient should you tend to first?"}], [{"date": "28 Mar 2023", "title": "Intern/Administrative Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Northwestern Medicine", "Interview Descriptions": "First half - common interview with behavioral questions and then it was followed by: Second - followed by an excel testing portion Super friendly people, made it fun and engaging", "Interview Questions": "Tell me about yourself please"}, {"date": "22 Mar 2023", "title": "Department Secretary Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Northwestern Medicine", "Interview Descriptions": "Phone call interview was short and simple process, followed up with my previous jobs and told me about the job position i applied for and what it would be like.", "Interview Questions": "Tell me about your position at (previous job)? What made you want to apply for northwestern medicine ?"}, {"date": "1 Mar 2023", "title": "Member Of Technical Staff Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Northwestern Medicine", "Interview Descriptions": "Never call back, always keep you on hold and take's forever to get an answer back. you;re better off at rush or any other hospital to be honest. there's much more options out there.", "Interview Questions": "What career accomplishment makes you most proud? ... Tell me something about yourself that isn't on your resume. ... Why do you want to work here? ..."}, {"date": "3 May 2023", "title": "Benefits Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Northwestern Medicine (Chicago, IL) in Mar 2023", "Interview Descriptions": "It was smooth - stated with a phone interview with recruiter, hiring manager interview, team interview, and HR managers meeting. Took awhile to hear back from them on the final steps.", "Interview Questions": "What type of excel skills do you have?"}, {"date": "14 Feb 2023", "title": "Managing Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Northwestern Medicine", "Interview Descriptions": "The interview process is really long but it gives all applicants the opportunity to meet many different people from the department. Even though the process is long, recruiters keep lines of communication open so getting responses is easy.", "Interview Questions": "They ask questions related to experience in the work place. One question was related to conflict resolution."}, {"date": "9 Feb 2023", "title": "Student Nurse Extern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Northwestern Medicine", "Interview Descriptions": "The recruiter was super personable, and the questions were as expected. There was an online interview prior to a second interview via Zoom. The process was very smooth. I was informed appropriately of timing, and job status.", "Interview Questions": "Recall a time in which you had to deal with a difficult patient/co-worker. How did you handle that situation? What could you have done better?"}, {"date": "9 Mar 2023", "title": "IS Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Northwestern Medicine (Chicago, IL) in Feb 2023", "Interview Descriptions": "You get online recording interview through hireview which has around 5-6 questions. After, you pass that you just do final interview with team lead and they just ask you about your projects in detail and the technologies.", "Interview Questions": "Tell me about yourself in detail and things which are not in resume. Go in detail of every project you did and how you did it \"specific course work I took\" ."}, {"date": "26 Feb 2023", "title": "Patient Access Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Northwestern Medicine in Feb 2023", "Interview Descriptions": "Job expectations was explain to me in great detail. Interview lasted about 30 minutes. Was very nervous at first, but my interviewer was excellent. Overall I had a great interview.", "Interview Questions": "Tell me about a time you had to work with a difficult coworker?"}, {"date": "23 Mar 2023", "title": "Research Technician III Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at Northwestern Medicine in Feb 2023", "Interview Descriptions": "Very pleasant, seems like a good working environment. I declined because I was not super impressed with the salary, given the location and cost of living. I wish there was more transparency about salary prior to interview and offers.", "Interview Questions": "They asked about my skills with particular methodologies that they often employ. They also asked a bit about my previous work in their area of study as well as in statistical/data analysis."}, {"date": "26 Jan 2023", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Northwestern Medicine", "Interview Descriptions": "Initial application was followed by a video with HR. Then a phone call with HR before the interview with the unit manager and education coordinators from the unit. The interview was on teams at the time and consisted of a few personal questions and basic job interview questions.", "Interview Questions": "Why do you want to work on this unit?"}], [{"date": "10 Jan 2023", "title": "IS Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Northwestern Medicine", "Interview Descriptions": "It was very easy. I applied then they made me do a online interview where I recorded myself answering questions. After that they did some phone screenings then the offered me the position", "Interview Questions": "Would you tell us about yourself"}, {"date": "1 Feb 2023", "title": "New Grad Registered Nurse Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Northwestern Medicine in Jan 2023", "Interview Descriptions": "Applied online. Received notification within the same day. HR scheduled a 10-15 minute phone interview. Then scheduled an in-person interview for 30 minutes with the possibility of shadowing the unit.", "Interview Questions": "Q: can you tell me about a time where you made a mistake, the steps you took to fix it, and what was your response."}, {"date": "15 Jan 2023", "title": "PCT Patient Care Tech Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Northwestern Medicine (Chicago, IL) in Jan 2023", "Interview Descriptions": "Super easy interview I was literally offered the job after 2 minutes. Everyone was nice and professional and interview set up was really prompt, but I didn’t take the job.", "Interview Questions": "What my Availability was with school"}, {"date": "1 Feb 2023", "title": "Genetic Counselor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Northwestern Medicine (Winfield, IL) in Jan 2023", "Interview Descriptions": "I had an initial interview with the lead genetic counselor and the HR manager. That interview was around 30 minutes and was pretty informational. Then, I had an interview with all of the genetic counselors I would be working with that lasted around 40 minutes. Both were virtual. I have not heard yet about if I got an offer or not.", "Interview Questions": "Tell me about your time management skills"}, {"date": "5 Dec 2022", "title": "PCT Patient Care Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Northwestern Medicine", "Interview Descriptions": "Phone call and a video call with a few behavioral questions about your past work experiences and what you have done. Phone call and a video call with a few behavioral questions about your past work experiences and what you have done", "Interview Questions": "When have you gone above and beyond for patients?"}, {"date": "13 Dec 2022", "title": "Information Systems Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Northwestern Medicine (Remote) in Dec 2022", "Interview Descriptions": "I took 3 interviews, one with HR, one recorded interview, and then finally the one with the managers. This process was from Sep to Dec. After the last interview, they sent me an offer the next day.", "Interview Questions": "Tell us about yourself. Favorite part of current internship/job?"}, {"date": "31 Dec 2022", "title": "PCT Patient Care Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Northwestern Medicine (Crystal Lake, IL) in Dec 2022", "Interview Descriptions": "It was very easygoing. I got called about two days after I submitted my application to schedule a phone interview. She then scheduled me for an interview with the manager via Teams. I found out exactly a week later that I had gotten the position by phone from the recruiter.", "Interview Questions": "A time you went above and beyond for a patient, a time you had a conflict with a co-worker and how it was resolved, 3 words your friends would use to describe you, why do you want this job, why do you want to work at Northwestern."}, {"date": "22 Nov 2022", "title": "PCT Patient Care Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Northwestern Medicine", "Interview Descriptions": "Standard interview questions. One on one with the manager that lasted less than 30 minutes. It was virtual and I heard back very quickly from the Human Resources individual. Overall great experience", "Interview Questions": "Tell me about yourself and why you want to work here"}, {"date": "1 Nov 2022", "title": "Intern Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Northwestern Medicine", "Interview Descriptions": "At first it was a Hireview interivew with one chance to answer each question, then there was an in person interview, but I took a different offer by the time they got back to me", "Interview Questions": "Why should you pick Northwestern? What is your Background"}, {"date": "9 Jan 2023", "title": "Clinical Dietitan Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Northwestern Medicine (Chicago, IL) in Nov 2022", "Interview Descriptions": "Initial interview was through a video call. The hiring manager, HR, as well as an educator all joined the call. The interview included basic introductory questions to the interviewee. There was also an MNT verbal quiz at the end that lasted for around 15 min.", "Interview Questions": "Q: How would you describe yourself? Q: Where do you see yourself in 5 years? MNT quiz at the end"}], [{"date": "8 Oct 2022", "title": "Director Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 3 months. I interviewed at Northwestern Medicine", "Interview Descriptions": "After interviewing with recruiter, interviewed with 12 people through Zoom/Teams approx 30 min each. All shared their goals for and their areas. Couple more calls with hiring manager and recruiter before offer was made/accepted. Whole process took ~3 months. Process wasn't difficult, but lengthy.", "Interview Questions": "Tell me about your background and why Northwestern?"}, {"date": "5 Oct 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Northwestern Medicine", "Interview Descriptions": "I went through 2 interviews. I did one with recruiter and one with manager. The process was smooth and quick. Their questions weren't difficult. They had me recollect my experience.", "Interview Questions": "Typical Questions you get asked."}, {"date": "22 Dec 2022", "title": "Business Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 1 week. I interviewed at Northwestern Medicine (Chicago, IL) in Oct 2022", "Interview Descriptions": "Great interview process, the interviewer was polite and answered all my questions. Northwest also disclosed the budget for salary in relation to the role. The salary was lower than my expected salary so I did not continue with the interview process", "Interview Questions": "Explain my technical experience through projects"}, {"date": "13 Feb 2023", "title": "Financial Clearance Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at Northwestern Medicine in Oct 2022", "Interview Descriptions": "Interview process was very straight forward and simple. i had two interviews in total. A screening of my credentials and the actual interview w/ the team leads. I received an offer 2-4 days later.", "Interview Questions": "Provide an example of you multiple tasking. Provide an example of you providing excellency customer service."}, {"date": "3 Sept 2022", "title": "Social Worker Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Northwestern Medicine", "Interview Descriptions": "Virtual interview with several nurses in the department for an outpatient office. All of the nurses were very nice and informative about the department and why they liked working there.", "Interview Questions": "Background experience and why do you want to work here"}, {"date": "29 Aug 2022", "title": "Housekeeping Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Northwestern Medicine", "Interview Descriptions": "The interview process was quick and went well. The interviewer was friendly and asked about my past experience as well as education level. No difficult questions were asked and I was hired fairly quickly", "Interview Questions": "What are my strengths and weaknesses "}, {"date": "6 Aug 2022", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Northwestern Medicine", "Interview Descriptions": "Phone interview. Felt brief and rushed. Seemed like a prescreening more than an interview. Moved onto the second round and felt they were not accommodating to my schedule or willing to be flexible.", "Interview Questions": "Describe the aspects of what makes you a strong nurse"}, {"date": "5 Aug 2022", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Northwestern Medicine", "Interview Descriptions": "Virtual and short.  Met with 2 members of the practice and talked about experiences. They were very easy going and described what the day to day life would be like.", "Interview Questions": "Why do you want to work for Northwestern?"}, {"date": "1 Aug 2022", "title": "Pathology Support Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Northwestern Medicine", "Interview Descriptions": "It was a very pleasant interview progress. The manager and lab supervisor were very nice. At the end, they showed me around the lab. I was exposed to the operations of the lab before given an offer.", "Interview Questions": "What was one challenge you faced, and how did you overcome it?"}, {"date": "26 Jul 2022", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Northwestern Medicine", "Interview Descriptions": "Average Interview -- staff was friendly. Interview was done online because of covid but was still an easy experience. Be sure to brush up on interview questions and practice because it will help in the end!", "Interview Questions": "What are one or two hobbies on your free time?"}], [{"date": "15 Jul 2022", "title": "Speech Language Pathologist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Northwestern Medicine", "Interview Descriptions": "You had to record yourself answering pre-selected questions. They provided a platform for you to use. It was a total of five questions.  You had 30 seconds to prepare your answer. Then you had a total of 3 minutes to answer the question. You did not have to use the full 3 minutes.", "Interview Questions": "Describe a time when you demonstrated leadership"}, {"date": "12 Jul 2022", "title": "Rehab Technician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Northwestern Medicine", "Interview Descriptions": "It was a 15 minute phone call and then an in person interview for about an hour. I met withthe same person for both interviews and a new person for the in person interview.", "Interview Questions": "Q: how have you dealt with an upset patient or customer in the past?\r\nQ: tell us about a time where you've made a mistake and how'd you tell your supervisor?\r\nQ: how do you prioritize?\r\nQ: what are essential things for good team work?"}, {"date": "6 Aug 2022", "title": "Patient Access Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Northwestern Medicine in Jul 2022", "Interview Descriptions": "Everyone was very nice and the entire application process was very user friendly. They are a very responsive employer. I heard back within a few hours of my interview and was then instructed through on boarding paperwork and was given my start date.", "Interview Questions": "Lots of questions asking you about past experiences and how you would / have handled situations"}, {"date": "14 Jun 2022", "title": "Clinical Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Northwestern Medicine", "Interview Descriptions": "Easy application. Straightforward, quick, and easy process. Initial phone interview with recruiter and then video interview with managers on the unit. Had one prioritization question. Others were more personal and relate to why you want to go into nursing", "Interview Questions": "What made you want to go into nursing?"}, {"date": "2 Jun 2022", "title": "PCT Patient Care Tech Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Northwestern Medicine", "Interview Descriptions": "Easy Going, Virtual\nInterview with manager and then nurse peers\nOnly one phone recruiter interview. Manager interview and peer interview was done in one day. Received an offer a few days later via phone recruiter.", "Interview Questions": "Tell me about yourself\nStrengths and weaknesses"}, {"date": "19 Jul 2022", "title": "Registered Dietitian Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Northwestern Medicine (Palos Heights, IL) in Jun 2022", "Interview Descriptions": "Poor with terrible communication both from hiring manager as well as HR. Left messages regarding my application status to the manager and HR. I never received a response. Only a general automatic reply saying they chose another candidate after interviewing. Please don't waste a candidates time.", "Interview Questions": "Typical interview questions along with career insight "}, {"date": "18 Jul 2022", "title": "Staff Physical Therapist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Northwestern Medicine (Chicago, IL) in Jun 2022", "Interview Descriptions": "Pretty standard with several \"tell me about a time\" questions. The hiring managers were warm and conversational, made it feel much more relaxed. Interview took about 45 minutes in total", "Interview Questions": "\"Tell me about a time you went above and beyond with a patient\""}, {"date": "17 May 2022", "title": "Supply Chain Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Northwestern Medicine", "Interview Descriptions": "Basic character questions along with some process improvement questions. Some lean process improvement questions that they try to see if you understand the basic flow of the work and how to reduce waste.", "Interview Questions": "Explain your process when you see an item go on backorder. "}, {"date": "6 May 2022", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Northwestern Medicine (Aurora, IL)", "Interview Descriptions": "Called within a fairly decent timeframe for phone screen and in person interviews however some recruiters are difficult to contact afterwards and do not respond in a timely manner regarding whether or not you will be receiving an offer. Sometimes they don’t inform you at all after interviewing and shadowing.", "Interview Questions": "Describe a difficult situation that you overcame"}, {"date": "15 Jun 2022", "title": "Data Engineer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Northwestern Medicine (Chicago, IL) in May 2022", "Interview Descriptions": "Overall flow is smooth, applied via  referral for this position \n1. Hr call for 15 min to check on required skills and salary expectation \n2. Call with Hiring Manager for 30 min over all cv review and required skills, got rescheduled once following unavailability  \n3. Call with Hiring Manager and Principal Technical Architect(1 hr)-technical  round/was a  limited to basic data warehouse questions around Dimension and fact", "Interview Questions": "Technical Panel Round had below question\n1. Describe your project and your role in that. \n2. How would you load a dimension table and which component you will use in ETL for it\n3. How would you load a fact table\n4. What are the 2 things you will check for while loading a fact table in oracle in terms of design and for requirement\n5. use case : how would you design a process to load a fact table which when failed would load from that point ahead on rerun i:e If failed after loading 100 records out of 250, on rerun it will load 101 to 250th record\n6. how is dedicated pool different than server less pool\n\nOverall question from Principal Technical Architect were basic use case driven around dimension and fact  tables.\nWhile Hiring Manager was lacking enthusiasm during the whole process ,was late for both round from 10-15 min and was in hurry to wrap up \n\nthough was trying to piggy back on others question with little to no knowledge of what she was asking.\nInterview felt very forceful from Hiring Manager end \n\n"}], [{"date": "20 Sept 2022", "title": "PCT/CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at Northwestern Medicine in May 2022", "Interview Descriptions": "Over the phone interview then in person interview the following week. After the in person interview you basically land the job. Offered the job literally the next week after in person interview. Overall,  the interviews went very well and it was a smooth process.", "Interview Questions": "Name a time you dealt with someone difficult and how did you overcome that situation "}, {"date": "9 Apr 2022", "title": "Occupational Therapist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Northwestern Medicine", "Interview Descriptions": "Received an email for a virtual interview. Answered a few prerecorded questions about my experience and handling different situations at work. I was a new grad and did not get an offer to proceed with the process.", "Interview Questions": "Describe a difficult situation and how you handled it?"}, {"date": "29 Apr 2022", "title": "Registered Nurse Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Northwestern Medicine in Apr 2022", "Interview Descriptions": "The interview begins with meeting with a recruiter, then you interview with a panel of managers all from different unit. Once this is done you shadow on the units and if you are selected you are offered a position.", "Interview Questions": "Tell us about a time you went above and beyond for a patient "}, {"date": "8 Mar 2022", "title": "Sales Associate - Office Max Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Northwestern Medicine", "Interview Descriptions": "Multiple video interviews including an in person interview and in person shadow for an hour being shown the office and duties. Phone call interview with the office director.  That’s all that I can recall.", "Interview Questions": "None that I can recall"}, {"date": "7 Mar 2022", "title": "Interpreter Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Northwestern Medicine (Chicago, IL) in Mar 2022", "Interview Descriptions": "I was interviewed by two managers in a secluded room. They were honest, kind, and interested in my work. They also explained Northwestern's culture in depth while also laying out expectations of the position.", "Interview Questions": "What was a time when you were challenged to improve your work?"}, {"date": "30 Mar 2022", "title": "Call Center Representative Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Northwestern Medicine (Chicago, IL) in Mar 2022", "Interview Descriptions": "They were late and very dull. Did not really try to get to know me. only asked 5 behavioral questions. I was very disappointed in the way the lady was  and she did not even turn her camera on. It was a virtual interview.", "Interview Questions": "How do you handle stress?"}, {"date": "6 Feb 2022", "title": "Clinical Nurse - Observation Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Northwestern Medicine (Chicago, IL)", "Interview Descriptions": "The interview was virtual, which would have normally been fine. My interviewers (there were a few at the same time) kept their cameras off while asking me questions. I was talking to a blank screen, which made me very nervous.", "Interview Questions": "The questions they asked were typical of other nursing positions. \"What do you know about/Why are you interested in Medical Observation?\" "}, {"date": "13 Jan 2022", "title": "Clinical RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Northwestern Medicine", "Interview Descriptions": "Short recorded interview with basic questions about you then sot down manager interview in person (was on teams due to covid). Took about a week to hear back. Shorter if you reach out after interview", "Interview Questions": "What was one time you went above and beyond for a patient"}, {"date": "4 Jan 2022", "title": "Histotechnologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Northwestern Medicine", "Interview Descriptions": "It was fast and easy. There weren’t too many interviews and it was a pretty smooth process. I had two interviews before I got hired. It was an HR interview and then another interview with the management team", "Interview Questions": "Why do you want to work at NMH?"}, {"date": "13 Jan 2022", "title": "Anesthesia Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Northwestern Medicine in Jan 2022", "Interview Descriptions": "The process was very easy; I applied online, got a call the following day, scheduled the video interview for the next day, and received an email for a job offer two days later. I always send a follow up email after an interview and that may have helped with how quickly I received an offer.\r\n\r\nBe sure to know that during the video interviews there may be 4-5 people from the department on the call, so be prepared for a lot of questions.\r\n\r\nCome prepared with your own questions to ask them.", "Interview Questions": "Q: Why are you interested in switching to this department? (I was working at another hospital in a different department at the time)\r\nQ: What do you do when there is a mistake made at work?\r\nQ: Tell me about a time you had to deal with a difficult person at work.\r\nQ: How would your co-workers describe you?"}], [{"date": "14 Feb 2022", "title": "Supply Chain Internship Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Northwestern Medicine in Jan 2022", "Interview Descriptions": "Online in platform, followed by digital with a member of HR. The platform interview asks the usual interview questions (\"why this job?\" \"what's your experience\" etc), while the digital interview is mostly over resume.", "Interview Questions": "\"Why did you apply for this job?\""}, {"date": "16 Dec 2021", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Northwestern Medicine", "Interview Descriptions": "Brought in during a cohort interview process, interview questions were straight-forward and I was able to spend some time on the unit during the day. I found out within the same day that I had a job offer.", "Interview Questions": "Tell a little bit about yourself "}, {"date": "23 Nov 2021", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Northwestern Medicine", "Interview Descriptions": "Interview was comfortable and pleasant. No crazy questions I couldn't answer with 4 years of nursing experience. Felt at ease and had quick follow up response with an offer. Good Luck!", "Interview Questions": "N/A"}, {"date": "14 Jan 2022", "title": "Plastics Administration Coordinator Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 6 weeks. I interviewed at Northwestern Medicine (Chicago, IL) in Nov 2021", "Interview Descriptions": "The interview process started out very smoothly. The hiring manager reached out to me via Indeed and within days I had a virtual interview with her. I even scheduled a phone interview with the HR representative the day after Thanksgiving. The next step was to interview in person. I arrived well dressed and ahead of schedule. I was very excited to meet everyone and had a great experience, or so I thought. Thinking back, I noticed that the surgeon who I was to potentially work under, was asking personal questions from the very second I sat down. He questioned if I had children and what type of education they were receiving. He automatically assumed they were enrolled in a public school and he went as far as to ask if the e-learning they experienced the past year had harmed them in any way. Which was odd but I thought he was just being curious. I thought it was going well when he abruptly ended the interview. Being that he is a highly regarded and very busy surgeon, I didn’t quite feel it was because he just simply made up his mind right then and there that I wasn’t a good fit. After, I continued to interview with the rest of the staff. I met  5 people in total and everyone seemed great! I felt pretty good leaving that morning. I followed up with an email when I had not heard back for almost 2 weeks, the hiring manager simply responded stating that there was another doctor they’d like me to meet. Making this the 4th interaction with one or more staff members. The interview was at 7:30am. This was my 2nd time driving up to the hospital and paying for parking. There was definitely effort on my end! When I arrived the doctor seemed frazzled. I thought maybe he had a busy schedule. He wasn’t really engaged as it seemed his mind was somewhere else. He’d start to speak on a subject and then forget where he was going with the conversation. At one point, someone walked in and he didn’t know who it was. I asked if it was his patient but he just seemed confused. The point is that he was not into the interview. I also ended up meeting his nurse that morning. My experience there was better but I left knowing that I wasn’t going to get a call back. Either way, a couple weeks later, I sent yet another follow up email thanking the hiring manager, congratulating them on finding the right candidate if it applied and asking for some feedback. At this point, I was 100% positive the position was not going to be awarded to me. Normally, this wouldn’t be a problem. It’s a part of the job hunting/interview process. I am not at all disappointed that I wasn’t chosen if I wasn’t a good fit but more so that I felt as though my race played a  role in their decision making. The entire office aside from 2 of their surgeons are Caucasian. I hate to think this way in this day and age and especially because the team seemed to mostly be millennials who are usually very aware and open minded. But I just cannot shake that feeling off! After she responded that a decision wasn’t made yet, I left it alone and thought that was her way of dodging my question of asking for a helpful critique. I received an email today after almost 2 months from the hiring manager. In the email she is telling me yes, yup! I’ll finally let you in on it, the position has definitely been filled BUT we’d like to offer you an opportunity to work the front desk. An entry level type of job. I have a degree and I have over a decade of customer service and management experience. That was in my opinion, rude. Yet, I still responded gracefully and with no ill words. I am a well qualified person who has years of experience but was offered an entry level role after so much effort and interest was placed. Hiring managers, please be aware that we are people too and that we also deserve to be acknowledged timely and please, please do NOT take it upon yourself to personally demote people! A quick critique or a, everything was great but we found someone more qualified would have sufficed!", "Interview Questions": "I was asked basic interview questions like, what would you do if you had a patient who was being aggressive. Give us an example of how you handled a similar situation in the past. I was also asked personal questions about my children’s education and what I personally thought about reconstructive and plastic surgery."}, {"date": "15 Dec 2021", "title": "Financial Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Northwestern Medicine (Chicago, IL) in Nov 2021", "Interview Descriptions": "Mostly behavioral. First round was video interview, then came in-person and interviewed with a total of 4 people. Nothing too hard, there was a quick excel case study to see how you can manipulate data and present information. Would also suggest to come prepared with questions about the role/company.", "Interview Questions": "- Why are you interested in Northwestern Medicine?\n- Walk me through your resume and experience."}, {"date": "27 Sept 2021", "title": "Nurse Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Northwestern Medicine", "Interview Descriptions": "It was multiple steps from initial offer to occ health and clearance. It seemed overly complex for the position i was hired into. I would think this is why they hire out RN contracts versus actual staff new hires", "Interview Questions": "conflict resolution and team work abilities"}, {"date": "27 Sept 2021", "title": "Patient Liaison Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Northwestern Medicine", "Interview Descriptions": "Completed a video interview with hirevue then interviewed with two managers. The first interview was sent to me within a week of completing the application. After one week, I was told to schedule a video interview with the two managers. It has now been a week, still waiting to hear back.", "Interview Questions": "Why do you want to work at Northwestern"}, {"date": "26 Sept 2021", "title": "Patient Access Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Northwestern Medicine (Chicago, IL)", "Interview Descriptions": "I applied online received an email for a video interview, I interviewed with two managers. HR was very slow to respond, You must have 5 references two must be a manager and three from co workers or classmates you upload them online its a link to a survey you must have your reference email. The references honestly took the longest. After a month I get a call from HR rep and extended an offer. You will have to complete all onboarding and background check online.  I asked questions during the interview as well. For example what is changeling about this position etc...", "Interview Questions": "How do you deal with conflict with a patient? Since working remote how do you work with a team? Where do you see yourself in 5 years? "}, {"date": "13 Sept 2021", "title": "Case Therapist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Northwestern Medicine", "Interview Descriptions": "Automated process, quick response and flexible ability to schedule interview. Appreciated the ability to reply to my questions honestly and interviewer was upfront about job expectations and responsibilities. Process was not intimidating and assured me of a positive work environment", "Interview Questions": "What is your salary expectation"}, {"date": "8 Sept 2021", "title": "Emergency Department Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 days. I interviewed at Northwestern Medicine (Chicago, IL) in Sept 2021", "Interview Descriptions": "It was an online interview where they used an online interview platform . The platform allowed you to practice interview questions and utilizing the program before beginning. Interview consisted of sending video responses for  different questions.", "Interview Questions": "Why I wanted to work at Northwestern Medicine specifically?"}], [{"date": "12 Oct 2021", "title": "Clinical Nurse Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Northwestern Medicine (Naperville, IL) in Sept 2021", "Interview Descriptions": "They had called me and asked me a few questions and then scheduled me to come in and continue the interview process in peson as well as give me a tour around where I would be working.", "Interview Questions": "why northwestern as a place to work?"}, {"date": "10 Aug 2021", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Northwestern Medicine", "Interview Descriptions": "2 interviews completed - both online (about a week apart). Met with managers a week ago and have not heard back yet. Overall, I’ve had a good experience. Just waiting to see what the next steps are.", "Interview Questions": "Where do you see yourself in five years?"}, {"date": "5 Aug 2021", "title": "RN Staff Nurse Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Northwestern Medicine", "Interview Descriptions": "There was a digital interview first, which had some challenging questions, only 10 minutes long. Then a shadowing experience was set up. After the shadowing experience, an online video interview with the nurse managers.", "Interview Questions": "Describe a conflict with a co worker. What was the conflict and how did you handle it?"}, {"date": "2 Aug 2021", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Northwestern Medicine", "Interview Descriptions": "Over the Phone and in person interview on unit with nurse manager, education coordinator, and two nurses from the unit as well. Each interviewer had own set of questions to ask candidate", "Interview Questions": "Biggest strengths and weaknesses in clinical setting? "}, {"date": "11 Jul 2021", "title": "Clinical Nurse (Psych ED) Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Northwestern Medicine (Chicago, IL) in Jul 2021", "Interview Descriptions": "Recruiter contacted me within 30 minutes of submitting my application. *No kidding* I scheduled an interview for the following week. MS Teams platform.  They immediately wanted me to apply for a different position than I applied for during the first,  interview (that was a red flag,  but I ignored it). I declined,  asked to continue with the scheduled interview. I was contacted by recruiting the next day to schedule a 2nd interview. Asked for 5 references (a bit much... but okay its \"Nothwestern\") I interviewed in person the following week. Met with one employee of the department,  the \n2nd person cancelled due to department emergency.  It happens.  The person,  I interviewed with seemed to have an issue with me returning school. She compared me to her daughter ( who worked there on days btw and had difficulty managing her work/school schedule) .  The manager already knew this info (about my attending grad school),  during the first interview.  So,  I was honest,  and to the point.  This is why I chose night shift.  I know what I can handle and  juggle accordingly.  Nursing is about time management after all.  The person I interviewed with worked part time day shift. \nAgain,  the position I applied for was part-time nights. From that point on,  my commitment was a concern to department needs.  All went cold.  I received a rejection email  a week later.  Was it racism?  Did that lady I interviewed with suggest her daughter for the position?  Lol Should I have not been honest? I'll never know.  What I do know...I will NEVER again waste my time applying at the prestigious Northwestern  Memorial Hospital.  Extremely disorganized mess,  cloaked in name recognition.", "Interview Questions": "My daughter works here and has trouble managing her schedule with school. How will you handle it? \n\nHow are you with engaging different personalities?   Are you able to approach this in a respectful way? \n\nDo you get upset easily,  or easily worked up? "}, {"date": "16 Jun 2021", "title": "Consultant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Northwestern Medicine in Jun 2021", "Interview Descriptions": "Recruiters are very bad at communicating after the interview. They will ghost you and not give you any follow up no matter how many times you email or call them.", "Interview Questions": "What software have you used in data analysis? "}, {"date": "8 Jun 2021", "title": "Registry Physical Therapist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Northwestern Medicine (Chicago, IL) in Jun 2021", "Interview Descriptions": "HR contacted to set up time. Virtual interview held for 30 minutes with 3 different members of the Physical Therapy rehab team.  Allowed questions at the end. Was difficult and not typical interview.", "Interview Questions": "Why do you want to work at Northwestern what draws you in?"}, {"date": "18 Jun 2021", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Northwestern Medicine (Chicago, IL) in Jun 2021", "Interview Descriptions": "I had one hiring manager from the floor and one nurse educator from the floor that conducted my interview. The flow of the interview was comfortable to the point we had nice side conversations. It lasted about 25 minutes.", "Interview Questions": "Please, tell me about yourself?"}, {"date": "10 Jun 2021", "title": "Patient Service Representative Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Northwestern Medicine in May 2021", "Interview Descriptions": "Applied online through a referral and received an email asking me to complete a 10-minute HireVue interview the next day. Completed it the same day and have not heard back in 1 week.", "Interview Questions": "Why do you want to work at Northwestern?"}, {"date": "22 Apr 2021", "title": "IR Nurse Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Northwestern Medicine", "Interview Descriptions": "Two round virtual interview, seemed unorganized. Met with the manager and then with employees. Asked very basic questions - about my experience, then passed me along. Discussed the intense call schedule as well.", "Interview Questions": "Tell me about your experience and how it applies to this role. "}], [{"date": "18 Apr 2021", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Northwestern Medicine (Geneva, IL)", "Interview Descriptions": "Interview process started with a recorded video interview you complete at home. If video interview was acceptable HR would set up a manager interview and then peer interview the same day.", "Interview Questions": "Basic interview questions such as what is your greatest strength, greatest weakness. Share you past work experience."}, {"date": "13 Sept 2021", "title": "Clinical Quality Leader Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Northwestern Medicine in Apr 2021", "Interview Descriptions": "HR reached out and asked to schedule a call with Hiring manager - had a total of 3 calls 2 with the hiring manager and one with the team, later HR reached out and asked to fill in references, never heard back afterwards. Would have expected that they’d at least email me that I wasn’t selected after finishing the reference checking step. (Always been the same experience I have 4 experiences with Northwestern  when they ask to fill in references and they email references as well, and they never bother to get back with a at-least a generic rejected email.)\r\nRespect the candidates time by at least getting back to them with your decision positive/negative.", "Interview Questions": "Asked to share examples of analysis I was currently working on for a healthcare organisation with  PHI on it and I refused stating the same, later I did create a detailed analysis with a presentation taking data from their public website"}, {"date": "31 Jan 2023", "title": "Summer Intern Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Northwestern Medicine (Cleveland, OH) in Apr 2021", "Interview Descriptions": "It was a virtual interview, with little time to prepare answers, and about thirty seconds to record the response. There was not an opportunity to re-record responses. There was a total of three interview questions.", "Interview Questions": "What is one experience that made you think outside of the box?"}, {"date": "21 Sept 2021", "title": "Surgical Pathology Technician Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Northwestern Medicine (Chicago, IL) in Apr 2021", "Interview Descriptions": "I was first contacted by HR to schedule an in-person interview. The hiring lead and assistant were nice during the interview itself; the questions were mostly a mix of seeing right-fit and behavioral, with the latter focused on relevant soft skills such as time management. I also vaguely recall thinking that some of the questions were rather generic, but that's alright. They had also asked a question or two about my direct clinical/medical experience, which I did not have.\nAfter the in-person interview, they gave you a lab tour with the chance for you to briefly shadow another technician and ask questions. I enjoyed that. It's good to see what your potential workplace will be like.\n\nI never heard from them afterwards though, not even an automated rejection from HR.", "Interview Questions": "Tell me something about yourself that is not on your resume."}, {"date": "11 Mar 2021", "title": "Intern Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Northwestern Medicine", "Interview Descriptions": "It was interesting experience. We conducted a virtual interview using Hireview program.  A series of questions were asked but you will have time to practice before you make your actual recording.", "Interview Questions": "What do you do in your free time. Explain how you diversity can help you in the program or as a physician. "}, {"date": "8 Mar 2021", "title": "Registered Nurse, BSN Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Northwestern Medicine", "Interview Descriptions": "Have a pre-interview with videos, phone interview with HR, then final interview with unit staff.  Staff was nice and informative. Very strict on references. The process took a couple of weeks to complete.", "Interview Questions": "nursing process questions\r\nwhy this specific specialty? Why this hospital? A time you dealt with patient who was anger."}, {"date": "7 Mar 2021", "title": "PCT Patient Care Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Northwestern Medicine", "Interview Descriptions": "Sat down with 3 people, talked about what qualifies me for the position. Went over previous work experience, skills I have and skills I need to work on. The process was pretty straight forward", "Interview Questions": "What skills from previous jobs will help you succeed working here?"}, {"date": "2 Mar 2021", "title": "Data Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Northwestern Medicine", "Interview Descriptions": "Very streamlined, they know what they want and they do not mess around with multiple interviews or small talk. They'll do a base interview for abut an hour, and within a week you will know if you are hired or not.", "Interview Questions": "Describe a time where you were not able to complete a task? "}, {"date": "29 Apr 2021", "title": "Technical Support Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Northwestern Medicine in Mar 2021", "Interview Descriptions": "There were three rounds of interviews, the first was a phone interview with hiring manager, second was a video interview with other managers in the department via Zoom, and final was with the director.", "Interview Questions": "What is an IP address?"}, {"date": "25 Aug 2021", "title": "Analytics Consultant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Northwestern Medicine (New York, NY) in Mar 2021", "Interview Descriptions": "Round 1: Phone Screening with the Recruiter\nRound 2: Phone Screening with the Hiring Manager\nRound 3: 1 hour live SQL coding\nRound 4: Interview/Discussion with team members (around 1 hr)\nRound 5: Interview/Discussion with a Program Manager (around 1 hr)\nRound 6: Final Interview/Discussion with the Director and the Hiring Manager (around 1 hr)\n\nI went through 6 rounds of interview over a period of 3 weeks and then \"crickets\". I emailed the Recruiter after a week or so, no response.  After waiting for another 10 days I get an automated email from the Recruiter thanking me for \"applying for the position\". I wasn't expecting a feedback but at minimum the Recruiter could have sent a personal rejection email considering the time I spent on 6 rounds of interview. I took time out of my current work schedule to prepare for it. The only reason I'm marking this as a negative experience is because of the Recruiter's POOR response skills. Otherwise the people who interviewed were easy to talk to.", "Interview Questions": "They are mostly trying to understand your experience and how you fit into the role and how well you do under pressure."}], [{"date": "21 Jul 2021", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Northwestern Medicine (Chicago, IL) in Mar 2021", "Interview Descriptions": "Very kind staff and make you feel very comfortable. First a phone interview then with a hiring manager.  Questions varied in each interview. They let you know their unit environment and their expectations.", "Interview Questions": "How do you adapt to change?"}, {"date": "26 Feb 2021", "title": "Medical Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Northwestern Medicine", "Interview Descriptions": "3 Interviews about 30 minutes each. 2 professors, 1 M4. Very easy to talk to, interested, and well-spoken interviewers. The virtual interview day made me feel very welcomed and wanted by the University.", "Interview Questions": "Why do you want to come to Northwestern?"}, {"date": "24 Feb 2021", "title": "Physical Therapist Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Northwestern Medicine", "Interview Descriptions": "After applying for the position, it took about 2 weeks for a recruiter to reach out and schedule a phone interview via Microsoft Teams. Phone interview was about 15-20 minutes long, pretty easy and laid back.  After about a week, I received a second invitation for a video interview via Microsoft Teams and had a video interview a week later. Video interview was much more intense, many questions involving situational questions and regarding communication and involved 4 different people. It took about an hour and 45 minutes.  They said within a week or 2 they would get back to say if there was an offer or not but this process had already taken well over a month in total and is very unprofessional if they are serious in finding another suitable candidate. I had found a job in the time of waiting but regardless if I had been given an  offer I would have declined due to the long process and lack of communication this company gave.", "Interview Questions": "Tell me about a time where you did not receive  constructive criticism and what you did to resolve that?"}, {"date": "18 Feb 2021", "title": "Financial Analyst Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Northwestern Medicine", "Interview Descriptions": "Discussion based. Nothing too intense. Met with managers and director. Discussed background and interest in role. No case interview or technical skills testing. Nothing out of the ordinary during the process.", "Interview Questions": "Talk through project management and how you dealt with issues."}, {"date": "12 Feb 2021", "title": "Executive Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Northwestern Medicine", "Interview Descriptions": "I think I got the low caliber employee. I applied to a position and got an email asking to set up a time for a call. I did that and she never made it. I called several times, emailed and did not get a response. I set up another time to speak. Again, she missed it. I again, emailed her asking if she was still interested and set up a third time to speak. She was late but made the third call. She seemed disinterested, distracted, couldn’t give a reasonable summary of the dob description. She did give me a timeline of the next steps but I never heard from here again. Not surprised. Waste of time and preparation.", "Interview Questions": "What salary are you looking for?"}, {"date": "9 Feb 2021", "title": "Intern Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Northwestern Medicine", "Interview Descriptions": "hirevue interview in the beginning containing 5 questions. it was not that bad. I think the next process is to interview with hiring manager i am yet to be followed up", "Interview Questions": "questions like why do you want to work here, what makes a good team, how do you stay organized"}, {"date": "31 Jan 2021", "title": "PT Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Northwestern Medicine", "Interview Descriptions": "Pleasant, direct and engaging conversation with me during the 15 min interview. I felt confident in the process afterwards to know what to expect when HR follows up with the potential candidates for the second round.", "Interview Questions": "What did you choose this type of setting right after graduation?"}, {"date": "7 Jan 2022", "title": "Radiologic Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Northwestern Medicine (Deerfield, IL) in Feb 2021", "Interview Descriptions": "It was a good experience even though it was remote. Pretty basic 3 step process. Phone interview, 2 video call interviews. The people that interviewed me were very knowledgeable and courteous.", "Interview Questions": "What drew you to Northwestern Medicine?"}, {"date": "26 Jan 2021", "title": "Student Nurse Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Northwestern Medicine", "Interview Descriptions": "The interview process first consisted of a video interview with 3 questions. Then after I completed the video interview,  I got an email about 3 weeks later that the company wanted to set up an in-person interview. This in-person interview was with a selected track and so I was only able to get a position from that unit directly.", "Interview Questions": "Why do you want to work at Northwestern Medicine?"}, {"date": "17 Jan 2021", "title": "Administration/Management Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Northwestern Medicine", "Interview Descriptions": "Applied Online, HR reached out for phone interview, and forwarded my resume and interview feedback to hiring director... Was invited in person for interview with physicians of the specialities, Operations coordinator and practice manager.", "Interview Questions": "Why do you want to work at Northwestern medicine? "}], [{"date": "18 Jan 2021", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Northwestern Medicine", "Interview Descriptions": "Very easy and not a lot of pressure from the peers! Did not ask the typical interview questions like strength and weakness or what would you did in this scenaro", "Interview Questions": "What would you change about your last job?"}, {"date": "11 Jan 2021", "title": "Social Worker Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Northwestern Medicine", "Interview Descriptions": "I applied online and was contacted a few days later. I did a phone screen that went over the role briefly and I answered questions about my interest. I was then scheduled for an HR and hiring manager interview. At this point this is when things started to get strange. I was asked to provide 5 references which seemed a bit excessive so early on in the process. Then, the day of my HR and hiring manager interview I was told hours before all of a sudden my HR interview was cancelled and needed to be rescheduled. I did the hiring manager interview which consisted of an overview of the position and some questions about my background as it related to the position I applied for. The hiring manager seemed keen on me as a candidate. They talked about the next steps of coming in to see the clinic while throwing out some potential dates/times and doing a peer interview. They confirmed my contact details and said they'd set up the next steps. I wait a week with no follow up. I reach out to the hiring manager then got a cold response saying I'd hear from HR. HR eventually rescheduled my interview after another week of waiting. This is when they did the \"culture fit\" questions which consisted of the typical \"tell me about a time\" questions. The waiting game resumed again for another week till I reached out then was told after a month of this drawn out process that they're no longer interested. It was a very misleading  and long process.", "Interview Questions": "Tell me about a time you had a disagreement with a coworker."}, {"date": "11 Jan 2021", "title": "Analytics Intern Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Northwestern Medicine", "Interview Descriptions": "Recruiter called me and 1) phone interview 2)on-site interview. mostly behavioral interviews. The recruiter/interviewer were very nice people and respectful.  I would love to keep connected with them. Interviewed with them Feb.2020.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "27 Dec 2020", "title": "Clinical Role Transition Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Northwestern Medicine", "Interview Descriptions": "Two phone interviews due to pandemic. Was a little unsure whether they were going to be video or phone, be prepared for phone. Short 15 min interview with hiring manager and education coordinator. Questions ranged from prioritization, to why NMH, to questions about diversity and teamwork. Come prepared with your own questions.", "Interview Questions": "Why NMH, prioritization between 4 patients, what is teamwork, what is diversity, any questions for them."}, {"date": "22 Feb 2021", "title": "Data Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Northwestern Medicine (Chicago, IL) in Dec 2020", "Interview Descriptions": "Asked about database experience, and Healthcare experience.  Met with two separate department heads at the same time for similar positions in different areas.  Met virtually due to ongoing restrictions on being in person.", "Interview Questions": "How much experience do you have in healthcare?"}, {"date": "11 Oct 2021", "title": "Clinical Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. I interviewed at Northwestern Medicine (Chicago, IL) in Dec 2020", "Interview Descriptions": "Interviews were still being held over zoom at the time so that was a downfall but also a bonus. Overall the interview was a pleasant experience. Not much small talk, straight to the point. Heard back from them within the same day.", "Interview Questions": "What is 5x25? (critical thinking question to ensure you don't jump to conclusions)"}, {"date": "6 Nov 2020", "title": "IHR Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Northwestern Medicine", "Interview Descriptions": "Was on the computer due to COVID.  We used Teams and it worked very well without any glitches. I was prepared to have my camera on but we ended up just using the microphone feature. Interview included myself and two others.", "Interview Questions": "What was an obstacle you had to overcome and what did it teach you?"}, {"date": "6 Nov 2020", "title": "Patient Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Northwestern Medicine (Chicago, IL) in Nov 2020", "Interview Descriptions": "They sent a request for a video interview due to covid. I will be taking the interview today . I will update you guys on how this goes. wish me luck!", "Interview Questions": "Tell me about yourself /"}, {"date": "28 Oct 2020", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Northwestern Medicine", "Interview Descriptions": "Video, Phone, & In-person\nHR will contact you if they view your video interview. The video interview is very quick and easy and you are timed and must be prepared to answer questions.", "Interview Questions": "Why do you want to work at NMH?"}, {"date": "5 Oct 2020", "title": "Customer Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Northwestern Medicine (Chicago, IL) in Oct 2020", "Interview Descriptions": "Applied online at Northwestern Medicine's website. After a week I received an email back from them stating the department manager would like to interview me with two other supervisors.", "Interview Questions": "Introduce yourself\r\n\r\nName a time you had to explain something in depth to a patient that had a hard time understanding \r\n\r\nWhy do you want to work for Northwestern Medicine\r\n\r\nWill you be able to commute to work okay every day\r\n\r\n"}], [{"date": "16 Oct 2020", "title": "Patient Care Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Northwestern Medicine (Chicago, IL) in Oct 2020", "Interview Descriptions": "Pretty easy. Applied, received an email for the virtual interview the next week.  Once I did the virtual interview they emailed me exactly 1 week later to do an online interview(covid) with 3 managers. That interview was very relaxed, easy scenario questions, and very informative. *You’re made aware of your salary during the first request for an interview(I really love that process, no guessing)*", "Interview Questions": "Describe a time you and coworker didn’t agree and what was the outcome.\r\nDescribe a time when you had to take the lead.\r\nAll scenario questions. But very quick."}, {"date": "25 Mar 2021", "title": "Licensed Practical Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Northwestern Medicine (Chicago, IL) in Oct 2020", "Interview Descriptions": "After filling out an application on NWM's website and submitting a resume, the interview was conducted over Microsoft teams with one of the floor's managers and one of the nurse educators.  The interview took about 30 minutes total.", "Interview Questions": "Why are you interested in working in the ICU at Northwestern?"}, {"date": "16 Sept 2020", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Northwestern Medicine", "Interview Descriptions": "Online interview process was easy to do. Northwestern Medicine was very organized which made the process run smooth. I applied for the job and got an interview within the same week. Very quick and punctual", "Interview Questions": "Why do you want to work at Northwestern "}, {"date": "2 Feb 2021", "title": "PCT/CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Northwestern Medicine (Chicago, IL) in Sept 2020", "Interview Descriptions": "Due to COVID19 was completely online and over the phone. First started with an online screening where you submit video-recorded answers to specific questions. Then once screening is accepted followed up with an over the phone interview where the manager asked similar questions to the video recorded screening questions.", "Interview Questions": "Q: Name a time you dealt with a difficult patient, how you handled it, and what was the outcome."}, {"date": "11 Aug 2020", "title": "ER RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Northwestern Medicine", "Interview Descriptions": "It was great. First half with higher ups and then second half with a couple RN's from unit to see if i fit. Everyone was so kind but also direct.", "Interview Questions": "Why do you want to work for this hospital?"}, {"date": "6 Aug 2020", "title": "Physician Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Northwestern Medicine", "Interview Descriptions": "Very streamlined and organized! I was impressed with the professionalism of the team, and even though it was by Zoom it was very thorough and punctual. It was definitely one of my better interview experiences.", "Interview Questions": "Focused on my goals for the position and making sure it was a good fit"}, {"date": "1 Sept 2020", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Northwestern Medicine in Aug 2020", "Interview Descriptions": "Applied online, then had emailed with recruiter and had a teams interview with 2 managers of the unit. I was then asked to enter my references, and when I had submitted them, I discovered by smart recruiters page that I was no longer being considered. Overall seemed disorganized and had a lack of communication. Also feel like you need significant RN experience to be considered for a position", "Interview Questions": "Why NW, why this unit, tell us about a time you worked with a group and the outcome, tell us about a disagreement you had with a coworker and how you handled it"}, {"date": "11 Aug 2021", "title": "Patient Access Specialist Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Northwestern Medicine (Winfield, IL) in Aug 2020", "Interview Descriptions": "The interview process is ridiculously long. I have been trying to get into Northwestern for over three years and have had countless interviews. Sometimes they will call you back for a second interview two months later. It comes down to them having time to hire or completely ghosting their applicants. I will be looking elsewhere in the future of healthcare once i achieve my BSN. Nobody deserves this type of treatment just to apply for a job.", "Interview Questions": "\nTell us about a time when you went above and beyond for a patient."}, {"date": "15 Jul 2020", "title": "Regsistered Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Northwestern Medicine", "Interview Descriptions": "The interview process started off with a live timed recording of myself. Next  HR called and reached out to me. The last step of the process was that I had another run person interview with the floor manager.", "Interview Questions": "Name a time I saw a coworker treating staff poorly, and what did I do to correct it."}, {"date": "26 Jul 2020", "title": "Sterile Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Northwestern Medicine (Winfield, IL) in Jul 2020", "Interview Descriptions": "I applied on a Monday, on Wednesday I was contacted to do a phone interview on Friday. On Friday we had the phone interview, Monday I received an email asking for references. After that was complete it took two days to get an offer.", "Interview Questions": "What did you do in the past when you had conflict ?"}], [{"date": "26 Aug 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Northwestern Medicine (Chicago, IL) in Jun 2020", "Interview Descriptions": "Apply online. Then you’ll be asked to do an online self interview where you record your responses. If chosen, you’ll get an in person interview and shadow experience. The time frame between these things is usually a couple of days.", "Interview Questions": "Why northwestern? Why are you interested? How do you handle stress?"}, {"date": "8 Jul 2021", "title": "RN Staff Nurse Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Northwestern Medicine in Apr 2020", "Interview Descriptions": "Phone interview, then in person interview with the unit manager, then notified a week later about the position and if you were able to proceed. Hiring process took about a month.", "Interview Questions": "Describe a time you went above and beyond for someone"}, {"date": "18 Mar 2020", "title": "Patient Service Representative Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Northwestern Medicine", "Interview Descriptions": "First it is a Fairly straightforward online questionnaire, then followed by a easy phone interview. It is a long process where you don’t usually know where you are at which can be hard.", "Interview Questions": "What are five words you would use to describe you "}, {"date": "24 Mar 2020", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Northwestern Medicine (Chicago, IL) in Mar 2020", "Interview Descriptions": "The interview process went fairly quickly - I was able to do an interview via HireVue app on my phone, I scheduled a shadowing opportunity for 8 hours on the unit and then professional interview the following week. All went smoothly - they accommodated my schedule well and were very kind.", "Interview Questions": "Why northwestern?"}, {"date": "5 Mar 2020", "title": "Phlebotomist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Northwestern Medicine", "Interview Descriptions": "The interview process is very smooth, set up the interview with HR, meet with the department supervisor and go through the interview questions. They will be in touch with you within a week.", "Interview Questions": "Phlebotomy procedures"}, {"date": "28 Mar 2020", "title": "Physician Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Northwestern Medicine in Feb 2020", "Interview Descriptions": "2 phone interviews and one longer in-person interview with ~6 different people (always 1 on 1) \r\nThe phone interviews were with administrative people, the in person interviews were physicians and other APPs and 2 nurses", "Interview Questions": "Why northwestern "}, {"date": "9 Aug 2021", "title": "Social Work Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Northwestern Medicine (Chicago, IL) in Feb 2020", "Interview Descriptions": "They only accept second year social work students. I submitted resume and cover letter, phone interview then one  in-person interview, then was offered the position and only had three days to accept", "Interview Questions": "Describe a time where you used problem solving"}, {"date": "30 Jan 2022", "title": "Physical Therapist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Northwestern Medicine in Feb 2020", "Interview Descriptions": "I had a Zoom interview with two interviewers, but I wasn’t told to expect two interviewers at the same meeting. It wasn’t a personable conversation and felt a little drilled on clinical application questions. Generally, the whole interview felt coldly professional- very telling of the culture, in my opinion. \r\n\r\nI would have been moving out of state for the job and expressed the desire to have some buffer time (3 months) to make the transition and they seemed displeased with this. If you are applying as an out of state candidate, it doesn’t seem like they are willing to wait and will pressure you. \r\n\r\nI wasn’t offered the position. After the interview, I wouldn’t have accepted in any case.", "Interview Questions": "I was asked several clinical scenario questions. "}, {"date": "12 Aug 2020", "title": "Clinical Research Coordinator II Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at Northwestern Medicine (Chicago, IL) in Feb 2020", "Interview Descriptions": "Group of 3 people from different departments interviewed for a range of possible roles within the oncology research department. The interview process was around half an hour and they provided some feedback after the interview through my recruiter. The interview took place only a couple of weeks before COVID-19 so the positions were not longer active.", "Interview Questions": "My past experience in clinical research, my project management background, why I wanted to go back into clinical work, what I'm currently focusing on at my current job, where I see myself in 5 years. "}, {"date": "13 Jan 2020", "title": "Diagnostic Radiologic Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Northwestern Medicine", "Interview Descriptions": "Lengthy interview and hiring process. It took about a month to get into my position after job offer, physical, and first day orientation. Lengthy process was well worth it though because I have a great job.", "Interview Questions": "What are your career goals"}], [{"date": "10 Jan 2020", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Northwestern Medicine", "Interview Descriptions": "The interview process was relatively easy. It was a phone interview. The phone interview was just the first round of interviews. The whole interview was only 30 minutes long. The conversation was brief and went by very quickly.", "Interview Questions": "What excited you the most about the position?"}, {"date": "22 Jan 2020", "title": "Clinical Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Northwestern Medicine (Chicago, IL) in Jan 2020", "Interview Descriptions": "Used HireVue initially, then an in-person interview, then waited for the call. It moved quickly and all of the people involved were great. I was new to the downtown environment, as well as using HireVue, but I figured it out quickly and felt very comfortable.", "Interview Questions": "Tell me about a situation when you disagreed with another nurse. How did you handle it?"}, {"date": "10 Mar 2020", "title": "Internship Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Northwestern Medicine in Jan 2020", "Interview Descriptions": "Hirevue video interview is the first step with a on campus interview if you progress to the next round. They ask about different situations and how you would handle them when working with a team, etc. Pretty basic interview questions.", "Interview Questions": "What are your weaknesses/things you need to work on?"}, {"date": "27 May 2021", "title": "Customer Service Representative Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Northwestern Medicine (Chicago, IL) in Jan 2020", "Interview Descriptions": "pretty standard interview process, they ask you about yourself, why you think you fit the job, specific questions about your work background related to the healthcare field. the interviewer was friendly and really passionate about her job", "Interview Questions": "Tell me about a time when you faced a difficult decision"}, {"date": "16 Jan 2020", "title": "Social Worker - LSW Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Northwestern Medicine (Chicago, IL) in Jan 2020", "Interview Descriptions": "The interview was with SEVEN people in one room. It was incredibly overwhelming and very hard to focus on answering questions when 14 eyes are staring at you. Even after that, I never received an email or call about the position or that they were moving on without me. It was just radio silence.", "Interview Questions": "How would you learn what you don't already know about this position?"}, {"date": "28 Nov 2019", "title": "Clinical Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Northwestern Medicine", "Interview Descriptions": "Applied online and received and email to completed a video interview that same day. After completing the video screening, I received a call from HR to set up and shadow day and then an interview with the unit managers.", "Interview Questions": "Tell us about yourself and why Northwestern?"}, {"date": "7 Nov 2019", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Northwestern Medicine", "Interview Descriptions": "I applied for the position on the career site. I was offered a video interview opportunity within one day of applying via email. The video interview was very straightforward and easy to navigate.", "Interview Questions": "Why do you want to work at Northwestern Memorial Hospital?"}, {"date": "6 Nov 2019", "title": "Patient Care Technician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Northwestern Medicine (Lake Forest, IL) in Nov 2019", "Interview Descriptions": "I applied online and received a call back the next week to set up a job interview. The managers were really nice and laid back. They were very informational and helpful with any questions I had. They went into depth about the unit and the orientation. Overall, it was a really good experience but I am still waiting to hear back if I got the job.", "Interview Questions": "Tell me about how you deal with difficult patients."}, {"date": "5 Nov 2019", "title": "Certified Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Northwestern Medicine", "Interview Descriptions": "Its been so long I got hired that I do not remember what kind of process it was. I think I meet with an administrator and a clinical nurse supervisor.", "Interview Questions": "what is my experience "}, {"date": "7 Oct 2019", "title": "Financial Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Northwestern Medicine (Chicago, IL)", "Interview Descriptions": "Received a personalized email to complete a video-based interview. Completed in a timely fashion and never heard back from NW, even after politely following up several times. It is an embarrassment that NW’s talent acquisition team could not take 30 seconds to write an email or leave a voicemail, especially given the hours of preparation and practice for these types of interviews.\n\nThankfully, they added me to a spam email list so I get emails once a week titled “help your friends get great jobs” that I’m not allowed to unsubscribe from. I won’t be interviewing with NW again after that experience.", "Interview Questions": "“Tell me about a time...” type questions."}], [{"date": "30 Oct 2019", "title": "Patient Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Northwestern Medicine in Oct 2019", "Interview Descriptions": "I applied online through the NM career website. Then shortly after recieved an email to complete the Video interview process through HireVu. I hope that my chances aren't slim becasue I've never done a video interview before.", "Interview Questions": "Why do you see yourself working at Northwestern?"}, {"date": "12 Sept 2019", "title": "Patient Access Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Northwestern Medicine (Chicago, IL) in Sept 2019", "Interview Descriptions": "It was a hiring event . I saw the post and applied . Did a HireVue interview . Took a about 3-4 weeks. Called me 2 days before event and sent my invite. Did my interview and was hired on the spot!", "Interview Questions": "Why Northwestern? "}, {"date": "24 Sept 2019", "title": "Administrative Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 4 weeks. I interviewed at Northwestern Medicine (Chicago, IL) in Sept 2019", "Interview Descriptions": "Northwestern Medicine's HR department reached out within 2 weeks of submitting my application, set up an initial phone screening the following week, first round interview the next week and offer a month later.", "Interview Questions": "Tell me about a time you were under a lot of pressure from different stakeholders with demanding deadlines "}, {"date": "5 Oct 2019", "title": "Patient Access Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Northwestern Medicine (Chicago, IL) in Sept 2019", "Interview Descriptions": "I was sent an email to take an interview on hirevue(Ask 5 questions)(3. Min per question).Then weeks later call to do an face to face interview. I went got hire that day", "Interview Questions": "Why do I want to work at northwestern?"}, {"date": "22 Aug 2019", "title": "Patient Care Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Northwestern Medicine", "Interview Descriptions": "Applied online then was asked to submit a video recorded interview. After I submitted my video, was invited to an in person interview. Whole process from initial application to offer took about 1 month. Had opportunity to shadow on unit after in-person interview which I appreciated", "Interview Questions": "Describe a time you went above and beyond for a patient\r\nTell me about a time you made a mistake at work"}, {"date": "14 Aug 2019", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Northwestern Medicine (Chicago, IL)", "Interview Descriptions": "I received a call from HR to set up a meeting with the management team. I went to the hospital, was interviewed briefly, then shadowed a nurse on the floor for approx. 1 hour.", "Interview Questions": "Tell me 3 words your current boss would use to describe you?"}, {"date": "31 Jul 2020", "title": "Clinical Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Northwestern Medicine (Chicago, IL) in Aug 2019", "Interview Descriptions": "shadow for 4 hours with a nurse then interview with manager of the floor. Interview was about 30 minutes long asked about what I liked about northwestern as well as gave me specific patient details and I had to describe what I would do in that situation", "Interview Questions": "why northwestern and why the specific unit"}, {"date": "15 Sept 2019", "title": "Physical Therapist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Northwestern Medicine (Grayslake, IL) in Aug 2019", "Interview Descriptions": "I submitted an application online and received a call back for an interview 2 weeks later. My interview was at the outpatient center in a private office with the director of rehabilitation. Total interview time was about one hour.", "Interview Questions": "What is your favorite type of patient to work with?"}, {"date": "31 Jul 2019", "title": "Clinical Role Transisiton Program- ONCOLOLY and NEURO/ORTHO Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Northwestern Medicine (Chicago, IL)", "Interview Descriptions": "About 70 students form varies contracted Universities were chosen for interviews in various areas at Northwestern. 10 minute interviews were scheduled for each student in two areas that each showed interest in. Everyone was in the same room at the same time interviewing for different units. At the end of the first 10 minute interview students would move to the next interview, until their two interviews were completed.  Each interview had employees from the floor as well as floor managers in attendance. It took about 4 weeks to hear back about placement.", "Interview Questions": "Why Northwestern? \r\nWhy nursing? \r\nWhy are you interested in Oncology? \r\nHow did you handle a disgruntled patient?\r\nExplain a time you were a leader and/or handled conflict?\r\nTime I went above and beyond for a patient? \r\nTime I made a mistake on the floor?\r\nFavorite Clinical experience?  "}, {"date": "11 Jul 2019", "title": "Patient Care Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Northwestern Medicine", "Interview Descriptions": "After 2+ weeks, I got an email asking for a video interview. A week later, I got a phone call asking for an in person interview. After the interview, I was asked to shadow a PCT for an hour.", "Interview Questions": "Where do you see yourself in 5 years?"}], [{"date": "19 Jul 2019", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Northwestern Medicine (New York, NY) in Jul 2019", "Interview Descriptions": "I applied and was asked to do the online interview, I was called the next day to come in for the in person interview. The 2 managers started the interview about 10 minutes late, asked about 4 questions with many moments of silence between questions. I already knew 2 minutes into my interview started I was not a candidate they were looking for based on although I am a RN with a BSN. Very uncomfortable experience. Learn how to treat people who take their time to interview with you.", "Interview Questions": "Why NW?"}, {"date": "26 Sept 2021", "title": "Psychometrist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Northwestern Medicine (Winfield, IL) in Jul 2019", "Interview Descriptions": "Standard interview. Met with the practice manager and then with the Neuropsychologists. Asked me about prior experience, test competency, why I would be a goof fit, strengths and weaknesses, etc.", "Interview Questions": "Which neuropsych tests I was competent on"}, {"date": "10 Jun 2021", "title": "Analyst Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Northwestern Medicine (Chicago, IL) in Jul 2019", "Interview Descriptions": "They made you fell comfortable.  They asked about past experience and how I can contribute to the organization.  They asked what I liked about past job and also dislikes of past employment", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "18 Jul 2019", "title": "RN Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Northwestern Medicine (Chicago, IL) in Jun 2019", "Interview Descriptions": "The first step was an online interview. A question appeared on the screen and you recorded a response.  You had as much time as you needed to prepare an answer to the question, but only one shot to record.  After that, I was asked back for an in-person interview.  The in-person interview was with two people (the unit manager and educator). I was also given the unit tour. Was offered the position two days after the interview.", "Interview Questions": "What would your clinical instructor say is your greatest strength? "}, {"date": "3 Sept 2019", "title": "Clinical Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Northwestern Medicine (Chicago, IL) in Jun 2019", "Interview Descriptions": "Very great interview process - accommodating and understanding.  They really are compassionate and are flexible on hiring new grad RNs and working around your schedule.  I would say it was one of the smoothest interview processes I have ever had.", "Interview Questions": "Why did you choose nursing?"}, {"date": "15 May 2019", "title": "Coding Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Northwestern Medicine (Chicago, IL)", "Interview Descriptions": "First a coding test, then after you passed the coding test, you got to meet with the Coding managers and then asked you a series of questions. They got back  to you in a timely manner.", "Interview Questions": "What kind of coding do you not like?"}, {"date": "5 Jul 2019", "title": "Cerified Phlebotomist Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Northwestern Medicine (McHenry, IL) in May 2019", "Interview Descriptions": "Very long process, I had never had an interview process take quite as long. Know the basics of your position and expect to be quizzed on the basics. Very friendly staff and very knowledgeable on their work and how it would mesh with the work you would be doing in the event of a job offer.", "Interview Questions": "Describe a time you experienced conflict with a coworker, if you had a conflict with a coworker at our institution how would you handle it."}, {"date": "28 May 2019", "title": "Lab Technician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Northwestern Medicine (Chicago, IL) in May 2019", "Interview Descriptions": "Met with 4 people in the department, asked various questions about previous work experiences and gave hypothetical situations to react to. After the interview, they give a tour of the lab and explain the tasks and processes of the job.", "Interview Questions": "How did you respond to and overcome a difficult situation you have faced in previous employment?"}, {"date": "25 Apr 2019", "title": "Pre-Med Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Northwestern Medicine", "Interview Descriptions": "I submitted my application, and they got back to me within two days for an interview. The interview was online and had to be completed before a deadline. I just recorded myself answering the questions that were presented. There was one minute to read the questions and think about the answer and four minutes to respond.", "Interview Questions": "What do you know about Northwestern Medicine?"}, {"date": "19 Apr 2019", "title": "RN Staff Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Northwestern Medicine (Chicago, IL)", "Interview Descriptions": "I applied to the blitz interview. \r\nThere was an online interview first. Then there was an in person interview directly onto the unit.\r\nshort and straight to the point. \r\nThere was shadowing after the interview. \r\nMost of the questions were \"tell me about a time...\" questions.", "Interview Questions": "why northwestern, why nursing?"}], [{"date": "8 Apr 2019", "title": "Patient Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Northwestern Medicine", "Interview Descriptions": "Quick, met with HR and hiring manager all in one day. However, it took awhile to finish the paperwork and recieve a start date. I think the turn around time was almost a month, but it was worth the wait.", "Interview Questions": "Basic personaility questions and experience"}, {"date": "7 Apr 2019", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Northwestern Medicine", "Interview Descriptions": "Applied online and received an email a month later for a digital interview. Two days later received a call for an in person interview and waiting to hear back after shadowing unit.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "3 May 2019", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Northwestern Medicine in Apr 2019", "Interview Descriptions": "I applied online Monday, did an over the phone interview Tuesday, and had an in person interview Friday with the two managers and shadowed a nurse for an hour.", "Interview Questions": "Why Northwestern?"}, {"date": "11 Mar 2019", "title": "Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Northwestern Medicine (Chicago, IL)", "Interview Descriptions": "Good experience, until no one ever followed up with me after my in-person interview. Why not tell candidates they didn’t get the position, or will not be moving forward in the process? I reached out to HR, and still silence. \n\nMany candidates like myself take time off work to interview. A follow-up, even if the position is not being offered, is a common courtesy. Ghosting is unprofessional.", "Interview Questions": "Standard interview"}, {"date": "31 Mar 2019", "title": "Registered Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Northwestern Medicine (Chicago, IL) in Mar 2019", "Interview Descriptions": "The interview process didn’t take long and the managers don’t grill you like some others. They go off your resume and just explain how you are and what you do beat", "Interview Questions": "Tell me something I can take away from this interview that will make you stand out from the rest?"}, {"date": "1 May 2019", "title": "Patient Liaison Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Northwestern Medicine (McHenry, IL) in Mar 2019", "Interview Descriptions": "Met with the hiring manager for first interview for a one on one. Peer interview was with 4 other individuals, department heads  for a 15 minute interview. This process had the top candidates all\r\nInterview", "Interview Questions": "What interested me in the position"}, {"date": "10 Apr 2023", "title": "Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Northwestern Medicine (Chicago, IL) in Mar 2019", "Interview Descriptions": "Very short and easy. They were friendly and kind. They are open to many different people and are great. I had a great time meeting new people there. one two three four five six seven eight nine ten eleven twelve thirteen.", "Interview Questions": "What are your strengths and weaknesses"}, {"date": "14 Feb 2019", "title": "Administrative Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Northwestern Medicine (Chicago, IL)", "Interview Descriptions": "Initial interview was via HireVu online video process where you had to answer about 10 questions and record yourself doing it to submit your answers. Process was easy but different than a typical phone screen. Would recommend watching a practice video online and limit any distractions when recording the interview.", "Interview Questions": "Why do you want to work at NW"}, {"date": "14 Feb 2019", "title": "Social Worker Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Northwestern Medicine", "Interview Descriptions": "Application was straightforward. I heard back from HR very quickly and scheduled an interview within the next week or so. Went in for a group interview (3 on 1) that seemed to went well. Never heard from them again.", "Interview Questions": "Experience based questions with a certain population"}, {"date": "12 Feb 2019", "title": "Executive Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at Northwestern Medicine (Chicago, IL)", "Interview Descriptions": "Video interviews - asked same questions as job application. Waste of time - don’t bother applying here. Incredibly impersonal.  A phone interview or a Skype interview is a more useful tool than this.", "Interview Questions": "Tell us about a time you helped a patient."}], [{"date": "2 Feb 2019", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 1 week. I interviewed at Northwestern Medicine", "Interview Descriptions": "Phone Interview, In person interview with  manager, shadow portion with nurses on the unit, verification process. If hired 6 months preceptorship with several if the nurses.  Attend several classe and in-services", "Interview Questions": "Patient acuity qs"}, {"date": "8 Apr 2022", "title": "Medical Laboratory Scientist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Northwestern Medicine (Chicago, IL) in Feb 2019", "Interview Descriptions": "Started with introductions of interviewers and interviewee. Brief intro about NMH and their labs. Moved to questions based on lab experience and science background. Interviewee was asked why they wish to join NMH and what they hope to gain/bring to NMH. Further questions related to working in a lab and troubleshooting scenarios.", "Interview Questions": "Describe a time when you encountered a problem in the lab, either technical or not, and the process you took to resolve it."}, {"date": "14 Feb 2019", "title": "Certified Occupational Therapy Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Northwestern Medicine in Feb 2019", "Interview Descriptions": "The interview process was great. Two interviewers sat and told me about the company as well as policies and job expectations. We then had a typical back and forth conversation about my experience and qualifications. I felt very comfortable throughout the entire interview.", "Interview Questions": "Tell me a little about yourself. "}, {"date": "4 Mar 2019", "title": "Patient Care Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied through other source. The process took 2 weeks. I interviewed at Northwestern Medicine (New York, NY) in Feb 2019", "Interview Descriptions": "It was really a very unprofessional experience from start to finish.\nI do believe these interviewers are not trained .  It is a very negative impression they give to professional people looking for a job.  I have a very different opinion of Northwestern in Warrenville Il.  after this interview.\nI differently walk away saying , I WOULD NEVER WORK HERE.", "Interview Questions": "what is your weakness?"}, {"date": "21 Jan 2019", "title": "Nurse Extern Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Northwestern Medicine", "Interview Descriptions": "I'm from Michigan and I applied to the nurse externship for the summer term last year (2017). I cannot remember details, but I was extended an interview on the neurology unit in March. The manager was kind. But in retrospect, I wasn't super prepared for the interview and/or to answer the behavioral style questions. I was told I would receive a decision via email or phone call within the next two weeks to notify me either way. However, I received an offer from Duke 2-3 days after my NW Medicine interview, and I accepted that position. I did not receive notification about the initial NW position, but I was emailed several weeks later by another NW recruiter inquiring if I would be interested in interviewing for a nurse extern position on a different unit. Seemed to be a little bit a disconnect.", "Interview Questions": "When did you experience a conflict with another person at work? How did you solve it?\r\nWhat is your greatest strength/weakness?\r\nRecall a time where you made a mistake at work. How did you handle that situation?"}, {"date": "5 Jan 2019", "title": "Patient Liaison Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Northwestern Medicine", "Interview Descriptions": "I was sent an invitation to participate in a video Interview. I am still waiting to hear back from the hiring committee regarding the next steps. In a previous interview for a different role, I was called back for an in person interview following the video interview after two weeks.", "Interview Questions": "Describe your strengths and one weakness."}, {"date": "11 Apr 2019", "title": "Registered Nurse/Clinical Nurse Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Northwestern Medicine (Chicago, IL) in Jan 2019", "Interview Descriptions": "Some phone questions and interview questions. A 1 hour shadow to see how I worked. I had to wear scrubs and follow 2 different nurses. It was a good interview and the shadow went well.", "Interview Questions": "Why NM? Strengths and Weaknesses. "}, {"date": "20 Jun 2022", "title": "PCT Patient Care Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Northwestern Medicine (Winfield, IL) in Jan 2019", "Interview Descriptions": "The managers listened carefully after asking appropriate questions. The managers realize there needs to be a work-life balance and encourage that balance. They were very nice people and competent in their roles.", "Interview Questions": "Please tell us about your experience."}, {"date": "16 Feb 2022", "title": "Analyst Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Northwestern Medicine in Jan 2019", "Interview Descriptions": "Easy hiring process. Not enough professionalism. Takes forever to get back on the process. Not impressed with the hiring process overall. Not recommended for serious candidates\r\nEasy hiring process. Not enough professionalism. Takes forever to get back on the process. Not impressed with the hiring process overall. Not recommended for serious candidates", "Interview Questions": "Experience and skills, about yourself and about the company"}, {"date": "4 Dec 2018", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Northwestern Medicine (Chicago, IL) in Dec 2018", "Interview Descriptions": "Applied online to attend a  nurse hiring event in November. After submitting my resume, I was asked to do a phone screening interview. They got back to me a week later and said that I was accepted. At event, I met managers from many different floors. Got a call a few days later saying they wanted me to shadow the floor and interview.", "Interview Questions": "tell me about yourself?"}], [{"date": "3 Feb 2019", "title": "New Graduate Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Northwestern Medicine in Dec 2018", "Interview Descriptions": "It was not bad. They ask a lot of behavioral questions. They asked me to shadow the unit for two hours. The manager seem pleasant. It was a panel interview include: nurse manager, charge nurse and peer review", "Interview Questions": "Tell me a time you have a difficult patient. "}, {"date": "8 Nov 2018", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Northwestern Medicine (Chicago, IL)", "Interview Descriptions": "Interview was done by three women for the L&D unit. Very intimidating to be in a small room with three higher-up women asking you difficult questions... It was my first interview outside of nursing school but still difficult", "Interview Questions": "Name a time someone has given you constructive criticism and how you’ve taken it"}, {"date": "11 Dec 2018", "title": "Nurse Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Northwestern Medicine (Chicago, IL) in Nov 2018", "Interview Descriptions": "Process took a total of 4 weeks. First completed an online interview with HireVue then received a call from HR a few days later. I then scheduled a day to shadow the unit for a full 8 hours followed by an in person interview one week later.", "Interview Questions": "Why do you want to work for Northwestern?"}, {"date": "3 Oct 2018", "title": "Patient Access Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Northwestern Medicine (Chicago, IL) in Oct 2018", "Interview Descriptions": "Not hired yet, I did a virtual inveiw was a little stressful, but just be honest in your answers and look at the screen while talking, dress professional and use proper English, they contact you via email throughout the process leading up to the intial interview", "Interview Questions": "What can you bring to this position?"}, {"date": "6 Dec 2018", "title": "Value Analysis Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Northwestern Medicine (Chicago, IL) in Oct 2018", "Interview Descriptions": "I began the process of interviewing for this position in late-October. My direct contact was a member from the team who I met with for my first interview. Following this interview I met the Value Analysis and Strategic Sourcing team in a final interview. This final meeting consisted of 30-minute interviews where I met 9 people within 3 hours. The team did not follow-up within a reasonable 1-week timeline. I followed up 2 times, both with the Director and HR contact to inquire about the position. After my final interview and follow-up I waited 3-weeks.", "Interview Questions": "Give me an example for when you worked with imperfect data and how you work in these situations?"}, {"date": "29 Oct 2018", "title": "Clinical Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Northwestern Medicine in Oct 2018", "Interview Descriptions": "Process was fairly easy. Phone call, followed by digital interview a few days later. After that, an interview in person as well as job shadow. One week after interview, called with offer.", "Interview Questions": "Digital: Tell me about yourself. Why NM? Why this unit? Tell about a time you encountered a difficult patient and how you handled it. In Person: Went down resume. Tell me about the nursing program you graduated from. Describe immersion and the patient population you cared for."}, {"date": "11 Oct 2018", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Northwestern Medicine (Chicago, IL) in Sept 2018", "Interview Descriptions": "Initially submitted my application and was then contacted to complete a video interview 3-4 days later. After submitting my video interview, I was contacted by HR to come in for an in person interview.", "Interview Questions": "Describe a time you advocated for a patient "}, {"date": "5 Aug 2018", "title": "Nursing Hiring Event Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Northwestern Medicine (New York, NY)", "Interview Descriptions": "Had to use Hirevue, an interview app. This was a negative experience for me, because I did it on my phone completely and the app didn't submit my videos correctly, so I had to redo the whole interview again a day later. I did like the idea of the app though, video question prompts.", "Interview Questions": "status of your license"}, {"date": "2 Sept 2018", "title": "Security Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Northwestern Medicine (McHenry, IL) in Aug 2018", "Interview Descriptions": "2 interviews went well. One with Director and HR then with Peers. I was actually called and had a phone screening first with HR. I was then invited back for an interview with the Security Director and HR. After about a week I was scheduled to speak with three security officers to see if I would be a good fit. Within another week I was given an offer and excepted.", "Interview Questions": "Explain a situation I had to overcome with a co-worker"}, {"date": "4 Aug 2018", "title": "Registered Nurse Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Northwestern Medicine (Chicago, IL) in Aug 2018", "Interview Descriptions": "Applied online for a hiring event that I found on the Hospital website. After completing the application, I received an email 1 day later asking to do a digital interview. The interview had a total of 8 questions. You had 30 sec to read the question and 3 minutes to answer it. You are also given 3 practice questions if you choose to practice before the actual interview. Once you do the actual interview you can not go back and change your answers.", "Interview Questions": "Name a time you had to deal with an unhappy patient, family member, or coworker and how you handled it. "}], [{"date": "25 Jul 2018", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Northwestern Medicine", "Interview Descriptions": "I did the video interview it was 8 basic questions, why do i want to work there? how i handle conflict? when can i start? describe a time i went above and beyond for a patient? etc then I got a phone call a few days later to set up an in person interview, in person interview was with the floor manager and 2 other nurses (they had important postitions like education and clinical coordinator) in the same room, the questions were similar to those of the video questions, they asked about things on my resume (volunteer, previous work experience) etc, then they explained things about their floor and asked if i had any questions. the interview took about 35 minutes then I shadowed a nurse for 1 hour. The experience was very great overall but that was a few days ago and I have not been given a response (yes you got the job or no you did not get the job) I am hoping for the best", "Interview Questions": " why do i want to work there? "}, {"date": "23 Jul 2018", "title": "Social Woker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Northwestern Medicine", "Interview Descriptions": "Received email from manager of Social Work Dept to schedule an interview. The following week I had the interview with the manager, clinical lead, and the social work team. A lot of situational and background questions, not too difficult.", "Interview Questions": "How do you handle ethical dilemmas"}, {"date": "16 Jul 2018", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Northwestern Medicine", "Interview Descriptions": "Applied online for position.  Received an email within a week  to participate in a video  interview (recorded not real time).  3-4 days later, received phone call from HR to schedule an in-person interview with unit clinical manager and other staff members plus possibly shadow the unit (if offered at time of interview).   Had the in-person interview then got the opportunity to shadow the unit for 1-2 hours.    Received an official offer via phone call from HR 1-2 days later.   Accepted.", "Interview Questions": "Where do you see yourself in 5 years? \nHow would you contribute to our team? \nOne clinical situational question."}, {"date": "16 Jul 2018", "title": "Patient Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Northwestern Medicine", "Interview Descriptions": "I applied online and after few days got an email to take the interview online through the app Hirevue. I thought the application process itself was easy to navigate and managable. I haven't heard back yet but I hope to get in as  I am extremely excited to start the job.", "Interview Questions": "One conflict and how did you handle it? "}, {"date": "13 Aug 2018", "title": "RN Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Northwestern Medicine (Chicago, IL) in Jul 2018", "Interview Descriptions": "Applied online for the hiring event they are having Aug 15.  The  following day I received the email to take the video interview.  You have to answer questions and record yourself.  FYI you can not re-record yourself.  This felt very impersonal and uncomfortable.  It’s been a week and I have not heard from them.", "Interview Questions": "Why do you want to work for Northwestern. "}, {"date": "1 Apr 2019", "title": "Patient Access Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Northwestern Medicine (Chicago, IL) in Jul 2018", "Interview Descriptions": "It was quick and easy. Three people interviewed me at one time and it was question after question no time to think of your response but it was the typical interview questions. The three managers were so nice. Over all, it seems overwhelming but it’s not.", "Interview Questions": "Previous time you handled a Irate situation."}, {"date": "5 Jul 2018", "title": "Customer Service Coordinator Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Northwestern Medicine (Chicago, IL) in Jun 2018", "Interview Descriptions": "I was an internal candidate.  I still had to go through the first step of a HireVue video \"interview\", which is incredibly off-putting, demeaning, impersonal, I could go on for ages.  However, I was quickly contacted for an in-person interview.  The interview went well, and within a week I received a verbal job offer.  At this point it became clear to me that the recruiter had not been forthcoming about some important details, so I asked for some additional information.  Never heard back from the recruiter.  Guess I asked too many questions.\r\n\r\nDid not realize that applicants (including internal applicants) are treated so poorly.  My experience was vastly different when I was first hired.  This particular experience has made me seriously reconsider my future with this organization.  I was given the runaround by HR/recruiters.  It's a shame because the actual staff members I met with seemed wonderful.  It's just the bureaucratic process that ruins everything.  \r\n\r\nI would recommend NM for people who want to get a job and then stay in that same job for years and years.  I would not recommend NM for anyone who wants to actually develop skills, grow with the company, etc.", "Interview Questions": "Standard stuff--why are you a good fit for this position, why are you interested in this position, how do you handle difficult situations/co-workers, etc."}, {"date": "29 May 2018", "title": "Infusion Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Northwestern Medicine (Chicago, IL)", "Interview Descriptions": "Once submitted application, interview was quick. Intreview with 3 people and they are all asking questions. They were looking for experience with chemotherapy.  It is a busy clinic. Want you to juggle the busy patients.", "Interview Questions": "One word to describe yourself"}, {"date": "15 May 2018", "title": "Pharmacy Technician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Northwestern Medicine", "Interview Descriptions": "I filled out an application online on their website just via simple job search. I got an email informing me on details for a video interview, which I thought was the most difficult part. Then received a phone call confirming the in-person interview date and time.", "Interview Questions": "Directer was so sweet, she mainly asked about past experiences from my resume."}, {"date": "12 Jun 2018", "title": "Certified Medical Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Northwestern Medicine (Oak Park, IL) in May 2018", "Interview Descriptions": "I Received an email by the hiring manager to set up a face to face interview.Interviewed with the practice manager and a peer for about 30 mins.  After that interview I received an email to send 5 references. Then about a week later was asked for a 2nd interview to meet their practice owner of the facility. After meeting him I did not get a good impression.  He kept saying he didn't need a bilingual person and that he saw at his office was more polish speaking patients.  I felt discriminated. Hope it doesn't happen to any one else. After that couple days later I got an email that there going to go with other candidates. They wasted my time thank you north west medicine clear skin dermatology.", "Interview Questions": "Experience with dermatology?"}], [{"date": "24 May 2018", "title": "Physical Therapist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Northwestern Medicine (Chicago, IL) in May 2018", "Interview Descriptions": "I was contacted via email and instructed to complete a virtual interview with my laptop or smartphone. It consisted of 5 questions with 3 minutes to answer each. The email said the hiring staff would review my answers and contact me if I were to proceed further in the process.", "Interview Questions": "Describe a difficult patient you dealt with."}, {"date": "16 Jun 2018", "title": "Pct Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Northwestern Medicine (Chicago, IL) in May 2018", "Interview Descriptions": "Video Interview - 30 sec to prepare, 3 min to answer for the video answer in the interview, mainly focused on previous experience and how that applies; there were a few written questions interspersed as well about availability", "Interview Questions": "availability and previous experience"}, {"date": "26 May 2018", "title": "Pct Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Northwestern Medicine (Chicago, IL) in Apr 2018", "Interview Descriptions": "I applied on a Sunday. Got the email inviting me for the video interview. I downloaded that app to my phone and did it right away. An hour later I received a call inviting me for a in person interview the next day. The hiring manager was sticky sweet and answered all of my questions that I had. The day after the interview I received an email asking for my 5 references. It took a week and a half after the reference email was submitted to get a call to come in for shadowing to see if I liked the unit. I went in on a Wednesday and got a offer email on Friday. I was able to negotiate my salary because on my application they ask what your minimum requirement is. They came in offering lower than my requirement but I countered the salary and got what I asked.", "Interview Questions": "Name a time that you didn't perform to your fullest potential and what did you learn from it "}, {"date": "21 Apr 2018", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Northwestern Medicine (Chicago, IL) in Apr 2018", "Interview Descriptions": "VIdeo process was easy. 8 questions on various topics. There are some practice questions you can do beforehand to get familiar with the process. Some questions were where do you see yourself in 5 years? What unit would you like to work on?", "Interview Questions": "Why do you want to work at NM?"}, {"date": "22 Aug 2019", "title": "IT Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Northwestern Medicine (Chicago, IL) in Apr 2018", "Interview Descriptions": "Hirevue, then two phone calls with managers and team. They asked mainly about my time at school and what I am looking for at Northwester Medicine. Just be yourself and be honest. They have a great team and are looking to help you succeed.", "Interview Questions": "What makes you qualified for this postion"}, {"date": "8 Jul 2021", "title": "Patient Transporter Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Northwestern Medicine (Winfield, IL) in Mar 2018", "Interview Descriptions": "Interview process flowed smoothly.  I received a call from HR and the interview was set a week later. During that time the supervisor of my soon to be new department was very good about staying in touch via email and making sure any questions I had were answered. After I was hired, very good communication was maintained from HR and even the orientation was effective and efficient. It was a great experience.", "Interview Questions": "How would you interact with a patient that has a hard time hearing or comprehending?"}, {"date": "26 Oct 2018", "title": "Clinical Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Northwestern Medicine (Chicago, IL) in Mar 2018", "Interview Descriptions": "Interviewed for a position in March and did not hear back until May, this may be because I am a new grad...but the application and interview process is very long!", "Interview Questions": "Tell us about a time you made a mistake and what you did to fix it"}, {"date": "7 Feb 2018", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Northwestern Medicine (Chicago, IL)", "Interview Descriptions": "First you have to submit a video resume, then phone screen with HR, in-person interview and then 3 hour shadowing. It is a relatively long process but the interview was very pleasant, professional and comfortable. I got the offer 4 days after the in person interview.", "Interview Questions": "Why do you want to work here, What's your long term plan/goals, what can you contribute to the team"}, {"date": "25 Feb 2018", "title": "Clinical Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Northwestern Medicine (Chicago, IL) in Feb 2018", "Interview Descriptions": "The interview with management from start to finish was about 30-40 minutes. All 3 managers were kind and easy to hold conversation with. They all asked for a copy of my resume, thank goodness I brought plenty! I was glad I asked them several questions at the end, they responded well to that.", "Interview Questions": "Tell me about yourself "}, {"date": "21 Feb 2018", "title": "Staff RN Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Northwestern Medicine (Chicago, IL) in Feb 2018", "Interview Descriptions": "Everything took about 2 weeks from when I applied. First I did the video interview, which had about 9 questions such as Tell us about yourself, Why do you want to work for NMH.. etc. I was contacted by HR for an unperson interview maybe a week after, went to the interview and interviewed with the unit manager, charge nurse, and nurse educator. Overall, I gave it a negative review because the interview was very rushed. Maybe 15 minutes long. The HR was pretty unorganized and I had to keep calling them to make sure the interview was still happening.", "Interview Questions": "Why do you want to work on this unit? Describe a situation when you had to give constructive criticism/when you had to receive constructive criticism? Are you a team player? What is your weakness? "}], [{"date": "11 Feb 2019", "title": "PCT/PSC Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 months. I interviewed at Northwestern Medicine (McHenry, IL) in Feb 2018", "Interview Descriptions": "There were more collaboration than safety questions. I was expecting the opposite. They want to know when you would ask for help, if you are willing to work in a group.", "Interview Questions": "Describe a time where you had to go up the chain of command. How did you handle the situation?"}, {"date": "18 Jan 2018", "title": "Clinical Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Northwestern Medicine", "Interview Descriptions": "Applied for the job and within 3 days I received a request to do the video interview. A couple days later I was asked to come in for the in person interview. I sat with both the managers on the unit for about 20 minutes, then I went and shadowed a nurse on the unit for 45 minutes. It was a very positive experience, everyone was very nice and welcoming.", "Interview Questions": "Tell us something fun about yourself"}, {"date": "22 May 2018", "title": "Financial Assessor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Northwestern Medicine (Schaumburg, IL) in Jan 2018", "Interview Descriptions": "I applied online and received an email a week later for an in person interview. Interview consisted of me meeting with the hiring manager and then a peer interview. I received a call 1 week later with a job offer. After the offer, required to do a thorough background check and drug test/physical.", "Interview Questions": "Name a mistake you’ve made"}, {"date": "6 Dec 2017", "title": "Outreach Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Northwestern Medicine (Chicago, IL) in Nov 2017", "Interview Descriptions": "Applied online.  One week later, received invitation to complete virtual interview through Hirevue App.  Average behavioral interview questions...some unrelated to job description.  Received email from recruiter stating other candidates were being considered.", "Interview Questions": "How do you handle adversity?"}, {"date": "5 Mar 2018", "title": "RN Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Northwestern Medicine (Chicago, IL) in Dec 2017", "Interview Descriptions": "I applied for an RN position and got the email to complete an online/digital interview that took about an hour.  A total of 8 questions that were pretty basic. I waited 2 weeks to hear back from HR and did not hear anything. I had to call them to find out if I landed the in person interview or not.", "Interview Questions": "I did not expect the question pertaining to my qualifications.\r\nOther than that, they were pretty basic questions such as where do you see yourself in 5 years, why NW, and and a patient priority scenario"}, {"date": "19 Nov 2017", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Northwestern Medicine (Chicago, IL)", "Interview Descriptions": "Very Straightforward. The first interview was through HireVue and honestly, you should really nail this. Most people are going to have similar skills but they want to see confidence, cultural fit, and the ability to articulate yourself. I was invited for a second interview shortly after and the second interview was very conversational and laid back. I don't know if it was my experience or background but I was never really grilled on hardcore IT concepts. You're interviewing with the department manager for certain team and its really to see how you can be an asset/fit to their team. Be familiar with the company values, have some experiences you can elaborate on, humor goes a LONGGG way, don't be arrogant and you should be fine.", "Interview Questions": "Why NM? If a (Silicone Valley Company) offers you a job and so does NM, who will you choose? "}, {"date": "29 Dec 2017", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Northwestern Medicine (Chicago, IL) in Nov 2017", "Interview Descriptions": "Applied for a hiring event online through their careers portal. A recruiter had touched base about confirming availability to attend the event. At the hiring event itself, interviewed in a ballroom with several tables with different managers representing different floors and units. Quick short interviews with a sort of \"speed dating\" vibe and then was asked to shadow on 2 floors. 2 weeks after the interview, a recruiter touched based and asked me to come in for another interview/shadow with a different floor. Got word that I was hired the next day and began the process.", "Interview Questions": "Where do you see yourself in a year, 5 years?"}, {"date": "17 Nov 2017", "title": "Certified Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Northwestern Medicine in Nov 2017", "Interview Descriptions": "Completed online interview video/ following week HR requested interview/ did interview and I was asked general questions ( environment wasn't stressful)/ HR got back to me right after interview/ 5 References were required to complete email surveys online/ Job Offer", "Interview Questions": "How would you handle a upset patient or a stressed out Doctor?"}, {"date": "16 Jan 2018", "title": "Certified Pharmacy Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Northwestern Medicine (Chicago, IL) in Nov 2017", "Interview Descriptions": "Had a video interview with them first very simple process read the question and record your answer they even give you a practice run on each question. After that there's a short skill check quiz. Then a few weeks later I got called in for an in person interview.", "Interview Questions": "What made you want to work for northwestern?"}, {"date": "18 Apr 2018", "title": "Patient Access Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 1 week. I interviewed at Northwestern Medicine (Carol Stream, IL) in Nov 2017", "Interview Descriptions": "Asked scenario based questions to gauge your overall temperament and if you work well under pressure. The rest of the questions just gauged your communication abilities, experience and fit with the company culture.", "Interview Questions": "How would you deal with patients that are angry or unhappy?"}], [{"date": "17 Oct 2017", "title": "Patient Engagement Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Northwestern Medicine (Chicago, IL)", "Interview Descriptions": "Disorganized with HR - had several people contacting me with overlapping requests. Department communication however was great. Interviewers were respectful and kind - very welcoming. They had answers to all my questions and helped me understand the role I would be undertaking - they didn't just grill me on my qualifications.", "Interview Questions": "The role doesn't involve as much patient-interaction as come candidates would hope - are you okay with that? "}, {"date": "4 Dec 2017", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Northwestern Medicine (Chicago, IL) in Sept 2017", "Interview Descriptions": "Applied for the position online. I was contacted for a video interview about a week later via email. Then I was asked to come in for an in person interview. Met with the manager and a floor nurse for about 30 minutes, then was asked to shadow on the floor for about 30 minutes (they asked me to bring a pair of scrubs to change into", "Interview Questions": "Why do you want to work for Northwestern Medicine?"}, {"date": "8 Sept 2017", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Northwestern Medicine", "Interview Descriptions": "I was interviewed by the hiring manager. I was told to bring scrubs to shadow in clinical area.  Afterwards I went to HUman Resources for more interviewing and paperwork.", "Interview Questions": "Describe a time you and a coworker had a disagreement or argument.  How did you handle that?"}, {"date": "6 Aug 2017", "title": "Patient Care Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 3 weeks. I interviewed at Northwestern Medicine", "Interview Descriptions": "Virtual interview (where you video record responses to preset questions) then recruiter called me to set up interview with unit manager in person. After that interview I got a callback about a week later with the job offer.", "Interview Questions": "how do you deal w/ difficult patients"}, {"date": "29 Sept 2017", "title": "Call Center Representative Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Northwestern Medicine in Sept 2017", "Interview Descriptions": "I do not like how the first step in the interviewing process is always the electronic interview where you are asked a series of questions and the webcam will record your responses. I would rather have an in-person interview.", "Interview Questions": "How does your background fit this role?\r\nWhat are your strengths? \r\nAre you able to work in a high-volume stressful environment?\r\nDescribe a time where you were in a difficult situation."}, {"date": "8 Oct 2017", "title": "Cytogenetic Technologist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Northwestern Medicine in Sept 2017", "Interview Descriptions": "Was asked to participate in an online video where a series of questions come up on screen and you have about 2 minutes to answer it before a next question comes up", "Interview Questions": "What would you do if you got a critical lab value?"}, {"date": "28 Aug 2017", "title": "Program Associate Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Northwestern Medicine (Winfield, IL) in Aug 2017", "Interview Descriptions": "Applied online - received video interview request 1 month later - received email for an interview with hiring manager 1 month later - then received rejection email 1 week later", "Interview Questions": "What made you apply for this job based on the job description?"}, {"date": "20 Feb 2021", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. I interviewed at Northwestern Medicine (Chicago, IL) in Aug 2017", "Interview Descriptions": "Details on role were limited as usually they just someone who can manage a schedule and then they give more responsibilities when tryst is established. Lots of hypotheticals and character questions.", "Interview Questions": "Name a time when you had to overcome a challenge? What’s your biggest strength and weakness? "}, {"date": "6 Nov 2017", "title": "Front End Developer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Northwestern Medicine (Chicago, IL) in Jul 2017", "Interview Descriptions": "Process is very slow,  first round - HireVue self video interview, they came up with a feedback after a month. Then a face to face round in Winfield-discussing my resume, cultural fit to the team, job requirements, Some technical questions on Javascript and CSS, again a month for the feedback and next round scheduled with rest of the team in Chicago Campus, they gave me an impression that I almost cleared the interview and the rest of the team wants to meet me. Lead and director took  the interviews individually for 30 min each. They told me in the interview that they liked me and are happy to bring me into the team.\r\nBut after a 2 weeks or so, i started sending them emails about the next steps and after another 2 weeks, they just sent me an automated email saying, they are moving forward with other candidates. \r\nThey din't even care to give a feedback as soon as they decided, even after i invested 3.5 months of my time on their interview process.", "Interview Questions": "Behavior Oriented, technical javascipt"}, {"date": "4 Aug 2017", "title": "Physical Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Northwestern Medicine (Chicago, IL) in Jul 2017", "Interview Descriptions": "Group interview  with mangers.  Casual format.  Description of job. Conversational . Low pressure. Easy to schedule the interview. On-line personality test at home prior to interview.", "Interview Questions": "Why should we hire you?"}], [{"date": "3 Aug 2017", "title": "Medical Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Northwestern Medicine (Chicago, IL) in Jul 2017", "Interview Descriptions": "Performed an online video interview and was contacted  within 3 weeks to perform an in person interview.  The interview was pretty basic and not difficult.  People were very nice and grounded.", "Interview Questions": "How would you respond to receiving a critical value?"}, {"date": "25 Nov 2017", "title": "CRT Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Northwestern Medicine (Chicago, IL) in Jul 2017", "Interview Descriptions": "The nursing school you are attending generally informs you about the CRT Program. You will be instructed to complete a Northwestern CRT application online. Once completed, I heard from them through email and they gave me a schedule for the interviews. The blitz interview gives you an opportunity to interview with your top two unit choices. You only get 10 minutes per interview, which is not much time but enough for them to gauge your interest.", "Interview Questions": "Why are you interested in Northwestern? "}, {"date": "19 Mar 2018", "title": "ATC Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. The process took 3 months. I interviewed at Northwestern Medicine (Warrenville, IL) in Jul 2017", "Interview Descriptions": "Online interview that consisted of 10 questions that had to be recorded. Panel in person interview followed, that lasted about 30 minutes.  In person interview was casual. There was about a 2/3 month time period between the online and the in person interview.", "Interview Questions": "How do you handle conflict at work?"}, {"date": "21 Aug 2017", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Northwestern Medicine (Chicago, IL) in Jul 2017", "Interview Descriptions": "Had an online video interview through Northwestern's talent acquisition program scheduled about 2 days after I applied for the job. The hiring manager contacted me about a week later to schedule and in person interview as well as an clinical skills interview", "Interview Questions": "Why do you want to work at northwestern?"}, {"date": "5 Aug 2017", "title": "Medical Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Northwestern Medicine (Chicago, IL) in Jul 2017", "Interview Descriptions": "I had applied and within a week, I was invited to an interview. I attended 4 interviews with various departments and still no offer. Everything that they want in a Medical Assistant, I qualified for. Im starting to believe it really is about who you know and not your skills and experience.", "Interview Questions": "They asked me about my past experiences."}, {"date": "19 Jul 2017", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Northwestern Medicine (Chicago, IL) in Jul 2017", "Interview Descriptions": "I applied online to various open positions for a Registered Nurse. The following day they asked me to do a video interview. I completed the video interview, and twenty minutes later I got an email from HR asking me to come in for an in person interview. I'm going to Chicago tomorrow for the in person interview.", "Interview Questions": "What do you think you can bring to Northwestern?"}, {"date": "6 Jul 2017", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Northwestern Medicine (Chicago, IL) in Jun 2017", "Interview Descriptions": "Applied online, had a video interview with around 15 questions, was emailed a couple hours after submitting the video interview inviting me for an in person interview the following week.", "Interview Questions": "Tell me about a conflict you've had in the work place"}, {"date": "16 Jun 2017", "title": "Patient Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Northwestern Medicine in Jun 2017", "Interview Descriptions": "Very pleasant & straightforward. Interviewed by two, basic qualifying questions. Then peer interview , answered more questions regarding confidence to getting job task done and team work experience and how you deal under special circumstances. I also got a tour of the area I'd be working in. Then told HR would call for new hire proceedings if I was indeed selected.", "Interview Questions": "How do you deal under stress? \r\n"}, {"date": "27 May 2017", "title": "Financial Systems Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "The process took 5 days. I interviewed at Northwestern Medicine", "Interview Descriptions": "Persistent contact for interview and wasn't interested. I interviewed in the past. They wanted techno functional which clearly on my resume I did not have technical nvision or sql experience. I had limited experience. Nonetheless the hiring manager told me he was willing to overlook due the extensive background I have during phone interview. Went in for in person interview and was still asked about my techno side. Shortly after I get a call back saying the hiring manager needs techno functional. You wasted my time and \nyours. READ RESUMES!! Pay attention to phone interviews. There is a reason this position is still open. Got a better deal after.", "Interview Questions": "Do you have nvision experience."}, {"date": "9 May 2017", "title": "Clinical Fellow Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Northwestern Medicine", "Interview Descriptions": "Lots of interviews with faculty members. Some were really intense. Some were really laid back. It all depends on your field and specialty. It was a very long day! We had lunch as well.", "Interview Questions": "What do you want to do with your career. "}], [{"date": "20 Jun 2017", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Northwestern Medicine (Chicago, IL) in May 2017", "Interview Descriptions": "After completing an online recorded video interview, I was offered an in-person interview on the general medicine floor. They took about 20 minutes to ask interview questions before letting me shadow a nurse on the floor for about 30 minutes.", "Interview Questions": "Why northwestern?"}, {"date": "31 Aug 2017", "title": "Regional Director of Operations Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Northwestern Medicine (Chicago, IL) in May 2017", "Interview Descriptions": "The interview was a video recorded interview.  The interview question would pop up on the screen. You had 30 seconds to read and understand the question. After 30 seconds, the camera would automatically start recording. You had 2 minutes to answer the question.  At the end of 2 minutes, the recording would automatically stop and the next question would pop up.", "Interview Questions": "What does your background and experience make you qualified for the position?"}, {"date": "31 May 2017", "title": "Clinical Practice Clerk Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 days. I interviewed at Northwestern Medicine (Chicago, IL) in May 2017", "Interview Descriptions": "It was different, but exciting. I hadn't interviewed in a long time, and I was scared and very nervous. But I think that I did a good job being that I hadn't interviewed in a while.", "Interview Questions": "Tell them about a time about a time I went above and beyond."}, {"date": "28 Sept 2017", "title": "Clinical Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Northwestern Medicine (Chicago, IL) in May 2017", "Interview Descriptions": "I applied online, and got a call to schedule an interview a few weeks later. I had my interview with the nurse manager and the clinical coordinator on the unit, and heard back with a job offer about 3 days later.", "Interview Questions": "Clinical scenario"}, {"date": "21 May 2019", "title": "Anesthesia Technician Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Northwestern Medicine (DeKalb, IL) in May 2017", "Interview Descriptions": "Called back months later for position, did one interview with hiring manager and one peer interview. I was required to shuttle into Chicago for an entire day to listen to a seminar regarding core values and beliefs of the company", "Interview Questions": "Why I chose to be an anesthesia tech"}, {"date": "31 Mar 2017", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Northwestern Medicine", "Interview Descriptions": "Applied online and received an email to complete a virtual interview. The virtual interview consisted of 6-8 questions and was pretty straight forward. Days later, I was emailed to come in for an in person interview. I received a tour of the facility, shadowed for about 1-2 hours, and later interviewed with the unit managers. I received a call the next day from HR with an offer.", "Interview Questions": "Name a time you made a mistake and how you fixed it."}, {"date": "25 Apr 2017", "title": "Intern Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Northwestern Medicine in Apr 2017", "Interview Descriptions": "The interview was online through HireVue and I am currently waiting to hear back - they said about a month for a response.  Questions were fair and relatively easy/straightforward, as long as you prepared. Hoping to hear back soon.", "Interview Questions": "Why do you want this internship?"}, {"date": "21 Apr 2017", "title": "Pharmacy Technician Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Northwestern Medicine (Lake Forest, IL) in Apr 2017", "Interview Descriptions": "Interview and took exam on pharmacy math. Met with pharmacy manager and other pharmacist they asked typical interview question go over the exam. The test is 10 questions the include converting mg to g and word problems.", "Interview Questions": "Are you certified"}, {"date": "17 Mar 2017", "title": "Cytogenetic Technologist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Northwestern Medicine", "Interview Descriptions": "They want you to record yourself answering interview questions with audio and video. You get one chance to answer each question and only thirty seconds to think of an answer before it starts recording.", "Interview Questions": "Describe how you handled a conflict with a coworker. "}, {"date": "12 May 2017", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Northwestern Medicine (Chicago, IL) in Mar 2017", "Interview Descriptions": "I had a phone and in-person interview with a panel of nurses from that unit. The second interview was a ten minute blitz for new grad nurses and was informative, followed my orientation to the floor.", "Interview Questions": "What skills do you have that apply to this unit?"}], [{"date": "10 Mar 2017", "title": "Northwestern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Northwestern Medicine", "Interview Descriptions": "First did an video interview. Then Got called in for interview then got second interview in the same week. Then a day later got the job. Each interview was with 2 people. We're very nice and professional.", "Interview Questions": "What do you bring to this position?"}, {"date": "5 Apr 2017", "title": "Medical Biller Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Northwestern Medicine (Chicago, IL) in Mar 2017", "Interview Descriptions": "Short, impersonal, standard cookie cutter HR personalities based questions. It's more about your personality than your skills. Skills matter as much as personality does! Should be equally focused. Step-ford wife process", "Interview Questions": "How did you handle a difficult co-worker?"}, {"date": "22 Jul 2017", "title": "Project Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Northwestern Medicine (Chicago, IL) in Mar 2017", "Interview Descriptions": "I received an e-mail from HR to schedule a 20-minute phone interview and then had a phone screen with the hiring manager. The next day, I received an e-mail from HR to invite me to an on-site interview and requested a few dates within the next couple weeks to meet in-person. I submitted a few dates about 4 days later and didn't receive a response for about 2 weeks. I then received an e-mail stating that the hiring manager decided to interview in-house candidates first. I never received an update.", "Interview Questions": "Why are you interested in this job?"}, {"date": "12 Jan 2017", "title": "Patient Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Northwestern Medicine", "Interview Descriptions": "I started with an Online application. Then Video recorded interview through and external application. They asked you questions and it recorded you. Then got called for an in person interview with a manager.", "Interview Questions": "Introduce yourself and why do want a career at Northwestern?"}, {"date": "10 Feb 2017", "title": "Senior Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at Northwestern Medicine", "Interview Descriptions": "Timed video recorded interview done online. As well as in person interview with the manager and the finance director. Interview lasted two hours. General questions were asked like what makes you a good candidate.", "Interview Questions": "Why should we hire you?"}, {"date": "2 Feb 2017", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Northwestern Medicine", "Interview Descriptions": "Got a call from HR to come in for interview. I was asked the basic/standard questions. It was very quick. I showed up, I spoke with a few people- they showed me around and offered me the position.", "Interview Questions": "Name a time when you had to deal with a difficult co-worker and or patient -Tell us how you handled it."}, {"date": "1 Apr 2017", "title": "Patient Service Representative Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Northwestern Medicine in Feb 2017", "Interview Descriptions": "I applied online. A recruiter emailed me/called me for a phone screening. Completed that and was informed about the hireview interview. Completed that process and now have a couple interviews set up with the practice manager. I am hoping to receive an offer", "Interview Questions": "Why northwestern"}, {"date": "27 Mar 2017", "title": "Pathologist's Assistant Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Northwestern Medicine (Los Angeles, CA) in Feb 2017", "Interview Descriptions": "Straightforward knowledge on dissection, educational and work experience. Knowledge on autopsies and photography. Efficiency on frozen sections. What do I expect from my job and what salary range do I expect. A lot of situational problem solving questions.", "Interview Questions": "About my job experience "}, {"date": "29 Nov 2018", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Northwestern Medicine in Feb 2017", "Interview Descriptions": "HR called to set up an interview, received email instructions on how to submit my references. A week later met with unit manager, behavioral questions mainly.  I was asked to shadow a nurse after the interview", "Interview Questions": "what patient would you see first and why"}, {"date": "3 Mar 2017", "title": "MRI Technologist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Northwestern Medicine (Buffalo Grove, IL) in Feb 2017", "Interview Descriptions": "The interview process went really well. the manager was really knowledgeable and was able to answer any questions i may have had. The interview was conducted over the phone.", "Interview Questions": "describe your experience?"}], [{"date": "3 Jan 2017", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Northwestern Medicine (Chicago, IL)", "Interview Descriptions": "One phone interview with two program managers - basic behavioral interview with questions about previous experiences based on a previously submitted resume. Interview was supposed to be in person but time and scheduling constraints limited to a phone interview which led to an offer.", "Interview Questions": "What is one challenge you have faced and how did you approach it? "}, {"date": "20 Jun 2017", "title": "Radiologic Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Northwestern Medicine (Chicago, IL) in Jan 2017", "Interview Descriptions": "The first interview is a video interview. Then you meet for the face to face with the appropriate director. It took me several weeks to get my job offer, as they had a personnel change in the HR department. But other than that the process was pretty easy. The Skype interview was first. They gave you sample questions to prepare but those are not what they ask, unfortunately. The face to face for me was pretty low-key and took place within a week of the video interview.", "Interview Questions": "I really cannot remember the questions during the video process, pretty standard from what I remember. Something about customer service. "}, {"date": "30 Mar 2017", "title": "Administrative Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Northwestern Medicine (Winfield, IL) in Jan 2017", "Interview Descriptions": "The interview process started with a virtual interview (you are asked questions on a the screen, you have 30 seconds to prepare your answer and then your answer is video recorded). After that about 2 weeks later I was set up with an in person interview with the hiring manager and the woman I would be replacing. They asked me several pretty generic interview questions and then I was shown around and explained duties the job would entail. After my interview I sent a thank you letter to the hiring manager and then I never heard from them again.", "Interview Questions": "How do you deal with conflict in the workplace?"}, {"date": "17 Sept 2018", "title": "Clinical Research Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Northwestern Medicine (Chicago, IL) in Jan 2017", "Interview Descriptions": "Interviewed over the course of two days. Met with 2  research coordinators for 15 minutes each. Barely any questions were asked they just told me about their jobs.  The next day I was called back  to interview with the two PI's. Interviews were 30 minutes each", "Interview Questions": "What would your walk out song be?"}, {"date": "8 Oct 2020", "title": "Information Systems Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Northwestern Medicine (Chicago, IL) in Jan 2017", "Interview Descriptions": "Had to take a test, then they call you back for an interview. The interview took 1 hour. Then they took me on a tour of the facility. I waited several weeks for a call back from HR.", "Interview Questions": "Why do you want to work here? "}, {"date": "20 Mar 2019", "title": "Billing Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Northwestern Medicine (Chicago, IL) in Jan 2017", "Interview Descriptions": "I was offered an in-person interview after my now manager requested I apply for the position. A time was selected and the interview lasted about 20 minutes with some additional time being reserved to meet the available staff.", "Interview Questions": "What skills do you believe you can offer the organization?"}, {"date": "18 Jan 2017", "title": "Environmental Services Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. I interviewed at Northwestern Medicine (New York, NY) in Jan 2017", "Interview Descriptions": "The interview went so good I thought they would give me a call back sooner but no call not response to voicemail or email, lack of communication very disappointed in northwestern", "Interview Questions": "How can I contributed to the company"}, {"date": "7 Jan 2017", "title": "Certified Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Northwestern Medicine (Chicago, IL) in Jan 2017", "Interview Descriptions": "I applied online, contacted two days later to complete a digital interview, recruiter contacted me  the same day to confirm experience and my salary expectations, the next day I was asked to pick a date/time for a two panel interview... the email also stated that if an offer is extended I would receive an email with instruction on how to upload references using the link. Interview lasted one hour and was very relaxed, smooth, and thorough. It was like I was having lunch with two good friends. All the questions I had planned to ask were answered and I was completely in awe. On my way home... I received three emails, including a follow up email from my recruiter asking me \"how did it go\", I'm only assume that the two managers contacted him as soon as I left.  He just so happened to email me 30mins after my interview and asked me to upload my references using the link provided in the other emails. At this point, it would appear that an unofficial offer is on the table, because I was asked to upload references (which is the next step after the face to face interview). When I receive an official offer...I plan to accept and type up my three week notice for my current employer. The process so far has been fast pace and straightforward. I am absolutely grateful to have been giving the opportunity... and the process itself has been great. I'd give my recruiter and those two managers five stars and two thumbs up.", "Interview Questions": "They asked mostly about my current role as a CMA, a few problem solving questions, my flexibility, my EPIC training and comfort level, how much notice would I need to provide my current employer."}, {"date": "6 Apr 2017", "title": "Psychometrist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Northwestern Medicine (Winfield, IL) in Jan 2017", "Interview Descriptions": "I interviewed with two neuropsychologists and a lead psychometrist. They were very relaxed and kind. They made it clear they work like a family and they really care about their patients. Then they gave me a tour and we talked about logistics.", "Interview Questions": "How would you handle a situation in which a very upset dementia patient is getting ready to leave in the middle of a test?"}, {"date": "13 Nov 2016", "title": "Pct Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Northwestern Medicine in Nov 2016", "Interview Descriptions": "Different interview digital interview. I really didn't like the digital interview because I couldn't ask any questions if I misunderstood a question. They only ask you 10 questions. Only thing I don't like about the digital interview is that they determine whether they want to give u a in house interview based off the digital video.  I dislike it because everyone is not a camera person so  if you don't do well on the video version it can cause you to blow your chances of getting a real interview with northwestern medicine.", "Interview Questions": "What motivate you to work with northwestern?"}], [{"date": "29 Mar 2018", "title": "Medical Secretary Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Northwestern Medicine (Chicago, IL) in Nov 2016", "Interview Descriptions": "It was a three month process. I applied online in November, recorded a video interview in December, then interviewed 1:1 in January, then a group interview, finally another 1:1 in February. I was offered the job that same month and started work mid March.", "Interview Questions": "Why I want to work for Northwestern"}, {"date": "2 May 2017", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Northwestern Medicine (Chicago, IL) in Nov 2016", "Interview Descriptions": "Was emailed with the opportunity to interview with them, I came in, they gave an overview of the department and project, asked me a few questions, then told me they would be in touch.", "Interview Questions": "Describe how you overcame an obstacle or difficult experience using your skills"}, {"date": "25 Oct 2016", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at Northwestern Medicine (Chicago, IL) in Oct 2016", "Interview Descriptions": "I applied through my school's job board for the registered nurse position. I got an email immediately after submitting the application. I completed a digital interview which had about 6 questions I had to answer. It was mainly about past experiences. The next day HR contacted me then spoke with me briefly about the position.", "Interview Questions": "Name a time you dealt with a difficult patient and how did you handle it.\r\nIf you had a choice, what are 2 units you would work on?"}, {"date": "19 Mar 2017", "title": "Lpn Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Northwestern Medicine (Chicago Ridge, IL) in Oct 2016", "Interview Descriptions": "Video interview describing above yourself. Phone interview more about the job, benefits and such. Then you met with HR to discuss time, salary and eligible. Also growth and education offered.", "Interview Questions": "Why are you a good candidate "}, {"date": "17 Nov 2016", "title": "Patient Service Representative Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Northwestern Medicine (Chicago, IL) in Oct 2016", "Interview Descriptions": "It initially began as a video interview using an app you had to download. Then each department will contact you depending on the job you applied for. Use caution you may go up to 3-6 interviews with different departments. Be ready for a lot of time dedicated to attending the interviews.", "Interview Questions": "Why do you want to work for this company? Why are you interested in leaving current job? Where do you see yourself in 5 years?"}, {"date": "31 Dec 2016", "title": "Director Patient Experience Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Northwestern Medicine (New York, NY) in Oct 2016", "Interview Descriptions": "Initially received an email stating I wasn't qualified for position. One week later, received another email \"inviting\" me to do a one-way video interview. Impersonal. The video interview is  prejudicial. I am over 50 and masters prepare nurse. Two other people I know also interviewed this way. One is black and one is Muslim. None of us were invited for in-person interview; receiving an email stating not qualified.", "Interview Questions": "Describe yourself?"}, {"date": "21 Sept 2016", "title": "Patient Service Representative Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "The process took 1+ week. I interviewed at Northwestern Medicine", "Interview Descriptions": "I got a call from a recruiter who scheduled a HireVue. After the HireVue I was scheduled a face to face interview with the floor manager. Now I'm waiting for a call to schedule third interview with the practice manager.", "Interview Questions": "How do you deal with stress?"}, {"date": "15 Sept 2016", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Northwestern Medicine", "Interview Descriptions": "The interview was very basic. They asked about job history and the status of  my licensure. They asked lost of \"example\" based questions. Can you give an example of a time when you had a disagreement at work and what you did to resolve it? Can you give an example of a time you solved a problem in the workplace? \r\nThey also asked questions like why do you want to work at Northwestern?\r\n\r\nthree people interviewed me at once.", "Interview Questions": "Why do you think you would be a good fit here?"}, {"date": "8 Sept 2016", "title": "Patient Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Northwestern Medicine (Chicago, IL)", "Interview Descriptions": "Was very pleasant. Had three interviewees each with different personalities. I truly enjoyed it. My advice is to asked each interviewer questions. About the job, what impact they plan to make with the company,etc.", "Interview Questions": "Why are you interested in this position?"}, {"date": "29 Sept 2016", "title": "Analytics Consultant Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 1 week. I interviewed at Northwestern Medicine (Chicago, IL) in Sept 2016", "Interview Descriptions": "5 hours, do to 1.5 hours over. Unplanned interviews with other associates.  The biggest issue is the managers and the directors seem to not have aligned strategies for the candidates they're seeking.\r\nSQL test of 7 questions: mainly aggregate functions and semi-complex joins, 1 hour to complete.", "Interview Questions": "Why would you want to work for Northwestern?"}], [{"date": "14 Oct 2016", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Northwestern Medicine (Chicago, IL) in Sept 2016", "Interview Descriptions": "I was contacted almost two months after applying to complete the HireVue interview.  I assumed I had not moved onto the next round, but eventually heard back almost a month later that I was selected for an in-person interview with the hiring manager.  I interviewed with her and another employee I'd be working with for about 45 minutes.  Once I got home I had already received a call from HR to schedule a skills test over basic Microsoft Office programs.  I completed this the following week and was then scheduled for another interview with the Chief of the department who ultimately has the final say.  I met with him for about 30 minutes-super friendly!  I was told I would hear back 'soon' and it has been almost two months.  I reached out to the hiring manager after three weeks for some sort of update and to express interest my in the position, but never received a response.  Super disappointed I went through so many rounds to hear crickets with a company I've always admired and wanted to work with.  The position is still listed as 'accepting applications' for the past 6 months, so I hope they find who/what they are looking for!", "Interview Questions": "Basic behavioral questions and asking about experience listed on resume, etc."}, {"date": "3 Sept 2016", "title": "Pharmacy Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Northwestern Medicine", "Interview Descriptions": "It was a very short process, you go around and interview with different people from the pharmacy dept. Very short and sweet, they have same day offers. They give out bags of goodies to people they offered the job to, it was great", "Interview Questions": "What is your biggest weakness?"}, {"date": "16 Jan 2020", "title": "Exercise Physiologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Northwestern Medicine (Chicago, IL) in Sept 2016", "Interview Descriptions": "Met with the lead exercise physiologist, head nuclear doctor, and head cardiovascular doctor and had all one on ones with them back to back. Everything was laid out ahead of time and had a schedule of name, job title, and times to meet with them.", "Interview Questions": "Previous experience?"}, {"date": "14 Aug 2016", "title": "New Grad RN Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Northwestern Medicine", "Interview Descriptions": "I received an invitation to complete a digital interview shortly after completing the online application. The interview was straightforward but requires preparation to give your best possible answers. It has been three weeks and I am waiting to be contacted.", "Interview Questions": "Why do you want to work at this hospital?"}, {"date": "14 Jul 2016", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. I interviewed at Northwestern Medicine", "Interview Descriptions": "The interview started with a virtual interview then an in person. It was pretty straightforward and related to the specific unit I applied for. The virtual interview was pretty easy, it was just some questions about my background, and the in person interview was more about my specific desire to work on that unit.", "Interview Questions": "Why Northwestern Medicine?"}, {"date": "12 Apr 2017", "title": "Vice President Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. I interviewed at Northwestern Medicine (Chicago, IL) in Aug 2016", "Interview Descriptions": "Professional and discreet process focused on skills and my ability to add value to the organization. Comprehensive review of organization and exposure to a great number of leaders with whom my role would interact.", "Interview Questions": "Opinions about future of industry and how to influence it"}, {"date": "21 Sept 2016", "title": "RN Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 1+ week. I interviewed at Northwestern Medicine (Chicago, IL) in Aug 2016", "Interview Descriptions": "The interview was very casual. There was only one interviewer present and they were extremely nice and open. It felt more like a conversation more so than an interview. They asked very basic questions and gave me a chance to showcase myself. I felt like it was a very positive experience, although I did not get the offer.", "Interview Questions": "-Why this unit?\r\n-Tell me your strengths and weaknesses\r\n-How would your friends describe you in 3 words?"}, {"date": "25 Jul 2016", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 days. I interviewed at Northwestern Medicine", "Interview Descriptions": "I applied online & received an email scheduling a digital interview. Once the interview was done I received another email about 4 days later scheduling an in person interview. I interviewed with three managers & was offered the position the same day. The interview went smoothly, the mangers were very nice. The questions were specifically related to the position itself.", "Interview Questions": "Name a time you went above and beyond for a patient."}, {"date": "19 Jul 2016", "title": "RN Staff Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Northwestern Medicine", "Interview Descriptions": "Overall, pretty straight forward and quick. \r\nI applied on a Tuesday, had a digital interview on Wednesday. Heard back from HR on Monday to schedule an on-site interview and shadowing experience. Got an offer the day following my interview.\r\nQuestions were all very normal interview questions, nothing caught me off guard.\r\nHR was very helpful throughout the process with any questions I had.", "Interview Questions": "Give me your definition of \"teamwork\"\r\nWhy Northwestern?"}, {"date": "13 Aug 2016", "title": "Staff RN Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Northwestern Medicine (Chicago, IL) in Jul 2016", "Interview Descriptions": "The initial interview is a digital interview. It is a screening process in a way to determine if you will be given a personal interview. You have 30 secs to prepare an answer for a question and then 3 mins to respond. The interview is easy and can be completed on your own time. HR then called to set up an in person interview.", "Interview Questions": "Why northwestern?\r\nDescribe a conflict with a coworker and how you dealt with the issue"}], [{"date": "3 Aug 2016", "title": "Operations Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 days. I interviewed at Northwestern Medicine (Chicago, IL) in Jul 2016", "Interview Descriptions": "I first was selected to do a video interview. Never did that before! It was different. You had to download the app on your phone then you were able to do a few test questions. It's basically like an interview in person so you really have to be in a quiet area with professional attire. You are given 30 seconds to answer the questions and the you submit when you're done. Two days later I received an email to schedule a phone interview with the Director of the department. It went really well and she she very friendly. The next day I was offered dates to come in for a in person interview with the Director, the physician I would support, the admin I would replace, and other supporting admin staff. I opted for an early interview so I could go back to work so it was 730am-930am. It went smooth seeing that the surgeon is super busy and was called to the OR. Everyone was friendly. The gave me an overview of the position as well as a mini tour. About 3 hours later I was offered the position with more money than I asked for. Great experience!!!", "Interview Questions": "Why are you leaving your current job?"}, {"date": "10 Jul 2019", "title": "Patient Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Northwestern Medicine (Chicago, IL) in Jul 2016", "Interview Descriptions": "The initial interview was a video interview process where I had to answer pre-recorded questions. The 2nd interview was a panel interview with the Practice Manager and the Sr. Practice Manager", "Interview Questions": "Previous work experience"}, {"date": "20 Aug 2016", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through a staffing agency. The process took 2 days. I interviewed at Northwestern Medicine (Chicago, IL) in Jul 2016", "Interview Descriptions": "The interview process included a preliminary interview with a panel of four (though only three ended up being present), and a second interview with a panel of four (two returners) and the VP of the Foundation. Answering their questions took up about 40% of the first interview, and 60% of the second. During the first they heavily described what the job would be like, an assistant for the three managers of the Foundation (Estate Planning, Philanthropy). They stressed that it would be a high paced position and that they relied heavily on understanding of excel. They also stressed that it was a temp position, and though their company frequently hired temps on as full time employees, it was temp for an unknown amount of time.", "Interview Questions": "What was a time you experienced a conflict with a donor? How familiar are you with Microsoft Office? How do you deal with getting what you need through while operating through a bureaucracy? How do you time manage?"}, {"date": "30 Jun 2016", "title": "Applications Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 3 months. I interviewed at Northwestern Medicine", "Interview Descriptions": "I applied online and heard back in around a week. First I needed to take an Epic test which took around two hours. The person who administered the test rescheduled four times which was extremely annoying. A week and a half later I was asked in for an interview which was not difficult. Then a week and a half later a was asked to do another interview. Two weeks later I heard back about their final decision. In all this process took three months and I found HR to be very disorganized and unprofessional.", "Interview Questions": "Why are you  interested in this position? "}, {"date": "28 Jun 2019", "title": "Patient Care Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Northwestern Medicine (Chicago, IL) in Jun 2016", "Interview Descriptions": "The interview process was fairly simply, HR contacted me three weeks after I applied and right away told me the position was union and the pay rate that they offered, which is the same for all incoming PCTs  regardless of experience level. HR then gave me the option to pick the top three units that I wanted to work for. When I went in for the interview there was a lot of people interviewing and a lot of unit managers present. I got sent to the table of the manager for the unit that was my top choice. After the interview, they separate you into groups in order to perform a skills test which simply includes taking manual blood pressure, pulse, and counting respiration. After the skills test they tell you they will keep in contact.", "Interview Questions": "1. Where do you see yourself in the next 5 years? \r\n"}, {"date": "24 Jun 2016", "title": "Cardiology Tech I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Northwestern Medicine (Chicago, IL) in Jun 2016", "Interview Descriptions": "an online video with a deadline, followed by in-person interview a few days later followed by a phone interview a day or so later. was offered the position during the phone interview along with salary and given the opportunity to accept on the spot.", "Interview Questions": "can you describe a time you went above and beyond the call of duty to help someone on your job or for a patient?"}, {"date": "16 Jun 2016", "title": "Echo Tech Per-Diem Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Northwestern Medicine (Lake Forest, IL) in Jun 2016", "Interview Descriptions": "I applied on-line through employee referral. Next day I received an e-mail inviting me to take a digital interview, which was the most awkward and stressful experience. Two days later I received a call from a hiring manager, who was very nice and polite over the phone and we discussed in detail everything what the job will be about. The in-person interview was scheduled for Monday of next week. Three days before the interview I got a call from HR asking me questions about my resume. She said: I know you have an in-person interview scheduled but before we move forward, can you tell me why are you CCI registered and not ARDMS? (Same thing except ARDMS is only valid in USA, while CCI is valid throughout the world). On my initial application I stated that I am CCI registered. She arrogantly said that ARDMS is an ABSOLUTE requirement and she has to cancel my interview, to which I said 'It's fine' ( and then thought to myself, what an idiot! She lost such a good asset to the hospital over a little technicality!).", "Interview Questions": "Does the hospital where you currently work allows you to be CCI registered?"}, {"date": "7 Jun 2016", "title": "Registered Nurse, Critical Care Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Northwestern Medicine (Chicago, IL) in May 2016", "Interview Descriptions": "The screening interview was computerized which allowed you to record video of you answering questions at whatever time was convenient. They followed up by scheduling an in person interview with the manager and then two hours of shadowing an RN on that unit. Manager interview was five minutes. I did not hear back for over a month despite sending a thank you email and later a follow up email.", "Interview Questions": "Tell me about a time when you went above and beyond for a patient."}, {"date": "2 Jun 2016", "title": "Certified Medical Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 1 day. I interviewed at Northwestern Medicine (Chicago, IL) in May 2016", "Interview Descriptions": "They called me after coming across my resume on Career builder and set up a time for Face time interview. First Assistant came online and ask some general questions then supervisor came and she takes the actual interview", "Interview Questions": "What are your strengths which you think you can bring if hired?"}, {"date": "2 Aug 2018", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Northwestern Medicine (Winfield, IL) in May 2016", "Interview Descriptions": "Interviews at Northwestern  Medicine are either first with the hiring manager and then a peer interview or the manager sometimes will include peers in the initial interview.  They use behavioral interviewing.", "Interview Questions": "Everyone has had a time when they had to deal with an unhappy patient or family member. Think of a time when you had to deal with an unhappy patient or patient’s family member.  What was the situation?  How did you handle it? What was the outcome? What could you have done differently that could have potentially changed the initial outcome so that the patient or family member would not been unhappy?"}], [{"date": "18 May 2016", "title": "Clinical Dietitian Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at Northwestern Medicine (Warrenville, IL) in May 2016", "Interview Descriptions": "Sat in with numerous dietitians and was asked various questions regarding past challenges in the work place, team work opportunities, challenges with co-workers, past and current experience, toured the facility.", "Interview Questions": "How can you describe your role as a team player"}, {"date": "15 Jun 2016", "title": "Administrative Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Northwestern Medicine (Lake Forest, IL) in May 2016", "Interview Descriptions": "Brief phone screen with recruiter and one hour in-person interview with hiring manager.  Both were completed within one week.  Recruiter moved very fast; phone screen was about 10 minutes long, but she called the very next day to set up the in-person interview.  Hiring manager was not skilled at interviewing but easy to talk with.", "Interview Questions": "How I handle someone who doesn't like me"}, {"date": "20 Apr 2016", "title": "Fitness Contractor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Northwestern Medicine (Chicago, IL)", "Interview Descriptions": "I had an oral innterview on my group exercise experience.   I was asked questions pertaining to customer service.  I was questioned about modifications I would provide for specialty populations and diagoses.  Also, I had to display my teaching skills through a practical audition.", "Interview Questions": "How would you modify for participants with Osteoporosis?"}, {"date": "18 Apr 2016", "title": "Applications Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Northwestern Medicine", "Interview Descriptions": "Applied online and heard back from recruiter a few days after.  Was scheduled to take an online interview which was pretty basic.  Overall, the experience was a little different that what i was use to but I believe that how they conduct their interviews will be the future to how interviews will be.  Again, the online interview server allows you to practice on some questions to allow you to become familiar with how interview process will go.", "Interview Questions": "Why would you want to work in health field?\r\n\r\nWhat would you bring to Northwestern?\r\n\r\nGeneral questions."}, {"date": "1 Mar 2016", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Northwestern Medicine (Chicago, IL)", "Interview Descriptions": "I had an initial digital interview via webcam as a screening process. Then HR called and scheduled an interview with two nursing managers and i did a shadow of the unit for an hour and a half.", "Interview Questions": "Why nursing?"}, {"date": "2 Aug 2017", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Northwestern Medicine (Chicago, IL) in Apr 2016", "Interview Descriptions": "I had a computerized skype interview that was slightly awkward but advanced to an in-person interview. It was very painless and almost enjoyable. Very basic interview questions and very kind interview people. I received a call the day after asking if I wanted the job. The only downside was that they wanted an answer in 24 hours, which for someone who is looking at multiple offers, is a bit challenging.", "Interview Questions": "Name a time you were faced with a challenge and how did you overcome it?"}, {"date": "9 Nov 2016", "title": "Project Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Northwestern Medicine (Carol Stream, IL) in Apr 2016", "Interview Descriptions": "Found job online and applied. First interview was a pre-packaged video interview which was Skype-like, except there was not a person on the other end to talk to, just a set of questions that you had limited time to answer. Contacted by HR Recruiter to schedule an in-person interview with the hiring manager (1 hour). Follow up with the recruiter after a couple of weeks, the position had been put on hold due to budget issues.", "Interview Questions": "When was a time you had to tell a customer \"no\"?"}, {"date": "15 Jan 2017", "title": "Patient Care Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Northwestern Medicine (Winfield, IL) in Mar 2016", "Interview Descriptions": "Video and in person interview. A video interview was required first which was sent to all of the Northwestern Medicine locations. It was a series of about five questions. Then the real interview was at the hospital with the nurse manager of the unit.", "Interview Questions": "Why do you want to work for Northwestern?"}, {"date": "23 Apr 2016", "title": "Immediate Care Technician Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Northwestern Medicine in Mar 2016", "Interview Descriptions": "Applied online; heard form HR approximately 2 weeks later and went in for an in-person interview the same week. Was told I would hear back from the company the following week, never heard anything, and heard the run around from HR. Ended up turning down the position because of the lack of communication.", "Interview Questions": "What experiences in the past have made you prepared for this position?"}, {"date": "15 Jun 2017", "title": "Trainer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Northwestern Medicine (Chicago, IL) in Mar 2016", "Interview Descriptions": "Contacted by HR via email. Setup a phone screening with HR. Then was forwarded to the hiring manager where I did a phone interview with them. Followed by an in-person interview where I met with small groups of 3-4 people to be interviewed. I also had to do a teach back on a topic of my choice in their Epic System (which is unfair because they were on 2012, and I knew 2014 and higher) I also had to submit training/ tip sheets that I had created.", "Interview Questions": "How do you keep your students engaged\r\n"}], [{"date": "20 Mar 2016", "title": "Patient Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Northwestern Medicine (Chicago, IL) in Feb 2016", "Interview Descriptions": "Offered a video interview first. Then received a phone call to come in for an in person interview. Offered the job the following day. The interview process was very smooth and the manager was nice and attentive to my questions and answered them in full. She then brought me to interview with three other managers and i was offered the job the following day.", "Interview Questions": "Are you familiar with healthcare networks."}, {"date": "5 Jun 2017", "title": "Analytics Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Northwestern Medicine (Chicago, IL) in Feb 2016", "Interview Descriptions": "The Analytics Director showed me around the office and then told me his plan for the position I applied for, and what the kind of work I'll be doing would look like during each phase of the plan. Then, 3 groups of 2 or 3 employees interviewed me, mostly asking about things on my resume.", "Interview Questions": "What courses have you taken related to statistics or analytics?"}, {"date": "28 Jul 2016", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Northwestern Medicine (Chicago, IL) in Feb 2016", "Interview Descriptions": "Two step interview process. First is a video recording and second is an interview with a manager/leader. The video interview, though well set, gets a little bit tricky as you are looking at the clock at the same time as answering questions. The questions though are open ended, so being confident thus help. Practice time is also provided for the interview which makes it easy.", "Interview Questions": "All the basic interview questions. Very positive two way interaction."}, {"date": "12 Feb 2016", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Northwestern Medicine (Chicago, IL) in Feb 2016", "Interview Descriptions": "Was given an email to do a digital interview (seemed to be a screening process) and then a followup a day later to do an in-person interview with the unit manager. The interview included a day to shadow the unit - so bring scrubs!", "Interview Questions": "If you had the option of picking, which two units would you want to work on?"}, {"date": "23 Feb 2016", "title": "Patient Access Representative Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Northwestern Medicine (Chicago, IL) in Jan 2016", "Interview Descriptions": "I Received an email that I was chosen to do an over the phone Video type interview.  Two weeks after that I was asked to come in for a face to face with the department manager and shift supervisors.  The Interview I thought went very well, so I thought.  A few days  after the interview I sent the recruiter an email to thank them for the interview opportunity and to request feedback on the status of the position.  I never received a response nor did I get an email blast ( which I felt was a small courtesy that a very large and professional organization like Northwestern Medicine could do for candidates to let them know they were no longer being considered) after another week or so went by I reached out to the recruiter to inquire about the status of the position,only to be told that the recruiter was no longer with the company and the candidates that they were working with were being handled by someone else.  I explained that I had interviewed over the phone as well as in person and I really just wanted to see if the position was still available and if I was still being considered.  I provided my name and contact info and was told that they would find out and contact me back.  I waited another week or so and called HR again to check on the status, already realizing that apparently I did not get the position but still kind of hoping that I may have just fallen through the cracks with the initial recruiter whom is now no longer with the company.  The young lady that answered in HR pretty much told me that if I had not heard back from anyone and if the requisition was no longer showing active the position was filled.  Although not the outcome I wanted to hear I guess it was better than hearing nothing at all.   As a courtesy to your candidates, a simple email would have sufficed.", "Interview Questions": "Define compassion."}, {"date": "25 Mar 2016", "title": "Patient Service Representative Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Northwestern Medicine (Chicago, IL) in Jan 2016", "Interview Descriptions": "I applied online then I did the equivalent of a phone screen, only you video record your answers. Got a call within 3 days to schedule an in-person interview. they  seemed ok at first. Then the red flags came flying. He stated that the clinic had been open three years and they had already had 4-5 managers. RED FLAG! He also stated that there is a lot of animosity between the medical staff and PSRs and management. Yet another RED FLAG! I understand honesty, but they were not making me want to work there at all. He showed me around the clinic all the while talking to staff, and  texting on her phone. Unprofessional. Did not even give me a card to contact to him with any questions. Needless to say I e-mailed the HR recruiter and asked I be taken out of consideration for the position.", "Interview Questions": "Tell me about yourself"}, {"date": "14 Mar 2016", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Northwestern Medicine (Chicago, IL) in Jan 2016", "Interview Descriptions": "Web-based interview with prompted questions, an awkward experience. Recruiter set up in-person interview with floor manager and shadow experience with ICU. I was recommended to step down unit to gain a little more experience as I am a new grad. The interview process continued the following day with two managers. The new grad RN position was offered the following day.", "Interview Questions": "Where do I see myself in 5 years?"}, {"date": "16 Jan 2016", "title": "Patient Service Representative Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Northwestern Medicine (Naperville, IL) in Dec 2015", "Interview Descriptions": "It started with a 20 minute phone screen where I was asked some basic questions to see how well I fit the needs of the position. I was then offered an in person interview that was supposed to be held with two members from Northwestern Medicine. Unfortunately an hour before my interview I received a call telling me that they offered the position to another candidate. It was disappointing but I respect their decision and continue to apply for other openings.", "Interview Questions": "Q: What made you apply for this position?"}, {"date": "26 Aug 2016", "title": "Senior Project Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Northwestern Medicine (Chicago, IL) in Dec 2015", "Interview Descriptions": "The interview process was conducted by Computer-assisted personal interviewing (CAPI).  It was the first time I interviewed using this method.  I found the process too impersonal and difficult to complete.  Interviewing in and of itself is a stressful process, but when coupled with the need to focus on camera angles, lighting, and sound quality it becomes very task laden and therefore counter-productive to actually getting to meet and know the candidate up-close and personal.", "Interview Questions": "Behavioral"}, {"date": "12 Jan 2016", "title": "N/A- Role Was Found Through A Recruiter Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 1 day. I interviewed at Northwestern Medicine (Chicago, IL) in Dec 2015", "Interview Descriptions": "Strangely, I did not interview in person. My recruiter contacted Northwestern, and I was hired based upon my resume. I was told I was \"temp to hire\" by my recruiter, but now have to apply separately to the permanent position. Initially, my supervisor was not even aware that I wanted the permanent position, which is very frustrating. However, I blame my recruiter, not him or Northwestern.", "Interview Questions": "I was not asked any questions."}], [{"date": "15 Dec 2015", "title": "Registered Nurse Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Northwestern Medicine in Dec 2015", "Interview Descriptions": "Phone interview with HR 10 minutes\r\nActual interview was long with office 90 minutes but it's all about if you can fit in and that depends on your personality.\r\nFollow up interview was shadowing for 2 hours.", "Interview Questions": "Why are you trying to leave your current job?"}, {"date": "21 Jan 2016", "title": "Human Resources Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. I interviewed at Northwestern Medicine (Chicago, IL) in Dec 2015", "Interview Descriptions": "video interview for a pre-screening. it was a little uncomfortable because you were basically talking to yourself the whole time and there was a countdown as you spoke so it made me a little nervous. I prefer to talk to a real person so that you can at least see the way they are reacting to the answers you give.", "Interview Questions": "example of time when you were frustrated and how it was handled"}, {"date": "7 Nov 2015", "title": "RN Staff Nurse Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 days. I interviewed at Northwestern Medicine in Nov 2015", "Interview Descriptions": "I applied online on their website and few days later received email from hr saying they wanna schedule the phone interview.  Two days later the phone interview with hr recruiter took place. I was asked many questions but because I was prepared I had no problem answering it. After phone I got email that on their opinion it went extremely well and they want to schedule me for in person interview with unit manager. She was very nice and asked many questions that she explained sha asks to all candidates. After that I could shadow on the unit. Everyone were very professional and friendly during the process, I noticed a great teamwork on the unit I shadowed. It was a great overall experience and if not for other offer that suits me better I would definitely work there.", "Interview Questions": "Phone- Why do you want to work for NWM."}, {"date": "5 Nov 2015", "title": "Patient Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Northwestern Medicine (Evanston, IL)", "Interview Descriptions": "Started off with an phone interview, what would you do scenarios, handling irate costumers, from there I receive an offer to come in for a one on one interview. Very straight to the point. Touches on skills and costumer service qualities", "Interview Questions": "Are you a team player, what can you bring to the table, why northwestern?"}, {"date": "22 Oct 2015", "title": "RN Operating Room Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Northwestern Medicine (Chicago, IL)", "Interview Descriptions": "The interview process was average, compared to other places I've interviewed. They asked about patient experiences, and information on my work experiences. Nothing too difficult. I was offered the position after I met with HR.", "Interview Questions": "There were a few questions about how I handled patient expiences"}, {"date": "3 May 2016", "title": "Administrative Assistant II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 2 days. I interviewed at Northwestern Medicine (Chicago, IL) in Oct 2015", "Interview Descriptions": "I met with two division administrators and two of the doctors who I was going to be assisting. I got lots of information and everyone seemed to think this position would be a good fit given my qualifications. I for the sense that I was wanted and that everyone was pleased to take the time to meet with me.", "Interview Questions": "You're about to complete a master's program. Do you see a future here, or will you be looking for other opportunities?"}, {"date": "17 Feb 2016", "title": "Team Leader Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Northwestern Medicine (Chicago, IL) in Oct 2015", "Interview Descriptions": "Behavioral Interviewing, Standard three parts - give me the what it was, what did you do and what was the outcome of the situation.  Pretty standard BI interview questions.", "Interview Questions": "Standard Behavioral Questions - Three Parts"}, {"date": "1 Dec 2015", "title": "Medical Office Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Northwestern Medicine (Chicago, IL) in Oct 2015", "Interview Descriptions": "Various people within the organization interviewed me.  The role appeared to have various responsibilities and multiple people reporting to the position.  Unfortunately it was a few weeks layer that I heard I did not get the position.", "Interview Questions": "Where so you see yourself in 5 years?"}, {"date": "8 Apr 2017", "title": "Clinical Nurse Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Northwestern Medicine (Chicago, IL) in Oct 2015", "Interview Descriptions": "Had two phone interviews, went over qualifications, what company offered.\r\nNext met with practice manager in addition to Department Manager and peers. Basic general  questions were asked. The interview lasted about 30-45 minutes, received tour of department. Pay was discussed after interview with offer letter.", "Interview Questions": "What are your strengths and weaknesses"}, {"date": "17 Sept 2015", "title": "RN In Patient: Psych Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at Northwestern Medicine", "Interview Descriptions": "I had 2 initial phone interviews, first with a talent recruiter then with HR. Next, we scheduled an interview, with unit manager. All of which were separated by 2 week intervals. The in person interview was late due to miscommunication, between unit manager, permanent safety officier and covering safety officier. So, my initial start time of 1330 got pushed to 1350. I did ask  safety about the situation 2x. No assistance. Finally, manager comes out. We clarify the situation, and I meet with other staff. Then I met with manager. Overall the interviews are easy. Was offered a day to shadow but because I decided on another path.", "Interview Questions": "Situation you went above and beyond for a patient."}], [{"date": "12 Sept 2015", "title": "Pharmacy Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Northwestern Medicine (Chicago, IL)", "Interview Descriptions": "Interview was average.  Received a phone call interview from HR. Then was scheduled to meet with the hiring personnel of the pharmacy department. Mainly asks about your experiences in pharmacy. After a few days, I received an offer through a phone call from HR and then completion of employment requirements.", "Interview Questions": "What pharmacy experiences do you have?"}, {"date": "9 Sept 2015", "title": "Clinical Role Transition Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Northwestern Medicine", "Interview Descriptions": "The interview was very short. The unit manager and director interviewed me. They gave some information about the unit and their expectations. I was asked basic questions, like why Northwestern? Overall, it was very laid-back.", "Interview Questions": "Q: Describe your leadership experience."}, {"date": "7 Dec 2016", "title": "Applications Analyst Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Northwestern Medicine (Chicago, IL) in Sept 2015", "Interview Descriptions": "Take Epic assessment and interview with hiring manager.  After submitting my background check and references, I had to follow up with HR because I hadn't heard anything for about a month.  The initial hiring manager quit right after my interview and I had to interview again.  The lack of communication was unprofessional and it seemed that hiring valued candidates wasn't a priority.", "Interview Questions": "What is your interest in working in healthcare? Describe your previous role.  "}, {"date": "29 Apr 2016", "title": "Recruiter Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 1 day. I interviewed at Northwestern Medicine (Chicago, IL) in Sept 2015", "Interview Descriptions": "Good.  She was very communicative in explaining the role.  It gave us an opportunity to exchange words and learn personalities.  She walked me through the department and allowed me to see the environment to see if it was someplace I could work daily.", "Interview Questions": "Tell me about a time you went above and beyond"}, {"date": "4 Aug 2016", "title": "Office Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Northwestern Medicine (Chicago, IL) in Aug 2015", "Interview Descriptions": "I was called after submitting my resume. I did not have a phone interview. I was scheduled for an interview with the program manager. He gave a very basic informal interview. I was given a tour of the building and was offered the job that day.", "Interview Questions": "What roles have you had in the past where you demonstrated initiative? What actions did you perform at your last position (which was similar to the job I was applying for)"}, {"date": "20 Jul 2015", "title": "Physician Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Northwestern Medicine", "Interview Descriptions": "The process is painfully long and frustrating. You might be contacted by HR 3 months after initial application, then brought in by the department for an interview. My first interview with one Department went extremely well, and I was told by one person high on the decision making chain  \"Clearly you are the right person for the job. No one else has your experience. I'll make sure we get you on board ASAP.\" Then after hearing nothing further for 2 weeks I had to follow up to find the position was filled because someone knew somebody. Then I was called to interview for another department (again, 3 months after applying) and after another month with 2 rounds of interviews, still waiting. Almost not worth it.", "Interview Questions": "Just basic questions about my experience, nothing too difficult."}, {"date": "10 Aug 2015", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Northwestern Medicine in Jul 2015", "Interview Descriptions": "I felt immediately welcomed and comfortable during the interview. It was laid back and the questions weren't too tough since I was a new grad. I got to shadow for 3 hours after my interview and see the unit and everyone was amazing.", "Interview Questions": "Why nursing?"}, {"date": "18 Aug 2015", "title": "Marketing Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Northwestern Medicine (Chicago, IL) in Jul 2015", "Interview Descriptions": "Phone interview and then interview with managers. Interviewers did not appear to be prepared or mind on interview.  Department appeared to be in a disarray.  Process is too long to not received feedback. Require background checks, references from past managers.", "Interview Questions": "Questions about past experiences and how you handle situations."}, {"date": "10 Jun 2015", "title": "Office Manager Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Northwestern Medicine", "Interview Descriptions": "Management interview and peer interview.  These were conducted on two separate visits.  There was  one week time span in between as well.  I met with management for approximately 30 minutes and then the peer interview consisted of five employees with random questions.  This lasted approximately twenty minutes.", "Interview Questions": "Where do you see yourself in five years?"}, {"date": "1 Mar 2016", "title": "Anesthesia Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Northwestern Medicine (Chicago, IL) in May 2015", "Interview Descriptions": "Simple. They will email you to schedule an interview. Days later there is a phone interview with HR. After this is complete you schedule an interview with management. After you shadow the department supervisor. The next part is a very long wait. The department can tell you they want to give you an offer but they have to wait for HR to schedule orientation and your physical so it takes time. It took about 4 weeks for mine.", "Interview Questions": "Why are you here?\r\nWhere do you see yourself in 5 years?\r\nWhat are your career goals?\r\nWhat are your education goals?\r\nWhats your background?"}], [{"date": "9 Jul 2015", "title": "Managed Care Analyst Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Northwestern Medicine in May 2015", "Interview Descriptions": "Straight-forward interview. Asked several questions regarding my experience in the healthcare industry and my knowledge of the purpose and practice of managed care. Tested my understanding of the mechanics of a healthcare incentives and reviewed my ability to create solutions with Microsoft Excel. Overall, great experience with friendly interviewer and was introduced to a variety of staff following the conversation.", "Interview Questions": "What is your experience and level of proficiency in developing VBA solutions?"}, {"date": "2 Dec 2015", "title": "Catering Associate Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Northwestern Medicine (Chicago, IL) in May 2015", "Interview Descriptions": "Standard questions, nothing to hard if you do your research on the company and the qualities they're looking for in an employee.The interview process consisted of a recruiter from Hr calling me, and having a phone interview. Then I had face to face interview with the Director .", "Interview Questions": "Why Northwestern hospital"}, {"date": "19 May 2016", "title": "Clinical Quality Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 5 days. I interviewed at Northwestern Medicine (Chicago, IL) in May 2015", "Interview Descriptions": "It was uneventful interview. The staff were really nice, accommodating and friendly.  The environment was non threatening during the interview process.  I introduced myself and provided the group with my experiences and how can I be an asset to the department based on my clinical experiences.", "Interview Questions": "Why am I changing my job position?"}, {"date": "20 Apr 2015", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Northwestern Medicine", "Interview Descriptions": "Very welcoming and positive walked in and met with the nurse manager and a clinical tech they explaied their expereince and the job and then let me shadow on the unit and another unit to see what it was like.  All of the staff members were awesome", "Interview Questions": "Tell me about yourself"}, {"date": "7 Aug 2015", "title": "Registered Nurse Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 6 weeks. I interviewed at Northwestern Medicine (Chicago, IL) in Apr 2015", "Interview Descriptions": "I applied online and within a couple days, got an email from a recruiter scheduling a phone interview.  The phone interview was straightforward, lasting about 15 minutes.  At the end of the call, the recruiter scheduled me for an in-person interview with the managers.  Two weeks later, I had my in-person interview and shadow.  They basically explained how nursing works at NMH, and sent me off to the unit for 3 hours to shadow fellow nurses.  All in all, a very positive experience.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "5 Oct 2015", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Northwestern Medicine (Boston, MA) in Apr 2015", "Interview Descriptions": "I submitted my resume and application online and received a phone call from HR for follow-up. I had a brief phone interview discussing my experience and interests with the head of HR, which was overall a great experience. They were interested in my answers and very friendly. I was asked specifically what work I would be interested in, and given a list of examples of projects past interns had worked on. I was asked why I was interested in Northwestern Medicine, and how my past experiences had led me to this. Overall a low-stress interview.", "Interview Questions": "Why Northwestern Medicine?"}, {"date": "19 Apr 2017", "title": "Clinical Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Northwestern Medicine (Chicago, IL) in Apr 2015", "Interview Descriptions": "Phone interview and then three separate in-person interviews with doctor, staff, and managers. Everyone was friendly, willing to answer questions, and work to train me until I was comfortable since the previous employee in the position I was interviewing for left without notice.", "Interview Questions": "What is a difficult situation you have been in at your previous job and how did you handle it?"}, {"date": "23 Jul 2015", "title": "Patient Access Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. The process took 1+ week. I interviewed at Northwestern Medicine (Lake Forest, IL) in Mar 2015", "Interview Descriptions": "Hiring and interview process was very smooth. Interview set up through a temp agency. Great interviewing manager who asked a lot of detailed questions. Manager willing to work with my scheduale and very thankful she could find someone to do the overnight hours. However very confusing with where to go for interview. Went to HR and they had no idea who I was and where I should even be. After about 10 minutes they finally figured out where I should be and ended up being late to the interview because of this.", "Interview Questions": "Why do you think you would be a good fit for this position?"}, {"date": "25 Mar 2015", "title": "Registered Nurse Cardio/Pulmonary Transplant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Northwestern Medicine (Chicago, IL) in Mar 2015", "Interview Descriptions": "Applied through the online portal, a friend gave me a contact for the hiring department and was able to set up an interview within the week of application. Meet with two of the three managers, both were very nice and welcoming, very easy to talk with and felt comfortable asking questions", "Interview Questions": "What is your end goal?, Where do you see yourself in 5 years?, Why do you want to work in Cardio/Pulmonary Transplant?, What made you switch careers? (used to be a teacher)"}, {"date": "13 Oct 2019", "title": "Senior Finance Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Northwestern Medicine (Chicago, IL) in Mar 2015", "Interview Descriptions": "Talk to detail of your experience and how you will be there asset  to the company\r\nShow your referral from your other company\r\nTell them a short brief detail of why you want this job", "Interview Questions": "Why did you leave your previous job?\r\nWhere did you hear about NMH?"}], [{"date": "18 Mar 2015", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Northwestern Medicine (Chicago, IL) in Feb 2015", "Interview Descriptions": "The operations interviewer was really nice and helpful. She asked me a few questions that related to my clinical experience and my strengths and weaknesses. She asked me if I had any questions in addition to anything she didn't cover and she was very detailed with her answers. I had the opportunity to meet different managers on the unit including the operations manager and two other managers who were also very nice as well.", "Interview Questions": "What do you think you can change?"}, {"date": "9 Jan 2017", "title": "Registration Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Northwestern Medicine (Chicago, IL) in Feb 2015", "Interview Descriptions": "The interview gave me a very vague description of what the job really was. I wasn't asked very many questions and I had to wait an extra 30 min because the manager forgot she had a meeting at the scheduled time of my interview.", "Interview Questions": "Why do you want to work here? "}, {"date": "17 Jun 2015", "title": "RN Staff Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Northwestern Medicine (Chicago, IL) in Jan 2015", "Interview Descriptions": "Lengthy but extremely informative.  I worked with the RN Recruiter, Karen, and she was fabulous.  Kept me informed of the hiring process and so nice to work with.  I'm glad I accepted the offer to work here.  Karen was also nice and worked with other nurses that I referred her to.", "Interview Questions": "Tell me a time when you went above and beyond for a patient or co-worker"}, {"date": "5 Dec 2014", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Northwestern Medicine", "Interview Descriptions": "They are very thorough to make sure they only allow in those they can trust with their strict patient confidentiality and care guidelines. I appreciated this. Their concern for their patients' privacy and care is very refreshing. A hospital should be this way.", "Interview Questions": "i didn't encounter anything difficult- if you're honest it's a smooth process."}, {"date": "6 Jan 2015", "title": "OR Assist Interview", "results": "No Offer", "experience": "N/A", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Northwestern Medicine (Winfield, IL) in Dec 2014", "Interview Descriptions": "i was given an email link to download a video\\audio app to HIREVUE.  I used my laptop and answered 8 questions on video.  I dressed as if I were leaving my home.  I felt this was a cold and impersonal.", "Interview Questions": "Why am I a good fit for Cadence Health?\r\nMy experience for the position \r\n\r\n"}, {"date": "23 Nov 2014", "title": "Operations Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Northwestern Medicine (Chicago, IL) in Nov 2014", "Interview Descriptions": "Received call from HR rep, did over the phone question review, scheduled first interview with manager, went through basic position questions and was informed about the company. Went to the final interview with VP waiting for final call.", "Interview Questions": "How have I handled conflict"}, {"date": "28 Jan 2015", "title": "Cashier Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Northwestern Medicine (Winfield, IL) in Oct 2014", "Interview Descriptions": "I applied online.  I then received an email inviting me to the job fair.  I met with three or four people and got hired, pretty much, immediately.  I thought the process was very well run.", "Interview Questions": "Tell me about yourself.  Tell me what you would do in this situation."}, {"date": "8 Jan 2015", "title": "Human Resources Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Northwestern Medicine in Oct 2014", "Interview Descriptions": "Apply online, Video interview answering set series of questions, Called to set up panel interview, Create a presentation as part of panel interview, Asked to supply a list of references within 24 hours that receive a 20-30 questionnaire, Then wait for some kind of response", "Interview Questions": "Questions weren't difficult. However the detailed list of questions to your references is an extensive  boiler-plate list of items that not every reference could possibly answer. This could end up working against you, if someone else has a reference that is more familiar with all of these items. \r\nAlso with only 24 hours to provide, it was difficult to actually line up all references and let them know to be on the look out because they may receive a long questionnaire. I wasn't able to contact all prior to the process time running out."}, {"date": "12 Sept 2014", "title": "Executive Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Northwestern Medicine", "Interview Descriptions": "Very easy..It seems that take a liking to people who already have healthcare experience. In the Administration, that's plus and it goes a long way with Physicians, clinical directors, etc", "Interview Questions": "N/A"}, {"date": "2 Feb 2016", "title": "Clinical Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Northwestern Medicine (Chicago, IL) in Sept 2014", "Interview Descriptions": "I was initially given a phone interview with someone in HR.  They asked me what seemed like a series of preset questions about experiences I have had and how I handled them,  Afterwards I was asked to come in for an interview with two managers.  I was made to wait for 20 minutes on the floor with no idea if I was in the right place.  The interview was easy, just asked why I wanted to be a nurse and given several scenarios in which I had to prioritize or explain how to respond.", "Interview Questions": "Why do you want to be a nurse?"}], [{"date": "20 Aug 2014", "title": "Registered Dietitian Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Northwestern Medicine", "Interview Descriptions": "Apply via online platform; take an online personality/psych assessment test (tip: they are looking for the traits of teamwork, altruism, and an engaged workforce).  If make it past the initial psych and resume screen, resume forwarded to hiring manager who instructs HR to contact those they want to interview.  In-person interview with HR and hiring manager.", "Interview Questions": "Job-specific clinical questions; typical behavioral interview questions (i.e. describe a situation in which you had a challenge, worked with a difficult person, turned a loss into win, etc.)"}, {"date": "14 Jul 2014", "title": "Supply Chain Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Northwestern Medicine", "Interview Descriptions": "I applied online through the career site. It took about 2 months for someone from HR to contact me for a Phone interview. I passed that and went in for an in person interview about a week later. Pretty easy and laid back interview. I then was asked to take a test to make sure my excel skills were up to par. I did not hear anything for about a month and a half. Assumed I did not get the position. After waiting this length of time I was contacted by phone by HR saying they were pursuing other candidates", "Interview Questions": "N/A"}, {"date": "16 Jul 2014", "title": "Data Analyics Consultant Interview", "results": "Declined Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Northwestern Medicine", "Interview Descriptions": "Initial phone screening with HR followed by onsite interview with a Director and Manager. Laid back, low pressure interview. Straightforward SQL test at the end of the interview. Called back for second round interview with team members the next week. Interviewed with three separate team members, also laid back and low pressure. Received an offer a few days later.", "Interview Questions": "Initial phone screening included many rapid fire questions about job experiences (\"talk about a time you handled a difference of opinion with a coworker,\" etc. If you understand the position and why you want it, everything after was fairly easy."}, {"date": "17 Jul 2014", "title": "Unit Se Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Northwestern Medicine", "Interview Descriptions": "It was very easy going and the managers are great. Always ask to shadow to make an everlasting impression on the hiring manager. Went in Monday for interview knew the same day I had got the job", "Interview Questions": "What are you weaknesses?"}, {"date": "16 Apr 2015", "title": "Patient Service Representative Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Northwestern Medicine (Chicago, IL) in Jul 2014", "Interview Descriptions": "After applying online, applicants must complete an hour-long survey online. Next was a phone interview, then an onsite interview. 1-2 weeks between each, so expect to have time in between where there is no communication whatsoever.", "Interview Questions": "Describe a time when you dealt with a difficult customer. How did you handle the situation?"}, {"date": "19 Jul 2014", "title": "Supply Chain Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Northwestern Medicine (Chicago, IL) in Jun 2014", "Interview Descriptions": "Applied online and received an email 8 weeks later stating they were seeking other candidates.  4 weeks after that I received a phone call from HR to see if I was still interested. \r\n\r\nI came in for 2 separate interviews, one with HR and the other with 2 supply chain managers. After my interviews I was told I'd receive a case study to complete. \r\n\r\nThe case study was never sent and I received a phone call from HR 3 weeks later informing me for a second time that they are pursuing other candidates.", "Interview Questions": "Why Northwestern? "}, {"date": "26 May 2014", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Northwestern Medicine", "Interview Descriptions": "The interview involved a shadow day followed by a group peer interview by the current unit staff as well as meetings with the department managers and directors.  I was interviewing for two different positions within the same department so part of the shadow experience was to determine if one of the positions would be a better fit than another.", "Interview Questions": "Clinical questions were presented in a very broad manner."}, {"date": "14 Apr 2014", "title": "Staff Nurse Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Northwestern Medicine", "Interview Descriptions": "Must fill out application on website. Straightforward interview/hiring process.", "Interview Questions": "there weren't any unexpected questions. It was all very straightforward."}, {"date": "29 Apr 2015", "title": "Social Work Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Northwestern Medicine (Chicago, IL) in Apr 2014", "Interview Descriptions": "The interview process was pretty much straight forward. I received a call or phone screening to begin. We set up the in person interview which was team based. They asked straight forward questions and it was a breeze. I then followed up with a one on one interview with the director", "Interview Questions": "Why am I intrested in the postion"}, {"date": "11 Mar 2014", "title": "Physician- Hospitalist Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Northwestern Medicine", "Interview Descriptions": "You need to be top 5 percent of your graduating class to get an interview. For every 100 applicants, about 5 get interviews. Highly sought out location and organization. I would not apply unless you have been exceptionally successful. Especially the hospitalist group which is a highly skilled group of doctors.", "Interview Questions": "They will grill you on what you can contribute to the organizaiton. "}], [{"date": "24 Apr 2014", "title": "Property Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Northwestern Medicine in Mar 2014", "Interview Descriptions": "I applied on the website and got an immediate phone call from the HR Manager.  We spoke for about 30 minutes on my current position and why I was looking to change my position.  Everything was very straightforward.  She really enjoyed our conversation and immediately asked me to come in.", "Interview Questions": "They asked academic type of questions, none that stood out to be difficult.  Not the usual questions during an interview.  "}, {"date": "2 Jun 2017", "title": "Medical Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Northwestern Medicine (Chicago, IL) in Feb 2014", "Interview Descriptions": "Three peers interview prospective employees. Then if accepted the laboratory supervisor will interview you one to one. They are looking for a positive personality , flexibility and work ethic, as well as ability.", "Interview Questions": "What software do you have experience with. Are you able to be flexible and work all shifts if needed.\r\n"}, {"date": "22 Jan 2014", "title": "Practice Manager Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Northwestern Medicine", "Interview Descriptions": "Applied online, completed phone screen.  Then called in for interview with Director, and a 2nd interview with a physician at the practice.  I assume I did not get the job; but no one ever followed up and formally rejected me.  The same thing happened with someone else I know that interviewed for a different position.  They do not let you know if you were not selected, even when you have interviewed in person.", "Interview Questions": "N/A"}, {"date": "9 Nov 2016", "title": "Patient Access Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Northwestern Medicine (Chicago, IL) in Dec 2013", "Interview Descriptions": "Scheduling and assisting patients, insurance verification, and proving excellent customer service. We are also the front face of Northwestern, and assist patient's daily with a variety of needs, and requests. We send messages to doctors, page physicians, and other clinical staff. We also take messages to send directly to a variety of staff members.", "Interview Questions": "What are your strengths, and what are you weaknesses?\r\nName one time you weren't able to meet a patient's expectations, and how did you handle the situation?"}, {"date": "8 Feb 2014", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 1 day. I interviewed at Northwestern Medicine (Chicago, IL) in Dec 2013", "Interview Descriptions": "I received a phone interview which I thought went quite well. The interviewer was very polite and prompted some really precise answers to her questions.", "Interview Questions": "Have I ever been in a position where I had to make an important decision for the company."}, {"date": "16 Nov 2013", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Northwestern Medicine (Chicago, IL)", "Interview Descriptions": "I applied on-line and was contacted by HR.  I was living cross country so they initially did a phone interview with Human Resources.  I then flew in and interviewed with the manager, received a tour of the Unit and was offered the position.", "Interview Questions": "N/A"}, {"date": "27 Jan 2014", "title": "Customer Service Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Northwestern Medicine (Chicago, IL) in Nov 2013", "Interview Descriptions": "I applied online and received a call from Human Resources to schedule a phone interview, after the phone interview I was asked to come in for a formal interview. After the in-person interview i was told that someone would contact me within a week and I never received a call and when I called and left a message no one returned my call.", "Interview Questions": "They asked if I had any experience with their hospital software and said they were looking for someone who had experience with their software. My resume clearly stated what software I had experience in, what a waste of my time and theirs."}, {"date": "2 Nov 2013", "title": "Coder Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Northwestern Medicine", "Interview Descriptions": "I applied online and was contacted by HR just a couple of weeks later. I had an initial phone interview with HR and then an in-person interview with the coding manager. The interview was great; no unexpected questions and the manager made me feel very welcome. A week after the interview I was contacted by HR and offered the position.", "Interview Questions": "What is your greatest weakness?"}, {"date": "6 Jan 2015", "title": "Patient Access Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Northwestern Medicine in Oct 2013", "Interview Descriptions": "I applied online and received a phone call a week or two later. I had a phone interview, then came in to interview with a panel of three department managers from various departments. They asked the basic interviews questions......why was I looking for employment, what could I offer the company, how would I handle difficult situations.....", "Interview Questions": "How would you handle an irate patient."}, {"date": "7 Jul 2016", "title": "Operations Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Northwestern Medicine (Chicago, IL) in Oct 2013", "Interview Descriptions": "I applied through their website and received a phone-call from HR as an initial prescreening.  I was then invited to meet the managers for an in-person second interview.  I was interviewed by several department heads and asked various questions.  The overall interview lasted two hours.", "Interview Questions": "Why do you want to work at Northwestern Medicine?"}], [{"date": "27 Aug 2015", "title": "Patient Access Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Northwestern Medicine (Chicago, IL) in Nov 2012", "Interview Descriptions": "The interview process consisted of the following: first I received a phone call informing to to come in for an interview based on the resume I submitted. We set up a date and time, and I met with the manager as well as a few of the physicians I would be working closely with. It went very smoothly.", "Interview Questions": "What do you consider a weakness of yours?"}, {"date": "26 Jan 2016", "title": "Administrator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Northwestern Medicine (Chicago, IL) in Sept 2012", "Interview Descriptions": "The hiring process is all about fit in the company. There is an interview with HR and then if you make it through, there is an interview with the team you will be working with,", "Interview Questions": "What book are you reading now?"}, {"date": "23 Jan 2013", "title": "Data Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Northwestern Medicine (Chicago, IL) in Oct 2010", "Interview Descriptions": "I applied online in the Northwestern job search website. Within a couple of weeks, I received an offer for an interview. During the interview, I taked to a Clinical Operations Manager, who asked about my background and went through my resume with me. I  also met other supervisors.", "Interview Questions": "What is your biggest weakness?"}, {"date": "30 Jan 2014", "title": "Housekeeping Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Northwestern Medicine (Chicago, IL) in Aug 2010", "Interview Descriptions": "Just want to know if you can perform the job. Previous experience", "Interview Questions": "N/A"}, {"date": "28 Sept 2009", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Northwestern Medicine (Chicago, IL) in Sept 2009", "Interview Descriptions": "Applied for position online, had a phone interview about basic hr questions.  Was not called back", "Interview Questions": "Describe yourself"}, {"date": "5 Dec 2012", "title": "Project Analyst Operations Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Northwestern Medicine (Chicago, IL) in Aug 2009", "Interview Descriptions": "After I submitted the application online, I got a call from the HR staff first and did phone interview. After I passed that the hiring manager called me for an interview. The next was one on one interview with the hiring manager and group interview after that.", "Interview Questions": "Most difficult was the group interview. I was asked many different type of questions not related each other."}, {"date": "31 Dec 2010", "title": "Patient Care Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Northwestern Medicine (Chicago, IL) in Mar 2009", "Interview Descriptions": "I would suggest to candidates to keep applying to get your name seen. I applied 5 times before they called me in. It is best to find out who the recruiter is and then send them a cover letter and resume. DONT FORGET to send a thank you letter after the interview. After all it helped me land the job. Firt the candidate interviews with the HR recruiter. If you do well they take you to the manager of where you want to work. If not, they tell you we will contact you (but they will not) and they tell the manager you weren't a fit.", "Interview Questions": "What three words best descibe you?"}]]