[[{"date": "5 Jul 2023", "title": "Data Scientist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Stanford Health Care", "Interview Descriptions": "Phone screening, I had only one call with the hiring manager for 30 minutes. He tried to understand me as a person, he asked about my interests and my thesis. Asked why I choose this project, he tried to understand how am I thinking. Behavioral questions and so on.", "Interview Questions": "About your interest and projects"}, {"date": "21 Jun 2023", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Stanford Health Care (San Francisco, CA)", "Interview Descriptions": "The interview took three phases. First one was preparation, then the panel, It was a panel interview, 5 candidates, hirinibg manager and CN. The third with the hiring manager. Question we're hard.", "Interview Questions": "Tell me about a time you have to escalate an issue"}, {"date": "4 Jun 2023", "title": "Research Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Stanford Health Care", "Interview Descriptions": "Application: The first step is to submit an application, which usually includes a resume or CV and a cover letter. Some companies may also require candidates to complete an application form. Screening: Once the applications are received, the hiring team will review them to identify potential candidates who meet the basic requirements of the position. This may involve a quick evaluation of the resumes and cover letters to narrow down the pool of applicants. Initial Interview: The next stage is often a phone or video interview conducted by a recruiter or a member of the HR team. The purpose of this interview is to further assess the candidate's qualifications, experience, and fit for the role. It may involve questions about the candidate's background, skills, and motivations. Technical Assessment: Depending on the nature of the position, candidates may be asked to complete a technical assessment or task. This can involve coding tests, case studies, writing samples, or any other relevant exercise to evaluate the candidate's skills and knowledge. On-Site/Remote Interviews: Candidates who successfully pass the initial screening and technical assessment stages are usually invited for further interviews. These interviews can take place in-person at the company's office or remotely through video conferencing tools. The format may vary but often includes multiple rounds of interviews with different individuals or panels. a. Behavioral Interviews: These interviews focus on assessing the candidate's past behavior and how they handle various situations. Questions may revolve around teamwork, problem-solving, communication skills, and examples of accomplishments or challenges faced in previous roles. b. Technical Interviews: For technical roles, candidates can expect technical interviews to evaluate their expertise in specific areas. These interviews may involve solving technical problems, whiteboarding sessions, or discussing technical concepts and approaches. c. Managerial Interviews: In some cases, candidates may have interviews with managers or senior leaders to assess their fit within the organization's culture and values. These interviews may explore the candidate's leadership abilities, decision-making skills, and alignment with the company's vision. Reference Checks: Once the interviews are complete and the hiring team has identified their preferred candidate, they may reach out to the candidate's references to verify their qualifications, skills, and work history. This step helps confirm the candidate's suitability for the role and provides additional insights. Offer and Negotiation: If the candidate successfully clears all the interview stages and reference checks, the company may extend a job offer. This offer includes details such as compensation, benefits, start date, and any other relevant information. The candidate then has the opportunity to negotiate and discuss the terms before accepting the offer.", "Interview Questions": "Q: Walk me through your resume"}, {"date": "14 Jun 2023", "title": "Nurse Residency Program Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Stanford Health Care (San Jose, CA) in Jun 2023", "Interview Descriptions": "Panel interview with 4 candidates plus HR, unit manager, and residency program team members. I personally attended a zoom meeting that explain the process of interview and interview strategies which was super helpful!", "Interview Questions": "Tell us about a time you advocated for your patient."}, {"date": "3 Jul 2023", "title": "Data Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Stanford Health Care (Palo Alto, CA) in Jun 2023", "Interview Descriptions": "I received an email from the Project manager to establish the slots of time when we could meet for a quick meeting, once we met, the PM asked me a few questions.", "Interview Questions": "Career goals Questions about projects Why Stanford"}, {"date": "6 Jul 2023", "title": "Hospital Technician Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Stanford Health Care (Palo Alto, CA) in May 2023", "Interview Descriptions": "Took approximately 30 days after submitting an application before being selected for an interview. It was a panel interview with 4-5 people with a bunch of behavioral questions. They really just wanted to see your experience and how you'd manage in different scenarios.", "Interview Questions": "Tell us about a time you had to deliver difficult news to a patient or family member."}, {"date": "27 Apr 2023", "title": "Undergraduate Intern Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Stanford Health Care (Palo Alto, CA)", "Interview Descriptions": "Multiple interviewers, straight forward interview with behavioral questions. Asked about experience, why I wanted to participate in this opportunity, what I would bring to the table. Interviewers were nice. Didn't seem like they had truly read my resume though. Ultimately, decided not to go through with the internship after many miscommunications, being left in the dark, and a lack of organization.", "Interview Questions": "How did you handle conflict?"}, {"date": "10 May 2023", "title": "Patient Access Representative Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Stanford Health Care (Redwood City, CA) in Apr 2023", "Interview Descriptions": "I had conducted a group interview with access team and the manager got up and left during the interview and then came back into the virtual interview. Saying he didn't know about next steps on the role but had 5 people in the interview for over an hour. The manager asked off the mark odd questions. The lead representative called me in at 8am in the morning with no pre-text email heads up. They later cancelled the role 48-hours after I interviewed but then reposted it. Didn't respond to thank you notes. Huge waste of time, unprofessionalism, discrimination.", "Interview Questions": "What would you do if a doctor asked you to do something but its against policy."}, {"date": "27 Apr 2023", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Stanford Health Care (Palo Alto, CA) in Apr 2023", "Interview Descriptions": "Initially had a phone call interview from the hiring manager, it was 20 mins and included patient scenario “who would you see first” type stuff. Had a zoom panel interview following the phone interview, which included 3 managers from different units. This interview was around 45 minutes, they asked me to walk them through my resume, we went through behavioral and patient scenarios, and I had to interpret cardiac rhythms. Overall interview process was great, I felt like they really made me comfortable during the process. It took exactly 26 days in total from the day I applied to the day I got offered.", "Interview Questions": "What do you like to do in your free time?"}, {"date": "12 Jun 2023", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Stanford Health Care (Palo Alto, CA) in Apr 2023", "Interview Descriptions": "Panel interview on a zoom call with 6 people (4 nurses, HR and unit manager). I was asked 6 behavioral questions and 3 clinical questions. Overall, interview took about 40 minutes.", "Interview Questions": "Behavioral: tell me about yourself, name a time when you didn’t know what to do, name a time you disagreed with authority, strengths & weaknesses, tell me about diversity, tell me how you deal with conflict from patients Clinical: stroke scenario, DM scenario and 3 patients, who do you see first?"}], [{"date": "2 May 2023", "title": "Registered Nurse, BSN Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Stanford Health Care (Palo Alto, CA) in Apr 2023", "Interview Descriptions": "I submitted my application for several positions through their Jobs website and waited for more than a week for a response. I had a phone call where I was informed that I did not meet the requirements for the position, as well as two Zoom interviews where it was determined that I did not have the necessary skills and experience, such as Epic charting and strong telemetry skills. \r\n\r\nDespite my efforts, I was not successful in securing any of the positions I applied for, which has been discouraging. There was one role where the hiring staff attempted to contact me multiple times over the course of three days, but unfortunately, I was occupied with other obligations at the time. By the time I was available to schedule an interview, the position had already been filled due to lack of response from me.", "Interview Questions": "Why do you want to work for Stanford Health Care? How do you want us to remember you? Why should Stanford Health Care hire you? Tell me about a time when you did not adhere to policy. ECG/EKG strip interpretation & management of the patient's condition, Prioritization of patients"}, {"date": "16 Mar 2023", "title": "Administrative Assistant II | Planning Design + Construction Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Stanford Health Care in Mar 2023", "Interview Descriptions": "Disappointing experience overall to a once highly anticipated opportunity. Per the other interview experiences on here, the communication during the interview process was unnecessarily dragged out. I had to reach out the coordinating Executive Assistant several times to get an answer on who I would be interviewing with. When I finally interviewed, the team iterated how busy they were and needed this position filled asap. Meanwhile the soonest next step interview was two weeks out and I was sent the same blank invite, going in circles trying to find out who I would be interviewing with and never getting a response. Ultimately, I decided to withdraw. not what I expected coming from a place like Stanford.", "Interview Questions": "Tell me about your experience and how it correlates to this role?"}, {"date": "30 Mar 2023", "title": "Patient Financial Clearance Representative Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 1 week. I interviewed at Stanford Health Care (Newark, CA) in Mar 2023", "Interview Descriptions": "The interview wasn’t stressful, nor were there difficult questions. I felt more so that she reviewed my work experience than explaining anything about the role. The interview seemed rushed, the hiring manager spoke over me not allowing me to completely answer her questions, and I could tell she had made up in her mind that she wouldn’t hire me based on me being in my current role for 6 months. On the initial screening call, she asked how much PTO I currently have remaining which was odd. I quickly noticed the red flags and asked that she withdraw my candidacy. I sensed this department has a high turnover rate and low employee morale.", "Interview Questions": "1. How long does it take you to verify insurance in RTE? 2. Name two of your strengths and two weaknesses 3. If I were two reach out to your current or old employers, what would they say about you? 4. What has been one of your biggest challenges in working remotely? 5. Would you say you’re better working with insurance verification or prior authorizations?"}, {"date": "30 Apr 2023", "title": "Clinical Nurse II Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Stanford Health Care in Feb 2023", "Interview Descriptions": "K4 I did an interview over the phone and I felt like it went very well. She asked behavioral questions and about quality metrics and said I'd hear back next week. Next week comes, no word so I email them. No word again, so I email them again. I never got a response from them which really unprofessional of them. I get we're all busy, but it takes two minutes to send an email. Furthermore, I was sent a notice saying that the position was \"cancelled\" (instead of saying they've gone with someone else), which is a straight up lie because I know the person who got hired for that position over me. Do better.", "Interview Questions": "Tell me about a time you had to reprioritize"}, {"date": "25 Jan 2023", "title": "New Grad RN Residency Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Stanford Health Care", "Interview Descriptions": "The interview process was with the managers of each of the floors that had availability. It was a panel interview style and there were three other interviewees on the interview as well.", "Interview Questions": "What did you do when you were criticized?"}, {"date": "19 Jan 2023", "title": "Nurse Practitioner Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Stanford Health Care", "Interview Descriptions": "Very long process, multiple interviews from phone screening to zoom or in person meeting with various providers and clinic staff. Long delays with decision process and HR package offer. Longer delay with background checks and privileges'", "Interview Questions": "why do you want to work here"}, {"date": "19 Jan 2023", "title": "Nursing Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Stanford Health Care", "Interview Descriptions": "applied online through the NRP program for new graduate nurses; lengthy application with 4 prompts but no need for recommendation letters; needed a resume, cover letter, and online application; took about two months to heart back from them.; received an invite for the first interview.", "Interview Questions": "why stanford? why wants to work here?"}, {"date": "29 Mar 2023", "title": "Registered Nurse Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Stanford Health Care (Palo Alto, CA) in Jan 2023", "Interview Descriptions": "Panel interview on Zoom with about four people ( nurse manager, nurse assistant manager, educator, etc). Everyone asked their own questions whether it was behavioral or clinical scenarios. And then they talked about the unit I applied for.", "Interview Questions": "Tell us about yourself. Short term and long term goals. Clinical scenarios such as, cardiac tamponade."}, {"date": "11 Dec 2022", "title": "Case Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Stanford Health Care", "Interview Descriptions": "Too many people in the interviews, made it confusing over video. Company was very slow to move through the interview process and they made some mistakes in scheduling which also slowed things down.", "Interview Questions": "Tell us about a time when you got overwhelmed at work, what did you do and what was the outcome?"}, {"date": "23 Nov 2022", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Stanford Health Care", "Interview Descriptions": "The process was smooth and straightforward. They were responsive and communicated well. There was only one round of interviews and the company culture felt welcoming. I did my interview over zoom.", "Interview Questions": "What atmosphere do you work best in?"}], [{"date": "17 Nov 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Stanford Health Care", "Interview Descriptions": "I had one interview with the travel agency followed by an interview with the manager. Most of the questions asked about experience and strengths/weaknesses. Otherwise interview was very straightforward. Offer was given within one week of interview process.", "Interview Questions": "What are your strengths and weaknesses?"}, {"date": "13 Oct 2022", "title": "Human Resources Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 3 months. I interviewed at Stanford Health Care", "Interview Descriptions": "I have interviewed for 2 different HR Assistant positions, and have had bad communication with both. It takes about a month after submitting an application to hear back. For one role it took 6 weeks to hear back after the interview, and for the other role I was completely ghosted.", "Interview Questions": "Why do you want to work for Stanford?"}, {"date": "28 Feb 2023", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 8 weeks. I interviewed at Stanford Health Care in Oct 2022", "Interview Descriptions": "It was a set of online panel interviews. Each person had to answer the same question and we all did it in a row. We were all going for the same position and all the questions were situational.", "Interview Questions": "Describe a time when you dealt with a difficult patient"}, {"date": "14 Jan 2023", "title": "Coding Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at Stanford Health Care (Palo Alto, CA) in Oct 2022", "Interview Descriptions": "2 part test and 1 interview. The coding test was fairly easy. The interview lasted 30 minutes, it was very short. Had to send over an education presentation as well. Not too difficult but consisted of many parts.", "Interview Questions": "How I would handle a coder and auditor disagreement."}, {"date": "20 Mar 2023", "title": "Program Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Stanford Health Care in Oct 2022", "Interview Descriptions": "Completed an online skills test and then had an interview about a month after the initial application. Great engagement with the interviewer, and he said my profile was a better fit for a different role and that he would put me in touch with a different hiring manager. I was then promptly rejected by the other role he thought I'd be a good fit for.", "Interview Questions": "What are you most passionate about in your work?"}, {"date": "22 Sept 2022", "title": "Clinical Supervisor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Stanford Health Care", "Interview Descriptions": "The process was to be expected for the role I applied for.  They were courteous and kind. I enjoyed meeting the hiring manager.  The communication was excellent from start to finish. ", "Interview Questions": "Moderate interview questions, some difficult ones"}, {"date": "13 Sept 2022", "title": "New Grad RN Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Stanford Health Care", "Interview Descriptions": "Myself and three other candidates on a panel interview. Panel had about five or six people on it, filled with staff and supervisors from the floor. Asked us four or five questions.", "Interview Questions": "Tell us about a time that you described constructive feedback? What was the feedback? What did you learn from it? "}, {"date": "17 Aug 2022", "title": "Patient Referral Coordinator Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Stanford Health Care", "Interview Descriptions": "I feel like the process itself was very long in regards to getting a response from someone, but the questions were easy and to the point but honestly I felt like it was a super easy process to go through and applying for the position was easy as well.", "Interview Questions": "Why do you want to work for this position/department?"}, {"date": "14 Jul 2022", "title": "BSA Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Stanford Health Care", "Interview Descriptions": "There were two interviews over Zoom.   The first round was with the hiring manager and a member of the team. The second interview was with the hiring manager and several team members from other departments that would work closely with the role.", "Interview Questions": "I was asked about my previous experience, how it related to the current job, and how I address troubleshooting issues."}, {"date": "1 Jun 2022", "title": "Assistant Patient Care Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Stanford Health Care", "Interview Descriptions": "Behavioral based interview that was about an hour long. Questions focused on specific situations and outcomes.  There was about 6 different types of situation questions and a review about your resume.", "Interview Questions": "If you see someone that looked lost in the hallway what would you do? "}], [{"date": "22 May 2022", "title": "New Grad RN Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Stanford Health Care", "Interview Descriptions": "It was a mix between behavioral and evidence based questions. Interviewed by a panel that was made up of health educators, managers, and other new grad nurses who were applying.", "Interview Questions": "Behavioral questions and evidence based questions"}, {"date": "18 May 2022", "title": "Data Science Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Stanford Health Care", "Interview Descriptions": "There were total three rounds:\r\n1. Screening round: This round talked about technical skills mostly questions based on your resume, your projects you did.\r\n2. Project presentation: Prepare and Give formal presentation about one of the machine learning/data science  project to the team.\r\n3. HR: Discussing the salary and joining details before giving official offer.", "Interview Questions": "Why I use specific approach while working on my ML project?"}, {"date": "16 May 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Stanford Health Care", "Interview Descriptions": "It was a panel interview with 3 other candidates. The leadership team was very kind! The person asking questions was actively acknowledging every candidates answers. It was a great interview experience.", "Interview Questions": "Why do you want to work for Stanford Healthcare?"}, {"date": "13 May 2022", "title": "Physical Therapist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Stanford Health Care", "Interview Descriptions": "Human Resource Contact email for screening to set up interview.\r\nManager Interview - screening and explanation of department size, department organization, overview of general department and procedures, discussion of general schedule and expectations.\r\nTeam Interview with clinical questions for knowledge and fit.", "Interview Questions": "Clinical and interpersonal questions regarding specific situations"}, {"date": "13 May 2022", "title": "Front Desk Receptionist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Stanford Health Care", "Interview Descriptions": "a few interviews with multiple people. about 30 minutes each just discussing the type of work I do and who I am. the interview was easy and the process went smooth overall", "Interview Questions": "Tell me a little about yourself"}, {"date": "9 May 2022", "title": "Patient Care Assistant (PCA) Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Stanford Health Care", "Interview Descriptions": "Phone screen first 1 on 1 and they will inform you shortly if you pass. If you pass, a formal interview is scheduled shortly. The interview is a panel of people and can be time consuming.", "Interview Questions": "Can you tell me about yourself?"}, {"date": "12 May 2022", "title": "Business Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Stanford Health Care", "Interview Descriptions": "Multiple informal interviews allowed me to get to know the team and ask questions about the role, the team, and the organization in general. A friendly environment made me feel comfortable showing both my weaknesses and strengths during the process.", "Interview Questions": "Name a business problem and how you structured the solution"}, {"date": "13 Apr 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Stanford Health Care (Palo Alto, CA)", "Interview Descriptions": "I had a phone interview that was more general \"get to know you, get to know me\" type, and an in-person interview that was more scenario and clinical-based. Overall it was a pleasant experience.", "Interview Questions": "How do you manage stressful situations "}, {"date": "7 Apr 2022", "title": "RN-2 Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Stanford Health Care", "Interview Descriptions": "Group interview with about 10 to 13 questions. Overall a zoom interview so was only able to see one face at a time.  Pretty normal type interview with a set of behavior questions.", "Interview Questions": "What are you long term and short term goals in nursing "}, {"date": "24 Mar 2022", "title": "Registered Nurse Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Stanford Health Care", "Interview Descriptions": "There were too many interviews for one position. For one nursing position I had to do 5 rounds of interviewing and had to take multiple days off from work. The interview was with the medical assistants, nurses, managers, director, and head director.", "Interview Questions": "Tell us about a time you made a mistake."}], [{"date": "22 Mar 2022", "title": "Director, Patient Care Services Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Stanford Health Care", "Interview Descriptions": "It was multiple panel interviews plus an interview with the hiring manager.  The process included:\r\nTell us about yourself.\r\nThere were several behavioral based interview.\r\nDiversity and Inclusion and Health Equity Questions\r\nOpportunity to ask questions\r\nNext steps.", "Interview Questions": "Tell us about a situation where a patient or team member felt they were not treated fairly."}, {"date": "22 Jan 2023", "title": "Data Scientist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Stanford Health Care (Stanford, CA) in Mar 2022", "Interview Descriptions": "My first interview was with the hiring manager, who was was very personable and sincere. It wasn't a position for new grad, so it was very straight forward. We talked about my project experiences and my skills, she told me the expectations and wanted me to kind of \"promise\" that I wouldn't leave this position soon (several years) after I get this offer. I had no idea how to respond because I didn't know the benefits and the culture at all. A week later, the HR scheduled a call with me and told me all benefits. I decided to move forward but never got any response anymore. A month later, I was told by a systematic email that they hired someone else.", "Interview Questions": "are you willing to relocate what have you been doing for your current job"}, {"date": "8 Apr 2022", "title": "Program Project Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Stanford Health Care (Fremont, CA) in Mar 2022", "Interview Descriptions": "required 3 separate interviews: phone screening, first interview, second interview with Director. The team were very prompt in scheduling these interviews. Moderately difficult questions so try to fully understand the department goals/mission and ensure that you can explain your resume and how it aligns with the position's job description", "Interview Questions": "Tell me about a time you had to implement a new process despite colleagues/team did not agree on. What was the turn out? Lessons learned?"}, {"date": "16 Feb 2022", "title": "Data Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Stanford Health Care (Palo Alto, CA) in Feb 2022", "Interview Descriptions": "I met with the two managers, four other analysts, and the director. I interviewed for the data analyst role, but then the Director interviewed me for developer role. Obviously, there was a miscommunication between the director and managers.", "Interview Questions": "Describe a project you worked on that had a big impact on the company."}, {"date": "12 Jan 2022", "title": "Project Manager Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Stanford Health Care", "Interview Descriptions": "Behavioral interview, send work samples, case study, final interview with team, and group interview with stakeholders. A robust process that tested the skillset of the project manger end to end.", "Interview Questions": "Talk through real life case study, meet the team members,  typical behavioral questions"}, {"date": "11 Jan 2022", "title": "Program Project Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. I interviewed at Stanford Health Care", "Interview Descriptions": "I was first reached out to be a recruiting agency and had a phone screen with the Business Operations Manager. Afterwards, I was then was brought on site for an in person panel interview with the team.", "Interview Questions": "The questions asked were behavioral and situational questions."}, {"date": "5 Jan 2022", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Stanford Health Care", "Interview Descriptions": "the interview process was fairly quick and simple and everyone i talked to was very kind and welcoming. i had an initial phone call with the lab manager and then a Zoom interview with the PI.", "Interview Questions": "Where do you see yourself in 2 years"}, {"date": "9 Mar 2022", "title": "Clinical Nurse II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Stanford Health Care in Jan 2022", "Interview Descriptions": "Pretty easy overall. I submitted my resume online (no cover letter required) and was contacted by an ANM within a week via phone call. The phone call was chill though I was asked several interview-like questions (tell me about your work experience, what would you do in this situation?). I was then scheduled a panel group Zoom interview with the Nurse Leadership Team that lasted about 45 mins. There were about 8 questions of average difficulty consisting of general behavioral ones with two situations", "Interview Questions": "Tell me a time you provided a co-worker with constructive feedback."}, {"date": "24 Mar 2022", "title": "New Grad Nurse Residency Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Stanford Health Care in Jan 2022", "Interview Descriptions": "Zoom panel with 4 other applicants and unit managers. No time for questions from applicants, just answering behavioral style interview questions from facilitator. Average response for each applicant was ~2 minutes.", "Interview Questions": "Tell us about a time where you showed empathy."}, {"date": "31 Dec 2021", "title": "New Grad RN Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Stanford Health Care", "Interview Descriptions": "Panel interview with 4 candidates, 2 managers, and an assistant manager. It was well balanced questioning with 4 questions of similar themes for each candidate. Candidates were asked to briefly introduce themselves and then provide answers of ideally no more than 60 seconds in length.", "Interview Questions": "Tell us about a time you fell behind in your patient care. How did you handle it, what did you learn?"}], [{"date": "14 Feb 2023", "title": "Student Services Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Stanford Health Care (Stanford, CA) in Dec 2021", "Interview Descriptions": "Great. Friendly even though it's a panel. It's a rigorous process but once you get the job, it's an amazing place to work at. Interview process straight to the point with professional demeanor.", "Interview Questions": "Why should we hire you."}, {"date": "26 Oct 2021", "title": "Patient Care Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Stanford Health Care in Oct 2021", "Interview Descriptions": "Quick. Easy. Thorough. Interviewer asked insightful questions and answered all of my own questions regarding the position. Friendly and helpful, still keeping honest as well. Looking forward to the next steps.", "Interview Questions": "How do you think your skills fit this position?"}, {"date": "27 Oct 2021", "title": "Staff Nurse (RN) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Stanford Health Care in Sept 2021", "Interview Descriptions": "Applied online, waited for about a week and got a call for a quick 15 min phone screen with the assistant nurse manager. Scheduled an in-person interview. Went in and had a panel interview with 3 nurses, all of whom were assistant managers. I was asked mostly behavioral questions, some clinical scenarios, and to interpret tele strips. Interview lasted about 30-40 mins. Got an email the same day to request for references. Was offered the position by HR (who texted me an offer, weird, I know) at the end of the day on a Friday. Accepted the offer and happy to be part of the team :)\r\nOnly issue was with HR, apparently she’s new but made a mistake in offering me a sign-on bonus when my dept is not eligible, sending me on-boarding docs last minute (the day they’re actually due), and having me send her my resume and getting an auto-reply that she’s on PTO -_-\r\nOther than that, interview process with staff is great, they are responsive and quick to answer phone calls/emails", "Interview Questions": "What did you do to improve patient communication?"}, {"date": "6 Jan 2022", "title": "Marketing Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2+ months. I interviewed at Stanford Health Care in Sept 2021", "Interview Descriptions": "they did not conduct a phone screening. interviews consisted of two virtual panel interviews, one with the immediate team/colleagues/manager and another with the managers' colleagues. there were also a bunch of random calls and emails from the hiring manager. the manager said it would be a quick process but drew it out for weeks, stringing me along the way. while the Stanford name impressed me when applying, the team doing the interviews did not. the application/interview process is a two-way street and i didn't appreciate that this team didn't leave time to ask questions or bother to respond to them when e-mailed after the interview. all in all a poor experience.", "Interview Questions": "tell me about yourself; describe a time when, etc."}, {"date": "8 Aug 2021", "title": "New Grad RN Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Stanford Health Care", "Interview Descriptions": "I applied online and once selected, I was given a time to do a panel interview with 2 other applicants. The panel interviewers were very kind and the team seemed excellent.", "Interview Questions": "tell me about a time when you learned about someone's cultural background and how you adapted the plan of care"}, {"date": "9 Aug 2021", "title": "Floater, Psr Lll Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Stanford Health Care", "Interview Descriptions": "phone interview first , than in person interview. group interview, then an offer if accepted. verbal offer than written offer and accept, and start the hiring process. for it was good, very informative.", "Interview Questions": "Give me a time when you solved a problem with a co wokrer. "}, {"date": "22 Jul 2021", "title": "RN New Grad Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Stanford Health Care", "Interview Descriptions": "It was a panel interview. There were several people doing the interview including managers, assistant managers, and nurse educators. There were two sections. Overall, it was a scary experience for me.", "Interview Questions": "Why do you want to work with us?"}, {"date": "16 Jul 2021", "title": "Senior Project Manager Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at Stanford Health Care", "Interview Descriptions": "Very smooth and stream lined process. Was quick discussion with hiring manager couple of times and quick interview with team members. Templates question. Compensation offered is based on not your talent or ability. It’s based on other similar position in department compensation so no matter how good you are or hard you work, other members in the team at similar position decided your fate. In my opinion in the world we live in is not a fair way to evaluate.", "Interview Questions": "Explain incident where you had to make hard decision without everyone’s consent."}, {"date": "10 Sept 2021", "title": "Administrative Associate II Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Stanford Health Care (Palo Alto, CA) in Jun 2021", "Interview Descriptions": "My position was for the Pathology Department. The process went smoothly in terms of the one-way interview and the three face-to-face interviews I did for the position. I was told that there would be a decision made after 2 weeks. The day after the interview, I was told that they would contact me the next day about reference checking. It never happened. After two weeks, I wrote an email about any updates and they said the hiring manager hasn't made a decision. I followed up after a month, and no response. I emailed again, but one of the other interviewers this time, and still no response. It's been more than 3 months now and I've accepted the fact that I have been ghosted. I wouldn't have been mad if they said they moved on with someone else, and I would've given the process a 5/5. Going from being friendly to ghosting makes it a negative experience.", "Interview Questions": "How do you prioritize handling multiple tasks and/or projects?"}, {"date": "28 Jul 2021", "title": "RN CDU Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Stanford Health Care (San Jose, CA) in Jun 2021", "Interview Descriptions": "The interview was conducted over zoom. There was a panel of 7 or so people and four people interviewed at a time. Four questions were asked, at the end  of the interview there was no option to ask any questions.", "Interview Questions": "Tell us about a time you had Conflicting beliefs with a patient or staff member. "}], [{"date": "17 May 2021", "title": "Nursing Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Stanford Health Care", "Interview Descriptions": "there nice and respectful. after my phone interview I got a call after 4 days she called me  for a panel interview. But I canceled it because I already accepted the other hospital job.", "Interview Questions": "What are your weaknesses and strength?"}, {"date": "9 May 2021", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Stanford Health Care", "Interview Descriptions": "The inteveiew was based on situational questions and things that you did during preceptorship and what the outcome was. There was a panel and 4 intrrveiw prospects along with the panel from all the differbt departments. After the panel interview and you get selected it moves on to a private interview", "Interview Questions": "Tell me a time when your plan of action changed "}, {"date": "12 Apr 2021", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Stanford Health Care", "Interview Descriptions": "Zoom interview due to Covid which was very convenient. Quick screening process with questions relating to customer service and alignment with Stanford values.  Allowed time for questions about the organization at the end", "Interview Questions": "Why Stanford? What does service excellence mean to you? "}, {"date": "2 Apr 2021", "title": "Laboratory Assistant III Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Stanford Health Care", "Interview Descriptions": "Pretty straightforward interview. The interview was with Becky (CLS) and Kenji (Operations manager) and was mostly questions on how I handle stress and how well I work with \r\ncoworkers.  Other questions that were asked during the interview were just standard interview questions that you would be asked about at any other interview.", "Interview Questions": "How do you deal with stress from work? "}, {"date": "30 Apr 2021", "title": "Financial Counselor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Stanford Health Care (Palo Alto, CA) in Apr 2021", "Interview Descriptions": "I was set up with a zoom interview. Three people were to attend the interview, two of which were at least ten minutes late. This didn't feel like a professional interview but more like an interrogation. The request was for a zoom VIDEO call and two of the three interviewers never even turned their video on. One of the interviewers was just flat out rude. This was not a professional interview and Stanford Health Care should be aware of this.", "Interview Questions": "Many of the questions were not even clear/concise. "}, {"date": "24 Mar 2021", "title": "Digital Health Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Stanford Health Care", "Interview Descriptions": "Applied online and initially received a generic rejection email. \r\n\r\nA month (?) later, received an email from the hiring manager to discuss my experience. This was a standard behavioral interview where I shared experiences and learned about their work. After this interview was a case study, and if that went well, an interview with the director.\r\n\r\nThe next step was a 'case study' where I was given a couple of questions to use for a slide deck. I had a week to prepare -- and they estimated that I should take like 4 hours to work on it. \r\n\r\nAfter this second interview, I never heard back from the hiring manager and got the same generic rejection email ~2 months later.\r\n\r\nI probably would've preferred silence to the rejection email without any substance.", "Interview Questions": "Standard behavioral questions (tell me about yourself, talk about an experience when...., etc)"}, {"date": "24 Mar 2021", "title": "Project Management Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Stanford Health Care", "Interview Descriptions": "The interview was very comfortable and non-formal. For the most part it was like having a conversation and really trying to get to know me and me get to know the interviewees. Also a lot of explaining that regarding the culture of the organization", "Interview Questions": "What are your thoughts on Career Goals"}, {"date": "26 Mar 2021", "title": "Web Designer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Stanford Health Care in Mar 2021", "Interview Descriptions": "All video calls\r\n15 minute screening call with hiring manager\r\n1 hr panel interview (3 developers)\r\n1 hr interview with hiring manager (conversation about departments’ suite of applications and opportunities for design improvement)\r\n\r\nInitial contact about my application was unusual in that they just used a departmental email and signed off with the department name. I did not know who I was talking to until I was on the video call. In hindsight, I should have asked.\r\n\r\nPanel interview was a good experience, fairly relaxed and conversational and no trick questions. We walked through a graphic design and a web project in my portfolio.\r\n\r\nFirst and last interview with the hiring manager were a bad experience. They didn’t introduce themself and would not disclose their role in the department. In the initial call they asked repetitive questions. I interpreted this as I was misunderstanding the initial question, so I asked for clarification. But they didn’t not to provide any and just moved on. In the last interview, they asked unusual questions like “If another department offered you a job, would you leave this one for it?” and “Is your salary expectation higher or lower to your current salary?”.", "Interview Questions": "Tell me what you think the purpose of this job is and how your skills fit into it.\r\n"}, {"date": "2 Mar 2021", "title": "Clinical Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Stanford Health Care", "Interview Descriptions": "Two part process. Phone and in person/video(since it was Covid times) \r\n\r\nKnowledge test at the end. Lots of good questions and scenario based. Know yourself really well and have scenarios ready for all sorts of questions", "Interview Questions": "How do you show compassion?"}, {"date": "1 Jul 2021", "title": "Data Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Stanford Health Care (Palo Alto, CA) in Mar 2021", "Interview Descriptions": "There were three rounds: \n1. R1; Behavioral - was with the team manager\n2. R2; Data Presentation - was with the full team \n3. R3; Behavioral - was with the VP", "Interview Questions": "Tell us about a time you used data to tell a story. "}], [{"date": "15 Feb 2021", "title": "RN Traveler Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Stanford Health Care", "Interview Descriptions": "Very quick interview. Interviewer was kind and understanding. The interviewer was interested with my skills and what I can contribute, also what I am looking for in a hospital facility. The interviewer made me feel comfortable and excited to start a new job there.", "Interview Questions": "Why I wanted to work there:"}, {"date": "3 Sept 2021", "title": "Nursing Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Stanford Health Care (Stanford, CA) in Feb 2021", "Interview Descriptions": "The interview process was very formal and traditional. They asked appropriate questions for my position and were very professional. It was pannel-style and included two staff nurses as well as the unit manager (who was also a nurse). I felt that it was a very appropriate process and very similar to other interviews for similar positions.", "Interview Questions": "Tell me about a time that you had to deal with a difficult coworker and what do you do to overcome it? "}, {"date": "15 Apr 2021", "title": "Clinical Dietitian Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Stanford Health Care in Feb 2021", "Interview Descriptions": "Short phone interview w/ CNM, outlining daily jobs and responsibilities of RD + clinical nutrition questions related to pt care/daily prioritization/difficult pts + TF case study via email (reviewed by RD team)", "Interview Questions": "If multiple tasks that have the same deadline, how do you manage?"}, {"date": "9 Jan 2021", "title": "Graphic Design Intern Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Stanford Health Care", "Interview Descriptions": "It is nice.  At first three steps, it is responsive. It will need a design exercise. It takes 1 weeks. Then I go to interview.\r\n But it is not responsive in time at the final round. They should tell me whether I was accepted or not.", "Interview Questions": "Describe the your experience of design."}, {"date": "3 Jan 2021", "title": "New Grad RN Residency Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Stanford Health Care", "Interview Descriptions": "Zoom panel interview, with four questions per interviewee. There were the same questions for each person, so listen closely in the first round. Topic categories were teamwork, compassion, problem-solving, and patient advocacy. Also a introduction asking about you and why this institution is a good fit.", "Interview Questions": "Tell us about a time you had conflicting priorities."}, {"date": "11 Jan 2021", "title": "Patient Admin Specialist II Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Stanford Health Care (Redwood City, CA) in Nov 2020", "Interview Descriptions": "Got an email a month after applying. Set up a phone interview. After a couple weeks got another email to set up a zoom interview with the team. Still waiting to hear back.", "Interview Questions": "Tell me about yourself, strengths and weaknesses"}, {"date": "12 Jan 2021", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. I interviewed at Stanford Health Care (Palo Alto, CA) in Sept 2020", "Interview Descriptions": "Phone interview first . Then panel interview by team via zoom meeting. I was asked about 8-9 questions. Then I got offered on the same day and I accepted it.", "Interview Questions": "Tell me about the time you made a mistake and how did you correct it."}, {"date": "16 Aug 2020", "title": "Clinical Nurse Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Stanford Health Care", "Interview Descriptions": "first was the manage, second panel...waiting for the third round, I believe it will be with the doctors. I applied online and took weeks before someone gave me the first call for first screening.", "Interview Questions": "First screening was from the manager with few quick questions specifically  if your experience  fits the job. Second interview , panel about 4-6 I think..tell me about yourself, greatest weakness..mistake you've made, what can you bring to the table/job, communication style, how you manged a complex patient"}, {"date": "11 Aug 2020", "title": "Assistant Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Stanford Health Care", "Interview Descriptions": "Stanford Healthcare posts all open positions on their website.  The request that a CV be submitted over the website.  If they are interested in speaking with you, they will contact you via email to set up a call, followed by Phone call, then in person interview.", "Interview Questions": "How do you manage and resolve conflict among team members."}, {"date": "11 Aug 2020", "title": "Dietetic Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Stanford Health Care", "Interview Descriptions": "Fairly typical interview process, which involved being interviewed by the supervisors and department head at the hospital. Once they decided to move forward with me, I was then connected to the contract company. I later was transitioned to be a direct-hire employee.", "Interview Questions": "Mostly asked about prior qualifications and experiences (e.g. school background, work experiences in food/customer service roles). Asked about how I managed conflict, to name my strengths and weaknesses, etc."}], [{"date": "20 Aug 2020", "title": "New Graduate Registered Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Stanford Health Care in Jul 2020", "Interview Descriptions": "Panel with 4 other candidates. They ask you 4 questions from 4 categories (EBP, QI, Compassionate Care, Teamwork). Each person gets a different question from the categories. The managers will reach out to you for a second interview if they feel like you are a good fit for their unit.", "Interview Questions": "Can you tell me about a time when you were unable to provide evidence-based care because of a patient’s beliefs? What did you do and what was the end result?"}, {"date": "8 May 2020", "title": "Clinician Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Stanford Health Care", "Interview Descriptions": "This was a multi-step process. I had one phone screen with a recruiter, one phone screen with the department supervisor, one panel interview, and one additional interview with the medical director.", "Interview Questions": "Why do you want to work for Stanford, and why this service? "}, {"date": "15 Jul 2020", "title": "New Grad Registered Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Stanford Health Care (Stanford, CA) in May 2020", "Interview Descriptions": "Applied online, received an email to interview Summer 2020. Interview was via  zoom. 4 applicants (including self), 7 unit directors, and HR rep to facilitate. HR rep asked everyone 5 questions.", "Interview Questions": "Tell me about yourself"}, {"date": "3 Sept 2020", "title": "EH&S Program Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Stanford Health Care in Apr 2020", "Interview Descriptions": "The interview process involved multiple phone screening interviews,  a panel interview, and a meeting with the actual hiring manager. A few days later I was asked to speak with the hiring manager's boss (Sr. Director). I was told I would hear back with their decision soon. Well, it has been months without a word. \n\nThis lack of follow through and common decency to follow-up with someone who has gone through numerous interview rounds is definitely not what I expected from this organization. However, I was glad they showed me this side of their culture, which I want no part of.", "Interview Questions": "Why did I want to work at Standord HC?"}, {"date": "5 Apr 2020", "title": "Nurse Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Stanford Health Care", "Interview Descriptions": "It was about one hour long. Interview questions were initially pretty standard. For example, \"tell me about yourself.\" Progressed to scenarios such as \"tell me about a time you worked with a difficult patient.\"", "Interview Questions": "They did ask about formula for ICP and if I have worked with specific drips"}, {"date": "5 Mar 2020", "title": "Accountant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Stanford Health Care", "Interview Descriptions": "The interview process was not very long. The online application was a simple process. There was a brief phone interview to determine basic information and brought in for an in person interview with the department.", "Interview Questions": "What makes you stand out as an applicant?"}, {"date": "27 May 2020", "title": "Physician Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Stanford Health Care in Mar 2020", "Interview Descriptions": "First there was an over the phone interview which reviewed the position, benefits, etc. Then was an in person panel interview with the department team that lasted about 30 mins. Due to COVID, things were delayed for a few weeks. A decision was made 3 weeks after the in person interview.", "Interview Questions": "If a provider is giving you multiple instructions and talking quickly, how do you handle this situation? "}, {"date": "25 Mar 2020", "title": "Hematology/Oncology Fellow Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Stanford Health Care in Mar 2020", "Interview Descriptions": "The interview was over the phone for 30 mins and I was asked a series of questions by one of the NPs on board. I was asked specific questions from my resume about my experience as well as how I got into the field of practice.", "Interview Questions": "What rotation stood out the most to you and why?"}, {"date": "18 Dec 2020", "title": "Patient Administrative Specialist Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Stanford Health Care (Palo Alto, CA) in Mar 2020", "Interview Descriptions": "Slow to get started, but overall similar to all other processes. I had two interviews, I could have easily had 3 interviews maybe even four if all upper management staff were available.", "Interview Questions": "Complex questions and they kept a straight face the entire time."}, {"date": "26 Jan 2021", "title": "Social Work Interview Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Stanford Health Care (Palo Alto, CA) in Mar 2020", "Interview Descriptions": "Interview was conducted by phone only in March due to COVID. Unpaid internship led to a very casual interview. Interview lasted about 20 minutes. Interviewer went into great depth about what the role entailed and what their expectations were of their intern.", "Interview Questions": "Why do you want to intern as a medical social worker?"}], [{"date": "14 Feb 2020", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Stanford Health Care (Palo Alto, CA) in Jan 2020", "Interview Descriptions": "This consisted of a telephone interview followed by panel interview.  The telephone interview fairly easy; the panel interview intimidating because I couldn't \"read\" most of the panel.  Both interviews consisted of 100% behavioral questions, ugh.", "Interview Questions": "Describe a situation when you disagreed with your superior, and how did you handle it."}, {"date": "19 Jan 2021", "title": "RN New Grad Residency Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Stanford Health Care (Palo Alto, CA) in Jan 2020", "Interview Descriptions": "panel interview with nursing manager and 3 other students. Asked 4 behavioral questions, everyone took answer 1 of the behavioral questions until cycled through all question. Takes one hour long total.", "Interview Questions": "introduce yourself, behavior questions such as caring moment"}, {"date": "7 Mar 2020", "title": "Project Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Stanford Health Care (Stanford, CA) in Dec 2019", "Interview Descriptions": "Email screening and conversations. Two in-person interviews supposedly planned. I was only invited for the first one, which I attended and went very well. An HR person and the hiring manager interviewed me. Second planned interview was first delayed and then perhaps because of some internal policies etc. position was re-advertised. I was informed 2 months later about the interview outcome.", "Interview Questions": "Describe your past experience and how you are a fit to this role."}, {"date": "22 Feb 2020", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Stanford Health Care (Palo Alto, CA) in Dec 2019", "Interview Descriptions": "I applied online on the Stanford hospital website. The nurse manager called me about a week later and asked behavioral questions over the phone - I went in the next week for the interview", "Interview Questions": "Tell us about yourself? "}, {"date": "18 Dec 2020", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Stanford Health Care (Palo Alto, CA) in Dec 2019", "Interview Descriptions": "Interview with manager and 2 assistant managers, was in person. Interview lasted about 45 minutes. Got an offer in the afternoon after the interview. There was no interview with HR.", "Interview Questions": "Previous experience and situational based scenario questions"}, {"date": "9 Nov 2019", "title": "Admitting Registrar Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Stanford Health Care (Pleasanton, CA)", "Interview Descriptions": "Applied online,  contacted by the hiring manager over the phone to schedule the interview, interview consisted of a panel of 3 mangers, interview flowed, hired on the spot\r\nApplied online,  contacted by the hiring manager over the phone to schedule the interview, interview consisted of a panel of 3 mangers, interview flowed, hired on the spot", "Interview Questions": "Why do you want to work here?"}, {"date": "24 Jul 2019", "title": "Clinical Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 2+ months. I interviewed at Stanford Health Care (Palo Alto, CA)", "Interview Descriptions": "Pleasant phone screen with Assistant Nurse Manager, received email for in-person panel interview. The in-person interview last for around 50 minutes. Be prepared to answer many behavioral questions. The managers are very nice with warm smiling. Due to 500P new hospital project, the whole hiring and interview process goes slow, took up to 2+ months. Since the new hospital will open in Fall 2019, there are still a lot of variables, be prepared to be flexible.", "Interview Questions": "Have you made any mistakes? How did you deal with it? What did you learn from it?"}, {"date": "19 Jul 2019", "title": "Advanced Practice Provider Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Stanford Health Care (Palo Alto, CA) in Jul 2019", "Interview Descriptions": "I was invited to interview in-person for an APP role after two phone screens. I was not currently living in California when offered the interview.  When asked about possible reimbursement for travel, I was told Stanford does not reimburse for travel. Despite this, I decided to proceed with the interview because I believed it was a good opportunity. The day before my interview, I expected to receive an itinerary for the day; although I was in frequent contact with the interview coordinator, I never received an itinerary. First red flag. I was also not told about the format of the interview despite asking. As I entered the interview, the coordinator let me know that I would be asked clinical questions, which she 'had forgotten' to send to me the day before.  Another red flag. After the interview concluded, I was told that they would provide me with a decision in 1-2 weeks. 2 weeks passed and I had yet to hear anything.  I sent an email to the HR recruiter to follow-up; no response. I decided to log into the application website and saw that my application status had changed to 'No longer considered for the position.' The date of this status change was 1 week PRIOR to when I emailed the recruiter, and only a few days after my interview. I never received a formal rejection email or call, and had to find out via the website about my application status. I expected much MORE from an institution like Stanford, especially when I took the time to travel for the interview at my own expense. I believe that their interview process is extremely discourteous and uncouth. I will not recommend Stanford to any of my colleagues as a result.", "Interview Questions": "What is an issue that you foresaw potentially becoming a bigger issue and what did you do to prevent that?"}, {"date": "21 Sept 2020", "title": "Certified Nursing Assistant CNA Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Stanford Health Care (Palo Alto, CA) in Jul 2019", "Interview Descriptions": "1 week then phone interview after that panel with the hiring managers, im still waiting for the outcome of my interview.. still waiting gaming , not even received denial/rejection letter from the department I applied, they told me they will send email.", "Interview Questions": "Why Stanford "}, {"date": "22 Mar 2021", "title": "Research Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Stanford Health Care in Jul 2019", "Interview Descriptions": "Phone screen interview asking basic questions, why SHC then schedule for a video interview. Video interview were asking why this fellowship, name a time when you overcome a challenge? etc", "Interview Questions": "What are your strengths? What are your weaknesses?"}], [{"date": "8 Jun 2019", "title": "LVN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Stanford Health Care", "Interview Descriptions": "Not as intimidating as I expected. The manager was nice and personable. I was made to feel at ease. Straight to the point questions.  Usually I'm nervous, causing me to stutter a bit but the interviewer had a calming demeanor.", "Interview Questions": "Expected compensation. "}, {"date": "11 Jun 2019", "title": "Nurse Practitioner Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Stanford Health Care", "Interview Descriptions": "Apply online. Once called it was a Two day interview process. Interviewed by a panel of people. Very intimidating. Need to be prepared before going in. Just relax and will do fine", "Interview Questions": "N/A"}, {"date": "26 Jul 2019", "title": "Manager of Advanced Practice Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 3 weeks. I interviewed at Stanford Health Care in Jun 2019", "Interview Descriptions": "I was contacted by Stanford recruiter and had informative initial screening phone interview.  I then spoke with one of the managers in the recruiting department.  My information was then sent to the Executive Director of Advanced Practice.  She conducted a phone interview with me.  This was one of the most sterile, impersonal conversations I've ever had with a potential employer.  She sounded like she was reading off a list of questions, but not really actively listening to the answers.  After the phone interview, the executive director stated that she would be in touch.  \r\n\r\nAbout two weeks later, I emailed her to check on my status.  Instead of contacting me directly, I was contacted by the initial recruiter.  The recruiter contacted me VIA TEXT MESSAGE to inform me that they were not continuing forward with me and were instead going with another candidate.  For any high level job, especially at the manager or director level, I expect more direct communication, not a casual text message. This was totally unprofessional and amateurish, in my opinion.", "Interview Questions": "Questions about dealing with challenging employees."}, {"date": "2 Apr 2022", "title": "Clinic Assistant II Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Stanford Health Care in Jun 2019", "Interview Descriptions": "Got a call for interview, met with assistant manager and coordinator of the clinic. I was going to come back for a second interview with the manager but she happen to be in office so I met her at the same time.", "Interview Questions": "How would you handle a difficult situation when you have multiple tasks at hand? "}, {"date": "17 Aug 2022", "title": "Diagnostic Medical Sonographer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 4 weeks. I interviewed at Stanford Health Care (Palo Alto, CA) in May 2019", "Interview Descriptions": "Interview process was great .  Be prepared to talk about your experience and how it relates to the job. Don’t be afraid to ask questions.  Be confident and ask good follow up questions", "Interview Questions": "Do you have any previous work experience "}, {"date": "7 Jun 2019", "title": "Relief Food Service Worker Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Stanford Health Care (Palo Alto, CA) in May 2019", "Interview Descriptions": "Fairly straightforward. Asked about my work experience, customer service experience, availability, and food handling skills. Was interviewed by various people in the department I was applying for, most of them had a few specific questions.", "Interview Questions": "Why Stanford Health Care?"}, {"date": "10 Oct 2019", "title": "Nurse Practitioner Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 3 months. I interviewed at Stanford Health Care in May 2019", "Interview Descriptions": "The interview process was prompted by an internal connection. I then spoke with an HR recruiter, she blatantly told me that the position would be difficult and the clinic has a high turnover, but the HR recruiter was very kind.  I also had an additional interview with the hiring NP. After this process neither of them reached out to follow up on the position. The lack of follow up after multiple interviews was extremely unprofessional. I reached out to inquire about the position and told they were looking for other, more experienced, candidates - I was lucky to find  and get hired to the same position at another major hospital.", "Interview Questions": "Why this clinical specialty?"}, {"date": "26 Apr 2019", "title": "Revenue Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Stanford Health Care (East Palo Alto, CA) in Apr 2019", "Interview Descriptions": "Intial phone interview followed by 1 hr person interview. The panel interview is with a director and 3 managers. The senior manager said she will give me a call in a week but received an automatical rejections in 2 days. The rejection letter is the same letter they email when your applications doesn't pass for an interview. I would rather have a personable rejections than a robot rejection.", "Interview Questions": "Why did you decided to leave your current job now?"}, {"date": "22 Feb 2019", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Stanford Health Care", "Interview Descriptions": "First they scheduled for a phone interview to discuss the job more in detail and just to get to know you to see if you'd be a good fit and know what to expect from the job. Then if everything works out, they schedule you for a panel interview on behavioral questions to see your work ethic and critical thinking skills.", "Interview Questions": "Describe a time when you made a mistake and how did you fix it."}, {"date": "2 Feb 2019", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Stanford Health Care", "Interview Descriptions": "- Apply online \n- Receive call back from hiring manager. Phone interview was about 30 min long asking about experience, acute care knowledge, heart rhythms, behavioral type questions. \n- Interview one week later. Interview was panel of 4 assistant managers. I went through my resume and they asked behavioral-type questions. They also set-up clinical questions for you to explain. Total was about one hour.\n- Received email back two weeks later. Unfortunately did not get the position, but overall was a professional experience. Stanford has high expectations after all", "Interview Questions": "Was there a time you had a conflict with a doctor or clinical supervisor and how did you handle it"}], [{"date": "11 Feb 2022", "title": "Product Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 6 weeks. I interviewed at Stanford Health Care (Palo Alto, CA) in Jan 2019", "Interview Descriptions": "Process is fairly straight forward, behavioral interviews. Sometimes manager requires a product task, but not in every interview. Mine had first manager call, then a short product task, team interviews. (aka no presentation)", "Interview Questions": "What interest you in stanford?\r\nHow have you used Data in your previous roles?\r\nDesign and XXX feature for XXX product, how do you go about doing it? "}, {"date": "15 Nov 2018", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Stanford Health Care", "Interview Descriptions": "Applied online, received a call back for an interview. No phone interview prior.\r\nPanel interview with unit managers, made you feel very welcomed. Asked if I had any questions at the end.", "Interview Questions": "Why Stanford?"}, {"date": "18 Oct 2018", "title": "Hand Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Stanford Health Care (Livermore, CA)", "Interview Descriptions": "Fairly causal at the time, 14 years ago, met with Director of Rehab, and manager of outpatient therapy.  Met in the cafeteria in a semi private area and discussed my application experience, resume and their needs.", "Interview Questions": "What was my greatest acheivement?"}, {"date": "14 Oct 2018", "title": "Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Stanford Health Care", "Interview Descriptions": "Organized, impressive, genuine. The interviewees took the time to learn of me prior to the interview and were fully interested in all I had to say. They made the interview day go smoothly and made me feel comfortable.", "Interview Questions": "What I can bring to the table"}, {"date": "10 Oct 2018", "title": "Certified Nursing Assistant CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Stanford Health Care in Oct 2018", "Interview Descriptions": "An initial call was made out to me and I was asked a series of questions\r\n I was told candidates will then be chosen from that initial call to come in for a panel interview\r\nI was selected to be called in for a panel interview", "Interview Questions": "Why do you want to work here"}, {"date": "2 Jan 2019", "title": "Facilities Engineering Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Stanford Health Care (Palo Alto, CA) in Oct 2018", "Interview Descriptions": "The phone interview was straight forward. The operations manager went over my resume and work experience. Most of the conversation revolved around what I am seeking and why I am planning to move from my current job. \nAlthough, I had applied for a Facilities and Engineering Manager position the Ops Manager interviewed me for Facility Manager position instead. Perhaps there was an error in the system. I am not sure how the back end is set up. But the Ops Manager was able to answer my questions related to the confusion about positions.", "Interview Questions": "How I manage multiple projects and time?\n"}, {"date": "14 Sept 2018", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Stanford Health Care", "Interview Descriptions": "First had a phone screen then got called for a three panel interview.  Took turns asking questions.  Gave a tour of the unit and a breakdown of nurse to patient ratio ad expectations if hired.", "Interview Questions": "Asked about what to do in critical situations that are common on the unit.  Asked about conflict resolution.  "}, {"date": "5 Sept 2019", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Stanford Health Care (New York, NY) in Aug 2018", "Interview Descriptions": "long panel interview. must have the basics and good foundation of the practice to be able to answer questions. just be prepared to be asked anything under the sun and they'd have the tendency to ask the same question, just rephrased.", "Interview Questions": "how to deal with stressful and toxic people at work"}, {"date": "24 Aug 2020", "title": "Patient Care Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Stanford Health Care (Palo Alto, CA) in Aug 2018", "Interview Descriptions": "The company looks for specific work experiences and how you resolve them. It was my first panel interview, so it was lengthy but my management was very understanding and patient.", "Interview Questions": "How did you deal with a disgruntled patient? "}, {"date": "8 Aug 2018", "title": "Business Operations Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Stanford Health Care in Jul 2018", "Interview Descriptions": "Applied online, got an email after almost 3 weeks. Scheduled a phone interview with the hiring manager. The interview was good and invited me for the second interview. Later canceled interview over visa sponsorship issue.", "Interview Questions": "Describe past work experience."}], [{"date": "20 May 2021", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Stanford Health Care (Palo Alto, CA) in Jul 2018", "Interview Descriptions": "got called for a phone screen and within a few days I received an email to schedule an in person interview. Interviewed with three different panel teams. Had an offer a few days later.", "Interview Questions": "How do you handle multiple requests at a time? "}, {"date": "21 Jun 2018", "title": "Clinical Research Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 3 months. I interviewed at Stanford Health Care", "Interview Descriptions": "After having my resume forwarded internally, I got a pre-screening phone call to get to know my background and experiences and whether I had the minimum requirements. Then, I interviewed with several hiring managers across different teams, and my final interview was a group interview with 8 clinical research coordinators and the PI.", "Interview Questions": "Describe an experience in which you had a different opinion than a physician and how did you deal with that."}, {"date": "22 Feb 2019", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 days. I interviewed at Stanford Health Care (Palo Alto, CA) in Jun 2018", "Interview Descriptions": "2 phone interviews and then onboarding. first phone interview was with the recruiter and then second interview was with the actual manager I was working with. Onboarding took place in emeryvile even though work was located in Palo Alto", "Interview Questions": "Asked about my previous experience and why I would want to work at Stanford"}, {"date": "25 Feb 2022", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 5 days. I interviewed at Stanford Health Care (Palo Alto, CA) in Jun 2018", "Interview Descriptions": "the interview process was a little nerve wrecking because it is a panel interview, which includes managers, assistant manager and leads for the department. interview questions are done in five different categories", "Interview Questions": "Tell me about a time you had to deal with a difficult patient and how did you handle it ?"}, {"date": "15 May 2018", "title": "Financial Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Stanford Health Care", "Interview Descriptions": "one on one back to back taking with the hiring manager and current position employees to understand more about current position and expectations. it is kind of casual and conversational. No case and nothing tough", "Interview Questions": "what is your work style"}, {"date": "8 Jul 2018", "title": "Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Stanford Health Care (Stanford, CA) in May 2018", "Interview Descriptions": "Went through a phone screening and a panel interview including 3 other coordinators, assistant and the clinic manager. Fairly easy interview since only behavioral questions was asked. Most questions were about interactions with patients and thair families", "Interview Questions": "Describe a time when you went above and beyond for someone who was not your patient. "}, {"date": "22 May 2018", "title": "Housekeeper Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at Stanford Health Care (Stanford, CA) in Mar 2018", "Interview Descriptions": "Very easy, not hard questions but a litle confused. Good pay.  The interview environment was super comfortable nothing uncomfortable. Both managers were very nice and friendly. All the questions were very easy but a little confused. Overral it was a great experience.", "Interview Questions": "Why are you a great candidate for this position?"}, {"date": "21 Apr 2018", "title": "Human Resources Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Stanford Health Care (Pleasanton, CA) in Mar 2018", "Interview Descriptions": "Through an agency. 2 phone interviews followed by an in-person.  My skills, background and experience made me an ideal candidate. \r\nThe passed on me and said I was culturally not a fit. Translation, I’m pretty sure, you’re too old. I was about 10 years older than those who interviewed me.", "Interview Questions": "Behavioral or scenarios "}, {"date": "6 Sept 2019", "title": "Unit Secretary Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at Stanford Health Care (Menlo Park, CA) in Mar 2018", "Interview Descriptions": "Panel interview, group interview with 5-6 questions each. Each question highlighted attributes about teamwork, collaboration and learning. \r\nThe process takes a long time with HR, but be persistent but patient. It takes time for the right person to fill the position.", "Interview Questions": "Tell us about a time you had a conflict with a coworker"}, {"date": "16 Feb 2018", "title": "Marketing Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at Stanford Health Care", "Interview Descriptions": "Overall the interview process itself was fine. Had two phone interviews before I did an all day in person interview with the team. However, after the final interview, I would have appreciated to find out either way whether I got the position (even after following up multiple times, I was never given an answer either way) and it took me nearly two months to get reimbursed for my travel expenses. Because of those two things, it soured my perception of the interview process and organization.", "Interview Questions": "How have you managed a difficult client or business partner? "}], [{"date": "5 May 2019", "title": "Program Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Stanford Health Care (Stanford, CA) in Feb 2018", "Interview Descriptions": "First interview was phone call with hiring manager, then another one with his boss. They definitely over sold themselves and the department, and didn't mention all the political leadership changes happening then.", "Interview Questions": "Why do you want to work here?"}, {"date": "14 Jan 2018", "title": "Human Resources Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 2 months. I interviewed at Stanford Health Care (Palo Alto, CA) in Nov 2017", "Interview Descriptions": "Met with a number of teams, and they used situational based interviewing (In X situation, what how did you handle it, what was the result, what would you have done differently\" They could not schedule interview with all the people they wanted me to meet so I had about 6 to 8  hours of interviews over two days. After sending my thank you notes to all the people I had on my panels (3 of who were affiliates, to whom I sen the thank you notes to in c/o the HR office), I got one of the three back about a week after I sent it marked \"Returned to Sender\", and the other two arrived with \"Return to Sender\"  written on the enveloped approximately 5 weeks after the panel interview.  For a company that told me during the interview that collaboration across the enterprise and with affiliates was important, this told me that they do not practice what they say they want. I would not recommend their HR Department.", "Interview Questions": "It has now been two months since the interview, the holidays have come and gone and the interview has passed. I don't remember what they asked, but nothing was out of the ordinary."}, {"date": "3 Oct 2017", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Stanford Health Care", "Interview Descriptions": "There were two phone interviews, one brief one with HR and then an extended one hour phone call with the unit manager. Following this, I interviewed almost two hours in person with the manager, two assistant managers, and a floor nurse. The standard interview questions are tiring and laborious. To prepare, think of specific events that you can use to tell about your RN experiences.", "Interview Questions": "Tell us about a time that you went above and beyond for a patient or family member."}, {"date": "29 Sept 2017", "title": "Program Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Stanford Health Care", "Interview Descriptions": "Stanford Healthcare has a great reputation so I applied to a few openings and interviewed with a couple of teams. Coming from a med-tech industry, I was surprised to learn that there is no standardized interview protocol. For example, I wasn't given a job description and the one that I saw online was awfully vague. The interviewers weren't sure about the basic information that I asked about the new position. They didn't bother to introduce their roles at Stanford or keep an eye contact. Lastly, everyone that I met ( coordinator, office managers, managers, directors) are in their mid-50s.  Being a young, foreign female in Silicon Valley,  I felt a little out of place in this old white boys' club.", "Interview Questions": "Tell me about yourself"}, {"date": "4 Jun 2021", "title": "Volunteer Ambassador Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Stanford Health Care (Palo Alto, CA) in Sept 2017", "Interview Descriptions": "Pretty standard and straight forward interview. The volunteer coordinator may interview you with another interviewee and have a short discord going. Just be honest and conversate, youll have a good time, interviewer was pretty nice.", "Interview Questions": "Why did you want volunteer/ past experiences. "}, {"date": "25 Sept 2017", "title": "Nurse Practitioner Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Stanford Health Care (Palo Alto, CA) in Aug 2017", "Interview Descriptions": "All interviews that I have done at Stanford have started with a phone interview, and then are followed up with an in-person interview. It was a very typical interview in terms of questions, but I was surprised about being interviewed by the whole team rather than just one person. It was intimidating at first, but then I felt it was to my benefit because I got to see what it would feel like to work as part of their team.", "Interview Questions": "Tell me about yourself."}, {"date": "14 Oct 2017", "title": "Data Architect Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Stanford Health Care (Palo Alto, CA) in Aug 2017", "Interview Descriptions": "Interview process started with an HR phone interview in May 2017.\r\nAfter 2 months HR called to set up interview with a manager, followed by 2 more phone interviews and a final onsite interview. \r\nTotal process total 4 months\r\n\r\nIf you ever get a call for onsite interview don’t pay for travel expenses from your pocket as I am afraid you will NOT be reimbursed. \r\nFollowed up with HR 10 Times but Stanford Human Resources team are very unethical and unprofessional. 2 months and counting to get reimbursed", "Interview Questions": "Case Study and Analytical questions "}, {"date": "21 Oct 2021", "title": "IT Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 2 weeks. I interviewed at Stanford Health Care (Palo Alto, CA) in Jul 2017", "Interview Descriptions": "Full day onsite with several leaders and team members. Offer was submitted onsite at the EOD and everyone was well organized, professional and transparent. Questions were balanced . Overall great experience!", "Interview Questions": "How I manage Projects end to end"}, {"date": "17 Jun 2017", "title": "Clerical Position Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Stanford Health Care (Livermore, CA)", "Interview Descriptions": "The interview consisted of two people taking turns asking questions in a small room. One was the supervisor and the other was the manager. The overall interview was an hour long.", "Interview Questions": "If the phone was ringing, a customer was in front of you, and your coworker is asking you for a favor, how would you handle this situation? How would you prioritize the situation at hand?"}, {"date": "15 Aug 2017", "title": "Assistant Clinical Research Associate Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Stanford Health Care (Santa Barbara, CA) in May 2017", "Interview Descriptions": "Brief,  friendly, and not very talkative. My interviewer emailed me and set up an interview within the week. She was not very enthusiastic but was still professional.", "Interview Questions": "Do you have experience with consenting?"}], [{"date": "19 Dec 2017", "title": "Assistant Front Office Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Stanford Health Care (Palo Alto, CA) in May 2017", "Interview Descriptions": "Interview, was told they would contact and haven't heard back since . Even with a thank you e mail and the position is still posted.  Reached out again with interest ands still nothing.", "Interview Questions": "Why do you want to leave the department you have been in for 5 years?"}, {"date": "6 Apr 2018", "title": "Systems Analyst Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Stanford Health Care (Palo Alto, CA) in Apr 2017", "Interview Descriptions": "Somewhat distracted manager, the manger seemed to be pressed for time.  We had an hour scheduled and the interviewer was looking at their watch 15 minutes into the interview.  Took a call for 5 minutes and was reading their phone", "Interview Questions": "very little technical questions were asked"}, {"date": "19 Mar 2017", "title": "Marketing Manager Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Stanford Health Care", "Interview Descriptions": "Filled with red flags from start to finish. Wouldn't talk salary initially and then low-balled me with the offer. Also asked to speak to three of my previous managers - which is against company policy. Only HR can confirm dates worked, salary, etc. And then also asked for past performance reviews. Past performance reviews contain private financial information from companies. They didn't want to accept this and my offer was rescinded. Feel like I dodged a bullet.", "Interview Questions": "Just basic interview questions on the phone and then grilled in person."}, {"date": "9 Mar 2017", "title": "RN Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Stanford Health Care", "Interview Descriptions": "Registered Nurse applying for a very competitive position in a densely populated area in healthcare. The process takes very long time. Response to an online application can take months.", "Interview Questions": "Why this organization?"}, {"date": "26 Feb 2017", "title": "Security Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Stanford Health Care (Palo Alto, CA)", "Interview Descriptions": "Initial meeting was a group test. Followed by an in person panel interview. The interview took approximately 30 minutes on site with the Program Director and a member of the leadership staff. It was very professionally conducted and thorough. The interview was direct and to the point.", "Interview Questions": "Tell me about yourself?"}, {"date": "10 Feb 2017", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2+ months. I interviewed at Stanford Health Care (Stanford, CA)", "Interview Descriptions": "Phone interview, then in-person interview with multiple managers a few weeks later.  From there it took months for the recruiter to get back to me with an offer and the salary negotiations were like a root canal.  My start date was a full month and a half after signing the offer letter due to their archaic recruiting, onboarding and payroll process.", "Interview Questions": "N/A"}, {"date": "8 Nov 2018", "title": "R&D Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Stanford Health Care (Ithaca, NY) in Feb 2017", "Interview Descriptions": "The interview process was very relaxed and informal. I had a video call with the supervisor and his grad student where we went over my resume. The supervisor spoke about the various projects they were working on and we discussed which would be the best fit for me.", "Interview Questions": "Why do you want to work with us? "}, {"date": "19 Feb 2018", "title": "Certified Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Stanford Health Care (Palo Alto, CA) in Feb 2017", "Interview Descriptions": "Average interview process, both interviews consisted of a panel or at minimum 2 persons. Applied online and received a call the same week and had my phone interview that same Friday. Was invited for an in-person interview the following week and received an offer the same Friday. Overall pleasant experience and accepted offer.", "Interview Questions": "Behavioral scenarios in order to keep the interview process competitive"}, {"date": "31 Jan 2017", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Stanford Health Care", "Interview Descriptions": "Applied online. Received a call back from unit manager within 2 days of applying. Spoke over the phone for 30 mins. Explained her unit and asked about my experience and current patient population I'm experienced with. Was asked to come for an in person interview. Interview was panel style with manager, assistant manager, clinical nurse specialist. Toured the unit. Lasted about an hour and 30 mins total. Everyone was very pleasant and approachable", "Interview Questions": "Behavioral questions"}, {"date": "14 May 2017", "title": "Clinical Research Associate Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Stanford Health Care (Palo Alto, CA) in Jan 2017", "Interview Descriptions": "panel interview they asked questions like Describe a difficult work situation / project and how you overcame it? What are your goals for the future?  Why should we hire you?", "Interview Questions": "Why are you leaving or have left your job? "}], [{"date": "21 Aug 2017", "title": "Medical Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 2 weeks. I interviewed at Stanford Health Care in Jan 2017", "Interview Descriptions": "Phone interview explaining the job and asking about previous experience. Interview took almost an hour. Questions focused on past experience and strength and weakness. Was invited for a panel interview and meet and greet.", "Interview Questions": "I'm your own words define personal responsibility"}, {"date": "14 Apr 2017", "title": "IT Business Systems Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at Stanford Health Care (San Jose, CA) in Jan 2017", "Interview Descriptions": "Absolutely horrible. First, the recruiter called and left a voicemail with a number that had been disconnected. Really? Secondly, after tracking down the recruiter and passing the phone screen, I was to talk to the hiring manager. He called and told me he had a \"migraine\" and was going to go home for the day and that he would call me back the very next day. Never heard back. Must have been one long migraine. Absolutely unprofessional.", "Interview Questions": "Tell me about your experience. "}, {"date": "7 Dec 2017", "title": "Clinical Lab Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Stanford Health Care (Palo Alto, CA) in Jan 2017", "Interview Descriptions": "Two managers (there were supposed to be 3) ended up interviewing me.  They were very laid back, and personable.  They asked a lot of questions just to get to know me.  and only asked 3 behavioral questions.  Interview was not stressful and was very enjoyable.", "Interview Questions": "What are your strengths and weaknesses?"}, {"date": "11 Nov 2021", "title": "Psychiatrist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 6 months. I interviewed at Stanford Health Care (San Francisco, CA) in Jan 2017", "Interview Descriptions": "Holistic interview style, met with several other attending and trainees. Questions were about research and clinical interests. Very professional and friendly. Site tours at all training locations with chief residents. Enjoyed lunch with all residents.", "Interview Questions": "What are you most nervous about in taking this position?"}, {"date": "29 Sept 2016", "title": "A Leadership Role In the Guest Services Department Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 5 months. I interviewed at Stanford Health Care (Palo Alto, CA)", "Interview Descriptions": "During the interview, fairly standard interview questions plus a few situational questions were asked. Look up \"most common interview questions\" online and prepare accordingly. The interviewers acted professionally; they didn't play the \"good cop bad cop\" kind of thing. To be honest, it felt like the interview would help them find the kind of people that are good at interviews, but not necessarily the kind of people that would be good at the job.", "Interview Questions": "Why should we hire you? What are your strengths? Why do you want to work for us? Why do you want this position?"}, {"date": "29 Mar 2018", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 3 days. I interviewed at Stanford Health Care (Pleasanton, CA) in Sept 2016", "Interview Descriptions": "Good vibe from Office Manager very descriptive in what the position entailed. Was very upfront on salary, benefits and what they were willing to pay. Explained overall work environment and expectations.", "Interview Questions": "How many years of experience in medical field."}, {"date": "22 Sept 2016", "title": "Field Services Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 6 days. I interviewed at Stanford Health Care (Newark, CA) in Sept 2016", "Interview Descriptions": "Recruiter contacted me. Discussed role and if it was a good fit. I liked it. They setup a phone interview. Phone interview was 30 mins. Asked about my job experience and technical skills. Phone interview went well. Did an onsite interview, 1 hour long. Got the job.", "Interview Questions": "Do you have previous project management experience?"}, {"date": "10 Aug 2016", "title": "Project Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Stanford Health Care", "Interview Descriptions": "The interview process was long, multiple rounds, and at times disorganized. The panel interview felt very robotic and the entire team read off of a sheet. I applied 2 months before I received a call back. I had one phone interview and then waiting another 3 weeks. After that I had my first panel interview and then waited another 2 weeks for my final round interview. It was quite tedious.", "Interview Questions": "Describe a situation where you received feedback and how you dealt with it."}, {"date": "11 Oct 2016", "title": "Pharmacist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Stanford Health Care in Jul 2016", "Interview Descriptions": "I was interviewing from out of state, and they were willing to let me do a video conference interview, which was nice. There were general interview/behavioral questions, and some clinical questions. They were very interested in my prior experience and how that could contribute to their position. The questions were very much related to the position and how I would perform the job- very straight forward.", "Interview Questions": "How I worked with interdisciplinary team members."}, {"date": "17 Oct 2019", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 2 weeks. I interviewed at Stanford Health Care in Jul 2016", "Interview Descriptions": "Committee based interview with the standard questions.  Looking for nurses with experience.  BSN is a must.  Standard HR screening and background check.  Nothing surprising in the least.", "Interview Questions": "Why do you want to work at Stanford? "}], [{"date": "27 Jan 2017", "title": "RN Case Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Stanford Health Care (Palo Alto, CA) in Jul 2016", "Interview Descriptions": "Received phone call couple days after applying. Have pre-set questions that they ask and write down your answers. Had a panel of 2 managers interviewing me. After interview, received response from managers within 1 week.", "Interview Questions": "Tell me about a study related to case management that you've read about"}, {"date": "15 Sept 2016", "title": "Certified Nursing Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Stanford Health Care (Palo Alto, CA) in Jun 2016", "Interview Descriptions": "Had a telephone call from management and did an over-the-phone screening. Was invited for a panel interview the following week. Very friendly interviewers and the management team knew exactly what they were looking for in a candidate.", "Interview Questions": "Q: Tell us about a time when you disagreed with your manager, how did you handle it, and what were the results?"}, {"date": "15 Jun 2016", "title": "Human Resources Transition Logistics and Planning Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Stanford Health Care (Palo Alto, CA) in Jun 2016", "Interview Descriptions": "Applied through the company website and was shortly contacted for a phone screening. Following the phone screen I was invited in for both a 1 on 1 interview and panel interview. Overall the experience was very positive, the staff was extremely friendly and outgoing. Interview questions are genuine and allow you to discuss your experience and character. There was very frequent communication during the hiring process and I always felt connected and in the loop.", "Interview Questions": "Tell me about a time that you created something."}, {"date": "7 Dec 2016", "title": "Project Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Stanford Health Care (Pleasanton, CA) in May 2016", "Interview Descriptions": "6-person panel interview with current members on the team I applied for. Was given a topic 24 hours before the interview and asked to create 2 documents and a presentation.", "Interview Questions": "Describe a challenging situation you've encountered and how did you respond to it?"}, {"date": "15 Apr 2016", "title": "Clinical Nurse II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Stanford Health Care (Palo Alto, CA) in Apr 2016", "Interview Descriptions": "I interviewed for an experienced RN position. The interview was a panel interview of frontline RNs and assistant nurse managers, most of the questions I had were behavioral interview questions of about six to eight on describing experiences I had in the past. Additionally, there were two case scenarios where a situation was given and asked what my next steps would be. The first was a clinical and prioritization of care/managing clinical emergencies scenario and the other was a communication/conflict management case between a coworker.", "Interview Questions": "What are three qualities that are essential that a nurse needs to have when working with patients? Now, rate yourself on each of those qualities."}, {"date": "18 Mar 2018", "title": "Systems Analyst Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 5 days. I interviewed at Stanford Health Care (Palo Alto, CA) in Apr 2016", "Interview Descriptions": "They do not spend much time on the interview process. They will hire you if you meet basic requirements because they just need warm bodies to fill roles. Stanford mostly uses staffing agencies to fill positions because it is difficult to find skilled, qualified information technology personnel in the Bay area.  They pay a lot of money to the staffing agencies for consultants but then they do not pay their full-time staff anywhere near the same amount they pay the staffing agency. If you meet their basic requirements, they will hire you. Your salary will depend on your ability to negotiate.", "Interview Questions": "Have you worked with Epic before?"}, {"date": "10 Mar 2016", "title": "PRN Phlebotomist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Stanford Health Care (Sanford, FL)", "Interview Descriptions": "Applied online process looked a few days. The hiring supervisor communicated through email. The interviewer asked questions to answers they wanted to hear rather than what the interviewee provided and criticized most answers that were given. The questions itself were not difficult but again the interviewer wanted answers they wanted to hear.", "Interview Questions": "What are your weakness working in the role as a phlebotomist?"}, {"date": "23 Feb 2016", "title": "Clinical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Stanford Health Care", "Interview Descriptions": "Applied online, recieved a call back a few days later for a phone interview. Set up an face to face interview a few days later and had my 2nd interview 2 days after that. Soon as i left i was given an offer.", "Interview Questions": "Behavioral"}, {"date": "14 Feb 2016", "title": "Nurse Practitioner Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Stanford Health Care", "Interview Descriptions": "First I interviewed with the manager. Then I returned two weeks later to interview with the clinical team. I had three panel interviews, the 1st 30 min interview was with three physicians, the second 30 min interview with 3 NPs and the 3rd 30 min interview with 1 MD and 3 RNs.", "Interview Questions": "Pretty basic interview questions. Why do I want to work in the specific field? My strengths and weaknesses? What I was looking for in a job?"}, {"date": "23 Feb 2016", "title": "Bio-Medical Equipment Technician (35907) Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Stanford Health Care in Feb 2016", "Interview Descriptions": "Rather picky employer. The organization subjects candidates through a 25 - 30 minute customer care questionnaire process right after a job submission online. A consideration is out of the picture if a candidate's answers are not what the hiring department wants to hear. An e-mail will be sent to the candidate within 24-hours of the questionnaire's submission whether his/her application will be considered further. \r\n\r\nOne additional note: Look elsewhere if a candidate's qualifications do not satisfy 90% or higher of the job description.", "Interview Questions": "N/A"}], [{"date": "8 Mar 2016", "title": "BMT Physician Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Stanford Health Care (Palo Alto, CA) in Feb 2016", "Interview Descriptions": "I sent in my application on 12/27, got an email from the lead PA about 3 weeks later. We set up an interview in mid February, and I got an offer beginning of March!", "Interview Questions": "Behavioral questions, why this specialty, tell me about your experience "}, {"date": "27 Jan 2016", "title": "Director, Supply Chain Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Stanford Health Care", "Interview Descriptions": "Interviewed with 5 people, general questions, nothing very difficult. Lunch interview followed by a call with the VP and SVP\r\nTell us about your background?\r\nWhy you want to work at Stanford Healthcare?\r\nQuestions on my past work experience?", "Interview Questions": "N/A"}, {"date": "27 Jan 2016", "title": "New Grad Nurse Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Stanford Health Care", "Interview Descriptions": "4 person panel interview w/ 4 nurse managers, as well as some other managers dialing in (telecast). 2 HR people also in the room. Structured interview, 4 questions per person, 2 min allowed per question, goes in alphabetical order. When you get there they will ask you to rank what units you want to be at. Then they tell you what order you will enter the room and where you will sit. All behavioral questions.", "Interview Questions": " Tell me about a time when you were on a team that functioned badly. Tell me about a team you were on that functioned well. "}, {"date": "9 Mar 2016", "title": "Project Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Stanford Health Care (Palo Alto, CA) in Jan 2016", "Interview Descriptions": "I had one phone interview and one in person interview with two people total. It took 2 weeks and didn't make it to the third round. The phone interview and in person interview questions were the same so I didn't know if I should answer them differently or say the one I had practiced for that certain question. I had to email the employee that contacted me first and asked her if I made it to the next round to get the second in person interview", "Interview Questions": "Review your resume and highlight skills and abilities related to this position"}, {"date": "17 Feb 2017", "title": "Communications Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 3 weeks. I interviewed at Stanford Health Care (Palo Alto, CA) in Jan 2016", "Interview Descriptions": "Pretty standard interview process, with two rounds of interviews. Met with multiple people in management, all in one on one interviews. FYI, they have apparently recently dropped the personality test for management positions.", "Interview Questions": "\"Where do you think we can improve?\""}, {"date": "6 Sept 2016", "title": "Director Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Stanford Health Care (Aptos, CA) in Jan 2016", "Interview Descriptions": "Had a phone interview with a recruiter.  The recruiter was well spoken and professional.  The recruiter spent the majority of time explaining things.  The questions leaned toward being clever rather than promoting meaningful discussion about accomplishments and experience.", "Interview Questions": "What tools have you used?"}, {"date": "6 May 2016", "title": "Physician Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Stanford Health Care (Stanford, CA) in Dec 2015", "Interview Descriptions": "Panel of nurses (for a PA position) and MD director with 10-15 clinical diagnosis and treatment questions (gave scenario with S/S and then asked what I would do, prescribe, order...).  Had child abuse question.   Asked about commitment to quality care, patient care, C-I-CARE (memorize this).  Asked why I left my last position.  Lasted about an hour.", "Interview Questions": "Gave the signs and symptoms for gout and asked the Dx and Tx."}, {"date": "19 Nov 2015", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 8 weeks. I interviewed at Stanford Health Care (San Jose, CA)", "Interview Descriptions": "I applied online and received a pPhone interview two months later. I was invited to the in-person panel interview. HR and managers were very friendly and took turn asking questions. Be yourself and answer honestly.", "Interview Questions": "Tell me what your employer would like to see an improvement during your last evaluation?"}, {"date": "9 Nov 2015", "title": "Clinical Nurse Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Stanford Health Care", "Interview Descriptions": "HR called to invite me to an interview.  I had 2 rounds of interviews that lasted 1 hour each with both other Clinical Nurse Specialists and with the management team that I would be working with.  The process was very professional and both rounds of interviews included thoughtful discussion of a variety of topics in addition to specific interview questions.", "Interview Questions": "They asked a series of standard behavioral interviewing questions.  One question included asking about my experience with specific longer term projects (i.e. quality/outcomes projects), what measures were used, and if there were any economic benefits (i.e. did you save the organization money) as a result of the project.  No case study type questions asked."}, {"date": "7 Dec 2015", "title": "Visualization Developer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 5 weeks. I interviewed at Stanford Health Care (Palo Alto, CA) in Nov 2015", "Interview Descriptions": "After connecting with someone from the Analytics team, we quickly scheduled a phone call. It was a group interview. Nothing outrageous. After the interview I did not hear back from them for almost a week. Then I was asked to appear onsite (Palo Alto Office) for a half day interview session. 4-5 rounds with one break in-between.\r\n\r\nOnsite interview involved 8-10 people interviewing during one on one sessions & some panel sessions. It was really informative to meet some of the architects & managers. Most of the questions were scenario based & to evaluate my experience. A few technical questions were asked. \r\n\r\nInterview went pretty good. After a couple of weeks I heard back that they have decided to move ahead with other candidates as they are looking for someone with more technical expertise. \r\n\r\nMost of the employees wear formals / business casuals so please dress up for the interview.", "Interview Questions": "1. What questions will you ask for a given business requirement topic?\r\n2. Some whiteboard assignments\r\n3. Discussion over visualization best practices\r\n4. What value would you bring to this organization?\r\n5. Technical question (table design, standards), SDLC based questions (lean, agile methodologies)\r\n6. Behavioral questions (STAR)"}], [{"date": "24 Sept 2015", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Stanford Health Care", "Interview Descriptions": "Panel interview and manager interview. One on one at first then passed that. Got a phone call to do a panel interview and passed that as well. Then reference check and background check, passed that as well.", "Interview Questions": "Describe the time when you did a project and what did you do"}, {"date": "4 Sept 2015", "title": "Pre Kidney Transplant Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Stanford Health Care", "Interview Descriptions": "I had 3 interviews. The first was a phone interview with the manager and a nurse. The second interview was a 9 nurse panel interview where they asked a lot of behavioral questions. The last were interviews with the surgical director and the medical director which was intense but a great experience.", "Interview Questions": "Why are you looking into transitioning?"}, {"date": "21 Dec 2018", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Stanford Health Care (Palo Alto, CA) in Sept 2015", "Interview Descriptions": "Long but worth it. Manager interview, initial. Then panel interview a few days later. Final offer 2 weeks after, background check, paperwork, overall 2 month long process. The questions were scripted, behavioral type questions. Be yourself and don't reveal your party animal ways, be professional and you should be golden.", "Interview Questions": "Tell me about a recent project, what is your contribution about it"}, {"date": "20 Aug 2015", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Stanford Health Care (Palo Alto, CA) in Aug 2015", "Interview Descriptions": "I applied 8/11, I got called by the hiring manager to schedule an interview. I interviewed with the unit manager and the assistant manager. They were very friendy and welcoming. They do not make you feel intimidated or scared. The interview lasted approximately 1 hour. They also gave me a tour of the unit. They allowed me to ask questions. What I like the most is that the process was fast and I was able to directly talk to the hiring manager. The same day after my interview as I was walking out of the hospital, the manager called me and said that she couldn't wait another day more and would like to extend me the job offer. I said yes, of course! It's Stanford!", "Interview Questions": "Tell me about a time that you were a team player?"}, {"date": "23 Oct 2015", "title": "Business Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Stanford Health Care (Menlo Park, CA) in Aug 2015", "Interview Descriptions": "Had 4 rounds of interviews. Interviewed by recruiter, followed by manager twice - phone and video conferencing. \r\n\r\nAdvice: Unless the hiring manager or recruiter/HR department emails you a complete agenda and willing to pay for your trip please do not go. If you are still willing to pay for your self then please ask for agenda for interview, panel information, and decision making time. \r\n\r\nThis reflects the culture of the team, management style, and decision making process. If these simple things are not stream lined think about projects.\r\n\r\nWorst interview ever I had and disappointing.", "Interview Questions": "Behavioral."}, {"date": "16 Jul 2015", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Stanford Health Care (Stanford, CA)", "Interview Descriptions": "If you do your clinical at Stanford hospital, people already know you which can be an advantage. Then there is a week of reviewing skills. Then there is about a year of Residency where they ask you how you are doing in the process because they would like to keep you.", "Interview Questions": "Why do you want to work at Stanford?"}, {"date": "8 Aug 2017", "title": "LVN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. I interviewed at Stanford Health Care (Menlo Park, CA) in Jul 2015", "Interview Descriptions": "Talked to supervisor and clinic manager and met with the physicians after. The interview process was easy. I got a call to interview, and got hired the same day after interviewing.", "Interview Questions": "Describe a difficult situation and how you handled it"}, {"date": "30 Oct 2017", "title": "RN Staff Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Stanford Health Care (Menlo Park, CA) in Jul 2015", "Interview Descriptions": "this was for the residency program. Group/Panel/Video interviews, managers and directors can watch videos. You choose where they are hiring and then matches may happen that way. After original interview from one of the three mentioned, interviews on the units may happen in a unit panel environment.", "Interview Questions": " Behavioral Style questions.  \r\nEx. Tell me a time when you had a difficult patient, how did you handle this.  Working in group settings, how did you handle conflict "}, {"date": "20 Aug 2015", "title": "Help Desk Technician Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Stanford Health Care (Palo Alto, CA) in Jul 2015", "Interview Descriptions": "It was a long process. I had to wait for a phone call. Then they said they had to reschedule. Then they had told me that they had found someone more qualified for the position. It was frustrating because I didn't know whether to call and follow up or wait for their answer. Since I didn't follow up they thought I was disinterested.", "Interview Questions": "How do you embody CI-CARE?\r\n"}, {"date": "30 Jul 2015", "title": "Marketing Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 3 weeks. I interviewed at Stanford Health Care (Palo Alto, CA) in Jun 2015", "Interview Descriptions": "Very fast, first spoke to a recruiter, then 3 phone interviews then a half day of in person interviews. The process was fast. The people were friendly and questions were fair -- most seemed liked a skills assessment and whether I was cultural fit. The one issue of note: I was required to pay all of my travel expenses for the in-person interview up front and it took over a month to get reimbursed. They also require a W-9 for reimbursement, which was new to me. The manager did call personally to tell me I didn't get the job.", "Interview Questions": "Why are you looking for a job at this time in your life?"}], [{"date": "3 Aug 2015", "title": "PT Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2+ months. I interviewed at Stanford Health Care (Palo Alto, CA) in Jun 2015", "Interview Descriptions": "There were behavioral questions and clinical questions. The panel ask questions by turn. They are quite friendly, but I was nervous. You have a chance to tour the facility, but it won't take too long.", "Interview Questions": "Q: Strengths &amp; Weakness"}, {"date": "4 May 2016", "title": "Clinical Research Associate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Stanford Health Care in Jun 2015", "Interview Descriptions": "After applying online, I was invited for a Skype interview with the PI and the rest of the clinical research team. They asked me a variety of questions but appeared to look down when I was speaking, or rather mumble to themselves.  They were very positive in the end, asking, \"how soon can you start?\" but later waited a week to reply via email to inform me of the non-selection decision.", "Interview Questions": "They asked why I felt comfortable working with patients, if I had ever dealt with cancer patients, and how soon I can get to Palo Alto."}, {"date": "18 Jun 2016", "title": "Case Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Stanford Health Care (Palo Alto, CA) in Jun 2015", "Interview Descriptions": "It was an initial phone interview with the manager. After that, I was called into the clinic to do an in person interview. It was a panel type interview with 7 people. 2 held the some position as me, two were management, and the others were other members of the care team.", "Interview Questions": "Situational questions that reflected on past experiences."}, {"date": "14 Nov 2015", "title": "IT Project Manager Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 1 day. I interviewed at Stanford Health Care (Palo Alto, CA) in Jun 2015", "Interview Descriptions": "Interview was entirely over the phone, with no in-person interview requested.  1st warning.  Talked to the hiring manager as a contractor and he wanted me to start the next day (!)  It was odd; there was no vetting of my skills and entire conversation took place in less than an hour.  I should have seen the red flags - the fact that he didn't want a face-to-face interview should have alerted me.", "Interview Questions": "Describe your infrastructure Project Management experience. 2nd warning"}, {"date": "8 Jan 2016", "title": "Patient Access Representative Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Stanford Health Care (Palo Alto, CA) in May 2015", "Interview Descriptions": "First you have to apply online, then take an assessment test.  If you do not past the assessment test you will not be a desirable candidate for Stanford Health Care.  If you pass the assessment test, you will be called for a panel interview.", "Interview Questions": "Not applicable"}, {"date": "14 Nov 2017", "title": "Customer Service Representative Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at Stanford Health Care (Palo Alto, CA) in May 2015", "Interview Descriptions": "was referred in  by an employee. They called me in for an interview one and half month later. interviewed with 2 managers. I taken through the day to day operations. and after 3 hours of being there was offered the job", "Interview Questions": "why you want to work at stanford healthcare?"}, {"date": "24 Apr 2015", "title": "Development Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "The process took 3 weeks. I interviewed at Stanford Health Care", "Interview Descriptions": "Very thorough process and lots of behavioral interviewing questions. Stanford is a great organization and it prides itself on a thorough process to bring in new employees. There are lots of tenured people here, and they say \"be careful who you hire... because no one ever leaves.\"", "Interview Questions": "Typical behavioral interviewing questions"}, {"date": "8 Feb 2016", "title": "Associate Systems Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 4 weeks. I interviewed at Stanford Health Care (Palo Alto, CA) in Apr 2015", "Interview Descriptions": "Test with english, math, CS parts. Then a 1 hour interview on what to expect and talk about experiences. The on-site interview was a panel consisting of the team you would be working with. It was an hour and were great to talk to. Focused more on potential to learn rather than what I already knew.", "Interview Questions": "Talked about past work experience and what to expect "}, {"date": "22 Nov 2016", "title": "Executive Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Stanford Health Care (Palo Alto, CA) in Feb 2015", "Interview Descriptions": "Apply for the position \r\nSubmit resume\r\ntake the assessment\r\ncall with the recruiter\r\nrecruiter then forwards resume to hiring manager\r\nhiring manager responds \r\nschedule the 1:1 with hiring manager\r\nSchedule interview with a panel of people\r\nSend a thank you note to hiring manager\r\nWait a few weeks for a call\r\nAccept/decline offer\r\nComplete background check\r\nComplete drug test\r\nObtain start date", "Interview Questions": "Why should I hire you?"}, {"date": "17 Jan 2015", "title": "Management Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 4 weeks. I interviewed at Stanford Health Care", "Interview Descriptions": "Went through an agency recruiter so first interview was smoo to setup. After interview I heard back the next day on next steps to fly out but  was slow to setup but it was over the holidays.", "Interview Questions": "No real difficult questions but I have interviewed and been interviewed many times so no real surprises, they are very concerned about cultural fit which I appreciated."}], [{"date": "18 Oct 2014", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Stanford Health Care", "Interview Descriptions": "New Grads must go through a rigorous and competitive hiring process. It starts with a phone interview, then there are group interviews, and then you interview in different departments in front of a panel. Be as polished as possible. Many good candidates don't make it. So, don't feel bad if that's you. Good luck.", "Interview Questions": "Stanford uses a personality assessment tool via a third party product. They swear by it, but i'm not convinced."}, {"date": "23 Feb 2016", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Stanford Health Care (Palo Alto, CA) in Sept 2014", "Interview Descriptions": "HR can take a very long time. Resumes are screened through HR and given to manager who shares with unit educator, CNS, and assistant managers. After interview (generally phone) with assistant manager, there is a panel interview with floor nurses and charge nurses, as well as unit educator/management", "Interview Questions": "Most difficult family/patient situation I had encountered and how I dealt with it"}, {"date": "16 Aug 2014", "title": "Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Stanford Health Care (Stanford, CA)", "Interview Descriptions": "Phone screening with recruiter, then phone interview with hiring manager, then 1:1 interviews with a few people. Received an email less than a week later w/offer. Interviews were not extremely difficult. I would say they were average.", "Interview Questions": "N/A"}, {"date": "26 Sept 2018", "title": "Assistant Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Stanford Health Care in Jul 2014", "Interview Descriptions": "Phone, 1:1, then panel. Sometimes it was with the director and or doctor or medical director. I like panel interviews because the whole team is involved with hiring a potential person to join the team.", "Interview Questions": "Standard behavioral and scenario questions."}, {"date": "25 Jul 2015", "title": "New Grad Nurse Residency Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 8 weeks. I interviewed at Stanford Health Care (Palo Alto, CA) in Jun 2014", "Interview Descriptions": "In a word intense! Be prepared to think on your feet. The process is timed, meaning you will have a maximum of 2 minutes to answer each of the 4 questions posed to you. There will be 3 other candidates in the room with you and up to 10-12 managers and HR people scoring your answers. Keep in mind it's behavioral, they want to hear a clinical situation describing what you actually did, not what your nurse did or what you would do in a hypothetical situation. You will be asked a question covering 4 areas of nursing from care/comfort to critical thinking.", "Interview Questions": "To begin with you will be asked to interview the candidate next to you and in 2 minutes explain why he/she would be a good fit for Stanford."}, {"date": "15 Apr 2016", "title": "Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Stanford Health Care (Stanford, CA) in Apr 2014", "Interview Descriptions": "Three phone interviews before I was invited for an onsite interiew. The interview started at  9:00 a.m and ended at 2:00 p.m. I was introduced to all my colleagues, and the interview went quite well. Most of the questions were regarding - financial modeling, variance analysis, costing...", "Interview Questions": "Tell me something about your skill sets"}, {"date": "11 Mar 2014", "title": "Senior Clinical Systems Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at Stanford Health Care (Palo Alto, CA)", "Interview Descriptions": "I got my job via a strong internal employee referral. At first for a 2-3 weeks nobody called. Then a guy from HR called and did a basic screen. Then after a week talent acquisition send an email to schedule a phone interview. Phone interview was very basic hr screening. Then a phone interview with hiring manager was scheduled after 3 weeks. that went well and was invited for face 2 face the following week. After a week offer was presented. Offer was more than what I had asked for so couldn't complain.", "Interview Questions": "None , all very basic. In fact no technical questions"}, {"date": "6 Apr 2016", "title": "Dietetic Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at Stanford Health Care (Stanford, CA) in Jan 2014", "Interview Descriptions": "You will get a call to schedule an interview. You go to the department you are being interviewed for and you will be seated. You will be called when the hiring manager is ready, may be right away or up to 30 minutes. During the interview, you will be asked about your work experience.", "Interview Questions": "What was work experience do you have?"}, {"date": "3 Sept 2015", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Stanford Health Care (Palo Alto, CA) in Jan 2014", "Interview Descriptions": "I applied online and automatically got a reply saying they weren't interested so I started interview at other hospitals. A few weeks later I got a call for an interview. They told me their automated system sends that email to everyone that applies. I had a 30 min phone interview.", "Interview Questions": "I was asked about what specific machines I was familiar with from previous hospitals."}, {"date": "13 Oct 2015", "title": "Contracts Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Stanford Health Care (Palo Alto, CA) in May 2013", "Interview Descriptions": "Initial phone interview followed by a two hour in person interview meeting with various business stakeholders. The interviewing panel asked various questions including personality based questions as the organization is very much personality driven.", "Interview Questions": "Everything from past experience through to personality typle."}], [{"date": "29 May 2013", "title": "Help Desk Support Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at Stanford Health Care in May 2013", "Interview Descriptions": "Was contacted by Insight Global who initially asked about my work experience.  After talking with an account manager and sending my resume and a couple of references, they set me up with a phone interview for a Stanford Clinic opening soon.  \r\n\r\nI joined in on a phone conference interview with the hiring manager and 2 other employees.  I was prepared for a phone interview and had been preparing for the past 2 weeks.  I didn't expect the first phone interview to be technical rather than behavioral.  However, I did enjoy it and they were simple questions.  The interviewer stated situations and took me through the process of solving them.  I can honestly say it was fun for me!", "Interview Questions": "What files would you back up on someone's computer?"}, {"date": "13 Oct 2013", "title": "Migration Technician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 4 weeks. I interviewed at Stanford Health Care in May 2013", "Interview Descriptions": "interview process was easy and no problems", "Interview Questions": "no hard questions and interview was easy."}, {"date": "16 Jun 2015", "title": "Insurance Verification Representative Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. I interviewed at Stanford Health Care (Redwood City, CA) in Apr 2013", "Interview Descriptions": "Interviewed with 4 managers but didn't here anything for 3 months. Each one asked questions it was a fairy easy interview the managers only hire you based on if they like you or not, not on your experience", "Interview Questions": "Have you ever managed a team before"}, {"date": "27 Mar 2013", "title": "Postdoctoral Fellow Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Stanford Health Care", "Interview Descriptions": "I met the boss in a conference. We talked a lot about the project and i asked whether there's is a chance that I can be a postdoc for you. That it.", "Interview Questions": "I didn't really enter the employer's lab before I applied for this job. There is a gap between my expectation and reality, facility-wise."}, {"date": "20 Jul 2016", "title": "Pre Analytical Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Stanford Health Care (Palo Alto, CA) in Jan 2013", "Interview Descriptions": "The process was long the director was not very friendly she started to ask me question and did not introduce herself, when I asked her her name she point to her badge which was backwards. She seemed very angry.", "Interview Questions": "Tell us about yourself"}, {"date": "31 Mar 2014", "title": "Medical Director, Surgical Services Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Stanford Health Care in Nov 2012", "Interview Descriptions": "Forwarded my CV to recruiters who contacted me for two separate one hour phone interviews.  First interview was with two recruiters, second interview was with one individual.  The interviewers were cordial and friendly.  The phone interviews were intended to narrow the group of candidates down to those who would be offered visits to Stanford for in person interviews.", "Interview Questions": "How would you design a new hospital?"}, {"date": "10 Aug 2012", "title": "Materials Management Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Stanford Health Care (Palo Alto, CA)", "Interview Descriptions": "Two interviews were one hour each.", "Interview Questions": "Don't recall an unexpected question"}, {"date": "25 Dec 2015", "title": "Histology Services Supervisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 8 weeks. I interviewed at Stanford Health Care (Palo Alto, CA) in Nov 2011", "Interview Descriptions": "My resume was presented to Stanford by a recruiter for Stanford.  I was contacted to see if I had an interest in applyng.  I researched the organization and then I submitted my application along with my resume for their review.", "Interview Questions": "What made me want to apply at Stanford?"}, {"date": "13 Sept 2015", "title": "Marketing Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 3 months. I interviewed at Stanford Health Care (Palo Alto, CA) in Nov 2011", "Interview Descriptions": "Interviewed with supervisors. Fairly simple process. Applied online, call from HR, followed by interview in person. Took 3 months for an offer from the first interview to hire. Longer process than normal, but  Stanford only hires the best!", "Interview Questions": "I don't remember any questions. "}, {"date": "14 Aug 2015", "title": "Courier Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 days. I interviewed at Stanford Health Care (Stanford, CA) in Apr 2011", "Interview Descriptions": "It was very informal. Just showed up when requested, had a nice chat with the head of the department, was given a small tour of the operations. That was it. After clearing a background check I was in.", "Interview Questions": "They focused a lot on how well I handled stress."}], [{"date": "21 Oct 2015", "title": "Project Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Stanford Health Care (Palo Alto, CA) in Jan 2011", "Interview Descriptions": "It was a great experience, they were very kind and straight forward. I would say that be prepared with what you can offer as an possible candidate. Also, I would not try to overly impress them. Just because Stanford is a world known hospital does not mean that they are looking for big impressions, rather they are looking for someone humble, down to earth and can get the job done. I say be you, be honest, and you will do just fine.", "Interview Questions": "Why do you want this position? What can you bring to the department?"}, {"date": "21 Dec 2015", "title": "Certified Nursing Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. I interviewed at Stanford Health Care (San Jose, CA) in Jan 2011", "Interview Descriptions": "Hired through a registry, toke in all my shot records, had background check signed necessary paper work. Had a 1:1 interview, a fit test for 95 resperator. The interview was pleasant. I don-know what what else to say about the interview. You keep asking me the same questions.", "Interview Questions": "How long I had worked a Cna The interview was great"}, {"date": "4 May 2012", "title": "Clinical Research Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 1 day. I interviewed at Stanford Health Care (Stanford, CA) in Oct 2010", "Interview Descriptions": "I already had 2 years of intensive hands on experience in the specific medical field I applied for and was referred by my former employer.", "Interview Questions": "N/A"}, {"date": "28 Feb 2014", "title": "Project Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Stanford Health Care (Palo Alto, CA) in Aug 2010", "Interview Descriptions": "I attended 1 interview with a panel firing questions at me.  The job was presented as an exempt position.  When the written offer came through it was presented as non-exempt which offers less in benefits and accrued vacation pay.", "Interview Questions": "Questions were very standard.  What were your contributions in your previous line of employment.  How did you impact cost savings.  What are your strengths/weaknesses.  What was the most difficult part of your job.  How did you overcome the difficulties."}, {"date": "8 Oct 2014", "title": "Organization Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Stanford Health Care (Palo Alto, CA) in Aug 2010", "Interview Descriptions": "Phone interview with Recruiter and another manager. Behavioral Interviewing Panel. Hiring decision thereafter. Today, an online or phone assessment of attributes is also required. Brush up on your behavioral interview responses - i.e., how you've actually handled situations in similar positions in the past.", "Interview Questions": "Why do you want to work in Healthcare"}, {"date": "21 Apr 2011", "title": "Clinical Trials Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Stanford Health Care (Stanford, CA) in Aug 2009", "Interview Descriptions": "Was introduced to hiring manager through an employee referral (through email). Send my resume and cover letter, and manager suggested I get to the site for an interview. The interview process was very informal (probably does not apply to other job titles, but in my case it was as if I already had the job). It was more of a conversation about what the team is working on and what I will be doing. Didn't ask me any questions about me, only asked if I have any questions for them. Salary was not negotiable.", "Interview Questions": "Do you have any questions for us?"}, {"date": "25 Jun 2010", "title": "Management Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at Stanford Health Care (Palo Alto, CA) in Apr 2008", "Interview Descriptions": "To get to the panel interview, it took at least a couple of months.", "Interview Questions": "Attitudes and experience"}]]