[[{"date": "22 May 2023", "title": "Data Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Penn Medicine", "Interview Descriptions": "Had a short interview over the phone and I was asked to schedule a programming test for a later date. They were very flexible about the date for the programming test.", "Interview Questions": "They asked me how I would create an analytical dataset."}, {"date": "5 Apr 2023", "title": "Laboratory Technician Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Penn Medicine", "Interview Descriptions": "Interviewer was rude and kept interrupting with questions that would have been answered if I finished talking. Gave the vibe that they were an ass-kisser to the higher-ups and expected you to be too. Without entering specifics - they complained about lack of employee loyalty and the difficulties of staff leaving on management (as if that's my fault) Definitely didn't give me a good feeling about the company - I rescinded by application right after the interview lol. I may dislike my current job but i'd dislike this place more Only plus was that they were at least honest rather than being rude behind my back like my current job lol", "Interview Questions": "Explain your resume to me"}, {"date": "31 Mar 2023", "title": "Technical Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Penn Medicine", "Interview Descriptions": "The interview process involved the following: HR screening, interview with managers and senior analysts, interview with director, and interview with upper management. The interviews focus on a mixture of soft and hard skills.", "Interview Questions": "They will ask about your previous experience on your resume to see how it translates to the role."}, {"date": "25 Mar 2023", "title": "Patient Service Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Penn Medicine", "Interview Descriptions": "I was hired during they hiring event I was interview by multiple managers and got a call back from one and started in like 2-3 weeks. I got a job offered right then in there", "Interview Questions": "Why should we hire you ?"}, {"date": "20 Jan 2023", "title": "Sales Associate Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Penn Medicine", "Interview Descriptions": "I went through a series of interviews after talking to a recruiter at a job fair. I met with the hiring manger, several people I would be working with, and then met with a recruiting team to talk over pay bands.", "Interview Questions": "Tell me about a time where you advocated on behalf of a patient to act outside of protocol."}, {"date": "30 Jan 2023", "title": "Unit Secretary Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Penn Medicine in Jan 2023", "Interview Descriptions": "It went pretty fast the phone call from to the interview was a week but not hearing back reached out three times. The previous recruiter switched position so finally got word I didn’t get it today", "Interview Questions": "Why do I wanna work at penn"}, {"date": "9 Nov 2022", "title": "Physician Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Penn Medicine", "Interview Descriptions": "Monitor application online is easily available through emailed link. This is important to track the application that you have submitted during the hiring process. I am still waiting to hear back, but I hear the process of training is amazing at Penn! I have a few friends who work there now.", "Interview Questions": "N/A"}, {"date": "16 Nov 2022", "title": "Lab Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Penn Medicine (Philadelphia, PA) in Oct 2022", "Interview Descriptions": "Took a month to get a callback from HR. Had the interview with the manager 2 weeks after the phone interview with the recruiter. The manager was very welcoming and made it seem like I got the job but just received an email today saying I didn’t.", "Interview Questions": "Tell me about yourself ."}, {"date": "16 Sept 2022", "title": "Patient Service Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Penn Medicine", "Interview Descriptions": "Was called for a interview, completed interview everything was so niceee I love my manager to be already. So down to earth. I did interview, heard back next morning.  Just beginning my pre hire I will be starting in a month!!", "Interview Questions": "3 strengths,3 weakness. Experience. If everything is listed on your resume its no extra questions to be asked they will go over it with you"}, {"date": "31 Aug 2022", "title": "Nursing Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Penn Medicine", "Interview Descriptions": "Interviewers were very friendly and receptive. The communication was fast and efficient I first spoke to a recruiter and then program manager. The process was organized and smooth.  The first interview was over the phone and the second was in person.", "Interview Questions": "Why do you want to work for Penn Medicine. "}], [{"date": "18 Sept 2022", "title": "Patient Service Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Penn Medicine (Philadelphia, PA) in Sept 2022", "Interview Descriptions": "I applied and got a call in 2 weeks. Went to interview met manager and assistant. She was down to earth explained everything to me. The nicest, real down to earth being herself person, telling me how I would benefit. No hard questions. Got a call next day start in 3 weeks I can't wait!!\n", "Interview Questions": "What are my plans in 10 years? "}, {"date": "21 Feb 2023", "title": "Senior Service Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Penn Medicine in Sept 2022", "Interview Descriptions": "I was initially called and was asked to confirm if I had a problem coming into work (This was during the time of Co-Vid and this was working onsite in a hospital)", "Interview Questions": "How do you feel about coaching others who may be in the wrong / or who may need training re professional interactions"}, {"date": "23 Aug 2022", "title": "Surgical Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at Penn Medicine", "Interview Descriptions": "Slow, waited for a call back about one month,  offer was very low had to really fight for salary that I wanted.  Stand your ground don't budge on your requirements", "Interview Questions": "Where do you see yourself in 5 years"}, {"date": "1 Aug 2022", "title": "Social Worker Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Penn Medicine", "Interview Descriptions": "First I had to make a video and send to them. Then they called me to schedule a zoom interview with 2 people- a department head and a clinical supervisor.", "Interview Questions": "Have you ever had a disagreement with your supervisor?"}, {"date": "16 Aug 2022", "title": "Ambulatory RN Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Penn Medicine (Phila, PA) in Aug 2022", "Interview Descriptions": "Easy, efficient, calm,  easy, straight forward, honest,  I don’t have thirty words to describe this process. Felt like home. Already on the team. Hopefully it’s real. Now hopefully the money matches the job.", "Interview Questions": "Skill sets, history, goals, team work"}, {"date": "7 Jul 2022", "title": "Tech Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Penn Medicine", "Interview Descriptions": "Long and extremely unorganized. They seem understaffed in the hr departments leading to long wait times and inefficient processes. Overall felt like a waste of time leading to a poor experience", "Interview Questions": "Describe a difficult situation with a co worker"}, {"date": "14 Jul 2022", "title": "Desktop Support Technician Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 1 week. I interviewed at Penn Medicine (Philadelphia, PA) in Jul 2022", "Interview Descriptions": "4 panel interview with technical and personal questions.  Technical questions were easy.  Personal questions not so much.  They're not looking for skills or experience.  If you're a minority I would avoid applying here.", "Interview Questions": "Why do you want to work here?"}, {"date": "8 Jun 2022", "title": "Clinical Nurse I Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Penn Medicine", "Interview Descriptions": "I applied for multiple positions. Most were Phone screens followed by 1 interview. One was a video montage followed by a phone screen and 1 interview. Another was a phone screen followed by a shadow day (3hrs shadowing the unit, 1hr interview)", "Interview Questions": "Why are you choosing Penn medicine?"}, {"date": "1 Jun 2022", "title": "Registered Nurse Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Penn Medicine", "Interview Descriptions": "2 step with the recruiter and nurse manager, all arranged via phone and email. Took a bit longer for them to work out the logistics, as it is a bigger organization, but still within a reasonable process. Both interviews were conducted online in light of COVID.", "Interview Questions": "Describe a time you had a conflict with a person of the interdisciplinary team and how you handled it. "}, {"date": "19 Jun 2022", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Penn Medicine in Jun 2022", "Interview Descriptions": "I applied in early April, and about a week later was sent a email with a link for a pre recording video interview. About a week after that I was sent another email for a virtual interview with HM, and lead Medical Assistant. A few days later I received and offer so I accepted the position.  I was told my start date which was a little far out, but it gave me time to get everything in order. I had to do drug screwing, background checks and ect.", "Interview Questions": "I was asked how I would deal with a difficult patient and situations"}], [{"date": "26 May 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Penn Medicine", "Interview Descriptions": "I had a Recruiter interview then shadowed and interviewed on the unit. Interviewed my two managers and two staff nurses for about 10 minutes each. Heard back after about 2 and a half weeks.", "Interview Questions": "What is one of your weaknesses?"}, {"date": "8 Apr 2023", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Penn Medicine (Phila, PA) in May 2022", "Interview Descriptions": "Someone intense, I interviewed with 3 managers and the nurse educator for the unit all at once. It was about an hour long in total. I also shadowed the unit for 4 hours prior to the interview.", "Interview Questions": "What is your 5 year plan?"}, {"date": "24 Apr 2022", "title": "Case Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Penn Medicine", "Interview Descriptions": "Interviewed with the social work and rn supervisors. Reviewed my resume and cover letter and talked about my past experiences and how they would be a benefit to the work environment. Interview took roughly 45 minutes.", "Interview Questions": "Why do you want this job? What are your expectations for this job?"}, {"date": "20 Apr 2022", "title": "Medical Coding Trainee Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Penn Medicine (Philadelphia, PA)", "Interview Descriptions": "I applied online, then emailed the person who runs the program. They had to take a three hours ice 10 I'm and pcs coding. After a week or so they will let you know if you passed the test. Then there will an interview with coding managers. I had interviews with 3 people and they all asked questions.", "Interview Questions": "1.Tell me about yourself.\n2. How did you learn about this position and why do you want to work as a coder?\n3. What do you do when you work from home and you have technical difficulties?\n4. What would you do if you could not figure out how to code something?\n5. There was a question about communications?\n"}, {"date": "4 Apr 2022", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 days. I interviewed at Penn Medicine (Philadelphia, PA)", "Interview Descriptions": "went for in person job fair. Interviewed in groups of 3 to 5 people. Interview was easy and straightforward. In interview, was asked to tell me about yourself, time you went above and beyond for patient.", "Interview Questions": "tell me about yourself.\r\ntime you went above and beyond to help pt. "}, {"date": "9 Mar 2022", "title": "Research Coordinator Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Penn Medicine", "Interview Descriptions": "1 Phone Screen with hiring manager, 1 Panel Interview with research team\r\nThey then did a reference check for me and then offered me the job but I declined because I had a better offer with a higher salary.", "Interview Questions": "How is your past experience relevant to our work?"}, {"date": "20 Feb 2023", "title": "Unit Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Penn Medicine in Mar 2022", "Interview Descriptions": "It was pretty easy, just a phone call and a video call with manager. I thought the process was a bit smoother than other interviews that I have done. I think that the video call is less intimidating then an in-person interview due to it being at the comfort of your own home.", "Interview Questions": "1. Why are you leaving your current position?"}, {"date": "5 May 2023", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Penn Medicine (Philadelphia, PA) in Mar 2022", "Interview Descriptions": "The interview process was pretty fast, I met my manager at a recruitment event and set up an interview a day later. I got an offer the day after I interviewed. Was seamless and the recruiter did most of the in between for me.", "Interview Questions": "They asked what made me choose Penn"}, {"date": "8 Mar 2022", "title": "Janitor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. I interviewed at Penn Medicine in Feb 2022", "Interview Descriptions": "Applied for a cleaning position and the on-person interview went well. However, everything that followed afterwards was an absolutely mess. \r\n\r\nThey sent me an offer letter in an account that I never created when I applied for the job via referral. Since I couldn't accept the letter, they made manually re-apply online (submit job history, resume etc) . Then later I receive a rejection letter - turns out that was sent by mistake and they told me to ignore it. How terrible. \r\n\r\nThen they ask me to submit 4 references for this job (who asks for references AFTER you receive a job offer??). Countless online onboarding tasks. CAC clearances, FBI fingerprinting, drug testing. All of that, which I understand. But the way they provide all this info via email is so overwhelming. \r\n\r\nAlso this job does not require a HS diploma, yet I've been asked twice by two different people via email to submit one or else I'll lose the job. Then for my Workday account, they already created a login credential for me however I had to dig through all the emails they sent me in the past week just to find it. They also needed an actual copy of my flu shot in addition to my covid vaccine, however I received my flu shot at a pharmacy which did not provide me any proof. So I had to circle back to CVS to try to get sufficient proof. Also no info provided on dress attire, so I'm not even sure what kind of scrubs to purchase before the first day to prepare. \r\n\r\nAll in all, this is possibly the worst/most frustrating onboarding process I have ever experienced for a new job. So many countless hoops to jump through. All this just for a janitorial position that pays less than the other place I applied to.", "Interview Questions": "What previous experience do you have? "}, {"date": "22 Feb 2022", "title": "Patient Care Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Penn Medicine (Philadelphia, PA) in Feb 2022", "Interview Descriptions": "The interview went very well. I had a tour of the unit and hospital. Then I had an interview with the nurse manager and assistant manager. The interview I believe went well and I look forward to working in the hospital.", "Interview Questions": "How do you handle conflict with a coworker or manager?"}], [{"date": "14 Jan 2022", "title": "Communications Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Penn Medicine", "Interview Descriptions": "Had to complete 30 minute questionnaire, then taped video questions (40 minutes.)    Then I took a half day off from job, recruiter never called at confirmed time.  When I emailed, he responded hours later saying he had technical difficulties -- it was a phone interview.   Rescheduled and went fine... next interview via video. Again time off from work -- hour and 15 minutes said I'd go to the next step and then ghosted.  And I had worked with interviewers in the past and had a relationship-- super disappointed they didn't even have respect to follow-up.  Soured my impression of the medical center overall.", "Interview Questions": "Typical -- just a very long process and waste of time. "}, {"date": "10 Jan 2022", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Penn Medicine", "Interview Descriptions": "Very simple interview , received and email about a week after applying for the position. Interview style was a virtual interview lasted about 20 minutes then I was set up with a second round of interviews with the clinic team", "Interview Questions": "Tell me about a time you went above and beyond for a patient."}, {"date": "6 Jan 2022", "title": "Clinical Nurse I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 3 weeks. I interviewed at Penn Medicine (Philadelphia, PA)", "Interview Descriptions": "Started with a recruiter contacting me. Overview of pay and expectations. In depth interview with unit managers; thoughtful questions and interested responses.  Quick response time around 1-2weeks with their decision. Gives you 24 hours to consider the position.", "Interview Questions": "What was one learning experience you had in clinical?"}, {"date": "7 Jan 2022", "title": "Social Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 2 weeks. I interviewed at Penn Medicine (Horsham, PA) in Dec 2021", "Interview Descriptions": "Recruiter was excellent; personable, and communicative. All of my questions were answered with no ambiguity. The process went fast and I had all of my interviews within about a week, even over the holidays. Compensation/offer letter took a bit longer to come.", "Interview Questions": "Why do you want to work for Penn?"}, {"date": "5 Oct 2021", "title": "Human Resources Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Penn Medicine", "Interview Descriptions": "The company really took covid precautions into consideration, first interview screen was with a recruiter over zoom and the second interview was with the Hiring Manager over zoom as well.", "Interview Questions": "How do you work in your current job? "}, {"date": "8 Nov 2021", "title": "ICU Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Penn Medicine (Philadelphia, PA) in Oct 2021", "Interview Descriptions": "Applied online and completed a self-survey assessment (personality based). Heard from HR 3 months later. Spoke to Talent Acquisition Specialist about the position. I was asked questions like \"Why do you think you're a good fit?\" \"Why Penn? \"What made you go into nursing?\", Then, he set up an interview with the manager of ICU floor I applied to. I went, met her, answered typical interview questions (no clinical scenarios though) and toured the unit and saw the type of acuity. I also had to have my references ready (2 past managers and 2 others) and they had to complete the survey within 2 days (so make sure you pick people than can do it promptly). Then I went home and waited for news. A week and a half later, HR calls me telling me I got the job! Then you have to do a background investigation with HireRight, which took about 5 days. Have your paystubs and diploma ready because that saved me from HireRight not being able to verify it (which takes longer). I proactively uploaded them (uploaded it before they requested it). Now I'm waiting to start!", "Interview Questions": "-What would your past manager say about you?\n-What was your relationship like with your past coworkers?"}, {"date": "20 Oct 2021", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Penn Medicine in Oct 2021", "Interview Descriptions": "I attended their open house and was introduced to the nurse managers of my of the specialties that I was interested in. I met with multiple nurse managers from different specialties and had a brief interview with each while learning more about the nurse residency program since I am a new grad.", "Interview Questions": "What would you do if a co-worker was not doing their job during surgery?"}, {"date": "30 Sept 2021", "title": "Mental Health Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Penn Medicine", "Interview Descriptions": "Straightforward and clear. Met with two very nice staff and they gave me a run down of the hospital and job description.  Just do your homework on the company to do well.", "Interview Questions": "What would I do in a crisis"}, {"date": "30 Sept 2021", "title": "Oncology Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Penn Medicine (Philadelphia, PA) in Sept 2021", "Interview Descriptions": "I did a video interview, which was made up of 6 questions. I could re-record each one as many times as I wanted! It ended up taking me a really long time because I kept re-recording it.", "Interview Questions": "1) Why do you want to be a nurse at penn medicine?\n2) Why do you want to be an oncology nurse?\n3) What is a mistake you've made and how have you learned from it?"}, {"date": "14 Oct 2021", "title": "Unit Secretary Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Penn Medicine (Philadelphia, PA) in Sept 2021", "Interview Descriptions": "Received an email to complete a montage interview (video), skills survey and to schedule a phone pre-screen with recruiter. After phone interview, I was asked to interview in person with the nurse manager and assistant nurse manager. I showed the location where I would be and introduced to potential co-workers. I was also able to get a small preview of what I would be doing. Two days later, I received an offer.", "Interview Questions": "Describe a time when you didn't agree with your manager. \nDescribe a time when you had to work on a team project and how you handled it?\nDescribe a time when you had to deal with an irate patient?"}], [{"date": "6 Aug 2021", "title": "Patient Service Associate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Penn Medicine", "Interview Descriptions": "Long process with minimal overview of benefits . Talked more about the donts and cants versus what Penn offer as a employee . They kept asking is this a job that fits you by talking about the downside, probation and restrictions. Not very welcoming, attitude seems like you need us more than we need you.", "Interview Questions": "Do you think you can work through a six month probation with no call outs???"}, {"date": "16 Aug 2021", "title": "Clinical Nurse II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Penn Medicine (Philadelphia, PA) in Aug 2021", "Interview Descriptions": "I applied and the process was quick. The hr person send an email asking for available dates and times for phone interview. On the phone interview i was asked 3 questions along with some other general information.\r\nAfter the interview  an appointment was set up with the unit manager. Which went pretty well. I was also asked why I want to work for penn, tell me a little bit about yourself.", "Interview Questions": "When was a time I disagreed with my manager?"}, {"date": "10 Jul 2021", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Penn Medicine", "Interview Descriptions": "20 minute Q and A followed by some discussion of past experience, the position, and any relevant skills. Overall it was pretty streamlined since I had taken a class with the professor in charge of the research group.", "Interview Questions": "Why are you a good fit?"}, {"date": "21 Jun 2021", "title": "Patient Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Penn Medicine", "Interview Descriptions": "Easy interview process. Took a little long because of Covid but once things opens back up I was in for intervention and received job . Easy interview question like how would you deal with irate customers things of that nature", "Interview Questions": "How do you deal with irate customers"}, {"date": "27 Jun 2021", "title": "Call Center Customer Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 4 days. I interviewed at Penn Medicine in Jun 2021", "Interview Descriptions": "Video interview with panel. Management, supervisor, and an experienced call center customer service representative. Questions were straight forward and expected. Regarding call center customer service expectations, duties, experience, company, etc.", "Interview Questions": "Why this company? Why now? Describe your experience with different customer service scenarios."}, {"date": "21 May 2021", "title": "Patient Service Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Penn Medicine", "Interview Descriptions": "I have only taken the first portion of the interview process, which is a virtual interview via zoom. The Interview was very speedy, but the interviewers were very friendly and thoroughly described the description of the job. They will ask about you and your work history (pretty standard interview questions) and why you would be an asset to their team. Two days later I was called for the second interview (in person) which I will be going to next week!", "Interview Questions": "So, Tell us about yourself"}, {"date": "21 May 2021", "title": "Systems Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Penn Medicine", "Interview Descriptions": "I only had one round of interview and spoke directly with the Director of Operations for it. The interview was in person, in her office, and lasted an hour. I heard back from their recruiter a week later.", "Interview Questions": "I was asked specific functionality questions on the ERP system they were on. "}, {"date": "6 May 2021", "title": "Licensed Practical Nurse Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Penn Medicine", "Interview Descriptions": "Received a call a week after applying. Had an interview scheduled the end of that week with the practice admin. / managers. It went well and was over a video chat. Within that same day I had received a link to do a montage interview (record answers and submit) but then the next morning received an email from the lady who sent the montage link asking if I'd prefer to do that interview portion over a phone call instead. I accepted it. From the end of the call she said they'll have an answer within a week as they have a few more other candidates to finish the process with. The following Monday I received a skill survey to fi out my references. Now I'm waiting for the word.", "Interview Questions": "Name a difficult situation and how you handled it?"}, {"date": "7 May 2021", "title": "Customer Service Representative Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Penn Medicine", "Interview Descriptions": "1st I had a telephone interview. After the telephone interview I was offered a 2nd interview.\r\nThe 2nd interview was virtual with the leads of the department to which I was applying. We spoke mainly of job responsibilities and my qualifications for the position.\r\n\r\nInterviews were both pleasant and relaxed. Talked mostly  about. the requirements of the job and my availability.", "Interview Questions": "Please tell  me about yourself"}, {"date": "20 May 2021", "title": "Certified Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Penn Medicine (Philadelphia, PA) in May 2021", "Interview Descriptions": "Very easy interview process. Told me about the practice and providers and all the different locations. Training is provided. Phlebotomy is a must but due to covid a lot of schools did not really teach that part. If you are not certified. They require you to do so within 90 days. \r\n\r\nHave to pay for parking everyday", "Interview Questions": "Am I a certified medical assistant "}], [{"date": "31 Mar 2021", "title": "Certified Medical Assistant (CMA) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Penn Medicine", "Interview Descriptions": "Long process but very good and organized. Very professional. During the interview spoke with a lot of members of the facility and felt really welcomed. They answers all my questions and very informal.", "Interview Questions": "Why do you want to work for penn?"}, {"date": "3 Jun 2021", "title": "Laboratory Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Penn Medicine (Lancaster, PA) in Apr 2021", "Interview Descriptions": "Met with the lab manager, was shown around the lab, introduced to a few of the workers, then we sat down and she asked me a series of typical interview questions that she had on a sheet of paper. The questions could be difficult, as they were situational type questions where you have to think of a specific example. But overall it was very casual and the interviewer was laid back.", "Interview Questions": "How do you deal with stressful situations? "}, {"date": "17 Mar 2021", "title": "Clinical Nurse Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Penn Medicine (Philadelphia, PA)", "Interview Descriptions": "The interview process was quick and fair. I interviewed for an entry level position and was asked a lot of question regarding having clinical experience which did not make sense to me.", "Interview Questions": "What is your 5 year plan?\r\nWhat is your experience?\r\nWhy do you want to work for Penn Medicine?"}, {"date": "9 Apr 2021", "title": "Patient Services Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Penn Medicine (Philadelphia, PA) in Mar 2021", "Interview Descriptions": "A phone screening was conducted by department manager and invited to interview with team in person (peer interview). Additional phone screening with Human Resources recruiter. A personalty assessment and video recording is also required.", "Interview Questions": "How well do you manage under stress?"}, {"date": "22 Feb 2023", "title": "Administrator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Penn Medicine in Mar 2021", "Interview Descriptions": "Many interviews required likely a mix on onsite and virtual with a variety of clinical and non clinical leaders. Hard to carve out everything into a compact interview day so give a lot of availability.", "Interview Questions": "Why do you want to work at Penn Medicine."}, {"date": "16 Feb 2021", "title": "Administrative Support Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Penn Medicine", "Interview Descriptions": "Phone Interview as I was located out of state at the time.  Very conversational. Asked some specifics about past job responsibilities that would be relevant to the specific department to which I was applying.", "Interview Questions": "Tell me more about the manuals you wrote for __________ position."}, {"date": "5 Feb 2021", "title": "Licensed Practical Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Penn Medicine", "Interview Descriptions": "Penn was very helpful. Everyone was very nice, and personal during interview. Always had a clear direction of what was expected next. Seems like a really great environment. Staff seems to be really happy.", "Interview Questions": "Why do you want to work here?"}, {"date": "23 May 2021", "title": "Design Strategist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Penn Medicine in Feb 2021", "Interview Descriptions": "Initial zoom call with a couple members of the team. Second zoom interview with many more members of the team. Second interview was more about design process. Also talked had an interview with HR and took an online personality test. Full process was maybe a month.", "Interview Questions": "Describe your design process for a couple of your previous projects. "}, {"date": "11 Jan 2021", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Penn Medicine", "Interview Descriptions": "Applied to new grad position, heard back within a few days. Recruiter called, and scheduled an interview that week. Interviewed with 2-3 people, and offered a position a few days later.", "Interview Questions": "Where do you see yourself in 5 years?\r\nWhen was a time you disagreed with your manager?"}, {"date": "1 Mar 2021", "title": "Clinical Research Coordinator A Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at Penn Medicine in Jan 2021", "Interview Descriptions": "I applied to this job in August of 2020 and was contacted by a hiring manager for a Zoom interview in January 2021 (?).  Interview was ~30 minutes. The interviewer was very nice, gave some good info about the position and day-to-day of the job. She said they were interviewing several other candidates later that week and next, so I should hear back within two weeks.\r\n\r\nThe hiring manager emailed me a few days after the interview asking if I was still interested in the position - though from the phrasing I couldn't tell whether she had forgotten that I'd already interviewed and was asking if I was still interested in setting up an interview, or if she was just asking if I was still interested post-interview. I said yes, and that I enjoyed talking to [interviewer]/learning more about the position. She said \"That's great, I have not followed up with [interviewer] yet, but I will do so today and get back with you.\"\r\n\r\nAfter that I never heard from her or the interviewer, despite following up again a week later. It seems extremely rude to just fully ghost any candidate post-interview, especially after directly promising to follow up. This seems to be pretty standard among hiring managers now - most people I've talked to who are applying to jobs/have done so recently have said they've also just never heard back after interviewing, in some cases after several rounds of interviews.\r\n\r\nA form rejection letter or one sentence email saying \"Sorry we've gone with another candidate\" would be totally fine, but just completely ignoring people like this is so rude and unprofessional.", "Interview Questions": "What skills or qualities do you think are important for this position?"}], [{"date": "26 Jan 2021", "title": "Clinical Nurse 2 Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Penn Medicine (Philadelphia, PA) in Jan 2021", "Interview Descriptions": "I applied for the position on 25 December 2020. Received a call from talent acquisition to schedule a phone interview 10 days later. During that interview, it was a virtual call with the manager of the unit, clinical nurse specialist and a RN from the unit. We had a nice chat lasting about 30 mins. She asked me questions about my job responsibilities at my previous position, my research project and also how do I handle difficult patients. \r\nI then proceeded to bite my nails waiting for the phone call in about 2 weeks time. She asked me for references. At this stage we are about 1 month since the application date.", "Interview Questions": "1) Describe your job responsibilities at your previous job \r\n2) How do you deal with demanding patients or patients who were violent\r\n3) Describe a typical day at work at your previous job \r\n4) Tell me more about your research project. "}, {"date": "14 Sept 2021", "title": "Corporate Finance Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Penn Medicine (State College, PA) in Jan 2021", "Interview Descriptions": "I was not formally interviewed. I emailed back and forth with those in the department and sent in a resume and cover letter. They then told me I had the internship for the summer.", "Interview Questions": "Can you send us a resume and cover letter to see if you would make a great fit?"}, {"date": "9 May 2022", "title": "Physician Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Penn Medicine (Philadelphia, PA) in Jan 2021", "Interview Descriptions": "First I talked with a recruiter, then I submitted a video entry responding to questions that was submitted to the team. Then I shadowed for the morning in the position I would be working for and then had three different interviews in the afternoon with different people I would be working with.", "Interview Questions": "Tell us about a time you worked with someone that you didn’t get along with and how you dealt with that. "}, {"date": "25 Jun 2021", "title": "New Patient Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Penn Medicine (Philadelphia, PA) in Jan 2021", "Interview Descriptions": "I met with both the department leader and physicians in two separate zoom calls. Everyone was nice and very professional. The team seemed to take their work seriously and asked lots of questions", "Interview Questions": "Q: where do you see yourself in 5 years?\nQ: how do you handle unhappy patients\nQ: what are your strengths and weaknesses\nQ: do you plan to pursue further education?"}, {"date": "8 Apr 2021", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Penn Medicine (Philadelphia, PA) in Jan 2021", "Interview Descriptions": "I had to complete a video online for HR.   First interview was with two managers and second interview was with two other admins. All via teams.   That was all that was needed. Fairly easy and conversational.", "Interview Questions": "Nothing out of the oridinary. "}, {"date": "30 Dec 2020", "title": "Clinical Pharmacy Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Penn Medicine", "Interview Descriptions": "I met with my supervisor, other clinical pharmacists, and the lead pharmacy techs. I also had to give a 30 min presentation on a topic of my choice. After the presentation I was asked questions about it. They also took me out to lunch and gave me a tour of the hospital.", "Interview Questions": "Why do you want to work for Penn?"}, {"date": "6 Dec 2020", "title": "Pharm Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Penn Medicine", "Interview Descriptions": "Contacted by recruiter then did video montage first . Called for an in person interview after. Typical interview questions. Everything took about a month to process from the start of the vid to doing background check.", "Interview Questions": "What is your biggest strength "}, {"date": "21 Oct 2020", "title": "Patient Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Penn Medicine in Oct 2020", "Interview Descriptions": "Very simple and average interview questions regarding background and experience. Explaining the role and daily responsibilities. Applied in march, hiring manager called me in october. Had an interview with the HR after a week.. met the hiring manager later.", "Interview Questions": "Experience and background questions.\n Tell me about challenge? \n"}, {"date": "5 Oct 2020", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Penn Medicine in Oct 2020", "Interview Descriptions": "applied to multiple positions online. Then, did a montage video interview, talked to the recruiter over the phone, then they set me up with a manager to do a 1:1 interview", "Interview Questions": "Why did you choose this facility"}, {"date": "12 May 2021", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Penn Medicine (Phila, PA) in Oct 2020", "Interview Descriptions": "Lengthy process! You will do a questionnaire, a video interview, a phone call, 1-3 in person interviews. After that you will wait for the job offer. I began interviewing in September/October.. didn’t start working until December.", "Interview Questions": "Organizational skills. Previous job and how you can use it for job you are applying for. Future goals. "}], [{"date": "15 Feb 2022", "title": "Senior Service Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Penn Medicine (Philadelphia, PA) in Oct 2020", "Interview Descriptions": "I met with the Sr. Manager and the Manager and the Asset manager of the department. They each in turn asked about my experience with MS office (excel) as well as previous work experiences.", "Interview Questions": "*Are you able to multi-task?\r\n*How do you feel your previous work experience has prepared you for this role?\r\n*How much experience do you have with excel?\r\n*How much experience do you have dealing with difficult personalities - can you give an example of when you had to deal with said disruption?\r\n\r\n"}, {"date": "24 Sept 2020", "title": "Certified Nursing Assistant CNA Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Penn Medicine", "Interview Descriptions": "Applied online and heard back from a recruiter. Completed an online questionnaire followed by a prerecorded interview answering questions. I was then asked to videochat interview with the nurse manage and another nurse.", "Interview Questions": "Why would you be a good CNA?"}, {"date": "10 Aug 2020", "title": "Clinical Lab Associate Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Penn Medicine", "Interview Descriptions": "Interview was fairly easy and straight forward. You will get a tour of their laboratory right then and there. Usually the interview is conducted by two individuals and you may also meet with one of the chief pathologists. This sounds a lot more intimidating than it actually is.", "Interview Questions": "Where do you see yourself in five eyars"}, {"date": "9 Sept 2020", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Penn Medicine (Philadelphia, PA) in Aug 2020", "Interview Descriptions": "Easy and friendly. The recruiter was very helpful and gave good reviews. The interview took about two weeks and I got an offer which I accepted. I would do it again", "Interview Questions": "what do you love about homecare"}, {"date": "5 Jul 2020", "title": "Interventional Radiogy Registered Nurse Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Penn Medicine", "Interview Descriptions": "Thirty 34 years of extensive critical care experience with emphasis on level one trauma, burn and post operative transplant patients...was told I was an \"alpha nurse\"....did not get the position.", "Interview Questions": "\"As an 'alpha nurse', how would I go about asking for help if I didn't know something?\""}, {"date": "28 Apr 2020", "title": "Lab Technician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Penn Medicine", "Interview Descriptions": "They are doing only phone interviews right now.  The first part is quick and easy just basic questions, then you get a 100 questions assessment, and if that goes well then you get a real phone or skype interview.", "Interview Questions": "What are your strengths in the lab?"}, {"date": "26 Feb 2020", "title": "Pharmacy Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Penn Medicine", "Interview Descriptions": "There was a video interview, then an in person interview, it took some time for everything to go through, ill say it took about a month to do the video, background test, in person interview, and for HR to clear and accept everything", "Interview Questions": "Where did you work before? Math in pharmacy"}, {"date": "17 Feb 2020", "title": "Inpatient Pharmacy Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Penn Medicine (Philadelphia, PA) in Feb 2020", "Interview Descriptions": "I applied for the position received a phone call for a phone screen. A week or so later I was invited to an interview day to meet with hiring managers. A few days later I was contacted for a second interview.", "Interview Questions": "Explain a time you handled a difficult or stressful situation."}, {"date": "31 Dec 2019", "title": "Clinical Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Penn Medicine", "Interview Descriptions": "Meeting with most senior clinical research coordinator followed by a joint meeting with the head of the research team. These kinds of joint meetings are quite common for most entry level laboratory positions.", "Interview Questions": "Why do you want to join our lab? "}, {"date": "15 Feb 2022", "title": "Research Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at Penn Medicine (Philadelphia, PA) in Jan 2020", "Interview Descriptions": "screening with HR and then video interview with managers that oversee the position and then they do background checks, check references and past employment. the HR process is long because getting into the system requires a bunch of clearances and training so you will not begin work for 2-3 weeks", "Interview Questions": "mostly about your background and how it relates to the new role"}], [{"date": "18 Dec 2019", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Penn Medicine", "Interview Descriptions": "A recruiter will contact you via email to set an appointment time for a phone interview.  The recruiter will explain the role of the position and and ask you questions over the phone. Then you get an in person interview if the manager is interested.", "Interview Questions": "What do you look for in a Company?"}, {"date": "16 Sept 2019", "title": "Patient Service Asso Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Penn Medicine", "Interview Descriptions": "about a month process. submitted a video montage and survey questions. called me about a week or two later asking to come in for an interview. was offered the job directly after the interview.", "Interview Questions": "why are you interested in this position we are offering? "}, {"date": "16 Sept 2021", "title": "Clinical Dietitian Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Penn Medicine in Sept 2019", "Interview Descriptions": "Brought in for an in person interview with the hiring manager and asked a few questions. It felt casual. The hiring manager was late to get me from the lobby.  I did not hear back from hiring manager or HR.", "Interview Questions": "Tell us about a time you had a disagreement with a coworker"}, {"date": "4 Aug 2019", "title": "Clinical Services Associate Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 4 weeks. I interviewed at Penn Medicine", "Interview Descriptions": "I was contacted by a recruiter through e-mail and asked to do a questionnaire and video interview. A few days later I was contacted by a manager to come in for a face to face interview.", "Interview Questions": "What qualities from your current roll could you bring to penn?"}, {"date": "29 Dec 2021", "title": "Corporate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 4 months. I interviewed at Penn Medicine (Philadelphia, PA) in Aug 2019", "Interview Descriptions": "The entire interview process was long and multi-phased but comprehensive and fair. The process took over 4 months in total but sped up at the end. 6 different interviews took place and none were looking for the STaR method or focused on behavioral questions.", "Interview Questions": "Many questions about motivating factors and last experience. "}, {"date": "15 Jul 2019", "title": "RN Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Penn Medicine", "Interview Descriptions": "I completed an employment survey, then had a phone interview with a nurse recruiter. After the phone interview, I set up an in-person interview with the nurse manager. Depending on the unit you're interviewing for, you may shadow an RN on the unit for 3 hours before/after the in-person interview with the nurse manager. For one of my interviews, I had a panel interview right after the interview with the nurse manager.", "Interview Questions": "Where do you see yourself in 5 years? What are your short-term goals? Why do you want to work for Penn Medicine? Tell me about yourself. How did you get into nursing? "}, {"date": "28 Jun 2019", "title": "Physician Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Penn Medicine (Philadelphia, PA) in May 2019", "Interview Descriptions": "The interview involved first a video question montage, then a phone interview with the hiring person, and finally an in-person interview with doctors, other PA's, and the hiring manager, and job shadowing.", "Interview Questions": "What was a time that you had a difficult patient and how did you handle it?"}, {"date": "27 Jun 2023", "title": "Certified Nursing Assistant CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Penn Medicine in May 2019", "Interview Descriptions": "The interview was very relaxed. I was showed around the unit before answering questions. I had a one on one conversation with the nurse manager in her office. The whole interview lasted around 30-45 minutes total.", "Interview Questions": "This job can be very mentally taxing, what do you do outside of work to balance this out?"}, {"date": "23 Apr 2019", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Penn Medicine (Philadelphia, PA)", "Interview Descriptions": "I saw an opening on penn's website, then applied.  hr calls for phone interview, spoke with them for 30 mins.  then you set up in person shadow for 4 hours and then in person interview by manager and staff.", "Interview Questions": "why penn medicine?"}, {"date": "13 Apr 2019", "title": "Radiology Billing Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Penn Medicine", "Interview Descriptions": "It took a while to get an interview but after the first call moved fast. Started by meeting with a few people in the department. They were from different roles in radiology billing formed what they call a “peer search group”. Didn’t know a whole lot of details on actual duties  but gave a good overview of the department as a whole.  They seemed to be really interested in culture and a right fit. I hope o get to next round.", "Interview Questions": "Lots of “tell me a time when” type questions. Can’t remember exact ones"}], [{"date": "19 Jul 2021", "title": "Radiology Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Penn Medicine (Philadelphia, PA) in Jan 2019", "Interview Descriptions": "The interview was very comfortable and the manager was very open to questions and wanted to know about my experience. They explained the position in great detail and even took me on a tour.", "Interview Questions": "where do you see yourself in five years?"}, {"date": "5 Dec 2018", "title": "Mlt Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Penn Medicine", "Interview Descriptions": "after applying i was contacted to set up an interview . the interview lasted about three hours. I wasn't introduced during the interview to other coworkers nor did I tour the Lab.", "Interview Questions": "Where do you see yourself in 5 years"}, {"date": "4 Nov 2018", "title": "Patient Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Penn Medicine", "Interview Descriptions": "I had three separate interviews.  My first was in person, the second was with the recruiter over the phone, and the final one was in person with the director.", "Interview Questions": "Describe a time when you did not get along with a coworker and how did you handle it?"}, {"date": "4 Jan 2022", "title": "EUD Tech Support Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 1 week. I interviewed at Penn Medicine (Philadelphia, PA) in Oct 2018", "Interview Descriptions": "Meet up with the hiring manager and have some friendly conversation with regards to work experience. Most questions asked are pertinent to technical and customer service. If you have experiences in IT support background, as long as you are presentable and personable, you will most likely be selected either for next stage of interview or directly hired.", "Interview Questions": "How did you achieve high customer satisfaction rate in your past working experiences?"}, {"date": "13 Sept 2018", "title": "Clinical Research Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Penn Medicine", "Interview Descriptions": "It was very insightful. You get to meet with the director and physician who would be in charge of the studies you were working on. They were very supportive and helpful. The research you would do there was very cutting edge, so they choose the best to help them conduct their research.", "Interview Questions": "What would you like to get out of this opportunity."}, {"date": "2 Aug 2018", "title": "Clinical Nurse I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Penn Medicine", "Interview Descriptions": "I applied on the job portal and was contacted by an HR nurse recruiter to schedule a phone interview. After the phone interview, I was invited to shadow the unit and to have an in-person interview, during which I met with the nurse manager, nurse specialist, and other staff nurses. Overall the process took about a month - 2 weeks after submitting the application for the phone interview, and then a week or two later for the in-person interview. I received an offer a week later.", "Interview Questions": "Describe a time you were faced with a problem and did not know how to resolve it."}, {"date": "13 Nov 2018", "title": "Patient Service Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Penn Medicine (Philadelphia, PA) in Aug 2018", "Interview Descriptions": "Applied online. Two weeks later received invite for virtual interview then 1 week received call for in-person interview.  Same day was offered to move forward with next steps. Skills Survey, typing test in simulation. Then they call you back to set up OCMED appointment for any shots that you need to take before starting you job.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "19 Feb 2022", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Penn Medicine (Philadelphia, PA) in Aug 2018", "Interview Descriptions": "The interview process was smooth and well designed.  The technology worked the way that it should have and the information needed was available.  The contact person was helpful and knowledgeable about the position being offered.", "Interview Questions": "Tell us about your goals"}, {"date": "7 Sept 2022", "title": "Administrative Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Penn Medicine (Philadelphia, PA) in Jun 2018", "Interview Descriptions": "The interview required three rounds. the first round involved the care team. second was a meeting with senior leadership. last was a group interview. subsequently an offer was made but the job pay scale did not meet my requirements", "Interview Questions": "review of your last job responsibilities \nreview of your professional qualifications\nwhat made you apply to this role\nwhat strengths could you bring to the team"}, {"date": "25 Apr 2018", "title": "Patient Service Representative Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Penn Medicine (Radnor, PA)", "Interview Descriptions": "I received a phone call within 2 weeks of submitting my online application.  I scheduled the in-person interview for the following week, and heard back 10 days later.  The interviewer was mostly interested in a customer service background.", "Interview Questions": "Where do you see yourself in two years?"}], [{"date": "3 Apr 2018", "title": "Care Manager Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Penn Medicine in Mar 2018", "Interview Descriptions": "I applied for this position and got a phone call two days after. I did my due diligence and informed my potential supervisor that I wouldn't be able to get my LCSW within the time frame as listed on the job description. She told me it was fine, the interview went incredibly well I met with my supervisor and the team and was looking forward to working with them. There was some back and forth about the responsibilities of this position and the salary but ultimately I accepted their offer only to have it rescinded a week later. The HR department felt that the requirement was final and told me that if I didn't obtain my LCSW in 6 months I would be fired and because I couldn't get it in 6 months they took back their offer. They had the gall to tell me that should anything change in the future I should consider Penn. Now why would I do that? I gave notice at my job and was lucky enough to still be working with them. After this experience I would look at Penn with hesitation because they revoked my offer and they could do the same to you.", "Interview Questions": "Could you describe your background"}, {"date": "9 Nov 2022", "title": "Unit Secretary Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Penn Medicine (Philadelphia, PA) in Mar 2018", "Interview Descriptions": "After entering the office, the Nurse Manager and Assistant Nurse Manager asked simple questions, but probably just wanted the job filled after many failed attempts. Learned afterward that the Manager is extremely strict/ picky.", "Interview Questions": "Do you work well with others?"}, {"date": "7 Mar 2018", "title": "Patient Service Representative Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Penn Medicine (Phila, PA) in Feb 2018", "Interview Descriptions": "Terrible. Wanted me to do a video interview and the recruiter was super unprofessional. She told me that my salary requirements were unreasonable. This experience was super impersonal. I'd rather be called and phone screened.", "Interview Questions": "How do you deal with an upset customer."}, {"date": "5 Feb 2018", "title": "Staffing Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Penn Medicine (Philadelphia, PA) in Feb 2018", "Interview Descriptions": "The interview process was pretty fast, about 6 days after applying online, I received an e-mail requesting I set up a phone screening.  The phone screen was about 30-40 minutes with the Director of the department and it was very informative in regards to the role", "Interview Questions": "What interests you in this role?\r\nTell me more on how your skills match with this role?\r\nHow do you handle multiple task, and how to you prioritize?"}, {"date": "20 Aug 2018", "title": "Director, Division Administration Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 6 weeks. I interviewed at Penn Medicine (Philadelphia, PA) in Feb 2018", "Interview Descriptions": "30-min phone call with hiring manager (head of department that oversees division)\r\nRecorded a series of videos online using Montage answering specific interview questions\r\nIn-person interview that lasted most of the day, with 30- or 60-minute long conversations with a variety of stakeholders", "Interview Questions": "Why are you interested in this position?"}, {"date": "6 Apr 2018", "title": "Physician Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Penn Medicine (Philadelphia, PA) in Feb 2018", "Interview Descriptions": "I first got an email that I had to complete an online survey and video montage. After that I  then got selected for interview which I went in person to complete.", "Interview Questions": "Why do you want to work here"}, {"date": "26 Mar 2018", "title": "Clinical Nurse I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Penn Medicine in Feb 2018", "Interview Descriptions": "Applied online at Penn website. Waited 4 weeks before getting an email about a phone interview. Waited another week for the phone interview. The Interviewer was very professional and very helpful.", "Interview Questions": "Why do you want to work at Penn?"}, {"date": "1 Jan 2018", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 days. I interviewed at Penn Medicine", "Interview Descriptions": "Generally a pretty easy interview process for research assistant roles. You just need to email a potential research lab you would be interested in joining, and they will invite you to work there if you seem interested or qualified.", "Interview Questions": "What is something you would be interested in pursuing in the lab?"}, {"date": "3 Oct 2017", "title": "Patient Access Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Penn Medicine (Phila, PA)", "Interview Descriptions": "The executive staff consisted of kind individuals who focused the interview process on getting to know me as a person. The questions asked were appropriate to the position and direct to the point. I appreciated how comfortable I felt during the interview.", "Interview Questions": "What are a few important things you know about health insurance benefits?"}, {"date": "20 Dec 2017", "title": "PSA Patient Service Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 1+ week. I interviewed at Penn Medicine (New York, NY) in Dec 2017", "Interview Descriptions": "After submitting 30 applications in  different areas for PSA for 2 months. When I finally got a call the entire process took 2 weeks.  \n\nI submitted application online, 2 days later contracted by HR for phone interview 3 days after that, did a face to face interview with two staff. A week and half later got a call from HR for reference process, completed same day. Next day call with offer.", "Interview Questions": "Situation where you had to give exceptional customer service?"}], [{"date": "3 Nov 2017", "title": "Clinical Research Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Penn Medicine", "Interview Descriptions": "Depends on the department, but I had a short phone screening type interview and then a formal in-person interview with the supervisor. Asked general behavioral questions but also more specific clinical role playing questions.", "Interview Questions": "Asked about electronic health records knowledge"}, {"date": "31 Oct 2017", "title": "Medical Records Clerk Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Penn Medicine", "Interview Descriptions": "Manager contacted me and the interview went well and the recruiter emailed me the next morning asking for references. Still waiting it's been a week so I'm still hanging in there. The last time I spoke with the recruiter she said she will keep in contact soon.", "Interview Questions": "Tell me about yourself "}, {"date": "7 Dec 2017", "title": "Medical Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Penn Medicine (Philadelphia, PA) in Nov 2017", "Interview Descriptions": "Got a call for an interview with office manager and recruitment rep. I then got an email 2 week later for a video interview/screening process. If selected for a 2nd interview a call will be made to from the clinical director", "Interview Questions": "Give us an example of detailing with a difficult patient?"}, {"date": "23 Sept 2017", "title": "Medical Laboratory Scientist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 8 weeks. I interviewed at Penn Medicine (Philadelphia, PA)", "Interview Descriptions": "The process was the basic interview process: met with supervisor, discussed job responsibilities, toured lab, reviewed resume, answered questions directed at candidate, had opportunity to ask further questions regarding position.", "Interview Questions": "Why do you want to work in this specific department?"}, {"date": "9 Oct 2017", "title": "Administrative Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Penn Medicine (Philadelphia, PA) in Sept 2017", "Interview Descriptions": "First you have to apply, then you have to be offered a video interview, then you're offered an on site interview that is about 6 hours long. Met with very prestigious leaders. It was a long day, it was stressful, but that is what the best company's do when they want to hire the best people.", "Interview Questions": "Describe a time where you were influential to someone or a group and what was the result?"}, {"date": "29 Oct 2018", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Penn Medicine (Philadelphia, PA) in Sept 2017", "Interview Descriptions": "I was called initially with simple interview questions then set up a date to shadow and meet with the nurse director and manager of the floor.  Afterwards HR asked for my references and within a week I was offered a position.  From the initial application submission to completion was roughly 2 months.", "Interview Questions": "Describe a time that you were in a difficult situation at work, and how did you remedy it?"}, {"date": "27 Sept 2017", "title": "Patient Service Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Penn Medicine (Philadelphia, PA) in Aug 2017", "Interview Descriptions": "I applied online August 11 was emailed a personality assessment following the personality assessment I had to submit a video montage where I was asked 5 questions about a week and a half later I received a call from manager for face to face interview met with 2 supervisors very nice and down to earth about 2 weeks later received call from recruiter saying managers were very interested did a brief phone interview with recruiter was sent reference link about a week later recruiter called with job offer", "Interview Questions": "Why do you want to leave your current position?"}, {"date": "1 Sept 2017", "title": "Patient Service Associate Trainee Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Penn Medicine (Philadelphia, PA) in Aug 2017", "Interview Descriptions": "After I filled the app out. I was sent a survey to full out. Then I had to submit a montage video interview and answer 5 questions. Next I had to take a \"Prove it\" assessment. After that I was invited to a one on one interview which was a hour long.", "Interview Questions": "Describe a time when you had to multitask."}, {"date": "3 Aug 2017", "title": "Food Service Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Penn Medicine (Philadelphia, PA) in Aug 2017", "Interview Descriptions": "Filled out application got a email to do a survey then got called for a interview. Basic question about previous job and why they should hire me. Drug test background check patch finger print", "Interview Questions": "How do u deal with pressure?"}, {"date": "29 Aug 2017", "title": "Patient Service Representative Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Penn Medicine in Jul 2017", "Interview Descriptions": "Exactly a month ago I submitted my application online. About 1 week later, I received an email requesting that I complete a personality- type exam. It was about 2-3 days after that, that I was requested to submit the video montage. Since then, I've heard NOTHING. I would think if the answer is no, they would at least contact you to let you know. For a company with such an outstanding reputation, I am very disappointed in their interview process.", "Interview Questions": "I was asked a series of 5 questions to determine how I would handle specific situations with patients/co-workers."}], [{"date": "6 Feb 2018", "title": "Certified Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Penn Medicine (Phila, PA) in Jul 2017", "Interview Descriptions": "The interview process lasted a total of 2 weeks. From the date I applied to the date that I got an offer from HR. The process was not difficult but it was detailed. Make sure all of your paper work is organized and ready to be faxed at any moment. Penn makes it easy to be able to do interviews and get your physical done. The manager was very nice, polite, and kind during the interview.  She focused on my current work experience and my personal experiences when it come to patient care.", "Interview Questions": "Why are you leaving your current employer?"}, {"date": "20 Jun 2017", "title": "Associate Director Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. I interviewed at Penn Medicine (Philadelphia, PA)", "Interview Descriptions": "Lengthy process.  It involved multiple group/ panel interviews plus a presentation. I enjoyed meeting with many of the individuals. Still waiting for an official \"no thanks\" - it's been just over a year now!", "Interview Questions": "Why are you looking to make a change now?"}, {"date": "4 Jul 2017", "title": "Director of Operations Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Penn Medicine (Philadelphia, PA) in Jun 2017", "Interview Descriptions": "I applied on-line for the position in January.  I had essentially forgotten about my application until 5 months later when out of the blue I received a request to complete a video interview within 48 hours.  I completed the interview and received an automated reply that it was received.  A month later and still no follow-up from Penn Medicine.\r\n\r\nAll in all an odd process.  At no point was I in direct contact with an resource from Penn Medicine, it was all form letters via e-mail.  There was no initial phone screen with HR or anyone else from the company.", "Interview Questions": "Describe a difficult situation in your current role, what you learned from it and how you applied to your work going forward."}, {"date": "26 Mar 2020", "title": "CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Penn Medicine in Jun 2017", "Interview Descriptions": "I received an email to schedule a phone interview. went in and shadowed. I interviewed with the unit manager then had a panel interview with the nursing staff.  Overall the interview was good.", "Interview Questions": "Tell me about your self!\r\nWhy Penn?\r\nare you a team player?"}, {"date": "29 Sept 2021", "title": "RN Stepdown Neurology Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Penn Medicine (Philadelphia, PA) in Jun 2017", "Interview Descriptions": "It was highly efficient and people-centered. I met with the manager and toured the floor. I shadowed a fellow RN for 4 hours on her shift. I was able to ask her questions about her workflow. Overall, I was able to get enough information from this interview to decide I wanted to work there.", "Interview Questions": "Tell me about your previous experience.\n\nHow do you handle a clinical emergency?"}, {"date": "30 May 2017", "title": "Clinical Nurse Research Coordinator @ FTD Center Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Penn Medicine", "Interview Descriptions": "2 hour long interview where you meet with the NP, Director, and current RN in the position. Then you meet the docs and the main PI/senior MD. Senior MD calls the shots.  He offered the position immediately at the end of the interview but demanded an answer within 2 days. The NPs and current RN helped negotiate that I can give an answer in 3-5 days.", "Interview Questions": "Why are you into research?"}, {"date": "19 Apr 2017", "title": "Communications Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Penn Medicine (Philadelphia, PA)", "Interview Descriptions": "Arduous.\r\n\r\nAfter initially applying for the job on the website, apparently the job changed so three months passed before I heard back from a recruiter. The recruiter asked if I was still interested/available and schedule a phone interview. \r\n\r\nAbout a week after a short phone interview with the recruiter, I received an email invitation to complete an \"On-Demand\" video interview (via a site called Montage) within 72 hours. In the video interview, I was given five or six questions to answer while recording my response on my computer's camera. After each response was recorded, I could choose to accept or re-record my response. I re-recorded my first response a few times before I was satisfied. For the remaining questions, I wrote out my answers first and essentially taped cue cards behind my computer screen and did my best acting to read what I wrote in a natural tone and voice. I still ended up re-recording each of my responses at least twice. The video interview process took me two or three hours. (Later, I found a telepromter like app that would've probably work better.)\r\n\r\nThe following day, I received an acknowledgement that my video had been accepted and asked to take a healthcare assessment survey. Essentially, it was a personality inventory/survey of roughly 100 questions to determine if my personality type would be a good fit with the organization.\r\n\r\nA week or 10 days later, I received an email from the hiring manager requesting a telephone interview. We set a time for the following week. At the appointed time, the hiring manager did not call. Within 15 minutes of the scheduled time, I got an email from the hiring manager apologizing and explaining an issue at Penn had come up which would require us to re-schedule our call for another day. Later that same week, we conducted the phone interview.\r\n\r\nAnother week or so passed before I heard back. This time, it was a request for an in person interview in Center City Philadelphia. This interview was with the hiring manager and another manager/director in the same department.\r\n\r\nI heard back from Penn about a week or ten days later asking me to come in again for interviews with the hiring manager's supervisor and key stakeholders. During these interviews I met the team who would have the most interaction with the person hired. Before the day ended, I was given a case study to review and write a response.\r\n\r\nEight to ten weeks passed before I received the next email. It was a generic rejection letter.\r\n\r\nEveryone was friendly and professional throughout the process.", "Interview Questions": "Besides the traditional questions related to my experience and background, the interview questions were typical behavioral and situational questions."}, {"date": "7 Sept 2017", "title": "Clinical Nurse I Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Penn Medicine in Apr 2017", "Interview Descriptions": "I applied through an employee referral. I had an in person 4 hour shadow with a nurse on the unit. After the shadow, I interviewed with the nurse manager, followed by a panel interview.", "Interview Questions": "Tell me about yourself?"}, {"date": "30 Apr 2017", "title": "Billing Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Penn Medicine (Philadelphia, PA) in Apr 2017", "Interview Descriptions": "I first had to do the video interview, then a face to face interview, then a second interview. During the video interview, you are asked five questions that you get to do over if needed before submitting the final video.  From there a recruiter will email you for the face to face interview.  There questions like tell us about yourself, why do you want to work for Penn, give us a typical day of your current work activities are asked.", "Interview Questions": "why do you want to work for Penn?"}, {"date": "9 Jan 2021", "title": "Registered Dietitian Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Penn Medicine (Philadelphia, PA) in Mar 2017", "Interview Descriptions": "I was screened by phone. I then had an interview in person. The offer was made by phone.  I spoke with the hiring manager,  a recruiter and an onboarding person.", "Interview Questions": "How long have you practiced as a dietitian?"}], [{"date": "23 Feb 2017", "title": "Clinical Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Penn Medicine", "Interview Descriptions": "Business Administrator for the Department held the initial interview, followed by the direct supervisor and then some other staff. It lasted half the day with speaking to several people and going to/from several different buildings to meet with them.", "Interview Questions": "How familiar are you with sponsor-driven clinical trials?"}, {"date": "20 Apr 2017", "title": "Anonymous Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Penn Medicine (Philadelphia, PA) in Feb 2017", "Interview Descriptions": "This was my second time interviewing for a position at Penn Medicine and it will be my LAST because after this interview I realized I would NEVER work here. The interview I recently had (along with my previous one) was absolutely ridiculous. The interview started and I literally had no idea what the people interviewing me were talking about (and still don't) - something about belts, rankings.... things that no one would know unless you actually worked there! Then, I had to take the most ridiculous assessment (and similarly, I had to take an assessment for my last interview as well) - honestly I just think feel like they are looking for all geniuses to work at Penn and I'm smart but not a genius so I will happily seek employment elsewhere. Oh and I had to pay for my car to be valet parked during my interview. That right there just proves how many people they must have interviewing if they couldn't even validate/comp my parking.", "Interview Questions": "N/A"}, {"date": "25 Jan 2017", "title": "Research Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Penn Medicine (Philadelphia, PA)", "Interview Descriptions": "I applied online through the Penn portal and was contacted via email for a phone interview about a week later. I had a phone interview with a senior researcher and PI from the lab I had applied to. My academic background and research experience were discussed. A week after this, I was contacted with an invitation for an in person interview.", "Interview Questions": "They asked about my background in laboratory research and my familiarity with lab techniques."}, {"date": "15 Nov 2016", "title": "Clinical Nurse I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Penn Medicine", "Interview Descriptions": "I had worked there previously in a different role (before becoming an RN) and submitted my resume to one of the managers who knew me. HR contacted me to set up shadowing and an interview with a couple people who work in that unit. I got an offer less than a week later. Very efficient process. HR rep was very friendly - one person throughout the whole process.", "Interview Questions": "Difficult patient"}, {"date": "10 Nov 2016", "title": "Patient Access Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Penn Medicine (Philadelphia, PA) in Oct 2016", "Interview Descriptions": "I applied for the Patient Access Representative Trainee through the Penn Medicine job website. After completing the application about an hour later I received and email from a recruiter requesting that I complete a survey/Personality test. After completing the personality test I was then sent a link for me to complete a video interview via the montage system. You record your answers to pre-selected questions. Upon approval of my interview I was sent a link to complete a prove it test. Two weeks after I completed the prove it test I received email notification of a face to face interview. Three days after completing my face to face interview I received a job offer.", "Interview Questions": "How did you handle a stressful situation with a patient?"}, {"date": "10 Apr 2018", "title": "Clinical Research Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Penn Medicine (Philadelphia, PA) in Nov 2016", "Interview Descriptions": "Questions about past education, Medical philosophies,  and understanding how to conduct high quality research. They wanted to get to know my personality as best as possible with questions like \"how do you maintain organization, how do you deal with conflict, what was a time that you had conflict and how did you deal with it\"", "Interview Questions": "What is your understanding of the injustice that happens because of research and how to you see yourself being a tool to ensure ti doesn't happen."}, {"date": "1 Mar 2018", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Penn Medicine (Phila, PA) in Nov 2016", "Interview Descriptions": "The interview process was very easy. First a webcam interview and then a second interview with management and staff. Then hiring manager got back to me within a few days. After being offered the position, HR then calls you with your salary. I was an internal hire. I was only offered a $1.50 more than I was previously hired.", "Interview Questions": "Typical interview questions nothing drastic"}, {"date": "25 Oct 2016", "title": "Research Specialist B/C Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Penn Medicine", "Interview Descriptions": "One 30 minute in-person interview to discuss laboratory experience and background.\r\nAsked about technical and laboratory skills, time management, and interpersonal skills.\r\nAsked whether or not I would be willing to work flexible hours.\r\nAsked how I would make up a solution of a reagent given the salt and diluent.", "Interview Questions": "Are you comfortable with mice?"}, {"date": "21 Sept 2016", "title": "Medical Technologist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Penn Medicine (Phila, PA)", "Interview Descriptions": "I applied on Penn Medicine career webpage for full time an evening shift position. I was contacted shortly by dept to set up an in-person interview. Was interviewed by the supervisor and lead technologists. During the interview I was asked if I would take night shift position. I said no and she kept pressing me. I told her no. Next day, I received an email stating the evening shift position was filled by an internal candidate and there is only night shift position available. I replied wishing their team a success and asked her to let me know when day or evening shift positions become available.\r\n\r\nCan't remember, it was few months ago. I was given a theoratical and a technical written test to complete during an interview. \r\n\r\nCompleted the written test with all answers correct.", "Interview Questions": "Can't remember, it was few months ago. I was given a theoratical and a technical written test to complete during an interview."}, {"date": "11 Sept 2016", "title": "Recruiter Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Penn Medicine (Philadelphia, PA)", "Interview Descriptions": "Two part interview. First part was about 3 standard questions asked by current recruiters. Final stage included an aggressive grilling with the department director. Without 5 years experience, hiring manager required a lot of convincing to believe I was qualified.", "Interview Questions": "What's the first word that comes to mind when you think of the color yellow?"}], [{"date": "15 Sept 2016", "title": "Sonographer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 1+ week. I interviewed at Penn Medicine (Philadelphia, PA)", "Interview Descriptions": "It seemed the place is organizing the person i had my interview was a little bit late but he gave me an excuse. The interview went well but they were looking for someone to cover the night shift and looking for a female.", "Interview Questions": "experience"}, {"date": "13 Sept 2016", "title": "Lead Applications Developer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Penn Medicine (Philadelphia, PA)", "Interview Descriptions": "Phone screen with HR.  The HR representative was more interested in my salary requirements than my actual qualifications, and rude, so I chose to not proceed with the process.  She was also not able to answer most of my questions about the position.", "Interview Questions": "How much are you making currently?"}, {"date": "28 Jun 2019", "title": "Patient Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Penn Medicine (Phila, PA) in Aug 2016", "Interview Descriptions": "Extensive so the more prepared you are with references and resume the better off you will be. Smiling and being sociable is key.  Ask question the interview as well, it shows how dedication.", "Interview Questions": "How would you handle work conflict?"}, {"date": "6 Jul 2016", "title": "Clinical Nurse I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Penn Medicine", "Interview Descriptions": "I first had a phone interview with an HR recruiter for the unit. After the phone interview I was contacted to set up an in person interview that consisted of a 2 hour shadow experience with an 1 hour interview with the nurse manager following. During the sit down interview portion, the unit's nurse manager as well as the clinical nurse specialist and another unit nurse manager were present.", "Interview Questions": "Give us an example of a time you had a very difficult patient that made you unable to spend adequate time with your other patients. How did you handle this?"}, {"date": "19 Aug 2016", "title": "Clinical Nurse II Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Penn Medicine (Franconia, PA) in Jul 2016", "Interview Descriptions": "Generic 15 minute interview. Didn't really ask me anything about myself. Told me next step is to shadow which I did for four hours two days later. Followed up with thank you email. Never got a response.", "Interview Questions": "So why Penn?"}, {"date": "11 Jan 2017", "title": "Patient Service Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 3 months. I interviewed at Penn Medicine (Philadelphia, PA) in Jun 2016", "Interview Descriptions": "The interview process took some time. It took about 3 months from application date to start date. There was a phone interview, video interview, survey, assessment, and two 30-minute in-person interviews. The 1-on-1 interviews included about 5-7 behavioral questions each. I felt they really learned a lot about my work ethic in the short 30 minutes.", "Interview Questions": "Explain to me a time when there was problem in your workplace and how you fixed it."}, {"date": "25 Jan 2017", "title": "Patient Service Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Penn Medicine (Radnor, PA) in Mar 2016", "Interview Descriptions": "Was contacted within a couple weeks of application (although I know most people say it can take several months to complete the whole interview process). Normal interview with practice manager and coordinator. Came back about a week later to shadow.", "Interview Questions": "What are your strengths/weaknesses?"}, {"date": "20 Mar 2016", "title": "Physician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Penn Medicine (Philadelphia, PA)", "Interview Descriptions": "Confusing, human resources and recruitment personnel were too busy and overwhelmed. Interview was quick and impersonal and was more of 15minute advertisement followed by, \" any question's? When can you start?\"", "Interview Questions": "Standard question's, \"Where do you see yourself in 10 years...?\""}, {"date": "1 Mar 2016", "title": "Patient Service Representative Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 5 days. I interviewed at Penn Medicine (Radnor, PA)", "Interview Descriptions": "I knew someone who was already working at Penn Medicine, they helped pass my resume along. If you do not know someone, good luck. It's a large hospital, and hearing back or getting an interview is a long process. Once I was hired, I was offered the job and started within 3 weeks.", "Interview Questions": "how do you deal with difficult people"}, {"date": "28 Apr 2016", "title": "Blood Bank Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Penn Medicine (Philadelphia, PA) in Mar 2016", "Interview Descriptions": "I applied for a position online on 03/17/2016. I received a phone call to schedule an interview next day. I was scheduled for face to face interview one week later. I had online references to be completed. I was offered a position by week 3.", "Interview Questions": "Questions were basic: they asked about my past experience, the systems I have used.Everyone was very friendly."}], [{"date": "21 Apr 2020", "title": "Certified Nursing Assistant CNA Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Penn Medicine (Philadelphia, PA) in Mar 2016", "Interview Descriptions": "The interview went well but I didn’t like the fact that they asked former nurses that you’ve worked with for a references about you instead of doing a professional reference.", "Interview Questions": "Do you get along well with others ?"}, {"date": "13 Feb 2016", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Penn Medicine", "Interview Descriptions": "Applied in early January..received a phone call first for a phone screen interview later that week and scheduled an in person for the following week. Phone screen was lengthly and took about an hour. A lot of situational questions. In person interview was very pleasant. Met with the manager who went over the orientation process and then sent me to interview with a nurse on the unit for about an hour.\n\nTook about two weeks to get a reference request and then received an offer a week after the completed reference check", "Interview Questions": "Tell me about a situation when you made a mistake"}, {"date": "28 Oct 2015", "title": "Unit Clerk Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Penn Medicine (Philadelphia, PA)", "Interview Descriptions": "I applied online and received an email for a recruiter prompting me to do a survey 2 days later. Afterwards I received a call from hr for a brief phone interview 5mins. She scheduled me for my first interview with took place  a week later. At the interview I was informed that they'd like to arrange a follow up interview with a colleague. The first interview was pretty straight forward. And took only  30mins. I was walked around the unit and introduced. The second was mostly  informational.", "Interview Questions": "If I called you last employer what would they say you greatest strength is, weakness?  \r\nHow do you handle difficult patients?"}, {"date": "30 Jul 2015", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Penn Medicine", "Interview Descriptions": "Pretty straight forward: found the position on line and applied. A recruiter contacted me within 3 weeks. I was scheduled for a face to face interview a week after the phone interview. I was hired by week 4.", "Interview Questions": "What do you know about clinical trials? "}, {"date": "16 Sept 2015", "title": "Billing Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 8 weeks. I interviewed at Penn Medicine (Philadelphia, PA) in Jul 2015", "Interview Descriptions": "Received an email with behavioral test. Then received call from department manager to set up interview for the following week. However, did not receive a follow up call for 7 weeks.", "Interview Questions": "Why are you a qualified candidate?"}, {"date": "11 Jun 2015", "title": "A/R Representative Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Penn Medicine (Philadelphia, PA) in May 2015", "Interview Descriptions": "You have to fill out a questionnaire and a montage video before the actual interview. They make you answer three questions about yourself and experience. They then call with a phone interview. Normal phone interview questions were asked. Interviewed with 3 people the assistant Supervisor, supivisor, and manager. Questions included more information about yourself and experience as well as how you conduct yourself in an office setting. They also asked of knowledge about specific systems.", "Interview Questions": "What makes you a qualified candidate?"}, {"date": "5 Aug 2016", "title": "Patient Service Representative Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 2 weeks. I interviewed at Penn Medicine (Phila, PA) in May 2015", "Interview Descriptions": "First there was a screen interview where you would record your answers to questions they display on a screen, when you are considered then a face to face interview was set up.", "Interview Questions": "Tell me about a time you had a difficult patient?"}, {"date": "25 Jun 2015", "title": "Medical Records Clerk Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Penn Medicine (Cherry Hill, NJ) in Mar 2015", "Interview Descriptions": "I applied for this position in January 2015 but wasn't contacted for an interview until March.  This particular interview was in-person.  I was interviewed by the practice manager as well as the head of the location's medical records supervisor.  Overall, the experience went fairly well, and my interviewers seemed like nice people.  This particular location also seemed to treat the patients they serviced fairly well too.  The interviewers didn't ask me questions that were too hard to answer.  The majority of the questions asked pertained to the extent of my exposure to patient records, particularly, how experienced I was in dealing with EHRs (electronic health records).  Only a couple questions were asked regarding some of the skills and education I listed on my résumé.", "Interview Questions": "Are you familiar with Epic and if so, how often did you use it at your last job?"}, {"date": "21 Feb 2015", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 3 weeks. I interviewed at Penn Medicine", "Interview Descriptions": "Started off with Phone screen which lasted around eight mins. Then three weeks later had an 2 1/2 hr in-person interview and panel interview which went really well. I was offered a opportunity to shadow on a day of my choosing. I received a phone call for a job offer two days later. Great Experience overall.", "Interview Questions": "Name a time you acted as a mentor or leader "}, {"date": "16 Feb 2016", "title": "Unit Clerk Prn Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 4 weeks. I interviewed at Penn Medicine (Philadelphia, PA) in Feb 2015", "Interview Descriptions": "The process was great interview less than 45 minutes. Met with Nurse Manager and Senior Clerk both were great. Interview went really well. I got a call back a week later for reference check.", "Interview Questions": "What is an area I need to improve."}], [{"date": "17 Nov 2015", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Penn Medicine (Philadelphia, PA) in Jan 2015", "Interview Descriptions": "interview process was weak. spoke with preceptor about certain topics and projects you would be working on during the course of the internship. Then you had to get a background check and a drug test IF you were selected for the internship program. This program was based on a first come, first serve basis with the obvious notion that you were B+-A student in college.", "Interview Questions": "Why Penn Medicine?"}, {"date": "26 Dec 2014", "title": "Associate Training Education Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at Penn Medicine", "Interview Descriptions": "I was contacted by an internal recruiter about the position. Was asked to do an online questionnaire and video interview process in which I answered several questions about my past experiences and history. I also scheduled time to speak on the phone. I completed the video interview process and spoke briefly to the recruiter on the phone. I was told everything looked good and to expect to hear back in a week or two to schedule a follow up interview. I never heard back.", "Interview Questions": "Provide an example of a learning intervention you implemented or instructional strategies you used which was successful. Why do you think it worked well? How did you make sure that the skills were successfully transferred to the work situation?"}, {"date": "4 Oct 2015", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 4 months. I interviewed at Penn Medicine (Philadelphia, PA) in Oct 2014", "Interview Descriptions": "The interview was pretty simple. They asked about any type of experience I had volunteering. I was also given a packet which I had to read and there were questions at the end that had to be answered. Overall, the interview process was very easy and the volunteer office was very accomadting as well.", "Interview Questions": "Do you have any previous experience volunteering somewhere else?"}, {"date": "28 Aug 2015", "title": "Senior Compliance Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 1 day. I interviewed at Penn Medicine (Phila, PA) in Sept 2014", "Interview Descriptions": "HR manager suggested I apply for the position.  I did and the hiring manager from the department decided to do a phone interview.  An date was made and my phone interview lasted approximately fifteen minutes.", "Interview Questions": "How are you qualified for this position?"}, {"date": "19 Jun 2018", "title": "Desktop Support Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Penn Medicine (Philadelphia, PA) in Apr 2014", "Interview Descriptions": "interview process was nice and smooth.  was a great job experience.  The interview was long but worth the time after starting.  I applied several times over the years and loved the experience", "Interview Questions": "describe your weakness"}, {"date": "10 May 2014", "title": "Project Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Penn Medicine (Philadelphia, PA) in Mar 2014", "Interview Descriptions": "People in the office were all very friendly. The HR contact didn't give me the direction are agenda prior to the interview. I reached out to her several times however she never returned my calls.  I got the information the AM of the interview while I was driving to the company. The interviews were 1:1 sessions. Pleasant until got to the hiring manger. She looked tired and wasn't particularity friendly.  I thought it would be a great place to work.. Behavioral interview. Be prepared.", "Interview Questions": "Tell me about your last project the did not go well."}, {"date": "27 Mar 2015", "title": "Coding Academy Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Penn Medicine (Phila, PA) in Feb 2014", "Interview Descriptions": "Arduous and rewarding interview experience. Felt like you accomplished something substantial at the end of the process. Had to take 3 hr. Skills test which was rigorous. Made the cut of 20 out of 75 who took test. Then came 1 on one interview down to final 13.", "Interview Questions": "Video interview with automated questions. Very exhaustive."}, {"date": "6 Jan 2018", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at Penn Medicine (Philadelphia, PA) in Feb 2014", "Interview Descriptions": "I interviewed for a med/surg RN position as a new grad. The nurse manager was kind, the interview was very laid back. I then came back and shadowed before they officially accepted me.", "Interview Questions": "They asked about my critical thinking skills, background, and why I wanted to be on the unit. "}, {"date": "15 Jan 2014", "title": "Senior Medical Secertary Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Penn Medicine", "Interview Descriptions": "Submitted resume through current employee. Got a call the next day than interviewed a week later got an offer the next day. Tried to negotiate didn't work.", "Interview Questions": "Didn't really ask to many questions told me about the job."}, {"date": "7 Jan 2014", "title": "Senior Programmer Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at Penn Medicine (Philadelphia, PA)", "Interview Descriptions": "Wasn't bad at all. The interview was very fair. Was honest about skills", "Interview Questions": "N/A"}], [{"date": "5 Apr 2016", "title": "Marketing Communications Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Penn Medicine (Philadelphia, PA) in Jan 2014", "Interview Descriptions": "The interview process was pretty standard. I applied to the position online and was contacted for an interview about 2 weeks after. On-site, I met with a specific business/product  manager as well as a higher level department head (VP). They were hiring 2 roles and when I arrived it turned out that one had already been filled internally, which was disappointing to hear.", "Interview Questions": "Interview mostly involved questions regarding experience and fit for the position. Tell me about yourself and current job. Why do you want the position? Strengths, weaknesses, etc."}, {"date": "5 Oct 2013", "title": "IT Technician Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied through a recruiter. I interviewed at Penn Medicine", "Interview Descriptions": "The supervisor who interviewed me was instantly dislikable; the type of guy who looked like he could suck the life out of a room just by walking in.  His answers to my questions were curt bordering on rude, he seemed uncommunicative, and appeared to be absolutely miserable working there.  He must have used the bathroom prior to meeting me because he had urine stains all over the front of his khakis, yet he stressed several times the importance of looking presentable on the job.  Seemed like he would be an awful person to work for.", "Interview Questions": "None, really.  He did all the talking."}, {"date": "7 Oct 2013", "title": "Supervisor, Patient Registration Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Penn Medicine", "Interview Descriptions": "First I recieved an email from HR aasking for a few times thatbworked for me that we could talk. Reviewed experiences on my resume tailoring previous duties to those of the job I wad interviewing for.  Recruiter was very pleasant.  We set up a day and time for me to come in and interview with one of the other supervisors and the manager who were both friendly. Department tour showed a bunch of hard working people with poor attitudes. Management viewed employees as well beneath them and communication showed.", "Interview Questions": "Do you have a problem asking for co pays and deductibles up front?"}, {"date": "30 Sept 2017", "title": "Phlebotomist Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through a staffing agency. I interviewed at Penn Medicine (Philadelphia, PA) in Oct 2013", "Interview Descriptions": "The whole process was a rocky situation didn't know if you actually had the position or not it was a hit or miss they where not team players and gave off awful signals", "Interview Questions": "What do expect from our company."}, {"date": "15 Sept 2013", "title": "Clinical Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Penn Medicine (Philadelphia, PA)", "Interview Descriptions": "Hiring and Interview process was seemless. Met with HR coordinator and then with principal investigator. Questions were very simple and based on past experience.", "Interview Questions": "Describe your greatest weakness"}, {"date": "3 Aug 2016", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Penn Medicine in May 2013", "Interview Descriptions": "I had already been working in the department for 3 years and knew a lot of people that would help make this job transition easier. The job opened up, I applied , and was chosen for an interview. I met with the Program Director and the Practice Coordinator for about an hour. I already knew them so some general interview questions were never even discussed.", "Interview Questions": "Where do you see yourself in 5 years"}, {"date": "13 Jul 2015", "title": "Nurse Extern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 3 months. I interviewed at Penn Medicine (Philadelphia, PA) in Apr 2013", "Interview Descriptions": "Met with HR first and then nurse manager. HR interviewer was a very general interview. Asked about resume and why I chose the hospital and other generic questions. Nurse manager interview was specific to my major and role I was filling. They definitely want to hear why you are interested in HUP in particular and the specialty you are interviewing for.", "Interview Questions": "Strengths and weaknesses"}, {"date": "19 Oct 2017", "title": "Resource Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Penn Medicine (Philadelphia, PA) in Apr 2013", "Interview Descriptions": "I met  with everyone in the lab, about 25 people total. The meeting took about 3 hours, meeting with small groups or individuals at a time. Went on a lab tour to observe the facility and the process.", "Interview Questions": "Why do you want to work here?"}, {"date": "24 Jan 2013", "title": "Biomedical Postdoctoral Fellow Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Penn Medicine", "Interview Descriptions": "Phone interview followed by on site interview", "Interview Questions": "Do you want to stay in academia or industry?"}, {"date": "30 Oct 2016", "title": "Communications Coordinator Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Penn Medicine (Philadelphia, PA) in Aug 2012", "Interview Descriptions": "The process was very slow and lengthy. Weeks after submitting an online application, a recruiter called me to schedule a phone screen. I was contacted within a reasonable amount of time after this to let me know someone would be reaching out to schedule a 1:1 interview, but this took quite a bit longer. Then, once I did have the 1:1, the follow up was extremely slow, and I eventually found another job.", "Interview Questions": "The screening process was focused on personality type."}], [{"date": "24 Sept 2014", "title": "Marketing Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Penn Medicine in Apr 2012", "Interview Descriptions": "I had 11, yes 11 interviews, for a mid-level position. I kept being told my chances were good and interviews 5-11 were just formalities...they weren't, I never got the job. It was my fault for not keeping all of my options open, but I had turned down other opportunities during this process for the chance to work at Penn. It took me another year and a half to get my current (fantastic) job, so it wasn't a total waste, but I wish they would streamline their process for the future.", "Interview Questions": "One of my last interviewers came out to get me, declared she was having a bad day and wanted to get our interview over with. She was distracted during the whole process and asked me questions about the organization only internal people (in other departments HR and Finance) would know. When I tripped up on them she would get annoyed. "}, {"date": "17 Mar 2016", "title": "Executive Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Penn Medicine (Phila, PA) in Mar 2012", "Interview Descriptions": "Pretty straight forward process.  One interview with staff member, moved onto final interview with Executive.  Was told the following day that I had the job.  One on one.  I didn't feel pressure, everyone was every nice.  Very formal offer letter with benefits stated. I can only say positive things for the entire interview.", "Interview Questions": "Where do you see yourself in 2 years?"}, {"date": "21 Apr 2014", "title": "Patient Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at Penn Medicine (Philadelphia, PA) in Feb 2012", "Interview Descriptions": "Overall my hiring and interview process was amazing. My interviewer ended up being my manager and she was by far the best manager I ever had. Sometimes I actually wish I still worked for her. She was so welcoming during the interview process and was very informative on what the job was going to be like once I was hired.", "Interview Questions": "She asked me what I would change about myself when it came to working."}, {"date": "1 Dec 2015", "title": "PSR II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Penn Medicine (Philadelphia, PA) in Dec 2011", "Interview Descriptions": "Phone interview with HR rep and one face to face with Practice Manager. Interview consisted of mostly behavioral questions and the entire process lasted about a month with large gaps in communication in between from Practice Manager.", "Interview Questions": "All behavioral questions"}, {"date": "20 Nov 2012", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Penn Medicine (Philadelphia, PA) in Sept 2011", "Interview Descriptions": "Excellent background checks by outside vendor,\r\nlong interview period\r\nvery competitive to get hired", "Interview Questions": "what don't you like about nursing."}, {"date": "27 Jul 2011", "title": "Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at Penn Medicine (Philadelphia, PA) in Feb 2011", "Interview Descriptions": "I was to three interviews (does not include the phone screen).  All of the people I interacted with were very professional, pleasant and helpful.  Not sure of the culture, as I think you need to be in the workplace for more than just an interview.", "Interview Questions": "How would I manage, not knowing the system from a technical perspective."}, {"date": "18 Nov 2015", "title": "Biomedical Postdoctoral Fellow Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 1 day. I interviewed at Penn Medicine (Philadelphia, PA) in Jan 2011", "Interview Descriptions": "Was invited up to give a presentation.  Met with lab staff and taken out to dinner.  Hiring manager got back to me within a week to let me know I had the position.", "Interview Questions": "What types of projects are you interested in working on?"}, {"date": "2 Jun 2014", "title": "Pathology Resident Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Penn Medicine (Philadelphia, PA) in Nov 2010", "Interview Descriptions": "Pleasant experience interviewing with the pathology attending physicians. A good tour of the hospital was given and the experience was very personal. A good lunch was served and the pathology residents all seemed to be very happy.", "Interview Questions": "How would I get along with people who were much younger than I was."}, {"date": "10 May 2014", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. I interviewed at Penn Medicine (Philadelphia, PA) in Sept 2010", "Interview Descriptions": "Innitial communications were done by phone and the conversation was brief lasting around 20-30 minutes.  In the interview basic fit, background, and neurology questions were asked.  In the second round interview an in person meeting was required where both the PI and director were present.  At the second interview, staining, sectioning, and the evaluation of slides from the prevalence/severity of  neurodegenerative diseases were highlighted.  Following the second interview a position was offered.", "Interview Questions": "To assign a rating of disease progression in a post-mortem stained slide for the severity of Alzheimer's "}, {"date": "5 Jan 2012", "title": "Security Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1+ week. I interviewed at Penn Medicine (Philadelphia, PA) in Jul 2010", "Interview Descriptions": "Originally interviewed with the Corporal on the shift then the Sergent and Director of the Security Department.  Had to take a psych personality test as well as demonstrate hand gun proficiency at the range to obtain ACT 235 certification.", "Interview Questions": "Are you comfortable being constantly outnumbered?"}], [{"date": "15 May 2012", "title": "Systems Administrator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at Penn Medicine (Philadelphia, PA) in May 2010", "Interview Descriptions": "Extensive for me after so many years working within the institution. My counter part had no such obligation and was given the job without going through the interviewing process.", "Interview Questions": "Explain why I obtained my master's degree in Health Education and not Business Administration?"}, {"date": "25 Jun 2010", "title": "Practice Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Penn Medicine (Philadelphia, PA) in Dec 2009", "Interview Descriptions": "I went through two interviews with the Business Administrator, one with the Medical Director, and one with the Driector of Operations for the the Department.", "Interview Questions": "Where do you see yourself in five years?"}, {"date": "20 Nov 2009", "title": "Administrative Support Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 3 days. I interviewed at Penn Medicine in Nov 2009", "Interview Descriptions": "My resume was submitted to a department from an application pool where I submitted my resume.  I was called from a department a couple weeks later and called in for an interview.  I interviewed with two people.  I was called back again for a second interview with two other people.  The interviews went really well, but they needed to hire someone quickly and found someone already working within the organization.", "Interview Questions": "What do you think is one of your weaknesses?"}, {"date": "13 Nov 2009", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Penn Medicine (Philadelphia, PA) in Oct 2009", "Interview Descriptions": "I applied online and then met with the research coordinator for a 1:1 interview. We talked about my research experience and time commitment/ salary expectations for the position.", "Interview Questions": "What research experience do you have?"}, {"date": "10 May 2010", "title": "Financial-Operations Analyst Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Penn Medicine (Philadelphia, PA) in Oct 2008", "Interview Descriptions": "Other than the obvious tip of selling your skills and experience, I found it beneficial to simply be yourself. Since you will be working with your colleagues for the majority of your waking day, it is important to have some type of rapport with them. Make sure the work environment is something that motivates you.", "Interview Questions": "questions regarding an earlier experience...be ready to provide some details to those \"old\" jobs."}, {"date": "3 Jun 2012", "title": "Financial Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 1 week. I interviewed at Penn Medicine (Philadelphia, PA) in Jan 2008", "Interview Descriptions": "I interviewed with the supervisor and manager of the department as well a manager from another department.", "Interview Questions": "Name a time where you a had a problem to deal with and no one from management to assist you?  How did you handle it?"}]]