[[{"date": "26 Feb 2023", "title": "Professor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Florida SouthWestern State College in Feb 2023", "Interview Descriptions": "The interview was conducted over Zoom, didn't last overly long, and was very easy. The five committee members were nice and full of information about the position. They made the campus sound appealing.", "Interview Questions": "Which class you've taught is your favorite and why?"}, {"date": "17 Oct 2022", "title": "Peer Mentor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Florida SouthWestern State College", "Interview Descriptions": "Group interview that has situational questions. Nothing to daunting or crazy. They also go over what is expected of you within the role as well. I would say if you can't get through the interview this might not be the job for you since it is very easy.", "Interview Questions": "Q: If a student reaches out to you pertaining their academic performance within their cornerstone course and how it is not going well. How would you respond to this student? What resources would you refer them to?"}, {"date": "19 Oct 2022", "title": "Student Success Advisor II Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Florida SouthWestern State College (Home, KS) in Jul 2022", "Interview Descriptions": "The phone interview was great, and I would do it again. Be sure to be ready to visit campus for a second interview. Grateful for opportunity . I would recommend.", "Interview Questions": "N/A"}, {"date": "28 Apr 2022", "title": "Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 months. I interviewed at Florida SouthWestern State College (Fort Myers, FL) in Apr 2022", "Interview Descriptions": "Expect a 1.5 hour interview, standard questions with a 20 min teaching demo that they provide the topic for.  Teaching Philosophy, student engagement, teaching style, etc.  Pretty typical interview, nothing out of the ordinary.", "Interview Questions": "What is your teaching philosophy ?"}, {"date": "30 May 2019", "title": "Library Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 days. I interviewed at Florida SouthWestern State College (Fort Myers, FL) in Jun 2018", "Interview Descriptions": "We decided to have a couple interviews but they were all very good logical questions. They also asked about future work and experience! These people might be most fun and loving mentors that I’ve ever had the experience to work for!", "Interview Questions": "Where did you work before this ?"}, {"date": "10 Oct 2022", "title": "Student Peer Mentor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Florida SouthWestern State College (Naples, FL) in Apr 2018", "Interview Descriptions": "The interview process is very informative. The interviewer wants to know about you, your skills, your educational background, your experience. etc. Just be yourself and be confident during the interview. Good luck!", "Interview Questions": "What are your strengths and weaknesses?"}, {"date": "17 Nov 2016", "title": "Professor of Biological Sciences Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Florida SouthWestern State College (Fort Myers, FL) in Jul 2016", "Interview Descriptions": "I had an online skype type of interview and than an in person interview at the college. The skype interview was panel type with a series of scripted questions and a feeling out process. The in person interview was also with a panel and more scripted questions and a teaching demonstration.", "Interview Questions": "Teaching style, examples of dealing with different types of students, goals for the future. "}, {"date": "11 Aug 2015", "title": "Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Florida SouthWestern State College (Fort Myers, FL)", "Interview Descriptions": "The interview was very well organized, but stressful as such interviews always are. The team was very positive and reassuring and this helped a lot. One also has to go through a phone screen, and then a Skype interview as well.", "Interview Questions": "One gets standard interview questions appropriate for an academic position. No ugly surprises, very fair."}, {"date": "10 Dec 2013", "title": "Coordinator, Resident Engagement (Resident Life Position) Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Florida SouthWestern State College (Fort Myers, FL) in Nov 2013", "Interview Descriptions": "The online application was the biggest hurdle because the posting and closing date were less than 10 days and the online application required all college transcripts to be attached.  If you did not already have copies of your college transcripts, you probably would not have been able to get the application in by the deadline.   I had my transcripts, letters of recommendation and completed the application and was notified by the HR dept. that my application was forwarded to the search committee about 1 week after the job closing date.  I was contacted by the search committee and an interview was scheduled within a week.  The interview was a 5 person panel interview and I was told there were 6 applicants and we were all getting interviewed on the same day (school is closing for holiday break shortly so the timeline has become accelerated). This college has 6 locations with one centralized HR dept.", "Interview Questions": "5 people who all have the same question sheet and go around the room reading questions from the sheet.  Was asked how I handled ambiguous situations and conflict among dorm residents.  Interview lasted about an hour and 15 minutes.  The group had a great chemistry between them and because of that the interview did not feel like the pressure cooker it could have been."}], [{"date": "18 Jan 2017", "title": "Clerical Assistant Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Florida SouthWestern State College (Fort Myers, FL) in Jan 2013", "Interview Descriptions": "5 people around a table asking questions for over an hour. Many of the questions were difficult to respond to. They wanted to know why I wanted the job and why I was not currently working. They wanted to know very personal details about me as a person. It was not an interview based on my skills or professional history. It was much closer to being interviewed for an aid position where I would have been working closely with the elderly or very young. I felt very invaded.", "Interview Questions": "Why do you want to work here?"}, {"date": "17 Oct 2015", "title": "Instructional Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Florida SouthWestern State College (Naples, FL) in Jul 2012", "Interview Descriptions": "You first submit your application online and wait to be schedule a time for interview, once you get called, a board of 3-4 people will interview you. The Academic Success Center Director, a current Instructional Assistant, and math professors. Sometime before or after the interview, they introduce you around to current staff and give you a tour of the center for you to familiarize yourself. The whole process takes somewhere between 20 - 30 days, mostly because you need to wait until the next payroll period starts.", "Interview Questions": "They make up scenarios regarding the center and the students that attend it"}, {"date": "11 Jun 2015", "title": "Professor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Florida SouthWestern State College (Punta Gorda, FL) in Feb 2012", "Interview Descriptions": "The interview process is very disorganized. It is difficult to understand who is interviewing you and why. There are people from different departments that sit in on the demonstration and if you don't know someone on campus, it may be impossible to get interviewed. They say they follow a procedure but they breach it.", "Interview Questions": "Demonstration is required for the interview. Make sure you connect with someone on the campus you want to teach. If they don't know you or if they do not like you , don't bother."}]]