[[{"date": "13 Jul 2021", "title": "Billing Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Woods Services in Jun 2021", "Interview Descriptions": "First I had a phone interview with HR. The second interview was through zoom and the third interview was onsite. There were two people to interview me. The interview went through almost 30 minutes. The interviewers were friendly.", "Interview Questions": "When can I join the "}, {"date": "27 Apr 2021", "title": "Care Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Woods Services", "Interview Descriptions": "Very personable and comfortable.  Interviewing was very professional yet make me feel like I could openly speak about my concerns.  She appears excited about working at Woods which put me at ease about my uncertainty about changing positions.", "Interview Questions": "How do you handle stress?"}, {"date": "26 Jun 2022", "title": "Direct Support Professional (DSP) Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Woods Services (Langhorne, PA) in Aug 2020", "Interview Descriptions": "It is laid back. They want to know that you have experience working with people that have special needs and/or behavioral disorders.  Because of COVID some people were interviewed via phone.  Before meeting with management, you are asked to write answers to some questions regarding why you want the job, what experience you have, etc.  This is partly.to ensure you will be able to document incidents effectively in English, although your writing skills do not have to be perfect at all.  During the interview they show you a residence or school where you may be hired.  Management is friendly and welcoming.", "Interview Questions": "What brings you to Woods?"}, {"date": "23 Jan 2020", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Woods Services (Langhorne, PA) in Nov 2019", "Interview Descriptions": "Quick  and painless. The interviewer was very sweet. Nothing too interesting happened except for the interview starting 45 minutes behind schedule. We were finished quite quickly and explained the severity of how much they were in need of my position.", "Interview Questions": "Why I was interested in this position? "}, {"date": "7 Jun 2019", "title": "Residential Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Woods Services", "Interview Descriptions": "The process was fairly standard.  I applied and was contacted via phone to come to an interview about 3 days later. The interviewer was the supervisor at the time and he was pretty laid back and was straight forward about what the position entails.", "Interview Questions": "How do you handle someone who is difficult?"}, {"date": "3 Apr 2018", "title": "Case Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Woods Services (Langhorne, PA) in Nov 2017", "Interview Descriptions": "Very professional interview process. Background checks, finger prints, child abuse, drug tests, writing samples, etc. HR department are very kind and can answer any questions. You have to fill out a lot of paperwork, but all for protection and to see your background history.", "Interview Questions": "How would I handle certain situations on the job? "}, {"date": "1 Nov 2016", "title": "Staff Counselor Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Woods Services (New York, NY)", "Interview Descriptions": "Strange process. Started at HR. Filled out paperwork/waited around for 45 minutes. Was sent to a building on the other side of campus. On arrival, was told I was in the wrong place (I followed HR's directions exactly, and went to the building that they wrote down on a map for me). I was sent to a different building where the staff was unprepared for an interview. They asked a few questions off the cuff and gave me a tour.", "Interview Questions": "What are your strengths and weaknesses?"}, {"date": "17 Aug 2016", "title": "RN Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Woods Services (Langhorne, PA)", "Interview Descriptions": "Phone screening with recruiter. Stopped at HR to submit a writing sample and for them to copy my license/diploma, then interviewed with manager. High expectations for the RN; covering 3-4 units, and supervising medication techs who actually give the meds (requirement is 12 college credits and a training course). Beautiful campus, nice people, not nearly enough compensation for the responsibility expected! I withdrew myself from consideration after the interview.", "Interview Questions": "Are you comfortable taking care of clients with extensive medical needs such as tube feedings and frequent seizures?"}, {"date": "13 Jun 2016", "title": "Program Supervisor Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Woods Services (Langhorne, PA) in May 2016", "Interview Descriptions": "I filled out an application one night and got the call for an interview the very next day! She was very eager to have me come in and speak with me. The interview lasted almost 2 hours. She was very intrigued that I had come from a facility that had structure and she wanted that here. She brought in a clinical to speak with me as well. They were very sweet people.", "Interview Questions": "What will you do differently from the other supervisor we had to let go?"}, {"date": "8 Mar 2016", "title": "Residential Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Woods Services (Langhorne, PA) in Feb 2015", "Interview Descriptions": "It started off with a phone interview.  A few weeks later I was called in for an interview at HR.  There, we went over who I was, why I chose this field, and what unit would be best for me.  Then I took a drug test, a test of physical ability (e.g. kneeling, lifting 50lbs, etc.).  After that I was sent to my selected unit for an interview with the building manager.", "Interview Questions": "Why did you choose this line of work?"}], [{"date": "21 May 2017", "title": "Residential Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Woods Services in May 2014", "Interview Descriptions": "The interview was with two house managers. They asked me normal interview questions and were very pleasant. I was very comfortable in the room. They were very laid back and did not apply a lot of pressure on me. I felt that the vibe in the room was very good. \r\n\r\n  They also asked me about my experience and background.  Although I never worked in a residential setting before, they were very open to me.", "Interview Questions": "what are your strenghts?"}, {"date": "16 Feb 2015", "title": "Staff Counselor III Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Woods Services (Langhorne, PA) in Nov 2011", "Interview Descriptions": "At the point of application, it was best to hand deliver the resume and application to HR.  That day I was given a preliminary interview before the one for the actual job.  Within a week I was given the full interview for the job, and I received a call back a week from the interview date.", "Interview Questions": "Tell me about your previous experience working with children."}, {"date": "10 May 2013", "title": "Residential Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Woods Services (Langhorne, PA) in Jul 2009", "Interview Descriptions": "Show up, fill out application (be able to write in English), they'll then call you to attend an interview during which I wasn't asked any questions just told where I was going to work and what to kinda expect.  2 week orientation (don't fall asleep). Don't have any major criminal background, complete childline check. Get some drug and disease tests. Start OJT by shadowing for a week. Done.", "Interview Questions": "Uh there were no questions at my interview, i just got told what I was going to do. "}]]