[[{"date": "31 May 2023", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at AdventHealth Corporate", "Interview Descriptions": "The initial interview was set up on the phone, and I was asked to come to a job fair for an interview. I interview with the manager of a unit and then I am told there are no open positions. The recruiter then takes me to another manager who hires me on the spot or so I thought. After several weeks of chasing them down to get more information about the position I finally get a recruiter who says I wasn't experienced enough for a position that is for new nurses. Completely unprofessional and unorganized.", "Interview Questions": "Why did I want to work for them?"}, {"date": "30 May 2023", "title": "Emergency Medical Technician (EMT) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at AdventHealth Corporate (Wesley Chapel, FL) in May 2023", "Interview Descriptions": "The interview process was excellent. I enjoyed the atmosphere that was created by the employees at the EMS headquarters office building. It was both calm, yet it was a challenging interview process. In the end, it was very rewarding, and I am looking forward to the longevity of a career with AH Wesley Chapel EMS.", "Interview Questions": "The first part of the interview was basic introductions and meeting the staff. It progressed into a NREMT scenario, and then character-based questions."}, {"date": "27 Apr 2023", "title": "Management Resident Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at AdventHealth Corporate (Orlando, FL)", "Interview Descriptions": "Lengthy process with 6+ interviews ranging from peers to senior leaders. Interviews are 30 minutes to an hour in length and could in person or virtual. The process starts with a video recorded interview and then if you progress to the next round you meet with different leaders.", "Interview Questions": "What is your why for working in healthcare?"}, {"date": "2 Apr 2023", "title": "Patient Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at AdventHealth Corporate", "Interview Descriptions": "Panel interview. It was fair and personable. They asked about how you work in a team and some behavioral questions. Each person took a turn asking about 2-3 questions. You can ask them questions in the end.", "Interview Questions": "What would you do if a team member was not at their best capacity and ave off a sullen mood?"}, {"date": "21 Feb 2023", "title": "Respiratory Therapist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at AdventHealth Corporate", "Interview Descriptions": "I applied and was contacted by the respiratory therapy recruiter. She was helpful with information that day but lacked follow up and follow through afterwards. If AdventHealth locations have a challenge with hiring RTs, you may consider part of the problem is the recruiter. There are many opportunities for RTs. A recruiter who is actively pursuing and responsive to an interviewee will be a place we want to work at.", "Interview Questions": "What type of position are you looking for, PRN, FT or PT?"}, {"date": "30 Jan 2023", "title": "Privacy Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at AdventHealth Corporate", "Interview Descriptions": "My interview process went very well. Very smooth. Organized and friendly leaders. My interview was done virtually and very convenient. A recruiter called me to schedule my interview with the manager of the department. That was followed by the executive of the department.", "Interview Questions": "Tell me about yourself Tell me about your experiences Where do you see yourself in 3 years"}, {"date": "18 Nov 2022", "title": "Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at AdventHealth Corporate", "Interview Descriptions": "The initial process was great! I got a response within a couple days of applying and had the initial interview scheduled. I was moved along in the process and had my 2nd interview set up for the following week. I got an email telling me that they made someone an offer and cancelled all interviews.", "Interview Questions": "Standard questions about my experience pertaining to the role."}, {"date": "13 Nov 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at AdventHealth Corporate", "Interview Descriptions": "recruiter reaches out to you once you passed the resume screening. They schedule the interview with the managers of the unit to which you applied. Then you shadow the unit and decide whether or not to accept if they send you an offer a few days later", "Interview Questions": "What do you think about constructive feedback?"}, {"date": "30 Oct 2022", "title": "Cardiac Sonographer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at AdventHealth Corporate", "Interview Descriptions": "Simple and to the point. We stayed in contact and they kept me informed. It was all online except the in person drug test. It was fast and I give 10/10", "Interview Questions": "Do you work well in stressful situations"}, {"date": "27 Oct 2022", "title": "Account Representative Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at AdventHealth Corporate (Orlando, FL) in Oct 2022", "Interview Descriptions": "The interview process took months and they ghosted me on several occasions. I had to email the same guy at least three times before I ever got an interview. Finally received an interview. Ghosted again for a few weeks and finally a 'no'. Thank you for wasting my time, do yourself a favor and just avoid this company. They say they will hire you with little to no experience but that is a lie.", "Interview Questions": "What makes you stand out against the other interviewers? How do you deal with stress? Name your best two qualities and name your two worse."}], [{"date": "2 Nov 2022", "title": "Telemtry Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at AdventHealth Corporate (Dade City, FL) in Oct 2022", "Interview Descriptions": "I received a call from the talent aquisition team to do a phone interview at first. Then, I was scheduled to meet with my manager to do an in person interview. During this second interview, my manager showed me where I will be working and gave me a packet to study from before my start date. Overall, it was very organized and nice. The manager is really kind and I look forward to starting.", "Interview Questions": "I don’t remember the question they asked me."}, {"date": "19 May 2023", "title": "Physician Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at AdventHealth Corporate in Oct 2022", "Interview Descriptions": "Straightforward, however there were multiple middle managers and admin, very little physician involvement in interview which is not the standard process I have had elsewhere. One of my first interviews the recruiter was 20 minutes late. Seems to be a very corporate and admin heavy company. Did not seem to care much about quality, growth, leadership of physicians, you will only be a follower and not have decision making capabililty here. Was not very impressed with recruiting and on site scheduling, very poor recruiting communication, last minute slip ups and inconsistency. Recruiters from different areas in the company email even when already in the interview process. This is not a good look as a first impression. Little to no physician involvement in recruiting decisions. Low market rate and noncompetive compensation. Managment at interview were off putting and did not seem to understand the needs of a physician. Did not really sell the position well. I would not have taken the position if offered although I am relocating to a nearby area with a competitor who provided an excellent experience. I think they will have alot of difficulty recruiting when there is ample competition in this market.", "Interview Questions": "What do you like to do for fun?"}, {"date": "13 Sept 2022", "title": "RBT - Registered Behavior Technician Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at AdventHealth Corporate", "Interview Descriptions": "The process was good, but found it difficult to talk to multiple people at once during the interview. Promissory comments were also made, which made the interview feel like a done deal.", "Interview Questions": "How do you deal with conflict?"}, {"date": "29 Aug 2022", "title": "Scrub Tech Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at AdventHealth Corporate", "Interview Descriptions": "aprox 2017 - had to make recorded videos to questions regarding my personal faith..not all of us have a personal faith and mildly inapropes for an employer to ask .. this was before i even met wiht a human about the job function itself", "Interview Questions": "N/A"}, {"date": "25 Aug 2022", "title": "Medical Imaging Scientist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at AdventHealth Corporate", "Interview Descriptions": "It was a bit hectic and complicated but in the end we were able to make it all work. The biggest issue  was coordinating with so many people. I would make sure you communicate your schedule in interview as well", "Interview Questions": "What kind of pay were you expecting"}, {"date": "16 Aug 2022", "title": "Accountant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at AdventHealth Corporate", "Interview Descriptions": "One interview with HR. 3 total interviews.  One with a big boss. One with two peers. The last interview is with a manager. Everyone was nice. They care a lot about religion.", "Interview Questions": "Are you a religious person?"}, {"date": "31 Jul 2022", "title": "Licensed Practical Nurse Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at AdventHealth Corporate", "Interview Descriptions": "The process was Painless, the interviewer was  friendly, the interview was conducted in a very professional manner. I would have taken the offer if I was an actual nurse. Just filling this out to read reviews", "Interview Questions": "See yourself in 10 years"}, {"date": "8 Dec 2022", "title": "Human Resources Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at AdventHealth Corporate (Orlando, FL) in Jul 2022", "Interview Descriptions": "Unprofessional virtual interview muted while interviewer interrupted interview to talk to a family member in her home. Waited in awkward silence. Did not wish to work for them after this.", "Interview Questions": "Have you had experience in ADA?"}, {"date": "31 May 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at AdventHealth Corporate", "Interview Descriptions": "Smooth process. Very efficient. I am excited to be a part of the team during this time. The palm coast facility is expanding which also means new opportunities for the area and great opportunities to grow as a nurse", "Interview Questions": "What is your work Experience "}, {"date": "25 Jul 2022", "title": "Business Intelligence Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at AdventHealth Corporate (Altamonte Springs, FL) in Jun 2022", "Interview Descriptions": "1. Phone Interview with HR\n2. Team Interview with the Sr manager and manager of the team.\nThe entire interview process moved very smooth. The HR specialist is very responsible and replied to me very quickly. The managers are very professional. They are super warm, always smile during the interview and make me feel like they are respectful to the candidates. I have received another offer, but I decided to accept AdventhHealth's offer.", "Interview Questions": "HR Screen: How do you know about AdventHealth.\nManager Screen: Various questions, including job specific knowledge and interpersonal skills"}], [{"date": "25 May 2022", "title": "Licensed Practical Nurse (LPN) Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at AdventHealth Corporate (Lenexa, KS) in May 2022", "Interview Descriptions": "I was contacted for a phone interview which was scheduled to be 20-30 minutes. It was 2 minutes long. The only questions that were asked of me was where I saw the job opening and my expected pay range. When I discussed my pay, I stated my current offers and that I would like to get as close to that as possible. I asked what the pay scale was for the position I was applying for and he answered with the range. The HR immediately told me that he would not be able to get me close and ended the phone call stating “good luck.” I was open to discussing the benefits and offered pay but he didn’t allow the conversation to continue. I felt it was very unprofessional. I am very qualified for the position and was really looking forward to the opportunity to discuss the job opening. I say this not to necessarily complain, but to inform the company of how poorly I was treated and that I was let down on being immediately turned away when I was 100% open to lesser pay and just wanted to know more about what they offered.", "Interview Questions": "Where I found the opening and salary expectancy "}, {"date": "4 Mar 2022", "title": "Director Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at AdventHealth Corporate (Orlando, FL)", "Interview Descriptions": "Very professional, highly engaging and thoughtful.  \r\n\r\nI met with 7 people with different disciplines, from 1:1 leadership meetings, and two group interviews.  All conducted with a high degree of respect, good questions, and it included two personality assessments.", "Interview Questions": "I decided to take myself out of the running late in the negotiation process due to another opportunity.  I sent them a thank you note!"}, {"date": "16 Feb 2022", "title": "Registered Nurse Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at AdventHealth Corporate", "Interview Descriptions": "They have a great interview process.  They are friendly and caring. Organized and timely.  Respectful of time for the interview. Microsoft teams used. Great interactions with interview panel. Did not feel rushed, they took the time to get to know me.", "Interview Questions": "What can you bring to our company?"}, {"date": "13 Jan 2022", "title": "Cultural Representative Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at AdventHealth Corporate", "Interview Descriptions": "It seemed disorganized and last minute for the process. Received several calls around the holidays for interviews having been out of town and told them I would talk in the new year.", "Interview Questions": "How do you feel about doing the same work every two weeks? "}, {"date": "11 Jan 2022", "title": "Financial Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at AdventHealth Corporate", "Interview Descriptions": "The whole process was fairly quick and took about two weeks. I was asked about my previous experience, why I wanted the role, and a couple of situational questions. Would say it was a standard interview.", "Interview Questions": "Have you ever had conflict with your boss, and how did you handle it. \r\n\r\nDescribe a time where you were given a task outside of your primary duties\r\n"}, {"date": "11 Jan 2022", "title": "Graduate Nurse Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at AdventHealth Corporate", "Interview Descriptions": "There is a prescreening interview on the phone with a recruiter. Then they set you up with the department you are interested in. I had a phone interview. Everyone was super nice!", "Interview Questions": "How do their values and beliefs align with my own? "}, {"date": "24 Oct 2022", "title": "Account Reconciliation Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at AdventHealth Corporate in Nov 2021", "Interview Descriptions": "Interview with HR and then if all goes well you will interview with the managers of the team. They are both mostly behavioral questions to get to know you. Overall a good experience.", "Interview Questions": "Name a time that you dealt with a bad coworker and how did you resolve it?"}, {"date": "29 Oct 2021", "title": "Assistant Nurse Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at AdventHealth Corporate", "Interview Descriptions": "There was a panel interview with members of the leadership team. It was pretty relaxed. Challenging and fair questions. The interview lasted approx one hour.  All members asked questions and there was follow up.", "Interview Questions": "What is your leadership style?"}, {"date": "4 Oct 2022", "title": "AIT Technician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 months. I interviewed at AdventHealth Corporate (Orlando, FL) in Oct 2021", "Interview Descriptions": "HR screening is awful. Too many applications get passed over. Can't get a live person to talk to. Never get the opportunity to see why you are passed up for positions. HR isn't there to help the employees advance.", "Interview Questions": "Where do you see yourself in 5 years?"}], [{"date": "21 Feb 2023", "title": "Purchasing Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at AdventHealth Corporate in Oct 2021", "Interview Descriptions": "Recruiter called to say they would book an appointment with the hiring manager after the initial phone screen. I did not hear back. I tried emailing and calling , no response .", "Interview Questions": "Why are you applying when you are overqualified?"}, {"date": "2 Oct 2021", "title": "Infection Preventionist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at AdventHealth Corporate (Fort Worth, TX) in Sept 2021", "Interview Descriptions": "The whole interview process was amazing and seamless from the beginning until my confirmation to start email. I am so excited to start my new career that I have been blessed with.", "Interview Questions": "What made me interested in Infection Prevention?"}, {"date": "23 Sept 2021", "title": "Investment Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at AdventHealth Corporate in Aug 2021", "Interview Descriptions": "3 thirty minutes interviews(mix of background, technical and situational questions) and a call with H.R. Onsite meeting with team members. One personality test. Overall, a smooth and fast interview process.", "Interview Questions": "Questions about past experience, technical and behavioral"}, {"date": "25 Jun 2021", "title": "Employee Relations Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at AdventHealth Corporate", "Interview Descriptions": "The interview process was quick and professional.  Everyone was very genuine and passionate about making the process a good experience.   The interview questions were standard and surrounding the job.  A phone screening, an interview with the manager, and then an interview with the executive team.", "Interview Questions": "Tell me about your experience with reasonable accommodations."}, {"date": "16 Jun 2021", "title": "Talent Acquisition Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at AdventHealth Corporate", "Interview Descriptions": "Disorganized. No structure. Called back twice for interviews with different people. No feedback whatsoever post interview despite individual thank you notes and follow ups sent to each interviewer. Never heard anything back, not even a declined note. Pretty bad candidate experience.", "Interview Questions": "Where do you see yourself x amount of years from now? "}, {"date": "18 Jun 2021", "title": "Front Desk Receptionist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at AdventHealth Corporate", "Interview Descriptions": "Easy. I was hired on the spot. They asked the usual interview questions. Why do you want to work for the company? How you would respond to different scenarios with patients.", "Interview Questions": "Why do you want to work for the company? How you would respond to different scenarios with patients."}, {"date": "8 Jun 2021", "title": "Help Desk Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at AdventHealth Corporate", "Interview Descriptions": "It was amazing and really easy. They made it seem simple and sufficient. I did get the job amd accepted the offer. I recommend working for this company if you can", "Interview Questions": "Tell me about yourself today"}, {"date": "3 Jun 2021", "title": "Informatics Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at AdventHealth Corporate", "Interview Descriptions": "Do you have any relate that work for this company if so how long you have know them. So just explain how and when. Also be prepare, read the job description that you're apply for.", "Interview Questions": "What  you can tell me about the position that you're apply for?"}, {"date": "24 Jul 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at AdventHealth Corporate (Wesley Chapel, FL) in Jun 2021", "Interview Descriptions": "The interview was a Zoom meeting with a panel of people asking questions. Basic behavioral and situational questions. The whole process took maybe 15-20 minutes. I was pleased and felt confident with my answers.", "Interview Questions": "How do you handle stress?"}, {"date": "26 May 2021", "title": "Supply Chain Support Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at AdventHealth Corporate", "Interview Descriptions": "The interview process include a phone screening and then a in person interview. Very typical interview questions with great insight on the requirements of the position. They attempt to scare you away from the job so that they know the people they are hiring are serious.", "Interview Questions": "What is you biggest strength "}], [{"date": "12 Apr 2021", "title": "Senior BI Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. I interviewed at AdventHealth Corporate", "Interview Descriptions": "Quick, responsive, and smooth.  Communication was quick when the team was ready to move forward.  \nThe interviewers were welcoming and knowledgeable.  They were engaged in getting to know the interviewee. \n No other feed back  available at this time.", "Interview Questions": "What are your strengths and weaknesses?"}, {"date": "27 Mar 2021", "title": "Business Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at AdventHealth Corporate (Orlando, FL) in Mar 2021", "Interview Descriptions": "Applied through system, got first-round interview meeting with a committee (managers from the department) which lasted 90 minutes.  Interviewers were nice and easy to have conversations, walked through my resume and standard behavioral questions, the second part of the interview was technical", "Interview Questions": "Why adventhealth \nDescribe a project \n\nCreate a bar plot shows the frequency of patients by gender\n"}, {"date": "27 Apr 2021", "title": "Business Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at AdventHealth Corporate in Mar 2021", "Interview Descriptions": "Applied through referral, had a Group Interview with the Clinical Analytics team (which also included an Excel test). After the Interview I was told I would have a meeting with a director, which did not happen for the other two weeks. Then got an email that, the meeting with the director is cancelled and I would meet with the team again. The Interview went well and I was told they will get back to me in a week and I heard from them after 3 weeks with an automatic rejection email.  Extremely disorganized Interview process.", "Interview Questions": "Tell me about a time you improved a process?"}, {"date": "15 May 2021", "title": "Business Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at AdventHealth Corporate in Mar 2021", "Interview Descriptions": "Initial Phone screen with HR\n2nd Round video interview with team of analytics\nIt was average Interview asked questions about past experience and resume also Sql question and lot of situation based question", "Interview Questions": "How many people in USA currently wear a diaper at this moment?\n\nIf your going on the Highway and if the Cop pullover pregnant lady and you are passing next to that what will you do?"}, {"date": "25 Mar 2021", "title": "Reputation Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at AdventHealth Corporate in Mar 2021", "Interview Descriptions": "I put negative, but mostly the experience was just confusing. \n\nI first applied to the job and get a rejection email a couple weeks later. Then, a month later I got an email to fill out a candidate summary. I filled it out and sent it to the recruiter. Based on my answers, I was scheduled for an interview with the hiring manager. During the interview, she didn't ask me any questions about myself or my experience and just gave an in-depth explanation of the job. Then she asked if I had any questions.\n\nThat interview went well and at the end of it, she told me she wanted to schedule a second interview so I could speak with her team. I scheduled the second interview with the recruiter. A week before my second interview, I received an email from the recruiter that they were canceling my interview because they already offered the position to someone else. \n\nThe hiring manager and the recruiter were both nice and friendly, but I am disappointed that they didn't fulfill their commitment to interview me a second time before making their decision. Overall, the process seemed a bit unorganized.", "Interview Questions": "Do you have any questions for us?"}, {"date": "30 Jan 2021", "title": "Marketing Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at AdventHealth Corporate", "Interview Descriptions": "Received a call from a recruiter about 3 days after applying with initial phone screen questions. Hiring manager followed up to schedule 45 minute interview. Questions were basic and interview was fairly simple. Everyone was extremely nice and professional throughout the whole process.", "Interview Questions": "What do you consider your biggest strengths?"}, {"date": "14 Jan 2021", "title": "Financila Analyst Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at AdventHealth Corporate", "Interview Descriptions": "More than 3 managers interviewing. They will go over your resume and ask you questions related to the job you are applying. They will give you some work questions and you may answer your best. If you did wrong they will tell you but that's just a way to get to know you.", "Interview Questions": "Do you have experience working on Health Industry"}, {"date": "5 Apr 2021", "title": "Data Analytics Manager Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at AdventHealth Corporate in Jan 2021", "Interview Descriptions": "There were two phone interviews and a group interview.  A good mix of 'getting to know your work style' and technical skills.   No whiteboard exercises, but a few conceptual questions as filters.", "Interview Questions": "Q: Describe how you'd use a CTE to filter for duplicates"}, {"date": "8 Dec 2021", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at AdventHealth Corporate (Orlando, FL) in Jan 2021", "Interview Descriptions": "Quick and easy. They got down to business and you went completed everything online. You also did your drug screen as well. They made sure you knew exactly what the job would entail before you started.", "Interview Questions": "Where do you see yourself with the company in 5 years"}, {"date": "8 Dec 2020", "title": "Teller Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at AdventHealth Corporate", "Interview Descriptions": "Phone/skype inter with recruiter than video and Skype with manager two managers were in the interview asking questions and yea it was pretty cool they were both nice and professional", "Interview Questions": "Ethical"}], [{"date": "3 Dec 2020", "title": "Security Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at AdventHealth Corporate", "Interview Descriptions": "Applied for a position and received a link to take a 114 question behavioral health interview. Quit 1/4 way through due to the stupidity of some of these questions. Lots of questions that encourage you to lie and clearly discriminate against introverts. I have zero interest in working for a place that relies on these types of assessments.", "Interview Questions": "Are you a loner? Are you quiet?"}, {"date": "4 Jan 2021", "title": "Intake Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at AdventHealth Corporate (Orlando, FL) in Dec 2020", "Interview Descriptions": "Simple and fast. I was asked to do a virtual interview with recorded responses followed by a video conference interview. Both were under 15 minutes in length. I was in communication with an HR representative via email throughout and it was a great experience overall.", "Interview Questions": "Very casual questions for an entry position "}, {"date": "3 Dec 2020", "title": "Legislative Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at AdventHealth Corporate", "Interview Descriptions": "It was extremely difficult to sell myself because there was a bias at play regarding former team members. Without knowing the entire story, the entire interview seemed hostile or very jaded over whatever happened to create the opening.  It created an unfair advantage during the interview.", "Interview Questions": "Strengths, weaknesses, and challenges you have faced, "}, {"date": "21 Oct 2021", "title": "Program Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at AdventHealth Corporate in Dec 2020", "Interview Descriptions": "After meeting with the recruiter I met the hiring manager, then the director, then the team. Quite a few steps and took maybe 3 weeks due to scheduling with all of these different people.", "Interview Questions": "Questions asked about experience in the field"}, {"date": "30 Oct 2020", "title": "Health & Well-being Partner Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at AdventHealth Corporate", "Interview Descriptions": "I was contacted by an HR person for an initial screening a few days after I applied online. She was very nice, but it didn't really feel like she was listening that closely to what was being said.  She asked about each of my work experiences and told me about the job and what the department was looking for.  She asked about my salary requirements and mentioned I was at the top end of what they pay for the role.  I knew I would be weeded out after that information.", "Interview Questions": "Tell me about your experience at .....\nWhy do you want to work at AdventHealth?"}, {"date": "1 Dec 2020", "title": "Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at AdventHealth Corporate (Orlando, FL) in Nov 2020", "Interview Descriptions": "The interview was through TeamViewer. It was well organized and structured. The interview went on time as accordingly and it was simple to connect to TeamViewer. The interview was well organized and structured and the ladies were easy to speak with.", "Interview Questions": "How did you handle difficult situations."}, {"date": "29 Jun 2021", "title": "Senior Nurse Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at AdventHealth Corporate (Wilmington, DE) in Oct 2020", "Interview Descriptions": "Conducted via Teams. I lived in Delaware at the time. Individual, one-on-one the first time, and then a panel interview the second time. Everything was set up via the Talent Acquisition specialists. Professional and proficient.", "Interview Questions": "Why do you think you are the best candidate for the job?"}, {"date": "1 Sept 2020", "title": "Employee Experience Partner Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at AdventHealth Corporate", "Interview Descriptions": "They called to schedule an interview; Interview was conducted virtually through Microsoft Teams; two senior leader interviewers; very polite, easy-going, & professional; emailed the next day to coordinate the in-person second interview with other employees one week from the first interview.", "Interview Questions": "- Tell me about yourself\r\n- Why are you interested in this position?\r\n- How do you stay organized? What about time-management & multitasking skills?\r\n- Where do you see yourself in 5 years?\r\n- How do you think you can follow/embrace our mission and values in this position?\r\n- Strengths & Weaknesses?"}, {"date": "27 Aug 2020", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at AdventHealth Corporate", "Interview Descriptions": "In depth interview. Personal interview with someone high up in the Leadership Institute. Online application that was easy, but complex website. Character evaluation that takes 30min. This will come up in the interview. Drug test.", "Interview Questions": "Why are you interested in health care."}, {"date": "26 Aug 2020", "title": "Financial Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at AdventHealth Corporate (Orlando, FL)", "Interview Descriptions": "I applied online, and then was contacted by email for a phone interview.  Then I scheduled for an in-person interview with several department managers. In all, was probably a 3-week process.", "Interview Questions": "Employment background, personality questions, and a timed test"}], [{"date": "25 Jul 2020", "title": "Materials Technician Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at AdventHealth Corporate (Burleson, TX) in Jul 2020", "Interview Descriptions": "I was contacted and asked to schedule a 10-15  phone interview. I submitted my time slot and did not receive a confirmation. 1st red flag.\r\nTwo days later Sr talent acquisition partner calls me 24hrs in advance and I missed the call. 2nd red flag\r\nI called the number back after hours when i noticed i missed her call and explained that she called  a day too soon and hoped she would call again the next day per our email conversation. Not only did i not get a courtesy email but i didn't get called at the appointed time. 3rd red flag.\r\n Yet I reached out one last time via email replying from the original scheduled appointment in hopes of clearing up any confusion. Crickets.....\r\nHope this helps someone.", "Interview Questions": "The Sr talent acquisition partner  messed up my interview before it took place. "}, {"date": "15 Jul 2020", "title": "Medical Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at AdventHealth Corporate (Lampasas, TX) in Jul 2020", "Interview Descriptions": "I applied online and got a call about one week later to come in for an interview the very next day. I was not told very much information other than come in with business casual or scrubs and a random \"what is the normal BP range\"  that kind of threw me off guard. I came in sat down and the manager only asked me one question, yes only ONE. She asked me \"why do you want to work here? I answered and she smiled then went to grab a senior medical assistant. At this time I was told I was to be shadowing her, I had no idea coming in that I would be shadowing at all! Honestly I was dressed in business casual with uncomfortable shoes, if I would of know I would of came in my scrubs. I shadowed for about an hour, I was shown around and went through around 3 patients. I was asked to preform manual BP, then the medical assistant sat me down and asked me to wait. She went back to talk to the manager, or I assume it was the manager... She came back after 10 minuets told me we were done and that I would hear back by the end of the week. She asked me if I had any questions but at this point the whole experience was just so confusing that I just decided to go home. I felt completely thrown off guard and kind of like my time was wasted since I did not get a formal interview. The manager did not even talk to me at the end and I felt like they didn't even get to know me.  Overall I just wish I had a fair chance and more notice as to what was going to happen.", "Interview Questions": "Why do you want to work here?"}, {"date": "7 May 2020", "title": "Paramedic Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at AdventHealth Corporate (Brandon, FL)", "Interview Descriptions": "Was called regarding position I applied for and never heard another word. I see that the position is still open. I have been in emergency medicine my whole adult life and bring a lot to the table. They should show the courtesy of letting you know why you were not selected. I have applied over and over. Just sad.", "Interview Questions": "Was never given the courtesy of being asked one."}, {"date": "4 May 2020", "title": "Decision Support Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2+ months. I interviewed at AdventHealth Corporate (Orlando, FL)", "Interview Descriptions": "First was a phone interview with Hr, then in-person with the hiring manager. After 2 weeks, there was another interview with the hiring manager’s boss and everyone in the department.", "Interview Questions": "Go over your resume. Describe your strengths and weaknesses. Describe a time you made a mistake. Why you would be the best hire? And Excel test."}, {"date": "6 Sept 2020", "title": "Pharmacist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at AdventHealth Corporate in Apr 2020", "Interview Descriptions": "very easy going interview. 3 interview process. 1st is with HR. 2nd is with hiring manager but kind of get to know you type. 3rd is peer interview. Interviewed with 4 other people.", "Interview Questions": "Describe yourself and what you do."}, {"date": "4 Mar 2020", "title": "Human Resources Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "The process took 3 months. I interviewed at AdventHealth Corporate (Orlando, FL)", "Interview Descriptions": "I had a lovely phone interview and moved onto the in-person and then never heard from them again. I met with several individuals and I found it was difficult for me to navigate the interview. They seemed unorganized in their process and didn’t ask the usual STAR or behavior based questions. People came and went- others knocking on the door, their emails and IM’s getting their attention. I met with the director of the Dept and he was pleasant to speak with. That was honestly the only 5 minutes I felt like anybody was really interested in knowing anything about me and my experience. I was bummed leaving the interview because it was obvious I didn’t get the job. However I stayed hopeful that they would be professional enough to at least send me an email. Nope- nothing. Not even a response to my follow-ups. Finally, 3 months after my interview I received an email that said the job was closed, even though I continue to see it being reposted. So disappointing.", "Interview Questions": "General questions like tell me about yourself...."}, {"date": "5 Mar 2020", "title": "Human Resources Documenting Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at AdventHealth Corporate (Orlando, FL)", "Interview Descriptions": "Very simple had one phone screen and the a one on one interview, the Recruiter was nice at first but then never got back to me to tel me yes or no. Months went by and I followed up and called never heard anything.", "Interview Questions": "Why do you want to work at AdventHealth?"}, {"date": "6 Jul 2021", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 9 months. I interviewed at AdventHealth Corporate (Niles, MI) in Mar 2020", "Interview Descriptions": "It was great. Everyone was very friendly towards me and they were ever ready to answer any questions I had. There was a lot of communication after the interview. Overall, it was a fantastic interview experience.", "Interview Questions": "Our mission is to extend the healing ministry of Christ. How have you extended the healing ministry of Christ in your experience?"}, {"date": "3 Dec 2020", "title": "UI Designer Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. I interviewed at AdventHealth Corporate (Orlando, FL) in Mar 2020", "Interview Descriptions": "It was a multi step process. First was a phone interview with the head designer, then an in person with the whole team and then another with just the head designer. I did a white boarding session in the in-person interview.", "Interview Questions": "What is your design process?"}, {"date": "13 Feb 2020", "title": "Human Resources Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at AdventHealth Corporate", "Interview Descriptions": "I received an email to complete a behavior based survey after submitting my resume. The next day, I was invited to schedule for a phone interview with a recruiter. I completed my phone interview (which was very pleasant) and was congratulated on moving forward to the next step, an interview with the hiring manager. I confirmed my second phone interview for the next day and never received a call from the hiring manager. I called both the recruiter whom I interviewed and the hiring manager who was to conduct my second interview and neither one returned my call or responded to my email. The next day I called both again, no response. If you decide that you no longer want to move forward with a candidate (even after you tell them you are interested in moving forward) the courteous thing to do is to express your regret via phone or email. This is HR 101. I am surprised at the highly unprofessional and inconsiderate behavior of such a company.", "Interview Questions": "What is your highest completed degree? "}], [{"date": "11 Mar 2020", "title": "IT Service Desk Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. The process took 3 days. I interviewed at AdventHealth Corporate (Orlando, FL) in Feb 2020", "Interview Descriptions": "The interview process for me was great. I went through a staffing agency had the preliminary interview for the position on a Monday with the staffing agency, got an email on Tuesday with the time of my interview with AdventHealth. Interviewed with AdventHealth on Wednesday morning and the interview was cut short because I was hired on the spot. I started training a couple of weeks later and I love the company.", "Interview Questions": "What was your favorite job and why?"}, {"date": "4 Mar 2020", "title": "Customer Experience Coordinator Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at AdventHealth Corporate (Orlando, FL) in Feb 2020", "Interview Descriptions": "interview was quick pay was not the best , hiring process can take months. The insurance did not seem the greatest. The interview was pretty quick It was done within 5minutes after waiting over month for a call.", "Interview Questions": "What you r base pay?"}, {"date": "12 Mar 2020", "title": "Physical Therapist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at AdventHealth Corporate (Tampa, FL) in Feb 2020", "Interview Descriptions": "Very smoothly. Had 4 people interviewing me from the company which was slightly intimidating but the atmosphere was good and the employees were very friendly. The whole staff was very nice and seemed like it would be a great environment to work in.", "Interview Questions": "What is something that would make you want to leave "}, {"date": "24 Nov 2021", "title": "Office Administrator Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at AdventHealth Corporate (Orlando, FL) in Feb 2020", "Interview Descriptions": "Quick, friendly interviewer. Asked appropriately\r\njob questions. The scheduling was difficult but able to resolve. Answered all questions but main ones needed to be in person in stead over phone.", "Interview Questions": "Why are you looking to change?"}, {"date": "29 Jan 2020", "title": "Recruitment Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at AdventHealth Corporate", "Interview Descriptions": "Started with a typical phone screening. Was invited on-site for a interview.  Interview went well and was invited to come back the next day for an hour long shadowing session.  After 3.5 weeks the recruiter returned my call to tell me I wasn't selected. I asked for feedback and all I was given was I wasn't selected due to not having any nurse recruiting experience. No other feedback was given. This was disappointing as it was known up front during my initial phone screening that I had no experience recruiting nurses. I'm not sure why I was invited in for a hour long interview and over a hour long shadowing session if I was never going to be considered. Seemed like a very unorganized process. It should not have taken 3.5 weeks to get such basic and generic feedback.", "Interview Questions": "What makes an elite recruiter? "}, {"date": "21 Feb 2020", "title": "Recruitment Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at AdventHealth Corporate (Orlando, FL) in Jan 2020", "Interview Descriptions": "After the final interview i was told by the Recruiter that I would have an answer by the end of the week. I eventually waited a total of 3 weeks. The day i asked for the update the Recruiter didnt respond to the email. Instead he decided to call and not leave a voicemail. I called back and he did not pick up. 10 minutes later i got a very impersonal email stating i did not receive the job. I never heard from the Recruiter again. Super unprofessional. For a highly respected faith based corporation, this was handled very poorly and cruel. A recruiter should call and leave a voicemail and answer the candidate to discuss the reasons for not being hired instead of dialing, hanging up. and ghosting.", "Interview Questions": "Tell us about yourself"}, {"date": "17 Jan 2020", "title": "Recruiter Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at AdventHealth Corporate (Altamonte Springs, FL) in Nov 2019", "Interview Descriptions": "Phone screen with one of the recruiters, then they bring you onsite to meet with managers of whichever teams are hiring, then it was coming back onsite to shadow. If they don't like you then you'll never hear feedback again. \r\n\r\nThe interview process is standard, it's how disrespectful they are of candidates.", "Interview Questions": "What makes you likable? "}, {"date": "28 Aug 2019", "title": "Practice Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at AdventHealth Corporate (Manchester, KY) in Aug 2019", "Interview Descriptions": "After you apply you do a questionnaire and from that the questions for your interview will be generated.  3 people attended the interview.  The interview lasted about 1 hour.  I was made to feel at ease and comfortable.  When I left I felt like I had the job, especially since the salary was considerably lower than what I am accustomed to.  The company appears to have great culture and values.", "Interview Questions": "How would you handle an issue between 2 employees?"}, {"date": "16 Sept 2019", "title": "Educator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at AdventHealth Corporate in Aug 2019", "Interview Descriptions": "The HR interview was a  laid back conversation. Very much just an initial screen to see if you’re a match they’d like to proceed with to hiring manager.", "Interview Questions": "What do you know about AdventHealth? "}, {"date": "14 Jul 2019", "title": "Insurance Reimbursement Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at AdventHealth Corporate (Maitland, FL)", "Interview Descriptions": "Took 3 weeks long.. I had a phone screening and 1 interview with 2 people from the department.  I received a call a week later. The process was pretty quick, my recruiter was great.", "Interview Questions": "STAR questions "}], [{"date": "11 Jul 2019", "title": "Patient Transporter Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at AdventHealth Corporate", "Interview Descriptions": "Very structure interview process. I could tell that they believe in patient safety first. It was very intimidating going into the interview but they definitely made it easier talking to them.", "Interview Questions": "What do I enjoy most about working in a hospital environment?"}, {"date": "25 Jul 2019", "title": "Business Systems Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 3 weeks. I interviewed at AdventHealth Corporate (Orlando, FL) in Jul 2019", "Interview Descriptions": "Applied online and got a message from a recruiter the same day. They interviewed me on the phone and then requested I apply online and fill out a pre-interview assessment which is where I never heard back.", "Interview Questions": "Do you believe that work environments are more efficient when everyone is from the same background or are you in favor of a more diverse work environment?"}, {"date": "23 Apr 2019", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at AdventHealth Corporate (Zephyrhills, FL)", "Interview Descriptions": "I applied online which proceeded with a telephone interview with the manager. It wasn’t your typical stressful interview but very relaxed. The interviewer was following a set of questions that were pre written and would write my responses. I felt comfortable during the whole process. After a few days I had an  in person interview with manager.", "Interview Questions": "Years of experience? What unit? Certifications?Why did you become a nurse?"}, {"date": "6 Apr 2019", "title": "Clinical Liaison Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I applied online. The process took 3 months. I interviewed at AdventHealth Corporate (Land O' Lakes, FL)", "Interview Descriptions": "I interviewed for the clinical liaison position at Connerton in Land O Lakes Florida twice. After the second interview I was told that they would like to bring me on PRN. I was told that someone would contact me to follow up so I waited and waited and waited. I followed up with a phone call and was told that I needed to reapply just two create a proper corporate paper trail.   So I reapplied and never heard anything. So I followed up again via email and voicemail and simply never heard anything again. Recently I followed up with a voicemail to the director for the clinical Liaisons, a very kind director, and just asked for some advice on how I might improve my interview and/ or how I might add to my experience in an effort to gain the position with Connerton LTAC. I have a history of working in LTAC and truly love the concept. As a faith based RRT with my B.S., in Leadership for Allied Health, I would have loved the opportunity to receive advice on how to improve my interview etc. Overall, disappointing experience by offering me the position and then crickets. Unprofessional and disrespectful to applicants.", "Interview Questions": "Strengths, Weaknesses, How to handle stressful situations etc. standard questions."}, {"date": "6 Sept 2019", "title": "Executive Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at AdventHealth Corporate (Altamonte Springs, FL) in Mar 2019", "Interview Descriptions": "My interview process took months of phone conversations, emails and multiple interviews: 1 on 1, group panel and lunch interview, most interviews took place all in one day, before I was finally hired.", "Interview Questions": "What is your most difficult task?"}, {"date": "30 May 2019", "title": "Lpn Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at AdventHealth Corporate (Zephyrhills, FL) in Apr 2019", "Interview Descriptions": "The interview was less than 5 minutes and they just said what the job entailed.  There was really no interview and since it was less than 5 minutes there is nothing to say about the process.", "Interview Questions": "There was no questions asked."}, {"date": "15 Apr 2019", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at AdventHealth Corporate (Orlando, FL) in Mar 2019", "Interview Descriptions": "The interview was super easy. You usually go through 2 short interviews. They asked about very basic questions, like where you live, how you commute, and what your availability is.You know right after if you are hired.", "Interview Questions": "Was what you think good hospitality is?"}, {"date": "13 Mar 2019", "title": "Medical Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at AdventHealth Corporate (Orlando, FL) in Feb 2019", "Interview Descriptions": "It was a very positive interview. The questions flowed into a conversation and all of my skills and achievements were discussed. I felt very relaxed with the interviewer and she answered all my questions.", "Interview Questions": "To name a reason why I wanted to work for Advent Health"}, {"date": "7 Feb 2019", "title": "Facilities Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at AdventHealth Corporate (Maitland, FL) in Feb 2019", "Interview Descriptions": "The interview with the Director was informative and detailed.  Most if not all of the required responsibilities was explained.  The future goals of the position was also explained in detail to give insight to growth.", "Interview Questions": "Where do I see myself in 5 years. "}, {"date": "10 Feb 2019", "title": "Director of Operations Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "The process took 2 months. I interviewed at AdventHealth Corporate (Asheville, NC) in Jan 2019", "Interview Descriptions": "Lengthy. First set of phone interviews were with their corporate HR department and then a phone interview with key employees. Was invited to attend on site interviews at Blue Ridge facility. First interview day started at 0700 and concluded with dinner that evening with the individual I would be reporting to. Day two was the same; back to back interviews along with multiple site visits. It was grueling! I was requested to submit three references prior to the site visit which I did. However, this required for me to notify my current manager about the possible offer. Retrospectively, I would have asked that I be allowed to forgo offering the requested references until after the site visits. I understand the healthcare system is faith based but not sure I could adjust to individuals requesting that you pray before the start of interviews/ meetings and the overall culture of the small healthcare facility. The facility seemed to lack diversity. In addition, the program I was interviewing for seemed small and in need of a lot of TLC. I was not impressed. In addition, even though I sent a follow up email thanking the hiring manager, I never heard back from her. For various reasons, my overall experience was that the hiring manager lacked communication skills.", "Interview Questions": "“Have you ever had to fire an employee?”"}], [{"date": "6 Feb 2019", "title": "Credentialing Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at AdventHealth Corporate (Winter Park, FL) in Jan 2019", "Interview Descriptions": "I applied online November 2018, contacted by HR for phone screen and sent an assessment December 2018. Interview was January 9.  I was told that same week I would hear back by the following week which turned out not to be true. I did not hear back until February 5.\n\nThe interview itself was very pleasant. The ladies were professional and personable. However, the location itself left something to be desired.  It is not located at a hospital, but rather in an older office building on an isolated street. \n\nLess than 2 hours after I had left the interview, a mutual ex-coworker of mine and an interviewer was contacted without my consent. This was not a person I listed as a reference and never gave consent to them being contacted. Unfortunately backdoor references are not illegal. Had I been offered the positions, I would have had trust issues with this specific person wondering what else would they be doing behind my back.", "Interview Questions": "I was asked about my work experience."}, {"date": "23 Jan 2019", "title": "Float Receptionist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at AdventHealth Corporate (Maitland, FL) in Jan 2019", "Interview Descriptions": "I am a very happy employee of Advent Health. From the security desk to the interviewing supervisor, everyone made me feel welcomed and valued. The interviewing supervisor was great, and speaking with her did not have me feeling anywhere near as nervous as I was when I first walked into the building. I look forward to continuing to grow with such an amazing company!", "Interview Questions": "Tell me something about yourself that you would want Advent Health to know?"}, {"date": "10 Jul 2019", "title": "Operations Analyst Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at AdventHealth Corporate (Orlando, FL) in Jan 2019", "Interview Descriptions": "I’m not sure what to write, however, wonderful service and experience overall. Everyone is kind and  respectful. Great place to be, thank you AdventHealth. You guys are great for both work and life.", "Interview Questions": "Experience"}, {"date": "15 Oct 2018", "title": "RN Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at AdventHealth Corporate", "Interview Descriptions": "Video Interviewing and two In Person Interviews for the Residency Program. The first in-person interview was with managerial staff and the second was with peers. The interview questions were behavioral questions. My experience was negative because at the end of the process, I received an e-mail that was sent from the system, not even an individual. Very disheartening after such a long process.", "Interview Questions": "Behavioral Interviewing"}, {"date": "19 Oct 2018", "title": "Benefits Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at AdventHealth Corporate (Maitland, FL) in Aug 2018", "Interview Descriptions": "Very nice office but the actual interview felt more like a deposition where I might perjure myself than an actual interview. Sterile conference room with me on one side of a large table and three Florida Hospital reps on the other side. They had laptops open and kept glancing at the screens. It's disconcerting to have such an impersonal and rigid environment.", "Interview Questions": "Where do you see yourself fitting in at Florida Hospital?"}, {"date": "24 Oct 2018", "title": "Vice President Digital Marketing Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at AdventHealth Corporate (Altamonte Springs, FL) in Aug 2018", "Interview Descriptions": "This was a horrible experience. Initial contact was fine as was the interview. They then went silent and unresponsive for 2 months. I then had a 4 person panel interview during which  one of the interviewers mentioned that they like to \"torture\" their candidates in the interview process. They have now been silent for more than 6 weeks -- so either I'm still a candidate or I'm not - I really have no idea,", "Interview Questions": "They asked if I'd be comfortable working for a religious organization."}, {"date": "29 Jul 2018", "title": "Certified Nursing Assistant CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at AdventHealth Corporate", "Interview Descriptions": "I applied an application online . I had an interview. I met two amazing director and manager . Interview took about maybe less 20 minutes . Then I wasn’t sure if I got job or not . I got a job few days later .", "Interview Questions": "Tell about yourself and work experience?"}, {"date": "20 Jul 2018", "title": "Communications Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at AdventHealth Corporate", "Interview Descriptions": "Had first interview with the Marketing & Communications team. THe team was really nice and asked questions about my experience and how I could fit in with the team. 2nd Interview was with the medical center president.", "Interview Questions": "Why Adventist health system?"}, {"date": "19 Jan 2020", "title": "Analyst Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. The process took 2 weeks. I interviewed at AdventHealth Corporate (Orlando, FL) in Jul 2018", "Interview Descriptions": "In-person meet with team lead, foreign manager, and director phone-in.  Was on-site in their conference room. Very short interview, maybe 30 minutes long. Nothing difficult, just a personality interview.", "Interview Questions": "There were very limited questions asked, just asked to explain work history and experience."}, {"date": "29 Jun 2018", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at AdventHealth Corporate (Orlando, FL) in Jun 2018", "Interview Descriptions": "The first thing you know is if you have to go back and kiss your face lol you better find it weird and then you need a really good friend seriously and don't get it you know", "Interview Questions": "Many"}], [{"date": "19 Jan 2022", "title": "Big Data Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at AdventHealth Corporate (Altamonte Springs, FL) in Jun 2018", "Interview Descriptions": "The process for me was smooth and seamless. I reached out to hiring manager via LinkedIn and applied from job portal. HR scheduled first phone screening followed by on site technical interview.", "Interview Questions": "Coding:\r\nSqoop Job to import data into table\r\nStreaming data to Kafka and spark to read and replicate data to hive and exposing it using impala\r\nSeveral Linux questions "}, {"date": "22 May 2018", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at AdventHealth Corporate", "Interview Descriptions": "Referred by an employee for three positions. Received an email asking me to set up a phone interview for the first position. Responded four times over two weeks via email (no phone number provided) with no response. Received an email thanking me for coming in for an interview for the second position (that never occurred), but they are going with another candidate. Check Taleo to see that all three positions went from \"Under Consideration\" to \"No Longer Under Consideration\". Then, last Thursday, I received another email asking to set up a phone screen for the third position. I responded immediately and still have not heard back. When I mention this to the referring employee, she says \"We know HR is terrible. Sorry.\"", "Interview Questions": "I would love to have an interview from which to draw this information."}, {"date": "24 Apr 2018", "title": "Project Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at AdventHealth Corporate", "Interview Descriptions": "Asked to schedule in person interview by hiring manager and met with him and his colleague at their office. It was a casual and friendly interview that allowed for conversation.", "Interview Questions": "What experience do you have in project management? "}, {"date": "12 Mar 2021", "title": "Member Concierge Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at AdventHealth Corporate (Orlando, FL) in Apr 2018", "Interview Descriptions": "Interview was very straight forward. Filled out the application.  Had onsite interview. Someone called me to ask me my preferences and spoke to me more about the job. They tell you the starting hourly rate on the phone if the company wants you. You accept or deny.", "Interview Questions": "What hourly rate are you looking for?"}, {"date": "14 May 2018", "title": "Program Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at AdventHealth Corporate (Orlando, FL) in Mar 2018", "Interview Descriptions": "I interviewed with a group of people I would be working with. They each had certain questions to ask me. It felt like a long process and it made me nervous. Initially I had walked my resume in and I was made aware of a position available. I was asked to apply online then called into interview with the group.", "Interview Questions": "Name a time you disagreed with a coworker and how did you resolve it."}, {"date": "15 Feb 2018", "title": "Patient Financial Services Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at AdventHealth Corporate", "Interview Descriptions": "There was a phone interview, followed by a required test to test basic math, reading, and writing skills. Once this was finished, I moved on to the next step which was meeting with HR. After that meeting, I met with the department heads and interviewed.", "Interview Questions": "They asked ethical questions."}, {"date": "31 Jan 2019", "title": "PRC Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at AdventHealth Corporate (Maitland, FL) in Feb 2018", "Interview Descriptions": "Lengthy And It Takes Forever For The Background Check Company To Clear You But After All That It Is Nice. Just A Very Long On boarding Process That Is Amazing.", "Interview Questions": "N/A"}, {"date": "3 Mar 2018", "title": "Benefits Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at AdventHealth Corporate (Maitland, FL) in Jan 2018", "Interview Descriptions": "Applied via FH Website.  Got a call for interview the next week.  The interview was 2 parts: one with a manager (or supervisor) after the other with a group of mid-level supervisors and workers.  Each lasted about 20 minutes.  Received a call (a rejection) 3 days later.", "Interview Questions": "What will you be able to do to increase the rate of completed claims that FH receives so that it gets paid promptly?"}, {"date": "29 Apr 2019", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at AdventHealth Corporate in Jan 2018", "Interview Descriptions": "Good questions focused on patient experience. Discussed the faith-based environment. Strengths and weaknesses. Why I wanted to come to AHZ. About my skills and how it would apply to job I had applied for.", "Interview Questions": "How I integrated my patient experience in hourly visits."}, {"date": "15 Dec 2017", "title": "Informatics Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at AdventHealth Corporate (Hendersonville, NC) in Nov 2017", "Interview Descriptions": "There were 2 phone interviews with the second phone interview being a panel interview. I was invited for an on site interview which was also a panel interview. The on-site interview required travel and reimbursement was offered.  I was told a decision would be make by the end of the week most likely in the form of an email. I never received an email nor a job offer, even after I left a voicemail for the  hiring manager. I only spoke with the hiring manager never with HR. Disappointed in that although I did not get a job offer it seems like some sort of email could have been sent out in regards to whether the position was filled or not. The career site still lists the job status as active.", "Interview Questions": "How are you a team player?"}], [{"date": "17 Oct 2017", "title": "Staff RN Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at AdventHealth Corporate (Bakersfield, CA) in Oct 2017", "Interview Descriptions": "Panel of 4, ER, ICU, Tele, Med/surg managers. All asked you questions based on need in their department. They are looking for candidates that best suit their department needs, so they are looking at your reaction.", "Interview Questions": "What are some of your strengths and weaknesses? "}, {"date": "5 Jan 2019", "title": "Patient Access Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at AdventHealth Corporate (Zephyrhills, FL) in Sept 2017", "Interview Descriptions": "Too extensive. Waiting period very long.  Waited 2 months for an interview then waited another 3 weeks for the second interview.  The first interview was short and very easy. The second interview was peer involved and was very well conducted.", "Interview Questions": "N/A"}, {"date": "8 Sept 2017", "title": "Outpatient Care Coordinator Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at AdventHealth Corporate", "Interview Descriptions": "Completed a video recording interview, I was then asked to come in for a face-to-face interview and my references were submitted that same day. Two weeks later I got a call from the recruiter offering me the position, I accepted and the recruiter said the manager will put the requisition in and they will call me with further details (salary, schedule, orientation date, etc.) and I NEVER heard from anyone again. How do you offer someone a job and then disappear? Extremely unprofessional.", "Interview Questions": "Medical terminology knowledge"}, {"date": "24 Aug 2017", "title": "Help Desk Analyst Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at AdventHealth Corporate", "Interview Descriptions": "First I applied and was talking through email and then I had a phone interview. Next I had to fill out a questionnaire. From there I was then asked to have an interview at their office.", "Interview Questions": "Who are you?"}, {"date": "17 Aug 2017", "title": "Behavioral Health Counselor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at AdventHealth Corporate (North Aurora, IL) in Aug 2017", "Interview Descriptions": "I was applying for a small alternative high school in North Aurora.  The communication was professional but it was intimidating to be interviewed by 3 people for 45 mins with very tricky questions!    Be ready for lots of behavior based interview questions.", "Interview Questions": "Tell me about a time when you had to change your behavior..."}, {"date": "27 Dec 2017", "title": "Benefits Authorization Representative Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at AdventHealth Corporate (Orlando, FL) in Aug 2017", "Interview Descriptions": "Two managers in a room. They asked a few questions and felt like one had good rapport. They said they would get back to me by the end of the week, but I never heard anything back one way or the other. The status changed to No longer under consideration and that was the extent of contact post-interview. I reached out to the recruiter and hiring manager to follow up, but never got a response.", "Interview Questions": "Why do you want to work for Florida Hospital?"}, {"date": "14 May 2018", "title": "Financial Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at AdventHealth Corporate (Maitland, FL) in Jul 2017", "Interview Descriptions": "Spoke with HR recruiter, then directly interviewed in person with Director and Hiring Manager. The meeting was informal. Had to interview with the whole team. It was a bit nerve wrecking, but overall all the employees were very friendly.", "Interview Questions": "Basic interview questions, was very informal "}, {"date": "26 May 2017", "title": "Revenue Cycle Educator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at AdventHealth Corporate", "Interview Descriptions": "First interview is with management then second interview is a presentation in front of team to analyze teaching style.  If your presentation goes well you will have a interview with senior leadership.", "Interview Questions": "What are your strengths and weaknesses"}, {"date": "14 Jul 2017", "title": "Finance and Accounting Position Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at AdventHealth Corporate in May 2017", "Interview Descriptions": "Initial phone interview, followed up by interactive video interview.  Followed up with corporate HR, told position was still pending.  Subsequent follow up has been without response, as everything went radio silent.  Attempted to determine status through their recruiting portal (they use Taleo), but system will not permit access even though using verified user ID and password sent to me.  Phone call to Corporate HR asking for assistance or status was never returned.   For a faith-based organization, very disappointed with the way I was treated as a candidate.", "Interview Questions": "Describe how you have applied your faith in one aspect of your job.  (Adventist is a faith-based healthcare provider, so question did not surprise me.)"}], [{"date": "7 Jun 2017", "title": "Learning And Development Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at AdventHealth Corporate (Tampa, FL) in May 2017", "Interview Descriptions": "Applied through the companies website and received an email indicating they wanted me to complete a 'video' interview, using 'hire vue' software. \r\n\r\nThe format of the video interview was interesting. \r\n\r\nFirstly the recruiter that was heading up the search for this position introduced themselves in a video and then the questions started.\r\n\r\nThe recruiter would ask a pre-recorded question and then the question would be displayed in a text format. You have 30 seconds to prepare for the question and then 2-3  minutes per answer. You were recorded while answering the questions.\r\n\r\nThe main issue I had was that at least once, the question that the recruiter asked was different than the text version of the question.\r\n\r\nAfter completing the interview I received an email indicating that \"A representative from Adventist Health System will contact you about next steps\". A link in this email indicated that I could check on status on application, unfortunately the link was broken.\r\n\r\nAll emails from the company were sent from 'do not reply to this email address'\r\n\r\n4 weeks later and still haven't heard anything from the company, not even a generic, this position has been filled email.", "Interview Questions": "It was something like\r\n\r\nHow would you define quality work"}, {"date": "30 Jun 2017", "title": "Administrative Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at AdventHealth Corporate (Orlando, FL) in May 2017", "Interview Descriptions": "about 20 min, asked questions of strengths weakness and where i see my self in the future. very comfortable setting. The manager was very easy to talk to and the doctor is very pleasant", "Interview Questions": "what are your strengths?"}, {"date": "20 Mar 2017", "title": "Administrative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at AdventHealth Corporate", "Interview Descriptions": "Sat down with department manager. We discussed what the office does and ways each one help each other which was great in my opinion. He asked me a couple of other questions which was fairly easy to answer.", "Interview Questions": "Tell me a little bit about yourself"}, {"date": "8 Mar 2017", "title": "Speech Language Pathologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at AdventHealth Corporate", "Interview Descriptions": "Very clinical, a lot of case study questions. The questions were very relevant and prepared me for what to expect. The interview was one on one and was very direct.", "Interview Questions": "They asked me to describe my plan of care for an NPO patient "}, {"date": "6 Mar 2017", "title": "Controller Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at AdventHealth Corporate (Palm Coast, FL) in Feb 2017", "Interview Descriptions": "applied and was sent a link to a one-sided skype like interview. It was horrible and I was only give a few hours to complete it since my 24-48 hours started on a Sunday.", "Interview Questions": "I was asked about how my experience fit their christian based mission "}, {"date": "6 May 2017", "title": "Cash Reconciliation Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at AdventHealth Corporate (Altamonte Springs, FL) in Jan 2017", "Interview Descriptions": "There were 4 different rounds. Phone, meeting with the supervisor and manager, meeting with the manager and director, and then meeting with the vp of finance. It was a lengthy process, but everyone was extremely nice.", "Interview Questions": "What kind of hobbies do you enjoy?"}, {"date": "18 Jan 2017", "title": "Project Manager Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at AdventHealth Corporate (New York, NY)", "Interview Descriptions": "The phone screen was conducted after a phone interview and face-to-face meeting with the hiring manager. The process was \"backwards\" and was not very organized. They did not get back to me in a timely manner.", "Interview Questions": "What is the \"minimum\" amount of salary you would accept for this job?"}, {"date": "3 Apr 2017", "title": "Marketing Strategy Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at AdventHealth Corporate (Orlando, FL) in Jan 2017", "Interview Descriptions": "Lengthy process, but well thought out. It started with a phone interview followed by an in-person interview with some team members. The questions varied but everyone had something different they brought to the interview. Having multiple members in on the interview may be intimidating to some", "Interview Questions": "Do you prefer to work in a group setting or with others"}, {"date": "27 Feb 2017", "title": "Senior Change Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at AdventHealth Corporate (Altamonte Springs, FL) in Dec 2016", "Interview Descriptions": "Group interview with members of immediate team was conducted via phone after an initial phone screen. The initial contacts were very professional and upon asking about the process, the hiring manager provided excellent details so I would know what to expect.", "Interview Questions": "How would you handle an overload of work requests?"}, {"date": "23 Oct 2016", "title": "Documentation Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at AdventHealth Corporate (Orlando, FL) in Oct 2016", "Interview Descriptions": "I got a call to schedule an interview.  I had an interview with two different people. They have a set of questions that are standard for all the candidates applying for that position. I  felt that these questions do not apply to the job I applied for. I think they should focus on testing your skills needed for the job. I was very nervous and like I said before some of those situations did not even apply to my past job experiences.", "Interview Questions": "Describe a time were you had to deal with a customer that made unreasonable requests. How did you approach that situation, how did you resolve the issue?"}], [{"date": "25 Sept 2016", "title": "Respiratory Therapist-PRN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at AdventHealth Corporate (Ormond Beach, FL)", "Interview Descriptions": "Online application process, called to schedule interview by HR department, Cardiopulmonary manager began interview asked basic questions about my work history, brought in 3 other lead therapist to discuss job specific needs and feel out how I would handle hi pressure situations. Apparently, I answered positively & was accepted for the position on the spot.", "Interview Questions": "How many treatments am I used to completing 1st rounds? "}, {"date": "3 Sept 2016", "title": "Clerical Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at AdventHealth Corporate (Orlando, FL)", "Interview Descriptions": "Was conducted at one time in person (if you are out of the area, they can adjust and provide it over the phone) in two segments. The first segment was conducted by immediate management, the second segment by co-workers at the same grade as the open position. There is a skills test conducted beforehand and you will need to have a PPD/Mask Fit test conducted on the backend.", "Interview Questions": "How would you handle a situation with an upset patient/family member?"}, {"date": "3 Aug 2016", "title": "Marketing and Sales, Florida Hospital Celebration Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at AdventHealth Corporate", "Interview Descriptions": "After sending in a resume and cover letter, I was contacted a few days afterwards by the Hospital to schedule an interview. The interview was fairly straightforward, with questions about strengths, weaknesses, and what I would bring to Florida Hospital. They will also ask you specific questions about Florida Hospital's core values, so study up on those. It was fairly relaxed, and I was offered the internship right away.", "Interview Questions": "Q: What are Florida Hospital's key values?"}, {"date": "22 Mar 2020", "title": "Revenue Management Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 3 days. I interviewed at AdventHealth Corporate (Orlando, FL) in Aug 2016", "Interview Descriptions": "Structured, but conversational. Somewhat relaxed, but professional and clearly well planned. At the time, they were growing their internal team and were looking for dedicated employees who would stay for at least 3 years.", "Interview Questions": "Have you ever worked in a financial department."}, {"date": "17 Jul 2016", "title": "Referral Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at AdventHealth Corporate", "Interview Descriptions": "Applied on a Thursday the very next day online application status says Application Evaulation Under Review. Just being patient and waiting to get hired. Sure process will take a few weeks. I've been trying to get into this employer for over 10 years. It is hard to get an interview. Just keep trying and you'll get through don't give up.", "Interview Questions": "Haven't received any as of yet"}, {"date": "11 Jun 2016", "title": "Data Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at AdventHealth Corporate", "Interview Descriptions": "After sending in references, taking a skills test, and having an initial phone interview, I had a face-to-face interview with the person whom I would report to if I was offered the job. Throughout the interview, no questions of my skills were asked. Instead, the employer described to me in detail the specific company task that they want the candidate to take on if they were given the role. From there, he put me in a room where he told me to impress him with my coding capabilities in terms of how I would solve the company task. I'm under the impression that there was never really an interest in hiring for this position but rather that the company was using the interview process to receive free consulting from the applicants of this position. This was especially highlighted when the interviewer mentioned that they could just hire an SQL consultant instead of hiring for this position. Overall, my impression was that the interviewer and the process itself was very unprofessional, considering that the face-to-face interview alone lasted four hours and I was given no warning beforehand.", "Interview Questions": "N/A"}, {"date": "11 Jun 2016", "title": "Medical Receptionist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 1 week. I interviewed at AdventHealth Corporate (Maitland, FL) in Jun 2016", "Interview Descriptions": "I sat down in the interviewer's office. The interviewer asked me for my resume and I provided it. the interviewer asked me if I speak Spanish, how fast I type, told me I was only qualified for a receptionist position When I stated that I obtained my BS in health administration and then told me my information would be shared with 140 medical offices and thanked me for coming in.", "Interview Questions": "They asked to explain my job duties"}, {"date": "24 May 2017", "title": "Recruiter Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 3 weeks. I interviewed at AdventHealth Corporate (Tampa, FL) in Mar 2016", "Interview Descriptions": "The interview was formal. Greetings were said, and we jumped straight into the interview. Lots of situational based questions, and how example based questions. They asked about previous experience and what the work, and culture was like in my previous positions as well. Once done I heard back about 3 days later with an offer.", "Interview Questions": "Give an example in a previous role where you had to determine if an applicant was a good fit, and how you came to the decision that they would be a good fit for said organization?"}, {"date": "16 Jan 2016", "title": "Regional Compliance Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at AdventHealth Corporate", "Interview Descriptions": "Initial was a Skype, phone call. Excellent. Treated professionally and relaxing. I enjoyed all the professionals I spoke with. Very impressed. They were prompt in emails to me describing the next steps. They promptly set up the next interview level and sent out the personality inventory that was not very long.", "Interview Questions": "Why am I interested in changing jobs?"}, {"date": "30 Dec 2015", "title": "Human Resources Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 3 months. I interviewed at AdventHealth Corporate", "Interview Descriptions": "Standard interview process. Began with a phone interview with Chief People Officer of the region. Followed by in person interviews on-site at the Hospital where I would be working. I was flown in the night before my interview and spent the day with the executive that I would be a part of, the staff I would be in charge of and also the CPO and a local HR director who would be a colleague.", "Interview Questions": "Tell me a time when you led a team? Tell me a time when you dealt with conflict and how did you deal with it? Where do you see yourself in 5 years?"}], [{"date": "4 Sept 2017", "title": "Supply Chain Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at AdventHealth Corporate (Tampa, FL) in Jan 2016", "Interview Descriptions": "Interview process was very detailed.  The staff was very professional. First, there was a phone interview and then a panel interview with multiple departments. Final process was with the AVP to finalize.", "Interview Questions": "Give us an example of a difficult situation at a previous job and how did you handle it?"}, {"date": "16 Dec 2015", "title": "Data Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at AdventHealth Corporate", "Interview Descriptions": "The company had me do an skill assessment test and provide references online but had not moved forward to the next step to interview me.  My opinion is the process is a bit backwards and I feel I wasted my time following their process.  Also, I have followed up with HR several times (over 4 weeks period) and I still don't have a response on the status so I have been left totally in the dark.  They should at least let me know something either way but I find the lack of a response very unprofessional on their part.", "Interview Questions": "Mostly technical skills questions and situations when training others or managing."}, {"date": "25 Mar 2017", "title": "Clinical Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 4 weeks. I interviewed at AdventHealth Corporate in Dec 2015", "Interview Descriptions": "Panel interview first with management team and then with clinical team interview process was long but position was for management. Had experience in this field and this position which made applying for the position and knowing what types of questions were going to be asked easier.", "Interview Questions": "How do you cope with personal stress?"}, {"date": "28 Oct 2015", "title": "Cafeteria Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at AdventHealth Corporate in Aug 2015", "Interview Descriptions": "It took around two weeks. I applied online and received a short phone call regarding my previous work experience. I went to the Human Resources building and met with the interviewer. The interview lasted 30 minutes and then I interviewed with another person. Some of the questions asked were the same. It was a good overall experience but I was not given an offer. I think it is because they thought they caught me in a lie. I told the interviewer that I could not work on Tuesday or Thursday and she repeated it back to me a second later and was like, you can't work tuesday and friday? I corrected her. She did this later again(or atleast I think she did) I only had a year of food service experience but I had another year of experience working as a med scribe. So when she asked if I had two years of customer service I let it slide. Which I probably should have clarified :(", "Interview Questions": "What is one of your weaknesses? What do you do to overcome it?"}, {"date": "3 Mar 2016", "title": "Executive Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at AdventHealth Corporate (Maitland, FL) in Jun 2015", "Interview Descriptions": "apply online via employee website, a total of 2 interviews, The first interview was with management and with 2 days I received a return phone call asking for me come to a 2nd interview which was called a peer interview", "Interview Questions": "Why I was looking for another postition"}, {"date": "26 Sept 2017", "title": "Secretary Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at AdventHealth Corporate (Orlando, FL) in Jun 2015", "Interview Descriptions": "Assessment appointments are initially setup and depending on the scores determines whether or not the interview process continues. Interview begins in HR with multiple in-depth questions and answers. Ending with Unit Manager or Area Supervisor meeting.", "Interview Questions": "Name one time at a previous employment where you went' above and beyond. '  Give details."}, {"date": "1 Jun 2015", "title": "Registration Representative Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at AdventHealth Corporate (Orlando, FL) in May 2015", "Interview Descriptions": "It was a pretty simple interview.  They wanted to know what my availability was like, and some other basic questions about why I would think I'm a good fit for the position.  They also asked about my previous experience in a medical setting.  It was a very professional interview!", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "1 Apr 2015", "title": "Registration Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at AdventHealth Corporate in Mar 2015", "Interview Descriptions": "The whole process was rather lengthy. I applied online late February or Early March. Got a call to set up an interview on the 12th. Interview was scheduled on March 26th. Got a call yesterday offering me the position. I met with HR on the 26th for a quick interview followed by a surprising interview with 4 managers ( it was nerve wrecking ) but they were all very nice and made the interview a littler easier, then I was taken to do shadowing for a little. It was very smooth but I was very nervous.", "Interview Questions": "A lot of scenerio questions and behavioral questions from HR and the managers. "}, {"date": "18 Jan 2015", "title": "Process Improvement Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at AdventHealth Corporate", "Interview Descriptions": "The internship was for my senior design project through the university, so the hire was pretty much guaranteed. afterwards, it was as simple as a background check and a flu vaccine.", "Interview Questions": "straightforward interpersonal questions. nothing too difficult"}, {"date": "13 Jan 2015", "title": "Accountant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at AdventHealth Corporate", "Interview Descriptions": "easy, no issues with hard question. no technical questions asked. They were very nice to deal with. This was probably the best interview I had. Interview lasted 30 minutes.", "Interview Questions": "why I left my previous job"}], [{"date": "16 Apr 2015", "title": "Cerner Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 6 days. I interviewed at AdventHealth Corporate (Orlando, FL) in Jan 2015", "Interview Descriptions": "Human resources calls you and you need to fill out a bunch of paper work online. After that they run your background and etc. Then you need to find the place where your interview is and this is the hardest part because Florida hospital is so big. Otherwise everyone is really nice until you get hired", "Interview Questions": "What are your strengths and weaknesses"}, {"date": "11 Nov 2014", "title": "Analyst Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at AdventHealth Corporate", "Interview Descriptions": "Interview and quick callback, Lead to another followup interview, they had a committee that interviewed me, ask me lots of questions about work and my life. Heard back within a week or so and then started the next week after. overall I would say it was quick and easy compared to other companies that I had interviewed with in the past, I would say it definitely made the transition easier for me.", "Interview Questions": "What adventist values reflect your work qualities?"}, {"date": "18 Nov 2014", "title": "Support Specialist Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at AdventHealth Corporate", "Interview Descriptions": "Very long, drawn out month process from beginning to end. Had to wait about 2 weeks to get HR interview after being offered the job, then after the interview, took another week to hear that I was going to get the position, which took another week to get in and sign final paperwork and set up my orientation.", "Interview Questions": "Questions were pretty straight forward and it seemed like the girl was just there to do her job during the HR screening."}, {"date": "18 Nov 2014", "title": "Marketing Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at AdventHealth Corporate", "Interview Descriptions": "Apply online and if they call you, you will be pre-screened by phone. Interview usually lasts 15-30 minutes. If they like you, they will ask you to come in. They let you know within a week if you got the job or not.", "Interview Questions": "N/A"}, {"date": "19 Oct 2014", "title": "Senior QA Analyst Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 2 weeks. I interviewed at AdventHealth Corporate (Altamonte Springs, FL)", "Interview Descriptions": "Got interview in 1 day, went through Recruiter. 1st Round was Interview with QA manager which took 45 minutes. Immediately called for 2nd in person round. Very very sophisticated and time bound interview process, I was impressed with it. They called from 9am to Noon. Met with Dev manager and IT manager for 1 hr. 30 mins with QA team, 30 mins with HR, 30 mins with QA Manager again and last 30 mins with Director. Very systematic process.", "Interview Questions": "What was the mistake you made in last job and what price did you pay for it, asked by Director. Overall interview was experience and situation based"}, {"date": "5 Nov 2014", "title": "Business Development Manager Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at AdventHealth Corporate", "Interview Descriptions": "Very easy questions Normal questions for the interview process but it takes months sometimes to make sure if you are going to be hire. Human resources works very slow the process of hiring. Don;t expect to be hire on the spot, also after hiring the training is not long but you will always find a co-worker to help you with the process. They have a very positive culture to help not only the patients but also their employees.", "Interview Questions": "Normal questions for the interview process but it takes months sometimes to make sure if you are going to be hire. Human resources works very slow the process of hiring."}, {"date": "23 Aug 2016", "title": "Nurse Practitioner Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at AdventHealth Corporate (La Grange, IL) in Oct 2014", "Interview Descriptions": "Interviewed with all the providers and then with HR. Just asked questions about experience and work related goals. They discussed work expectations and hours. Work training was also discussed. They wanted to know about personal conflicts with the expectations and hours. Went over what my job role was and who I would be training with.", "Interview Questions": "Job experience, school prep, work goals, conflicts, work hours, family needs, work needs"}, {"date": "10 Jul 2014", "title": "Administrative Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at AdventHealth Corporate (Orlando, FL) in May 2014", "Interview Descriptions": "They emailed me about taking tests for the position I applied for.  You call to make a appointment you have 10 days from the date of the email/phone call to make an appointment.  Went in took the tests , I scored high enough to go back in and retake tests.", "Interview Questions": "N/A"}, {"date": "23 Jan 2016", "title": "End User Computing Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at AdventHealth Corporate (Tampa, FL) in May 2014", "Interview Descriptions": "It was one interview with a panel of 3 directors. They asked some technical questions a few scenario questions. The interview was unusually long (it lasted almost 2 hours) All 3 directors were very nice and professional. There were no other interviews required and I was offered the job two weeks later.", "Interview Questions": "How would you handle the situation with a customer who is being difficult?"}, {"date": "19 Feb 2014", "title": "Marketing Department Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at AdventHealth Corporate", "Interview Descriptions": "It's a long process, be patient.", "Interview Questions": "They asked a lot of situational questions. Make sure to have examples of specific projects etc. "}], [{"date": "25 Feb 2014", "title": "Customer Service Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at AdventHealth Corporate (Altamonte Springs, FL) in Feb 2014", "Interview Descriptions": "I was called to meet with my potential manager for an interview. Met in a small meeting room where they asked me a couple questions about taking difficult calls . The manager went on to tell me about the position , had me to take a survey and gave me a tour of the building. Everything went great , manager told me that I would be hearing from them later on that day. Minutes later received a call from the HR department at the Altamonte location requesting to have a follow -up interview. Came in for the interview received more information about the position asked more questions.", "Interview Questions": "All questions that were asked were pretty fair and average. "}, {"date": "16 Feb 2016", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at AdventHealth Corporate (Collegedale, TN) in Oct 2013", "Interview Descriptions": "I was referred to the internship program by my professors at Southern Adventist University.  I, along with 45 other students from my university, signed up to interview for the limited intern positions that were being offered by Adventist Health System.  I had two days to prepare and brought an updated resume to my one-on-one interview.  The interview lasted about 25 minutes and I was told I would be contacted in the next several weeks with the results.  I was accepted to the internship program and flown down to Florida, Adventist Health System headquarters for a three day orientation.", "Interview Questions": "If you were asked to attend a board meeting and your boss was at the head of the table, where would you sit? "}, {"date": "26 Sept 2013", "title": "Applications Analysis Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at AdventHealth Corporate (Lake Mary, FL)", "Interview Descriptions": "NA", "Interview Questions": "N/A"}, {"date": "27 Jun 2013", "title": "Finance Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at AdventHealth Corporate", "Interview Descriptions": "Came to my school and interviewed students. Within a month I was offered the position.", "Interview Questions": "Usual questions: Goals, most difficult task presented with, how I handled it. "}, {"date": "2 Jul 2013", "title": "Department Secretary Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at AdventHealth Corporate in Jun 2013", "Interview Descriptions": "Step 1 take a skills test. I passed, then step 2 took part in a 10 min phone question session. I then was informed I would receive 2 emails consisting of a 30 min. questionnaire and another form to submit to 3 references. Next was a phone interview.", "Interview Questions": "The 4th step in the process consisted of a phone interview that consisted of 5 questions that were to be answered in story telling form. "}, {"date": "12 Jun 2014", "title": "Applications Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 2 weeks. I interviewed at AdventHealth Corporate (Orlando, FL) in May 2013", "Interview Descriptions": "Lots of situational questions involving \"tell me about a time when...\" and \"give me an example when you...\" and other such verbiage.  Be prepared to recall odd situations that might make you uncomfortable.  Be prepared to wait for a loooong time.  It took weeks to get in the door after my interview and hiring.  It took 2 more weeks just to get things set up so I could work.  Things move slowly here, but they do move.", "Interview Questions": "Tell me about a time when you and your manager/supervisor disagreed about something and how did you handle it?"}, {"date": "9 Sept 2016", "title": "Accountant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at AdventHealth Corporate (Orlando, FL) in Mar 2013", "Interview Descriptions": "Very short. They ask questions to see if you fit they're culture. Usually meet with 2 people and then if they like you you will meet with the whole team.", "Interview Questions": "Are you a religious person?"}, {"date": "15 Jan 2017", "title": "Phlebotomist Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at AdventHealth Corporate (La Grange, IL) in Feb 2013", "Interview Descriptions": "Received a phone call from hr scheduled appointment for interview. Went to interview.\r\nI met with hr then with the manager and has to draw someone's blood on the spot so they would see if I knew all the proper drawing procedures as well as order of draw with tubes.", "Interview Questions": "Why would you want to work here?\r\nName a situation in the past where a problem occurred and how you ha feels it?\r\nAre you available to work on holidays and weekends?"}, {"date": "8 Mar 2016", "title": "Supply Chain Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at AdventHealth Corporate (Altamonte Springs, FL) in Feb 2013", "Interview Descriptions": "A phone interview takes place with the hiring manager. Once that step is completed, an on-site interview is scheduled with the entire management team in a conference room. If all goes well from there, an offer is usually made within a matter of days. Standard questions applied during the interview. The biggest determining factor for the interview is whether your personality is a good fit for the company, not so much your experience. They much rather higher someone with a lot of potential than someone who just fits the requirements.", "Interview Questions": "Which would you a choose, an astronaut, cowboy, or soldier? Then tell us why?"}, {"date": "6 Dec 2015", "title": "Senior Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 6 weeks. I interviewed at AdventHealth Corporate (Orlando, FL) in Apr 2012", "Interview Descriptions": "it was a bit different for me as I was approached by them, met with leaders, then applied to position.  It is tough to get through Florida Hospital HR if you do not know someone.", "Interview Questions": "What has been your biggest challenge in transforming teams?"}], [{"date": "14 Mar 2011", "title": "Unit Secretary Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 2 days. I interviewed at AdventHealth Corporate (Bolingbrook, IL) in Jan 2011", "Interview Descriptions": "After 6 months of  filing out multiple online applications, for any position I though I might qualify for, at multiple locations within the organazations I received a message asking if I was still interested in \"said \" position to call back. Weird thing was that the message wasn't for me.  I called and left a message explaingin this with the thought that must have just said the worng number because they called my number. It was a month alter befroe I got a call fron the HR assistant to come in and interview for a 2 day a pay peroid Registar position.  Once in for the interview the interviewer offer me a full time Unit secretary position based on 10 plus years experience.  I came in the next day to interview with the Nurse Manager which was more like a informational seesion of the unit.  Three days later I received a offer.", "Interview Questions": "Name a time when you were faced with a difficult siuation at work"}, {"date": "26 Jan 2011", "title": "Accountant II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at AdventHealth Corporate (Orlando, FL) in Dec 2010", "Interview Descriptions": "First interview with reporting manager, second with HR thrid with director", "Interview Questions": "why are you looking for a new job when you already have one?"}, {"date": "17 Sept 2014", "title": "Registration Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at AdventHealth Corporate in Sept 2010", "Interview Descriptions": "Very easy process.Interviewed with manager and supervisor. Basic interview questions. Gave examples of how to handle stressful situations. Need to show that you reach the goals set each month for collections. Must show that treatment of the patient is very important. HR will do a background check and you will need to get screened for TB and pass drug screening test.", "Interview Questions": "Where do you see yourself in this organization 5 years from now?"}, {"date": "5 Feb 2014", "title": "Director of Marketing Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 2 months. I interviewed at AdventHealth Corporate (Orlando, FL) in Sept 2010", "Interview Descriptions": "brought on after doing contract work by one of the VPs", "Interview Questions": "N/A"}, {"date": "10 Jan 2011", "title": "Coder Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. The process took 2 days. I interviewed at AdventHealth Corporate (Lakeland, FL) in Aug 2010", "Interview Descriptions": "Sent to hospital through staffing agency and was offered opened position of Coder about 2 months later. As directed by my immediate supervisor I applied for the open position after temping for 2 months and went through the process to get hired w/FL Hospital. Total process time from temp to perm was about 40 days.", "Interview Questions": "Describe myself."}, {"date": "19 Oct 2014", "title": "Executive Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 2 weeks. I interviewed at AdventHealth Corporate (Orlando, FL) in Feb 2010", "Interview Descriptions": "The hiring and interview process was very comfortable.   I met first with the Department Manager, then with several executive leadership members.   I felt welcomed and almost forgot it was an interview.   After going through the HR process, Employee Clinic physical and orientation - I felt truly blessed to be a part of such an organization.", "Interview Questions": "I was asked by a senior executive about my previous managerial work experience.  At the end of this discussion, she asked me a question that totally through me off guard.  She asked as to which process I liked to do best or least, hiring or firing."}, {"date": "28 Sept 2012", "title": "Clinical Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at AdventHealth Corporate (Winter Park, FL) in Mar 2009", "Interview Descriptions": "I applied via the company website and was contacted soon thereafter. The interview process was smooth and the interview itself was not stressful.", "Interview Questions": "There were no unexpected questions"}]]