[[{"date": "7 Jun 2023", "title": "Digital Marketing Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Save the Children UK (London, England)", "Interview Descriptions": "It was a standard work interview for a digital marketing manager position. It was a great experience, I would definitely recommend this company for anyone interested in working in the charity industry.", "Interview Questions": "What is your experience in relation to this role?"}, {"date": "28 Jun 2023", "title": "Digital Content &amp; Experience Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Save the Children UK (London, England) in Jun 2023", "Interview Descriptions": "Received an online invitation for an interview, was informed that there will be a second round of interview but after two weeks received an email that my application was not chosen. The interview was nice, quite relaxed and felt more like a conversation than an interview. There were two interviewers.", "Interview Questions": "Experiences from current role, experience in CMS and SEO."}, {"date": "8 Jul 2022", "title": "Volunteer Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Save the Children UK", "Interview Descriptions": "The manager was very nice and patient, she guided me to read the handbook very carefully. It was more like a kind daily conversation than a serious interview.  the procession was undertaken very fast.", "Interview Questions": "what makes you want to be a volunteer here?"}, {"date": "20 Jun 2022", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Save the Children UK", "Interview Descriptions": "1. Fill in the application form.\r\n2. Reference checking.\r\n3. Interviews are simple, starting with a telephone interview (Why do you want to work here), followed by a trial shift.\r\n4. Become a volunteer.", "Interview Questions": "Why do you want to work here?"}, {"date": "2 May 2022", "title": "Management Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Save the Children UK", "Interview Descriptions": "Competency based questions based on company values and competencies. Answers given using star method. 2 people on the interview panel taking turns asking the questions. Put time in to\r\nPrepping.", "Interview Questions": "Overview of you, why do you want this position, then 4-5 questions based on the values and competencies. "}, {"date": "14 Feb 2022", "title": "Senior Project Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Save the Children UK", "Interview Descriptions": "Phone call then first interview with the section manager snd another interview with panel of two they ask varies technical questions and do not consider those who do not come prepared with the task if you are set one to do.", "Interview Questions": "What  in your opinion is diversity? "}, {"date": "31 Oct 2021", "title": "Fundraising Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Save the Children UK in Oct 2021", "Interview Descriptions": "Very straightforward, fairly short interview, mainly competency-based questions. People were very nice and friendly, felt completely at ease throughout the whole process. None of the questions would come as a surprise if you completed general interview prep.", "Interview Questions": "Why do you want to work at Save the Children?\nWhy this role?\nTell us about a time you made a mistake and how you rectified it."}, {"date": "28 Mar 2022", "title": "Volunteer Sales Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at Save the Children UK in Apr 2021", "Interview Descriptions": "interview took a day and was more of a friendly chat really. asked questions like reason for volunteering, personal qualities, time management. trained on how to deal with customers and fellow team members.", "Interview Questions": "Why do you want to volunteer here"}, {"date": "17 May 2021", "title": "Media Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Save the Children UK in Mar 2021", "Interview Descriptions": "The experience was unorganised and felt very disrespectful. The questions asked didn’t match with the job description and it was very clear they were looking for a particular kind of candidate, which again wasn’t what the job description asked for eg) all the questions were based off journalistic experience, which wasn’t a requirement in the job description which simply asked for experience in media relations and PR. One of the interviewers was incredibly patronising and rude.", "Interview Questions": "What journalistic contacts do you have (exact names)"}, {"date": "7 Jan 2021", "title": "Content Producer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Save the Children UK", "Interview Descriptions": "Seemed quite disorganised being asked to interview the day after being contacted by HR.\r\n\r\nOne of the interviewers was quite combative and dismissive of any questions and answers outside their own job. A lot of questions were about safeguarding and bullying, which may be unsurprising considering the issues the charity has faced. \r\n\r\nStrangely there wasn't many questions about the actual job outside risk assessment.", "Interview Questions": "What does bullying mean to you?"}], [{"date": "14 Feb 2021", "title": "Partnerships Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Save the Children UK (London, England) in Dec 2020", "Interview Descriptions": "Shortlisting followed by a 1st stage interview and finally a 2nd/final stage one.\r\n\r\nI wasn't given much time to prepare for the interview. Literally got a call at 4pm inviting me to the interview the following morning. Wasn't given much time for asking questions (note: that one of the interviewers were late to join the interview, meaning less time).", "Interview Questions": "Why do you want to join Save The Children?\r\n"}, {"date": "9 Feb 2021", "title": "Senior Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Save the Children UK (London, England) in Mar 2020", "Interview Descriptions": "There was a panel interview followed by 1:1 informal interview with the head of unit.  The panel interview was with the role's line manager plus the person whose mat leave the role would be covering, which was a bit unusual.", "Interview Questions": "Fairly standard combination of my motivations for wanting the  job, what I'd bring and some questions to test my technical competencies."}, {"date": "12 Apr 2019", "title": "Digital Marketing Executive Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Save the Children UK (London, England) in Mar 2019", "Interview Descriptions": "The process was fairly quick. Within a week of the application deadline, I was invited to interview, which is managed on an online system, so choose your date/time straight away. I went in and answered their questions which were all standard and did a task of planning a campaign for fundraising for a fictional disaster. The interviewers seemed nice, however I have been ghosted since, which is highly unprofessional. I don't mind not getting the job, but I took time off work to interview here and would appreciate an automated rejection email at the very least, if not some feedback.", "Interview Questions": "Why do you think that child safeguarding is important?"}, {"date": "30 Sept 2021", "title": "LD Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Save the Children UK (London, England) in Feb 2019", "Interview Descriptions": "Started promptly, two interviewers. The interview was structured and questions were relevant. They were friendly and professional . The location is great, right in the heart of central London .", "Interview Questions": "Tell us about your leadership skills?"}, {"date": "26 Oct 2022", "title": "Income Accounting and controls officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. The process took 4 weeks. I interviewed at Save the Children UK (London, England) in Aug 2018", "Interview Descriptions": "I was interviewed by a person who manages the position I have applied for; Interview took place in the head office, was on time and lasted around 40 minutes; I was told this will be two stages interview, however I had only go through part one.", "Interview Questions": "How would you manage and prioritise a busy inbox"}, {"date": "17 Aug 2021", "title": "Project Manager Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Save the Children UK (London, England) in Apr 2018", "Interview Descriptions": "Four interviews - first, with HR; 2nd with HR and Hiring Manager, 3rd with Technical, and last, with department head. Exhaustive, informative, conversational. Technical and behavioral. Competency based and experiential. Allowed questions at the end.", "Interview Questions": "What is your motivation for the role?"}, {"date": "30 Apr 2019", "title": "Philanthropy Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Save the Children UK (London, England) in Apr 2018", "Interview Descriptions": "Interview was very relaxed but well structured, and the interviewers were friendly and not intimidating. The interview was competency-based with unsurprising questions, and interviewers responded encouragingly when I hesitated at some questions.", "Interview Questions": "Describe how you would managing balancing different briefs from different colleagues?"}]]