[[{"date": "11 May 2023", "title": "Clinic Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Allina Health", "Interview Descriptions": "The TA was horrible at getting back to me even just to tell me that they were looking at other candidates. They would tell me that I’ll hear back in a week and it would be two or three weeks. I gave up on them as a company and decided not to waste anymore of my time", "Interview Questions": "Why do you want to work here?"}, {"date": "3 Jan 2023", "title": "Pharmacist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Allina Health", "Interview Descriptions": "The entire interview was very professional in all aspects. I enjoyed learning more about the company, and everything it has to offer! Any questions I had were appropriately answered by the employee interviewing me.", "Interview Questions": "Tell me about your experience."}, {"date": "8 May 2023", "title": "Business Representative Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Allina Health (Saint Paul, MN) in Jan 2023", "Interview Descriptions": "Phone screening questions with recruitment who asked basic work background questions. Then if they approve of your answers you get a remote interview with manager. The manager will follow up with you in a week or two.", "Interview Questions": "Why do you what to work with this company?"}, {"date": "2 Nov 2022", "title": "Case Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Allina Health", "Interview Descriptions": "Meet with HR for a phone screen to see if you meet the qualifications of the position, then meet with the hiring manager to review key questions about the position. followed by a panel interview with the team to answer complex behavioral questions", "Interview Questions": "What is your definition of the role?"}, {"date": "4 Jun 2023", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at Allina Health (New York, NY) in Nov 2022", "Interview Descriptions": "I have many years of experience in a specialty area that I love. I decided to apply at Allina for the same specialty area I was already working in for a different facility because I desired a reduction in my work hours. I received an email from a recruiter very quickly after applying that they wanted to set up a phone interview with the department manager. The interview was so-so; it was over Teams and apparently there were technical difficulties on their end where they were hearing an echo after speaking (which I could not hear). The hiring manager seemed annoyed about this, the interview questions were strange (this was several months ago and I don't recall them off the top of my head), and the hiring manager seemed to have her mind made up about me seeing that I had only been at my previous job for about 2 years. She mentioned that and asked what it is I was looking for \"since you seem to jump around.\" I explained that I had not been able to obtain a desirable schedule at my last two jobs but the hours posted for this position would be a great fit for me and my family. I did not receive an offer, but was encouraged to continue to apply for open positions I was interested in. Over the next 6 months, I applied for the same department 7 more times. I was never offered another interview and would receive a rejection email fairly quickly after applying-so EIGHT rejections in about 6 months, in a specialty area I am experienced in and really loved. I was never offered any explanation as to why I kept getting rejected. I am now done wasting my time trying to obtain employment at Allina.", "Interview Questions": "N/A"}, {"date": "15 Nov 2022", "title": "RN Financial Clearance Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Allina Health (Minneapolis, MN) in Oct 2022", "Interview Descriptions": "Contacted same day by email requesting phone screen with recruitment after submitting application through hiring portal.  Scheduled phone screen very conveniently via an outlook calendar link for 5 days later. Recruiter was pleasant and knowledgeable about the position during phone screen which lasted about 15 minutes and was fairly general as far as interview questions. I was contacted by email the next day with a request for a video interview with the hiring manager which was scheduled for a week later. The video interview lasted almost an hour and had more details about the position and more behavioral interview questions. Hiring manager was pleasant and knowledgeable. Was very clear about follow up timeline expectations as well. Received an email from recruitment asking for follow up call several days later which led to a verbal offer. With some negotiating I accepted position several days after that. All in all time from application to receiving an offer was just over 2 weeks. \n\nVery positive experience that moved much quicker and more efficiently than many of the large Minnesota healthcare organizations I’ve worked with in the past. My only feedback would be for recruitment to have a clear idea of salary if they are going to discuss salary with candidates. This was discussed during my phone screen, but recruiter was clear that they do not set the salary and can only view a range for position. This led to a letdown when my offer was quite lower than the figures recruitment had mentioned during my phone screen, which was already lower than my original asking range. Overall I had a positive interview experience.", "Interview Questions": "Tell me about your strengths/weaknesses."}, {"date": "10 Aug 2022", "title": "Lab Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Allina Health", "Interview Descriptions": "Interview process was quick and simple. They were quick to set up a phone screening and then they were quick to set up a phone interview.  After about a day or so, I heard back from them and was offered a job.", "Interview Questions": "Where do you see your future?"}, {"date": "1 Aug 2022", "title": "Staff Psychotherapist Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Allina Health", "Interview Descriptions": "Met with a Clinic Director who asked me several questions about my years of experience and what I was looking for in the job.   Wanted to know about  a case that did not go well---to see if I could acknowledge my own mistakes/deficiencies.  Also asked about cases that had gone well.", "Interview Questions": "Tell me about a case that did not go well"}, {"date": "13 Feb 2023", "title": "Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Allina Health in Jul 2022", "Interview Descriptions": "Thorough individual and panel interview model that started with the recruitment office who weee very professional. The department leader was well prepared to screen and gave a great foundation for the role. The panel interviews were inclusive of many partner disciplines.", "Interview Questions": "How do you see nursing contributing to Technology growth in the future."}, {"date": "26 May 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 5 days. I interviewed at Allina Health", "Interview Descriptions": "Same as most other interviews: background experience, what you would do in specific circumstances, how you would deal with specific situations, examples of relevant  past experiences and how you handled them.", "Interview Questions": "Explain how would you let your co-workers know that you are struggling and need help."}], [{"date": "23 May 2022", "title": "RN CCU Unit Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Allina Health", "Interview Descriptions": "Very thorough, several people interviewed me via zoom. I went though 3 interviews with people from various departments. I felt as if I had a complete idea of what to expect and atmosphere of the unit. They answered my questions", "Interview Questions": "Best and worst experiences was a challenge "}, {"date": "16 May 2022", "title": "Rehab Aide Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Allina Health", "Interview Descriptions": "It was very informative and easy to converse. I was able to share my passions while my interviewer was very helpful and shared their perspectives in their experience. I was very excited to be able to interview for them and gain more perspective in my future position.", "Interview Questions": "My background in Volunteer aspects"}, {"date": "18 Apr 2022", "title": "ICU Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Allina Health", "Interview Descriptions": "I received a series of behavioral interview questions from the hiring manager & patient care supervisor(s), based on my previous experience as an RN. The interview also included a tour of the unit. One thing I did not have the opportunity to do was speak to members of staff already working there in order to learn more about the role for which I was interviewing specifically.", "Interview Questions": "Tell me about how you handle situations where you observe someone not adhering to an established policy, procedure or best practice."}, {"date": "2 Mar 2022", "title": "Tax and Treasury Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Allina Health (Minneapolis, MN) in Mar 2022", "Interview Descriptions": "I met with 3 individuals from the group. It was very conversational. They did not ask many questions but expected well thought out answers. Simple process. They were straight forward about what they were looking for and what the remainder of the process would entail.", "Interview Questions": "Why did you apply for this role at a non-profit?"}, {"date": "2 Nov 2021", "title": "X-Ray Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Allina Health (Overlea, MD) in Nov 2021", "Interview Descriptions": "The interview process was rather simple. It was an over the phone interview, where I was asked about my experience and interest in the field and working for the company", "Interview Questions": "Why did I chose the field of radiography"}, {"date": "21 Oct 2021", "title": "Per Diem Occupational Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Allina Health", "Interview Descriptions": "It was help via Zoom and it was quite pleasant. Interview with the manager and supervisor of the Rehab department for acute care and inpatient rehab. They are very kind and asked relevant questions.", "Interview Questions": "How do you manage or deal with a difficult patient?"}, {"date": "27 Mar 2022", "title": "Mlt Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Allina Health (Minneapolis, MN) in Sept 2021", "Interview Descriptions": "It went smoothly, the people were very nice.  There were no surprises during the interview. My questions were answered thoroughly by the end. I was able to find out if I was accepted soon after the interview.", "Interview Questions": "What does patient confidentiality mean to you?"}, {"date": "24 Aug 2021", "title": "Mls supervisor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Allina Health", "Interview Descriptions": "The interview was conducted by the site Lab Manager and that person's Administrative Manager. It was a virtual and in- person interview simultaneously. Covid has brought about many changes and this was one of them. I found the interview very succinct, informative, and more professional than some past interviews with other companies. I give the the overall process a very high rating. It was a positive challenging experience.", "Interview Questions": "How would you handle needing to approach a co-worker about an error that was made?"}, {"date": "13 Jul 2021", "title": "Administrative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Allina Health in Jul 2021", "Interview Descriptions": "It was quite a pleasant experience.  Everyone was welcoming and happy to talk to me, also very eager to tell me how proud they were of their department and Allina as a whole.  I was interviewing for pretty low level positions and Talent Acquisition and the managers and other staff in my interviews were very engaged and encouraging-it didn't seem like interviewing me was just an item on a to-do list.\n\nThey also followed up very quickly with each step of the process and any of my correspondence.  I never felt lost in the shuffle-very organized.", "Interview Questions": "N/A"}, {"date": "27 Jun 2021", "title": "Occupational Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Allina Health", "Interview Descriptions": "One video chat interview with 2 individuals from recruiting department and therapy staff supervisor. About a week later, I was called in for a panel interview in person with 3 employees of similar job title. After that interview, I received a tour of the facility.", "Interview Questions": "What has a difficult situation you found yourself in with a former employer and how did you handle it? "}], [{"date": "10 Aug 2021", "title": "Provider Coordinator Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Allina Health (Minneapolis, MN) in Jun 2021", "Interview Descriptions": "They contact you back very fast and they keep in touch throughout the whole process. Sometimes it takes awhile for them to get back to you after the interview process.", "Interview Questions": "What do you use to keep organized?"}, {"date": "29 Apr 2021", "title": "Provider Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Allina Health", "Interview Descriptions": "Very professional and didn’t take a long time to make a decision like other companies do. \r\n\r\nThey asked a lot of the “standard” interview questions and left a lot of room open for questions.", "Interview Questions": "What drew you to apply to this position? \r\n\r\nWhere do you see yourself in 5 years? "}, {"date": "20 Apr 2021", "title": "Psychologist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Allina Health", "Interview Descriptions": "Standard and simple. They look for a good fit. Based on a productivity model. They invited other psychologists to participate and ask questions. People were friendly.  Onboarding process seemed doable.", "Interview Questions": "They asked about previous experience. "}, {"date": "2 Mar 2021", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Allina Health", "Interview Descriptions": "The interview went smoothly! The recruiter called me to set up a phone screening first, which went well. Then, set up an interview with the hiring manager. Both the phone screening and interview went well. Everyone was so nice!", "Interview Questions": "When was a time you made a mistake and learned from it?"}, {"date": "12 Feb 2021", "title": "Licensed Massage Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Allina Health", "Interview Descriptions": "Interviewed and hired the next day. I interviewed in person and offered the position over the phone. I was interviewed by the manager and another staff member. It was a comfortable interview.", "Interview Questions": "What experience do you have?"}, {"date": "11 Feb 2021", "title": "EMT-BLS Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Allina Health", "Interview Descriptions": "I applied within 72hrs and got offered an interview with them the next day after the email. The initial interview lasted 30 minutes, with explanation of the job, benefits and pay, a start date if the next interviewer believes you are a good fit.", "Interview Questions": "Job experience, behavioral question relating to the job, scenarios that you had to deal with like handling situations under stress and ethical issues."}, {"date": "22 Mar 2021", "title": "Medical Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Allina Health (Minneapolis, MN) in Feb 2021", "Interview Descriptions": "My interview was conducted over Zoom during the pandemic. The entire process was extremely professional even with the alternative measures. The recruiter was very prompt with responses throughout the application process.", "Interview Questions": "What brought you to Allina?"}, {"date": "21 Jan 2021", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Allina Health (Minneapolis, MN)", "Interview Descriptions": "Long and tiresome. Keep hope it is a big org  so takes long.  I sent in an e-mail reminder and called them on two separate times. do not be afraid to be proactive. Great benefits.", "Interview Questions": "Your past experience and health experience. Your pros and cons. "}, {"date": "15 Jan 2021", "title": "Security Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Allina Health (Minneapolis, MN)", "Interview Descriptions": "Applied and received an email from the recruiter. Time and date for an interview were set up through email and had the first interview with the recruiter. Second interview with security leadership. They were very particular about answering the questions with very detailed examples and gave you time to think about answers before answering. Very comfortable interview.", "Interview Questions": "Give an in depth example of a time you had to deal with a difficult situation."}, {"date": "7 Dec 2020", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Allina Health", "Interview Descriptions": "Pretty basic interview questions. In person. Nothing very difficult if you study. Name a positive experience, name a negative experience, how do you handle difficult patients. etc.  I knew that day that I got the job.", "Interview Questions": "See above. If you use the star format you will be fine."}], [{"date": "6 Aug 2020", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Allina Health", "Interview Descriptions": "It was about an hour of phone interview. I was asked with some behavioral questions and description  of my routine in the hospital. The interviewer described what to expect in the position that I applied and gave brief background about the facility .", "Interview Questions": "Describe a time when a patient was upset about you and how did you manage it?\n"}, {"date": "20 Aug 2020", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at Allina Health (Minneapolis, MN) in Aug 2020", "Interview Descriptions": "I applied in February. HR interview took place in May. My interview with the Nurse manager was in August. The total interview process took six months, but keep in mind, this is Covid-19 time. People I was in contact with were very nice.", "Interview Questions": "Asked a couple questions regarding how I work with difficult coworkers and challenging patients."}, {"date": "13 Mar 2023", "title": "Business Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Allina Health in Apr 2020", "Interview Descriptions": "Normal interview process, introductions, interview questions, and interviewee questions. Usually meet with the manager as well as additional team members. Process was similar to other health care organizations, response to interview was quick", "Interview Questions": "Why are you the best candidate"}, {"date": "1 Mar 2020", "title": "Recruiting Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Allina Health", "Interview Descriptions": "phone interview for 15 min, then after a week in person interview.  it was not difficult.  first they wanted to know about me. then they asked interview questions,", "Interview Questions": "what do you expect from your manager"}, {"date": "25 Feb 2020", "title": "Leave of Absence Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Allina Health", "Interview Descriptions": "The interview itself was pretty standard. I was told I would hear something 10 days later. I followed up a few days after that and have received no response whatsoever nearly a week later. It is unfortunate that what seems from the outside to be a good company would allow the faces they present to job-seekers in their Talent Acquisition team to operate in a manner that is so highly unprofessional. It leads me to question if such dismissive behavior is the norm in this company.", "Interview Questions": "None of the questions stick out as being exceedingly difficult. "}, {"date": "11 Apr 2021", "title": "HIM Lead Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at Allina Health (Apple Valley, MN) in Feb 2020", "Interview Descriptions": "It went very well, tough questions and very in-depth. Felt confident and organized. I asked a lot about the job that helped me relax in the process. Very straightforward questions that didn’t surprise me. They explained that they had a tough candidate pool and it was going to be a tough choice.", "Interview Questions": "What are your current weaknesses "}, {"date": "31 Jan 2020", "title": "Nurse Practitioner Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Allina Health (Minneapolis, MN) in Jan 2020", "Interview Descriptions": "Phone interview, then an in-person interview with a panel. Interview took 45 minutes. There were about 12-15 questions total. Questions led to side discussions that were useful in establishing a connection with each panel member.", "Interview Questions": "Are you a self starter? How do you handle challenging patient care situations?"}, {"date": "9 Mar 2021", "title": "Medical Scribe Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Allina Health (Minneapolis, MN) in Dec 2019", "Interview Descriptions": "The interview process was pretty casual. I had a short interview, then an in person later about a week and a half later. One current scribe interviewed and asked pretty basic questions, then the hiring manager basically interviewed me about whether or not I was willing to commit a year by taking the position.", "Interview Questions": "What is a specific challenge you have faced and how did you overcome this challenge?"}, {"date": "14 Apr 2020", "title": "Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Allina Health in Dec 2019", "Interview Descriptions": "The interview was straightforward, and she asked pretty basic questions that were easy to answer quickly. She was very nice and answered all the questions I had for her at the end.", "Interview Questions": "Where do you see yourself in 2 years?"}, {"date": "29 Nov 2019", "title": "Paramedic Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Allina Health", "Interview Descriptions": "After an application online, I was quickly reached out to to set up a phone screening. After deciding a time that works they reach out and we had a 15 minute conversation before being invited to attend an in person interview.", "Interview Questions": "How has your past work history prepared you for this position?"}], [{"date": "4 Nov 2019", "title": "Laboratory Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Allina Health", "Interview Descriptions": "Interview process was very smooth. Interviewed with both the Laboratory Manager, and Laboratory Director. The interview process was very relaxed and management made the interview stress free. Interview questions were pretty standard and straight forward.", "Interview Questions": "Explain a time when you faced a difficult co-worker and how did you deal with it?"}, {"date": "19 Oct 2019", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Allina Health in Oct 2019", "Interview Descriptions": "Submitted my resume and application online. Received a phone call from Talent Acquisition, they gave a brief description of the position duties. They asked my expected hourly rate to make sure it was within range, then set up the in-person interview with the Department Nurse Supervisor.", "Interview Questions": "What do you expect from a supervisor?"}, {"date": "20 Sept 2019", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 days. I interviewed at Allina Health (Minneapolis, MN)", "Interview Descriptions": "I applied through an online application, and was invited to an interview with the Clinical Coordinator. A few days later I was invited back for a second interview with the lead RN and one of the doctors in the practice. Later that day I received an email asking to check references.", "Interview Questions": "Describe a difficult situation with a coworker and how you handled it."}, {"date": "5 Sept 2019", "title": "Senior Business Analyst Lead Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Allina Health", "Interview Descriptions": "Phone Interview with Human Resources recruiter then in person interview with hiring leader. Went over job role and responsibilities then went through questions. Discussed start date and work schedule.", "Interview Questions": "Tell me about a large project you've worked on and how you managed it?"}, {"date": "29 Jul 2019", "title": "Recruiter Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Allina Health in Jul 2019", "Interview Descriptions": "Applied and received a phone interview request only a few hours after I applied. The phone interview lasted 30 minutes, I thought it went well, and never heard back.", "Interview Questions": "If I had experience recruiting with metrics/goals."}, {"date": "14 Jun 2019", "title": "Human Resources Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Allina Health", "Interview Descriptions": "Two step process: first interview with 2-3 Management staff and second interview with panel of staff. The panel interview was challenging because it was difficult to get a feel for the team culture.", "Interview Questions": "general questions "}, {"date": "9 May 2019", "title": "TA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Allina Health", "Interview Descriptions": "Professional and straight forward, but not too stressful. The people were really welcoming and everything was well organized. The phone screen was nice, and the in-person interview was just as great as the phone screen!", "Interview Questions": "Tell me about your previous experience"}, {"date": "9 May 2019", "title": "Nurse Clinician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Allina Health (Saint Paul, MN)", "Interview Descriptions": "Was interviewed and hired within a week.  Several staff members popped in and out of the interview and asked questions.  Fairly standard interview questions, much of the interview was just conversational.", "Interview Questions": "How I handled a tough situation"}, {"date": "28 Aug 2019", "title": "Information Management Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Allina Health (Minneapolis, MN) in Apr 2019", "Interview Descriptions": "It was exactly like every interview I have ever been to before. They asked me professional questions about my experience and asks me questions to determine if I was a good fit.", "Interview Questions": "Tell us about a problem you encountered and how you solved it."}, {"date": "23 Mar 2020", "title": "Information Services Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Allina Health (Minneapolis, MN) in Mar 2019", "Interview Descriptions": "I was asked to prepare a powerpoint presentation and a very broad healthcare IT topic. It was a panel interview with about 6 interviewers from different departments. Very standard behavioral interview questions and was given a chance to bring up any additional information that I thought would be relevant. Easy going group and seemed like a very fair interview.", "Interview Questions": "Why are you interested in healthcare IT?"}], [{"date": "22 Mar 2023", "title": "Music Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Allina Health in Feb 2019", "Interview Descriptions": "Standard set of questions, not a lot of competition. Come in and sit down with some of the managers in the Owatonna branch. It's pretty casual. Wear business casual attire and bring your guitar to give them a little sample of what you will bring to the team.", "Interview Questions": "How do you take care of yourself when you work in an emotional setting?"}, {"date": "20 Dec 2021", "title": "Certified Nursing Assistant CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Allina Health (Minneapolis, MN) in Feb 2019", "Interview Descriptions": "It was good overall, it was not a bad experience. I enjoyed it. It was not too difficult. It was like the way other places do it. I shared impressions. Allowed each interviewer to share his or her impressions of each candidate based on verbatim notes", "Interview Questions": "what are your strengths ? weaknesses? "}, {"date": "7 Jun 2019", "title": "Recruiter Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Allina Health (Minneapolis, MN) in Feb 2019", "Interview Descriptions": "Panel interview in which they asked behavioral based interview questions,  It was more of a dialog, more informal, however I knew we were both evaluating each other.", "Interview Questions": "Behavioral based interview questions"}, {"date": "28 Nov 2018", "title": "Clinical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Allina Health", "Interview Descriptions": "It was a streamlined and efficient process. The HR staff were very friendly and approachable. The interview process included a clinic tour and meet-and-greets with clinic staff. Overall was low-stress.", "Interview Questions": "What do you look for in management?"}, {"date": "13 Dec 2018", "title": "Sterile Processing Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Allina Health (Minneapolis, MN) in Nov 2018", "Interview Descriptions": "We set up a phone screening interview call by exchanging some emails. No discussion about the job happened over email. She was a very nice lady and super easy to talk to. I was very comfortable talking to her like it was a friend on the other end of the line. It was a nice interview", "Interview Questions": "She asked me about my work history and availability . About my past experience in sterilization and working in BSL situations"}, {"date": "10 Jul 2018", "title": "Medical Laboratory Scientist -Minnapolis Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Allina Health (Minneapolis, MN) in Jul 2018", "Interview Descriptions": "I was called for interview by Human Resource within a week. I was interviewed by three managers. they asked average technical questions and the hiring managers are very friendly. The technical questions they asked is about gram stain scenario and what I would do if the physician ordered me to perform test on sample", "Interview Questions": "They asked me various questions about conflict resolutions, weakness, strength, why they have to hire me, my qualifications, why I want to work there, my previous mistake, what I enjoy least, and technical questions: about gram stain...."}, {"date": "22 Sept 2018", "title": "Staffing Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Allina Health (Minneapolis, MN) in Jul 2018", "Interview Descriptions": "I had  A very long wait in the lobby  before the  hiring supervisor arrived to greet and  escort me to the location where we would begin the interview. I was informed that this is typical for all interview applicants.", "Interview Questions": "Describe a time when you had to Take the initiative and resolve a difficult situation with a coworker "}, {"date": "26 Dec 2020", "title": "Medical Secretary Buffalo Hospital Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Allina Health (Buffalo, MN) in Jul 2018", "Interview Descriptions": "First interview was a phone screening.  Second interview was with the departmental manager, immediately followed by meeting the oncologist that I would be supporting at Buffalo Hospital.  \nBy the time that I started the position, the job duties had changed completely.  I also found out that they were trying to get rid of the oncologist which made me worried about job security, and at the same time, the other medical secretary made sure that I was not welcomed there.  I left after 6 months.", "Interview Questions": "Typical clerical interview questions asked.  "}, {"date": "3 Aug 2018", "title": "Clinic Access Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Allina Health (Minneapolis, MN) in May 2018", "Interview Descriptions": "I was first given a phone interview  by a person from corporate. She asked for employment background, knowledge and skills using various software, educational background. She gave an overview of the job that I had applied for such as number of hours, the location, and what would be required of me from the job. A week later, I was given a health screening interview regarding my immunization. Another week later, I get an interview with the supervisor and the lead of the position that I am applying for. Interview went great. I knew I lacked in experience but what I lacked in, I was willing to learn and improve.", "Interview Questions": "Tell me a little about yourself?"}, {"date": "27 Jun 2019", "title": "Systems Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Allina Health in Apr 2018", "Interview Descriptions": "Common interview questions. Talk about your strength, weakness, talk about yourself and so on. Only had two people during the interview. The hiring person was asking soft skill questions while the lead asked about technical questions.", "Interview Questions": "Tell us about a time you couldn't meet your deadline and how you handled it."}], [{"date": "28 Mar 2018", "title": "Nursing Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Allina Health (Fridley, MN) in Mar 2018", "Interview Descriptions": "Took almost a month to get a call from the hiring manager. I had to wait 30 minutes to be called in. I was told to arrive 10-15 minutes early as well. She asked me 2 pages of questions and then took me on a tour of the unit.", "Interview Questions": "Tell me about a time you had a conflict with a co-worker and how did you solve it?"}, {"date": "6 Jan 2018", "title": "Medical Laboratory Technician Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Allina Health (Edina, MN)", "Interview Descriptions": "Took about 3 weeks after applying to hear anything, was a very long process, i felt i didnt stand a chance because i was fresh out of college. The interview went great lasted an hour, showed me around the lab, introduced me to people who worked there, and i felt i for sure got the job. But in the end i did not.", "Interview Questions": "Questions about lab results and what would you do."}, {"date": "23 Nov 2017", "title": "Payroll Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Allina Health (Minneapolis, MN) in Nov 2017", "Interview Descriptions": "I applied directly on an online posting. 11/5. A week after applyung, I received a phone call and email for to schedule a phone interview ( I scheduled it for the following Monday). The phone interview was with an amazing recruiter, Caitlin. She asked a few questions about what I was looking for, my experience, and why I applied, also my salary requirements. She offered and scheduled an in person interview the same week. The in person interview was only with the manager. I was very nervous yet the interview was comfortable  (more like a conversation). It was an hour long. My interview was on a Friday, I was asked for references on a Monday, then offered a position on Tuesday.", "Interview Questions": "3 strongest skills?"}, {"date": "16 Oct 2017", "title": "Pharmacist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Allina Health (Saint Paul, MN)", "Interview Descriptions": "First was the phone interview which was followed by an onsite interview 2 weeks later. The phone interview was with 2 supervisors. The second interview consisted of 2 panel interviews The first panel comprised of 2 supervisors. The second panel comprised 2 pharmacists", "Interview Questions": "Why should we hire you for this position/"}, {"date": "4 Oct 2017", "title": "Nursing Support Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Allina Health", "Interview Descriptions": "Fairly easy and smooth. Professional and relaxed. It helps to practice before going to these interviews. Just be ready to be yourself and be confident!  The facility I'll be working at seems like a well organized place and everyone seems friendly. Thats the kind of work environment I was expecting.", "Interview Questions": "Tell me about a time when you went over and beyond for a client or consumer/patient?"}, {"date": "30 Sept 2017", "title": "RN Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Allina Health", "Interview Descriptions": "phone interview, asked a couple of basic questions regarding my resume and prior work experience. Asked about what hospitals/clinics i was interested in working at, shift preference, and location of interest", "Interview Questions": "why do you want to work for us"}, {"date": "24 Sept 2017", "title": "Patient Registration/Scheduler Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 7 weeks. I interviewed at Allina Health (Burnsville, MN) in Sept 2017", "Interview Descriptions": "Filled out an application online. A recruiter called me to set up a face to face interview with the manager of the department. The interview was about 30 minutes. I got to see the schedule I would be working and got to know a little bit about the environment I would be working in. The manager was professional, nice, and gave me her card with her number and email if I had any questions while she made her decisions.", "Interview Questions": "What would you do if a patient called you and said they were experiencing chest pain and shortness of breath?"}, {"date": "5 Dec 2017", "title": "Psychiatric Technician Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Allina Health (Fridley, MN) in Sept 2017", "Interview Descriptions": "I applied online and heard back quickly for an in-person interview.  The interview was one on one with the head nurse.  Typical questions about experiences and how you would react to certain situations.", "Interview Questions": "What experience do you have?"}, {"date": "17 Aug 2017", "title": "RN Nurse Supervisor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Allina Health (Minneapolis, MN) in Aug 2017", "Interview Descriptions": "about an hour long with 2 people.  One was a RN Supervisor, the other was the director for the hospital. Explained the role, hours, and schedule clearly.  They asked for examples from my experience for compassion, cultural diversity, teamwork, and how I dealt with a difficult patient.", "Interview Questions": "How did I deal with a difficult patient?"}, {"date": "20 Jul 2017", "title": "Mental Health Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Allina Health", "Interview Descriptions": "HR calls and completes a brief interview. Asks if you'd like to interview with manager. Interview with manager. HR offers the job over the phone to you a few days later.", "Interview Questions": "Tell me about a time when you handled a situation well when working with a patient/client."}], [{"date": "21 Jun 2017", "title": "Mental Health Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Allina Health (Saint Paul, MN)", "Interview Descriptions": "Very smooth and relaxed. They tell you exactly where to go and what to do when you get there. It was nice not to feel lost. When going into the interview, the interviee was kind and explained building to me on our way to the meeting.", "Interview Questions": "why did you apply to Allina? "}, {"date": "14 Sept 2021", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Allina Health in Jun 2017", "Interview Descriptions": "It was a relatively formal to informal process. The managers were already well aware of my qualifications. I believe great candidate would be able to complete it given the appropriate background and job title.", "Interview Questions": "Tell me about yourself and why you're interested in this role. "}, {"date": "15 May 2017", "title": "Medical Laboratory Scientist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Allina Health (Minneapolis, MN) in May 2017", "Interview Descriptions": "I got a phone call from HR to set up the interview day after 2 weeks of applied. Interview questions were fairly easy. One on one with the lab manerger.   Basic behavior questions and give real example on how you handle the situation. Two days later they asked for min 2 reference. And they offered job over the phone right after they received my references.", "Interview Questions": "What is your ideal manager? What is your strength? What is your accomplishment in your career that you are most pround of? "}, {"date": "5 Oct 2020", "title": "Nutrition Services Aide Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Allina Health (Saint Paul, MN) in May 2017", "Interview Descriptions": "Multiple people sit down and ask questions about past experiences and how you dealt with conflicts or issues. They also talk about the schedule and how the shifts are oriented.", "Interview Questions": "How did you handle a difficult situation at your previous workplace?"}, {"date": "1 May 2017", "title": "Nursing Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Allina Health", "Interview Descriptions": "Applied with references. Contacted within 2 weeks for an interview. Went in for a 20-30min interview. Called back a couple days later to look at my references. Overall it was a very pleasant and comforting experience. The manager was very nice and did not want to come off as intimidating in the interview. Just go in with confidence and be honest and you will be okay!", "Interview Questions": "They gave me a scenario with 3 different situations and I had to tell them in which order I would complete them. "}, {"date": "15 Apr 2017", "title": "Contract Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Allina Health in Apr 2017", "Interview Descriptions": "There are no directors in the department at this time, or other senior leadership for this area.  Therefore the interview was conducted with the other Contract Managers at one time.  Interview lasted for about one hour, and a final decision has not been made that I am aware of.", "Interview Questions": "Describe project management tools you have used in the past."}, {"date": "2 Jun 2017", "title": "Media Tech Specialist Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Allina Health (Minneapolis, MN) in Apr 2017", "Interview Descriptions": "First round interview was a video conference with 2 supervisors. Second round interview was in person with 1 supervisor and co-workers.  The supervisors seemed a bit stand offish and not interested to be in the interview process. The co-workers were friendly, hand great questions to ask, answered  my questions well, and took great interest.", "Interview Questions": "Questions mostly based on previous experiences.  Also asked many questions regarding keeping busy in slow times and customer interaction. "}, {"date": "28 Mar 2017", "title": "CMA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Allina Health (Lakeville, MN)", "Interview Descriptions": "The interview process was wonderful. Very easy and laid back. Met alot of the lead nurses and toured the facility. Everyone was very friendly. Met with just the clinic manager first then they added in a few lead nurses. It was nice to get the feel of the atmosphere during the interview.", "Interview Questions": "What would you bring to Allina to make it better?"}, {"date": "6 Mar 2017", "title": "Human Resources Records Coordinator I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Allina Health", "Interview Descriptions": "I was brought in for multiple interviews. Met with two different managers who were very nice. Took a long time to hear back. Hiring process is very slow. Two interviews (in 4 weeks), then reference checks (1 week), then I was offered over the phone a week after that.", "Interview Questions": "Q) Tell us about a time where you and a co-worker had a conflict. What was the resolution?\r\nQ) Tell us about a time where you went above and beyond for a customer.\r\nQ) What do you look for in a manager?\r\nQ) Describe what teamwork means to you."}, {"date": "15 Apr 2017", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Allina Health (Minneapolis, MN) in Mar 2017", "Interview Descriptions": "The interview only took about an hour. The hiring manager took me on a tour of one of the floors, then we sat down in his office to do the official interview. He asked questions that prompted me to tell stories about past patient situations, and took notes as I spoke. I was told the options for shifts that they had available and was basically offered a job after the interview was over. Very laid back and friendly!", "Interview Questions": "Tell me about a time when you had too many tasks to complete at once, how did you handle it? "}], [{"date": "16 Jan 2019", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 days. I interviewed at Allina Health (Coon Rapids, MN) in Mar 2017", "Interview Descriptions": "It was your standard interview in person; 1:1.  They asked questions about my personal strengths and \"areas for improvement.\"  They asked my goals, the typical \"where do you see yourself in 5 years\" stuff.   The people that interviewed me were very nice, and their positive and welcoming feedback brought out the best in me.", "Interview Questions": "Strengths as an RN/worker."}, {"date": "17 Mar 2017", "title": "Staff RN Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Allina Health in Mar 2017", "Interview Descriptions": "Interview process was easy. I got the feeling pretty quickly that I was not what they were looking for in that particular unit. The interviewer was very professional and still gave me a tour and answered my questions.", "Interview Questions": "What has been one of the hardest things you have experienced in the clinical setting?"}, {"date": "17 Feb 2017", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Allina Health in Feb 2017", "Interview Descriptions": "Short, easy interview if you work for the company; otherwise can be hard unless you know someone. Very professional, and they ask you not too many questions. It depends on the department manager if you get a job.", "Interview Questions": "Clinical stuff like degree of needle for IM injection, or how to treat a walk in patient with hypertention"}, {"date": "22 Jan 2017", "title": "Technical Consultant - Contractor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at Allina Health (Minneapolis, MN)", "Interview Descriptions": "Very easy going. They like people with people skills and obviously someone who is still quite tech-savvy. Went through a recruiter and received word back from the hiring manager the same day.", "Interview Questions": "How would you handle a situation where a user asks you a question and you don't have the answer?"}, {"date": "8 Mar 2017", "title": "Licensed Practical Nurse Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at Allina Health (Minneapolis, MN) in Jan 2017", "Interview Descriptions": "The interview was a 2 part interview that has multiple questions with differentiation patient care scenarios. The first interview was more easy going the second interview was all difficult questions.", "Interview Questions": "Can you think of a time when jad to help a patient navigate through the health care system?"}, {"date": "14 Jan 2017", "title": "Lab Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Allina Health (New York, NY) in Dec 2016", "Interview Descriptions": "Very casual interview. Didn't get asked many questions. We mostly talked about the lab manager and the work environment he created. Wasn't able to get the job duento conflicting schedule.", "Interview Questions": "Why do you want this job?"}, {"date": "16 Dec 2016", "title": "Lpn Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Allina Health (Minneapolis, MN) in Dec 2016", "Interview Descriptions": "Went well. Easy to set up, find and didn't take longer than expected. Nice people and easy to get along with. I don't really know what else to say. Took awhile to hear back from anyone.", "Interview Questions": "Best and worst things about LPN"}, {"date": "15 Nov 2016", "title": "Nursing Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Allina Health in Nov 2016", "Interview Descriptions": "Applied, called me for interview request (in-person) maybe 20 min interview, request for references need at least 5, then offer a few days later. Make sure to arrive early and bring validation ticket. I got lost, but since I was early I arrived on time lol.", "Interview Questions": "Tell about a time you've advocated for a resident?"}, {"date": "7 Jul 2016", "title": "Security Officer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Allina Health", "Interview Descriptions": "Easy, but the hiring manager seems to be a creep! Asked very illegal questions such as age and other discriminatory questions. Would recommend working for Allina just had a bad manager interviewing me I think he was new to the whole process...", "Interview Questions": "Tell me a time you were confronted with a difficult task and what did you do?"}, {"date": "21 Jun 2018", "title": "Physician Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Allina Health (Minneapolis, MN) in Jul 2016", "Interview Descriptions": "Applied online and received contact for a phone interview within a couple days.  Had phone interview and was told I receive a phone call with information for the in-person interview in the next 3-5 days.  Heard nothing at 1 week, so called them and was told they were still waiting to hear from their physicians.  After that, did not hear anything for 2 weeks so at that point, I just dropped it.  I can handle getting the \"Thanks, but no thanks,\" but at least have the courtesy to call the applicants back and provide that answer when you have given the applicant a timeline.", "Interview Questions": "Why do you want to work for Allina?  Tell us about your previous experience."}], [{"date": "28 Jul 2016", "title": "Advanced Practice Provider (NP/PA) Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Allina Health (Minneapolis, MN) in Jul 2016", "Interview Descriptions": "Applied online. Received email request for a phone interview within a few days. Phone interview was very straightforward. Recruiter said she would email the benefits package after our conversation. Never received it. She also said she would be in touch within 3 days to schedule in-person interview. It's been over 2 weeks and never heard anything - not even a decline email.", "Interview Questions": "\"Tell me about yourself.\""}, {"date": "26 Jun 2017", "title": "Dietary Aide Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Allina Health (Hastings, MN) in Jun 2016", "Interview Descriptions": "The interview process went well. The HR from Allina contacted me within a week after I applied for the position. I scheduled for the interview and afterwards received the news that I got the job offer.", "Interview Questions": "What interested you about the job/why did you pick the position?"}, {"date": "26 Aug 2017", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Allina Health (Fridley, MN) in Apr 2016", "Interview Descriptions": "Called for a screening, quick interview with unit manager and shown around the hospital. The interview lasted for 30 minutes to an hour and was very casual. Interviewer was relaxed and made it seem more like a conversation.", "Interview Questions": "Name a time when you weren't successful and how you handled it"}, {"date": "26 Jul 2016", "title": "Talent Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Allina Health (Minneapolis, MN) in Apr 2016", "Interview Descriptions": "The interview was mediocre. the questions they ask were general and not related to the position. The HR was sick and the second individual involved was irrelevant to the interview. I was not told that the building was difficult to find and that it would be a random building. So the communication part was hell.After waiting almost 3 months to heard back with NO response I finally got a call today that they went with someone else who was more experience which I understood it was the process in making someone wait almost 3 months before telling a candidate that they were no longer of interest. The Hr even called me a second time randomly one night to ask me if I was still interest then she calls me 1 month later to tell me \"oh the position was filled\" how unprofessional", "Interview Questions": "If you are ask to take on additional task and you were already behind on some work what would you do?"}, {"date": "27 Oct 2016", "title": "HIT Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at Allina Health (Minneapolis, MN) in Apr 2016", "Interview Descriptions": "It was fairly easy, questions were the typical interview questions. The supervisor did a good job on describing the different positions that they had available and the responsibilities. Interview was straight forward, no hard interview questions.", "Interview Questions": "What is my weakness?"}, {"date": "13 Mar 2016", "title": "Patient Access Navigator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Allina Health", "Interview Descriptions": "Interview with manager and a supervisor, they were very nice and the process seem like your talking to a friend. Both of them ask questions and the conversation went on very smooth.", "Interview Questions": "How do you deal with a co-worker regarding a problem?"}, {"date": "21 Mar 2016", "title": "Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 5 weeks. I interviewed at Allina Health (Minneapolis, MN) in Feb 2016", "Interview Descriptions": "Your application/resume can get swallowed into the recruitment bucket for a long time. Once contacted, I was scheduled for an interview promptly. After being interviewed, would prefer if they could let a candidate know they will not be pursued as early as this is identified -  I was interviewed for two positions and both were filled by internal candidates. For one of the positions, and this could have been a mis-understanding on my part, I believed I was going to be scheduled for a second interview with a panel. When I followed up with the hiring manager, I was told they were offering the position to the internal candidate. I have interviewed many job candidates and believe in treating them in the same manner I would like to be treated - don’t lead them on in thinking they are still in the running if they aren’t.", "Interview Questions": "Describe the difference between management and leadership."}, {"date": "28 Feb 2016", "title": "Service Desk Technician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 2 days. I interviewed at Allina Health in Feb 2016", "Interview Descriptions": "Hire though employment agency. Panel interview with General Manager and 4 other managers. They go over your experience and resume. Then they each have 5 prepared sheets that they go over one person asks the question while the others write things down what they liked.", "Interview Questions": "A client calls in with a laptop that cannot connect to the intranet, What is the process that you go through to solve?"}, {"date": "28 Jan 2016", "title": "E-HIM Spec I and II Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Allina Health (Minneapolis, MN) in Jan 2016", "Interview Descriptions": "Interview was conducted by two late-twenty somethings. Interview was lackluster. Easily apparent that both had little experience, were poor communicators, managers, or all of above. No HR present. Unprofessional. Lasted about 30 minutes. Waste of time, a “mill” type job. Questions very basic and read off a sheet.", "Interview Questions": "Describe your greatest accomplishment in your career."}, {"date": "25 Jan 2016", "title": "Business Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Allina Health (Minneapolis, MN) in Dec 2015", "Interview Descriptions": "The two people I met with were nice, but felt as if they were just going thru the motions. The one guy didn't turn his cell phone off, so that interrupted the flow and was distracting. \r\n\r\nNo follow up after interview, just left hanging, even after I sent an email asking about the status.", "Interview Questions": "A lot of behavioral questions, not much about skills or experience"}], [{"date": "6 Feb 2018", "title": "Business Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Allina Health (Minneapolis, MN) in Dec 2015", "Interview Descriptions": "The process was easy and fast. I applied and was offered the job in 3 weeks. The Hr person was transparent and answered all of my questions. I only had one in person interview.", "Interview Questions": "Tell me about a difficult experience with another coworker?"}, {"date": "9 Nov 2015", "title": "Buyer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Allina Health (Minneapolis, MN)", "Interview Descriptions": "I applied in-online, got a call from HR did a phone interview, a couple month later got an email requesting to interview in person, Interviewed with with two people, one a direct report and another department manager.  The process took longer then expected because the first considered an internal candidate for the position.", "Interview Questions": "How do you deal with, how do you keep organized, what interested you about the job, tell me about yourself\r\n\r\nthe interview was average interview questions and nothing stands out that was tricky or hard to answer."}, {"date": "12 Sept 2015", "title": "Patient Access Navigator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Allina Health (Minneapolis, MN)", "Interview Descriptions": "The interview process was pretty easy and it consists of behavior questions. A supervisor and a manager interview me. They wasn't intimidating or anything, instead they were very nice and welcoming. They make the interview process fun and I didn't feel like I was at an interview, instead I feel like I was talking to my friend/ co-workers.", "Interview Questions": "How do you handle stress?\r\nName a weakness/ strength that you have?\r\nHow do you handle complicated/ mean customer?\r\nTell us a little bit about yourself?"}, {"date": "11 Aug 2015", "title": "Licensed Practical Nurse Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. I interviewed at Allina Health", "Interview Descriptions": "know the 5 rights of medications, why do you want to work here? Many situational type questions  (tell me about a time when ...), hardest question on the spot \"how did you show respect to your coworkers recently\" really threw me for a loop after thinking of nursing stuff.", "Interview Questions": "Does it matter what Suze needle you use for an IM injection? Why or why not"}, {"date": "6 Aug 2015", "title": "Patient Access Liaison Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Allina Health (Minneapolis, MN) in Aug 2015", "Interview Descriptions": "applied online, received a call about two days late. Received in person interview two weeks out from interview. Interviewers were late. Not professional at all, they asked very generic questions. In all it was 20 minutes long. I was a little disappointed. I felt that the job was misleading in the description. I interview with more than one person and both were friendly. Very nice company and lobby.", "Interview Questions": "When was a time that you suggested a change to your manager?"}, {"date": "2 Sept 2016", "title": "Executive Director Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Allina Health (Cambridge, MN) in Jul 2015", "Interview Descriptions": "The phone interview was very easy. Just simple questions about myself and what I can offer. The in person interview was very casual and the manager was nice. I accepted the offer and was in training but the staff did not treat me right so I left. I loved the company and what they had to offer but the nurses there were not friendly.", "Interview Questions": "Why did you choose Allina?"}, {"date": "26 Jun 2015", "title": "Certified Nursing Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Allina Health (Minneapolis, MN) in Jun 2015", "Interview Descriptions": "Very easy going interview with a manager that was nice and was not intimidating, like most managers. I applied online in April and was contacted by HR recruitment in June. The manager was very soft spoken. She told me that if I got the job, I will receive a phone call. After I got the phone call, I had to have previous co-workers and managers fill out a survey about how i work", "Interview Questions": "Where do you see yourself in five years?\r\nWhat will you do if you had a conflict with a co-worker?\r\nWhat is one thing that you need to work on?\r\nWhat will your previous manager/co-workers say about you?\r\nWhy are you no longer working at your previous job?\r\nName a time you went out of your way for a patient?\r\nWhat would you do if you are having a bad day?"}, {"date": "25 Jul 2015", "title": "Patient Registration Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Allina Health (Saint Paul, MN) in May 2015", "Interview Descriptions": "The interview process process starts out with tell us a little about yourself. There was no stress the supervisors were very friendly. They basically want you to walk them through your resume. The manager was very nice and inviting. when that happens its important because i believe it will determine how you interview. Make sure you give specific details.", "Interview Questions": "Have you ever had an issue with keeping information confidential?"}, {"date": "29 Nov 2017", "title": "Hospice RN Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Allina Health in Mar 2015", "Interview Descriptions": "Was hired from within the company, went smoothly.  There are always a lot of openings here because of the higher turnover rate in the area I work in.   Not sure what the industry standards are for this.", "Interview Questions": "What have you struggled with in the past. "}, {"date": "24 Mar 2015", "title": "Business Services Supervisor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Allina Health in Mar 2015", "Interview Descriptions": "Recruiter called to set up interview. Meet with 2 individuals who asked a list of questions. Very comfortable atmosphere. Most questions were asking for past scenarios or how you would handle a given situation. They explained the clinic and position very thoroughly. Also left time for questions from me.", "Interview Questions": "Many situational questions - Tell me about a time..."}], [{"date": "4 Nov 2015", "title": "Patient Access Navigator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Allina Health (Minneapolis, MN) in Feb 2015", "Interview Descriptions": "I received a call and email to schedule a date for an interview. I was interviewed my two persons. The interview lasted for 15  to 20 mins.  After the interview process, I received another call within a week or two later for a job offer. I had to submit a list of references and other supporting documents.", "Interview Questions": "Why Allina Health?"}, {"date": "16 May 2016", "title": "Business Services Supervisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Allina Health (Saint Paul, MN) in Feb 2015", "Interview Descriptions": "Phone interview with HR coordinator first, then an in person interview with HR generalist and leadership personnel a week later. The in person interview took about an hour. The interviewers were kind and professional. They encouraged questions. Quick follow up on decision.", "Interview Questions": "How much leadership experience do you have"}, {"date": "1 May 2016", "title": "Heatlhcare Cook Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 5 days. I interviewed at Allina Health (Houston, TX) in Feb 2015", "Interview Descriptions": "Very professional. Set time for interview and spoke on beniffits, medical , dental, salary and hours need that where require. Days that are essential as far as Holiday, sick days and the probation time which was three months.", "Interview Questions": "How many hour where you bale to work per week. Did I have reliable transportation and would there be a problem reporting to work. What my job duties are."}, {"date": "18 Dec 2014", "title": "Business Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Allina Health in Nov 2014", "Interview Descriptions": "Contacted within 3 weeks of applying on-line.  Role didn't even fit the job description nor the experience level.   Interviewer didn't turn off her phone and listened to a non-related voice message interrupting the flow of the interview.  Very disappointing overall interview and then not even a follow-up note.", "Interview Questions": "Very basic interview.   After hearing the role description, \"describe your relationship with the customer\"."}, {"date": "24 Sept 2014", "title": "Registered Nurse (BSN) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Allina Health (New York, NY) in Sept 2014", "Interview Descriptions": "Was interviewed for the new grad program. Had the interview on Friday they called and said they wanted to move forward that day. They sent the email for references and you send it out to your references asap. On Tuesday the company had sent my results from the references to Allina. And that day I got the offer for the job!!", "Interview Questions": "If I were to talk with your supervisor what would they say?"}, {"date": "16 Apr 2015", "title": "Desktop Technician Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Allina Health (Minneapolis, MN) in Sept 2014", "Interview Descriptions": "It really wasn't a interview. It's more just chatting about your life and some past experience. I was in the interview approximately 20 to 30 minutes. I believe they just need a body to fill the role and not caring about who they are hiring.", "Interview Questions": "What do you prefer? Windows 7 or Windows 8.1?"}, {"date": "19 Jun 2014", "title": "Environmental Services Aide Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Allina Health", "Interview Descriptions": "In wasn't very extensive. They thought I was a hard worker so they hired me. They basically asked me if I would be willing to learn the protocol and rules and of course because I wanted the job I said yes.", "Interview Questions": "N/A"}, {"date": "30 Nov 2017", "title": "Recruiting Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Allina Health (Minneapolis, MN) in Jun 2014", "Interview Descriptions": "Online application, resume submission, phone screen, in person interview. That said I did not receive follow up from the interview and needed to call.  Ultimately, I was offered another position but it was strange not hearing any thing for a while.", "Interview Questions": "There really were no surprise questions..."}, {"date": "21 Aug 2018", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Allina Health (Minneapolis, MN) in May 2014", "Interview Descriptions": "The interview process was great. I was interviewed  by the patient care manager and she made the interview process very informal. The entire interview lasted one hour. I also met with some of the staff members and discussed what a typical day is like.", "Interview Questions": "What is your greatest opportunity? "}, {"date": "11 Apr 2014", "title": "Business Analyst Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Allina Health", "Interview Descriptions": "Fast and efficient; very pleasant experience", "Interview Questions": "N/A"}], [{"date": "5 Nov 2018", "title": "Physician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. I interviewed at Allina Health in Mar 2014", "Interview Descriptions": "Mainly my previous experience, questions I had.  They did their do diligence checking my references. I was given a tour of the facility.  Different people within the organization informed me of the requirements and benefits.  I had a chance to meet many providers on the same day.  In the evening, there was a dinner and a lot of associates came to meet and greet. The process was very pleasant and welcoming.", "Interview Questions": "I don't remember specifics, but remember if was minding the cold weather."}, {"date": "18 Mar 2014", "title": "Nursing Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Allina Health in Feb 2014", "Interview Descriptions": "I applied off of Allina.com . A recruiter contacted me initially with questions. Recruiter made a second contact with me to set up appointment to meet with hiring manager. Interview was smooth, manager friendly, easy to talk with. Interview more conversational than intimidating.I thought it was an easy interview process.", "Interview Questions": "Interviewer asked me to describe a time when my integrity was tested."}, {"date": "25 Nov 2015", "title": "Senior Scientific Advisor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Allina Health (Minneapolis, MN) in Feb 2014", "Interview Descriptions": "They flew me up for a tour around the city, interviewed with about 3 individuals after a tour of the lab. My fiancée was so impressed that they wanted to fly me in for the interview and it was a classy touch. I don't believe any question was out of the norm thought processes of an interview.", "Interview Questions": "How do I work best?"}, {"date": "9 Feb 2014", "title": "Medical Lab Scientist/CLS Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Allina Health (Minneapolis, MN) in Jan 2014", "Interview Descriptions": "I applied online and got an interview scheduled with hiring manager at Abbott Hospital. A week later, the hiring manager called me late. Questions asked were behavioral, experience, and two technical situation. Manager also had her little helper ask questions that were written up before hand. Overall, I did not get a good vibe from the manager and the culture at that lab hospital. Uniforms are to be a certain blue color and you have to pay for parking. After that, her little helper even asked me for my transcripts. I've never applied to a job that required that and I graduated from college 3 years ago. WTH?! I should have asked if they wanted my 3rd grade report card as well. lol.", "Interview Questions": "What is your ideal workplace? \r\nDo you like it busy at work or easy?\r\nIf you saw GNC on gram stain, and the culture grew Staph, what would you do?\r\nIf you had a rectum swab for Chlamydia/GC testing, would you run it?\r\n"}, {"date": "2 May 2018", "title": "Scheduling Coordinator Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Allina Health (Saint Paul, MN) in Jan 2014", "Interview Descriptions": "Standard process nothing major training is long and boring. Really is a waste of time to train at main office. Might as well have trained at actual worksite. The training is my biggest problem. Coworkers were pleasant, very professional employees. Just be yourself if your a good fit you will get the job. Don't forget eye contact.", "Interview Questions": "What make you a great fit for this position?"}, {"date": "18 Mar 2014", "title": "Patient Access Liaison Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Allina Health (Minneapolis, MN) in Dec 2013", "Interview Descriptions": "The interview process was relatively easy. I was brought in to interview with two of the supervisors of the contact center. We went over my resume and my education and work experience. After that they had a battery of questions that we went through gauging how I would work in a direct contact role with patients, how responsive I would be to changes in the work environment, what my past work history has taught me, etc. It was all very standard; The second interview was very much like the first, except this one had the manager who oversaw over 200 employees and a mock phone call. This was to get a sense of how I would conduct myself when I was actually on the phone. Very easy stuff.", "Interview Questions": "What was one aspect of your previous job that you didn't like?"}, {"date": "7 Nov 2013", "title": "Business Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Allina Health (Minneapolis, MN)", "Interview Descriptions": "Interview process consisted of 2 interviews.  One with two seniors from team and the second with the team lead.  The first interview really touched on knowledge level as well as ability to fit in with the team.  The second with the team lead is just to reaffirm the information from the first.", "Interview Questions": "Where do you see yourself in five years."}, {"date": "8 Jul 2014", "title": "CAS II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Allina Health (Elk River, MN) in Oct 2013", "Interview Descriptions": "I had only one interview which went really well. I liked the two people that interviewed me. I found out later that they were not people who had a lot of patience. I had to do the job exactly as they wanted while others were doing the job differently and still getting the job done properly.", "Interview Questions": "They did not ask any hard questions."}, {"date": "21 Feb 2014", "title": "Coding Specialist III Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Allina Health (Minneapolis, MN) in Aug 2013", "Interview Descriptions": "It took them a long time- several months - to contact me for an interview. Once they did, though, I got one scheduled within a week or so. I had a panel interview. I also took a coding test. I got a call offering me the job in about another week or so.", "Interview Questions": "The coding test was probably the toughest part of it, as I had not had a coding job before. I simply prepared by going through my coding textbooks and notes from my classes."}, {"date": "28 Oct 2016", "title": "Emergency Department Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 5 days. I interviewed at Allina Health (Minneapolis, MN) in Jun 2013", "Interview Descriptions": "The interview was a panel interview. A manager, a supervisor, and 2 co-workers. I didn't know it was going to be a panel interview so it was a little unnerving to walk into a group. It was a very standard interview. One person asked a question off of a sheet and wrote down the answer, then the next person read the next question, and so on. \r\n\r\nThe people and the process was pleasant and professional overall.", "Interview Questions": "Very typical questions, What is one strength? What is a weakness? and so on."}], [{"date": "23 Sept 2016", "title": "Licensed Practical Nurse Clinic Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Allina Health (Minneapolis, MN) in May 2013", "Interview Descriptions": "IT took approximately 2 weeks for the process, a recruiter calls you first for a basic phone interview and then you are set up with the manager of that department.", "Interview Questions": "Standard Questions where asked"}, {"date": "30 Jun 2015", "title": "Mental Health Associate Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 days. I interviewed at Allina Health (Minneapolis, MN) in Apr 2013", "Interview Descriptions": "I got a phone call from the hiring manager and had a phone interview first that asked the basic interview questions one would expect.  Nothing Sticks out as an irregular question.  From there I got a phone call a couple of days later asking me to come in for an in person interview.  The position is in locked mental health units so I had to pick up a phone and ask for the manager I was interviewing with, which was a little intimidating.  I interviewed with two different managers, who also asked pretty basic questions.", "Interview Questions": "Tell me about your customer service experience?  "}, {"date": "5 Oct 2014", "title": "Patient Access Liaison Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Allina Health (Minneapolis, MN) in Mar 2013", "Interview Descriptions": "It was a low-stress interview. The manager was very kind and personable, non-intimidting. They are interested in who YOU are as a person and not just what you can bring to the company, but finding a spot that is mutually beneficial. \r\nThe interview started with the manager going in-depth of who Allina is and what the position entails. She then took a quick moment to ask how interested I was in the position, when I said very, she continue. \r\nShe asked about past customer experience, even if not healthcare related, and asked about personal situations/stories where I had to diffuse a situation, calm a client, and use critical thinking in the moment. \r\nThere is a typing speed test, that is very easy. \r\nThe interview was only about thirty minutes. I know the interview process for my department has changed slightly. It is now a two-step process with an initial interview with the person who would be your direct supervisor, and if you progress past that round, you are interviewed by two managers who are much higher up. You don't interact with them as much on a daily basis, but they essentially manage the department and the supervisors in the department. \r\nThey assign a recruitment officer to walk you through the process from the time you are offered your first interview to when you are offered/declined the position. They are great because they don't have a bearing on your employment per se, so you can ask them anything. \r\nIf they are highly considering you for the position, they will ask you to provide references. You have to send your references a personal link that takes them to complete a questionnaire and comment box. I believe you need eight. If those are satisfactory, then you may be offered the position.", "Interview Questions": "Asking for personal stories concerning a particular issue - such as diffusing a situation, a time you didn't get along with or agree with a colleague, and a time you were most proud of your work. "}, {"date": "22 Jan 2018", "title": "RN Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Allina Health (Minneapolis, MN) in Feb 2013", "Interview Descriptions": "Questions regarding background, importance of certain things in the job you are seeking.  Pretty standard process. Met with 2 nurses and a dr and answered questions from a prepared list they had. Pretty low key.  Actual offer was from HR.", "Interview Questions": "What would you do in an emergency"}, {"date": "21 Feb 2013", "title": "Senior Financial Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Allina Health (Minneapolis, MN) in Jan 2013", "Interview Descriptions": "Phone screen with HR. Face to Face with two Finance Directors. Only got questions about the job, no behavioral questions. Don't know if this was they did not see what they were looking for, or being Finance People they didn't feel a need to ask behavior questions. It's now been 4 weeks and nothing, so I assume they weren't interested.", "Interview Questions": "N/A"}, {"date": "18 Aug 2013", "title": "Human Resources Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. I interviewed at Allina Health (Minneapolis, MN) in May 2012", "Interview Descriptions": "Multiple interviews", "Interview Questions": "They were all pretty standard.\r\n"}, {"date": "11 Oct 2014", "title": "Development Specialist - Philanthropy Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Allina Health (Minneapolis, MN) in Mar 2012", "Interview Descriptions": "My first interview was with a panel of three employees, one of which quit before I started. Then I met one on one with sad boss and did another phone interview a few days later.", "Interview Questions": "What's your process for de-stressing while you're at work? What do you do when you're stressed at work?"}, {"date": "26 Sept 2011", "title": "RN Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Allina Health (Woodbury, MN) in Jul 2011", "Interview Descriptions": "Inner facility interviews are held for new positions available.  Interviews are held with 3 other supervisors, administrators etc.  Many questions were asked about previous situations and how they were handled.  This information I felt was irrelevent considering this was an inner office transfer.  They would have known about many of the situations.  After being employed by a company and in the same position for 10+ years it is a given that stressful situations can be handled appropriately, if not, they would be aware of it.", "Interview Questions": "In the past, when you had a disagreement with a co-worker, how did you handle it?"}, {"date": "5 Jun 2012", "title": "Buyer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Allina Health (Minneapolis, MN) in May 2011", "Interview Descriptions": "I applied on the company website and was contacted  for a  preliminary screening by the HR department . The  hiring manager then interviewed me  an offer was extended with in 2 weeks.", "Interview Questions": "N/A"}, {"date": "30 Apr 2013", "title": "Data Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Allina Health (Minneapolis, MN) in Sept 2009", "Interview Descriptions": "I was interviewed once by the Director of Qulaity and 3 subordinates.  Then called back a second time to meet with another subordinate about specific projects.   At the time I did not have appropriate credentials (no BA), but I had many years experience.   The lack of degree almost stopped the process, but they hired me anyway.  I have since gotten my BS and moved up to a senior position based on that.", "Interview Questions": "They had me do a little test with data.  Take some spreadsheets of patient data and summarize.  Average LOS, count of patients, etc.  Easy stuff, but I was nervous so ended up not finishing in the time allotted.  "}], [{"date": "19 Mar 2013", "title": "Chaplain Resident Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 1+ week. I interviewed at Allina Health (Saint Paul, MN) in Aug 2009", "Interview Descriptions": "This interview was with the head of the Spiritual Care Department and a supervisor in training for the nine-month clinical pastoral education program.   A detailed application, including essay responses, was previously submitted.    The interview was relaxed, friendly, and conversational, with the interviewers being very open to answering questions.    They were realistic about what the ministry and training involved and I had no unexpected surprises during my time at this hospital.   I have since referred a close friend to work at the same hospital, who also had a very positive experience.", "Interview Questions": "Due to the nature of the ministry, I was asked about personal experiences with death.  This was not unexpected and I was prepared to answer it."}, {"date": "23 Jul 2010", "title": "Senior Tax Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 1 week. I interviewed at Allina Health (Minnesota City, MN) in Jul 2009", "Interview Descriptions": "I was interviewed by a person who was promoted to the management recently and I was already a manager for 1.5 years. So I guess she was insecured to hire me for the position and hence I was not selected. Though I answered all the questions she asked and though I had the 5 years of related work experience for the position.", "Interview Questions": "Describe the situation when you had to be a team player and how you handled the issues during that situation."}]]