[[{"date": "18 Feb 2023", "title": "Caregiver, CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Parkview Medical Center", "Interview Descriptions": "Sit down interview. Phone interview. I honestly was called and interviewed. Professional people. The onboarding was a week long. I have nothing else to add. No more to say. Hi I guess.", "Interview Questions": "What qualifications do you have? CPR?"}, {"date": "13 Dec 2021", "title": "Secretary Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Parkview Medical Center (Pueblo, CO) in Dec 2021", "Interview Descriptions": "Friendly staff. Asked basic questions and were concerned with any questions I may have had. They were interested in my future plans and where I wanted to end up. Seemed willing to train as needed", "Interview Questions": "Computer experience and what are future goals "}, {"date": "18 Mar 2019", "title": "Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Parkview Medical Center (Pueblo, CO)", "Interview Descriptions": "It was a pretty standard interview process. I was asked to attend two interviews. One with only two people the director and co worker. I was then interviewed the by core team and asked to speak about my past experiences.", "Interview Questions": "When have you made a mistake and learned or adjusted to make it better. "}, {"date": "6 Mar 2019", "title": "Medical Biller Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Parkview Medical Center", "Interview Descriptions": "The process took about 2 weeks from application to interview. The interview lasted about 30 minutes.  Everyone one was very professional from the recruiters to the hiring managers.  It was a very comfortable experience.", "Interview Questions": "What makes you the best candidate for the job?"}, {"date": "18 Oct 2018", "title": "Medical Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Parkview Medical Center (Pueblo, CO) in Oct 2018", "Interview Descriptions": "First call was to schedule an interview\n\nWent in for my interview in a conference room with multiple department managers from different sites. (10 people or so)\n\nThey went around the room and introduced themselves and stated what positions they had open in each dept if any. \n\nThey each took turns in asking a series of questions and jotting down my answers", "Interview Questions": "Do u have a drivers license and reliable transportation?"}, {"date": "20 Sept 2018", "title": "Office Administrator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 days. I interviewed at Parkview Medical Center (Pueblo, CO) in Jul 2018", "Interview Descriptions": "Interviewer was very professional and courteous. She asked several questions, allowed plenty of time for me to express my thoughts and concerns, and introduced me to other staff members. I had the opportunity to ask several questions and she was very open about her interviewing and hire process.", "Interview Questions": "Why do you want to work here?"}, {"date": "4 Dec 2021", "title": "NSE1 Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Parkview Medical Center (Pueblo, CO) in May 2018", "Interview Descriptions": "Pleasant, polite, and direct questions. It was very professional and the lady who interviewed me, asked me questions that challenged my knowledge, decision making and conflict resolution skills. It was a good experience.", "Interview Questions": "How would I handle a patient who is upset/angry at a situation?"}, {"date": "22 Jul 2020", "title": "Scheduler Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Parkview Medical Center (Pueblo, CO) in Jan 2018", "Interview Descriptions": "Met w director and other staff. They asked me standard questions. Didn’t seem real interested. I’m guessing they had an internal candidate already. Plus I didn’t have any experience. Was just glad I got the interview.", "Interview Questions": "Describe yourself in 3 words"}, {"date": "24 Jun 2019", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Parkview Medical Center in Jan 2018", "Interview Descriptions": "short. maybe 30 minutes. it was with the director and manager of the units. they were very nice and it was not intense. I felt comfortable and by the end they had offered me the position.", "Interview Questions": "What is one thing you feel is your strength and one is your biggest weakness? "}, {"date": "23 Oct 2018", "title": "Insurance Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Parkview Medical Center (Pueblo, CO) in Dec 2017", "Interview Descriptions": "The interview is with the Director of our Business Office and team leads.  So three people normally. They are very down to earth and friendly. No need to feel intimidated.", "Interview Questions": "Why did you apply at Parkview"}], [{"date": "30 Oct 2017", "title": "Remote Medical Coder Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Parkview Medical Center", "Interview Descriptions": "I was interviewed over the phone by a coding director and a coding manager.  Reviewed what type of medical records that I coded in the past and what size health care facilities were they.", "Interview Questions": "What type of accounts I was used to coding daily and for what size hospital. "}, {"date": "22 Aug 2017", "title": "Admissions Representative Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Parkview Medical Center in Jul 2017", "Interview Descriptions": "The entire process took a very long time. The first interview was with 2 reps. They were very polite and I knew the interview went well from their body language. I was called back for a second interview with the director. She was very rude from the beginning, she didn't write anything I was saying down nor did she ask all questions on her paper. It seemed to didn't care about anything I was saying. I knew when I walked out I wouldn't be picked. I'm more than qualified and have an outstanding work record. Their loss...I also thought the human resource rep who coordinates was rude. She called me but acted like I was bothering her.", "Interview Questions": "A majority of the questions asked were based on customer service"}, {"date": "13 Dec 2018", "title": "Surgical Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Parkview Medical Center (Pueblo, CO) in May 2017", "Interview Descriptions": "It was a typical interview, no surprises. Experience questioning, strengths and weaknesses questions. How many years experience, what specialties are you familiar with, are you available to stay late when needed", "Interview Questions": "How many years experience do you have and what specialties can you do?"}, {"date": "14 Jan 2018", "title": "Admissions Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Parkview Medical Center (Pueblo, CO) in Mar 2017", "Interview Descriptions": "There were a series of 2 interviews for the position. First there was an interview with the admissions department director. The second was with the director above her who is in charge of admissions, financial counseling, and scheduling. Overall it was a rather simple interview process.", "Interview Questions": "They asked how well I worked under pressure."}, {"date": "19 Sept 2016", "title": "Talent Acquisition Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Parkview Medical Center (Pueblo, CO) in Sept 2016", "Interview Descriptions": "I had two phone interviews and unfortunately did not make the cut, but the process was delightful - they were friendly, and took a lot of time to build rapport.  It felt like a conversation with some good friends.  I wouldn't suggest that you shouldn't thoroughly prepare for the process by doing your research, but the process felt friendly and not like being raked over the coals.  The recruiter was timely and provided consistent follow up and feedback throughout the process.  First initial screen was with the recruiter, followed up by an interview with the recruiter and then an interview with the hiring manager.  The really classy part was a follow up phone call within 1 business day letting me know that I didn't get the position and offering me tips for applying for a subsequent position.  They phoned to tell me in person, prior to sending an email.  Thoughtful and totally representative of the values that they hold dear.  I was disappointed, but impressed with the process.", "Interview Questions": "Why does our mission agree with you? \r\nWhich one of our values resonates the most with you?"}, {"date": "28 Dec 2018", "title": "Behavior Therapist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Parkview Medical Center (Pueblo, CO) in Apr 2016", "Interview Descriptions": "A lot of promises and little to no follow through.  There is a lot of hype about this facility but the turnaround shows the benefits.  The behavioral staff is seen as \"less than\" the medical staff which is very unfortunate considering this is a PSYCH facility and mental health holds priority of care.", "Interview Questions": "Why I chose this career"}, {"date": "1 Jul 2016", "title": "Scheduler Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Parkview Medical Center (Pueblo, CO) in Nov 2015", "Interview Descriptions": "After I applied online, I got a call from parkview about 2 to 3 weeks later to set up an interview. I got interviewed by 2 people. A week later got a second call to do a second interview with 2 other people and got a call a couple days later that I got the job.", "Interview Questions": "Why do you want to work for parkview?"}], [{"date": "24 Oct 2018", "title": "Fellowship Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 3 weeks. I interviewed at Parkview Medical Center in Jan 2015", "Interview Descriptions": "panel interview with very detailed questions. There were 4 people present. Each went around the room asking questions. Most questions were personality based. Very relaxed for a group interview. They told me they would let me know within a week and called me the next day!", "Interview Questions": "Describe a time when you needed to make a deadline and how did you do so?"}], [{"date": "15 Jul 2018", "title": "Front Office Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 2 months. I interviewed at Parkview Medical Center in Jan 2014", "Interview Descriptions": "Long, drug out process, but once it was over, it was worth it. Lot of back ground work and checks. Typical large business process. Nothing else to comment. . . . .", "Interview Questions": "Why are you the best candidate"}], [{"date": "19 Jul 2016", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Parkview Medical Center (Pueblo, CO) in Feb 2012", "Interview Descriptions": "The interview process is terrible. The worst group of people to try and coordinate anything.  One department does not communicate with the other and so much overlap or people saying \"I don't know.\"  They couldn't get the dates and times right and HR, don't get me started on them - they especially have no clue. People in the HR and employment office should be fired.", "Interview Questions": "They had trends of questions about people doing things wrong and if you would report them or just talk to them first.  They wanted to know if you would call people out, go to the manager or what your response would be. Makes sense because if you go to the manager, it doesn't matter as they will just side with their drinking friends regardless if something was done wrong or not."}]]