[[{"date": "22 Oct 2021", "title": "Care Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Greater Cincinnati Behavioral Health Services", "Interview Descriptions": "Phone interview- short screening with Human Respurces.\r\nIn person interview- 2-3 person board...MH questions.\r\nNot very difficult. 30 mins. Several questions.\r\nPolite people. Want to make sure you are familiar with MH Dx.", "Interview Questions": "My Bipolar knowledge and difference."}, {"date": "2 Mar 2022", "title": "Behavior Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Greater Cincinnati Behavioral Health Services (Cincinnati, OH) in Aug 2021", "Interview Descriptions": "Professional yet friendly  environment. Rapid response to application, interview and offer.  HR works fast and they keep on the loop.  Interview had different levels from direct supervisor to the Director", "Interview Questions": "They ask a lot of Scenario questions...tell me a time you had to....?"}, {"date": "17 Aug 2020", "title": "Care Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Greater Cincinnati Behavioral Health Services (Cincinnati, OH)", "Interview Descriptions": "I submitted my application and resume online. I was contacted within several days. A phone interview was scheduled. After the phone interview, a face to face interview was scheduled. After the face to face interview, they scheduled me for a job shadow with a care manager. On that same day, I was required to provide fingerprints, etc. for a background check. I was hired within a couple of weeks after.", "Interview Questions": "Asked questions regarding mental Health conditions and symptoms and how you might handle certain situations."}, {"date": "30 Jul 2019", "title": "Case Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Greater Cincinnati Behavioral Health Services (Cincinnati, OH)", "Interview Descriptions": "This was by far the most intimidating interview I’ve ever had. Be sure to do your homework on the company because they will ask you about their organization. The whole process was very discomforting and I never felt so embarrassed. At some point, one of the interviewers looked very annoyed and irritated when I responded to some of the answers they asked me.", "Interview Questions": "What do you know about our organization?\nWhat are your career goals?\nName two symptoms of schizophrenia.\nName two symptoms of bipolar disorder."}, {"date": "18 Oct 2018", "title": "Case Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Greater Cincinnati Behavioral Health Services (Cincinnati, OH)", "Interview Descriptions": "Arrived to the interview and no receptionist was to be found for 15+ minutes while I waited.  Eventually the interviewer came up and had me fill out a questionnaire on how I would describe schizophrenia to someone whose son was recently diagnosed and how I would help an individual  who has never lived or shopped on their own. After, I was taken back with the hiring manager and potential supervisor. I was asked very specific hypothetical scenarios that seemed difficult to answer without proper training. The interviewers emotions remained flat and were hard to engage with a smile the whole time making it uncomfortable-- especially for a mental health organization.", "Interview Questions": "A man who is an alcoholic is constantly drinking outside of his house and his neighbors are continuing to call the police on him. He continues to drink. What would you do?"}, {"date": "8 Sept 2018", "title": "Care Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Greater Cincinnati Behavioral Health Services (Cincinnati, OH) in Aug 2018", "Interview Descriptions": "The application was filled out online and then I had a phone interview within the next few days, followed by a face-to-face interview afterwards. There was a panel consisting of 2 supervisors and the recruiter. They asked questions and wrote down the answers. \r\n\r\nDuring my interview, one supervisor kept giving me a funny look and was not very polite. The other supervisor, kept questioning my answers and method of ways I would handle a situation that she herself did not particularly agree with. It made the interview awkward and embarrassing for me.", "Interview Questions": "Name two mental disorders and at least two symptoms for each of them. "}, {"date": "23 May 2017", "title": "Mental Health Care Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Greater Cincinnati Behavioral Health Services (Cincinnati, OH) in Jan 2017", "Interview Descriptions": "I applied through indeed.com and received a phone call for an in person interview a few days later. During the interview, the supervisor of the team I was applying for and a hiring manager were there (there are typically 4-5 people during the interview process, mine was unique in that aspect). \r\n\r\nBefore the interview, the paper application is given to you to fill out, there are situational questions about what you would do to help a client if they found out they had a mental illness and a question asking you to name all the things you know about schizophrenia, the same questions were asked in the interview, as well. Most of the questions are regarding how you would react to a client doing xyz and what you would do in that situation. The interview took about 20 minutes and afterwards, benefits and salary information was gone over. \r\n\r\nI got a call back a few days later with the job offer and they were willing to let me start at my earliest convenience.", "Interview Questions": "If a client were to call you and say they were going to kill themselves and were holding a knife, what would you do?"}, {"date": "15 Apr 2016", "title": "Mental Health Case Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. The process took 1 week. I interviewed at Greater Cincinnati Behavioral Health Services (Cincinnati, OH)", "Interview Descriptions": "I was terrified going into the interview. I was very prepared though, and they were very impressed by that. Read up on their website and try to memorize some of it. I interviewed on a Friday, got a call the following Tuesday to see if my references could be called, then got offered a position on Friday. All in a week. Don't go into it thinking they're desperate for people. They do need people, but there are also a lot of people that need a job! I was one of 20 candidates interviewing for 3 different positions. Just be prepared and confident and you will be good!", "Interview Questions": "What are your strengths and weaknesses?"}, {"date": "28 Mar 2016", "title": "Care Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Greater Cincinnati Behavioral Health Services (Amelia, OH)", "Interview Descriptions": "Immediate response to application, quick interview process with a lot of questions.\r\n\r\nThis interview was a 1:1 but typically it is a panel interview.\r\n\r\nIt was easy, and relaxed, the interviewer has a list of pre-selected questions and the interviewer writes down your responses. After the interview they will contact your references and then offer a time to start the job.", "Interview Questions": "Describe a suggestion you have given to a previous job."}, {"date": "6 May 2014", "title": "Medical Records Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. The process took 1 week. I interviewed at Greater Cincinnati Behavioral Health Services", "Interview Descriptions": "The process is fast and to the point.", "Interview Questions": "N/A"}]]