[[{"date": "30 Apr 2023", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at University of South Dakota (Vermillion, SD) in Jan 2023", "Interview Descriptions": "Overall, the interview process is designed to assess a candidate's qualifications, skills, and fit for the organization. It can be a time-consuming and nerve-wracking process, but it's an important step in finding the right candidate for the job.", "Interview Questions": "I never face any Interview from Glassdoor"}, {"date": "15 Mar 2022", "title": "Facilities Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at University of South Dakota", "Interview Descriptions": "Pretty straight forward. General questions. It is a student job for the most part. You are asked about your schedule and your availability as well as how many hours a week you could possibly work.", "Interview Questions": "How many hours can you work in a week?"}, {"date": "5 Oct 2021", "title": "Postdoctoral Researcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of South Dakota", "Interview Descriptions": "Three person interview with the professor in my area and another professor with a different research area. The interview was in the form of phone interview and it wasn't long, about 30 min.", "Interview Questions": "They asked what can I contribute to the group."}, {"date": "9 Nov 2021", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at University of South Dakota (Vermillion, SD) in Apr 2018", "Interview Descriptions": "The chair of the department of Kinesiology and Sport Management stopped me, mid-interview, to tell me how terrible millennials were and how none of them want to work. I am a millennial worker, who at the time was reapplying for the position I already had. That position consisted of doing things the chair couldn't be bothered to do like editing one sentence in a class PowerPoint or cancelling his dinner reservations.", "Interview Questions": "Have you ever seen this video about millennial workers? It's hilarious. "}, {"date": "16 Jan 2019", "title": "Student Ambassador Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at University of South Dakota in Apr 2016", "Interview Descriptions": "As a student worker, I was interviewed by advisors and other student workers.  They asked questions about my school and home life. The interview was very laid back and I enjoyed the conversations I had.", "Interview Questions": "They asked me to pull a random item out of a bag and pitch it "}, {"date": "30 Nov 2015", "title": "Law School Undergraduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 3 days. I interviewed at University of South Dakota (Vermillion, SD) in Sept 2015", "Interview Descriptions": "The process was very easy going.  I interviewed with the Administrative Dean.  Most of the questions were schedule and qualification oriented.  This was especially true with some of the budgetary and accounting skills necessary for the job.", "Interview Questions": "Describe an experience where you've operated a budget or routinely balanced an organizations accounts."}, {"date": "27 Mar 2015", "title": "Graduate Student Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at University of South Dakota (Vermillion, SD) in Mar 2015", "Interview Descriptions": "They host an interview day and you get the chance to meet the faculty and current students.  A lot of the day is informal meetings with students and faculty, then there is a time for 1:1 interviews with professors.  Throughout the day, they are checking to see if you \"fit well\" in the program.  After the formal day ends, there is a potluck, then an after party with the students.  It gets to be a very long, stressful day.", "Interview Questions": "Tell me about yourself... (it's a very obvious thing to expect at an interview, but it's an easy way to see if someone has prepared for the interview)"}, {"date": "21 Nov 2014", "title": "Community Advisor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of South Dakota (Vermillion, SD) in Nov 2014", "Interview Descriptions": "When the school is in need of positions, it will send out e-mails to students in order to gain applicants. When you go through the application and get two references, one being a USD housing staff and the other a non-housing professional reference and attend a mandatory information meeting about the position, you will be guaranteed an interview.", "Interview Questions": "Is it more important to be liked or respected by your hall's residents?\r\nWhat is the most difficult thing you had to go through during school or work?\r\nName a situation where you had to adjust to change.\r\nWhat will you do when a student will not abide to housing policy?"}, {"date": "19 Oct 2015", "title": "Lab Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at University of South Dakota (Vermillion, SD) in Aug 2014", "Interview Descriptions": "They asked me common behavioral questions like why do you want to work here? what is your weakness? how was your previous boss like? and finally, what makes you different from other candidates? I'd recommend thinking your answers before spiting them out.", "Interview Questions": "N/A"}, {"date": "27 Jun 2016", "title": "Resident Advisor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at University of South Dakota (Vermillion, SD) in Jul 2014", "Interview Descriptions": "You need to get recommended from another RA, preferably the one in your dorm floor if you've lived on campus, and then you will be guided through a few meetings, including a workshop and an evaluation on how well you cooperate in a group. You will get interviewed after the workshop.", "Interview Questions": "What was a difficult situation you were in?"}], [{"date": "17 Mar 2014", "title": "Secretary Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of South Dakota (Vermillion, SD) in Aug 2010", "Interview Descriptions": "Had a phone interview first, and was called for a follow up in-person interview on campus. The whole process was very fast and streamlined. Felt very comfortable the whole time. The questions were pretty standard. Nothing really stood out to me as being abnormal or unique.", "Interview Questions": "None, they were all pretty standard."}, {"date": "31 Aug 2013", "title": "Senior Building Maintenance Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of South Dakota (Vermillion, SD) in Dec 2009", "Interview Descriptions": "Usual application process, then phone interview, then face to face interview.", "Interview Questions": "Name your weaknesses."}]]