[[{"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Adjunct", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "17 Mar 2023", "job_title": "Adjunct Faculty in San Antonio, TX", "duration": "N/A", "pros": "It is convenient remote work.", "cons": "There is a lot of micromanaging."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "The WORST place I’ve ever been associated with.", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "29 May 2023", "job_title": "Management in Aurora, CO", "duration": "N/A", "pros": "TIAA benefits are good and remote.", "cons": "The toxicity and dysfunction that exist at Colorado State University Global has devastating affects on employees, their students, and the bottom line- in the red. Employee morale, productivity, and retention suffered under Pam and Dr. Becky’s regime and fail to inspire and support their team— not a redeemable leader in an any shape or manor. Quite opposite. Toxic behaviors and disrespect, such as Dr. Becky’s, poison the workplace and erode trust and collaboration. Global employees should never feel afraid to speak up or express their concerns without fear of retaliation. This is a norm at CSUG. Employee morale, productivity, and retention suffer when these “leaders” fail to inspire and support their team. The consequences of poor leadership and culture are not confined to the workplace. The CSUG employee experience has severe negative impacts for their students such as poor quality products or services, long wait times, and unresponsive or rude staff from Enrollment to SSC."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Pay was terrible", "rating": "2.0", "reviewer_affiliation": "Current Employee", "job_date": "26 May 2023", "job_title": "Student Accounts Associate in Aurora, CO", "duration": "N/A", "pros": "My manager (the 4th and final) was incredible. I accrued time off as a part time employee", "cons": "They do not pay you for the amount of responsibility that you have . NO raises in three years. Just before I quit they gave me a 3 dollar raise."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "N/A", "Work/Life Balance": 0, "Culture & Values": 0, "Diversity and Inclusion": 1, "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "Toxic Workplace", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "24 Apr 2023", "job_title": "Anonymous Employee in Aurora, CO", "duration": "N/A", "pros": "Resume building and hybrid workplace. Great retirement contributions", "cons": "No room to advance, hardline leadership, toxic work environment. At the peak of the pandemic numerous employees were invited to an impromptu zoom meeting with HR to be laid off in mass."}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Micromanaged Nightmare", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "20 Apr 2023", "job_title": "Academic Advisor in Denver, CO", "duration": "N/A", "pros": "Team support, work from home, benefits", "cons": "Inflexible hours, micromanagement, constantly shifting metrics and initiatives"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "I’m happy here", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "9 Mar 2023", "job_title": "Enrollment Counselor in Aurora, CO", "duration": "N/A", "pros": "Remote work, truly making a difference, outside of the box thinking, flexibility, benefits", "cons": "High turn over- especially in upper management, inconsistent managing, depending on your manager- micromanagement"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 0, "Diversity and Inclusion": 3, "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Mismanaged", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "18 Jan 2023", "job_title": "Enrollment Counselor in Aurora, CO", "duration": "N/A", "pros": "The job is fully remote.", "cons": "Massive turn over, poor communication and broken processes contribute to a poor work environment and student experience."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 3, "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Excellent leadership, clarity of goals, many great benefits", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "11 Nov 2021", "job_title": "Director in Denver, CO", "duration": "N/A", "pros": "A few months before I started, we welcomed a new president who had previously been a COO for the organization. Understanding that the organization needed clear, measurable, and attainable goals that would drive performance, she sought out feedback from the entire organization to develop an organizational plan, a new mission, and a strong set of core values for the organization. She is a steady, reasoned, and rational leader who the team can trust will make good decisions with both students and the organization in mind. There is very little red tape in the organization, and leaders are expect to challenge the status quo, seek out new and better ways to support students, and measure results. There is a TON of collaboration across units, and yet departments have a relatively high level of autonomy as long as you are measuring and reporting strong results. Coworkers are genial, smart, and hard-working. I have worked in higher education for over 18 years, and this is the most positive work culture I have been a part of. The perks are great--fabulous benefits and retirement matching and remote work--but I will stay due to the many other reasons that make me excited to work here.", "cons": "While I did not work at CSU Global under the prior leadership team, it seems many of the negative reviews are from a different era."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": 3, "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Lack of Integrity, Transparency, etc", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "26 Nov 2022", "job_title": "Senior Director of Marketing in Aurora, CO", "duration": "N/A", "pros": "Working from home, flexible hours", "cons": "So many unethical practices, they were writing positive online reviews to make the university look better that it is, half of their content data were made up. The marketing department lacks vision and skill and full of ego. Nobody was able to properly utilizing digital advertising platform."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": 3, "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Changing for the better", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "24 Jan 2022", "job_title": "Anonymous Employee in Denver, CO", "duration": "N/A", "pros": "Fully remote work, great benefits, awesome retirement match, free tuition.\r\n\r\nIf I wrote this review a year and a half ago, I would have echoed what many of the older reviews said. Those complaints of toxic leadership, random layoffs, no room for advancement, terrible culture? They were valid.\r\n\r\nSo why the 4-star review? I have never seen such an intentional shift in organizational attitude anywhere I’ve worked. Since the new president was appointed last year, there has been SO MUCH positive change. (It helps that a few terrible executives/directors are no longer with the university. Those few bad apples were making work miserable for many really wonderful people.) \r\n\r\nThere are teams actively working to improve the culture, benefits, workloads, and professional development opportunities, and the results are already being felt.", "cons": "Global is nonprofit and doesn’t receive state funding, but people should be paid closer to market value / receive raises regularly."}], [{"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Haha Don't be A Fool like these other reviews", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "16 Nov 2021", "job_title": "Senior Enrollment Counselor in Denver, CO", "duration": "N/A", "pros": "The only TWO pros are the remote work, I love it its the best part of working here, and the paid time off is generous.", "cons": "CHANGE is never ending. Management is inconsistent and lack luster. If you work in enrollment you will NEVER more out of this department or get promoted the goals are just not obtainable. Nepotism rules here- if you are a drone who does what they want you will get promoted regardless of your qualifications, if you speak up or saying anything that upsets leadership kiss your chances of promotions goodbye. HR is a JOKE, they continue to mistreat employees who speak up , the high turn over rate is directly linked to this abuse. It used to be good but is just MEH now. I would not choose to start working here during the \"time of change\" it is not going to be fun."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 0, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Phenomenal Team Atmosphere", "rating": "4.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "28 Mar 2022", "job_title": "Enrollment Counselor in Aurora, CO", "duration": "N/A", "pros": "Great team, kinda and helpful coworkers, management really cares about feedback and how everyone is doing.", "cons": "Very little job growth opportunities, systems and training information frequently feels outdated, lots of turnover for employees at all levels"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Don’t work here. Any place is better than here.", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "7 Dec 2021", "job_title": "Senior Enrollment Counselor in Aurora, CO", "duration": "N/A", "pros": "State employee, 401a, tuition assistance benefits, generous PTO.", "cons": "The Enrollment Department has been under new leadership since July and the culture continues to get worse. Leadership continues to make changes and outsource the Enrollment Counselor jobs. Leadership has turned over all inquiries made to the university to a 3rd party where they call and harass students 3+ times a day, text, and email them to the point that prospective students are upset. They have turned the Enrollment Department into a Call Center that takes inbound calls from the third party. There is no room for growth/ promotion or more money. There is no training or coaching for employees. There is no appreciation for employees or care for employees. Leadership lacks clarity and transparency. Leadership is dismissive to employee concerns and suggestions. When changes are made those on the front lines are last to know and changes are never fully executed. When questions are asked, middle management never have answers and they say they will get back to employees but then they never do. Enrollment counselors are left trying to piece things together. The Enrollment Department has not hit a goal in a year and a half and we continue to see a drop in Enrollment numbers, but leadership continues down the path that a third party is what works. The Enrollment Department has lost two middle managers in the last 3 months because of how terrible and toxic the leadership is. More and more people keep leaving because of it. CSU Global is supposed to be a non profit- public institution and yet leadership is running it as a for profit, diploma mill."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 0, "Diversity and Inclusion": 3, "Career Opportunities": 1, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "Super High Stress w/No Room for Advancement", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "21 Jul 2021", "job_title": "Senior Enrollment Counselor in Anchorage, AK", "duration": "N/A", "pros": "I like the university, CSU-Global. It's a good, quality school that is top notch.", "cons": "We are micromanaged on a daily basis. They will lay off entire departments with no advance notice. Goals are changing on a weekly basis - and are postdated, meaning you have to hit goals that you didn't even know you have. They manage through fear and constant threats of being fired or laid off. Upper management gives threats during nearly every meeting. We are not allowed to give feedback in meetings. Policies change without notice and we are expected to know what's going on. Every enrollment team is being operated completely differently, so different information can be given depending on who you happen to talk to."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 0, "Culture & Values": 0, "Diversity and Inclusion": 3, "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "High Pressure Sales Job labeled as admissions counselor", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "20 Sept 2021", "job_title": "Admissions Counselor in Greenwood Village, Arapahoe, CO", "duration": "N/A", "pros": "Opportunity to get advanced degree at little to no cost while employed.", "cons": "They hire you making you believe you are working for a public university, but if you do not register 20 new students per month you go on probation. If you do not make up the deficit in the following months you are fired."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 3, "Diversity and Inclusion": 0, "Career Opportunities": 3, "Compensation and Benefits": 5, "Senior Management": 0, "review_title": "High turnover", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "31 May 2021", "job_title": "Senior Graphic Designer in Lakewood, CO", "duration": "N/A", "pros": "Competitive salary, fast-paced environment, at the forefront of online education.", "cons": "Stifling towards innovative ideas, pressure-culture, high turnover rate."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Hard work but it's rewarding", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "26 May 2021", "job_title": "Enrollment Counselor in Aurora, CO", "duration": "N/A", "pros": "Fully remote, flexible time, serving student.", "cons": "Salary below average, too much unnecessary quality control"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": 4, "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Great!", "rating": "4.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "17 Jan 2021", "job_title": "Enrollment Counselor in Los Angeles, CA", "duration": "N/A", "pros": "Schedule Flexibility, Student facing, remote- work from home, they provide equipment and great tech support.", "cons": "Pay is not great, but saves money on other work related expenses, like work clothes and gas."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": 4, "Career Opportunities": 3, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "I never want to leave", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "11 Feb 2021", "job_title": "Enrollment Counselor in Little River, SC", "duration": "N/A", "pros": "People, programs, benefits, freedom, work from home", "cons": "If you are okay with change then you will do great"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Don't work here", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "27 Feb 2018", "job_title": "Student Account Representative in Greenwood Village, CO", "duration": "N/A", "pros": "*Great benefits package, including PTO, health insurance, and retirement\r\n*Overall strong entry-level team", "cons": "*Although PTO accrued quickly, I was rarely given the opportunity to use it and was once penalized on my annual review for insisting on using my vacation time before it expired\r\n*Management's performance expectations are unrealistic and they will abuse your salaried, exempt status - before I left voluntarily in the fall of 2017 I was consistently working at least 50 hour weeks with no additional compensation\r\n*Global is consistently under-staffed because they cannot retain valuable employees and this will affect your day-to-day because entry-level staff are expected to pick up the slack without complaint\r\n*Upper management do not value their employees - from 2015-2017 I experienced at least three all-staff meetings in which our campus president literally told entry-level staff to quit if we had any issues with our employment, no hyperbole\r\n*Global will report budget issues and will commonly not offer entry-level staff either a raise or bonus, at the same time that management will receive large ones\r\n*Limited opportunities for growth/promotions - many team lead and management roles are offered to outside hires first \r\n*Training offered is cut rate and they place importance on \"customer service\" (e.g. how you sound on the phone) over the accuracy of the information you will be presenting to students \r\n\r\nNote: I left Global voluntarily after 3+ years because I was so unhappy and have since found employment at another university"}], [{"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Great Company", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "11 Jan 2021", "job_title": "Program Chair for College in Colorado Springs, CO", "duration": "N/A", "pros": "Great team work as the teams work quickly to resolve student issues.", "cons": "Nothing is bad at CSU Global at this time."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Lost in the Sauce", "rating": "2.0", "reviewer_affiliation": "Former Employee", "job_date": "7 Jan 2021", "job_title": "Marketing Associate in Aurora, CO", "duration": "N/A", "pros": "Benefits are really good, but declining", "cons": "No Direction or conflicting direction at the very least"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "A dynamic university...on the move!!!", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "3 Oct 2013", "job_title": "Anonymous Employee in Greenwood Village, CO", "duration": "N/A", "pros": "This is a mission focused and results driven company. Regardless of your role at this university, employees are expected to keep students/customers at the focal point of their responsibilities. I appreciate the fact that my expectations are clear, and as demanding as they are, I'm given some flexibility to meet them. Employees seem to be generously rewarded for their individual accomplishments, and the achievement of company goals. Executive leadership is way ahead of the curve in this area. The last 5 companies I worked for only rewarded (very generously I might add) key executives.", "cons": "As a highly accountable and results oriented company, the pressure to perform can be overwhelming. Change can occur at a moments notice, but I believe this helps us to stay focused on providing the best service possible to our students. It also gives us a competitive advantage. At times, all members of senior management can come across as insensitive, unreasonable, and unappreciative. There could be many reasons for this, passion, focus, a lack of tact when upset/angry, etc. You'll need to be confident in your abilities to overcome times like this, and develop rhincerous skin!"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "There’s a reason for the poor rating, it’s the truth.", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "4 Oct 2020", "job_title": "Enrollment Counselor in Aurora, CO", "duration": "N/A", "pros": "Generous 401a, remote work available", "cons": "The leadership is outrageous. Back in June 2020 they laid off 51 employees due to “covid” but a week later during an all staff meeting (that all 51 laid off employees were at) the president announced her promotion. They earned a 20% operating margin instead of their goal of 30% this year so therefore they felt the need that hard working employees were the problem. They laid off our entire leadership team for a group of 60 and left us with no one. Told us we would have a new manager within a month, we just got one three months later. One manager with 60 direct reports. It is clear that leadership here does not care about any of their employees. We have been alone, watching numbers drop and employees jump ship and they haven’t done anything. We have been left with no support. \n\nThere is a reason that the reviews are horrible - it really is an awful place to work. The reviews are true - they do watch these ratings and then ask people to write good reviews to get our ratings up. Senior leadership openly gossips about other shareholders behind their back as a form of entertainment. \n\nIf you are reading this and considering a job here, look elsewhere. Not only is there an absence of employee appreciation, but former leadership has found higher paying entry level positions in the field."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Everyone is Quitting", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "22 Nov 2017", "job_title": "Middle Management in Aurora, CO", "duration": "N/A", "pros": "Quality benefit package But it is tough to use your PTO depending on your department. They are understaffed continuously due to turnovers. Remote aspect is fantastic because it keeps you out of the negative office environment.", "cons": "Leadership is completely disconnected from their employees. They seem not to care or support team members. There is a constant theme, and that is if you don't like it leave. This is from the CEO down. So guess what is happening? Everyone is leaving! HR used to send out a weekly email to all the staff that left, but it got to the point they stopped sending it because there were just too many people quitting.\r\n  It is the kind of place where you're not allowed to leave a minute early the eve of a Holiday, but the CEO and the provost will leave you in the office the day before Christmas to work, while you watch them leave for a half-day. Most employees are actively seeking employment, and as soon as they find jobs, they leave. The benefits are very good, and the remote aspect is what keeps everyone tolerating the job. It is sad to say but this place is on the down and down."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "My Personal View of CSU Global", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "7 Nov 2020", "job_title": "Adjunct Faculty in Austin, TX", "duration": "N/A", "pros": "Very good school that cares for the interest and academic progress of students.", "cons": "There is nothing bad about this school."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "CSU Global", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "28 Oct 2019", "job_title": "Anonymous Employee in Denver, CO", "duration": "N/A", "pros": "I have worked for Global for four and a half years.  It is a non-profit state university that operates independently within the CSU system.  The work can be challenging at times, but it is also very rewarding in many aspects.  The people are great, from co-workers to managers all the way to the top executives who are supportive, invested, and always accessible to all levels of employees. The flexibility of remote working ( I work in the office and remote depending on the day) is a great perk.  There is a lot of opportunity within Global if you are wiling to work for it.  I have advanced my career while working at CSU Global every year that I have been here.  Whether that be through promotions in my former role, or moving to a new position and continuing to develop and advance within it.", "cons": "As a state university, the pay scale isn't as high as what for-profit universities will offer.  The flip side is that the benefits (PTO, 401-A, no social security tax, health) are outstanding and more than compensate for the wages.  There are also not automatic annual raises.  The flip side to this is that promotions are constantly available for those who put in the work."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "A FOR PROFIT MASQUERADING AS A NOT FOR PROFIT", "rating": "2.0", "reviewer_affiliation": "Current Employee", "job_date": "4 Aug 2016", "job_title": "Admissions Advisor in Greenwood Village, CO", "duration": "N/A", "pros": "The tenured enrollment team of two plus years is amazing but declining in population every day, being replaced with inexperienced sales reps calling themselves enrollment advisors. There is only 1 pro now and that is the ability to work remotely. This is the universities only way to keep people working, however many new employees leave after only working a few weeks.", "cons": "Terrible moral all around, especially in admissions. They mislead you by stating that they are a not for profit but they clearly are running on a for profit mentality. They do not care at all about the well being of their employees, the President going so far as to say in team meetings that if you don't like, then leave, you can easily be replaced. A very toxic place."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "A great group, a great team", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "16 Jun 2014", "job_title": "Marketing in Englewood, CO", "duration": "N/A", "pros": "The atmosphere and work environment is fantastic.  The team is devoted to their work, and seeing anything other than a positive attitude from a colleague is both rare and short-lived.  People are friendly and pitch in to help each other out of jams...even at their own expense.  I have never been part of such a positive, collaborative crew before, which says a lot because I have been fortunate enough to have many great jobs in the past.  I have seen a few of the other reviews here mention poor leadership and so on, but my experience couldn't be any more different.  Perhaps other teams don't have the support and camaraderie that I've seen, but, to be honest, all of my interactions with other teams have been just as productive and pleasant as with my own.", "cons": "The pay could be higher.  If I were to move on, that would be the reason.  Otherwise I can't think of anything that I would change at all."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "A place where you can really make an impact", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "11 Sept 2014", "job_title": "Anonymous Employee in Greenwood Village, CO", "duration": "N/A", "pros": "CSU-Global is a great place to work; you are directly contributing to the great good of higher education for adults who might not otherwise have the opportunity to get a degree, you work with great people in a fast paced and collaborative environment, and you will never be bored.The benefits are phenomenal, the pay is competitive, and you have opportunities to work in different spaces no matter your department. If you work hard, you will be rewarded in a variety of ways and with various opportunities. The growth that has occurred here (number of students, number of employees, degree programs, technologies, etc.) is impressive.", "cons": "It is fast paced, as in: we accomplish more in a month than some companies do in a year. With fast pace, comes a lot of change, so if you like your everyday to be the same, day in and day out, CSU-Global might not be the place for you. The culture is also highly accountable so this place isn't for slackers."}], [{"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Adjunct Faculty earn aproximately $17 per hour", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "18 Oct 2017", "job_title": "Adjunct Faculty Member in Chicago, IL", "duration": "N/A", "pros": "Students seem to be higher caliber than average online students.", "cons": "1. Faculty are \"mentored\" by other faculty peers who evaluate them monthly by subjective means and lurking in courses.  If one assignment out of hundreds is graded late, points are deducted for late grading.  There are no legitimate excuses for faculty to be late, though students are allowed an entire week to turn in assignments late with no penalties.\r\n2. Faculty are expected to volunteer time as subject matter experts, to serve on additional committees, attend faculty meetings, additional Monday morning meetings, etc..\r\n3.  No raises or bonuses for faculty for over five years.\r\n4. Faculty policies are stated with a disclaimer that they may not be followed, at will."}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Great place to work", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "27 Jul 2020", "job_title": "Adjunct Faculty in Salina, KS", "duration": "N/A", "pros": "Love the curriculum design, Canvas LMS, support from mentor and program chair. Students are wanting to learn and for the most part do a good job. They are fairly constant about giving me two classes each 8 week session. Also they make contributions to our pension plan which is awesome.", "cons": "Pay could be a little better. They pay on a per student basis and if there is a low enrollment course, you may not get very much. High enrollment courses are much better compensated. Also you don’t know which class you will be teaching until two weeks out. I would like to plan out what courses I have from all of my schools ahead of time to see if I need to accept more or less work."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "The best thing about this organization is leaving it.", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "26 Apr 2016", "job_title": "Anonymous Employee in Greenwood Village, Arapahoe, CO", "duration": "N/A", "pros": "Employees make up the positives to the culture of this company. You will get a team effort from the employee base when you are trying to do yours and someone else's job. Great for a fresh out of college job, but wouldn't recommend staying longer than a year if you can stand it.", "cons": "Unrealistic expectations from management that also require overworking the staff. You will find yourself replacing someone else in their position, taking on their additional duties, but don't expect equal pay for equal work. Your best training is how well the person before you did it and if you have the opportunity to shadow them or if they left training details. Otherwise, you are on your own. The operations are run so lean there is never any time spared for new employees to learn processes before they're changed again, since they weren't well thought through the first time. Ambition goes unappreciated at this organization. The pay is very low, but comparative to other organizations for fresh out of college starters. You'll feel your efforts are wasted though, very soon after starting there."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 5, "Senior Management": 1, "review_title": "Enrollment Counselor", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "17 Apr 2015", "job_title": "Enrollment Counselor in Greenwood Village, Arapahoe, CO", "duration": "N/A", "pros": "Amazing people to work with and the environment is fun! Being an enrollment counselor at CSU Global is a lot less \"salesy\" than other places. There is not as much pressure on having \"the perfect phone call\". \r\n\r\nThe direct supervisors and Vice President are also really great and caring as well!", "cons": "The president does not appear  care about the employees unfortunately, and it is felt through the entire department. The lack of support or praise from the president and \"higher ups\" is discouraging. It feels like no matter what you do, you are never good enough. Getting a response back when saying hello is few and far between."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 5, "Senior Management": 1, "review_title": "It seems good, but with tenure you realize the pain and how little they care about you.", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "14 Feb 2019", "job_title": "Information Technology in Greenwood Village, Arapahoe, CO", "duration": "N/A", "pros": "Co-workers, benefits, especially retirement, free education, exposure to lots of technology even if they’re not implemented correctly.", "cons": "You’re nothing to them, they’ll let you go without even giving you warning. You’re easily replaceable unless you make it to management and even then you are still on rocky roads. \n\nCSU Global isn’t a company for the millennial era. If you expect this company to care about you, you’re going in wrong. My advice to any potential hire is to go in work hard and know that even with that you’re not guaranteed to make it to retirement. It’s not a forever company and if you make it past 2-3 years then you’re doing better than most."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "A place where the student experience is first in the line of priorities.", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "5 Oct 2013", "job_title": "Anonymous Employee in Greenwood Village, CO", "duration": "N/A", "pros": "-A state agency that operates at the speed of private industry\r\n-Great benefits including medical, dental, retirement, annual/sick leave\r\n-A learning environment with no hierarchy to stop progress\r\n-An entrepreneurial workplace", "cons": "-Hard work-- anyone and everyone will be called on to do any task that needs to be done, regardless of title\r\n-Fast pace environment, if you are expecting to sit around with nothing to do, this is not the place for you"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Horrible Place to Work", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "5 Apr 2020", "job_title": "Student Advisor in Greenwood Village, Arapahoe, CO", "duration": "N/A", "pros": "Regular salary, remote work opportunities", "cons": "Where do I even start. CSU-Global purposely promoted a culture of negativity and fear. This comes from the very top. Dr. Takeda-Tinker runs the place like a dictator. No person is valuable within the organization and this made clear very regularly. If you work here, you will be expected take on an unmanageable amount of work. It’s the kind of workload that even the most skilled and efficient can’t handle in less than 60-hours per week. No one in upper management is willing to address larger issues and are quick to throw individuals and entire teams under the bus for not being able to perform to their unachievable standards. The saddest part is the students end up suffering the most because things are constantly changing and very often decisions are not made with their best interests at heart."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "A school that constantly strives to meet the needs of working adults", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "22 May 2013", "job_title": "Admissions in Greenwood Village, Arapahoe, CO", "duration": "N/A", "pros": "This is a school that constantly strives to meet the needs of the adult learner. I have worked for two other online colleges before and I never had a university who truly looks out for the best interest of their students like CSU-Global Campus. I love that the environment is fast-paced and the expectations are high. I also appreciate that an employee can walk into the president's office any time to share their thoughts and ideas. My previous employers wouldn't even let an employee book and appointment with any executive. Finally, the vacation time and benefits are second to none.", "cons": "If you cannot handle change, this is not the place for you. I love the fast-paced environment, but this is a place for top achievers. This a place for people who want to make an impact on the education world and not just take home a paycheck."}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Wonderful front-line staff, unclear vision from leadership, undervalued workforce.", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "30 Dec 2019", "job_title": "Enrollment Manager in Aurora, CO", "duration": "N/A", "pros": "-Wonderful front line staff. The most professional, engaged and genuine group of Enrollment Counselors I have ever had the privilege to serve.\r\n-Fully remote work and flexible scheduling is the single biggest benefit.\r\n-Excellent Faculty committed to building career-relevant programs and student-focused outcomes.\r\n-Values student experiences; committed to minimizing student debt through tuition lock and employer benefits. \r\n-Excellent 401A program.", "cons": "-Extremely low compensation for such large monthly goals.\r\n-Employees are highly undervalued for their efforts, tenure and experience.\r\n-Leadership is not truly committed to growing or developing their staff. Opportunity is based on personal preferences and treatment, not unanimous panel decisions. \r\n-Needlessly complicated procedures and policies create obstacles for students and staff.\r\n-Ubiquitous technology and internal operational issues make executing daily tasks nearly impossible."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "Working for one of the top online campuses in higher ed", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "13 Mar 2018", "job_title": "Enrollment Counselor in Denver, CO", "duration": "N/A", "pros": "I've worked in higher admissions for over a decade and CSU-Global is the 3rd university I've worked for and I plan to retire here.  I love working at and for CSU-Global.  The salary is enough and the benefits (insurance, retirement, time-off, holidays) are incomparable with anything I've ever seen anywhere else, so good, the best really.  I'm so proud to work here!\r\n\r\nCSU-Global is also a solution to many problems facing higher ed, in that we are a public university yet we do not receive any tax money nor governmental assistance, plus we offer a tuition guarantee so costs do not go up on students nor do we charge fees.  \r\n\r\nThe Office of Enrollment is extremely innovative and constantly changing, so  there are many opportunities to be flexible and adaptable, which keeps the job fun and exciting.   Working with adult students is honorable work and very rewarding because we are helping people change directions with their careers as well as get advancements.  It's really nice to be able to build relationships with students as we guide them through the admissions process.  The benefits of online education allow our students to maintain a healthy work/life/school balance and they can earn their degree from a great school, which is the same for us since we have opportunities to work remote as well.  \r\n\r\nIt is also such an honor to work for a military friendly university because we can welcome students affiliated with the military into the CSU-Global community and offer more than just academic support.  \r\n\r\nOur marketing materials are so helpful and great tools, especially our Briefing Book, which has all our data and is updated regularly throughout the year.  Our facilities are modern and we have great tech.  \r\n\r\nAttending graduation in June in Denver each year is a highlight too because that is a major milestone in our students' lives, it's always so positive and emotional.  \r\n\r\nWorking for a state university that is not-for-profit and regionally-accredited is such noble work and I'm so thankful for the opportunity to work here.", "cons": "There's really only two things I don't like about working here and that's leaving lots of VMs and missing monthly registration goals, but that's just part of the job and it's okay."}], [{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Been here about 2 years", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "12 Oct 2014", "job_title": "Student Advisor in Greenwood Village, CO", "duration": "N/A", "pros": "I've been at CSU Global for about two years now and I haven't seen anything unethical by anyone and I worked at a proprietary university which was definitely borderline. The leadership here is always concerned about our students and what we can do to help them. We are busy and my case load is big but I'm keeping up with my students. Whoever keeps posting negative things about our environment seriously needs to get a life.", "cons": "We are always busy but we really are helping students so I don't mind."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Very High Turnover Rate with an Unethical and Petty President", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "6 Oct 2014", "job_title": "Student Advisor in Greenwood Village, CO", "duration": "N/A", "pros": "Students and staff were a joy to work with and serve.  The curricula is well planned, and the professors and degree programs are legitimate and serve students well.  The school is in a unique position to offer an affordable and legitimate education if it can be well run and managed - an especially crucial service in this era of phony diploma mills and for-profit education.", "cons": "The only issues I've seen revolve around President Becky Takeda-Tinker and her mismanagement of  the administrative entities - in particular financial aid, and advising.  Caseloads are ridiculously large and only allow for reactive and prescriptive advising at best.  This means most students will flat out just not get the help and support they need.  \r\n\r\nEvery so often the president organizes a witch hunt to flush out any dissent - this is often done in the most immature and unprofessional ways possible and even includes active monitoring of Glass Door here.  When she sees any negative reviews or press here, she will ask a few pets of hers or anyone too scared to say no to literally come on to this site and write a glowing review.  I know this based on first hand experience and not rumor or speculation.  Decide for yourself if you want someone like that in charge of a university you work for or attend."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great University", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "1 Oct 2013", "job_title": "Anonymous Employee in Greenwood Village, Arapahoe, CO", "duration": "N/A", "pros": "I have worked for many colleges (for profit) and this is the first school I have been apart of that I can honestly say I enjoy. I like being treated like an adult and trusted to make the right decisions for my students. I do not do well when being micro-managed and that is one thing CSU-Global does not do. This University does a lot for its students and staff and it is very beneficial for all involved.", "cons": "The pace is fast and sometimes we seem reactive rather than proactive."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Enrollment rocks!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "11 Sept 2014", "job_title": "Senior Enrollment Counselor in Greenwood Village, Arapahoe, CO", "duration": "N/A", "pros": "We have so many students that want to come here which is great. Dr. Becky really cares about student success and she helps make sure that we aren't just pushing students into class. I agreed to the goals and I've been here over a year and already got a promotion. I missed some of my goals last year because they changed the processes but I didn't get penalized.", "cons": "Everything is very fast here. They told me while I was interviewing that it was fast so it wasn't a surprise. I would like to get another promotion but they just changed the department structure so now I don't know how far I can go here."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 4, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 4, "Senior Management": 0, "review_title": "I had High Hopes!", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "4 Aug 2016", "job_title": "Enrollment Counselor in Greenwood Village, Arapahoe, CO", "duration": "N/A", "pros": "CSU-Global is one of the leading forefronts for online education. I was very proud to accept a position at this University. The product very much so \"sells\" itself. Honestly, when speaking to students about their future, I was proud to offer them what CSU-Global itself says in their mission, the PREMIER ONLINE provider of innovative higher learning opportunities for nontraditional students in Colorado and beyond. I really felt proud to be a part of something that was really a Global force. The University does care about their students and their success and we have such a rigorous application process because we want to provide the best for the best! The enrollment team is a team of dedicated individuals who selflessly go above and beyond for our students. I never questioned the people who I was surrounded by everyday!", "cons": "The University is lost. Because the field of Online education is now more competitive they are now resorting to For-profit like tactics to attract their students. The University does not need that. The quality of the education and innovation speaks for itself. There does not need to be a cut throat approach to getting students. If that is the mentality of attracting students, then CSU-Global is bound to wind up just like all of the other For-Profit Universities that have FAILED."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "A great place to grow your career and do innovate work", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "24 Jan 2019", "job_title": "Marketing in Denver, CO", "duration": "N/A", "pros": "-Respectful\r\n-Innovative\r\n-Responsibilities that allow you to make the position your own\r\n-Working here will prepare you for great opportunities internally or externally\r\n-Exciting industry and not your typical stuffy university. More like an innovative, fast-paced startup\r\n-Incredible work-life balance, benefits, and self-satisfaction. If you are passionate about what you do, good at what you do and want to see your career grow then this is the place for you.", "cons": "-Salary- It's a semi-fair salary but its also a university. If you're driven by money this is not the place for you\r\n-Fires- Being fast paced means that fires can arise more often. Better planning can help reduce."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Mixed at best. Great people, cut throat administration", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "24 Apr 2015", "job_title": " in Denver, CO", "duration": "N/A", "pros": "good opportunity to learn best practices in online higher ed", "cons": "the hr reviewer who spoke of 90% retention is giving a partial picture.  The turnover among employees is high.  Instructors stay because they are part time and it is decent money for part time work.  Administration turns over rapidly due to odd priorities at the top."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 5, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Great Place to Start Your Carrier Over", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "10 Jan 2019", "job_title": "Project Manager in Greenwood Village, CO", "duration": "N/A", "pros": "401K is Awesome 11% match adds up quick. \r\nWork from home (Many people do two days a week)\r\nStaff is friendly excited and hard working (there are no slackers at CSU-Global)\r\nInnovative and meaningful mission - ‘Preparing nontraditional learners for workplace success in a global marketplace through education.'", "cons": "Lots of opportunity through staff turn over (normal in a tough competitive job market)\r\nRecent departures have created real holes in Executive Management"}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Happy here for years", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "6 Nov 2016", "job_title": " in Greenwood Village, CO", "duration": "N/A", "pros": "Great work environment and we are setting the standard for student results. Hard work pays off here and you have alot of great minds to collaborate with on a daily basis", "cons": "Tough to keep up with budget goals at times. Focus has to stay on quality. Decisions from Sr Leadership can be make with little to no transparency when these affect someones job, or life."}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 0, "Senior Management": 5, "review_title": "Sets the bar high", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "18 Jul 2019", "job_title": "Enrollment Counselor in Denver, CO", "duration": "N/A", "pros": "The ability to work from home was great. My manager, Jenny, was exceptional. She is passionate and has a great sense of urgency in getting tasks completed. My coworker s were extremely supportive. The environment is challenging but it supports growth and understanding.", "cons": "There are some issues with technology. It is difficult to meet goals when these technology challenges arise."}], [{"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "If you're offered this job...RUN!", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "15 Jul 2019", "job_title": "Anonymous Employee in Greenwood Village, Arapahoe, CO", "duration": "N/A", "pros": "Benefits and Vacation time offered", "cons": "First and foremost, since I know people rarely read all of these long-winded reviews, I want you all to know that you shouldn’t believe most of the 5 star reviews on here. I know for a fact that current employees added their reviews to try and boost CSU-Global’s glassdoor score. This is not conjecture – they told me they did it. They are not honest reviews and that’s why they aren’t detailed. \r\n\r\n Anyway, I don’t normally leave reviews, ever, however I feel compelled to warn the world about this place and the harm that it causes. I waited until the emotional PTSD from this company wore off before I wrote my review so that I could be sure that my review was honest. And in ALL HONESTY…run for the hills if you’re offered a job here. Seriously, you’ll thank me (and all of the other reviewers who said so) later. I've know multiple people who left here and needed medication or therapy, not joking. \r\n\r\nThere’s so much to warn you against but in an effort to keep it as short as possible, let me sum it up for you. I’ve never worked at a company where so many people leave against their will (ie, they are fired or laid off). I distinctly remember that during the first all-staff meeting I attended, Dr. Becky said that they expect everyone to work hard (an understatement) and not expect to be paid much (a truthful statement) and if you don’t like it, you can leave. She then proceeded to start almost every meeting that way for the years I worked here. Clearly, it's a churn and burn mentality. \r\n\r\nAnd that, right there, is the crux of the problem with CSU-Global. Everyone, and I mean EVERYONE, is dispensable. It does not matter how hard you work, how many hours you put in, the title you achieve, even how ethically you approach your job…you mean nothing to Dr. Becky. CSU-Global likes to put its people into positions that they are not prepared for, not provide any training or resources and then when they, inevitably, fail, fire them and get someone else to do the work instead. Never once do they stop and ask what they are doing wrong? That’s the first sign of insanity, right? Doing the same thing and expecting a different result…Dr. Becky will never take responsibility for the awful conditions she both tolerates and perpetuates. Why? Well, she gets “results,” according to the Board of Governors. And, apparently, they don’t seem to mind who she mutilates in order to get those results. \r\n\r\nIntrospection and self awareness are foreign terms to Dr. Becky, she's the most clueless person in the university. The most ironic part is that NO ONE tells her anything, they hide most of the issues from her because they know that as soon as she finds out, she'll overreact and start reorganizing and firing. This literally just happened to an entire department THAT WASN'T BROKEN - their numbers were better than most universities...but she overpromised and underdelivered and had to throw someone under the bus. For example, she has no idea that the student management system has been in shambles for over a year. She doesn't know half of the systems are broken or partially working, making everyone's job more difficult. I sat through meeting after meeting where there were plans about HOW to hide things from her. Honestly, she's a joke and a cancer to a university that could be great. But it will never be great with an imbecile leading it."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Enrollment heaven", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "3 Aug 2018", "job_title": "Enrollment Counselor in Greenwood Village, CO", "duration": "N/A", "pros": "Remote employment, great benefits, positive culture, non-profit state university with non-traditional adult learning model, uses SalesForce for the CRM, weekly Zoom team meetings to stay connected, TONS of support from management and peers, lead flow is steady, management communicates and coaches Enrollment Counselors regularly.", "cons": "Lower end of the salary spectrum, but that is offset by not having to pay for gas, tolls (in Chicago),  and benefits."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Avoid! Overworked, Underpaid, & Culture is Nonexistent", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "19 Jun 2019", "job_title": "Academic Advisor in Greenwood Village, CO", "duration": "N/A", "pros": "The team that I had the pleasure of working with for over a year were incredibly supportive and helpful. We worked together everyday and never hesitated to help one another.", "cons": "There is a very clear \"There's the door\" policy at CSU-Global. Senior Management is completely out of touch with what happens on a day to day basis in each department. They refuse to invest in making sure their technology supports their online platform (they are an online school!) and blame advisors, enrollment counselors, and every other department when student's leave due to things not working. They advocate 'change' as their claim to fame--i.e. if something does not work for the student or for the employee in terms or process or course , they change it! Boy do they ever. \r\n\r\nAs of 6.18.19, they fired the entire advising department, including supervisors, demoted everyone to a \"student success counselor\" and gave everyone 3 days to decide if they'd like 'reapply and re-interview' for the new position or leave. They have answered no questions about the job so that employees can make an informed decision about their career change and did not warn or tell anyone of this impending change to help with the transition. Change=they will and have historically fired everyone in a department with no reason and then wonder why they are hemorrhaging students. Be wary of recent positive reviews of this company as it may be HR trying to improve the CSU-Global rating because they cannot get anyone to apply for their jobs. Please, do not work here. The turnover is so high, the workloads are unmanageable, and they operate on a skeleton crew and will dispose of you without any regard to what you've done for them. \r\n\r\nYou will put in extra unpaid time just to keep up with the insane workload. The technology to support the online university regularly breaks down and their database is so out of date that they cannot change it."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "And The Award For The Worst Company Ever Goes To: CSU-Global. Good Job, Guys. You Won Something Real", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "13 Jul 2019", "job_title": "Customer Success in Denver, CO", "duration": "N/A", "pros": "I like my team mates. But they keep firing them.", "cons": "Wow...I'm not sure where to start. Maybe that 40 people just got fired without a reason. It's like an episode of Survivor. Who's next? Everyone is scared to lose their job because they're outsourcing everything. No one knows who's going to be next, and that's how they like to keep it. People keep getting demoted for no reason, and people who have absolutely no idea how to manage are promoted to management positions of teams they've never worked in before. Everyone is miserable, and you always feel like management is mad at you, and you don't know why. I've been told that other if anyone complains about how the president is treating them, they're fired. They do firings twice a year, and they never give a reason other than \"restructuring.\" And it's usually whole groups of people at once. They literally divided the IT team into two rooms one year and fired everyone in one room. Don't worry, though: They eventually fired everyone in the other room, too — IT is outsourced now. The people who are actually good at their jobs are totally degraded — maybe because leadership doesn't want them to think they're doing well and ask for more? Because no one EVER gets raises (even though they promise you you will when you sign up). And to get a \"bonus,\" which I've heard two managers joke \"will buy you a cup of coffee,\" you have to meet unreasonable goals. Everyone is overworked because they're short-staffed, and there's absolutely NO appreciation given for the amount of work everyone puts in. It's insane. You get \"Employee Recognition,\" which isn't worth anything because the people who get it could totally be fired the next month. It means nothing. Everyone I've met who's left this place has not only made more money elsewhere but is so much happier. Do yourself a favor and stay FAR AWAY from this place. Oh, and by the way, management asked me to go onto this site and write a good review because they're pretty much all bad — unless they're fake. Obviously, I'm not doing that...because my parents raised me to be an honest person."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "Worst Experience of my Life", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "2 Sept 2013", "job_title": "Admissions Advisor in Greenwood Village, Arapahoe, CO", "duration": "N/A", "pros": "Good school for students, quality education", "cons": "management makes decisions based on perception vs. reality, harassing management style, double standards for employees, toxic environment, discrimination based on civil rights measures (ADA, gender, race, etc.)"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Great education opportunity, less than stellar management", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "21 Oct 2016", "job_title": "Anonymous Employee in Greenwood Village, CO", "duration": "N/A", "pros": "Some people get to work from home and it is nice to not have to deal with the drama and having managers constantly looking over your shoulder telling you to hit numbers. You can take classes if you would like and the education is great quality. Once you get past the b.s. of admissions, the classes are easy to understand and professors are there to help. That's about it. The whole job/place started out much better than what it ultimately became in the end.", "cons": "There was a lot of potential for this to be different from the other online schools, but with new management came the old school ways of running like a for-profit. When I started it was about the student contacting us to finish their degree. That type of student was much more responsible for their education and took it seriously. They did what was asked of them in order to succeed in the university. New management came in and the structure shifted to the for-profit model of chasing students and calling multiple times a day. But, don't you dare point that out to management. The type of student they are marketing to now is the student who wants a free laptop or pell jumper. If you don't have serious students and want to keep introducing new plans like focusing on Freshmen and selling specific degrees, you should just admit you are now a for-profit who focuses more on quantity than quality. \r\n\r\nMeetings are all about how to sell different degrees but we shouldn't be pushing students to get a certain degree. It is all about numbers of dials and talk time. The same people are recognized and it feels gross to have to waste an hour of your day each week to listening to the same names being recognized for numbers, numbers, numbers. If you don't hit high numbers every term, you are on a warning and can expect the pressure of whether or not you will have a job next month. \r\n\r\nIt used to be fun to go in and see co-workers, but there are so many now that no one knows anyone else. The new management has hired double the amount of counselors who are pushy sales people instead of those who listen to what the student actually needs. I've heard it first hand and had students thank me for being honest and recommending alternative options instead of forcing them to spend more money or time if CSU-Global is not the best fit for them at this time. It's best to go in, do your job and go home. They have created a very competitive environment among employees and it's very uncomfortable. We used to hang out with one another outside of work, but that changed with doubling the number of counselors and creating teams that compete against each other. They are putting attention into these games where you're against other counselors instead of working as a team. \r\n\r\nYou take home a lot of stress and anxiety because you want to do what is best for your students (the whole reason for the university!), but you have to hit other matrix numbers in order to be there. I used to know my students much better before we switched our management structure. That place made me a very angry, antisocial, stressed out person. The second I left, I felt a huge weight lifted and I feel I can be happy again. I'm not alone. There is a huge turnover and when you start to see the tenured counselors seriously looking for other jobs and leaving unexpectedly, take note. They're losing a lot of really great employees who just can't put up with the crap anymore."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Good", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Global is rough", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "5 Apr 2017", "job_title": "Enrollment Counselor in Greenwood Village, CO", "duration": "N/A", "pros": "Some of the nicest, most hard working, smart, fun, attractive, generally awesome people I've ever met work here.", "cons": "This place will take great people and work them to the bone until they're miserable, salty, and dying for something else.  Employees at Global are completely disposable. Global makes you feel like if you can't cut it in their uber -fast-paced-never-good-enough-environment there must be something wrong with you. Say good bye to lunch breaks and be ready to work tons of thankless overtime and not nearly enough money for what you're giving of yourself.   It's just how it is there."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "You got a job offer? Great. Read the bad reviews and DO NOT accept it.", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "7 Jul 2018", "job_title": "Anonymous Employee in Greenwood Village, CO", "duration": "N/A", "pros": "- People look out for each other, are understanding and collaborative\r\n- Good 401k matching\r\n- Due to excessive turnover there is a lot of upward mobility\r\n- Flexible regarding remote work", "cons": "- Dr. Takeda-Tinker is a morally bankrupt individual who cares ONLY about how much money the business is making. The other reviews saying that she says unhappy employees should leave/get fired is 100% true. Speaking out for improvements can get you fired. It is run as a for-profit, and she cries poor because tuition is their only funding, but they are making money for the CSU System hand over fist and trying to explode student enrollment.\r\n- Given that toxicity, the senior leadership team all either share her \"make more money at all costs\" outlook or are spineless collaborators who want to keep their jobs. Every department is understaffed and unreasonable goals are set to encourage overwork. PTO is difficult if not impossible to take. On a tour, people will be shown a ping pong table that has not been used in over a year.\r\n- There are no raises, even cost-of-living. A meager bonus may be provided based on \"university performance.\" Salary is \"determined once per year based on regional salaries of similar job titles,\" but there is no method of improving your job title aside from becoming a team lead or manager - other employee titles are flat within each department. You will get hired at a lower salary than you are worth, with promises that it can be increased later. There is no later.\r\n- Dr. Takeda-Tinker is obsessed with keeping employees \"mobile\" within the office, so every few months leadership forces everyone to move desks - sometimes even just one desk over. Leadership will ask you to \"depersonalize\" your desk if you decorate it too much.\r\n- All decisions are top-down without any input from employees or middle managers, and leadership will force compliance over any objections or differing viewpoints. It is a Very Bad Thing if you show them anything they don't want to see, even if it's an opportunity for improvement."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Adjunct Faculty - Steer Clear!", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "10 Jun 2016", "job_title": "Adjunct Faculty in Colorado Springs, CO", "duration": "N/A", "pros": "Quick response to changes within higher education landscape, earning continuing HLC accreditation, new program offerings, and a few really nice colleagues.", "cons": "Constant addition of more work.  Grading is ridiculously repetitive for feedback for students; courses being constantly monitored, and the most cumbersome Schoology learning management system on the planet."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Dysfunctional and Unorganized", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "27 Jan 2018", "job_title": "Enrollment Counselor in Remote, OR", "duration": "N/A", "pros": "Time accrued (which is hard to take.. Hadn’t accrued much time since I was not in the position long enough... BUT when management tells you it’s hard to take off, then that tells me why so much time is given.\n\n-Working Remote (The equipment is so 90’s though)\n\n-Free Tuition for you and/or spouse or dependents \n\n-Benefits begin day one", "cons": "Various Systems (Too many for 1 position).. Minimum 10 for sure. \n\n-Over Worked & Stressful\n\n-Ineffective Remote Work Model\n\n-Unengaged Management Team\n\n-Metrics Driven \n\n-Systems (Not In Real Time) \n\n-Paid Monthly \nNo Incentives \n\n-Low Pay (For the several white hats you must wear)\n\n-Info Dumped \n\n-If you have a MBA, they really express how it is no longer the way to go. (It is a 80’s thing)...Because CSU-Global doesn’t offer it. Just disrespectful\n\n-Slander of For Profit Schools, but hire people from them.\n\n-High Turnover Rate\n\n-Very Unorganized \n\n-Incompetent \n\n-For Profit work ethics (which CSU-Global is actually worse.. I would go back to For Profit any day)\n\n-Advancement takes 4+years (INSANE.. That is NOT any motivation). \n\n-A year Learning Curve (If it takes me a year to learn a job, then there is something wrong with the position.) \n\n-14 levels of Enrollment (Meaning you might start off at a  lower or higher level based on your salary which determines your EC rank.. which is the most ridiculous thing I have ever heard)\n\n-Aggressive Enrollment Goals. (Can average anywhere from 13+ a month after you have been there at least 4 months. I saw some EC’s Goals were even as high as 25 a month. (Who does that?? Heck For Profit doesn’t even do that) HOWEVER, if you have “previous experience in the industry”, they expect you to come in fast paced and impress them moreso in the first 4 months. They are very repetitious with saying “you will do well because you worked in the industry before).. YES, one may have excelled well in their previous experience and have great skills BUT... just because it’s the SAME SCRIPT, it is yet a DIFFERENT CAST.. (which means I may know how to do XYZ, but I have to learn the CSU-Global way.. and per the learning curve, you just told me it would take a year to learn.. So you cannot expect one to come in and BOOM they making it happen like that.. that’s so unrealistic) No one has time for that. This school really likes “INSTANT COFFEE “. .. Sometimes it’s better to BREW it! \n \n-Evaluations are based on metrics every 6 months (which means you could lose or advance in pay...\n\n-I honestly think that half the people that work in the enrollment department are settling. You can see in many of their faces (via zoom meetings) that they are MISERABLE. Majority of them come from For Profit Schools. I’ve worked in the For Profit industry before and in almost 3 weeks of working for CSU-Global , I have never felt so stressed in my life. I literally had anxiety everyday. Very overwhelming!! I do understand that it can be complicated to find great and stable employment for some, but this is NOT the season to SETTLE. People PLEASE KNOW YOUR WORTH!"}], [{"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Used to be great", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "16 Nov 2017", "job_title": "Anonymous Employee in Greenwood Village, CO", "duration": "N/A", "pros": "The benefits here are one of the best parts of the job and make it difficult (but not impossible) to leave.  You have an enormous amount of paid time off (though you can rarely take it).  Telecommuting possibilities are fantastic.  There are a lot of great people who work here also but management is slowly driving them all out.", "cons": "This place used to be great and I loved coming to work everyday. CSU-Global has seriously declined in the last few years with poor management. There are many questionable promotions and hires, which left many of us questioning upper management and being frustrated with incompetence. \r\n\r\nMore people are being brought in from the for-profit schools so it is being run like a for-profit school.  From the top down the message is very clear- if you don't like it- leave.  There is zero emphasis on employee retention and the result is you have a lot of people doing jobs they have no business doing and a very unhappy workforce.  \r\n\r\nThere are some very shady business practices being used to drive enrollment numbers (pay cutting and demoting enrollment counselors for not enrolling enough students).  Students who should be advised that this is a poor match for them academically are being pushed into enrolling just to meet numbers. \r\n\r\nAdministrative rolls are extremely understaffed from transcript evaluation to enrollment support to tuition planning.  High turnover doesn't help any of these departments (from the lower management level down).   You can't keep pushing enrollment counselors to enroll more students if you don't provide any support, but the support roles at CSU-Global are seriously undervalued in terms of monetary compensation so roles are hard to fill and keep filled."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Enrollment Counsleor", "rating": "2.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "3 Jun 2015", "job_title": "Enrollment Counselor in Bailey, CO", "duration": "N/A", "pros": "Good people, and flexible hours", "cons": "Management is clueless about pulse of company and expectations put on the people in the trenches. Tarnishing the State Education System by trying to run a for-profit model of enrollment"}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Biggest regret of my life, not to be confused with the real CSU.", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "21 Feb 2018", "job_title": "Enrollment Counselor in Denver, CO", "duration": "N/A", "pros": "Great coworkers, the teams are wonderful and high levels of communication between front line staff. \n\nRemote opportunities \n\nGood time off (but you can never use it if you want to keep your job!)\n\nGood benefits package", "cons": "Pushing a product down potential students throat by what is essentially cold calling (even if leads are 5+ years old) \n\nBad education model \n\nTerrible leadership \n\nHigh anxiety environment\n\nExtremely unorganized \n\nGoals that can sometimes be impossible to hit \n\nRestructuring the entire company based on the book “Four Disciplines of Execution” it’s awful and everybody was much more motivated before you started harping that model on us\n\nTerrible equipment \n\nDon’t include Ecopass for employees, yet are located right near the light rail and the DISASTER that is I-25\n\nLow pay for high volume work \n\nEC model is ridiculous (15 levels, have to be exceeding your goals to move up) most of the time people just get demoted. And yes- this affects your pay. \n\nOne pay period PER MONTH (not like it matters because you are hardly getting paid anything)\n\nCONSTANT slander on for-profits even though they’ve learned everything they know from for profits and most likely have even worse ethics and low transparency. CSU is a glorified for profit without the high efficiency and organization of a for profit.\n\nBULLY students into starting school. Even if the student has a legitimate excuse (death in the family, sickness etc) it’s really sad. Your manager will pretty much bully you into bullying the student to start. \n\nCondescending. If a student wants a different program (MBA for example... which is an amazing degree to have) you have to pretty much tell them that degree is out dated just so they can start CSU’s masters of science in management because CSU Global is not allowed to offer an MBA.....\n\nHonestly this place should not even be associated with the CSU system. CSU Fort Collins is an amazing big name school. If only they knew how global was being run..."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "First line positions (student service, financial aid) have good people", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "12 Oct 2019", "job_title": "Anonymous Employee in Lakewood, CO", "duration": "N/A", "pros": "Student Focused, Cutting Edge, great faculty,", "cons": "A lot of turmoil and changes all the time, computer systems do not work together,  A lot of people fired or laid off having a lot of experience leave the company."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "It could be a great place to work.", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "6 Mar 2018", "job_title": "Anonymous Employee in Greenwood Village, CO", "duration": "N/A", "pros": "I met some great people there who truly love helping others reach their higher education goals.", "cons": "Upper management needs an overhaul starting with the university president, Dr. Becky Takeda-Tinker. She will start all-staff meetings stating that if you aren't happy then you should leave the company, and she will be okay with it. There is no sense of employee loyalty and many fear that one mistake will cost them their job."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "DO NOT WORK HERE. The President is an evil women.", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "3 Sept 2019", "job_title": "Student Advisor in Aurora, CO", "duration": "N/A", "pros": "Good coffee, nice bathrooms, free air", "cons": "Too many cons to count. The worst president or leader I have ever worked for. She will shake your hand then stab you in the back. The ONLY thing she cares about is photo ops, and being in the news. She does not care about YOU!"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Very Supportive Environment", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "19 Oct 2019", "job_title": "Enrollment Counselor in Aurora, CO", "duration": "N/A", "pros": "Incredible training and super supportive group of managers!  Extremely welcoming and a fun group of people to work with.  Excellent benefits", "cons": "Can't think of any at this time."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Proud to work here", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "16 Aug 2018", "job_title": "Administrative in Denver, CO", "duration": "N/A", "pros": "The ability to run with an idea and support the mission is exciting. The university works hard to be competitive and innovative.", "cons": "No HSA for benefit options"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "I wish I could give a negative star", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "5 Jan 2020", "job_title": "Tuition Planning in Denver, CO", "duration": "N/A", "pros": "You use to be able to say health benefits now not too sure", "cons": "CEO, management, disorganized, unprofessional, no one cares about you or the people you work with."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Best Work Environment Ever", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "18 Nov 2013", "job_title": "Enrollment Team Lead in Greenwood Village, CO", "duration": "N/A", "pros": "Leadership staff is very supportive and amazing!", "cons": "There are none! Everyone is happy to come to work and there is definitely a great work/life balance"}], [{"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "The basics", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "9 Sept 2020", "job_title": "Associate Enrollment Counselor in Aurora, CO", "duration": "N/A", "pros": "A great retirement plan with generous employer matching", "cons": "Expect change to be the norm"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "No micromanagement", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "10 Jun 2018", "job_title": "Enrollment Counselor in Remote, OR", "duration": "N/A", "pros": "Student focused and excellent training", "cons": "I have no negative remarks as of yet"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Not Worth It", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "5 Aug 2019", "job_title": "Admissions Counselor in Denver, CO", "duration": "N/A", "pros": "Work from Home \r\nNo weekends\r\n401K", "cons": "No Bonus\r\nPay is based on who they like\r\nNo update on equipment \r\nStressful \r\nVery number driven \r\nMicromanagement"}]]