[[{"date": "13 Jun 2023", "title": "Box Office Attendant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Berklee", "Interview Descriptions": "It was a very smooth process. The recruiter is very nice and understanding about a student's schedule. As long as the candidate stays calm and express their own opinions, everything should be alright.", "Interview Questions": "Tell us something about you."}, {"date": "13 Mar 2023", "title": "Work Study Student Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Berklee", "Interview Descriptions": "Two guys interviewing me, was a very weird experience. It was extremely awkward, but it was a pretty short interview. It was a very average interview process, nothing remarkable happened except for one weird question.", "Interview Questions": "Basically asked me how I would fit in within an all male environment and how I would deal with inappropriate jokes. Not in those exact words but essentially what was asked."}, {"date": "10 Mar 2023", "title": "Director Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Berklee", "Interview Descriptions": "Interview with hiring manager had standard questions. Tell me about yourself, why Berklee, and a few other questions. Hiring manager was friendly and personable. Seems like a good place to work at.", "Interview Questions": "1. Leadership style 2. Most challenging job"}, {"date": "10 Aug 2022", "title": "Director Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Berklee", "Interview Descriptions": "Normal process interview. They asked standard questions with the standard involved parties. It was a satisfactory process. I would interview with them again but would never work for them again", "Interview Questions": "I don't remember what they asked"}, {"date": "7 Aug 2022", "title": "Full Time Faculty Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Berklee", "Interview Descriptions": "They were gracious and friendly and it all went very smoothly.  The process took the entire day, which included a very lovely dinner at the end of a very long day.", "Interview Questions": "How would you handle working in  a diverse student population?"}, {"date": "18 May 2022", "title": "Part-Time Faculty Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Berklee", "Interview Descriptions": "30 minute Zoom interview with two people from the hiring committee. They asked me a few questions for the first  10 minutes,  and I spent the rest of the interview leading the conversation. They said I would hear follow up the next week. After a week, I emailed the administrative assistant who scheduled the interview asking for an update, and never heard back. 6 weeks later, I got an automated email saying I was being passed on.", "Interview Questions": "How would you handle conflict in the classroom?"}, {"date": "15 Feb 2022", "title": "Stage Crew Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Berklee (Boston, MA)", "Interview Descriptions": "Had an in-person interview, where we discussed the responsibilities of the role and mine and the employers expectations. Then I  had a training session with current employees and managers, where I was taught how to use the sound / lighting equipment.", "Interview Questions": "Why do you want to be part of the Berklee stage crew?\r\n\r\nWhat experience do you have working in live events, using mixing consoles and lighting equipment?"}, {"date": "7 Nov 2022", "title": "Talent Acquisition Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at Berklee (Boston, MA) in Feb 2022", "Interview Descriptions": "Phone screen, interview, and panel interview with TA, HR, and the hiring manager for the department. The process was about 30 to 45 minutes for each interview. The panel interview was about an hour with 6 stakeholders the positions crossed over with.", "Interview Questions": "Behavioral based interview questions and DEI focused questions"}, {"date": "17 May 2022", "title": "Office Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Berklee in Feb 2022", "Interview Descriptions": "Really clear about timelines and had a really amazing community to reach out to! Really wonderful process and they were excited to hear about my experiences. Every employee and person I spoke to was kind and gave a clear lone of communication. Great experience all together!", "Interview Questions": "What would make you a good match for this position?\r\nTell me about something creative you'd like to do in the future using your skills?"}, {"date": "15 Feb 2021", "title": "Assistant Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Berklee (Boston, MA)", "Interview Descriptions": "Very thorough. In the process, I met a lot of individuals across the institution who helped to paint the picture of the workplace. The interviews were back to back, so it did feel like a tight schedule.", "Interview Questions": "What unique qualities would you be adding to the team?"}], [{"date": "14 Jan 2021", "title": "Assistant Chair Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Berklee", "Interview Descriptions": "Excellent, well prepared and organized. The process was smooth and well designed. All information was communicated ahead of time. The accommodation was in perfect location and all members of the interview panel made me feel at home.", "Interview Questions": "Why are you applying for this position "}, {"date": "22 Feb 2022", "title": "Studio Operations Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 1 day. I interviewed at Berklee in Jan 2021", "Interview Descriptions": "Really chill interview if you get called for interview you are basically in ask about who you are what you want to do nothing special last about half an hour", "Interview Questions": "Who are you and why do you want this job"}, {"date": "27 Aug 2019", "title": "International Admissions Counselor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Berklee", "Interview Descriptions": "I applied online and was contacted by the director of international admissions office. I was invited to the Skype interview for 30 minutes (through the Google hangout). The actual interview time was about 20-25 minutes.", "Interview Questions": "what is your philosophy?"}, {"date": "14 Jun 2022", "title": "Lab Monitor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Berklee (Boston, MA) in Oct 2018", "Interview Descriptions": "The interview was with 2 of the department's supervisors where I was asked general questions about myself and experience with music technology. I was also asked to provide a solution (verbally) to common Mac computer tasks and DAW troubleshooting, walking through each step of the process.", "Interview Questions": "How do you make sure the Mac is recognizing a MIDI device?"}, {"date": "20 May 2020", "title": "Social Media Marketing Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Berklee (Boston, MA) in Sept 2018", "Interview Descriptions": "After submitting an email application and resume, I attended a casual interview with the woman who would become my supervisor. The interview probably lasted 30 minutes and took place in the office's conference room. My supervisor was very personable, and the interviews were spaced so that I never interacted with anyone else applying.", "Interview Questions": "What do you know about this department?"}, {"date": "18 Jul 2018", "title": "Lab Monitor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 5 days. I interviewed at Berklee", "Interview Descriptions": "Interview was in relaxed environment. I was asked about my abilities and skills. More skills taught throughout orientations and sessions. Great people to work with and learn about school and music programs.", "Interview Questions": "What are you good at?"}, {"date": "15 Feb 2018", "title": "Assistant Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 5 weeks. I interviewed at Berklee (Boston, MA) in Dec 2017", "Interview Descriptions": "I interviewed for a half day with the entire team I would be working with. I felt like we were engaged in a conversation, not going through the expected motions just to get the interview over with. I left the first interview feeling like I had done well and that all my questions had been answered. My subsequent interviews focused on how I would perform in my job and collaborate across the institution, and were fun and engaging.", "Interview Questions": "What are your thoughts on delegation and empowerment for program execution?"}, {"date": "30 Aug 2017", "title": "Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Berklee", "Interview Descriptions": "Applied online in January 2017. Got an email for a phone screen in probably late February or March. Phone screen was with an assistant who had no clear information about the job but was \"asking some questions for the hiring manager\" who was on vacation. \r\n\r\nDespite the interviewer having no clear understanding what the position was, nor how my background fit, we had a pleasant conversation, and she was professional. Not sure how you can screen someone in or out not knowing what the actual job function is.\r\n\r\nWhen compensation came up it was clear my current compensation was above the top end of the range for the position so I moved on. I asked to be informed in either case, but had very little reason to proceed. I never heard back from anyone and had forgotten about the phone screen.\r\n\r\nFast forward to August 2017 and I just received a form email stating they've pursued other candidates. A minimum of 6 months later and a form email? How broken is the hiring process here? It's a good thing I have a job. How disrespectful is this to candidates?", "Interview Questions": "Name a challenging situation or some such pedestrian thing. "}, {"date": "11 Dec 2017", "title": "Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Berklee (Boston, MA) in Jun 2017", "Interview Descriptions": "3 Step. a.) Phone screen with HR  b.) F2F with Director and then Senior Director c.) Broad interview with would-be colleagues and client   Rapid by Higher-Ed standards.", "Interview Questions": "Pretty basic about PM approach and how to manage conflict"}, {"date": "24 Mar 2017", "title": "Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 3 days. I interviewed at Berklee", "Interview Descriptions": "Worst interview experience ever. Completely unprofessional. The person hadn't reviewed my resume, she forgot about our phone interview after hunting me down to interview then because she hadn't reviewed my resume asked questions she didn't understand what she was asking. I've had numerous interviews and been offered numerous opportunities and this experience was terrible. Completely turned me off from wanting to pursue the job.", "Interview Questions": "What do you do?"}], [{"date": "11 Feb 2017", "title": "Camera Operator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 3 weeks. I interviewed at Berklee", "Interview Descriptions": "Applied through the Office of Student Employment. A student employee interviewed me and asked very simple questions, mostly to get my information in the system. Then, I was referred to the Video Department, where I had another interview with the head manager.", "Interview Questions": "What is your experience in the field? \r\nWhat can you bring to the department?\r\nAre you available at least X amount of hours?\r\nWhat does your schedule look like/amount of classes you're taking?"}, {"date": "7 Dec 2016", "title": "Admissions Temp Interviewer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Berklee (New York, NY)", "Interview Descriptions": "The process was very easy. There were two steps involved. First a phone screening with the hiring manager, then there was a skype interview with the hiring manager and a \"supervisor\"/Admissions team member I believe.", "Interview Questions": "How would you handle a situation in which the perspective student cannot speak English? How would you go about the interview?"}, {"date": "25 May 2016", "title": "Project Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Berklee", "Interview Descriptions": "Submitted resume materials through the school's online application system.  Received an email two weeks later requesting a phone screening.  Screening was with a member of the HR team; very pleasant and straightforward.  Information discussed during the screening is passed along to the department's hiring manager.  Discovered through the screening that the position was not quite a perfect fit for both parties.", "Interview Questions": "Describe a situation when you have improved a process.  "}, {"date": "6 Apr 2016", "title": "Assistant Vice President Global Initiatives Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Berklee (Boston, MA) in Apr 2016", "Interview Descriptions": "This was the most disrespectful approach and incredibly negative interview experience imaginable. Told that I was to meet with the Chief of Staff and Director of HR regarding my candidacy, a meeting was scheduled 2 weeks in advance. After spending 4+ hours preparing for my interview with talking points, published and printed materials, strategies for the role, dressing the part, and interviewing other staff about the role, I was told up front at the meeting that I was not selected for next round. \r\n\r\nThe HR Director didn't even attend as promised (I was not notified in advance). My materials were not even looked at and the meeting lasted all of 7 minutes (would have been much shorter had I not pressed my case). Having been in an active job search for some time, I can certainly handle rejection, but seriously, an e-mail would have been sufficient. I didn't need to waste all my time and effort to be told in a meeting that I wasn't being considered. \r\n\r\nI should note that this is not my first totally negative experience with this employer, and I should also note that I have been a long-time employee there with success in a wide variety of roles. It's unfortunate that they disrespect their employees consistently, and never promote from within. They are \"allergic\" to internal hires (I was told this by a senior person). I would recommend that you seriously consider NOT seeking a job here, as you will be treated callously and will have zero chance for advancement. This is why every new external hire immediately dusts off their resume. Absolutely NO LOYALTY to their own. Ugh. Terrible place to work, I am sorry to say.", "Interview Questions": "N/A"}, {"date": "18 Mar 2016", "title": "Online Student Advisor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Berklee in Jan 2016", "Interview Descriptions": "I applied online. About 10 days later, I was contacted on the phone and was asked questions about my previous work experiences and how they relate to the position. This initial phone interview was very short. At the end of the call, the interviewer explained that he's in the process of interviewing candidates for the position, and if I was to be invited for an in-person interview, I would be contacted via email or a phone call. I haven't heard back, though, so I'm assuming I was not selected.", "Interview Questions": "Why do you want to work for Berklee?\r\nWhy do you want to be an academic advisor?\r\nHow do your work experiences relate to this position?\r\nDo you play any musical instruments?"}, {"date": "14 Nov 2016", "title": "Office Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at Berklee (Boston, MA) in Jan 2016", "Interview Descriptions": "It was a typical interview process. I sent in my resume and was then contacted for the first interview round, which was one on one. After that, I was contacted for a second interview round, which was three on one. I was contacted a couple days later and was offered the position. The whole process took about a week in total.", "Interview Questions": "Why do you want to work here? What experience do you have? What can you bring to the table?"}, {"date": "13 Jan 2015", "title": "Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Berklee", "Interview Descriptions": "The interview process was fairly quick. At first it was uncomfortable being interviewed by 3 people but the interview later turned into a conversation making it easy to answer questions honestly. Most questions were expected based on the job description, qualifications and expectations. It is important to review the job description thoroughly to understand exactly what the employer is looking for. Many of the interview questions were based on the job description and my past experiences and why I wanted the position. As long as you are prepared and practiced presenting yourself, you should be fine. Make sue you are able to go through your resume without looking at it.", "Interview Questions": "What was the most difficult situation you dealt with and how did you handle it? "}, {"date": "14 Mar 2014", "title": "Assistant to Associate Vice President/Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 4 weeks. I interviewed at Berklee", "Interview Descriptions": "Hiring interview was a 2 step interview.  First interview with Assoc VP and second with the team including director of the department", "Interview Questions": "Usual where do you see yourself in 5 years?"}, {"date": "11 Jul 2013", "title": "Promotion Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Berklee", "Interview Descriptions": "Asked specific questions about the department and any new ideas for developing the work field.", "Interview Questions": "Which other ways can we promote our service?"}, {"date": "5 Oct 2016", "title": "Audition Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1+ week. I interviewed at Berklee (Boston, MA) in Jan 2013", "Interview Descriptions": "You enroll to work in school.\r\n Then, you get an email from school, reply that you want to work for the weekend.\r\nYou need to take sessions in order to work for audition team.", "Interview Questions": "N/A"}], [{"date": "17 Jul 2016", "title": "Office Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 days. I interviewed at Berklee (Boston, MA) in Sept 2012", "Interview Descriptions": "It was very relaxed and I got the job the next day. They asked alot of personal questions as it was a customer service job and they were interested in my personality. Great and fun workstudy position.", "Interview Questions": "Your experience, your passions, as you were helping others fulfill theirs."}, {"date": "9 Dec 2010", "title": "Senior Telecommunications Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Berklee (Boston, MA) in Oct 2010", "Interview Descriptions": "I was called by the manager after she reviewed my resume.  I came in for an interview with her and after we talked a bit, I met with her manager as well.  We talked about my background and what I might bring to the position.  They were particularly interested in one aspect of my background which would help them in an upcoming project, and we discussed this at length.  However, they ultimately decided to hire internally.", "Interview Questions": "There were no difficult questions"}, {"date": "8 Jun 2012", "title": "Director PR Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 1 day. I interviewed at Berklee (Boston, MA) in Jun 2010", "Interview Descriptions": "one interview-brief, efficient, knew what they wanted, wrapped quickly when it wasn't a fit", "Interview Questions": "what celebrities do you now"}, {"date": "21 Jul 2009", "title": "Affiliate Marketing Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 3 days. I interviewed at Berklee in Nov 2007", "Interview Descriptions": "First Meeting - phone introduction.  Second meeting -  met with small group of people to discuss my relevant affiliate marketing experience and the interview process.  Third meeting  - met with a group of 6-8 people from various departments after reviewing their current website.", "Interview Questions": "What is your experience in managing affiliates?"}]][[{"date": "13 Jun 2023", "title": "Box Office Attendant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Berklee", "Interview Descriptions": "It was a very smooth process. The recruiter is very nice and understanding about a student's schedule. As long as the candidate stays calm and express their own opinions, everything should be alright.", "Interview Questions": "Tell us something about you."}, {"date": "13 Mar 2023", "title": "Work Study Student Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Berklee", "Interview Descriptions": "Two guys interviewing me, was a very weird experience. It was extremely awkward, but it was a pretty short interview. It was a very average interview process, nothing remarkable happened except for one weird question.", "Interview Questions": "Basically asked me how I would fit in within an all male environment and how I would deal with inappropriate jokes. Not in those exact words but essentially what was asked."}, {"date": "10 Mar 2023", "title": "Director Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Berklee", "Interview Descriptions": "Interview with hiring manager had standard questions. Tell me about yourself, why Berklee, and a few other questions. Hiring manager was friendly and personable. Seems like a good place to work at.", "Interview Questions": "1. Leadership style 2. Most challenging job"}, {"date": "10 Aug 2022", "title": "Director Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Berklee", "Interview Descriptions": "Normal process interview. They asked standard questions with the standard involved parties. It was a satisfactory process. I would interview with them again but would never work for them again", "Interview Questions": "I don't remember what they asked"}, {"date": "7 Aug 2022", "title": "Full Time Faculty Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Berklee", "Interview Descriptions": "They were gracious and friendly and it all went very smoothly.  The process took the entire day, which included a very lovely dinner at the end of a very long day.", "Interview Questions": "How would you handle working in  a diverse student population?"}, {"date": "18 May 2022", "title": "Part-Time Faculty Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Berklee", "Interview Descriptions": "30 minute Zoom interview with two people from the hiring committee. They asked me a few questions for the first  10 minutes,  and I spent the rest of the interview leading the conversation. They said I would hear follow up the next week. After a week, I emailed the administrative assistant who scheduled the interview asking for an update, and never heard back. 6 weeks later, I got an automated email saying I was being passed on.", "Interview Questions": "How would you handle conflict in the classroom?"}, {"date": "15 Feb 2022", "title": "Stage Crew Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Berklee (Boston, MA)", "Interview Descriptions": "Had an in-person interview, where we discussed the responsibilities of the role and mine and the employers expectations. Then I  had a training session with current employees and managers, where I was taught how to use the sound / lighting equipment.", "Interview Questions": "Why do you want to be part of the Berklee stage crew?\r\n\r\nWhat experience do you have working in live events, using mixing consoles and lighting equipment?"}, {"date": "7 Nov 2022", "title": "Talent Acquisition Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at Berklee (Boston, MA) in Feb 2022", "Interview Descriptions": "Phone screen, interview, and panel interview with TA, HR, and the hiring manager for the department. The process was about 30 to 45 minutes for each interview. The panel interview was about an hour with 6 stakeholders the positions crossed over with.", "Interview Questions": "Behavioral based interview questions and DEI focused questions"}, {"date": "17 May 2022", "title": "Office Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Berklee in Feb 2022", "Interview Descriptions": "Really clear about timelines and had a really amazing community to reach out to! Really wonderful process and they were excited to hear about my experiences. Every employee and person I spoke to was kind and gave a clear lone of communication. Great experience all together!", "Interview Questions": "What would make you a good match for this position?\r\nTell me about something creative you'd like to do in the future using your skills?"}, {"date": "15 Feb 2021", "title": "Assistant Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Berklee (Boston, MA)", "Interview Descriptions": "Very thorough. In the process, I met a lot of individuals across the institution who helped to paint the picture of the workplace. The interviews were back to back, so it did feel like a tight schedule.", "Interview Questions": "What unique qualities would you be adding to the team?"}], [{"date": "14 Jan 2021", "title": "Assistant Chair Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Berklee", "Interview Descriptions": "Excellent, well prepared and organized. The process was smooth and well designed. All information was communicated ahead of time. The accommodation was in perfect location and all members of the interview panel made me feel at home.", "Interview Questions": "Why are you applying for this position "}, {"date": "22 Feb 2022", "title": "Studio Operations Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 1 day. I interviewed at Berklee in Jan 2021", "Interview Descriptions": "Really chill interview if you get called for interview you are basically in ask about who you are what you want to do nothing special last about half an hour", "Interview Questions": "Who are you and why do you want this job"}, {"date": "27 Aug 2019", "title": "International Admissions Counselor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Berklee", "Interview Descriptions": "I applied online and was contacted by the director of international admissions office. I was invited to the Skype interview for 30 minutes (through the Google hangout). The actual interview time was about 20-25 minutes.", "Interview Questions": "what is your philosophy?"}, {"date": "14 Jun 2022", "title": "Lab Monitor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Berklee (Boston, MA) in Oct 2018", "Interview Descriptions": "The interview was with 2 of the department's supervisors where I was asked general questions about myself and experience with music technology. I was also asked to provide a solution (verbally) to common Mac computer tasks and DAW troubleshooting, walking through each step of the process.", "Interview Questions": "How do you make sure the Mac is recognizing a MIDI device?"}, {"date": "20 May 2020", "title": "Social Media Marketing Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Berklee (Boston, MA) in Sept 2018", "Interview Descriptions": "After submitting an email application and resume, I attended a casual interview with the woman who would become my supervisor. The interview probably lasted 30 minutes and took place in the office's conference room. My supervisor was very personable, and the interviews were spaced so that I never interacted with anyone else applying.", "Interview Questions": "What do you know about this department?"}, {"date": "18 Jul 2018", "title": "Lab Monitor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 5 days. I interviewed at Berklee", "Interview Descriptions": "Interview was in relaxed environment. I was asked about my abilities and skills. More skills taught throughout orientations and sessions. Great people to work with and learn about school and music programs.", "Interview Questions": "What are you good at?"}, {"date": "15 Feb 2018", "title": "Assistant Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 5 weeks. I interviewed at Berklee (Boston, MA) in Dec 2017", "Interview Descriptions": "I interviewed for a half day with the entire team I would be working with. I felt like we were engaged in a conversation, not going through the expected motions just to get the interview over with. I left the first interview feeling like I had done well and that all my questions had been answered. My subsequent interviews focused on how I would perform in my job and collaborate across the institution, and were fun and engaging.", "Interview Questions": "What are your thoughts on delegation and empowerment for program execution?"}, {"date": "30 Aug 2017", "title": "Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Berklee", "Interview Descriptions": "Applied online in January 2017. Got an email for a phone screen in probably late February or March. Phone screen was with an assistant who had no clear information about the job but was \"asking some questions for the hiring manager\" who was on vacation. \r\n\r\nDespite the interviewer having no clear understanding what the position was, nor how my background fit, we had a pleasant conversation, and she was professional. Not sure how you can screen someone in or out not knowing what the actual job function is.\r\n\r\nWhen compensation came up it was clear my current compensation was above the top end of the range for the position so I moved on. I asked to be informed in either case, but had very little reason to proceed. I never heard back from anyone and had forgotten about the phone screen.\r\n\r\nFast forward to August 2017 and I just received a form email stating they've pursued other candidates. A minimum of 6 months later and a form email? How broken is the hiring process here? It's a good thing I have a job. How disrespectful is this to candidates?", "Interview Questions": "Name a challenging situation or some such pedestrian thing. "}, {"date": "11 Dec 2017", "title": "Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Berklee (Boston, MA) in Jun 2017", "Interview Descriptions": "3 Step. a.) Phone screen with HR  b.) F2F with Director and then Senior Director c.) Broad interview with would-be colleagues and client   Rapid by Higher-Ed standards.", "Interview Questions": "Pretty basic about PM approach and how to manage conflict"}, {"date": "24 Mar 2017", "title": "Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 3 days. I interviewed at Berklee", "Interview Descriptions": "Worst interview experience ever. Completely unprofessional. The person hadn't reviewed my resume, she forgot about our phone interview after hunting me down to interview then because she hadn't reviewed my resume asked questions she didn't understand what she was asking. I've had numerous interviews and been offered numerous opportunities and this experience was terrible. Completely turned me off from wanting to pursue the job.", "Interview Questions": "What do you do?"}], [{"date": "11 Feb 2017", "title": "Camera Operator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 3 weeks. I interviewed at Berklee", "Interview Descriptions": "Applied through the Office of Student Employment. A student employee interviewed me and asked very simple questions, mostly to get my information in the system. Then, I was referred to the Video Department, where I had another interview with the head manager.", "Interview Questions": "What is your experience in the field? \r\nWhat can you bring to the department?\r\nAre you available at least X amount of hours?\r\nWhat does your schedule look like/amount of classes you're taking?"}, {"date": "7 Dec 2016", "title": "Admissions Temp Interviewer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Berklee (New York, NY)", "Interview Descriptions": "The process was very easy. There were two steps involved. First a phone screening with the hiring manager, then there was a skype interview with the hiring manager and a \"supervisor\"/Admissions team member I believe.", "Interview Questions": "How would you handle a situation in which the perspective student cannot speak English? How would you go about the interview?"}, {"date": "25 May 2016", "title": "Project Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Berklee", "Interview Descriptions": "Submitted resume materials through the school's online application system.  Received an email two weeks later requesting a phone screening.  Screening was with a member of the HR team; very pleasant and straightforward.  Information discussed during the screening is passed along to the department's hiring manager.  Discovered through the screening that the position was not quite a perfect fit for both parties.", "Interview Questions": "Describe a situation when you have improved a process.  "}, {"date": "6 Apr 2016", "title": "Assistant Vice President Global Initiatives Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Berklee (Boston, MA) in Apr 2016", "Interview Descriptions": "This was the most disrespectful approach and incredibly negative interview experience imaginable. Told that I was to meet with the Chief of Staff and Director of HR regarding my candidacy, a meeting was scheduled 2 weeks in advance. After spending 4+ hours preparing for my interview with talking points, published and printed materials, strategies for the role, dressing the part, and interviewing other staff about the role, I was told up front at the meeting that I was not selected for next round. \r\n\r\nThe HR Director didn't even attend as promised (I was not notified in advance). My materials were not even looked at and the meeting lasted all of 7 minutes (would have been much shorter had I not pressed my case). Having been in an active job search for some time, I can certainly handle rejection, but seriously, an e-mail would have been sufficient. I didn't need to waste all my time and effort to be told in a meeting that I wasn't being considered. \r\n\r\nI should note that this is not my first totally negative experience with this employer, and I should also note that I have been a long-time employee there with success in a wide variety of roles. It's unfortunate that they disrespect their employees consistently, and never promote from within. They are \"allergic\" to internal hires (I was told this by a senior person). I would recommend that you seriously consider NOT seeking a job here, as you will be treated callously and will have zero chance for advancement. This is why every new external hire immediately dusts off their resume. Absolutely NO LOYALTY to their own. Ugh. Terrible place to work, I am sorry to say.", "Interview Questions": "N/A"}, {"date": "18 Mar 2016", "title": "Online Student Advisor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Berklee in Jan 2016", "Interview Descriptions": "I applied online. About 10 days later, I was contacted on the phone and was asked questions about my previous work experiences and how they relate to the position. This initial phone interview was very short. At the end of the call, the interviewer explained that he's in the process of interviewing candidates for the position, and if I was to be invited for an in-person interview, I would be contacted via email or a phone call. I haven't heard back, though, so I'm assuming I was not selected.", "Interview Questions": "Why do you want to work for Berklee?\r\nWhy do you want to be an academic advisor?\r\nHow do your work experiences relate to this position?\r\nDo you play any musical instruments?"}, {"date": "14 Nov 2016", "title": "Office Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at Berklee (Boston, MA) in Jan 2016", "Interview Descriptions": "It was a typical interview process. I sent in my resume and was then contacted for the first interview round, which was one on one. After that, I was contacted for a second interview round, which was three on one. I was contacted a couple days later and was offered the position. The whole process took about a week in total.", "Interview Questions": "Why do you want to work here? What experience do you have? What can you bring to the table?"}, {"date": "13 Jan 2015", "title": "Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Berklee", "Interview Descriptions": "The interview process was fairly quick. At first it was uncomfortable being interviewed by 3 people but the interview later turned into a conversation making it easy to answer questions honestly. Most questions were expected based on the job description, qualifications and expectations. It is important to review the job description thoroughly to understand exactly what the employer is looking for. Many of the interview questions were based on the job description and my past experiences and why I wanted the position. As long as you are prepared and practiced presenting yourself, you should be fine. Make sue you are able to go through your resume without looking at it.", "Interview Questions": "What was the most difficult situation you dealt with and how did you handle it? "}, {"date": "14 Mar 2014", "title": "Assistant to Associate Vice President/Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 4 weeks. I interviewed at Berklee", "Interview Descriptions": "Hiring interview was a 2 step interview.  First interview with Assoc VP and second with the team including director of the department", "Interview Questions": "Usual where do you see yourself in 5 years?"}, {"date": "11 Jul 2013", "title": "Promotion Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Berklee", "Interview Descriptions": "Asked specific questions about the department and any new ideas for developing the work field.", "Interview Questions": "Which other ways can we promote our service?"}, {"date": "5 Oct 2016", "title": "Audition Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1+ week. I interviewed at Berklee (Boston, MA) in Jan 2013", "Interview Descriptions": "You enroll to work in school.\r\n Then, you get an email from school, reply that you want to work for the weekend.\r\nYou need to take sessions in order to work for audition team.", "Interview Questions": "N/A"}], [{"date": "17 Jul 2016", "title": "Office Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 days. I interviewed at Berklee (Boston, MA) in Sept 2012", "Interview Descriptions": "It was very relaxed and I got the job the next day. They asked alot of personal questions as it was a customer service job and they were interested in my personality. Great and fun workstudy position.", "Interview Questions": "Your experience, your passions, as you were helping others fulfill theirs."}, {"date": "9 Dec 2010", "title": "Senior Telecommunications Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Berklee (Boston, MA) in Oct 2010", "Interview Descriptions": "I was called by the manager after she reviewed my resume.  I came in for an interview with her and after we talked a bit, I met with her manager as well.  We talked about my background and what I might bring to the position.  They were particularly interested in one aspect of my background which would help them in an upcoming project, and we discussed this at length.  However, they ultimately decided to hire internally.", "Interview Questions": "There were no difficult questions"}, {"date": "8 Jun 2012", "title": "Director PR Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 1 day. I interviewed at Berklee (Boston, MA) in Jun 2010", "Interview Descriptions": "one interview-brief, efficient, knew what they wanted, wrapped quickly when it wasn't a fit", "Interview Questions": "what celebrities do you now"}, {"date": "21 Jul 2009", "title": "Affiliate Marketing Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 3 days. I interviewed at Berklee in Nov 2007", "Interview Descriptions": "First Meeting - phone introduction.  Second meeting -  met with small group of people to discuss my relevant affiliate marketing experience and the interview process.  Third meeting  - met with a group of 6-8 people from various departments after reviewing their current website.", "Interview Questions": "What is your experience in managing affiliates?"}]]