[[{"date": "11 May 2023", "title": "Marketing Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Parkview Health", "Interview Descriptions": "It ook a while to schedule in person interview, which was my second interview. Then I got ghosted after said second round of interviews. Very unprofessional in my opinion. The two interview themselves went fine.", "Interview Questions": "Normal interview questions, like strengths, weakness and why do you want this job."}, {"date": "19 Apr 2023", "title": "Call Center Representative Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Parkview Health", "Interview Descriptions": "The questions were relatively easy. They mostly related a lot to what customer service experience I have had, and if I have ever worked in an environment that uses a multi line phone system.", "Interview Questions": "What does good customer service mean to you?"}, {"date": "29 Nov 2022", "title": "Patient Account Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Parkview Health (Fort Wayne, IN) in Oct 2022", "Interview Descriptions": "Microsoft Teams is used to connect with the hiring manager and the peer interview. The hiring manager will typically do a interview with the leads. I interviewed for a billing department position.", "Interview Questions": "Why do you want to work for Parkview. Where do you see yourself with the company in 3 years."}, {"date": "20 Mar 2022", "title": "Prior Authorization Representative Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Parkview Health (Fort Wayne, IN) in Mar 2022", "Interview Descriptions": "Had a phone interview that lasted approximately 30 minutes. I was asked all typical interview questions - \"Tell me about yourself\" \"Tell me about a conflict with a coworker and how you handled that situation\" etc.", "Interview Questions": "\"How would you describe your work style?\""}, {"date": "18 May 2022", "title": "Registered Nurse, BSN Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Parkview Health (Fort Wayne, IN) in Mar 2022", "Interview Descriptions": "The interview process was great and easy. Everyone was kind and the follow through was great. I really liked Parkview but decided to relocate to be closer to family. I would definitely work their in the future.", "Interview Questions": "What brings you to northeast indiana"}, {"date": "22 Feb 2022", "title": "Client Engagement Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Parkview Health", "Interview Descriptions": "Interview process was very laid back. Focused on describing the job and its responsibilities. Manager was interested in what I had to say. I liked that they wanted to get a feel for who I was as a person and didn't just ask questions meant to trip you up", "Interview Questions": "What is your 5 year plan?"}, {"date": "14 Feb 2022", "title": "Community Health Nurse Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Parkview Health", "Interview Descriptions": "Group interview with behavioral interviewing questions. They do not tell you if you are not selected. Even if you are an employee in a different department.  They describe the department and where your position would fit etc", "Interview Questions": "A lot of \"tell us about a time when...\" "}, {"date": "14 Nov 2021", "title": "PCT Patient Care Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Parkview Health", "Interview Descriptions": "First there was a phone interview, then in-person, then a shadow and a peer interview with one or two other people to see if you would be a good fit. It's great they want to make sure you will mesh well with the other coworkers", "Interview Questions": "What would you do if you were taking a patient's vital signs and one of them was out of the normal range?"}, {"date": "28 Nov 2021", "title": "Phlebotomy Technician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Parkview Health (Pueblo, CO) in Nov 2021", "Interview Descriptions": "Did the application then got an email for an interview the next day, scheduled that for the next day. At the end of interview she said inbound hear from HR in the next week or two. Still waiting to know if i will get an offer.Easy  laid back and relaxed no pressure in questions that where asked.", "Interview Questions": "Describe an time when you where assitertive? "}, {"date": "29 Sept 2021", "title": "Research Protocol Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Parkview Health", "Interview Descriptions": "Called in for phone interview and asked about my experiences with different tools and research experiences. Also gave interview to the HR about necessary documents and process. Bla bla bla bla", "Interview Questions": "Q. Hmwhat type of research I di"}], [{"date": "22 Sept 2021", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Parkview Health", "Interview Descriptions": "It was good. Felt more like a conversation rather than an interrogation. It was more comfortable than anticipated. Be prepared for answers to make the flow of the interview easier and not as daunting.", "Interview Questions": "Tell me about yourself and what you do"}, {"date": "13 Jul 2021", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Parkview Health in May 2021", "Interview Descriptions": "I interviewed with the floor manager, and then based on that interview was offered an opportunity to shadow on the unit and engage with the floor staff. I also then went through a peer interview and was updated on the position and my standing the next day.", "Interview Questions": "What do you bring to our team?"}, {"date": "13 May 2021", "title": "Administration Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Parkview Health (Sandusky, OH) in Jan 2021", "Interview Descriptions": "Maybe 30 minutes to 45. Basic questions pertaining to residents, hhippa and some questions pertaining to how you would handle certain situations.  Some scenarios and what would you do, why leaving job, how long in previous position", "Interview Questions": "Would you be willing to work weekends."}, {"date": "30 Mar 2021", "title": "Infection Preventionist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. I interviewed at Parkview Health (Fort Wayne, IN) in Dec 2020", "Interview Descriptions": "Great place, I found the staff to be friendly and helpful, I was a little lost trying to find my way around. The interview was very open and I felt my strengths were explored for how they could help the organization.", "Interview Questions": "What can you contribute to the department? after being given an overall of the program"}, {"date": "31 Aug 2020", "title": "Marketing Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Parkview Health", "Interview Descriptions": "Everyone was lovely - really wanted this role at the time.  Ended up staying within a different industry, but had a great experience and liked the talent alot.  Love what the company is doing in Fort Wayne and their impact on the community.", "Interview Questions": "Fairly standard, clearly smart team"}, {"date": "31 May 2020", "title": "New Grad Registered Nurse Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Parkview Health in May 2020", "Interview Descriptions": "They put out a poster for a job fair and I was interested because one of the units offered was L&D. Showed up to the job fair and they made me check off Med Surg as my unit of interest. Not cool. Then was given a med math exam and was told no calculators allowed. Not cool again. Even NCLEX gives you a calculator. Took me forever since I was trying to do long division and what not. Finally, I was interviewed after I finished my math exam. Around the 3rd question, they asked me if I was a licensed RN yet. When I answered no, the interview ended immediately and I was told that they're only hiring new grads that are already licensed. It would've been helpful if they disclosed that on their job fair announcement so I wouldn't waste my time. Some new grad RN programs allow for applications to their program if we get our license by an expected date. Overall, it was very unorganized and I'm glad I dodged a bullet.", "Interview Questions": "Name 3 qualities that make a nurse exceptional. \r\nWhy do you want to work in this department? (This question threw me off because I had came prepared for the L&D unit and not Med Surg unit.)\r\nWhat is your greatest accomplishment?"}, {"date": "27 Jul 2019", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at Parkview Health (Columbia City, IN) in Jul 2019", "Interview Descriptions": "The interview process involved a short interview that involved answering maybe 5-7 HR questions which were mostly situational or character based. Was given ample chance to ask my own questions and was given clear information about the schedule and terms of being hired for the position. Was then given the opportunity to job shadow and learn the expectations and flow of the job/office.", "Interview Questions": "Tell me about a time that you had to take on the role of leader? "}, {"date": "2 Apr 2021", "title": "Physician Liaison Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Parkview Health (Fort Wayne, IN) in Jun 2019", "Interview Descriptions": "Met with the leadership for an initial interview, then followed up with second. Easy process, very approachable, and direct on what they were looking for in the role. Allowed for conversation and my own thoughts of the role as well.", "Interview Questions": "What struck your interest in working in oncology care?"}, {"date": "10 Jan 2019", "title": "Patient Support Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 5 days. I interviewed at Parkview Health (New York, NY)", "Interview Descriptions": "I had a great experience interviewing. Got a call Friday to schedule an interview, interviewed Tuesday and offered job on Thursday. Everyone was very nice, questions were personable, they had me shadow one of the girls to get a feel of the job.", "Interview Questions": "why would you say your coworkers like working with you?"}, {"date": "11 Oct 2019", "title": "EMT Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 days. I interviewed at Parkview Health in Sept 2018", "Interview Descriptions": "Supervisor and educator did interview. Very forthcoming and very nice. Realistic conversations and one of the true feel of who I was as a person as opposed to the generic questions they have to ask", "Interview Questions": "what do you bring to the team"}], [{"date": "6 Mar 2018", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Parkview Health", "Interview Descriptions": "Casual and laid back. Very friendly and accommodating. When I presented them with a potential issue with my schedule for the summer, they were able to help me to work around it, even though I technically did not have the job yet. The group was very genuine and loved their jobs.", "Interview Questions": "What is your greatest accomplishment"}, {"date": "15 Mar 2018", "title": "Patient Account Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Parkview Health in Feb 2018", "Interview Descriptions": "Applied on Thursday, called for interview Monday, interview Tuesday, and offered a job Wednesday. The interview itself wasn’t bad. Had one with two managers, followed by about 45 minutes of job shadowing, followed by a peer interview with three people already in the position. They ask standard behavior and experience questions. Once you are offered a position, you will have to go do a drug screen, physical, and schedule a day to do paperwork.", "Interview Questions": "Describe a time when...\r\nTell me about how you...\r\nStrengths and weaknesses..."}, {"date": "18 Dec 2017", "title": "Technician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Parkview Health (New York, NY) in Dec 2017", "Interview Descriptions": "Was an online app that was sent and filled out according to the healthcare giants guidelines,waited on response for acceptance of application and received in a timely manner,unfortunately they had chosen another candidate.", "Interview Questions": "standard application"}, {"date": "14 Feb 2017", "title": "Student Services Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Parkview Health", "Interview Descriptions": "It was ok. It was your basic interview. I received a call offering me a second interview less than 10 minutes after the first interview. I was called back for a second interview, in which I was offered the position a few days later.", "Interview Questions": "N/A"}, {"date": "18 Apr 2018", "title": "Support Team Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Parkview Health in Jan 2017", "Interview Descriptions": "Just one interview with the supervisor and then went on to do an interview with two peers to make sure I was a qualified fit. Just want to make sure you are a people person who can pay attention to a detail.", "Interview Questions": "Describe a conflict with another employee"}, {"date": "13 Jul 2016", "title": "Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Parkview Health", "Interview Descriptions": "It was a peer interview, which consisted of 2 or 3 sessions with different groups.  These were spread out over a couple of days.  Seemed more like a typical behavioral interviewing process.", "Interview Questions": "Typical questions related to experience, situations, and personality/cultural situations."}, {"date": "3 Apr 2018", "title": "Data Center Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Parkview Health in Jul 2016", "Interview Descriptions": "Interviewer had several people in the room, asked nonsensical questions that weren't relevant to the process and seemed to just be filling up time to get to his next appointment.  He wasn't taking me seriously.", "Interview Questions": "What famous person, living or dead, would I have dinner with? "}, {"date": "16 Jan 2018", "title": "Office Manager Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Parkview Health (Fort Wayne, IN) in Mar 2016", "Interview Descriptions": "several interviews.  One with the coworker, one with manager and one with HR.  Very easy process and wasn't intimidating.  They wanted to get to know me, asked me basic questions, and hypothetic questions.", "Interview Questions": "What can you bring to the organization?"}, {"date": "9 Mar 2017", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Parkview Health in Dec 2015", "Interview Descriptions": "Straight to the point. Typical interview questions...why are you interested in the position? Strengths? Weaknesses? Where do you see yourself in 10 years? First interview with the manager and then second interview with 3 other nurses.", "Interview Questions": "What is your biggest accomplishment?"}, {"date": "10 Aug 2015", "title": "Pharmacy Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 5 days. I interviewed at Parkview Health", "Interview Descriptions": "Everyone was extremely friendly and welcoming. I was a bit intimidated in the peer interview, but overall a great process. Very quick too. Had 1st interview Wednesday, 2nd interview Friday, and was offered the position the following Tuesday.", "Interview Questions": "what will you bring to our team?"}], [{"date": "18 Sept 2017", "title": "Security Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Parkview Health (Fort Wayne, IN) in May 2015", "Interview Descriptions": "They have you go through two interviews. One with executives and a peer interview. You are also expected to submit a written statement about what their values mean to you before the interviews.", "Interview Questions": "Would you ever break policy?"}, {"date": "26 Jun 2016", "title": "Clinic Supervisor II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Parkview Health (Fort Wayne, IN) in Apr 2015", "Interview Descriptions": "A bit much for a position that has the title and no authority. I was interviewed twice in-person, and twice by phone, in order it was as follows; phone, in-person, in-person, and finally another phone interview. In-person interview had 9 people around the table asking numerous questions about you and random other questions such as, \"What would you do if....\". What they don't tell you is that there are other managers interviewing you as well for other open positions. So if you go in for one clinic, there is the possibility of receiving an offer from a different manager for a different clinic.", "Interview Questions": "What other ways, beside communication and team huddles,would you incorporate to bring the team together?"}, {"date": "29 Jul 2013", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Parkview Health", "Interview Descriptions": "I was called in by HR to interview with the manager of the unit first. Then I was called back and had a peer interview with 4 current nurses of the department. It then took another 3 weeks before I was offered the position. Others have told me they never heard back about the position so assumed they did not get the job.", "Interview Questions": "How would you handle conflict with a physician?"}, {"date": "1 Sept 2016", "title": "Doctor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 1 day. I interviewed at Parkview Health (Fort Wayne, IN) in May 2013", "Interview Descriptions": "Meetings starting off at the beginning of the day with the physicians in the community; touring of the hospital and community and introductions to staff and administration. Lunch and meetings at different junctions helped with introductions as well to other physicians.", "Interview Questions": "What are you looking for in your career?"}, {"date": "13 Jul 2015", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Parkview Health (Fort Wayne, IN) in Sept 2011", "Interview Descriptions": "Submitted resume online.  About a month later was called from HR for phone screen, interview on-site with department manager, 2nd interview a week later with peers.  Job offer the next day.  1:1 interview was average difficulty.  Peer/group interview was more difficult.  It almost felt like a firing squad with them taking turns firing questions off.", "Interview Questions": "What will you add to our organization?"}, {"date": "24 May 2013", "title": "Licensed Practical Nurse (LPN) Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Parkview Health (Fort Wayne, IN) in Jul 2010", "Interview Descriptions": "Hiring and interview was smooth.", "Interview Questions": "No unexpected questions were asked"}]]