[[{"date": "19 Oct 2022", "title": "Assistant Professor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Capella University", "Interview Descriptions": "This was a very enjoyable experience. They were very kind, and the process was simple. I have not yet heard back but would recommend that others apply. This was a very enjoyable experience. They were very kind, and the process was simple. I have not yet heard back but would recommend that others apply.", "Interview Questions": "What brought you to Capella?"}, {"date": "2 Sept 2022", "title": "Enrollment Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Capella University", "Interview Descriptions": "Easy, they really look more for fit than anything. Background isn't too important either so they just want to know what you've been doing with your life. Not sure what else to say.", "Interview Questions": "What would you do if a prospective learner called in and was mad"}, {"date": "13 Jun 2022", "title": "Enrollment Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Capella University", "Interview Descriptions": "The process went well and I got hired after two interviews.  I am excited to work remotely and work for a company that makes a difference in others' lives. The campus downtown Minneapolis is quite nice.", "Interview Questions": "Tell me a time you "}, {"date": "28 Feb 2022", "title": "Lecturer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Capella University", "Interview Descriptions": "I was literally sent a rejection letter without review or interview stating I was unqualified to teach courses I hold  a PhD in and have been teaching for 17 years.", "Interview Questions": "No requests for information beyond transcipts."}, {"date": "27 Oct 2021", "title": "Financial Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Capella University", "Interview Descriptions": "Fairly standard process. I was contacted by a recruiter for a brief phone screen, then moved on to a Zoom interview with the department manager.  Clearly they did not see me as the right fit, which is fine, but after several weeks I've yet to hear back from anybody in the company after reaching out to multiple individuals regarding whether there would be next steps. I find the lack of communication, professionalism, and respect highly disappointing and would not recommend anybody to waste their time applying.", "Interview Questions": "What experience do you have with Excel"}, {"date": "16 Jul 2021", "title": "Associate Enrollment Counselor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Capella University (Austin, TX) in Jul 2021", "Interview Descriptions": "I had an interview scheduled with Rae Moon from Strategic Education. She asked four questions pertaining to the job. I felt that the questions and conversation went well. It actually went so well, that she stated that she would follow up early the following week. I followed up with my interview by sending an email saying that I was happy to be considered for the position. She never responded to that email. One day went by and I heard nothing. The second day went by and I heard nothing.  On day three I sent an email following up on my application status and she did not respond. I called on the fourth day and I received no answer. It has been one week with no response by email or phone. I am okay with not being selected for the position if that is the case. I am not okay with being told that they would follow up all to not hear one word. I have no idea what the issue is but I am not happy with how this process transpired. I am actually a student at Capella and I love the university, but this recruiting company, Strategic Education has greatly disappointed me! I feel completely disrespected by this whole ordeal. I would not recommend anyone waste their time and apply here. If so, find a way to get through Strategic Education if at all possible.", "Interview Questions": "When was the last time you had to meet a certain metric and how did you do so?"}, {"date": "9 Jun 2022", "title": "Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Capella University in Apr 2021", "Interview Descriptions": "Very nice process. Everyone was super polite. The hiring process was respectful of my time and worked to make me feel wanted as a professional. I would recommend applying to Capella if you want to go through a stellar hiring and onboarding process.", "Interview Questions": "Very standard, why do I want the job. What is my experience, etc"}, {"date": "29 Jan 2021", "title": "Typist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at Capella University (Minneapolis, MN)", "Interview Descriptions": "It was decent, a little stiff.  The questions were all about getting to know me and my skills. There were two interviewers, they seemed nice. In the end, I thought I did well but I just couldn't type fast enough for them and didn't wind up getting the job.", "Interview Questions": "What are some of your weaknesses?"}, {"date": "15 Jan 2021", "title": "Project Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Capella University", "Interview Descriptions": "Process took several weeks,  but experience overall was great. Interview conversation was pretty easy (as in flow, not content), and much more conversational than interrogative. Ultimately they went with someone else for the position but it was a good experience.", "Interview Questions": "Methods of Change Management I had used in previous role. "}, {"date": "11 Oct 2021", "title": "Enrollment Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Capella University in Oct 2020", "Interview Descriptions": "3 separate interviews. 1 with HR, 1 with multiple associate managers, and 1 with the program director . All via zoom or webex and all at least 30 minutes to 1 hour", "Interview Questions": "What sales experience do you have?"}], [{"date": "2 Oct 2019", "title": "Student Mentor - Faculty Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Capella University (New York, NY) in Oct 2019", "Interview Descriptions": "I was interviewed for a parttime mentor role in the Human Services program and PhD level. The decisionmaker acted very confident and perky during the interview, and the HR person was also socially fun. However, they took their time sending the results to me. After I called HR more than once, I finally received the news that I was not chosen. It was not the most respectful experience nor was a consideration of my time actually conveyed.", "Interview Questions": "What is your experience with qualitative research?"}, {"date": "22 Aug 2019", "title": "FlexPath Coach Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Capella University (Minneapolis, MN) in Aug 2019", "Interview Descriptions": "Applied online. Received email acknowledgment. Waited. Received email from in-house recruiter for phone interview. Waited. Conducted phone interview. Waited. Received invitation for in-person interview. Went in to interview with 3 hiring managers. Waited 2 weeks. Received word on my status.", "Interview Questions": "What has been your greatest accomplishment?"}, {"date": "27 Sept 2019", "title": "Associate Enrollment Counselor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 4 weeks. I interviewed at Capella University (Minneapolis, MN) in Aug 2019", "Interview Descriptions": "I was recommended this position after being rejected for another Within Capella, and this seemed like a better fit. The only difference this time around was that I still have yet to hear from my recruiter after 2+ weeks and multiple follow-ups. For this position I had one in-person and another phone interview. I felt all of my interviews had gone well and am very disappointed to not have heard anything back to close this chapter as I had before. It seemed like a great community to be involved in after such a long interview process.", "Interview Questions": "What do you like to do outside of work?"}, {"date": "7 Apr 2019", "title": "Financial Services Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Capella University (Minneapolis, MN) in Oct 2018", "Interview Descriptions": "The interview process went smooth and seemed fast paced. The recruiter was very personable and professional. I was very excited to accept the offer, however once I was in the role, I realized it was a bait and switch", "Interview Questions": "Name a time you went above and beyond in a previous role"}, {"date": "9 Oct 2019", "title": "Writing Coach Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Capella University (Minneapolis, MN) in Sept 2018", "Interview Descriptions": "Quick, painless, engaging, and inspiring.  Standard questions about roadblocks, time management skills, career goals, and reasons for applying.  The interview as clear, concise, upfront and took around 30 minutes.  I never had any regrets about the process.", "Interview Questions": "Time management skills"}, {"date": "8 Nov 2019", "title": "Financial Aid Advisor Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Capella University (Minneapolis, MN) in Apr 2018", "Interview Descriptions": "Phone interview then if  good then in person interview, The questions asked are behavior and situational. the process was very smooth easy. Once you are contacted for the job interview you are told right up front what the jobs salary is. That was plus when deciding if I wanted to interview with them.", "Interview Questions": "Situational and behavior"}]]