[[{"date": "1 May 2023", "title": "Human Resources Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Vibra Healthcare", "Interview Descriptions": "Process was good. Knowledgeable people interviewing. The hiring staff was pleasant. Made the overall experience a positive one. Multiple steps in the interview process. Communicated well along the way. No unexpected questions during the process.", "Interview Questions": "What type of previous experience"}, {"date": "21 Jun 2023", "title": "Chief of Marketing Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Vibra Healthcare (Houston, TX) in May 2023", "Interview Descriptions": "Overall, I think that they want to not really give you what you asked when it comes to money. I mean, I won't leave a company for less than I'm being paid.", "Interview Questions": "What is your desired salary?"}, {"date": "28 Apr 2023", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Vibra Healthcare (Nursery, TX)", "Interview Descriptions": "Against marijuana didn’t accept it was my medical card for a traumatic brain injury instead of using opiates used medical marijuana to get better because opiates is not the key or answer", "Interview Questions": "Asked questioned about me and my experience"}, {"date": "6 Dec 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Vibra Healthcare", "Interview Descriptions": "This was a Phone Interview with the Dean of Nursing. They asked the basics and offered a position on the spot. I took a tour of the facility a couple of days afterwards.", "Interview Questions": "What do you know about Vibra"}, {"date": "17 Nov 2022", "title": "Regional IT Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Vibra Healthcare in Nov 2022", "Interview Descriptions": "I had two interviews. Both went very in my opinion. However I was told they made an offer to someone else and I was not selected but they would keep me on file. Not even a week later they want me to interview a 2nd time. Same thing, interview went well. But I looked them on Glassdoor before my second interview and the ratings from their own IT staff were concerning. I also looked them up on LinkedIn. First thing I noticed immediately, absolutely no diversity representation whatsoever! All white mean and white women no black or brown employees that I could see, doesn’t mean they don’t exist but scares me in 2022. The work culture also seemed a bit stifled. I asked questions to probe into their work culture and management styles. I asked things like “Outside of an employee’s paycheck, what do you do as a manger to reward great work performance.” The answer I got was “I promote from within” YIKES! I also asked “what do you to increase employee morale during difficult work periods or after strict criticism?” Whatever the answer was I can’t even remember which speaks volumes. Not even two hours after my interview I noticed the position was reposted to Indeed. I reached out to the recruiter a few days later after getting an automated denial email from HR. I asked the recruiter and asked what was the feedback that resulted in the decision to not move forward. She told me she didn’t have anything she could share. Again, speaks volumes. Usually that’s when they say well you Lacked experience or we’re looking for xyz but instead nothing. Makes me feel like they are intimated by my work culture questions and/ or the color of skin because they didn’t even ask very many technical questions.", "Interview Questions": "Very little technical questions were asked. I was asked more about myself than anything."}, {"date": "12 Aug 2022", "title": "Registered Nurse (RN) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 3 weeks. I interviewed at Vibra Healthcare (San Francisco, CA) in Jul 2022", "Interview Descriptions": "It was a zoom meeting interview and the interviewer was courteous and polite, i am now just waiting for the job offer. Its taking time but i am willing to wait to see what is in the job offer letter.", "Interview Questions": "Head to toe assessment\nHow to prioritize patients\nMost difficult situation\nWhat instances that you need to think and act fast"}, {"date": "13 May 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Vibra Healthcare (Denver, CO)", "Interview Descriptions": "Got an email to set up an in person interview. Met with the manager and scheduler.  Didn't really answer specific questions . Offered a job on the spot.  Offered a tour of the facility.", "Interview Questions": "They just went over my resume.  "}, {"date": "18 Apr 2022", "title": "HR-Admin Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Vibra Healthcare", "Interview Descriptions": "Phone screen then a phone interview. The phone screen is just asking a few questions about your background and elaborating on why you should be selected for this role. Also just a few questions about your resume and how it relates to the role.", "Interview Questions": "Why would you be a great fit for this role. "}, {"date": "19 Feb 2022", "title": "LVN Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Vibra Healthcare in Feb 2022", "Interview Descriptions": "Process was efficient, professional and informative. They have figured out how to eliminate mistakes other travel companies continue to make. Compensation is decent.  Navigating the application was easy. My interviewer helped move the process along very quickly.", "Interview Questions": "Why do I want to be a Travel nurse?"}, {"date": "22 Sept 2021", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Vibra Healthcare (Denver, CO)", "Interview Descriptions": "My interview process consisted of a quick pre screen with HR then phone and in person interview with DON on site.  I also received a facility tour and met a few of their nurses.", "Interview Questions": "Why are you interested in working at an LTAC?"}], [{"date": "3 Mar 2021", "title": "Accounting Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Vibra Healthcare", "Interview Descriptions": "one interview, wasn't bad. Met with a few different people. They were all very kind and asked about myself and my experience. Overall was not crazy stressful, just in the beginning.", "Interview Questions": "Why I chose accounting to major in."}, {"date": "28 Feb 2021", "title": "IT Staff Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 1 week. I interviewed at Vibra Healthcare", "Interview Descriptions": "Reached out by Vibra directly. Had a phone interview with another recruiter a few days later. Recruiter rushed the interview giving me very little time to ask any questions. Left when would you be available of available question at the end. Apparently my answer on that question was not acceptable. Looking at previous reviews, company has a history of seeking out unemployed candidates vs candidates like myself who are lucky to be employed but looking for a better opportunity.", "Interview Questions": "How soon could you start?"}, {"date": "29 Dec 2020", "title": "Lab Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Vibra Healthcare (Novi, MI) in Dec 2020", "Interview Descriptions": "Very informative. The interviewing manager was extremely transparent. The staff onsite seemed to be very well connected even with the higher-level management. I interviewed with the lab manager as well as the CEO.", "Interview Questions": "Where do you see yourself in 5 years"}, {"date": "25 Nov 2020", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Vibra Healthcare (Portland, OR) in Nov 2020", "Interview Descriptions": "The Interview was 39 minutes in duration. I was asked  4 questions, 1 about sepsis. The Setting was informal at a job fair. I Met with the new director who started one month ago.", "Interview Questions": "Tell me about yourself and the experiences that led you here."}, {"date": "23 Jun 2020", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Vibra Healthcare (Rochdale, MA) in Jun 2020", "Interview Descriptions": "Phone interview followed by in person interview.  Tour of the facility, met other staff members  and came back the next day to do paperwork. I was offered the job if everything checked out okay with my refrences.", "Interview Questions": "What inspired  me to be a nurse"}, {"date": "26 Feb 2020", "title": "Lpn Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Vibra Healthcare (Richmond, VA) in Feb 2020", "Interview Descriptions": "The interview process was very average overall and not to hard the application is typical of applications of other places and the person who does the interview was super nice and made me feel at ease", "Interview Questions": "Typical questions "}, {"date": "28 Jan 2020", "title": "Clinical Registered Dietitian Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Vibra Healthcare (Reno, NV) in Jan 2020", "Interview Descriptions": "The interview process was very smooth, the panel was very kind, and they asked a variety of questions including job-specific and personal to properly get to know me as a candidate. I was interviewed by the Chief Executive Officer as well as other current Registered Dietitians.", "Interview Questions": "What would your preceptors in your dietetic internship say about you if we were to call them?"}, {"date": "1 Oct 2019", "title": "CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Vibra Healthcare", "Interview Descriptions": "I was given a call first then they setup and interview in person. They asked about my experience and what I want in a position. It was pretty straight forward with no real hard questions.", "Interview Questions": "Where do you see yourself in five years"}, {"date": "4 Aug 2019", "title": "Human Resources Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Vibra Healthcare", "Interview Descriptions": "There are a couple of interviews. The people there are friendly and the culture seems pretty good. You first meet with HR then the CEO. They ask questions and then will let you know in stated time period.", "Interview Questions": "Behavior questions"}, {"date": "11 Dec 2019", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Vibra Healthcare (Richmond, VA) in May 2019", "Interview Descriptions": "Applied online and set for interview within a week. The interview was one on one with the chief clinical officer and then the same day a one on one with the chief executive officer. At the end of the interview the chief clinical officer offered me the job on the spot.", "Interview Questions": "How do you manage difficult personalities"}], [{"date": "8 Sept 2018", "title": "Staff RN Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Vibra Healthcare (El Paso, TX) in Sept 2018", "Interview Descriptions": "The interviewer quickly put me at ease, apologized for being late due to unforeseen circumstances.  Very relaxed, conversational style interview.    The DON told me upfront about the challenges of the position and the possibility of advancing to a managerial/educational position.", "Interview Questions": "If I would be interested in an alternative position."}, {"date": "1 Jun 2018", "title": "Human Resources Generalist Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 1+ week. I interviewed at Vibra Healthcare (Katy, TX) in May 2018", "Interview Descriptions": "New location opening In Katy and the Executive Director conducted interview. She was not very friendly and gave the impression that her time was being wasted. Didn’t ask any interview questions but did share what her expectations of the job would be. Have off a heavy micromanagement vibe. Halfway through the interview, the closed her binder that contained resumes and stopped taking any notes. It was not a good experience and got the impression that she is not well versed in how to screen for an HR position.   The following day, I withdraw my application", "Interview Questions": "She asked no questions related to my skill set; only provided what she envisioned the role to be and how “hands on” she is (translation: micromanagement)"}, {"date": "11 Jun 2018", "title": "Admissions/AL Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Vibra Healthcare (Katy, TX) in Apr 2018", "Interview Descriptions": "The team at Vibra did a great job helping me understand the job I was applying for, which made me want to work for the company even more.  I felt comfortable and supported, with good communication throughout the entire process.  Good communication from the corporate level to the local Administrator, who did an excellent job in answering all my questions.", "Interview Questions": "There were a lot of questions regarding my experience with the sales process."}, {"date": "1 Mar 2018", "title": "Clinical Liaison Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Vibra Healthcare", "Interview Descriptions": "I applied online, when I did this they offer an email to talent management after submission.  You can email them within 24 hours to have them check on your application, I highly reccommend this because it forces them to actually look at your resume.  I applied on a Friday, emailed on Saturday knowing they would see it Monday and they emailed me back with a preliminary phone interview time.  I had the phone interview that day.  Passed phone interview and was asked to take IP behavioral test, and give them my references (they email your reference a list of survey questions, so make sure everyone knows). Two days later I had a face to face with the business development director, 2 other CLs, the CEO, and the HR director.  My interview  was over and hour and very thorough.  Waiting for offer.", "Interview Questions": "Walk me through your resume and experience"}, {"date": "5 Mar 2018", "title": "Management Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 5 weeks. I interviewed at Vibra Healthcare in Jan 2018", "Interview Descriptions": "Initial phone interview with the recruiter, first interview includes 2 manager and HR manager, final interview with a manager and director. The process took a while because of their schedule. However, the recruiter is great with follow up and keeping you informed.", "Interview Questions": "Normal questions on your experiences, and situational questions."}, {"date": "12 Oct 2017", "title": "Business Development Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Vibra Healthcare", "Interview Descriptions": "Initial phone screen, then had an in-person interview with facility CEO.  Was told by CEO that I would be recommended to move to next stage, next day was called by HR representative asking how interview went.  Then never again heard from HR representative.  Three weeks later received rejection email.", "Interview Questions": "Was really just a conversation on business and growing referrals with physicians."}, {"date": "31 Aug 2017", "title": "Registered Nurse Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Vibra Healthcare", "Interview Descriptions": "The interview was on time. The frontliners were receptive and accommodating as I await for my turn. The Head of the panel interview came to greet me at the reception area and  I was led to the meeting room where the other members of the panel were. They were warm and had a list of questions regarding your  clinical knowledge, skills and attitude towards patients, work and other members of the health care team. It was well-organized.", "Interview Questions": "They asked about your personal  strengths and how you handle conflicts at work."}, {"date": "7 Jun 2017", "title": "Lpn Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Vibra Healthcare (Lincoln Park, MI)", "Interview Descriptions": "Interviewed by Director of nursing who sat with me personally 1:1 and asked me several questions about job experience and why I choose to be a nurse at Vibra.  After about 20mins I was hired on the spot.", "Interview Questions": "Why did I choose nursing."}, {"date": "26 Jun 2017", "title": "Accountant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Vibra Healthcare (Mechanicsburg, PA) in Jun 2017", "Interview Descriptions": "Phone interview with member of HR was followed by an invitation to an onsite interview. Prior to that interview, I was required to complete an online video interview, an online reference check (5 required, 2 prior supervisors) and a behavioral index.\r\n\r\nMy onsite interview was with the head of HR, two of the managers, and the supervisor I'd report to. (Each met individually with me.)", "Interview Questions": "Most questions were behavioral - what was I expected from this role and would I be challenged enough."}, {"date": "26 Sept 2017", "title": "LVN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 3 days. I interviewed at Vibra Healthcare (DeSoto, TX) in Nov 2016", "Interview Descriptions": "Through clinical educator, you get a tour and a lay out of the day to day work. Advantages of the job. The floors, expectations, you get to meet the administrative team as well as other nurses.", "Interview Questions": "What is your specialty area of interest?"}], [{"date": "12 Oct 2016", "title": "RN Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Vibra Healthcare", "Interview Descriptions": "Group interview of me and two other nurses. They first showed us around the floors and physical therapy room, let us peep into some patients rooms, etc. We  were then taken into a private room where a panel interview was started. We each described ourselves and our backgrounds until we were then taken into a separate room for individual interviews. \r\n\r\nProcess all together took 1 1/2 hours.", "Interview Questions": "1. What are your highest acuity patient\r\n\r\n2. Describe a stressful situation and how you handled it\r\n\r\n3. What are your strengths\r\n\r\n4. What can you bring to the team"}, {"date": "20 Apr 2018", "title": "Floor Nurse Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 days. I interviewed at Vibra Healthcare (Boise, ID) in Feb 2016", "Interview Descriptions": "Comfortable,  sat in front of a panel of administration. The room was nice and everyone was down to earth. They each took turns asking a question and then I was able to leave with a thank you for interviewing.", "Interview Questions": "How I dealt with conflict."}, {"date": "11 Apr 2018", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Vibra Healthcare (Sacramento, CA) in Dec 2015", "Interview Descriptions": "Panel interview, first 1:1, then phone screen then the interview. 5 people panel each goes down the list of questions some clinical some scenario based. They give feedback. Be relaxed and answer what you know. Best of luck.", "Interview Questions": "Scenario based "}, {"date": "11 Nov 2015", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Vibra Healthcare", "Interview Descriptions": "Standard interview questions. 2 person panel, relaxed setting. friendly staff. no surprises. started with questions about your work experience, types of facilities you've worked in. staff answered questions regarding current facility and population type.", "Interview Questions": "strengths and weaknesses, dealing with difficult patient's and co workers."}, {"date": "18 Feb 2016", "title": "Technician Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Vibra Healthcare (Folsom, CA) in Nov 2015", "Interview Descriptions": "it was all over the phone, I still have never met my boss nor the person that interviewed me. She ended up being promoted to some other position and a new person took that role and she has yet to come around to introduce herself...", "Interview Questions": "typical questions like your weaknesses and strengths"}, {"date": "11 Jul 2016", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Vibra Healthcare (Charleston, SC) in Jun 2015", "Interview Descriptions": "Short and to the point. The person who interviewed me didnt really ask a lot of questions. They just talked about vibra. The interviewer was also new, recently hired 2 months prior to my interview.", "Interview Questions": "What experience I had in healthcare"}, {"date": "9 May 2015", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Vibra Healthcare (Redding, CA) in May 2015", "Interview Descriptions": "Basic interview questions with director of nursing; very nice, laid back person. Took me around the unit and introduced me to other staff and nurses. I was impressed by how friendly everyone was and it appeared he had a great relationship with the nurses. The whole process was just over 1 1/2 hours.", "Interview Questions": "strengths/weaknesses, why do you want to work here, why should we hire you, what do you know about the company, why did you leave your last job, what is important to you in a work environment, what did you like least about your job, if offered job, when could you start. What questions do you have for me--the DON also explained the culture, types of patients and the company's mission and goals."}, {"date": "14 Nov 2016", "title": "RN Staff Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Vibra Healthcare in May 2015", "Interview Descriptions": "Got a phone call from a recruiter based in the east coast.Casual interview process. Not much preparation is needed. One on one. Talked to thw CCO directly and lasted for 15 minutes.", "Interview Questions": "Questions like if you can work 12 hours, can you help cna's."}, {"date": "23 Apr 2015", "title": "Regional Vice President of Operations Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Vibra Healthcare in Mar 2015", "Interview Descriptions": "Initial phone screen by HR VP. Nice enough guy.  Then they sent online reference survey that had to be completed on front end. This was a complete waste of time for my references to have to complete this before I even got to a second round interview. Issue it after candidates are invited onsite if they don't want to do it at the end. It's inconsiderate to expect candidates to call on our references unnessarily.  Then they followed up with a pre-recorded video interview. Imagine Skype without someone on the other end. It's pretty impersonal. It displays the question and tells you how long you have to answer it. Then it starts recording you from your own computer's camera. I wasn't offended by it but I found it ironic that they valued their time so much (by not having to attend all those interviews in person) but our references had to stop and help us with that stupid front end survey. after the video interview I had an opportunity to interview with David Long. He seemed like a nice guy and I would have worked for him. Here are the pre-recorded interview questions.", "Interview Questions": "1) give career overview in 1.5 mins. \r\n2) describe managerial style in 1.5 mins\r\n3) professional weakness and how to overcome 2 mins\r\n4) how do I hold people accountable?\r\n5) examples of c-level presentations I've given.\r\n6) total compensation and what I expect. \r\n7) long term professional goals\r\n8) greatest success as a multi site latch administrator\r\n9) overall interest level and barriers that exist to hiring me?\r\n10) why I'm the best candidate. \r\n\r\nI didn't write how long I was given on the last several questions but the times ranged from 1.5 to 2 whole minutes to respond. \r\n\r\nQuestions were reasonable screening questions."}, {"date": "29 Apr 2015", "title": "Management Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 2 months. I interviewed at Vibra Healthcare (San Diego, CA) in Mar 2015", "Interview Descriptions": "I applied and didn't hear anything initially after applying for the job. I reached out to the recruiter a few times and then finally received a screening interview. I got advanced to a video interview and then an in person interview.The process went very well and was efficient once I connected with the recruiter. There was a delay in the beginning in no-one responding to the job application that I had filled out and there was a delay after the in person interview with the hiring manager deciding on whether to advance me to the next stage of interviews. The recruiter that managed the process was great to work with.", "Interview Questions": "They wanted examples of situations that had been handled."}], [{"date": "5 Dec 2014", "title": "RN Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Vibra Healthcare", "Interview Descriptions": "I applied online, was contacted by corporate within a few hours, and was told my resume would be forwarded onto HR at the hospital location I had applied at. I interviewed a week or so later and within a few hours of the interview was offered the job.", "Interview Questions": "What do you find the most challenging in your current position?"}, {"date": "28 Nov 2014", "title": "IT Staff Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Vibra Healthcare", "Interview Descriptions": "Applied online and was called for interview within a few days. Had extensive interview, at corporate office, with multiple members of management team. Was reimbursed for travel expenses. This was nearly an all day process.", "Interview Questions": "Asked multiple times if working salary was OK."}, {"date": "15 Nov 2014", "title": "Clinical Liaison Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Vibra Healthcare in Oct 2014", "Interview Descriptions": "I received a call from corporate and she asked me some questions over the phone.  She referred my resume for a face-to-face.  I had that interview and I guess it went ok.  Received another call from corporate and she said \"I guess everything went well\" and set up another phone interview with the regional manager.  Never received that call. Position is filled.  Very odd!!", "Interview Questions": "easy questions, non intimidating"}, {"date": "12 Jul 2016", "title": "Patient Account Representative Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. The process took 4 months. I interviewed at Vibra Healthcare (Fresno, CA) in Aug 2014", "Interview Descriptions": "Director interviews, pulls many possible employees from temp agencies & works them for 3-4 months prior to employment offer. Questions on satisfaction with job duties, any problems with current management  Would you like permanent employment!", "Interview Questions": "Salary raise due to previous experience acceptable?"}, {"date": "15 Jun 2014", "title": "Dietitian Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Vibra Healthcare", "Interview Descriptions": "Disorganized process from the scheduling if the interview all the way to the call informing you of the decision. The interview was overly casual and the interviewer did not actively engage.", "Interview Questions": "Tell me about your experience "}, {"date": "17 Mar 2014", "title": "Cash Applications Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Vibra Healthcare (Fresno, CA)", "Interview Descriptions": "Received call if I was interested after applying and they set up an interview. It's not an interview it's a conversation. All my questions were not answered accurately so do your research. They do anything to get you to accept job but no pay worth the harrassment.", "Interview Questions": "N/A"}, {"date": "7 Jan 2014", "title": "RN Interview", "results": "No Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Vibra Healthcare", "Interview Descriptions": "Consists of a phone interview, then scheduled in person interview.", "Interview Questions": "What areas are you the weakest?"}, {"date": "11 Sept 2017", "title": "Lpn Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Vibra Healthcare (Portland, OR) in Jan 2014", "Interview Descriptions": "short quick and to the point, very easy one on one interview very personal was offered position on the spot, no waiting for benefits, was interviewed by nursing manager, given tour of the facility", "Interview Questions": "availability"}, {"date": "26 Nov 2017", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Vibra Healthcare (DeSoto, TX) in Jan 2014", "Interview Descriptions": "It was a job fair. Very laid back and organized. It was one on one and handed off to the next person as I went through the process. Everyone was very nice to me.", "Interview Questions": "N/A"}, {"date": "7 Sept 2013", "title": "RN Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Vibra Healthcare (Mount Pleasant, SC) in Aug 2013", "Interview Descriptions": "One on one interview in nurse manager's office.", "Interview Questions": "Why should I hire you?"}], [{"date": "17 Jan 2015", "title": "IT Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Vibra Healthcare in May 2011", "Interview Descriptions": "On site interview with multiple corporate people in addition to multiple phone interviews. Took most of the day.Was asked similar set of questions by each interviewer. Some seemed to want to be intimidating... Don't know why.", "Interview Questions": "Nothing really \"heavy\". Was asked to expound on resume."}]]