[[{"date": "6 Jul 2023", "title": "Security Administrator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Masonicare (Wallingford, CT) in Jun 2023", "Interview Descriptions": "Phone screening was fine. All standard process, but I certainly dodged a bullet here. The initial salary range was 80-90k and the schedule was hybrid, completely lowballed during the second interview when it changed to 75k and on-site only. Lots of red flags with taking on responsibility of other departments such as networking while management relaxes at home. On call rotation didn’t sound too bad but lots of “you’ll be drinking from the fire hose” comments. Hopefully this helps some folks understand the culture here.", "Interview Questions": "What port is Remote Desktop protocol?"}, {"date": "12 Nov 2019", "title": "HR Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Masonicare", "Interview Descriptions": "I enjoyed both my first and second interview with Masonicare. All managers with whom I met and had the chance to speak with were very nice. My first interview lasted about 45 minutes and was then called two days later to come back for a second interview, which was scheduled for 2 weeks later. After my second interview, I was never called back and also noticed that same day the same job was reposted.", "Interview Questions": "I enjoyed both my first and second interview with Masonicare. All managers with whom I met and had the chance to speak with were very nice and asked me straightforward questions. Some of these questions were related to how I would respond to a certain situation, etc. "}, {"date": "11 Oct 2018", "title": "RN Case Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Masonicare (Hartford, CT) in May 2017", "Interview Descriptions": "good. managers 2-3 posing questions. well structured. informative on work expectations. they asked personal as well as work type questions to get a feel as to whether you would be a good fit for the job", "Interview Questions": "multiple scenarios"}, {"date": "24 May 2017", "title": "Nurse Case Manager - Homecare Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Masonicare (Wallingford, CT) in May 2017", "Interview Descriptions": "This is one of the most unprofessional places I've had to deal with. Poor management. Poor benefits. Interviewee was on phone throughout meeting. Appeared dirty. Would not recommend this place. Please look in to other agenicies that will value your time. If this is any indication of how a job would be I would rather work elsewhere", "Interview Questions": "Experience "}, {"date": "5 Jan 2016", "title": "CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Masonicare (Wallingford, CT)", "Interview Descriptions": "Called in to interview a few days after i applied.  Jillian is awesome!  she is so helpful ad asked me some really great questions.  Next i met with a nurse manager for anothe rintevriew and then was hired a few days later.  its a very quick process.", "Interview Questions": "Have you ever had any issues with a co-worker or a manager?"}, {"date": "9 Dec 2015", "title": "Human Resources Role Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 3 days. I interviewed at Masonicare in Oct 2015", "Interview Descriptions": "Disappointing.  I was cold-called by a member of their staff who sent me an email on LinkedIn and a Voice Message on my personal phone that I would be a 'fantastic fit' for an open role with their firm.  I made arrangements to leave my job early and travel approximately 30 miles to attend an interview at their corporate location.  I followed-up the interview with appropriate thank you letters to both interviewers.\r\n\r\nAfter 3 weeks I contacted the recruiter and left a polite message reaffirming my interest in the role and asking if she would mind letting me know if I was still being consideration.  I never received a response.\r\n\r\nI understand that rejection is part of the job-search process.  But I do believe that if a recruiter is going to engage in 'cold-calling', making unsolicited calls to already-employed potential candidates that result in a candidate taking the time and effort to personally show up for a 60-minute interview, it is just common courtesy and the professional RESPONSIBILITY of that recruiter to follow-up with a timely status report or decision.  A simple boiler-plate rejection letter or timeline for a decision would suffice.\r\n\r\nAs a professional, my time is very valuable.  Regardless of whether a candidate is the 'right fit' - or not - as a recruiter, it is your responsibility to treat potential candidates with the professional courtesy they deserve, as well as represent your company vis-a-vis the highest professional standards.   As an HR professional with nearly 30 years of work experience I believe that respect and courtesy is essential in dealing with the public.", "Interview Questions": "Do you think you would be happy in this sort of environment?"}, {"date": "8 Jun 2019", "title": "Clinician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Masonicare (Wallingford, CT) in Aug 2015", "Interview Descriptions": "Started with a phone interview with HR followed by an in person interview with clinical supervisor. There was nothing unexpected with interview process. Negotiations were completed in 2-3 days and I was hired.", "Interview Questions": "Do you have any specialty area of practice?"}, {"date": "24 May 2015", "title": "Online Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Masonicare (Newtown, CT) in Mar 2015", "Interview Descriptions": "HR recruitment was a bit of a pest in my opinion to the point of harassment calling and repeat questioning of my references listed when applying for the position in question, One would think that the job was a HIGH PAYING position with all of the questioning< Which turned out to be a 12.25 per hr offering! (LOL) Iam a 12yr experienced CNA I was making 12.00per hr back in 2004 it is now 2015 so of course I quickly turned down the position! No company is gonna get cheap labor out of me especially when office staff sit on there behinds all day in front of the computer making anywhere between 15-20 bucks per hr while iam subject to horrible smells terrible weather conditions and communicable diseases.", "Interview Questions": "How long have you been a CNA, What qualifications do you have for position!! Ect the normal questioning during the interview process"}, {"date": "3 Oct 2013", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Masonicare (Wallingford, CT)", "Interview Descriptions": "Structured process.  Interviewed with HR and then with a unit manager.  Received a job offer within a week of final interview.  Assessment and objective interview questions.", "Interview Questions": "Some of the assessment questions made it clear they are looking for staff with sharp skills!"}, {"date": "24 Jul 2013", "title": "Staff PT Home Care Branch Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Masonicare", "Interview Descriptions": "Resume submission and interview", "Interview Questions": "Nothing difficult. What is your experience, why are you changing jobs, etc."}], [{"date": "22 Nov 2013", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Masonicare (Wallingford, CT) in Jul 2013", "Interview Descriptions": "I submitted a job inquiry on their website and was called to schedule an interview the next day.  The interview was very pleasant as the interviewer was very nice, personable, and easy to talk to.  Next step was an interview with the Clinical Nurse Manager - scheduled very quickly after the initial interview.  Job offer was made the following business day!", "Interview Questions": "I don't remember any extremely difficult or unexpected questions during the interview."}]]