[[{"date": "24 Mar 2023", "title": "ESTÁGIO Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Amcham Brasil", "Interview Descriptions": "conversa com o time de recursos humanos, gestor da área e gestor da unidade que eu estava me aplicando no processo seletivo. foram conversas para me conhecer e eu conhecer eles tambem", "Interview Questions": "qual o motivo de voce querer trabalhar aqui?"}, {"date": "8 Nov 2022", "title": "Estagio Marketing Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Amcham Brasil (Campo Grande, Mato Grosso do Sul)", "Interview Descriptions": "Encontro inicial, com apresentação da empresa, apresentação pessoal e dinâmica de grupo tudo junto. Todo o processo foi feito online, diferentemente do último (antes da pandemia). O processo contava com cerca de seis pessoas e uma RH. Após a dinâmica, sei que haveria o painel de negócios, mas não passei dessa vez.", "Interview Questions": "Eu não passei para a entrevista."}, {"date": "25 Jun 2022", "title": "Analista De Eventos Pleno Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 4 weeks. I interviewed at Amcham Brasil (São Paulo, São Paulo) in Apr 2022", "Interview Descriptions": "Entrevista teve boa dinâmica com a conversa fluindo. Mas demoram muito para falar sobre salário, a vaga é de analista de eventos pleno mas o salário é júnior. Não condiz salário com a responsabilidade do cargo.", "Interview Questions": "N/A"}, {"date": "6 Jan 2022", "title": "Analista De Eventos Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Amcham Brasil", "Interview Descriptions": "Ágil. Tive a sensação de estar sendo entrevistada por quem entendia do ramo. Foi importante conhecer melhor comp funciona o processo lá. Não foi desta vez, mas conheci o espaço, pessoas, funcionamento, salário. Importante experiência para minha trajetória.", "Interview Questions": "Escreve uma redação sobre Eventos"}, {"date": "19 Apr 2023", "title": "Analista S&ecirc;nior Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at Amcham Brasil (São Paulo, São Paulo) in Sept 2021", "Interview Descriptions": "Foram algumas etapas, com diferentes lideranças. O tratamento é sempre com respeito, o processo é tranquilo e eles buscam pessoas habilidosas que queiram crescer, recebi proposta, porém não aceitei por motivos pessoais.", "Interview Questions": "Como você lida com trabalho em equipe? Quer uma empresa onde possa crescer e receber outras oportunidades? Quais suas experiências? Por que você acha que se encaixaria na equipe?"}, {"date": "24 Jul 2022", "title": "Analista Júnior Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Amcham Brasil (Salvador, Bahia) in Aug 2021", "Interview Descriptions": "A recrutadora entrou em contato através do linkedin e avançamos para a entrevista com simulação de uma reunião com um potencial cliente. \r\nNa simulação era notável a necessidade de expressar a habilidade em vendas.", "Interview Questions": "Perguntas básicas sobre personalidade e habilidades + perguntas sobre interesse na empresa + na simulação perguntas de vendas mesmo"}, {"date": "25 Oct 2021", "title": "ESTÁGIO Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at Amcham Brasil (Salvador, Bahia) in Jun 2021", "Interview Descriptions": "Dinâmica simulando reunião com uma prospecção de parceria, oportunidade  para conhecer a empresa durante a preparação da reunião. Perguntas comuns pessoais. A segunda etapa seria uma conversa direta com o diretor local.", "Interview Questions": "- apresentação\r\n- por que a empresa"}, {"date": "16 Sept 2021", "title": "Analista Comercial Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Amcham Brasil (Uberlândia) in Apr 2021", "Interview Descriptions": "Habilidade é a capacidade de por os conhecimentos em prática, é o saber fazer. E para descobrir isso você tará que fazer as perguntas mais sutis.\n\nUma coisa é durante a entrevista de emprego para vendedor o candidato responder dizendo que é formado em engenharia de sistemas e que sabe tudo de informática.\n\nOutra é pedir para ele dar um exemplo de projeto em que suas sugestões foram determinantes para fechar a venda.", "Interview Questions": "Você é criativo? Conte um caso em que isso foi determinante para fechar uma venda.\n"}, {"date": "10 Jun 2021", "title": "Analista Comercial Júnior Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Amcham Brasil (Recife, Pernambuco) in Mar 2021", "Interview Descriptions": "Entrevista tranquila com alguns responsáveis pelo setor de RH da empresa. Eram umas 3 ou 4 pessoas. Feito por Vídeo chamada. Uma delas conduzia e te fazia as perguntas. Eles eram simpáticos e você se sente confortável.", "Interview Questions": "Defeitos. Virtudes. Hobbies.  Algo que marcou sua vida profissional."}], [{"date": "3 Mar 2021", "title": "Estagiário Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Amcham Brasil (Belo Horizonte, Minas Gerais) in Feb 2021", "Interview Descriptions": "Durante o processo foram realizadas 4 entrevistas com pessoas de diferentes cargos na Amcham, não passei por nenhuma dinâmica. As primeiras entrevistas foram focadas na minha apresentação, trajetória profissional e pessoal, as duas últimas entrevistas foram focadas na minha personalidade e comportamento.", "Interview Questions": "Quais são seus objetivo daqui 10 anos?\r\nPerguntas sobre minha trajetória profissional e os resultados que obtive."}, {"date": "19 Jan 2021", "title": "Estagiário De Produtos Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Amcham Brasil in Jan 2021", "Interview Descriptions": "O processo foi tranquilo, bem ordenado, justo e efetivo. Me senti confortável, e a pergunta de entrevista permitia várias possibilidades de resposta ampla. Cumpri com as minhas expectativas em relação ao que foi solicitado, e tudo correu/foi conduzido muito bem.", "Interview Questions": "Por que deveríamos contratar você? E por que não?"}, {"date": "4 Oct 2020", "title": "Analista Júnior Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Amcham Brasil", "Interview Descriptions": "Entrevista muito boa e dinâmica, mostram pontos fortes e fracos do candidato, educados, tranquilos. Me senti confortável, sem pressão e com vontade de entrar na empresa.\r\nMe fizeram perguntas objetivas, batemos papo, tudo da maneira mais clara e legal possível.", "Interview Questions": "O que te motiva  na vida?"}, {"date": "29 Apr 2020", "title": "Estágio Em Direito Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Amcham Brasil (São Paulo, São Paulo)", "Interview Descriptions": "Inscrição via LinkedIn, Convite para Entrevista por Email, Entrevista Presencial na sede da Amcham em São Paulo, Dinâmica em Grupo com Apresentações Individuais, Perguntas de cunho pessoal para cada candidato (Ex: Você já trabalhou?/Em qual semestre você está?/De qual faculdade?)", "Interview Questions": "Como você se ve daqui 5 anos?\r\nEscolha uma Figura com a qual você se identifica. Por que você se identifica com ela?"}, {"date": "4 Mar 2020", "title": "Estagiária De Relacionamento Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at Amcham Brasil", "Interview Descriptions": "Foi um processo bem extenso e com muitas dinâmicas, paineis projetos  e muito conteúdo  e trabalho em equipe metas expostas e muitos desafios e perguntas acertivas , descrição  de falas fazer apresentações...", "Interview Questions": "como você  se ver daqui  10 anos ?"}, {"date": "21 Mar 2020", "title": "Estagiário Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Amcham Brasil (Campo Grande, Mato Grosso do Sul) in Mar 2020", "Interview Descriptions": "Estava sendo ofertado o cargo de Analista de Aqusição Jr, porém o processo seletivo foi feito para buscar esta e mais duas vagas de estágio. \r\nEtapas: \r\n\r\n- Dinâmica em grupo;\r\n- Painel executivo;\r\n- Entrevista;\r\n- Entrevista com o superintendente regional. \r\n\r\nO processo é feito pela própria equipe do escritório (não há RH). Eles focam muito em comportamento, apresentação pessoal e habilidades de venda. Boa comunicação e espírito de liderança também são valorizados. \r\n\r\n Depois da apresentação da empresa, a primeira dinâmica consiste da apresentação pessoal do candidato. A segunda, era um trabalho em equipe onde era necessário montar uma torre de papel, com determinado material e tempo, e depois a equipe teria que vender a torre. Poucos conseguem realizar, mas o mais analisado não é o comprimento da tarefa em si, mas o decorrer de todo o processo e atenção as instruções. A terceira consiste em o candidato ir até a frente, sortear uma notícia sobre algum fato atual  e discorrer sobre o assunto. Poucos conseguem realizar. Além de avaliar o nível de conhecimento e atualização dos candidatos, eles avaliam também como você se sai de uma situação que não tem o domínio técnico necessário. \r\n\r\nNo painel executivo,  os candidatos dividiram-se em grupos, onde era feito uma simulação de reunião com associados. \r\n\r\nNa terceira, é feita a entrevista individual no escritório, com a equipe. Eles fazem questão de deixar o candidato à vontade, fazendo perguntas pessoais e sobre sua vida. Você sai da entrevista acreditando que passou.", "Interview Questions": "Me venda o seu nome."}, {"date": "22 Feb 2020", "title": "Analista De Aquisição Júnior Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. The process took 1 day. I interviewed at Amcham Brasil in Feb 2020", "Interview Descriptions": "Houve apresentação da empresa como de costume, apresentação dos candidatos, por fim a dinâmica de grupo. A condutora da reunião foi muito carismática e solícita, conseguiu transmitir entusiasmo pelo seu trabalho na empresa, e conseguiu me deixar também apaixonado pela empresa.", "Interview Questions": "Porque deve ser contratado?"}, {"date": "11 Feb 2020", "title": "Estagiário Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 5 days. I interviewed at Amcham Brasil (Brasília, Federal District) in Jan 2020", "Interview Descriptions": "Foi uma dinâmica em grupo. Em um primeiro momento a empresa foi apresentada, depois todos participantes foram convidados a ir la na frente e falar o nome, o curso, a faculdade, um momento marcante e porque deveria ser contratado. Depois foram feitas duas dinâmicas em grupo para avaliar nossa capacidade de argumentação.  Após isso não recebi nenhum tipo de retorno da empresa, o que tornou a experiência negativa, pois não vejo sentido em não dar nenhum tipo de feedback.", "Interview Questions": "Por que você deveria ser contratada?"}, {"date": "17 Oct 2019", "title": "Trainee Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Amcham Brasil", "Interview Descriptions": "Umas 10 pessoas em uma sala no local, eles explicaram a empresa, o cargo, as atividades e houve dinâmica em grupo, fomos divididos em pequenos grupos, depois cada um falou de si.", "Interview Questions": "Por que você quer trabalhar aqui?"}, {"date": "29 Nov 2019", "title": "Analista De Relações Internacionais Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Amcham Brasil (São Paulo, São Paulo) in Oct 2019", "Interview Descriptions": "Me candidatei online e 20 dias depois me chamaram para uma dinâmica de grupo. A dinâmica tinha pelo menos 15 concorrentes e durou três horas. \r\nA dinâmica consistiu em fazer uma redação em português, traduzir dois parágrafos para inglês e  apresentação pessoal. Depois destas etapas um tema era sorteado para cada entrevistado discorrer em inglês. \r\nDepois de aprovado em todas as etapas o candidato é entrevistado individualmente pela gestora da vaga.", "Interview Questions": "Descrição breve sobre a carreira, anseios profissionais, performance em inglês e painel com temas aleatórios sobre comércio internacional."}], [{"date": "18 Nov 2019", "title": "Analista De Relacionamento Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Amcham Brasil (Nova Lima) in Sept 2019", "Interview Descriptions": "Inicialmente foram apresentados os benefícios da empresa, que são muito abaixo do trabalho exigido. No dia da dinâmica, os grupos foram divididos com seis integrantes cada e tivemos que elaborar uma lista descrescente de ordem de culpa  para o caso \"Quem matou Maria\". Na hora das apresentações, os organizadores perguntou uma pessoa aleatória sobre quem liderou o grupo. Feito isso, perguntou ao \"suposto\" líder quem ele contrataria.", "Interview Questions": "Quem foi o líder do grupo?"}, {"date": "22 Jul 2019", "title": "Analista Pleno Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 3 days. I interviewed at Amcham Brasil (Campinas, São Paulo)", "Interview Descriptions": "2 seletivas de dinâmica em grupo, com apresentação individual e em grupo (business case).", "Interview Questions": "Qualidades e defeitos"}, {"date": "3 Jul 2019", "title": "Estagiário Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 3 weeks. I interviewed at Amcham Brasil", "Interview Descriptions": "Foi uma entrevista muito longa: teve mapeamento de perfil, dinâmica, painel, entrevista com gestão e entrevista com um hunter especialista. Muitos momentos eles tentam te pressionar pra ver como você reage, mas fazem muitas perguntas pra avaliar o nível de compromisso, eles focam muito nisso.", "Interview Questions": "Me cite duas situações que você foi determinada. E uma delas que você falhou e como lidou com isso.\r\nQual tipo de pessoa você gosta de trabalhar e qual não gosta?\r\nQual líder, no cenário político econômico, você admira?"}, {"date": "7 Jul 2019", "title": "Analista De Aquisição Júnior Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Amcham Brasil (Belo Horizonte, Minas Gerais) in Jul 2019", "Interview Descriptions": "Apresentações individuais dos participantes e, posteriormente, uma dinâmica de grupo no qual os gestores de RH separavam as pessoas em 2 grupos, a fim de solucionar um enigma, e o primeiro grupo que entregasse a resposta certa acabava com a dinâmica.", "Interview Questions": "O que te levou a escolher a \"Amcham\"?"}, {"date": "15 Jun 2019", "title": "ESTÁGIO Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. I interviewed at Amcham Brasil (Belo Horizonte, Minas Gerais)", "Interview Descriptions": "Decepcionante. Não existe um profissional de RH que participe do processo seletivo. Não fazem nem uma básica triagem de currículos, chamam todos para a dinâmica (mais de 20 pessoas). Realizam uma dinâmica que dizem ser para avaliar como nos comportamos em situações de pressão, mas, por nao serem capacitados par um processo seletivo, acabam gerando ate mesmo uma falta de educação para com os participantes. Para completar, recebi um e-mail de que não passei para a próxima etapa e 20min depois recebi outro e-mail me convidando para uma dinâmica de grupo (a mesma que eu ja tinha participado). Ou seja, acredito que iriam realizar uma dinâmica com um novo grupo e nem ao menos prestaram atenção em quem estavam convocando (convocaram alguém que ja tinha sido reprovado no processo), tornando a experiência do candidato ainda mais frustante.", "Interview Questions": "-"}, {"date": "19 Oct 2020", "title": "Estagiário Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Amcham Brasil (Rio de Janeiro) in Jun 2019", "Interview Descriptions": "A primeira etapa da entrevista consistiu em uma dinâmica de apresentação, uma fala sobre notícias do mundo e uma redação. A parte das notícias pode ser um pouco complicada, pois o responsável pela dinâmica só mostra sobre o que você precisa comentar quando você já está em pé, na frente de todos. Além de ser uma questão de sorte, é também para ver o quanto você sabe sobre conhecimentos gerais, negócios e desenvoltura, principalmente quando não se conhece o assunto determinado. A segunda etapa foi a entrevista com os gestores, do setor e da filial RJ. Foi tranquila, fizeram bastante perguntas sobre mim e minhas experiências, além de ter uma pergunta em inglês. Na minha opinião, a primeira parte é mais complicada.", "Interview Questions": "O que você gosta de fazer no seu tempo livre?\r\nPorque você se identifica com esse personagem?\r\nMe fale um defeito e uma qualidade."}, {"date": "17 May 2019", "title": "Analista De Aquisição Júnior Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Amcham Brasil (Campinas, São Paulo)", "Interview Descriptions": "Foi um processo tranquilo, bem rápido, uma dinâmica, na qual deram a resposta rapidamente, seguindo com mais duas entrevistas. Todas as etapas são simples e diretas.", "Interview Questions": "Porque saiu do ultimo emprego"}, {"date": "23 Apr 2019", "title": "Analista De Relacionamento Júnior Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Amcham Brasil (Brasília, Federal District)", "Interview Descriptions": "O processo seletivo é em grupo e extremamente colaborativo, sinto que algumas pessoas prejudicaram o grupo todo por terem opiniões muito forte e serem pouco flexíveis.", "Interview Questions": "Em uma das dinâmicas havia uma caixa com diversas manchetes de jornais. O objetivo era pegar uma das manchetes, que poderia ser sobre qualquer assunto e falar sobre esse assunto por um minuto."}, {"date": "23 Apr 2019", "title": "Analista De Aquisição Júnior Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Amcham Brasil (Goiânia)", "Interview Descriptions": "Primeiramente, achei muito exagerada a quantidade de pessoas participando do processo seletivo; me pareceu que quem mandou currículo foi chamado, aparentemente avaliaram bem superficialmente os currículos, era possível selecionar e filtrar um pouco mais os participantes para um processo mais realista e agradável. Em segundo lugar, não são profissionais especializados em recursos humanos que realizam a seleção, e sim os próprios funcionários da filial na mesma carreira do cargo em oferta. A dinâmica em grupo é interessante, mas mais do mesmo (uma tentativa de mensurar como o candidato se comporta trabalhando em equipe), no entanto é mal executada por muitas razões, uma delas é que os grupos são grandes, justamente pela quantidade de gente que participa do processo seletivo; isso inclusive estimula uma \"competição\" entre os candidatos que não é saudável para um processo seletivo, (gente que não dá espaço pros outros participarem durante a dinâmica, gente tentando desesperadamente se destacar às custas dos outros, principalmente dos que ficam mais inibidos, etc.); um avaliador jovem e que não tem formação voltada pra recursos humanos, que sozinho vai passar pelos grupos \"olhando\", avalia esses fatores de maneira muito superficial ao meu ver. Durante a dinâmica a pessoa responsável por avaliar os grupos (uma pessoa só), apenas passava pelos grupos sondando a dinâmica, e depois da dinâmica tem o momento de \"expor\" os \"melhores e piores\" candidatos em termos de desempenho diante de todo grupo de candidatos. Em linhas gerais, uma perda de tempo, mas pra não dizer que total, vale a experiência como preparação para processos seletivos futuros em outras empresas. No fim, você não recebe nem um feedback sobre sua eliminação, eu recebi uma mensagem automática padronizada pelo site de recrutamento (o que é compreensível pela quantidade exagerada de gente que participa da seleção, mas mais uma prova de que o processo é mal executado e dá uma impressão de \"desleixo\" para com os participantes que perderam tempo \"enchendo\" a sala e sequer foram de fato avaliados por esse processo seletivo).", "Interview Questions": "Nenhuma questão interessante."}, {"date": "17 Apr 2019", "title": "Analista De Relacionamento Júnior Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. I interviewed at Amcham Brasil (Recife, Pernambuco)", "Interview Descriptions": "muito interessante e extremamente completo, suficiente para entender quem tem o perfil que a empresa procura e quem realmente deve estar dentro", "Interview Questions": "minhas experiencias"}], [{"date": "27 Mar 2019", "title": "ESTÁGIO Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Amcham Brasil (Campinas, São Paulo)", "Interview Descriptions": "Foi um processo bem interessante, pelo menos na primeira fase. O entrevistador conta um pouco sobre a historia e objetivos da empresa, depois disso é solicitado a todos os candidatos (neste dia foi de aproximadamente 40 pessoas) a falar sobre algumas \r\n caracteristcas pessoais. Logo depois juntaram candidatos em grupos de 5 para fazer uma atividade em grupo. Por fim Cada candidato teve que comentar sobre uma frase aleatória sobre atualidades que ocorrem pelo mundo, que mostravam em um telão.", "Interview Questions": "Escolha um dos candidatos presentes e diga por que contrataria e trabalharia com essa pessoa."}, {"date": "14 Feb 2019", "title": "Analista De Negócios I Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 3+ months. I interviewed at Amcham Brasil (Salvador, Bahia)", "Interview Descriptions": "Extenso, exigente e instrutivo. Mesmo não tendo passado, sinto que aprendi muito sobre mim.\r\nSão algumas etapas divididas entre currículo, prova de conhecimentos e inglês, dinâmica de grupo com participação individual, em grupo e para montar projeto junto. Depois disso tem a entrevista.", "Interview Questions": "N/A"}, {"date": "2 Feb 2019", "title": "Estagiário Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Amcham Brasil (Belo Horizonte, Minas Gerais)", "Interview Descriptions": "O processo seletivo não é feito por um RH (Lê-se: psicólogos, que são as pessoas preparadas para tal), quem manda currículo é convocado para a entrevista, isso significa que serão vários candidatos e provavelmente muitos deles estarão presentes apenas para encher a sala e parecer um processo muito concorrido, isso quer dizer também que você pode perder seu tempo e energia com algo que definidamente não vai te levar a lugar algum. A dinâmica é mal feita, os 6 \"avaliadores\" apenas passam pelo grupo, são muito jovens (20-26 anos) e visivelmente despreparados para realizar um processo seletivo (isso provavelmente por não serem psicólogos), uma das \"avaliadoras\" inclusive foi debochada e ria dos candidatos pelos cantos, algo que achei muito antiético. A segunda etapa é individual e mais uma vez mal feita, as perguntas são aquelas básicas que todo psicologo faz, porém sabe interpretar as respostas porque estudou pra isso e consegue entender bem o perfil do candidato. A AMCHAM BH me pareceu muito elitista. No fim do processo seletivo acaba contratado aqueles candidatos com os quais eles mais simpatizaram e não necessariamente um candidato bom e preparado para o cargo. No geral pecam muito por não ter RH nas filiais e acabam perdendo bons profissionais.", "Interview Questions": "Fala um pouco sobre você. Quais suas qualidades e defeitos? Por que você quer trabalhar na ACHAM?"}, {"date": "1 Feb 2020", "title": "ESTÁGIO Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Amcham Brasil (São Paulo, São Paulo) in Jan 2019", "Interview Descriptions": "O processo seletivo foi complexo, com muitos concorrentes e etapas. Teve dois dias de dinâmica, tanto pessoal quanto em grupo e após isso teve a entrevista com os gestores da área e com o rh.", "Interview Questions": "3 defeitos e 3 qualidades "}, {"date": "18 Nov 2018", "title": "ESTÁGIO Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took a year or more. I interviewed at Amcham Brasil (Goiânia)", "Interview Descriptions": "Processo seletivo simples e prática, porém muito demorado. Toda a comunicação foi realizada via email, todos os funcionários são muito edcuados e prestativos.", "Interview Questions": "Quais meus objetivos futuros na empresa"}, {"date": "30 Oct 2018", "title": "ESTÁGIO Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Amcham Brasil (Goiânia)", "Interview Descriptions": "A dinâmica foi muito mal feita e não recebemos nenhum feedback. Os avaliadores ficavam apenas passando nos grupos e não pareciam prestar atenção.", "Interview Questions": "Meu diferencial para entrar na amcham"}, {"date": "2 Oct 2018", "title": "Analista Comercial Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 3 days. I interviewed at Amcham Brasil (Dourados, Mato Grosso do Sul)", "Interview Descriptions": "Processo um tanto quanto rigoroso, prova extremamente extensa, cansativa e sequer te dão um feedback sobre a entrevista. Aparentemente o ambiente de trabalho é agradável, mas a cobrança na entrevista é elevada e nynca te dão um parecer.", "Interview Questions": "Processo um tanto quanto rigoroso, prova extremamente extensa, cansativa e sequer te dão um feedback sobre a entrevista. Aparentemente o ambiente de trabalho é agradável, mas a cobrança na entrevista é elevada e nynca te dão um parecer"}, {"date": "31 Jul 2018", "title": "Estagiária De Relacionamento Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Amcham Brasil (Belo Horizonte, Minas Gerais)", "Interview Descriptions": "Processo bastante coerente em relação a vaga requisitada, explanaram todas as características esperadas do estagiário, descreveram exatamente o que seria feito caso o candidato fosse aprovado, bem como horários e salário.", "Interview Questions": "Qual a maior dificuldade que você enfrentou?"}, {"date": "29 Feb 2020", "title": "Estagiário Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Amcham Brasil (Recife, Pernambuco) in Aug 2018", "Interview Descriptions": "Primeira etapa composta de seleção de currículos para posterior entrevista. O currículo foi enviado por e-mail através da tomada de conhecimento de abertura da vaga por conhecidos que trabalhavam na empresa. Após alguns dias do envio, através de ligação, fui convidada para participação na entrevista.", "Interview Questions": "Principais pontos fortes e fracos (fugindo das respostas clichês); situações de liderança."}, {"date": "5 Aug 2019", "title": "Estagiário Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Amcham Brasil in Jul 2018", "Interview Descriptions": "Processo de entrevista tradicional, focado em conhecer as competências e experiências no candidato, seu estilo de trabalho e etc, sendo mito baseada no currículo entregue. A entrevista possui um clima amigável durante o processo", "Interview Questions": "Com que tipo de pessoa você tem dificuldade de trabalhar?"}], [{"date": "16 Nov 2019", "title": "Analista Jr Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Amcham Brasil (Campo Grande, Mato Grosso do Sul) in Apr 2018", "Interview Descriptions": "Muitas etapas de processo, a seleção é bem rigorosa para conseguir manter o nível de qualidade entre a equipe, para assim continuar oferecendo um serviço de excelência que a empresa traz para sociedade brasileira há 100 anos.", "Interview Questions": "Contar uma experiência onde tive sucesso."}, {"date": "6 Mar 2018", "title": "Analista De Produtos E Serviços Júnior Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Amcham Brasil (Salvador, Bahia)", "Interview Descriptions": "Bem estruturado e dinâmico, as etapas foram bem condizentes com o perfil da empresa, realizando um vídeo de apresentação, e posteriormente, sendo chamado para a entrevista", "Interview Questions": "Quais os principais pontos de dificuldade encontrada na execução dos eventos que esteve envolvida na organização?"}, {"date": "17 Sept 2019", "title": "Estagiário Superior Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Amcham Brasil (São Paulo, São Paulo) in Jan 2018", "Interview Descriptions": "dinâmica das frases, entrevista por competência e entrevista com gestor. PEdiram para escrever redação e também para comendar assuntos e notícias aleatórias. Entrevista interessante com varios canditados. Faltaram algumas perguntas especificas e um explicação melhor institucional da amcham", "Interview Questions": "Qual impacto da taxa de juros dos EUA no mundo"}, {"date": "26 Nov 2019", "title": "Analista Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Amcham Brasil (Belo Horizonte, Minas Gerais) in Jan 2018", "Interview Descriptions": "O processo seletivo se inicia primeiramente com uma dinamica em grupo na qual você coloca suas habilidades de trabalhar em grupo em prática, com desafios para serem resolvidos em conjuntos, depois é realizada uma entrevista individual com varios gestores de diferentes areas e setores da empresa.", "Interview Questions": "Qual seu maior defeito?"}, {"date": "12 Oct 2017", "title": "Estagiário Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Amcham Brasil (Campinas, São Paulo)", "Interview Descriptions": "Muito criterioso. Quatro fases com participação de todos os gestores, não apenas do RH e da área. Porém, o processo me gerou muito aprendizado devido ao alto grau de dificuldade.", "Interview Questions": "Fui questionada a respeito de questões da atualidade, como por exemplo, a permanência da força nacional no rio de janeiro até o final de 2017."}, {"date": "24 Sept 2017", "title": "Analista Comercial Júnior Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Amcham Brasil (Belo Horizonte, Minas Gerais)", "Interview Descriptions": "O processo seletivo se deu através de email, e a próxima etapa foi realizada também por email. Foi um pouco diferente do tradicional pois teve uma etapa que era enviar um vídeo de até 2 min.", "Interview Questions": "Quais são meus diferenciais para ser contratado?"}, {"date": "30 Aug 2017", "title": "Estagiário Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Amcham Brasil (São Paulo, São Paulo)", "Interview Descriptions": "Achei bem interessante. Não é tão demorado para receber o convite para participar das dinâmicas . E você se sente à vontade em se apresentar.", "Interview Questions": "Qual características de um líder importante ?"}, {"date": "25 Jul 2017", "title": "Estagiário Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Amcham Brasil (São Paulo, São Paulo)", "Interview Descriptions": "Processo demorado, primeiro é preciso fazer uma redação em inglês sobre atualidade, cujo tema foi Trump e as relações bilaterais com Brasil, depois numa sala com mais 20 candidatos, você tem que sortear uma palavra especifica de Politica ou Economia e dissertar sobre ela em inglês, na frente do rh e de todos os candidatos, sem tempo pra pensar. é muita pressão e muito nervoso.", "Interview Questions": "Sobre Michel Temer"}, {"date": "20 Jul 2017", "title": "Analista Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Amcham Brasil (Belo Horizonte, Minas Gerais)", "Interview Descriptions": "O processo é concorrido, não passei da primeira fase apesar de ser bem simples  a dinâmica. Ambiente agradável. Todos ficaram bem a vontade durante a dinâmica.", "Interview Questions": "N/A"}, {"date": "9 Jun 2017", "title": "Analista De Relacionamento Júnior Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Amcham Brasil (Ribeirão Preto)", "Interview Descriptions": "É um processo seletivo bem amador, realizado pelo gestor da regional, ao invés do RH, que fica na matriz em SP e raramente se desloca para processos. Com isso, dá pra perceber um viés na seleção dos processos. Principalmente na dinâmica, os avaliadores eram bem agressivos, interrompendo pessoas e não permitindo ao participante terminar a apresentação. Há também sempre uma dinâmica com notícias da atualidade e frases de pensadores para você comentar, então chegue preparado e leia bastante nos dias anteriores.", "Interview Questions": "O quanto você quer trabalhar aqui, de 0 a 10?"}], [{"date": "8 Jun 2017", "title": "Analista Pleno Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Amcham Brasil (Porto Alegre, Rio Grande do Sul)", "Interview Descriptions": "ótimo, desafiante e enriquecedor, recomendo fazer o processo por que sempre se aprende algo fazendo ele. tem etapa de grupo e individual. vale olhar", "Interview Questions": "3 pontos positivos e 3 pontos negativos"}, {"date": "6 Jun 2017", "title": "Analista De Relacionamento Pleno Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Amcham Brasil (Uberlândia)", "Interview Descriptions": "O processo seletivo é extenso, com duas fases e muitas entrevistas. Não existe uma padronização", "Interview Questions": "O processo de entrevista é normal, perguntas padrão."}, {"date": "31 May 2017", "title": "Analista De Aquisição Júnior Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Amcham Brasil (São Paulo, São Paulo)", "Interview Descriptions": "Conduta e processo de contrataçao fraca. Acredito que é necessario ter um objetivo maior, por ter uma  rotatividade da empresa ser altissima", "Interview Questions": "Foi perguntado o porque de trabalhar la e quais objetivos a ser alcançado"}, {"date": "10 Sept 2019", "title": "Trainee Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Amcham Brasil (Recife, Pernambuco) in Apr 2016", "Interview Descriptions": "O processo de seleção foi em grupo, cerca de 10 pessoas estavam lá, sentamos em um semi-circulo e começamos falando sobre indicações e nossas formações. Após, tivemos uma breve apresentação da vaga disponível e também pudemos entender melhor como funciona a AMCHAN.", "Interview Questions": "Pediram para resolver um caso prático. E nos fizeram também uma pergunta filosófica, para respondermos em grupo."}, {"date": "16 Aug 2019", "title": "Analista De Relacionamento Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Amcham Brasil (Goiânia) in Apr 2015", "Interview Descriptions": "Várias etapas de processo seletivo, sendo a primeira dinâmica em grupo, perpassando por RH e posteriormente gerente/coordenador regional. Ter perfil arrojado, com visão de negócios e empreendedora ajuda na avaliação.", "Interview Questions": "Quais seus 3 principais defeitos e qualidades?"}, {"date": "23 Apr 2019", "title": "Products and Services Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Amcham Brasil (Porto Alegre, Rio Grande do Sul) in Jan 2015", "Interview Descriptions": "Three Phases:\r\nCV\r\nGroup Dynamics: Employers gave us various professions and a situation where the world would end and we could only bring a certain amount of these professionals to a new planet to restart humanity. \r\nInterview: They were interested on seeing comercial skills and \"something more\" that differentiate you from the others.", "Interview Questions": "What are your hobbies?"}, {"date": "11 Nov 2014", "title": "Junior Associate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Amcham Brasil", "Interview Descriptions": "First offer was made on facebook and through flyers on campus. I was called for the first interview, which was in a group of about 30 other candidates. The second interview was smaller, on a group of 6 people and you had to make a presentation about a product and talk about yourself at first, then there was a simulation when you had to convince three associates, playing as representatives of a company. The third interview was individual with manager of the area you were going to work with.", "Interview Questions": "The simulation was very tuff. The associates were hard on us."}]]