[[{"date": "21 May 2023", "title": "Tenure Track Professor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at Diablo Valley College", "Interview Descriptions": "Overall, the interview process is very formal, structured, and intimidating. It's a hiring panel of a handful of people who interview you. Most interviewers are hard to read in terms of how they feel about you, and in fact, appear neutral when you answer (some merciful panel members will nod once in awhile, but that's rare). Interviews are not conversational, but just a question and answer quickfire (you answer each question and then move on to the next); no room or time for chit-chat or more informal/friendly discussion. Teaching presentations are also part of the interview process, which takes a lot of preparation. DVC has one of the latest hiring/interview processes for professors in terms of timelines.", "Interview Questions": "Discuss a difficult situation with a student, colleague, or supervisor and how you handled it."}, {"date": "8 Dec 2022", "title": "Adjunct Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Diablo Valley College", "Interview Descriptions": "It was straightforward, friendly yet professional. They were open and welcoming but still holding me to a professional standard. I felt I was treated fairly during the interview. Overall, it was a fine interview experience.", "Interview Questions": "How was the ride down here today?"}, {"date": "16 Jul 2022", "title": "Lecturer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Diablo Valley College", "Interview Descriptions": "The process took place over several interviews, each progressively longer in duration and with more attendees. The first interview was with only the search committee, then students were brought in, and finally, only administrators were present.", "Interview Questions": "Why do you want to teach at Diablo Valley College?"}, {"date": "12 Mar 2022", "title": "Full-time (TT) Professor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Diablo Valley College", "Interview Descriptions": "Some extremely shady stuff going on or legal troubles that have them in hot water. Interview questions were give 15 minutes ahead of time, and an EEO officer was present. They stuck to an extremely exact script and tried to act as blank as possible. Never once did they seem interested in explaining why it might be a good place to work. Questions were blassé and pretty standard, but they refused to make it at all like a welcoming situation, that I was essentially cattle for their purposes.\r\n\r\nTwo interviews, no offer.", "Interview Questions": "How would you handle a situation where a student made an Islamophobic remark."}, {"date": "21 Jun 2021", "title": "International Office Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Diablo Valley College (Pleasant Hill, CA) in Sept 2019", "Interview Descriptions": "Had two interviews with three interviewees attending in each. The process didn't take too long. Felt that the  interviews were pretty organized. Not many creative questions that touched upon personality or passion.", "Interview Questions": "You will have many \"opportunities\" to answer phone calls and help students and their families with their needs. Are you comfortable taking and making calls? "}, {"date": "25 Feb 2018", "title": "Adjunct Lecturer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Diablo Valley College (Pleasant Hill, CA) in Dec 2017", "Interview Descriptions": "Had to apply online.  Was then contacted for an on-campus interview.  At interview was asked to teach a sample topic.  Also asked about how I would format the class / how I would interact with students.", "Interview Questions": "How will you grade the class?"}, {"date": "7 Dec 2017", "title": "Adjunct Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Diablo Valley College (Pleasant Hill, CA) in Mar 2017", "Interview Descriptions": "Usual application process including a CV and a livescan, followed by two separate interviews with the program director and the dean of the department. Each interview lasted approximately 30 minutes.  After receiving the job offer, I met in person with HR and completed the further required paperwork, which included providing sealed copies of transcripts.", "Interview Questions": "How would you ensure that all students are given the opportunity to succeed? "}, {"date": "28 Sept 2018", "title": "Math Titor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Diablo Valley College (Pleasant Hill, CA) in Aug 2016", "Interview Descriptions": "Group interview. It went smoothly and everyone needed to speak to the supervisor. The questions were relatively easy and it only took like an hour to finish the group interview.", "Interview Questions": "Why do you want to work as a math tutor?"}, {"date": "18 Apr 2018", "title": "Intstructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Diablo Valley College (Pleasant Hill, CA) in Mar 2016", "Interview Descriptions": "met briefly with head of department and head of program, discussed available classes, teaching methods and campus resources. Asked about previous experiences professionally and teaching, software used and presentation style", "Interview Questions": "What do you do with a disruptive student in class?"}, {"date": "29 Dec 2015", "title": "Instructional Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Diablo Valley College", "Interview Descriptions": "Two face to face interviews with three evaluating staff members who were not involved with the department for which the position was involved. Being that the panel was uninformed of the tasks needed to be performed, or what the department actually was concerned with left for questions of mine unanswered and confusion when describing my qualifications.", "Interview Questions": "What has been a job related failure in your past?"}], [{"date": "20 Apr 2018", "title": "Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Diablo Valley College (Pleasant Hill, CA) in Sept 2015", "Interview Descriptions": "I was asked by a professor because I was doing good in the class. The class was about Object oriented in C++. The professor also asked other students who were doing good in the class.", "Interview Questions": "N/A"}, {"date": "29 Jun 2015", "title": "Student Service Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Diablo Valley College (Concord, CA) in Jun 2015", "Interview Descriptions": "Screening interview. Three really nice people which make you feel at home. During the interview and some minutes before, you can see the questions. It takes like 30 minutes and you can make some questions at the end. In my case, they told me at the end of the interview that they will let me know the next week if I would pass to the next step. Effectively, they wrote me one week later indicating that they were looking for other candidates.", "Interview Questions": "How did you juggle with multiple activities. \r\nDescribe your experience: - working with diverse student - creating workshops - providing services to student - developing or implementing programs. \r\nHow you approach this position the first 60 days."}, {"date": "18 Apr 2017", "title": "English Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Diablo Valley College (Pleasant Hill, CA) in Apr 2015", "Interview Descriptions": "It was a very simple interview. I sat in front of the supervisor and had a very in depth chat with her about why I wanted the job and what my ambitions were in life.", "Interview Questions": "What is your dream career and why?"}, {"date": "6 Jun 2017", "title": "Counseling Counter Clerk/EOPS Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Diablo Valley College (Pleasant Hill, CA) in Sept 2013", "Interview Descriptions": "After the initial application process I had to wait two months before my first interview,(there would be two). First I met with the big boss and passed. Then I interviewed with my department manager, who would be my direct supervisor.", "Interview Questions": "Do you feel confident you can handle a fast paced job that can be stressful?"}, {"date": "16 Jul 2013", "title": "Office Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Diablo Valley College", "Interview Descriptions": "Application submitted via district website, then you get through a screening and see if you get invited for an interview. The 30-minute interview takes place at DVC and you will sit in front of a panel of 2-3 people. You'll be asked a set of questions and the questions are available on a piece of paper to read in front of you. After the interview, you wait to see if you get invited again for the last interview with another panel (most likely the manager and others). If you get hired, you are given a lot of documents to fill out at HR and then you have to get a physical (DVC pays for it). After all the documents are done, you're done!", "Interview Questions": "What do you see yourself doing in 5 years? What are your goals with this position?"}, {"date": "30 Oct 2015", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Diablo Valley College (Pleasant Hill, CA) in May 2012", "Interview Descriptions": "General questions, show your people skills. Have a great conversation with your manager, and they are pretty nice person. Ask you some general questions, and your schedule to match their work schedule.", "Interview Questions": "Where is the student union?"}, {"date": "29 Feb 2016", "title": "Periodical Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 days. I interviewed at Diablo Valley College (Pleasant Hill, CA) in Mar 2012", "Interview Descriptions": "General questions concerning availability and general ability. Asked about why the job was needed and ability to commit to the job. Showed up and answered a few question, got hired on the spot. It was pretty straight forward, I don't know what more to add.", "Interview Questions": "What hours can you work?"}]]