[[{"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 0, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "Cru Singapore", "rating": "5.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "20 Feb 2023", "job_title": "Creative in Singapore", "duration": "N/A", "pros": "Christian Organization with really good company culture", "cons": "Need to raise support for your salary"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 3, "review_title": "Developmental. Too comfortable. No direction.", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "22 Jan 2017", "job_title": "Anonymous Employee in Singapore", "duration": "N/A", "pros": "You have a lot of autonomy in your work. \r\nSupervisors are very understanding and sympathetic of family crisis. \r\nThere is a sense of family. Work environment is great. \r\nThe nature of the Christian work itself is very fulfilling if you are looking at something to do with people and simply evangelistic work. \r\nBeing part of a huge global missions organisation, the global exposure is rich and opportunities to work cross-culturally is limitless. (if you are a Christian, you will truly enjoy their focus on sticking true to fulfilling the Great Commission and obeying the Great Commandment)", "cons": "There is an overall lack of tenacity to fulfil important organisation goals. If you come from the private or public sector, be prepared for a lot of frustration when you experience a culture that accepts ambiguity and contradiction. \r\n\r\nYou will realise that work meetings tend to drag very long because of their unsaid belief in consensual leadership. If any leaders were to give a directive, the culture is such that there will be a lot of negativity towards leadership and the leadership feels compelled to attend to each individual, or if frustrated, say something that invites more controversy to force a buy-in. If you are coming in as a middle management and above, be very prepared for a long-drawn battles. The voices of the younger generation of staff (millenials) and the oldest generation of staff will be the loudest. \r\n\r\nLastly, certain departments are very over-worked: campus department (due to lack of manpower), missions department (due to the launch of many missions projects) and HR department (due to lack of proper HR-trained personnel to handle the work). If you are going to work in these three departments, be prepared. Due to work load and long hours, the staff members in these 3 departments fall sick very often."}]]