[[{"date": "6 Jul 2022", "title": "Program and Communications Intern Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Landesa", "Interview Descriptions": "One round of interview with two interviewers from the department that I applied to. It started with a brief self-introduction and then elaborated on certain experiences. The interviewers are very nice and didn't purposefully pressure you.", "Interview Questions": "What are some programs you are interested in working on"}, {"date": "15 Dec 2021", "title": "Program Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Landesa", "Interview Descriptions": "There was an initial screening interview followed by a panel interview with four or five people on the panel. The interview consisted mainly of situational questions. Everyone was polite and friendly.", "Interview Questions": "Why are you interested and excited about this position?"}, {"date": "18 Aug 2020", "title": "Operations Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Landesa", "Interview Descriptions": "It was a great interview process. Informative and transparent. The interviewer was clear and helpful. There was clear communication and the follow up was good. I was pleased with the entire process.", "Interview Questions": "Why are you seeking the operations intern posotion?"}, {"date": "25 Jan 2019", "title": "Director Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Landesa", "Interview Descriptions": "The interview process was Lengthy, multi step, several panels, calls and one on one meetings with staff and leadership across offices and departments. It felt excessive at times and not enough at others.", "Interview Questions": "Vision for role"}, {"date": "30 May 2018", "title": "Office Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Landesa", "Interview Descriptions": "They were moving quickly to fill this position so I had a phone interview one week and an in-person interview the following week.  The phone interview was about 30 minutes and delved into some of the basic interview questions and asking about my past capabilities in certain areas - had I ever set up a conference room for a meeting?", "Interview Questions": "Tell me about a time you made a mistake."}, {"date": "26 Apr 2018", "title": "Digital Media Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Landesa (Seattle, WA) in Apr 2018", "Interview Descriptions": "I went through 3 rounds of interviews, two over the phone and one in person. The process was clearly laid out from the first phone call, and all interactions were friendly and encouraging.", "Interview Questions": "Tell us about a time when listening was more important than speaking. "}, {"date": "10 Nov 2017", "title": "Executive Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Landesa (Washington, DC) in Sept 2017", "Interview Descriptions": "Sent resume, received phone interview, then in person interview, then writing assignment.   I BELIEVE that I had all the experience and skills they required, after all they wanted a writing assignment. I am mature and I have interviewed many times, and I believe the interview process went well, but I was finally sent an email telling me they had \"gone with someone who more closely fits their needs\" and then a week later, they posted the ad again.  I did request feedback, but received no response.  It was a very strange affair.", "Interview Questions": "What kind of experience did I have with Concur travel and expenses"}, {"date": "5 Nov 2015", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Landesa (Seattle, WA)", "Interview Descriptions": "Simple, straightforward process with organized HR team.\r\n\r\nI sent in my resume via email and was contacted by phone about a week later to schedule a phone interview. The phone interview was pretty standard. The HR assistant asked basic interview questions, discussed what they were looking for in a candidate, and went over compensation and benefits to make sure we were in the same range. The tone was casual, which helped put me at ease.\r\n\r\nA few days later, I was contacted via email to set up a face-to-face interview. I went in for a panel interview with the program staff, six people in all. However, the group was welcoming so I didn't feel too on edge. Questions revolved around my job experience and working style. I also got a better idea of what the position would entail and the overall vibe of the team. A day later, I was asked to submit references and complete a background check. They made a competitive offer the following week!", "Interview Questions": "Tell us about a time you demonstrated initiative on a project."}, {"date": "30 Nov 2019", "title": "Program Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. I interviewed at Landesa (Calcutta) in Jun 2015", "Interview Descriptions": "The Interview went well -the telephonic interview was done, then a face to face interview was done; after which the reference check was done. There was a panel of three who took the interview and asked questions about my previous profile, my skill set, how do I see myself in the position i applied for and then asked about my personal interests.", "Interview Questions": "They were to the point, specific and job-related "}, {"date": "1 Nov 2016", "title": "Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 2 months. I interviewed at Landesa (New Delhi) in May 2015", "Interview Descriptions": "Phone interview of two rounds followed by a face to face interview. One round was with the US office and another with the India office senior management team . Face to face involved external experts.", "Interview Questions": "About working as a team"}]]