[[{"date": "10 Sept 2022", "title": "Sr. Strategist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at DoSomething.org", "Interview Descriptions": "The interview process was efficient and clear. It was multiple rounds and nice to meet people from other departments. \n\nThere was an assignment required and standard for this kind of role.", "Interview Questions": "How do I handle conflict?"}, {"date": "9 Aug 2022", "title": "Intern Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at DoSomething.org", "Interview Descriptions": "It's a very common interview process. There is not much to talk about. Just apply and they will give you instructions on how to proceed. After that, just follow the instructions and do your best.", "Interview Questions": "Why do you want to join?"}, {"date": "17 Jun 2022", "title": "Product Management Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at DoSomething.org (New York, NY) in May 2022", "Interview Descriptions": "Prescreen, soft touch recruiters, hiring manager was involved in every call. Had a final round with a participant who wasn’t able to be fully present. Felt thorough, friendly, and intentional.", "Interview Questions": "Questions centered around work, and belief in the mission"}, {"date": "31 Jan 2022", "title": "Director of Programs Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at DoSomething.org (New York, NY) in Nov 2021", "Interview Descriptions": "Completed a phone screening with the recruiting agency, followed by an interview with two core team members followed by a presentation to leadership, including the CEO. I was ghosted after this presentation, which was very off putting considering the amount of time and energy was spent through the interview process.", "Interview Questions": "The basics and additional questions about how I’d approach specific scenarios."}, {"date": "8 Aug 2021", "title": "Operations Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at DoSomething.org", "Interview Descriptions": "The use of a recruiting service limits the initial insight into the company and the position. It was hard to gauge the level of company fit and company work culture.", "Interview Questions": "There were basic questions about experience. "}, {"date": "9 Aug 2021", "title": "Operations Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at DoSomething.org", "Interview Descriptions": "The interview process was easy and very comforting if you did your research on the company, I got a phone interview and still waiting to hear on the decision of a 2nd round interview, overall a good experience, asked how you would fit into the role and why, it is very important you do research on the company so that you can know what you are talking about", "Interview Questions": "To go over my resume with them "}, {"date": "1 Jun 2021", "title": "Freelance Graphic Designer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at DoSomething.org in May 2021", "Interview Descriptions": "I applied, screened, then was told the next steps would be a portfolio review and one or two more interviews after that. They ghosted me after the initial screening. I emailed twice for updates and have yet to hear back.", "Interview Questions": "Tell me about yourself.\n\nWhy do you want to work here?\n\nWhat are you looking for?"}, {"date": "12 Jan 2021", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at DoSomething.org", "Interview Descriptions": "I had to submit a written application with basic personal questions and why I want to intern for Do Something. Then I had an interview with two managers. They asked me some basic questions about my experience and why I wanted to work there.", "Interview Questions": "Describe one campaign of DoSomething's campaigns that  most resonate's with you and why"}, {"date": "5 May 2020", "title": "Civic Engagement Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "The process took 6 weeks. I interviewed at DoSomething.org", "Interview Descriptions": "Applied online. The process took forever and very little communication. It seems like they have a lot of turn over and have a hard time filling jobs. Maybe because HR is slow and not responsive? The whole thing was weird and off putting. Warning sign.", "Interview Questions": "The hardest part of the interview process was just getting a response from someone."}, {"date": "29 Jan 2020", "title": "Civic Engagement Position Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at DoSomething.org in Jan 2020", "Interview Descriptions": "I applied for a position in December 2019 and got a callback within 3 weeks. The phone call was overall pleasant with the recruiter being very conversational, a good back and forth. She promised that to give me an update on the hiring timeline or feedback by end of the week. End of the week comes, no answer. Beginning of next week starts - I followed up and still no response. I found out that the position was closed when I checked the website and saw it was removed. Not a great way to handle candidates DoSomething - could be a lot more professional.", "Interview Questions": "Why DoSomething?"}], [{"date": "22 Jul 2019", "title": "Senior Strategist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at DoSomething.org (New York, NY) in Jul 2019", "Interview Descriptions": "Extremely lengthy. Was disappointed after putting a lot of time into preparation to receive a very generic HR let down and no note from the team I had presented to. Seems the organization doesn't practice the compassion they preach...", "Interview Questions": "Not really anything (?) beyond involvement in previous projects "}, {"date": "19 Jan 2019", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at DoSomething.org", "Interview Descriptions": "I received an email then had a video interview with two employees, and then was sent an offer about 2 weeks later. Overall the process was great and very simple.", "Interview Questions": "What's your favorite campaign?"}, {"date": "10 Aug 2018", "title": "Intern Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at DoSomething.org", "Interview Descriptions": "Very Brief. Felt like he was just interviewing me to say that he interviewed me. Felt like he didn't really want to get to know me. Super rushed and did not get good vibes.", "Interview Questions": "Why did you apply for the specific role?"}, {"date": "12 Apr 2018", "title": "Digital Marketing Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at DoSomething.org (New York, NY)", "Interview Descriptions": "Really easy. Just truthfully and unapologetically be yourself. I made jokes and told them I wanted a safe space to be myself. I even wrote the lyrics of Africa by Toto for my cover letter. Just do you.", "Interview Questions": "What is a social issue you are passionate about?"}, {"date": "14 Nov 2019", "title": "Intern Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at DoSomething.org (New York, NY) in Feb 2018", "Interview Descriptions": "The interview process was pretty straightforward. I was interviewed by the person I was referred by along with another interviewer. I didn't do as well as I could have; I asked for feedback and they were glad to send USEFUL feedback. CEO is also sweet and thoughtful.", "Interview Questions": "How to describe me in three words"}, {"date": "7 Jun 2017", "title": "Campaign Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at DoSomething.org (New York, NY) in May 2017", "Interview Descriptions": "It was a speed dating style, where I met with about five members of the Campaigns team. It was great to meet with them one on one as opposed to being in a conference style but because of the way it was set up, I was asked the same questions repeatedly. They were all very down to Earth and friendly.", "Interview Questions": "What was one of your favorite campaigns and your least favorite and why? How would you improve your least favorite?"}, {"date": "2 Apr 2017", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at DoSomething.org (New York, NY)", "Interview Descriptions": "The interview was through Skype and was not too difficult. You should definitely understand the culture of the organization before you apply and an understanding of their campaigns, too. Pick a campaign that you love and be able to talk about it.", "Interview Questions": "Why are you applying for this position? "}, {"date": "20 Feb 2017", "title": "PR & Talent Relations Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at DoSomething.org", "Interview Descriptions": "While at first I was taken aback with their the nonconventional interview process, I quickly realized that their process is extremely transparent and communicative. Although I wasn't happy with the ultimately result I appreciated how open and honest the HR person was every step of the way, this definitely mirrors the attitudes and culture at the company. The only constructive note I have is helping to ensure that all technology works during Skype interviews.", "Interview Questions": "Why do you want to work here?"}, {"date": "24 Jan 2017", "title": "Marketing Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at DoSomething.org (New York, NY)", "Interview Descriptions": "The interview process was VERY efficient. It started with a 30-min in-person meeting with HR and the outgoing person, followed by a project, followed by a 1 hour interview with the entire team + outgoing person. The only negative feedback I have is that the interview included the outgoing person in the presentation which made it politically tricky to provide direct feedback/ideas on how I would put forth a new/different vision.", "Interview Questions": "If there was a headline that described success, what would it be?"}, {"date": "3 Jan 2017", "title": "Business Development Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at DoSomething.org (New York, NY)", "Interview Descriptions": "Thorough and engaging. I met with multiple people from the top to an intern. They rotated through different rooms doing multiple interviews at once. Be prepared to talk about issues you are interested in and campaigns they are working on.", "Interview Questions": "How does your experience relate to this position?"}], [{"date": "23 Jan 2017", "title": "Intern Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at DoSomething.org in Jan 2017", "Interview Descriptions": "They emailed me for a phone interview. The phone interview took 15 minutes or so. She asked very general questions and it was more to get to know who you are.\r\nThen, they invite you to their office to chat with other members of the team and ask more questions in order to see if you are a right fit for the firm/team.", "Interview Questions": "Why DoSomething?\r\nWhere do you see yourself in 5 years?"}, {"date": "15 Jan 2017", "title": "Software Engineer: Messaging Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at DoSomething.org (New York, NY) in Dec 2016", "Interview Descriptions": "neutral experience, but I am sure I did my home work very well...........My home work was to create 3 components that interacts . Before that I met wit CTO. He was very nice. after submitting my home work they called me for debriefing", "Interview Questions": "N/A"}, {"date": "8 Dec 2016", "title": "Senior Strategist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at DoSomething.org (New York, NY) in Sept 2016", "Interview Descriptions": "The interview process was arduous. I've worked for much more competitive companies, but for some reason DoSomething (specifically their strategic arm TMI) went out of its way to make things extraordinarily difficult. The number of interviews (and the number of times I had to trek into their office) was excessive. Some of the team members were smart and pleasant, but the majority were surprisingly condescending -- especially senior staffers. In the end, after they made me a low ball offer (even by nonprofit standards), I had a two-hour final interview that made it clear on both ends that this job was not for me. This entire process could have been shortened by 6 weeks or more if the company had the sense to revamp its interview process. It's such an insular, particular team with a very specific type of employee. Meeting senior management early on in the interview process would have been beneficial, as I would have known immediately that it was not a good fit.", "Interview Questions": "Don't you think that's an inappropriate way to handle clients? [After I explained that sometimes its nice to be able to vent to colleagues about a tough deal]"}, {"date": "21 Dec 2016", "title": "Campaigns Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at DoSomething.org (New York, NY) in Sept 2016", "Interview Descriptions": "Overall good interview process. Takes time (3 different rounds of interviews) but you'll know exactly what you're signing up for after. Consisted of speed interviews as well as team interviews with different teams across the entire organization. Definitely familiarize yourself with the organization beforehand. Questions range from professional experience to what I like to do on the weekends.\r\n\r\nExpect 1 to 2 months of interviews.", "Interview Questions": "Why do you want to work at DoSomething.org?"}, {"date": "21 Jul 2016", "title": "Strategist At TMI Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at DoSomething.org (New York, NY) in Jun 2016", "Interview Descriptions": "Speed Dating Interview. Was not organized at all.  Each group asked the same general questions.  I could tell that they had not prepared at all, and had little interest in my answers.  The 15 minute interview style allowed for no depth or formation of relationship with interviewers.", "Interview Questions": "Tell me about your experiences"}, {"date": "12 Mar 2016", "title": "CMO Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at DoSomething.org (New York, NY) in Mar 2016", "Interview Descriptions": "I was interviewed by the HR person and the person currently in the role.  Both of them were very nice and open about the role, the organization and what it was like to work there. The interview lasted only 30 minutes and they'd made a decision within three days of the interview.", "Interview Questions": "What would you take on in your first 90 days?"}, {"date": "4 Feb 2016", "title": "Impact Team Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at DoSomething.org (New York, NY)", "Interview Descriptions": "Speed Interview with 3 different people. Fast paced questions. Everyone was so nice, the office is a really great environment. Make sure to study and know a lot about the company before interviewing with them.", "Interview Questions": "How will your experience prepare you to succeed here."}, {"date": "18 Aug 2015", "title": "Campaigns Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at DoSomething.org", "Interview Descriptions": "I was contacted to come in for a speed interview. The whole process was very friendly and the questions were not too difficult. Do come prepared though as there will be specific questions about the organisation. The process took about a month.", "Interview Questions": "Why DoSomething?"}, {"date": "27 Aug 2015", "title": "International Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at DoSomething.org (New York, NY) in Aug 2015", "Interview Descriptions": "Phone interview which was about less than half an hour long. It was very fast paced and slightly rushed but it gave me a chance to understand the organization.\r\nThe interviewer was very friendly and open to questions.", "Interview Questions": "Tell me a little bit about yourself.\r\nTell us what you like to do for fun\r\nWhy DoSomething?  \r\nWhat are you looking to get out of this internship?  \r\nWhat campaign area interests you the most?  \r\nWhat is a cause you are passionate about?\r\nWhat is your favorite campaign of ours?  \r\nIf you could go to a private music festival with only three artists (alive or dead), who would they be?\r\nWhat global event in the last week are you currently following closely?\r\nWhat was the last book you read?\r\nTell me how you work independently and when you&#039;ve had to be a leader"}, {"date": "2 Jul 2015", "title": "Director Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at DoSomething.org (San Francisco, CA) in May 2015", "Interview Descriptions": "A HR rep conducted a phone interview reviewing my background.  The interview was friendly and conversational.  I didn't come away any specific idea on whether she thought I was a good candidate or not.  A couple of weeks later I received a polite email saying that they decided to go another way.", "Interview Questions": "Provide examples of development projects led."}], [{"date": "8 Apr 2015", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at DoSomething.org in Apr 2015", "Interview Descriptions": "I applied online through their site. About two weeks later I received an email that I moved on to the next step in the process, which is a really fun \"homework\" assignment that they give you to see how well you would work in that position. I turned that in. The next day I was contacted about an interview. The next week I had my interview via Skype and I got to meet the entire team! They were so cool and laid back (I actually felt like I was over dressed for the occasion). They were so welcoming. I had a blast at the interview. The next day I was asked for 2 references. Two days later I had an official offer.", "Interview Questions": "Why DoSomething?"}, {"date": "6 May 2015", "title": "Member Experience Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at DoSomething.org (New York, NY) in Apr 2015", "Interview Descriptions": "Two very in-depth interview processes. One is a series of interviews with the heads of each department, the second (if called back) is a dual interview with the head of the internship program.", "Interview Questions": "Tell me something about yourself that no one else would know."}, {"date": "18 Oct 2014", "title": "Intern Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at DoSomething.org", "Interview Descriptions": "Quick phone interview after applying online. It's a fun office, so they only want fun people. A lot questions were to show how genuinely committed you are to youth movements and how creative you are.", "Interview Questions": "Who's your cartoon alter ego?"}, {"date": "6 Sept 2014", "title": "Education Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at DoSomething.org", "Interview Descriptions": "I sent in a resume, heard back a few weeks later, and was scheduled for a Skype interview. The interviewer was dressed casually. She asked me about my experiences and favorite Do Something campaigns. I stumbled quite a bit on the responses.", "Interview Questions": "She asked me details on my favorite campaign, and I admittedly did not do enough research."}, {"date": "9 Jun 2014", "title": "Associate Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. The process took 6 weeks. I interviewed at DoSomething.org", "Interview Descriptions": "Long process- be prepared to do your homework and know your stuff when you get there. Great company and organization. You meet a lot of great people during the process and stay positive through the entire thing. A good attitude never hurts! The in person group interview takes a little more than an hour.", "Interview Questions": "Where are you going to get the information to produce your work? How is this proven?"}, {"date": "12 Mar 2015", "title": "Campaigns Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at DoSomething.org (New York, NY) in Jun 2014", "Interview Descriptions": "Very in depth interview process. Went through 4 interviews before getting an offer. The interviews were all with different teams and employees throughout the organization, and it was nice to see that much and get a good grasp of the office culture. \r\n\r\nThe interviews ranged from meeting with the HR person to a series of speed interviews (5-10 minutes) with different departments. Overall the process was tedious albeit helpful when it came to making a decision. Also, some of the interview questions were about my background while others were more about finding out what kind of person I was.\r\n\r\nExpect up to a month or two of interviews.", "Interview Questions": "What are three adjectives that your future employees would use to describe you after a couple months on the job."}, {"date": "5 Nov 2014", "title": "Education Campaigns Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at DoSomething.org in May 2014", "Interview Descriptions": "I applied online and it took them about 2 weeks to get back too me. At the time, I was told I would have a Google Hangout interview and that we would be video calling each other. The day of my interview, the employer forgot about me. I had to send an email and luckily I only had to do phone interview. About a week later, I got the position.", "Interview Questions": "There is not one. If you are passionate about social change, you should find each question pretty easy to answer.  "}, {"date": "13 Oct 2014", "title": "Intern Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at DoSomething.org in Apr 2014", "Interview Descriptions": "I interviewed for an internship twice, once in 2013 and again for summer 2014. The first interview was by phone, and the second was via Skype. Both were relatively routine, asking why I wanted to work there,etc. The Skype interview was so short, and I felt I was being rushed and did not have enough time to say everything I wanted to. With both interviews, I followed up with a thank you and received no response whatsoever, both times. I would have appreciated a courtesy email either way. Although Do Something seemed like a great place to intern, that experience definitely left a negative impression on me.", "Interview Questions": "What is a cause you are passionate about/What is your favorite campaign of ours?"}, {"date": "10 Nov 2015", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at DoSomething.org (New York, NY) in Jan 2014", "Interview Descriptions": "Since it was an intern position the process was very simple. I applied online through by e-mailing my resume and cover letter in to the department director. A few weeks later I received a phone call to set up a phone interview. The phone interview was rather short, asking basic questions about experience and why I wanted to work at DoSomething, etc.", "Interview Questions": "Asked about my experience with research methods, etc."}, {"date": "16 Mar 2015", "title": "Program Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at DoSomething.org in Feb 2013", "Interview Descriptions": "It was very interesting and I was asked unique questions. I had a Skype interview first since I wasn't able to come into the office, then I was asked to come into the office and met with the Head of Fun, the manager that I would work with, as well as 3-5 others from the organization. Everyone came in for a few minutes and questions ranged from being about past experiences to how weird I am on a scale of 1-10. I was asked a lot of questions about my passions, interests and hobbies. I think this is because of the culture at DoSomething, they want work to be fun.", "Interview Questions": "How weird are you on a scale of 1-10?"}], [{"date": "5 Oct 2012", "title": "Developer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 3 weeks. I interviewed at DoSomething.org (New York, NY)", "Interview Descriptions": "1. Phone Interview\r\n2. In-Person Interview\r\n3. 2nd Round of In-Person Interviews\r\n\r\nThere was a long process of sending emails back and forth with the CTO and person who was scheduling the interviews.\r\n\r\nInterviews are done in rounds of groups of 2-3 people, and last about 10-15mins. It can be intimidating for people who are used to interviewing with 1-2 people at a time.\r\n\r\nBasically what they are looking for is your personality, how you would fit in culturally with the company (can you work well on a team, work with the rest of the company, communicate effectively).\r\n\r\nThey also want to see if you are passionate, motivated and have drive. The you want to have in mind is \"What do I bring to the company with my skills and how can I help Do Something's mission of making the world suck less?\"", "Interview Questions": "If you could have any super power, what would it be and why?"}, {"date": "15 Jul 2012", "title": "Business Development Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at DoSomething.org", "Interview Descriptions": "First, I applied online through their website, submitting a resume, cover letter, and brief answers to a couple questions they posed. They e-mailed me an offer for an interview about a month after I applied. It was almost like speed dating, the way the interview process was set up. I met with 5 different members of staff for 5 minutes each, and they asked me about myself and asked various other questions. I was called back for another interview a week later, and went through a similar process with a new pool of staff members. I loved the office, and everyone was very welcoming and kind.", "Interview Questions": "\"What part of this job are you looking forward to the least?\""}, {"date": "30 Dec 2013", "title": "Office Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at DoSomething.org (New York, NY) in Jul 2012", "Interview Descriptions": "Maybe I am the only one but this whole idea of \"group interviewing\" is the most uncomfortable way to interview. There is nothing like sitting in a waiting area where all the people there to interview for the same job get to wait and smile at each other until called.", "Interview Questions": "Everything was pretty expected. I felt like my interviewer was more focused on what question she would ask next then actually listen to my response. I think she was pretty checked out for the process."}, {"date": "7 Apr 2012", "title": "Special Projects (to Chief Executive Officer + Chief Operating Officer) Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at DoSomething.org (New York, NY) in Apr 2012", "Interview Descriptions": "SUPER AWKWARD SITUATION. (2 week total time invested)\r\n\r\nNeeded to send email with: Job title interested in (they had several) detailed cover letter, resume, and a writing sample which consisted of three suggested article topics for the Harvard Business review. Sent all items requested including well thought out articles for Harvard Business Review. \r\n\r\nReceived email from the staff member I sent application to about 4 days later. Interview scheduled for following week. I would be meeting with 3-4 staff members.\r\n\r\nI sent email early in the day confirming interview.  Three hours later (2 hours before interview), I received an email from the original contact person email, even though it was senior team member writing it stating \"So- and-so is no longer with our organization so please contact me at my email address to reschedule. Oh, and let me know what this meeting was regarding. \"\r\n\r\nI replied to new email address with \"I was scheduled for an interview and it was for (..job title..). I would be glad to forward the email chain between me and \"so-and-so\" which included my cover letter.  Please let me know when we can reschedule. Thanks so much for getting back to me about my interview today. Looking forward to hearing from you.\"\r\n\r\nNo reply email, no phone call, no interview rescheduled.\r\n\r\nNo idea what happened to the 3-4 people I was supposed to meet with in my \"group interview\".\r\n\r\nThis experience reiterated why I ALWAYS confirm my interview appointments the day they are scheduled regardless of who the employer is.", "Interview Questions": "No idea. Interview cancelled the day it was scheduled."}, {"date": "20 Jan 2016", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at DoSomething.org (New York, NY) in Jan 2012", "Interview Descriptions": "In-person interview with two staff members. Pretty average questions, just asked about relevant experience, hobbies, ect. They seemed to be checking for knowledge of their past work as well as culture fit. Also asked a little about education background and other internships. I think the winter internships are easier to get than the summer ones.", "Interview Questions": "Basic, tell us about your past experience questions."}, {"date": "9 Oct 2014", "title": "Head of Fun Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at DoSomething.org (New York, NY) in Dec 2011", "Interview Descriptions": "It was a speed interview format where you rotated through five-minute interviews with four different people as three other candidates were at different points in the rotation. Everyone was nice and asked typical behavioral interview questions. I was pretty under-the-weather and wasn't on top of my game at all, but left thinking that everyone I had met had been perfectly pleasant.", "Interview Questions": "There were some questions specific to the position, but nothing out of left-field."}, {"date": "25 Apr 2011", "title": "Finance Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at DoSomething.org (New York, NY) in Mar 2011", "Interview Descriptions": "Very informal, staff is very young and interactive and question were simple and mostly about your resume and past activities. No curveballs, and easy going. Lasted about 30 minutes, most of it was them talking describing the office and their jobs and what it is like working in the non profit space. Office was was aweosme, very open,. saw the ceo twice.", "Interview Questions": "Why Do Something?"}]]