[[{"date": "2 May 2023", "title": "Department Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Akron Children's Hospital (Akron, OH)", "Interview Descriptions": "Applied online and received an email from HR stating they’d like to interview me. Told me to add my interview via her public calendar. I tried but she did not have her calendar set up. I emailed her back to let her know and she gave me a snobby response, “just tell me what works for you and I’ll schedule it”. She Scheduled a phone interview with me for 10 days out. Then day of interview She no showed on me. I emailed her and she rescheduled for another week out. During the phone interview she started the convo with “I’m short on time so I may interrupt you to move this along”. The entire call sounded as if she was driving as there was a lot of background noise. She wasn’t taking notes and wasn’t even paying attention. I honestly think the position was already filled but since she no showed, she didn’t want to get in trouble so this interview was pointless. She was very rude and the whole experience put a negative light on the hospital.", "Interview Questions": "Tell me about a time you came across a diversity issue in the work place?"}, {"date": "3 Mar 2023", "title": "RN Resident Burn Unit Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Akron Children's Hospital (Akron, OH) in Mar 2023", "Interview Descriptions": "I was contacted by a recruiter, who set up an interview with one of the managers on the unit. I then spoke with the manager of the unit and we talked about my relevant experience and why I wanted to work on that unit.", "Interview Questions": "Why do you want to work on this specific unit?"}, {"date": "27 Feb 2023", "title": "Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Akron Children's Hospital", "Interview Descriptions": "HR department very kind and responsive. Quick to set up interviews and very open and sharing of benefit information. ACH has a great mission statement and they were sure you understood their values in the initial interview.", "Interview Questions": "Reason for the job interest and previous experience."}, {"date": "26 Feb 2023", "title": "Pediatric Nurse Practitioner Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Akron Children's Hospital", "Interview Descriptions": "Advancement is difficult as company uses single APP recruiter who knows movement across the entire organization. Well qualified individuals have been turned down for advancement seemingly because of this process.", "Interview Questions": "What was your most challenging day?"}, {"date": "1 Dec 2022", "title": "Sterile Processing Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Akron Children's Hospital (Akron, OH) in Dec 2022", "Interview Descriptions": "Was wonderful process. I learned a lot about the company. Both people interviewing me were very nice. It was pretty much like any other interview with any company that you would interview with.", "Interview Questions": "Why I wanted to work for Akron children’s hospital"}, {"date": "8 Nov 2022", "title": "Licensed Practical Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Akron Children's Hospital (New York, NY)", "Interview Descriptions": "After applying you will go through a phone interview (they use the star method), a virtual interview with the hiring manager,  and then I was offered the ability to shadow an employee .", "Interview Questions": "tell me about a time you went above and beyond at your job and inspired your colleagues"}, {"date": "26 Oct 2022", "title": "Trainer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Akron Children's Hospital", "Interview Descriptions": "2 step interview. Cut and dry. Hr started out the interview then turned over to managers. Next interview was team based asking questions based of epic experience. Both were relatively easy since it was based on epic. If you have experience you can answer confidently", "Interview Questions": "N/A"}, {"date": "22 Oct 2022", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Akron Children's Hospital (Akron, OH) in Oct 2022", "Interview Descriptions": "Very slow over two months. Lots of delays. Human Resources phone interview, hiring manager then panel eight co workers. Not as described on web site. No in person. Teams meeting. Psychological questions. Resume only loads with certain programs.", "Interview Questions": "Goals for next ten years"}, {"date": "9 Jun 2022", "title": "UX Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Akron Children's Hospital", "Interview Descriptions": "Pretty basic 'tell me about a time...'  questions, and some about problem solving, and also about technical skills and experience. Took about an hour in all, was with a panel of people.", "Interview Questions": "Pretty basic 'tell me about a time...'  questions, and some about problem solving, and also about technical skills and experience. Took about an hour in all, was with a panel of people."}, {"date": "23 May 2023", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Akron Children's Hospital (Akron, OH) in May 2022", "Interview Descriptions": "Phone interview then in person. Typical interview questions. Very nice and personable. Liked being invited for second interview and shadowing opportunity. Very professional and accommodating. Very impressed with recruiters and managers.", "Interview Questions": "What are your strengths and weaknesses"}], [{"date": "10 May 2022", "title": "Staff RN Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Akron Children's Hospital (Akron, OH) in Apr 2022", "Interview Descriptions": "HR did a phone interview then scheduled an in person interview with the nurse manager. From that, spent a morning shadowing and was unofficially offered a job pending a few details.", "Interview Questions": "Past patient examples (to determine knowledge base)\r\nWhy Akron Children's\r\nName a past mistake and how you learned from it"}, {"date": "4 Mar 2022", "title": "Occupational Therapist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Akron Children's Hospital", "Interview Descriptions": "The interview process involved submitting application on ACH website followed by an email to set up a thirty minute phone call interview with HR. A zoom interview was then set up  with rehabilitation department", "Interview Questions": "tell me about a situation where you had to deal with conflict"}, {"date": "9 Feb 2022", "title": "IT Team Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Akron Children's Hospital", "Interview Descriptions": "Great interview. I really appreciate the process and the questions on being culturally fit the organization. They gave a great detail picture of the expectations and how to achieve those expectations. It was candid and honest interview process.", "Interview Questions": "Previous experiences! And technical competency. "}, {"date": "4 Nov 2021", "title": "Histologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Akron Children's Hospital", "Interview Descriptions": "Interview process focused on my skills and other common interview questions. They ask things like can you cut a frozen and how many blocks a day do you typically cut?", "Interview Questions": "Typical interview questions. Can you do a frozen. How many blocks do you cut a day, etc."}, {"date": "24 Oct 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Akron Children's Hospital in Oct 2021", "Interview Descriptions": "Met with human resources first and then set up interview with hiring manager. Interview with HR was phone interview, basic questions and explanation of position. Interview with hiring manager over teams, also very straightforward.", "Interview Questions": "What their mission statement meant to me."}, {"date": "30 Aug 2021", "title": "NICU Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Akron Children's Hospital", "Interview Descriptions": "Very timely and easy. Mine was virtual but went very smooth. Started with a phone call with a recruiter  and then a video interview with the manager of the unit.", "Interview Questions": "They asked My strengths and weaknesses "}, {"date": "18 Aug 2021", "title": "Talent Selection Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "The process took 2 weeks. I interviewed at Akron Children's Hospital", "Interview Descriptions": "Applied online and received an automated rejection a few days later however, the hiring manager responded to LinkedIn message interested in scheduling an interview. Interviewer was almost 10 minutes late but I didn’t hold it against them, I understand things happen.  Interview consisted of behavioral questions and lasted about 1 hour. I enjoyed learning about the opportunity and interviewer expressed interest. They informed me they would email me a benefits brochure and discussed next steps. Since I was actively interviewing elsewhere, they asked me to keep them looped in on status. I followed up with a thank you email and it’s been over a week without any benefits/correspondence. \r\n\r\nOverall not a horrible experience, just misleading. Lets normalize not ghosting candidates and provide clearer transparency.", "Interview Questions": "Tell me about a time you worked with a difficult manager?"}, {"date": "1 Jul 2021", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Akron Children's Hospital (Akron, OH)", "Interview Descriptions": "Easy, fast and informative. 2 interviews. One with HR on telephone then Microsoft teams with hiring manager of unit. Smooth process and enjoyable to talk with workers. Would recommend applying to this hospital.", "Interview Questions": "How do you deal with angry patient?"}, {"date": "9 Mar 2022", "title": "Director Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Akron Children's Hospital in Jun 2021", "Interview Descriptions": "Multiple rounds of interviews with different interdisciplinary teams that the position would interact with.  Relatively short with typical behavioral based questions.  All interviews were over Teams, outside of the HR phone screen.", "Interview Questions": "Why do you want to work here?"}, {"date": "2 Dec 2020", "title": "Licensed Practical Nurse (LPN) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Akron Children's Hospital", "Interview Descriptions": "you will first talk to a recruiter, then be called in for face to face with manager, star format questions, dress professional, ask to shadow on the unit or shift that you will you be working on, why do you want to work in pediatrics?", "Interview Questions": "what is your weakness?\r\ntell me about a time you had a difficult co worker"}], [{"date": "16 May 2022", "title": "Pediatric Nurse Practitioner Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Akron Children's Hospital (Akron, OH) in Oct 2020", "Interview Descriptions": "On teams with several different people.  Questions vary from standard HR Questions to Questions about personality. It all depends on who is interviewing you. Office manager, some doctors, and some other nurse practitioners are usually present.", "Interview Questions": "What 3 words describe you?"}, {"date": "23 Sept 2019", "title": "Secretary Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Akron Children's Hospital (Akron, OH) in Sept 2019", "Interview Descriptions": "Had to email them back twice before getting a response. The interviewer was nice, but I felt rushed. She wanted to get it over within 25 minutes. Phone interview was quick and easy. Still have not heard anything after 3 weeks.", "Interview Questions": "Tell me about a time you had a conflict in the workplace."}, {"date": "3 Aug 2019", "title": "Project Management Office Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Akron Children's Hospital (New York, NY)", "Interview Descriptions": "There are indications that other areas of the hospital may have a better culture, but candidates within the Enterprise PMO / IT areas should be aware that they could advance through three interviews (hiring manager, panel of directors, and CIO), be asked to wait for a decision for several weeks, and then be informed via the boilerplate email from the Applicant Tracking System that they are no longer a candidate.\n\nBy experience, that appears to be the hiring process for the EPMO.", "Interview Questions": "Standard experience / behavioral questions."}, {"date": "13 Aug 2020", "title": "Behavioral Health Technician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Akron Children's Hospital in Jul 2019", "Interview Descriptions": "The interview process took about six weeks, but went smoothly. All the employees were warm and welcoming. I went through both a phone interview and then a in personal interview process. This employer is definitely team oriented and appreciates a motivation to be part of something bigger than yourself.", "Interview Questions": "What do you feel motivates behavior?"}, {"date": "10 Mar 2019", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Akron Children's Hospital (Akron, OH) in Feb 2019", "Interview Descriptions": "They use behavioral based questions. It was a panel of three people. First I had a phone interview, then they interviewed the top three candidates in-person.  The interview was thorough and professional.", "Interview Questions": "How do you prioritize your work?"}, {"date": "11 Jan 2019", "title": "PSR Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1+ week. I interviewed at Akron Children's Hospital (Akron, OH) in Jan 2019", "Interview Descriptions": "Phone interview, very informative. Unfortunately, the salary offered was not competitive compared to surrounding hospitals. PTO is significantly less, insurance is costly, employee parking is off campus which relays on a shuttle service. Not sure why ACH continues to grow/expand but never factors in more parking for staff. I really wanted this to work out but couldn’t take a loss in pay, pto, parking, hours & spend more on insurance.", "Interview Questions": "HR took over a week to get back with me after I was told they’d call me the next day."}, {"date": "23 Jan 2019", "title": "School Medical Assistant- Streetsboro Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Akron Children's Hospital (Akron, OH) in Nov 2018", "Interview Descriptions": "The interviewers were very engaging,and asked important questions related to the position. I was interviewed by the HR Rep,as well as the school Nurse at the same time. I felt like the interview went well,even though the position was not offered to me. I wish them the best of luck in their search for the right candidate!", "Interview Questions": "I was asked questions regarding my skills for the position,and they asked how I would handle different scenarios related to the position."}, {"date": "23 Jan 2019", "title": "MA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Akron Children's Hospital (Akron, OH) in Sept 2018", "Interview Descriptions": "I applied online through their career website. I got a call to schedule a 30-minute phone screening. After the phone screening, the HR department forwarded my application to which office they thought I had the best fit for.", "Interview Questions": "Why do you want to work here?"}, {"date": "28 Aug 2018", "title": "Unit Secretary Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Akron Children's Hospital (Akron, OH) in Aug 2018", "Interview Descriptions": "very friendly, comfortable environment, detailed questions and very well organized. The minute I walked in she made me feel comfortable. The interview went so well it went longer that expected since i was very detailed with my answers and i was not nervous. Great questions were asked, very pleased with the way the interview was done.", "Interview Questions": "Tell me about a time where you were unable to finish a task and how did you handle it?"}, {"date": "19 Sept 2017", "title": "Linen Material Technician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Akron Children's Hospital (Akron, OH)", "Interview Descriptions": "I applied online and a week later I received an email for a phone interview. I had my phone interview today  and was invited for an in person interview next week.", "Interview Questions": "Tell me a time when...\n\nWhat made you apply to this position?"}], [{"date": "23 Sept 2016", "title": "Operations Supervisor, Pharmacy Technicians Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Akron Children's Hospital (Akron, OH) in Jul 2016", "Interview Descriptions": "The interview process was straightforward. The HR department will reach out to you about their interest in your application, then you schedule a date to interview on site. The HR specialists meet you on the day of the interview, and conducts an initial assessment: describes the job in detail, shares salary, etc. After, you interview with the hiring managers, take a tour, meet the staff, and wait for a call back.", "Interview Questions": "What is one process you have implemented in your current or past job?"}, {"date": "16 Aug 2016", "title": "Pharmacy Technician Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 7 weeks. I interviewed at Akron Children's Hospital (Akron, OH) in Jul 2016", "Interview Descriptions": "Typical interview questions. I was told in a couple weeks they would contact me after a interviews were complete.  I followed up after my interview with hand-written thank you notes, after 30+ days of no response I contacted HR and was told \"we do not have an offer for you,\" no reason as to why either.", "Interview Questions": "How do you handle a difficult employee in the workplace"}, {"date": "17 Feb 2017", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Akron Children's Hospital (Akron, OH) in Apr 2016", "Interview Descriptions": "Interview with Manager, Coordinator, and educator. Standered questions related to nursing. Understanding of the nursing process, critical thinking, autonomy, as well as specific case questions. Call to offer the position a few days after interview.", "Interview Questions": "What would you do if you thought a medication was misprescribed for a patient?"}, {"date": "1 Sept 2019", "title": "IT Analyst Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Akron Children's Hospital (Akron, OH) in Oct 2015", "Interview Descriptions": "First phone interview and there after in person interview. There was a team of 4 individuals who asked questions. Some of the questions were asked to judge my responses. It seemed like they had a problem and we're looking for someone to come in and fix it. What helped me was my answers on how can I help them", "Interview Questions": "Tell us about the projects you worked on"}, {"date": "26 May 2015", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Akron Children's Hospital (Akron, OH) in Nov 2014", "Interview Descriptions": "Interviewed at a conference table with 3 employees. They took turns asking questions and getting to know me. I had trouble finding the foundation office so i ended up arriving 10 minutes late. The interviewers were very personable, which made the interview less stressful.", "Interview Questions": "When was a time a customer was upset, and what did you do to fix the situation?"}, {"date": "29 Dec 2015", "title": "Patient Liaison Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Akron Children's Hospital (Akron, OH) in Aug 2014", "Interview Descriptions": "Started with a phone interview, asked behavioral based questions. Second interview, you meet with the operations supervisor, operations manager, and administrative director of the department, they again ask behavioral based questions", "Interview Questions": "Q: Tell me about a time when you were involved in a contact with a coworker and what was the outcome?"}]]