[[{"Recommended": "Yes", "CEO Approval": "No", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Good experience", "rating": "5.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "30 Jan 2023", "job_title": "Family Care Specialist in Los Angeles, CA", "duration": "N/A", "pros": "Great experience Learn Innovative Great training Helpful", "cons": "Driving Pay Higher ups Management Nothing"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Good", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 3, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 0, "review_title": "Decline in quality of the organization over the years", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 8 years", "job_date": "11 Feb 2023", "job_title": "Procurement Transplant Coordinator in Los Angeles, CA", "duration": "N/A", "pros": "The company is very well organized and structured.", "cons": "Low pay, a lot of mileage on car, no growth."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": 4, "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Insight", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "4 Dec 2022", "job_title": "Donor Allocation Coordinator in Azusa, CA", "duration": "N/A", "pros": "There are plenty of overtime opportunities", "cons": "Company is really short staffed and stretched too thin."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": 4, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Good Start", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "28 Oct 2022", "job_title": "Surgical Recovery Technician in Redlands, CA", "duration": "N/A", "pros": "Solid Hours, Good pay plus increase with change of positions.", "cons": "Long hours, sometimes unrealistic expectations with outcomes of each case from management"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": 4, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": ".", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "5 Jul 2022", "job_title": "Family Care Coordinator in Los Angeles, CA", "duration": "N/A", "pros": "if you are a good worker there is lots of opportunity for growth and good benefits", "cons": "fast pace, schedule can get hectic depending on your position"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great place to work", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "30 Jun 2022", "job_title": "Talent Acquisition Manager in Los Angeles, CA", "duration": "N/A", "pros": "Great benefits\nManagement considers employee feedback\nCompany's mission and vision in helping save lives\nDiverse group of individuals encompass the organization", "cons": "Work can often plentiful and challenging"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Run  now your life and health depend on it!", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "24 Jun 2021", "job_title": "Coordinator in Los Angeles, CA", "duration": "N/A", "pros": "If you're lucky you will get a location where you never have to come to the corporate office and deal with the awful people OneLegacy has to call management.", "cons": "Degrading & unappreciative management that you have to answer to daily and some with absolutely no clinical experience even though in Clinical Dept!! The pay was lowered substantially after I left and everyone was told it's for their own good! There is \"NO\" Organ Department field staff member who will give this company a 5 STAR  review if they have worked here for longer than a year.\r\n\r\nAll the 5 star reviews are from the COO's shoe lickers trying to acquire more resumes since the turnover rate there is ridiculous. \r\n\r\nThe number of labor lawsuits against them is so deserving it's hilarious.\r\n\r\n\r\nCompany motto \"Every ORGAN Every TIME!\" Disgusting abuse of power to employees and the public.\r\n\r\nIf you're a shoe licker w/ no ethics you can climb this ladder to the top...Good Luck = )"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 0, "Diversity and Inclusion": 3, "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "Too much stress", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "12 Dec 2020", "job_title": "Referral Consult Coordinator in Los Angeles, CA", "duration": "N/A", "pros": "The mission is amazing the company actively helps those in need of organs .", "cons": "Too much emphasis on numbers and how they look in comparison to other OPOs . Work life balance is really difficult with this job due to the fact you literally don't know where your going to end up at the end of your shift it could be 5 minutes from your house or 3 hours away. If you don't like to drive do not apply. Sometimes expected to do more responsibilities than previously discussed upon hiring . HR is somewhat of a joke  complaints aren't taken seriously and if people in positions of power do not like you then just be careful because you can be fired at anytime . You have to be extremely flexible and work well under stress and constantly be in new surroundings every shift . Employee safety isn't taken seriously even with COVID 19 restrictions, This job is exhausting and not for the faint of heart your dealing with death and trauma everyday."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 0, "Culture & Values": 0, "Diversity and Inclusion": 0, "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Could do much better", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "1 Nov 2021", "job_title": "Surgical Recovery Technician in Los Angeles, CA", "duration": "N/A", "pros": "The mission of saving lives is a big drive for most of the people working there. \r\nThe benefits are good.", "cons": "The pay for the amount of work being done is nothing. \r\nWork life balance does not exist in this company. \r\nRetention rates are very low based on how employees are treated, culture, and the pay.\r\nEmployees feel, and are often treated as disposable.\r\nQuantity over quality.\r\nInconsistent training."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": 4, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "Life-Savers", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "12 Jul 2021", "job_title": "Coordinator in Los Angeles, CA", "duration": "N/A", "pros": "Bottom line: the work of organ donation is giving children more time with their parents, spouses more years of marriage, enabling families to have children, ultimately extending life by decades. I have met grandparents who only know their grandchildren because of what we do - they received a heart or a lung or a liver transplant 5, 10, or 20 years ago. They have family members who've since been born that never would've known them.\n\nThis is a gift for donor family members too. Donor families are experiencing the worst moments of their lives. They may find the donation process difficult, or resist it altogether in cases when their loved one was on the registry and gave first person authorization. But often they are responding to the terrible, sudden death of someone they love as much as life itself. It's OneLegacy's job to be kind, compassionate, and persistent about donation, because families don't get a do-over once they say no to donation, and neither do the would-be recipients. \n\nYou may read negative reviews about emphasis on \"numbers.\" Those numbers save lives. 1 more organ donor can mean 15 more years of life for 5 different people. No one on the front lines, or in operations has an easy job. But the reason these jobs are so hard is because every organ donor is a life-saver. I think employees can lose sight of that because they don't meet enough recipients. I've had the privilege of meeting many and so I'm proud to work for an OPO that pursues every organ, every time.\n\nThey value employees. They put their money where their mouth is, making sure employees are fairly compensated, and taken care of with competitive benefits.", "cons": "There is room for improvement with organizational culture. Dedicated employees have often felt voiceless. I can see where efforts are being made, but there's still a lot of room to grow.\n\nCommunity partnerships at the grassroots level, with churches, organizations, and schools, could go a long way. I know there is an open position for that purpose now, so efforts and growth are happening there too.\n\nIf you get hired at OneLegacy, you'll have to work a lot. These are demanding jobs, encountering families at the worst moments of their lives, and coping with witnessing death every day. Don't apply if you aren't ready to work hard for the most important reason I could think of - preventing the premature death and avoidable suffering of other human beings (though most of whom, you'll never know)"}], [{"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Avoid like the coronavirus", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "22 Apr 2021", "job_title": "Anonymous Employee in Los Angeles, CA", "duration": "N/A", "pros": "Decent pay and benefits, 401k and retirement plans available", "cons": "No work life balance, management does NOT care about you, treated like a robot, inflexible work environment given the insane amount of hours you have to put in, pay is not worth the amount of hours you have to do. Forget about any social/family life. It’s all about work when you’re with OneLegacy. Almost no chance for career advancement"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Not great", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "30 Aug 2021", "job_title": "Surgical Recovery Technician in Redlands, CA", "duration": "N/A", "pros": "It’s a good hands on experience", "cons": "The pay sucks, management sucks"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "A great place to grown and learn", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "8 Mar 2021", "job_title": "Employee in Los Angeles, CA", "duration": "N/A", "pros": "Excellent benefits and compensation\r\nOrganization and staff uphold the mission of saving and healing lives through donation", "cons": "Communication could be disseminated a bit faster down to front line staff"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "Great organization. Great mission", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "8 Mar 2021", "job_title": "Anonymous Employee in Los Angeles, CA", "duration": "N/A", "pros": "Benefits are great. Staff is motivated to do good and help with the mission of saving lives. Very rewarding.", "cons": "Changes happen very quickly.  May be hard for some,"}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": 3, "Career Opportunities": 1, "Compensation and Benefits": 5, "Senior Management": 1, "review_title": "STAY AWAY!", "rating": "1.0", "reviewer_affiliation": "Current Employee", "job_date": "19 May 2021", "job_title": "Donation Development Coordinator in Los Angeles, CA", "duration": "N/A", "pros": "The Mission of Saving Lives", "cons": "The leadership team for the DDC department micromanages their employees and act too aggressive in attempts to develop hospital partnerships."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Mission oriented", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "29 Oct 2020", "job_title": "DAC in Los Angeles, CA", "duration": "N/A", "pros": "Believe in the mission and people are amazing.", "cons": "Hate the hours that we worked."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Very disappointing", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "21 Nov 2017", "job_title": "Surgical Recovery Technician in Los Angeles, CA", "duration": "N/A", "pros": "You can provide a small role in donation and helping donor familes and recipients facilitate their wishes and needs.", "cons": "Low salaries, no real benefits, high requirement of shift availability, almost non-existent training, lack of communication, zero constructive feedback and no support for the mission of surgical staff. This causes staff to work unsafely, for little pay, often leading to cutting corners on federally regulated guidelines for procurement, driving long distances without adequate sleep, having little to no support/understanding from line supervisors, trainers or management. Within the past 6 months or so, around 40% of the surgical staff has left the company in search of better opportunities. Morale is extremely low and getting worse all the time. This problem is ignored by management, demonstrated by the constant stream of new hires, blindly thrown to the wolves until they burn out and quit just  months later, to be replaced by the next victim."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "You can do better!", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "10 Jun 2020", "job_title": "Donor Allocation Coordinator in Los Angeles, CA", "duration": "N/A", "pros": "OneLegacy has a good mission which might initially attract altruistic individuals looking for a decent paying job.", "cons": "1. overwork employees in DAC department for barely enough pay (considering the amount of time you have to devote to this company).\r\n2. doesn't seem to be any opportunity for career advancement (unless you fall into a certain category........... if you know what I mean......)\r\n3. toxic work environment - employees are not treated like human beings. you are always expendable, no matter how hard you work! ruthless management!\r\n\r\nI worked at OneLegacy for a short period of time and for a few reasons, it did not work out. At first, I felt terrible about the outcome with OneLegacy but I have a another job now that I absolutely LOVE. I love my coworkers, great work-life balance, and the most financial freedom I've ever had! OneLegacy wouldn't have ever provided any of that for me! I wish I knew that I could do that much better before wasting any time with OneLegacy. Do not be fooled by their mission! In my opinion, its not ACTUALLY their mission...... trust me, there are many companies that can provide you a much better package than OneLegacy can dream of! Don't make my mistake. :)"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "The Most Rewarding Career Experience!!", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "16 Feb 2016", "job_title": "Anonymous Employee in Los Angeles, CA", "duration": "N/A", "pros": "Firstly, I would like to start off by stating that I cannot emphasize enough how incredibly fulfilling it is, on both a professional and personal level, to be a member of an organization that takes such immense pride in healing and saving lives, as well as reminding one another about the invaluable need to live life to the absolute fullest! It is quite refreshing to participate in this life-saving mission and to be a part of a team that is beyond warm, receptive, well-informed, empathetic and most importantly, passionate. Although I had never had any formal experience with the principles of organ, eye and tissue donation prior to joining this organization, it has been an incredibly educational journey thus far and I look forward to continuing to learn about the scientific processes and corporate procedures that guide successful donation and transplantation.", "cons": "Truthfully, I have not witnessed a single disadvantage of working for this organization whatsoever."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great place to work with an incredible mission", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "12 Aug 2015", "job_title": "Anonymous Employee in Los Angeles, CA", "duration": "N/A", "pros": "You are able to go to work everyday, regardless of what position you hold with the company, and know that you are making a difference and contributing to a live-saving mission. Oftentimes you are able to see, firsthand, the impact you are making in the lives of many others, whether donor families, transplant recipients, or those waiting for a life-saving organ. If you work hard, there is great opportunity for upward mobility. They compensate employees well with salary and benefits packages, including a great 403b retirement fund.", "cons": "You deal with death and dying every day, and it can take its toll if you don't have a way to decompress. It can be difficult at times to strike a good work/life balance, but it is up to the individual to set boundaries and ensure they are not over-committing."}], [{"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Good", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Worst company ever worked for", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "5 Nov 2019", "job_title": "Surgical Recovery Coordinator in Los Angeles, CA", "duration": "N/A", "pros": "Worked alongside some really great people.", "cons": "Worst leadership I’ve ever worked for. They do not invest in their employees, they are actually known for building cases against people to fire them ( just check public record). They find loopholes to withhold double time pay as well as figure out how you can do more for less. They pay under the industry average even though the cost of living in the area is one of the highest in the nation. They are the only organ procurement organization of its size that does not offer tuition reimbursement and their “scholarship” program is a joke. The politics in the company are very dirty but they call it being “corporate.” They commit Medicare fraud and use some of the most unethical tactics to increase their yield such as throwing loved ones out of the OR and lying to potential donor families when they see that a deceased has withdrawn their donation status by omitting that information. Horrible people work in management here and anyone with a soul should just go to San Diego OPO instead!"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Expect great things at this company but ultimately was disappointed.", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "29 Oct 2014", "job_title": "Communications in Los Angeles, CA", "duration": "N/A", "pros": "Modern building creating pleasant work environment. Connected parking garage with paid parking which was great for downtown Los Angeles. Friendly co-workers and interesting work with a lot of team projects. Adequate salary but not great. Benefits started after 3-4 months depending on your start date but you weren't considered permanent until 6 months. Good benefits package including medical, dental, life insurance, 401K and long term disability. Paid holidays and vacation time.", "cons": "For a non-profit organization, this company was too concerned about the bottom line. The pursuit of money drove upper management instead of their facade of altruistic organ donation. This became apparent after working there only a few months. It spoiled the whole of the contribution you thought you were making to help others."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "A Horrible Company with a Good Mission", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "23 Apr 2020", "job_title": "Anonymous Employee in Los Angeles, CA", "duration": "N/A", "pros": "Organ donation helps recipients and families.", "cons": "Management is cruel. Employees are seen as resources to be used and discarded. Concerns are ignored. Long hours. Expectation to always be available. This is seriously the worst company I've ever worked for. They see employees as machines. They work them until they break, and then they throw them away. As an example, during the COVID-19 pandemic they are forcing ALL employees to continue reporting to the office, because management doesn't believe in remote work, and they are shielding behind being an \"essential company.\" Even essential companies perform functions that can be done remotely in the name of public health, OneLegacy just doesn't care about it's employees or their health. Really, do yourself a favor and stay away from this company. It will be so bad for your psyche, and it's like an abusive relationship. You don't realize how bad it was until someone comes along and treats you right."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great company with great mission", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "5 May 2016", "job_title": "Software Development Manager in Los Angeles, CA", "duration": "N/A", "pros": "Company has great mission to save more and more lives, your co-workers around are awesome, you have a single mission to accomplish! The COO has great vision, very clear on the direction of the business, and he has kept himself highly transparent and available to all staff, he is also a friendly and funny guy to chat with. The company invests HEAVILY on employee, they are very cared about employee and focus a lot on staff development, a lot of training are provided and encouraged for career development. IT Team is great to work with, small team but tremendous deliverable over the time, I was really amazed on all the latest technology on board!", "cons": "Every company has cons, but I do not see anything worth to mention at all compare to the pros."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Good", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Every organ, every time", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "15 Oct 2019", "job_title": "Procurement Transplant Coordinator in Los Angeles, CA", "duration": "N/A", "pros": "The overall mission of helping to facilitate organ donation is a pro, but not at OneLegacy. Organ/tissue recipients are saved.", "cons": "Lying to families to get more numbers, threats of termination, retaliation from managers, constant harassment. Lawyers have been specifically called in to lie to employees in order to scare them into forcing families to donate. Treating all registered donors and their families as strictly numbers - sending people who are still on orientation to speak to these families Bc they don’t get a choice so it doesn’t matter how they are spoken to. Unfair compensation practices and violation of labor laws are common. Managers have voiced that they prefer to not hire gay people or anyone of middle eastern origin because it “makes people uncomfortable” and these managers are still employed while the ones who complained have been let go. The culture is ridiculously awful."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Terrible management", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "27 May 2016", "job_title": "Family Care Coordinator in Los Angeles, CA", "duration": "N/A", "pros": "Good pay. They start you off at a reasonable living so you can't complain. They run  a 24 hour operation so you can find various shifts to suit your needs.", "cons": "Line workers get 20cent raises while higher management racks is 350k per year so moral tends to be low. Managers of various departments are married to eachother so getting up the ladder can be hard... Unless you marry into it apparently."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "\" Let the Buyer Beware \"", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "26 Jun 2014", "job_title": "Procurement Coordinator in Los Angeles, CA", "duration": "N/A", "pros": "Inspirational mission statement and wonderful community service saving lives. Most co-workers were drawn to work there for these reasons. Many employees are truly committed to helping others get a second chance despite internal factors. A great learning experience with opportunities for advancement....some place else. Benefits and salary are decent and seem competitive.", "cons": "Oppressive senior management with no respect for subordinates. More focused on their enormous salaries. Culture is extremely political and favoritism determines advancement. Middle managers have no prior experience or even taken a management course. Rewards are based on who you know- not what you know. This could be a great rewarding place to work, but culture is compromised by senior management questionable agendas and style."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 4, "Senior Management": 0, "review_title": "Manager", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "31 Oct 2017", "job_title": "Anonymous Employee in Los Angeles, CA", "duration": "N/A", "pros": "Good benefits, good cause, some really good dedicated employees (who take a lot of grief)", "cons": "Tough office culture, a lot of finger pointing, avoiding responsibility, and lacking listening skills.  Dead end for most positions and behind the times from a technical and work-life perspective.   HR, Operations, and IT organizations are a mess. If you aren't liked, you will be talked about all day long.   There are so many great places to work, keep looking!"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Recent Restructure", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "9 Feb 2015", "job_title": "Executive Assistant in Los Angeles, CA", "duration": "N/A", "pros": "This non-profit organization is considered the second largest organ procurement organization in the US, helping to save and heal lives through organ, tissue and eye donation. The compensation is competitive for similar healthcare positions.", "cons": "The work-life balance is a concern and employees are expected to give 150%.\r\n\r\nCorporate restructuring in mid-2014 generated a a layoff and a lot of long-term staff leaving. It has created many open positions, some of which are being rehired now. All staff report to the COO/CIO now, who is very clinical, so not all programs and projects are still happening or in the same way, some of this is also due to re-branding."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "Invaluable Experience", "rating": "2.0", "reviewer_affiliation": "Former Employee", "job_date": "5 Feb 2016", "job_title": "Anonymous Employee in Los Angeles, CA", "duration": "N/A", "pros": "This organization offers amazing exposure into a very niche industry. I was given the opportunity to learn a lot about the different aspects that go into donation -- the family approach process, the actual procurement of tissue, medical review and lastly the support provided to families post donation. It's definitely an invaluable experience and there is much to learn.\r\n\r\n\r\nAnother pro are people who work there. In any organization, some people are terrible/incompetent & some are amazing and way too qualified for what they're doing. I still have great relationships with colleagues I've met there, and I've seen so many develop and leave for better things. Plus, happy hours are always fun!\r\n\r\n\r\nAnd lastly, the stories we can tell! It's always funny (and maybe a little depressing) to tell family/friends about the crazy things that happen at OneLegacy. No I don't mean confidential donor stories, but the crazy things management will do and say to their employees. It's unbelievable sometimes! I think it's healthy to vent, laugh about how insane management is and appreciate that we will never have to live the type of life they have that caused them to treat others poorly (unless you stay of course... then sorry).", "cons": "Due to the nature of this industry, things are very fast-paced, which isn't necessarily a con because it does improve work ethic and really shows who is capable of adapting to such demands. However, this is added as a con mainly because of how OneLegacy deals with this fast-paced environment. They are vastly understaffed (this is also due to high turnover) and don't particularly reward or acknowledge staff who are high performers. \r\n\r\n\r\nWork life balance would be another con. I think it's a great organization for new graduates who want to make a decent paycheck (overtime is always nice too). However, the company does not encourage having a life outside of work, so it's really up to you to decide which is more important. Excessive work also leads to burning out staff, which isn't an issue for OneLegacy if their goal is to utilize staff at their high point. Great method for organizations that want high performers for a short period of time, with zero focus on development. I could see this being beneficial for certain roles at OneLegacy. \r\n\r\n\r\nTraining is an issue, but they have been moving towards a direction that focuses on this more. As I stated in my pro, it's an invaluable experience, but this \"experience\" wasn't given to me. Learning is something you have to do on your own. If you are genuinely interested in the industry, you have to take initiative to request to learn about other departments (I've heard of managers denying this, but I was lucky I guess). Also, a lot of what I learned was from Google searches. And oh Wiki is your friend.\r\n\r\n\r\nManagement is probably the biggest con. Many are not qualified for their positions and were merely promoted because of favoritism. Great for the person promoted, but terrible for his/her direct reports. A majority of management is also unprofessional -- it's definitely unheard of of how much they could get away with without HR stepping in. It makes sense that they deal with so many legal battles. It's definitely a very hostile work environment, but a pro to this is learning what you want in a workplace and learning how to be a better person/manager yourself by doing the exact opposite of what they do.\r\n\r\n\r\nIn the end, I thought it was a good experience but it really depends on your priorities. I was willing to give up my life for these demands (mainly to boost my resume) and to earn a boat load of overtime cash. It's definitely not a place you want to stay at long term though -- really not healthy for your soul. I think we all die a little inside while working here, but think about how great it feels when you actually leave!"}], [{"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Current Employee", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "3 Mar 2017", "job_title": "Anonymous Employee in Los Angeles, CA", "duration": "N/A", "pros": "AMAZING Mission! I absolutely love the work and what the organization stands for. This is a growing and dynamic not-for-profit that literally saves and improves lives every day. If you want to be part of something that is much bigger than anything else you have ever done in medicine, this is the place for you. Benefits are very good and include medical, dental, vision, HSA, short and long term disability, 403B retirement and a very good employee assistance program.", "cons": "This is hard work as you are dealing with death and dying every day and it can take its toll. But, if you keep on task with the mission and can find the balance between work and the need to have a life, it is a great job! Newly hired PTO accrual is slow and I wish a little bit more...but it is fair in comparison to my other hospital jobs. Employee development through tuition reimbursement would be a plus for the company. Clinical employees have a sense of entitlement that negatively affect other staff that they come in contact with. If you think the company is such a bad place...go somewhere else and find out if the grass is truly greener or stop and realize that this is a company that really cares about you, your community and literally people all over the country."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 0, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Rewarding career", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "25 Oct 2016", "job_title": "Anonymous Employee in Los Angeles, CA", "duration": "N/A", "pros": "There are so many positives to working for a great company with a great mission,  The culture is changing and staff are given resources to meet their potential.  You get to do things that you would never be able to in a hospital environment and continually learn.", "cons": "You need to sacrifice some time when things get very busy and help out the team.  It can take a toll when donation is unpredictable."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Dissatisfied Former SRT", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "10 Jul 2015", "job_title": "SRT in Los Angeles, CA", "duration": "N/A", "pros": "Supervisors of LA office were great- pushed you to learn and excel.  Work was rewarding at first.  Coworkers were generally supportive and comfortable to be around.", "cons": "Management does not value employee safety or health at all.  Corporate was constantly penny pinching and slashing wages while increasing their own salaries (nonprofits have to disclose this information publicly).  Very results driven and forced some cases that were obviously unsafe and the tissue unusable for transplant.  Management sells the idea of providing a necessary service to the world, but only cares about profits."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 0, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "Highly political environment; work for who you know not what you know.", "rating": "2.0", "reviewer_affiliation": "Current Employee", "job_date": "2 Nov 2011", "job_title": "Systems Administrator in Los Angeles, CA", "duration": "N/A", "pros": "Non profit company has good benefit and nice working environment.  The environment is less formal and more relax than most.", "cons": "lack of organization among senior management structure; lagged behind in technology implementation and lack of experience staff dealing technology management."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "An Honorable Mission ...Gone Terribly Wrong", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "24 Nov 2017", "job_title": "Procurement Transplant Coordinator in Los Angeles, CA", "duration": "N/A", "pros": "Unfortunately, in my opinion nothing is left to be viewed in a positive light. Many of us hope that another entity will soon buy-out and rebuild this OPO back to it's original core values.", "cons": "Briefly summarized:\r\n1) UNSAFE PRACTICES (extreme inadequate training: unsupervised new-hires deprived of preceptors due to continuous staffing shortages, non-skilled/non-clinical personnel delegated duties far outside of their JD, inconsistent and VERY questionable clinical operations occur regularly without corrective education due to absent supervisors. Complete lack of adequate rest and meal breaks, as well as safe downtime between shifts: many front-line staff with sleep in hospital parking structures after their shift due to fear of driving incapacitated from complete exhaustion).\r\n2) UNETHICAL PRACTICES (Disgraceful disservice to donor families, hard-working hospital staff, and transplant centers: OneLegacy staff are often strictly instructed from upper management to deceive, manipulate, and engage in egoistic-focused intent with a bully mentality to achieve complete control of all situations at any cost. Questioning authority in these unfortunate circumstances will place a target on your back within the organization and you will be labeled \"difficult\". This is a fear-based run organization and many well intentioned, innocent front-line staff will follow suit to avoid well known retaliation and harassment efforts from the hands of executive leadership). \r\n3) INCOMPETENT LEADERSHIP: (Executive operations are single-mindedly  focused only on donor numbers, revenue, image, expansion, and absolute control. There is such a complete disconnect and disregard for staff's well being and safety that it is nearly unfathomable for those who are left still trying desperately to serve the true mission. The organization's leadership is the definition of Corrupt Corporate America, with never ending corporate scandals that are consistently swept under the rug).\r\n4) COMPENSATION (Below average wages and PTO accruals. Clinical personnel are poorly salaried and classified overtime \"exempt\", with an expectation of enduring 16 hours on-call before any overtime wages will be considered. Several mandatory meetings are held on your off-days, unpaid. You are expected to answer your work phone within two hours on your off-days. Extreme staffing shortages results in constant guilt-shaming strategies to recruit staff to work extra shifts- if you prefer not to work extra shifts, you will be shamed during your annual evaluation and demoted points, which will subsequently affect your potential for a pay raise)."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "Empty Promises", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "20 Jun 2014", "job_title": "Anonymous Employee in Los Angeles, CA", "duration": "N/A", "pros": "Some of the best workers are here. Very many passionate people who love their job and want to help others. The job isn't tough, but the negative environment takes a toll on you. The starting pay is good, along with the benefits.", "cons": "Management tells you what you want to hear, but never follow through. Very impossible to move up or into another department. There is absolutely no communication between management."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "No Work Life Balance", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "19 Mar 2017", "job_title": "Recovery Tech in Los Angeles, CA", "duration": "N/A", "pros": "You will become very close with your coworkers, mainly because you spend so much time with them. Great stepping stone for Med/PA/Nursing School if you're working in the field. Decent pay.", "cons": "For field employees, work-life balance is nonexistent. Management holds grudges plays favorites, shady use of loopholes to get out of paying on call employees call pay or overtime, field employees are expendable, extreme lack of communication and understanding between departments."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "The Job is a Life Style", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "10 Jul 2020", "job_title": "Surgical Recovery Technician in Los Angeles, CA", "duration": "N/A", "pros": "The company hires from within. There are many opportunities to climb the corporate ladder if that what you want to do. Many of the upper level managers stated as techs themselves. \r\nGreat coworkers who are fun and hard working.\r\nGood sense of community between departments.\r\nLong hours, but lots of opportunities for overtime pay.", "cons": "Over the years the company has significantly reduced the amount it pays its lower level employees."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "People don't leave jobs, they leave bosses", "rating": "1.0", "reviewer_affiliation": "Current Employee", "job_date": "18 Oct 2015", "job_title": "Anonymous Employee in Los Angeles, CA", "duration": "N/A", "pros": "The mission and all lower level staff are amazing.", "cons": "OneLegacy is slowly but surely being driven into the ground. The way management operates is not sustainable. Management leads by bullying and emotionally beats you into submission. This isn't just \"some\" management or \"some\" departments. This behavior is happening company wide. Not all Supervisors at OneLegacy are terrible, but unfortunately they have zero control. All decisions are made by managers, directors, and VPs who all do whatever the COO tells them to. This company is ran by one person and one person only...the COO. The board of directors won't help us because they are too busy being wined and dined and taking lavish retreats. Think this is a joke? It's very sadly not. Turn over rate is high...extremely high...and it happens quick. People don't stay around long because they learn very quickly that they have no value. The COO finds every excuse in the book for the reason turn over is so high. The only explanation he doesn't offer, however, is himself. He's the problem. And all upper management that he hand picked are the problem. People are miserable and management only cares about their fat paycheck. Management won't work with anyone's schedule and constantly force you to use unexpected time off and THEN you get in trouble for using it. For a company that acts like they care so much about \"saving lives,\" they certainly don't care about the lives of their staff."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "It will take every last ounce of life out of you", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "14 Dec 2016", "job_title": "Technician in Los Angeles, CA", "duration": "N/A", "pros": "Coworkers become family because you never see yours. If you are field staff, you get to be on the road which is better than being stuck in a cubical. Also, the best anatomy lesson of your life when in the surgical environment.", "cons": "Where do we start. You are viewed as absolutely disposal/replaceable. If you're a veteran employee they'd happily see you leave so they can pay a new college grad a fraction of your wage. If you cause an \"event\" (a breach in policy), you may or may not get disciplined/fired; it depends if they like you. There are zero growth opportunities. You have to wait for someone to quit or get fired in order to \"move up\". They tried to offset this by creating new positions but in reality you just become salary and get run even further into the ground. The COO uses intimidation as a suppression tactic and his executives have brought staff to tears. Also, labor laws? Out the window. I cannot tell you how many times I worked 16-20 hr days on cases, slept 3-4 hours and then the phone goes off with your Supervisor saying \"Hey, I need you for a case\" (a case is a donor btw). Abuse is an understatement. Their compensation for this? A free meal which you pay upfront for and might get reimbursed two months later. Oh, and no on-call pay, they took that away years ago. If you're on the schedule, you only make money if there is a case. No case day=$0.00 dollars earned."}], [{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Excellent company Mission statement", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "25 Jan 2017", "job_title": "Quality in Los Angeles, CA", "duration": "N/A", "pros": "OneLegacy is part of the Donate Life Network a worthy cause.", "cons": "As a non-profit the hourly wages are low. The amount of work is overwhelming at times. With only a half hour lunch available and being in downtown L.A. it is difficult to eat lunch and de-stress, or take care of personal business"}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Terrible money-hungry organization", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "26 Sept 2015", "job_title": "Anonymous Employee in Los Angeles, CA", "duration": "N/A", "pros": "The benefits are decent. The parking is included. Great for someone with no family obligations. The mission of the organization is definitely a positive experience.", "cons": "They work you to the ground without regard for your personal life. The management does not know how to manage their employees. The main software program they use is DigitalDonor which they paid 2.5 million for and is a terrible excuse of an enterprise database. The user interface is glitchy and not user friendly. The pay is decent for starting out at around $20/hr. But there is no upward mobility. There is no career ladder. The COO, Prasad Garimella, also the CIO which means anything that has to do with the operations or IT goes through him. There is no checks and balances at this company. He is the major problem with this organization. In fact, all of upper management needs to be replaced. This company is money hungry. They make most of their money off of tissue donation. They also started another organization to funnel money into keep it within Onelegacy.  The management do not keep their employees up to date on anything. Many employees know how to manage better than the current managers at Onelegacy.  It is interesting how many employees just get forced to resign and no one knows about it, hence the CFO a couple months ago."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Awesome Place to work!!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "2 Mar 2016", "job_title": "Helpdesk Technician in Los Angeles, CA", "duration": "N/A", "pros": "Very technologically advanced company that uses the latest and greatest devices. Everyone is just super nice and helpful. This company is very organized and always on the ball.", "cons": "well, since we are growing we need more people, and they are actively working on it."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "OneLegacy Rocks", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "2 Nov 2016", "job_title": "Anonymous Employee in Los Angeles, CA", "duration": "N/A", "pros": "Awesome mission of helping save lives and comforting families. The company has grown significantly and created more opportunities for the staff.", "cons": "Emotionally challenging work, can burn out some people, but worth it. Some colleagues don't recognize what a great place it is to work"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Awful and unethical HR standards", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "30 Sept 2015", "job_title": "Specialist in Los Angeles, CA", "duration": "N/A", "pros": "Great mission that saves and enhances lives.", "cons": "Very unethical HR standards.  Will quickly ask you to do twice the amount of work and pay you nothing (financial or otherwise) in return.  Rigid management that is quick to let go of staff, misuse them and abuse them without consideration for their health or well being.  Specifically, I was given one job upon hire then given a multiple page document a week later as \"true job description\""}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 5, "Senior Management": 0, "review_title": "Family Care Coordinator", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "15 Jun 2017", "job_title": "Family Care Coordinator in Los Angeles, CA", "duration": "N/A", "pros": "Parking is paid for (which is rare for companies in DTLA) and they offer a great benefits package.", "cons": "There is no opportunity for growth at this company (no employment ladder)."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Call center", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "20 Oct 2015", "job_title": " in Los Angeles, CA", "duration": "N/A", "pros": "The mission is amazing. If you want to help someone and remember why you are there the experience will be rewarding and becomes more than a job.", "cons": "Schedule is tough and the drive to downtown LA is tougher."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Organ Donation Coordinator", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "17 Dec 2018", "job_title": "Organ Donation Coordinator in Los Angeles, CA", "duration": "N/A", "pros": "SCAM. Not an employ. Red flag when they couldn't give me an accurate job description during an interview.", "cons": "SCAM. This posting stays on the internet over and over again. Wasting applicants time. I have gone to the final stages of hire and this position is still posted months later. Finance dept. SCAM. Company real, but this ploy is a trick of the trade for the finance dept."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Very unique job", "rating": "3.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "13 Mar 2019", "job_title": "Family Care Coordinator in Los Angeles, CA", "duration": "N/A", "pros": "If you are seeking a career in healthcare, you won't get this kind of experience/exposure anywhere. You get to see how a hospital functions from different angles.", "cons": "Each shift is 12 hours and can be very draining both physically and mentally."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Non profit, positive  help , make a diference", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "23 Apr 2013", "job_title": "Coordinator in Los Angeles, CA", "duration": "N/A", "pros": "Take entry level , feel good type of job, make a diference in peoples lives", "cons": "Down Town Traffic industry competition not close"}], [{"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": "N/A", "review_title": "Management's elitist mentality", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "21 Mar 2016", "job_title": " in Los Angeles, CA", "duration": "N/A", "pros": "Company has a great mission to assist those in need of organ transplants.", "cons": "IT managers feel they are elite and in a group of their own"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great company", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "20 Apr 2019", "job_title": "Controller in Los Angeles, CA", "duration": "N/A", "pros": "Great place to work and contribute to their mission of saving lives", "cons": "There are no negative comments"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Treat employees like dirt", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "12 Mar 2018", "job_title": "Coordinator in Los Angeles, CA", "duration": "N/A", "pros": "None. If I could give zero stars I would.  The company continues to get sued due to the horrible treatment, favoritism, and discrimination of their employees", "cons": "Long hours, the worst pay per industry standards, no dialogue when it comes to improving practices"}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 0, "review_title": "Ok place to work", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "31 May 2017", "job_title": "Anonymous Employee in Los Angeles, CA", "duration": "N/A", "pros": "The organization has a honorable missions and visions. They have a very good benefits and compensation.", "cons": "Politics that we can't handle"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Hard Work", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "20 Dec 2019", "job_title": "PTCB Pharmacy Technician in Los Angeles, CA", "duration": "N/A", "pros": "Helping to save lives every day", "cons": "Long work hours with no life balance"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "I Love My Job!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "22 Oct 2017", "job_title": "Coordinator in Los Angeles, CA", "duration": "N/A", "pros": "Compensation and benefits are generous.", "cons": "Workload is busy. Allot of driving."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Good Company", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "26 Dec 2019", "job_title": "Family Care Coordinator in Los Angeles, CA", "duration": "N/A", "pros": "Good pay,  great coworkers.", "cons": "Wish there was a better career ladder."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Management in the accounting department is horrible", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "16 Feb 2017", "job_title": "Accounting in Los Angeles, CA", "duration": "N/A", "pros": "I can not think of one thing", "cons": "AP Management is clueless, no training but expect you to do your work as well as others. the department is unorganized and unprofessional"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Not a place I can recommend", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "27 Feb 2019", "job_title": "Surgical Technician in Los Angeles, CA", "duration": "N/A", "pros": "Coworkers that work as hard as you do to try to get by from the toxic environment", "cons": "The hours, schedule, no work-life balance, low morale, but especially the awful management"}]][[{"Recommended": "Yes", "CEO Approval": "No", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Good experience", "rating": "5.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "30 Jan 2023", "job_title": "Family Care Specialist in Los Angeles, CA", "duration": "N/A", "pros": "Great experience Learn Innovative Great training Helpful", "cons": "Driving Pay Higher ups Management Nothing"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Good", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 3, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 0, "review_title": "Decline in quality of the organization over the years", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 8 years", "job_date": "11 Feb 2023", "job_title": "Procurement Transplant Coordinator in Los Angeles, CA", "duration": "N/A", "pros": "The company is very well organized and structured.", "cons": "Low pay, a lot of mileage on car, no growth."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": 4, "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Insight", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "4 Dec 2022", "job_title": "Donor Allocation Coordinator in Azusa, CA", "duration": "N/A", "pros": "There are plenty of overtime opportunities", "cons": "Company is really short staffed and stretched too thin."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": 4, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Good Start", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "28 Oct 2022", "job_title": "Surgical Recovery Technician in Redlands, CA", "duration": "N/A", "pros": "Solid Hours, Good pay plus increase with change of positions.", "cons": "Long hours, sometimes unrealistic expectations with outcomes of each case from management"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": 4, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": ".", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "5 Jul 2022", "job_title": "Family Care Coordinator in Los Angeles, CA", "duration": "N/A", "pros": "if you are a good worker there is lots of opportunity for growth and good benefits", "cons": "fast pace, schedule can get hectic depending on your position"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great place to work", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "30 Jun 2022", "job_title": "Talent Acquisition Manager in Los Angeles, CA", "duration": "N/A", "pros": "Great benefits\nManagement considers employee feedback\nCompany's mission and vision in helping save lives\nDiverse group of individuals encompass the organization", "cons": "Work can often plentiful and challenging"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Run  now your life and health depend on it!", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "24 Jun 2021", "job_title": "Coordinator in Los Angeles, CA", "duration": "N/A", "pros": "If you're lucky you will get a location where you never have to come to the corporate office and deal with the awful people OneLegacy has to call management.", "cons": "Degrading & unappreciative management that you have to answer to daily and some with absolutely no clinical experience even though in Clinical Dept!! The pay was lowered substantially after I left and everyone was told it's for their own good! There is \"NO\" Organ Department field staff member who will give this company a 5 STAR  review if they have worked here for longer than a year.\r\n\r\nAll the 5 star reviews are from the COO's shoe lickers trying to acquire more resumes since the turnover rate there is ridiculous. \r\n\r\nThe number of labor lawsuits against them is so deserving it's hilarious.\r\n\r\n\r\nCompany motto \"Every ORGAN Every TIME!\" Disgusting abuse of power to employees and the public.\r\n\r\nIf you're a shoe licker w/ no ethics you can climb this ladder to the top...Good Luck = )"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 0, "Diversity and Inclusion": 3, "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "Too much stress", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "12 Dec 2020", "job_title": "Referral Consult Coordinator in Los Angeles, CA", "duration": "N/A", "pros": "The mission is amazing the company actively helps those in need of organs .", "cons": "Too much emphasis on numbers and how they look in comparison to other OPOs . Work life balance is really difficult with this job due to the fact you literally don't know where your going to end up at the end of your shift it could be 5 minutes from your house or 3 hours away. If you don't like to drive do not apply. Sometimes expected to do more responsibilities than previously discussed upon hiring . HR is somewhat of a joke  complaints aren't taken seriously and if people in positions of power do not like you then just be careful because you can be fired at anytime . You have to be extremely flexible and work well under stress and constantly be in new surroundings every shift . Employee safety isn't taken seriously even with COVID 19 restrictions, This job is exhausting and not for the faint of heart your dealing with death and trauma everyday."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 0, "Culture & Values": 0, "Diversity and Inclusion": 0, "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Could do much better", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "1 Nov 2021", "job_title": "Surgical Recovery Technician in Los Angeles, CA", "duration": "N/A", "pros": "The mission of saving lives is a big drive for most of the people working there. \r\nThe benefits are good.", "cons": "The pay for the amount of work being done is nothing. \r\nWork life balance does not exist in this company. \r\nRetention rates are very low based on how employees are treated, culture, and the pay.\r\nEmployees feel, and are often treated as disposable.\r\nQuantity over quality.\r\nInconsistent training."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": 4, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "Life-Savers", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "12 Jul 2021", "job_title": "Coordinator in Los Angeles, CA", "duration": "N/A", "pros": "Bottom line: the work of organ donation is giving children more time with their parents, spouses more years of marriage, enabling families to have children, ultimately extending life by decades. I have met grandparents who only know their grandchildren because of what we do - they received a heart or a lung or a liver transplant 5, 10, or 20 years ago. They have family members who've since been born that never would've known them.\n\nThis is a gift for donor family members too. Donor families are experiencing the worst moments of their lives. They may find the donation process difficult, or resist it altogether in cases when their loved one was on the registry and gave first person authorization. But often they are responding to the terrible, sudden death of someone they love as much as life itself. It's OneLegacy's job to be kind, compassionate, and persistent about donation, because families don't get a do-over once they say no to donation, and neither do the would-be recipients. \n\nYou may read negative reviews about emphasis on \"numbers.\" Those numbers save lives. 1 more organ donor can mean 15 more years of life for 5 different people. No one on the front lines, or in operations has an easy job. But the reason these jobs are so hard is because every organ donor is a life-saver. I think employees can lose sight of that because they don't meet enough recipients. I've had the privilege of meeting many and so I'm proud to work for an OPO that pursues every organ, every time.\n\nThey value employees. They put their money where their mouth is, making sure employees are fairly compensated, and taken care of with competitive benefits.", "cons": "There is room for improvement with organizational culture. Dedicated employees have often felt voiceless. I can see where efforts are being made, but there's still a lot of room to grow.\n\nCommunity partnerships at the grassroots level, with churches, organizations, and schools, could go a long way. I know there is an open position for that purpose now, so efforts and growth are happening there too.\n\nIf you get hired at OneLegacy, you'll have to work a lot. These are demanding jobs, encountering families at the worst moments of their lives, and coping with witnessing death every day. Don't apply if you aren't ready to work hard for the most important reason I could think of - preventing the premature death and avoidable suffering of other human beings (though most of whom, you'll never know)"}], [{"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Avoid like the coronavirus", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "22 Apr 2021", "job_title": "Anonymous Employee in Los Angeles, CA", "duration": "N/A", "pros": "Decent pay and benefits, 401k and retirement plans available", "cons": "No work life balance, management does NOT care about you, treated like a robot, inflexible work environment given the insane amount of hours you have to put in, pay is not worth the amount of hours you have to do. Forget about any social/family life. It’s all about work when you’re with OneLegacy. Almost no chance for career advancement"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Not great", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "30 Aug 2021", "job_title": "Surgical Recovery Technician in Redlands, CA", "duration": "N/A", "pros": "It’s a good hands on experience", "cons": "The pay sucks, management sucks"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "A great place to grown and learn", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "8 Mar 2021", "job_title": "Employee in Los Angeles, CA", "duration": "N/A", "pros": "Excellent benefits and compensation\r\nOrganization and staff uphold the mission of saving and healing lives through donation", "cons": "Communication could be disseminated a bit faster down to front line staff"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "Great organization. Great mission", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "8 Mar 2021", "job_title": "Anonymous Employee in Los Angeles, CA", "duration": "N/A", "pros": "Benefits are great. Staff is motivated to do good and help with the mission of saving lives. Very rewarding.", "cons": "Changes happen very quickly.  May be hard for some,"}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": 3, "Career Opportunities": 1, "Compensation and Benefits": 5, "Senior Management": 1, "review_title": "STAY AWAY!", "rating": "1.0", "reviewer_affiliation": "Current Employee", "job_date": "19 May 2021", "job_title": "Donation Development Coordinator in Los Angeles, CA", "duration": "N/A", "pros": "The Mission of Saving Lives", "cons": "The leadership team for the DDC department micromanages their employees and act too aggressive in attempts to develop hospital partnerships."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Mission oriented", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "29 Oct 2020", "job_title": "DAC in Los Angeles, CA", "duration": "N/A", "pros": "Believe in the mission and people are amazing.", "cons": "Hate the hours that we worked."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Very disappointing", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "21 Nov 2017", "job_title": "Surgical Recovery Technician in Los Angeles, CA", "duration": "N/A", "pros": "You can provide a small role in donation and helping donor familes and recipients facilitate their wishes and needs.", "cons": "Low salaries, no real benefits, high requirement of shift availability, almost non-existent training, lack of communication, zero constructive feedback and no support for the mission of surgical staff. This causes staff to work unsafely, for little pay, often leading to cutting corners on federally regulated guidelines for procurement, driving long distances without adequate sleep, having little to no support/understanding from line supervisors, trainers or management. Within the past 6 months or so, around 40% of the surgical staff has left the company in search of better opportunities. Morale is extremely low and getting worse all the time. This problem is ignored by management, demonstrated by the constant stream of new hires, blindly thrown to the wolves until they burn out and quit just  months later, to be replaced by the next victim."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "You can do better!", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "10 Jun 2020", "job_title": "Donor Allocation Coordinator in Los Angeles, CA", "duration": "N/A", "pros": "OneLegacy has a good mission which might initially attract altruistic individuals looking for a decent paying job.", "cons": "1. overwork employees in DAC department for barely enough pay (considering the amount of time you have to devote to this company).\r\n2. doesn't seem to be any opportunity for career advancement (unless you fall into a certain category........... if you know what I mean......)\r\n3. toxic work environment - employees are not treated like human beings. you are always expendable, no matter how hard you work! ruthless management!\r\n\r\nI worked at OneLegacy for a short period of time and for a few reasons, it did not work out. At first, I felt terrible about the outcome with OneLegacy but I have a another job now that I absolutely LOVE. I love my coworkers, great work-life balance, and the most financial freedom I've ever had! OneLegacy wouldn't have ever provided any of that for me! I wish I knew that I could do that much better before wasting any time with OneLegacy. Do not be fooled by their mission! In my opinion, its not ACTUALLY their mission...... trust me, there are many companies that can provide you a much better package than OneLegacy can dream of! Don't make my mistake. :)"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "The Most Rewarding Career Experience!!", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "16 Feb 2016", "job_title": "Anonymous Employee in Los Angeles, CA", "duration": "N/A", "pros": "Firstly, I would like to start off by stating that I cannot emphasize enough how incredibly fulfilling it is, on both a professional and personal level, to be a member of an organization that takes such immense pride in healing and saving lives, as well as reminding one another about the invaluable need to live life to the absolute fullest! It is quite refreshing to participate in this life-saving mission and to be a part of a team that is beyond warm, receptive, well-informed, empathetic and most importantly, passionate. Although I had never had any formal experience with the principles of organ, eye and tissue donation prior to joining this organization, it has been an incredibly educational journey thus far and I look forward to continuing to learn about the scientific processes and corporate procedures that guide successful donation and transplantation.", "cons": "Truthfully, I have not witnessed a single disadvantage of working for this organization whatsoever."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great place to work with an incredible mission", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "12 Aug 2015", "job_title": "Anonymous Employee in Los Angeles, CA", "duration": "N/A", "pros": "You are able to go to work everyday, regardless of what position you hold with the company, and know that you are making a difference and contributing to a live-saving mission. Oftentimes you are able to see, firsthand, the impact you are making in the lives of many others, whether donor families, transplant recipients, or those waiting for a life-saving organ. If you work hard, there is great opportunity for upward mobility. They compensate employees well with salary and benefits packages, including a great 403b retirement fund.", "cons": "You deal with death and dying every day, and it can take its toll if you don't have a way to decompress. It can be difficult at times to strike a good work/life balance, but it is up to the individual to set boundaries and ensure they are not over-committing."}], [{"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Good", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Worst company ever worked for", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "5 Nov 2019", "job_title": "Surgical Recovery Coordinator in Los Angeles, CA", "duration": "N/A", "pros": "Worked alongside some really great people.", "cons": "Worst leadership I’ve ever worked for. They do not invest in their employees, they are actually known for building cases against people to fire them ( just check public record). They find loopholes to withhold double time pay as well as figure out how you can do more for less. They pay under the industry average even though the cost of living in the area is one of the highest in the nation. They are the only organ procurement organization of its size that does not offer tuition reimbursement and their “scholarship” program is a joke. The politics in the company are very dirty but they call it being “corporate.” They commit Medicare fraud and use some of the most unethical tactics to increase their yield such as throwing loved ones out of the OR and lying to potential donor families when they see that a deceased has withdrawn their donation status by omitting that information. Horrible people work in management here and anyone with a soul should just go to San Diego OPO instead!"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Expect great things at this company but ultimately was disappointed.", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "29 Oct 2014", "job_title": "Communications in Los Angeles, CA", "duration": "N/A", "pros": "Modern building creating pleasant work environment. Connected parking garage with paid parking which was great for downtown Los Angeles. Friendly co-workers and interesting work with a lot of team projects. Adequate salary but not great. Benefits started after 3-4 months depending on your start date but you weren't considered permanent until 6 months. Good benefits package including medical, dental, life insurance, 401K and long term disability. Paid holidays and vacation time.", "cons": "For a non-profit organization, this company was too concerned about the bottom line. The pursuit of money drove upper management instead of their facade of altruistic organ donation. This became apparent after working there only a few months. It spoiled the whole of the contribution you thought you were making to help others."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "A Horrible Company with a Good Mission", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "23 Apr 2020", "job_title": "Anonymous Employee in Los Angeles, CA", "duration": "N/A", "pros": "Organ donation helps recipients and families.", "cons": "Management is cruel. Employees are seen as resources to be used and discarded. Concerns are ignored. Long hours. Expectation to always be available. This is seriously the worst company I've ever worked for. They see employees as machines. They work them until they break, and then they throw them away. As an example, during the COVID-19 pandemic they are forcing ALL employees to continue reporting to the office, because management doesn't believe in remote work, and they are shielding behind being an \"essential company.\" Even essential companies perform functions that can be done remotely in the name of public health, OneLegacy just doesn't care about it's employees or their health. Really, do yourself a favor and stay away from this company. It will be so bad for your psyche, and it's like an abusive relationship. You don't realize how bad it was until someone comes along and treats you right."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great company with great mission", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "5 May 2016", "job_title": "Software Development Manager in Los Angeles, CA", "duration": "N/A", "pros": "Company has great mission to save more and more lives, your co-workers around are awesome, you have a single mission to accomplish! The COO has great vision, very clear on the direction of the business, and he has kept himself highly transparent and available to all staff, he is also a friendly and funny guy to chat with. The company invests HEAVILY on employee, they are very cared about employee and focus a lot on staff development, a lot of training are provided and encouraged for career development. IT Team is great to work with, small team but tremendous deliverable over the time, I was really amazed on all the latest technology on board!", "cons": "Every company has cons, but I do not see anything worth to mention at all compare to the pros."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Good", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Every organ, every time", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "15 Oct 2019", "job_title": "Procurement Transplant Coordinator in Los Angeles, CA", "duration": "N/A", "pros": "The overall mission of helping to facilitate organ donation is a pro, but not at OneLegacy. Organ/tissue recipients are saved.", "cons": "Lying to families to get more numbers, threats of termination, retaliation from managers, constant harassment. Lawyers have been specifically called in to lie to employees in order to scare them into forcing families to donate. Treating all registered donors and their families as strictly numbers - sending people who are still on orientation to speak to these families Bc they don’t get a choice so it doesn’t matter how they are spoken to. Unfair compensation practices and violation of labor laws are common. Managers have voiced that they prefer to not hire gay people or anyone of middle eastern origin because it “makes people uncomfortable” and these managers are still employed while the ones who complained have been let go. The culture is ridiculously awful."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Terrible management", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "27 May 2016", "job_title": "Family Care Coordinator in Los Angeles, CA", "duration": "N/A", "pros": "Good pay. They start you off at a reasonable living so you can't complain. They run  a 24 hour operation so you can find various shifts to suit your needs.", "cons": "Line workers get 20cent raises while higher management racks is 350k per year so moral tends to be low. Managers of various departments are married to eachother so getting up the ladder can be hard... Unless you marry into it apparently."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "\" Let the Buyer Beware \"", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "26 Jun 2014", "job_title": "Procurement Coordinator in Los Angeles, CA", "duration": "N/A", "pros": "Inspirational mission statement and wonderful community service saving lives. Most co-workers were drawn to work there for these reasons. Many employees are truly committed to helping others get a second chance despite internal factors. A great learning experience with opportunities for advancement....some place else. Benefits and salary are decent and seem competitive.", "cons": "Oppressive senior management with no respect for subordinates. More focused on their enormous salaries. Culture is extremely political and favoritism determines advancement. Middle managers have no prior experience or even taken a management course. Rewards are based on who you know- not what you know. This could be a great rewarding place to work, but culture is compromised by senior management questionable agendas and style."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 4, "Senior Management": 0, "review_title": "Manager", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "31 Oct 2017", "job_title": "Anonymous Employee in Los Angeles, CA", "duration": "N/A", "pros": "Good benefits, good cause, some really good dedicated employees (who take a lot of grief)", "cons": "Tough office culture, a lot of finger pointing, avoiding responsibility, and lacking listening skills.  Dead end for most positions and behind the times from a technical and work-life perspective.   HR, Operations, and IT organizations are a mess. If you aren't liked, you will be talked about all day long.   There are so many great places to work, keep looking!"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Recent Restructure", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "9 Feb 2015", "job_title": "Executive Assistant in Los Angeles, CA", "duration": "N/A", "pros": "This non-profit organization is considered the second largest organ procurement organization in the US, helping to save and heal lives through organ, tissue and eye donation. The compensation is competitive for similar healthcare positions.", "cons": "The work-life balance is a concern and employees are expected to give 150%.\r\n\r\nCorporate restructuring in mid-2014 generated a a layoff and a lot of long-term staff leaving. It has created many open positions, some of which are being rehired now. All staff report to the COO/CIO now, who is very clinical, so not all programs and projects are still happening or in the same way, some of this is also due to re-branding."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "Invaluable Experience", "rating": "2.0", "reviewer_affiliation": "Former Employee", "job_date": "5 Feb 2016", "job_title": "Anonymous Employee in Los Angeles, CA", "duration": "N/A", "pros": "This organization offers amazing exposure into a very niche industry. I was given the opportunity to learn a lot about the different aspects that go into donation -- the family approach process, the actual procurement of tissue, medical review and lastly the support provided to families post donation. It's definitely an invaluable experience and there is much to learn.\r\n\r\n\r\nAnother pro are people who work there. In any organization, some people are terrible/incompetent & some are amazing and way too qualified for what they're doing. I still have great relationships with colleagues I've met there, and I've seen so many develop and leave for better things. Plus, happy hours are always fun!\r\n\r\n\r\nAnd lastly, the stories we can tell! It's always funny (and maybe a little depressing) to tell family/friends about the crazy things that happen at OneLegacy. No I don't mean confidential donor stories, but the crazy things management will do and say to their employees. It's unbelievable sometimes! I think it's healthy to vent, laugh about how insane management is and appreciate that we will never have to live the type of life they have that caused them to treat others poorly (unless you stay of course... then sorry).", "cons": "Due to the nature of this industry, things are very fast-paced, which isn't necessarily a con because it does improve work ethic and really shows who is capable of adapting to such demands. However, this is added as a con mainly because of how OneLegacy deals with this fast-paced environment. They are vastly understaffed (this is also due to high turnover) and don't particularly reward or acknowledge staff who are high performers. \r\n\r\n\r\nWork life balance would be another con. I think it's a great organization for new graduates who want to make a decent paycheck (overtime is always nice too). However, the company does not encourage having a life outside of work, so it's really up to you to decide which is more important. Excessive work also leads to burning out staff, which isn't an issue for OneLegacy if their goal is to utilize staff at their high point. Great method for organizations that want high performers for a short period of time, with zero focus on development. I could see this being beneficial for certain roles at OneLegacy. \r\n\r\n\r\nTraining is an issue, but they have been moving towards a direction that focuses on this more. As I stated in my pro, it's an invaluable experience, but this \"experience\" wasn't given to me. Learning is something you have to do on your own. If you are genuinely interested in the industry, you have to take initiative to request to learn about other departments (I've heard of managers denying this, but I was lucky I guess). Also, a lot of what I learned was from Google searches. And oh Wiki is your friend.\r\n\r\n\r\nManagement is probably the biggest con. Many are not qualified for their positions and were merely promoted because of favoritism. Great for the person promoted, but terrible for his/her direct reports. A majority of management is also unprofessional -- it's definitely unheard of of how much they could get away with without HR stepping in. It makes sense that they deal with so many legal battles. It's definitely a very hostile work environment, but a pro to this is learning what you want in a workplace and learning how to be a better person/manager yourself by doing the exact opposite of what they do.\r\n\r\n\r\nIn the end, I thought it was a good experience but it really depends on your priorities. I was willing to give up my life for these demands (mainly to boost my resume) and to earn a boat load of overtime cash. It's definitely not a place you want to stay at long term though -- really not healthy for your soul. I think we all die a little inside while working here, but think about how great it feels when you actually leave!"}], [{"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Current Employee", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "3 Mar 2017", "job_title": "Anonymous Employee in Los Angeles, CA", "duration": "N/A", "pros": "AMAZING Mission! I absolutely love the work and what the organization stands for. This is a growing and dynamic not-for-profit that literally saves and improves lives every day. If you want to be part of something that is much bigger than anything else you have ever done in medicine, this is the place for you. Benefits are very good and include medical, dental, vision, HSA, short and long term disability, 403B retirement and a very good employee assistance program.", "cons": "This is hard work as you are dealing with death and dying every day and it can take its toll. But, if you keep on task with the mission and can find the balance between work and the need to have a life, it is a great job! Newly hired PTO accrual is slow and I wish a little bit more...but it is fair in comparison to my other hospital jobs. Employee development through tuition reimbursement would be a plus for the company. Clinical employees have a sense of entitlement that negatively affect other staff that they come in contact with. If you think the company is such a bad place...go somewhere else and find out if the grass is truly greener or stop and realize that this is a company that really cares about you, your community and literally people all over the country."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 0, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Rewarding career", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "25 Oct 2016", "job_title": "Anonymous Employee in Los Angeles, CA", "duration": "N/A", "pros": "There are so many positives to working for a great company with a great mission,  The culture is changing and staff are given resources to meet their potential.  You get to do things that you would never be able to in a hospital environment and continually learn.", "cons": "You need to sacrifice some time when things get very busy and help out the team.  It can take a toll when donation is unpredictable."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Dissatisfied Former SRT", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "10 Jul 2015", "job_title": "SRT in Los Angeles, CA", "duration": "N/A", "pros": "Supervisors of LA office were great- pushed you to learn and excel.  Work was rewarding at first.  Coworkers were generally supportive and comfortable to be around.", "cons": "Management does not value employee safety or health at all.  Corporate was constantly penny pinching and slashing wages while increasing their own salaries (nonprofits have to disclose this information publicly).  Very results driven and forced some cases that were obviously unsafe and the tissue unusable for transplant.  Management sells the idea of providing a necessary service to the world, but only cares about profits."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 0, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "Highly political environment; work for who you know not what you know.", "rating": "2.0", "reviewer_affiliation": "Current Employee", "job_date": "2 Nov 2011", "job_title": "Systems Administrator in Los Angeles, CA", "duration": "N/A", "pros": "Non profit company has good benefit and nice working environment.  The environment is less formal and more relax than most.", "cons": "lack of organization among senior management structure; lagged behind in technology implementation and lack of experience staff dealing technology management."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "An Honorable Mission ...Gone Terribly Wrong", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "24 Nov 2017", "job_title": "Procurement Transplant Coordinator in Los Angeles, CA", "duration": "N/A", "pros": "Unfortunately, in my opinion nothing is left to be viewed in a positive light. Many of us hope that another entity will soon buy-out and rebuild this OPO back to it's original core values.", "cons": "Briefly summarized:\r\n1) UNSAFE PRACTICES (extreme inadequate training: unsupervised new-hires deprived of preceptors due to continuous staffing shortages, non-skilled/non-clinical personnel delegated duties far outside of their JD, inconsistent and VERY questionable clinical operations occur regularly without corrective education due to absent supervisors. Complete lack of adequate rest and meal breaks, as well as safe downtime between shifts: many front-line staff with sleep in hospital parking structures after their shift due to fear of driving incapacitated from complete exhaustion).\r\n2) UNETHICAL PRACTICES (Disgraceful disservice to donor families, hard-working hospital staff, and transplant centers: OneLegacy staff are often strictly instructed from upper management to deceive, manipulate, and engage in egoistic-focused intent with a bully mentality to achieve complete control of all situations at any cost. Questioning authority in these unfortunate circumstances will place a target on your back within the organization and you will be labeled \"difficult\". This is a fear-based run organization and many well intentioned, innocent front-line staff will follow suit to avoid well known retaliation and harassment efforts from the hands of executive leadership). \r\n3) INCOMPETENT LEADERSHIP: (Executive operations are single-mindedly  focused only on donor numbers, revenue, image, expansion, and absolute control. There is such a complete disconnect and disregard for staff's well being and safety that it is nearly unfathomable for those who are left still trying desperately to serve the true mission. The organization's leadership is the definition of Corrupt Corporate America, with never ending corporate scandals that are consistently swept under the rug).\r\n4) COMPENSATION (Below average wages and PTO accruals. Clinical personnel are poorly salaried and classified overtime \"exempt\", with an expectation of enduring 16 hours on-call before any overtime wages will be considered. Several mandatory meetings are held on your off-days, unpaid. You are expected to answer your work phone within two hours on your off-days. Extreme staffing shortages results in constant guilt-shaming strategies to recruit staff to work extra shifts- if you prefer not to work extra shifts, you will be shamed during your annual evaluation and demoted points, which will subsequently affect your potential for a pay raise)."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "Empty Promises", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "20 Jun 2014", "job_title": "Anonymous Employee in Los Angeles, CA", "duration": "N/A", "pros": "Some of the best workers are here. Very many passionate people who love their job and want to help others. The job isn't tough, but the negative environment takes a toll on you. The starting pay is good, along with the benefits.", "cons": "Management tells you what you want to hear, but never follow through. Very impossible to move up or into another department. There is absolutely no communication between management."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "No Work Life Balance", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "19 Mar 2017", "job_title": "Recovery Tech in Los Angeles, CA", "duration": "N/A", "pros": "You will become very close with your coworkers, mainly because you spend so much time with them. Great stepping stone for Med/PA/Nursing School if you're working in the field. Decent pay.", "cons": "For field employees, work-life balance is nonexistent. Management holds grudges plays favorites, shady use of loopholes to get out of paying on call employees call pay or overtime, field employees are expendable, extreme lack of communication and understanding between departments."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "The Job is a Life Style", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "10 Jul 2020", "job_title": "Surgical Recovery Technician in Los Angeles, CA", "duration": "N/A", "pros": "The company hires from within. There are many opportunities to climb the corporate ladder if that what you want to do. Many of the upper level managers stated as techs themselves. \r\nGreat coworkers who are fun and hard working.\r\nGood sense of community between departments.\r\nLong hours, but lots of opportunities for overtime pay.", "cons": "Over the years the company has significantly reduced the amount it pays its lower level employees."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "People don't leave jobs, they leave bosses", "rating": "1.0", "reviewer_affiliation": "Current Employee", "job_date": "18 Oct 2015", "job_title": "Anonymous Employee in Los Angeles, CA", "duration": "N/A", "pros": "The mission and all lower level staff are amazing.", "cons": "OneLegacy is slowly but surely being driven into the ground. The way management operates is not sustainable. Management leads by bullying and emotionally beats you into submission. This isn't just \"some\" management or \"some\" departments. This behavior is happening company wide. Not all Supervisors at OneLegacy are terrible, but unfortunately they have zero control. All decisions are made by managers, directors, and VPs who all do whatever the COO tells them to. This company is ran by one person and one person only...the COO. The board of directors won't help us because they are too busy being wined and dined and taking lavish retreats. Think this is a joke? It's very sadly not. Turn over rate is high...extremely high...and it happens quick. People don't stay around long because they learn very quickly that they have no value. The COO finds every excuse in the book for the reason turn over is so high. The only explanation he doesn't offer, however, is himself. He's the problem. And all upper management that he hand picked are the problem. People are miserable and management only cares about their fat paycheck. Management won't work with anyone's schedule and constantly force you to use unexpected time off and THEN you get in trouble for using it. For a company that acts like they care so much about \"saving lives,\" they certainly don't care about the lives of their staff."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "It will take every last ounce of life out of you", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "14 Dec 2016", "job_title": "Technician in Los Angeles, CA", "duration": "N/A", "pros": "Coworkers become family because you never see yours. If you are field staff, you get to be on the road which is better than being stuck in a cubical. Also, the best anatomy lesson of your life when in the surgical environment.", "cons": "Where do we start. You are viewed as absolutely disposal/replaceable. If you're a veteran employee they'd happily see you leave so they can pay a new college grad a fraction of your wage. If you cause an \"event\" (a breach in policy), you may or may not get disciplined/fired; it depends if they like you. There are zero growth opportunities. You have to wait for someone to quit or get fired in order to \"move up\". They tried to offset this by creating new positions but in reality you just become salary and get run even further into the ground. The COO uses intimidation as a suppression tactic and his executives have brought staff to tears. Also, labor laws? Out the window. I cannot tell you how many times I worked 16-20 hr days on cases, slept 3-4 hours and then the phone goes off with your Supervisor saying \"Hey, I need you for a case\" (a case is a donor btw). Abuse is an understatement. Their compensation for this? A free meal which you pay upfront for and might get reimbursed two months later. Oh, and no on-call pay, they took that away years ago. If you're on the schedule, you only make money if there is a case. No case day=$0.00 dollars earned."}], [{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Excellent company Mission statement", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "25 Jan 2017", "job_title": "Quality in Los Angeles, CA", "duration": "N/A", "pros": "OneLegacy is part of the Donate Life Network a worthy cause.", "cons": "As a non-profit the hourly wages are low. The amount of work is overwhelming at times. With only a half hour lunch available and being in downtown L.A. it is difficult to eat lunch and de-stress, or take care of personal business"}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Terrible money-hungry organization", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "26 Sept 2015", "job_title": "Anonymous Employee in Los Angeles, CA", "duration": "N/A", "pros": "The benefits are decent. The parking is included. Great for someone with no family obligations. The mission of the organization is definitely a positive experience.", "cons": "They work you to the ground without regard for your personal life. The management does not know how to manage their employees. The main software program they use is DigitalDonor which they paid 2.5 million for and is a terrible excuse of an enterprise database. The user interface is glitchy and not user friendly. The pay is decent for starting out at around $20/hr. But there is no upward mobility. There is no career ladder. The COO, Prasad Garimella, also the CIO which means anything that has to do with the operations or IT goes through him. There is no checks and balances at this company. He is the major problem with this organization. In fact, all of upper management needs to be replaced. This company is money hungry. They make most of their money off of tissue donation. They also started another organization to funnel money into keep it within Onelegacy.  The management do not keep their employees up to date on anything. Many employees know how to manage better than the current managers at Onelegacy.  It is interesting how many employees just get forced to resign and no one knows about it, hence the CFO a couple months ago."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Awesome Place to work!!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "2 Mar 2016", "job_title": "Helpdesk Technician in Los Angeles, CA", "duration": "N/A", "pros": "Very technologically advanced company that uses the latest and greatest devices. Everyone is just super nice and helpful. This company is very organized and always on the ball.", "cons": "well, since we are growing we need more people, and they are actively working on it."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "OneLegacy Rocks", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "2 Nov 2016", "job_title": "Anonymous Employee in Los Angeles, CA", "duration": "N/A", "pros": "Awesome mission of helping save lives and comforting families. The company has grown significantly and created more opportunities for the staff.", "cons": "Emotionally challenging work, can burn out some people, but worth it. Some colleagues don't recognize what a great place it is to work"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Awful and unethical HR standards", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "30 Sept 2015", "job_title": "Specialist in Los Angeles, CA", "duration": "N/A", "pros": "Great mission that saves and enhances lives.", "cons": "Very unethical HR standards.  Will quickly ask you to do twice the amount of work and pay you nothing (financial or otherwise) in return.  Rigid management that is quick to let go of staff, misuse them and abuse them without consideration for their health or well being.  Specifically, I was given one job upon hire then given a multiple page document a week later as \"true job description\""}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 5, "Senior Management": 0, "review_title": "Family Care Coordinator", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "15 Jun 2017", "job_title": "Family Care Coordinator in Los Angeles, CA", "duration": "N/A", "pros": "Parking is paid for (which is rare for companies in DTLA) and they offer a great benefits package.", "cons": "There is no opportunity for growth at this company (no employment ladder)."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Call center", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "20 Oct 2015", "job_title": " in Los Angeles, CA", "duration": "N/A", "pros": "The mission is amazing. If you want to help someone and remember why you are there the experience will be rewarding and becomes more than a job.", "cons": "Schedule is tough and the drive to downtown LA is tougher."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Organ Donation Coordinator", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "17 Dec 2018", "job_title": "Organ Donation Coordinator in Los Angeles, CA", "duration": "N/A", "pros": "SCAM. Not an employ. Red flag when they couldn't give me an accurate job description during an interview.", "cons": "SCAM. This posting stays on the internet over and over again. Wasting applicants time. I have gone to the final stages of hire and this position is still posted months later. Finance dept. SCAM. Company real, but this ploy is a trick of the trade for the finance dept."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Very unique job", "rating": "3.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "13 Mar 2019", "job_title": "Family Care Coordinator in Los Angeles, CA", "duration": "N/A", "pros": "If you are seeking a career in healthcare, you won't get this kind of experience/exposure anywhere. You get to see how a hospital functions from different angles.", "cons": "Each shift is 12 hours and can be very draining both physically and mentally."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Non profit, positive  help , make a diference", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "23 Apr 2013", "job_title": "Coordinator in Los Angeles, CA", "duration": "N/A", "pros": "Take entry level , feel good type of job, make a diference in peoples lives", "cons": "Down Town Traffic industry competition not close"}], [{"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": "N/A", "review_title": "Management's elitist mentality", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "21 Mar 2016", "job_title": " in Los Angeles, CA", "duration": "N/A", "pros": "Company has a great mission to assist those in need of organ transplants.", "cons": "IT managers feel they are elite and in a group of their own"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great company", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "20 Apr 2019", "job_title": "Controller in Los Angeles, CA", "duration": "N/A", "pros": "Great place to work and contribute to their mission of saving lives", "cons": "There are no negative comments"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Treat employees like dirt", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "12 Mar 2018", "job_title": "Coordinator in Los Angeles, CA", "duration": "N/A", "pros": "None. If I could give zero stars I would.  The company continues to get sued due to the horrible treatment, favoritism, and discrimination of their employees", "cons": "Long hours, the worst pay per industry standards, no dialogue when it comes to improving practices"}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 0, "review_title": "Ok place to work", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "31 May 2017", "job_title": "Anonymous Employee in Los Angeles, CA", "duration": "N/A", "pros": "The organization has a honorable missions and visions. They have a very good benefits and compensation.", "cons": "Politics that we can't handle"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Hard Work", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "20 Dec 2019", "job_title": "PTCB Pharmacy Technician in Los Angeles, CA", "duration": "N/A", "pros": "Helping to save lives every day", "cons": "Long work hours with no life balance"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "I Love My Job!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "22 Oct 2017", "job_title": "Coordinator in Los Angeles, CA", "duration": "N/A", "pros": "Compensation and benefits are generous.", "cons": "Workload is busy. Allot of driving."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Good Company", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "26 Dec 2019", "job_title": "Family Care Coordinator in Los Angeles, CA", "duration": "N/A", "pros": "Good pay,  great coworkers.", "cons": "Wish there was a better career ladder."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Management in the accounting department is horrible", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "16 Feb 2017", "job_title": "Accounting in Los Angeles, CA", "duration": "N/A", "pros": "I can not think of one thing", "cons": "AP Management is clueless, no training but expect you to do your work as well as others. the department is unorganized and unprofessional"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Not a place I can recommend", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "27 Feb 2019", "job_title": "Surgical Technician in Los Angeles, CA", "duration": "N/A", "pros": "Coworkers that work as hard as you do to try to get by from the toxic environment", "cons": "The hours, schedule, no work-life balance, low morale, but especially the awful management"}]]