[[{"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Square pegs in a round hole and other absurdities", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "21 Apr 2013", "job_title": "Case Coordinator", "duration": "N/A", "pros": "I've been able to meet some of the greatest people here. My coworkers are hard-working people who back each other up and offer support. I've been able to make some great friends here. These are people who tend to be family-oriented, and there are a lot of people here who have children and bring with them personalities which expect a healthy work-life balance. It's refreshing to see that not all coworkers have to be workaholics who don't value personal growth outside of the workplace.\u2028\u2028There are also opportunities to learn skills and have experiences for your resume-- whether it's create something new a client can use, or share something amongst your coworkers. Most important, these are people who actually care about the clients.", "cons": "Upper management doesn't teach their mid-level managers well. Often they are very young people with little experience who are somehow expected to manage dozens of people without receiving the proper training. The managers often have their own way of doing things which contradict each other most of the time.\u2028\u2028\r\n\r\nPay is very low and not a truly livable wage for the work we do. There are no raises on a yearly basis, and the mileage reimbursement might be adequate, but it's not enough considering how low the hourly pay is. For what we do, our pay should be higher. We take a lot of heat from parents, social workers, and outside agencies who expect us to do a lot more than we can with very little.\u2028\u2028\r\n\r\nLimited room for advancement. You can go from being a case coordinator or DSP to an assistant supervisor to program supervisor, and that's that. There are only 2 assistant supervisors at each metro branch, and only one program supervisor at each branch. Not a lot of room to grow.\u2028\u2028\r\n\r\nThere is unbelievably high turnover. It has got to be well over 75% at any branch at any given time. This cases a lot of headaches for the people who stay and also for the clients. Imagine having to go through 4-5 staff in a year, or even less. Is it any wonder why people might leave the program to go join a different one which is more stable?\u2028\u2028\r\n\r\nThe methods for billing aren't clear. This causes a lot of confusion for the staff and then we are the ones who take the brunt from angry social workers who want to know why we are billing the way we are. In addition, there seems to be some unethical billing practices, as at the end of the year when some clients' authorizations end, we are told to \"bill, bill, bill.\" Bill for what, exactly? Are we billing for actually providing a service, or just so we can bring money in?\u2028\u2028\r\n\r\nThere appears to be little care about staff safety or provide safety training. They don't seem to understand that clients with mental illnesses can snap at any time. If we're going to be working with people who have mental illnesses and can be prone to violent behavior, we need to receive appropriate training to deal with those situations.\u2028\u2028\r\n\r\nA lot of \"closed doors\" politics exists. People at the office can detect this suspicious behavior and it's quite clear something is going on. It's as if there is a huge secret going around and it's not necessary because we're all going to find out about it anyway. It also creates a work environment where people have to be worried about whether or not something bad is going to happen-- either to the office or to them. Unfortunately, this is an environment which breeds a lot of fear.\u2028\u2028\r\n\r\nThere seems to be favoritism going on as well. If a manager doesn't like you, they will go after you in a way which creates a hostile work environment, no matter how hard you work. For those who don't have this problem, there is an inappropriate level of friendliness which happens between supervisors and staff. The company isn't professional enough, and if it claims to be professional it's done in a way which revolves around keeping people in their place and not really using a relationship approach to address staff.\u2028\u2028 You know there is something odd going on when a \"training\" between the branch supervisor and a lower manager lasts a few hours in an office with the doors closed, rather than being held in the conference room where there are glass doors. \r\n\r\nThe managers have poor conflict-resolution skills and micromanage their staff. If you aren't their favorite, you will be in their watch list until you leave. People have left because they could not stand how they were being treated-- either with receiving disciplinary action for every little transgression, or due to poor communication which created unnecessary problems. This creates an atmosphere where staff begin to think they aren't trusted to do their jobs well, or aren't capable of doing their jobs well. People get frustrated as a result and leave to go elsewhere because it's not the way to treat your staff.\u2028\u2028\r\n\r\nA lot of confusing and arbitrary policies exist. It seems while a policy will go into effect, it will change in order to suit the needs of the managers. A policy either needs to be a policy and treated as such with no exceptions for everyone, or it's not a real policy since it can be changed at any time. This also goes along with the favoritism, as managers who favor some staff over others will allow those staff leeway whereas the staff they don't particularly like or get along with have to adhere to policies strictly.\r\n\r\nWhen management is asked why certain things aren't done, or why they've been left in a stalemate for years you get responses such as \"square peg in a round hole\" and better yet \"money is like water-- when you try to grab it, it goes through your hands.\" Say what? Is this how a business is supposed to run?\r\n\r\nRun away!!!!!!!!"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 0, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Accommodation Manager", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "27 Apr 2016", "job_title": "Accommodation Manager in Leicester, England", "duration": "N/A", "pros": "Very good company to work for, as they like to look after you.", "cons": "They do not have much staff so you end up doing anything and everything. But as the company is not hugh so not much career opportunities."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Not appreciated by admin; worked for the clients.", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "Great coworkers. Hands on experience with human services and non profit/for profit work", "cons": "Poor pay; lots of driving; not enough work; admin is not open to ideas"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "at home", "rating": "5.0", "reviewer_affiliation": "Current Freelancer", "job_date": "12 Jun 2015", "job_title": "Anonymous Freelancer", "duration": "N/A", "pros": "it is a very nice place", "cons": "It is boring here sometimes"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Cleaner", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "14 Feb 2017", "job_title": "Cleaner in Dublin, Dublin", "duration": "N/A", "pros": "Good people, agreeable place and benefits", "cons": "Didn't have nothing I didn't like"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Homes", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "3 Mar 2019", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Very innovative strategy\r\nGood team\r\nFun culture", "cons": "Nothing that I can think of"}], []]