[[{"date": "17 Apr 2023", "title": "RN-ED Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Henry Mayo Newhall Hospital (Los Angeles, CA) in Apr 2023", "Interview Descriptions": "I was contacted by the recruiter to come in for an interview and the interview was scheduled 2 weeks in advance. There was a large panel of nurses and managers during the interview. I think the interview was all formalities and they already chose who they wanted before the interviews were conducted. I got a bogus reason for them not chosing me even though I was more than qualified for the position.", "Interview Questions": "N/A"}, {"date": "1 Feb 2023", "title": "Marketing Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Henry Mayo Newhall Hospital (Los Angeles, CA) in Jan 2023", "Interview Descriptions": "Good interviews. They know what they are doing and only want people that know about them and understand what they are doing. Learning as much as you can about Henry Mayo because they do a lot for the community", "Interview Questions": "Tell me about yourself and why you got here"}, {"date": "22 Nov 2022", "title": "Human Resources Position Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at Henry Mayo Newhall Hospital (Los Angeles, CA)", "Interview Descriptions": "It was a 3 panel interview.  Recruiter was great pre-interview but never heard a peep anything after the interview and after I reached out.  It was an hour long and towards the end, one of the Hiring Manager had a smirk on her face, so unbecoming and turned me off.  Better off working somewhere else.  I had a feeling it would be a stiff culture and I was right.", "Interview Questions": "How would you handle priorities?"}, {"date": "9 Jun 2022", "title": "Physical Therapist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Henry Mayo Newhall Hospital", "Interview Descriptions": "Very organized and personable interview. They fail to mention that their rehab department is actually owned by a private company. So you would be working under this private company and not Henry Mayo, so if you’re interested in non profit the position wouldn’t be non profit.", "Interview Questions": "What my five and ten year plan is. "}, {"date": "31 Oct 2021", "title": "ICU Registered Nurse Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Henry Mayo Newhall Hospital", "Interview Descriptions": "I interviewed with the ICU manager and was told\r\nIt would be a good fit and that I would hear back from HR in the next day or so. I didn’t hear back. I called HR a week later and they said the manager is still interviewing. I called back two weeks later and was told the manager hasn’t made a decision. They never got ahold of me. Very rude.", "Interview Questions": "Tell me why you want to work for Henry Mayo. "}, {"date": "21 Sept 2021", "title": "New Grad RN Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Henry Mayo Newhall Hospital", "Interview Descriptions": "Recruiter called and scheduled you for an interview and they designate you a time to come in. They ask you behavioral and a lot of situational questions that are relevant to the job. Horrible in following up. Recruiter ignored follow up emails. You never hear from them if you don’t get the job, very unprofessional.", "Interview Questions": "Why do you want to work in this department? \r\nPriority and delegation questions. \r\nDescribe a time when you made a mistake and how did you fix it. "}, {"date": "2 Sept 2021", "title": "Rehab Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Henry Mayo Newhall Hospital", "Interview Descriptions": "The interview was done via phone interview, it was simple, straight the point and fast hiring. Question pertained to job skill, previous work history, and future goals with the company.", "Interview Questions": "Why do want to work for us?"}, {"date": "25 Jan 2021", "title": "Patient Sitter Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Henry Mayo Newhall Hospital", "Interview Descriptions": "Easy. Smooth. Not super in depth and just want to get to know you! Very accommodating of students eager to learn and get their foot in the door. I very much enjoyed my interview even though I was nervous and felt very welcomed and understood", "Interview Questions": "Why do you want to work for us?"}, {"date": "3 Feb 2021", "title": "New Grad Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Henry Mayo Newhall Hospital in Jan 2021", "Interview Descriptions": "I was first contacted by the recruiter, who then scheduled me for an interview that was clinical/knowledge based. 2nd interview was with the managers of the unit I was applying for.", "Interview Questions": "Tell me about a time that you made a mistake at work, and what did you do to fix it? "}, {"date": "25 Nov 2021", "title": "Patient Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Henry Mayo Newhall Hospital (Los Angeles, CA) in Jan 2021", "Interview Descriptions": "Interview was quick and lasted around 15 minutes.  The interviewer asked basic interview questions and made the process as stress-free as possible.   She was very welcoming, warm, and friendly -- very different from other interviews I have experienced.", "Interview Questions": "Why do you want to work here?\n\nHow would you address a difficult patient? "}], [{"date": "4 Jan 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Henry Mayo Newhall Hospital in Jan 2021", "Interview Descriptions": "Process involved two interviews. First was a clinical interview that involves nursing/critical thinking based questions. Second was an interview with the unit managers. Overall, communication with everyone was very open and clear.", "Interview Questions": "Why do you want to work here? If you saw a co-worker doing something wrong, how would you react? "}, {"date": "3 Jul 2020", "title": "SPD Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Henry Mayo Newhall Hospital (Valencia, CA) in Mar 2020", "Interview Descriptions": "Interview went great and the director was super friendly. Interview questions were asked and then the director went on to explain the duties and about the hospital. Simple and easy interview, looking forward to a career here.", "Interview Questions": "Why do you want to work here? \r\nWhy do you want to work in the Sterile Processing department?"}, {"date": "12 Sept 2019", "title": "Business Services Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Henry Mayo Newhall Hospital (Valencia, CA)", "Interview Descriptions": "I applied online and was contacted by Human Resources to come in and interview.  I met with the Head Cashier first, and then met with the Director of Business Services.  I underwent a background check, a drug test, and was hired for the position,  I attended a paid two-day orientation for new employees and started the position,", "Interview Questions": "Do you know how to read an EOB"}, {"date": "27 Dec 2019", "title": "Administrative Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 1 day. I interviewed at Henry Mayo Newhall Hospital (Santa Clarita, CA) in Sept 2019", "Interview Descriptions": "I was sold on coming into Mayo for an interview: excited to talk to me; very interested. zi got there, was kept waiting for 45 minutes past my scheduled interview time, met with the Director (who obviously had never looked at my resume before), and received a \"courteous\" 20 minute interview. I never heard from them again. Not even a thanks-but-no-thanks email. I felt very disrespected.", "Interview Questions": "So, tell me about yourself (while frantically reading my resume)."}, {"date": "29 Sept 2016", "title": "Systems Analyst Junior Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Henry Mayo Newhall Hospital", "Interview Descriptions": "Was relocating from another state.  Initial Phone interview with HR.  this was good.  then had Phone interview with Hiring Manager (not so nice_should have read the writing on the wall).  Then was asked to fly to CA for face to face interview.  Interview was a couple of hours long...HR Recruiter 1, HR VP and CIO 2, IS TEAM 5, Hiring Manager & an Assistant 2, and last HR Director. So basically a panel of:  11.  In generally all parties were kind and polite, they were good interviews.  I was asked to do everything out of pocket.  \r\nIt did take approximately 2 week for job offered\r\nEven when hired, and needed to come out for pre-screening Physical, lab work and drug screen...had to purchase my own flight (not reimbursed)  \r\n.", "Interview Questions": "When I could start.\r\n\r\nMany questions with my experiences as a system analyst and application knowledge"}, {"date": "4 Sept 2015", "title": "CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Henry Mayo Newhall Hospital (Valencia, CA) in Jan 2015", "Interview Descriptions": "You have to search for jobs online and apply online. If you get selected, they call you in to interview with HR. They will then have you interview with the head of the department you are applying for.", "Interview Questions": "What makes you more qualified for this job than others? "}]]