[[{"date": "11 Jan 2022", "title": "Office Job Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Wesleyan University (Middletown, CT)", "Interview Descriptions": "Horrible experience. \r\n\r\n* The process was way too long (about 3 months from application submission to rejection) and I ended up having over 5 interviews for a position that wasn't even senior-level. \r\n* The recruiter I was working with was condescending.\r\n* Most of the people who interviewed me either didn't seem to have a lot of experience interviewing or just weren't interested in talking to me. Awkward pauses when it was their turn to respond, lack of enthusiasm, and allusions to no work-life balance were all red flags.\r\n* Some interviewers were late because they \"forgot\" or are unknowledgeable on how to use technology.\r\n\r\nOverall a negative experience. I have nothing bad to say about the university itself,  but applying for a position there was a nightmare and I wouldn't do it again.", "Interview Questions": "What was a challenge you faced in your previous role and how did you overcome it?"}, {"date": "1 Dec 2021", "title": "Summer Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Wesleyan University (Middletown, CT) in Oct 2021", "Interview Descriptions": "Behavioural interview, very chill, do reach out to everyone in the office beforehand to get a better chance of passing the first round interview. There will be a second-round interview where you talk to other people in the office then a final round to screen people.", "Interview Questions": "What qualities do you think is important for the job?"}, {"date": "27 Sept 2021", "title": "ResLife Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Wesleyan University (Middletown, CT) in Jul 2021", "Interview Descriptions": "A lot of scenario based questions; you have to be completely honest with responses. Interviewer can tell if something is made up. If shown interest, you can get the position quite easily.", "Interview Questions": "What is your experience in team building and how confident are you to accept a leadership position in a team?"}, {"date": "25 Jun 2021", "title": "Resident Advisor (RA) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Wesleyan University", "Interview Descriptions": "You will have both and individual and group interview. The individual interview will consist of questions gauging your soft skills, leadership skills and decision making abilities. The group interview will also help them analyze your leadership skills along with your ability to work with others.", "Interview Questions": "If you had to design a residential hall, how would you design it and why?"}, {"date": "16 Jan 2021", "title": "Senior Executive Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Wesleyan University", "Interview Descriptions": "HR was so negative! They picked apart every single job line by line. I was convinced they hated me! When I withdrew from the search b/c I had another offer, they tried to pressure me into continuing.", "Interview Questions": "Why do you want to work at Wesleyan?"}, {"date": "14 Jul 2019", "title": "Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Wesleyan University in May 2019", "Interview Descriptions": "easy, friendly, no/low pressure environment. everyone was very nice and it was more like a conversation than an interview. it only lasted about a half hour or so and I got my offer of employment later that day.", "Interview Questions": "how would I approach criticism and complaints"}, {"date": "8 Apr 2019", "title": "Program Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Wesleyan University (Middletown, CT) in Jan 2019", "Interview Descriptions": "Skype Interview--was arranged through the human resources office at the college, each person on the panel interviewing me had pre-prepared questions. I was on my computer at home, and from what I could tell, my face was on a monitor/tv up in the corner along with the camera i was looking at them through.", "Interview Questions": "What about the Prison Program at Wesleyan are you most excited about?  "}, {"date": "12 Dec 2018", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Wesleyan University", "Interview Descriptions": "Brief and they were very welcoming and excited. There was a lot of assessment of willingness to learn. The application online was pretty easy and the interview did not take long. They replied pretty quickly.", "Interview Questions": "What are your goals "}, {"date": "26 Jun 2018", "title": "The Assistant Professor, the Pracitce Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Wesleyan University (Middletown, CT) in May 2018", "Interview Descriptions": "In the phone interview, they briefly introduced the nature of the position and then answered many of my questions regarding the school and this position.  Then, they also asked for my teaching styles and how I would plan for a introductory physics course for life science students.", "Interview Questions": "They ask me about my teaching styles and how do I find good questions for the homework/class."}, {"date": "28 Jan 2019", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Wesleyan University (Middletown, CT) in May 2018", "Interview Descriptions": "There were brief questions that were asked -- they were typical behavioral questions and no technical question. I would advise that in order to prepare for the interview - just network with the people already on the job.", "Interview Questions": "Q) Why are you interested in working here? "}], [{"date": "14 Oct 2016", "title": "ITS Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Wesleyan University", "Interview Descriptions": "Easy questions overall. The process is also pretty straightforward. You apply, you get a interview, then you find out if your hired. Afterwards, you'll get trained both in training sessions and on the job.", "Interview Questions": "Why do you want work at ITS?\r\nExplain your work experience (especially customer service)."}, {"date": "4 Feb 2016", "title": "Facility Manager and Theatrical Technical Director Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at Wesleyan University (Middletown, CT)", "Interview Descriptions": "I was interviewed by a group of 14 people, all at one time. Each interviewer worked or ran different Departments and had no interest or knowledge of the other interviewers or their Departments. The interview was like interviewing for 14 very different positions. \r\nThis should have been a warning because after being hired, I quickly realized that communication on Campus hardly existed and there was very little support to remedy any misunderstanding or problem.", "Interview Questions": "Where have I worked before?"}, {"date": "5 Nov 2015", "title": "Red and Black Ambassador Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Wesleyan University (Middletown, CT) in Sept 2015", "Interview Descriptions": "Easy, 15 minute phone call with one of the student managers. They asked some behavioral questions and then some questions about how I would answer a tough alumni question. They didn't call at the time they said they were going to but it was not that big of a deal.", "Interview Questions": "What is your greatest strength?"}, {"date": "18 Aug 2015", "title": "Multimedia Developer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Wesleyan University (Middletown, CT)", "Interview Descriptions": "The process took weeks. First there were several rounds of phone interviews and then I was finally brought in for a long day of meetings with groups of 3 or 4 at a time. The day ended with a meeting with e VP which lasted about 15 mins. Along with the this I was asked to do a some multimedia development work and then describe my process to them in an presentation I was asked to do.", "Interview Questions": "How did you build this application"}, {"date": "27 May 2015", "title": "Summer Community Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Wesleyan University", "Interview Descriptions": "Only one interview. Just regular RA interview questions. 2 interviewers were the residential life office members. The interview was around 30 minutes, and the whole process was pretty relaxing. However, it took quite a long time to get the offer. You had to always contact them about it.", "Interview Questions": "In such occasion, what would you do."}, {"date": "15 Mar 2019", "title": "Project Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Wesleyan University in Apr 2015", "Interview Descriptions": "It was a good process . There was a lot of group interviews. I had to go to three groups first the head of the facilities department then to the head of the money management department then at the end a group interview with everyone i will be working with.", "Interview Questions": "They Asked about past experience"}, {"date": "10 Mar 2016", "title": "Book Lab Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Wesleyan University (Middletown, CT) in Mar 2015", "Interview Descriptions": "Was asked about prior experience in the field and was given a series of dexterity tests to see if I was capable. Included paper folding, paper cutting, and tactile aptitude tests. Was also given a tour of the facilities and asked to read over and learn relevant materials that had been put in the lab for the purpose of interviews. All in all a great experience. Other people there were very nice and so was the person conducting the interview.", "Interview Questions": "Asked if I had prior experience in paper/book mending."}, {"date": "14 Oct 2015", "title": "Program Director Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Wesleyan University (Middletown, CT) in Feb 2015", "Interview Descriptions": "It was your standard interview process. I submitted my application online. It was accepted and followed my a phone interview about a month later. I was then invited for an on campus interview where I was able to meet with current staff and students to discuss the position and tour the campus.", "Interview Questions": "What were my views on Greek organizations"}, {"date": "21 Feb 2017", "title": "Book Lab Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Wesleyan University (Middletown, CT) in Sept 2014", "Interview Descriptions": "Met in person to check manual dexterity. Included building a hexagonal shape, checking to see if you can feel grain of the paper, and cutting a letter paper in half. Asked questions about previous book arts experiences, and whether I had other labor skills like woodwork. After that, I was hired. It was not an official interview with Wesleyan University--just a one on one with the head conservator so my point of view might be unusual.", "Interview Questions": "What experience do you have working in a lab"}, {"date": "5 Feb 2016", "title": "Visiting Assistant Professor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Wesleyan University (Middletown, CT) in May 2014", "Interview Descriptions": "I had to prepare a typical classroom presentation for an introductory class at Wesleyan. I was interrupted during the interview process and received a lengthy lecture to inform me that Wesleyan students are  \"brilliant.\" I was told to repeat the lecture in a tone that was more appropriate for the \"brilliant\" Wesleyan students.", "Interview Questions": "I was asked questions related to the topic I presented."}], [{"date": "21 Jan 2017", "title": "Student Videographer/Editor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Wesleyan University (Middletown, CT) in Sept 2013", "Interview Descriptions": "I had a single, relatively brief and informal interview with the three people who would become my supervisors. They were mostly interested in confirming my relevant prior experience (knowledge of cameras and editing software) and my availability for working during the semester. I was asked to identify and demonstrate knowledge of several pieces of equipment, and asked to elaborate on past video projects.", "Interview Questions": "What prior experience do you have with filming and editing?"}, {"date": "13 Mar 2013", "title": "Professor Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 8 months. I interviewed at Wesleyan University (Middletown, CT)", "Interview Descriptions": "I won't give away what dept. I was interviewing for, but this job offer came with many red flags . The first issue was their application was over a year with incorrect dates, but I applied anyway figuring it was an HR mistake. I got a call months later (about 7), with a surprise interview and they wanted me there within an hour. (zero prep time). Again, I gave them the benefit of the doubt.  This was with the team leader for the dept. The next was with the dept. head. and the dean. This is where I absolutely drew the line. Though I was offered the position, One was in jeans and ripped shirt, while the dean Smoked throughout the entire interview! Obviously, this is not the group I wanted to work with. I feel sorry for the kids.", "Interview Questions": "What do you think about working in a gender minority environment"}, {"date": "1 Dec 2015", "title": "IMS Media Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Wesleyan University (Middletown, CT) in Sept 2011", "Interview Descriptions": "I turned in my resume and the HR manager contacted me through e-mail to set up an interview. The first interview was around 15 minutes long and with three upper level managers. The second interview was a brief meeting with the professional staff. Overall experience was positive, I just wished the HR manager kept me more updated with their deadlines.", "Interview Questions": "Do you have previous experience working with computers, cables, and other hardware?"}, {"date": "27 May 2011", "title": "Classroom Support Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Wesleyan University (Middletown, CT) in Feb 2010", "Interview Descriptions": "Jr. Tech Specialist and an HR rep interviewed me, and asked me some basic questions about my qualifications", "Interview Questions": "What is one of your pet peeves?"}]]