[[{"date": "16 Feb 2023", "title": "Visitor Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at English Heritage", "Interview Descriptions": "One face-to-face interview: 10mins to read the guidebook and try to sell it to the interviewers. Ask questions about your previous experience. Give more information about the role. Ask about your availability as this is a part-time job.", "Interview Questions": "1. A time you've met a difficult customer 2. How to make the site more accessible?"}, {"date": "28 Jun 2023", "title": "Volunteer Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at English Heritage (Cowes, Isle of Wight, South East England, England) in Jan 2023", "Interview Descriptions": "Despite it being an unsuccessful interview I thought it was professional and friendly. My only negative point would be that response time in hearing back was delayed and I was also told twice that I wasn't successful, so it felt like wires were crossed somewhere along the line.", "Interview Questions": "What experience do you have of managing volunteers?"}, {"date": "22 May 2022", "title": "Food and Beverage Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at English Heritage", "Interview Descriptions": "Café manager and site manager lead the interview, and asked questions from a booklet that were specific to the role as well as English Heritage’s ethos. Not too intense and quite informal.", "Interview Questions": "(Along the lines of) what can you bring to our customers to improve their experience of our site?"}, {"date": "13 May 2022", "title": "Facilities Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at English Heritage", "Interview Descriptions": "Two people interviewing, nine questions about selling, teamwork, general skills. \r\nInterviewed about twenty people for two roles which seemed excessive. Was waiting half hour for interview as they were delayed.", "Interview Questions": "Describe a time you've worked well in a team "}, {"date": "23 Mar 2022", "title": "Visitor Services Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at English Heritage", "Interview Descriptions": "Two interviewers who went through the skills and experience needed for the role. They asked me to give examples of when I had done each thing e.g. give an example of when you managed a difficult situation.", "Interview Questions": "What would you say are a visitors main hopes when visiting a property? "}, {"date": "21 Mar 2022", "title": "Visitor Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at English Heritage", "Interview Descriptions": "Took place at a busy recruitment fair. Relatively informal setting with 2 interviewers and a trainee following a formulaic set of questions and taking notes. Turned into an enjoyable conversation.", "Interview Questions": "Describe a situation where you've felt under pressure"}, {"date": "28 Mar 2022", "title": "Visitor Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at English Heritage (London, England) in Mar 2022", "Interview Descriptions": "The interview lasted 75 minutes. The panel was made of two persons, kind and friendly. I was told by email to prepare a 10 minutes presentation about a topic of my choice.  Then the interview went ahead for another hour.", "Interview Questions": "Teamwork.\r\nAbout a time when you faced a difficult customer/visitor.\r\nAbout your retail skills.\r\n"}, {"date": "2 Feb 2022", "title": "Historic Property Steward Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at English Heritage", "Interview Descriptions": "Very enjoyable, with no unexpected question. It allowed me to promote the best version of myself to the interviewer, which in turn let me remain calm and relaxed. The interviewer was very pleasant, provided me with ample information and was helpful throughout.", "Interview Questions": "Describe a time you have worked with someone difficult?"}, {"date": "6 Dec 2021", "title": "HR Advisor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at English Heritage", "Interview Descriptions": "No expected interview date was highlighted on the job advert, or whether in person or online. \nEventually found out it was in person, but was accommodated to complete online as I was away, which was very helpful.\nPanel interview with a variety of questions followed by a task with another panel. \nBoth panels seemed very nice and welcoming. \nQuestions were very varied, from employment law to client relations. \nI will note two things: firstly, the questions seemed slightly geared towards someone who was already working in the organisation in their specificity.\nSecondly, I declared a disability in my application but was never contacted about accommodations.", "Interview Questions": "Describe when a HR decision you were involved in went against the wishes of the client, and how this was resolved?"}, {"date": "31 Jul 2021", "title": "Historic Property Steward Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at English Heritage in Jul 2021", "Interview Descriptions": "Was invited to interview after an online application process. Part one of the interview was a short roleplay related to selling gift shop items,  followed by a second part consisting of a more standard interview.", "Interview Questions": "How would you help a disabled person explore our site?  "}], [{"date": "23 Feb 2020", "title": "Seasonal Team Member Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at English Heritage", "Interview Descriptions": "They want to know about you because the job doesn't suit everyone, needs a lot of energy and confidence, bring examples of relevant expirience for the role. The interview involves coming up with an activity for children and young people, as well as how you would plan execute and manage a day if activities", "Interview Questions": "Come up with a creative activity"}, {"date": "1 Mar 2020", "title": "Catering Assistant Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at English Heritage (Silsoe, England) in Feb 2020", "Interview Descriptions": "A few questions to fill in online, along with some longer length competency questions. Once they'd reviewed this they send you the longer online stuff to fill in such as employment history and education. Then asked to come in for an interview. The interview was more like a chat about why you want job and when you can work. Invited in for trial shift after that.", "Interview Questions": "Why do you want this job?"}, {"date": "15 Aug 2019", "title": "Chef Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at English Heritage (Bedford, England)", "Interview Descriptions": "easy, straight forward process, however they asked about my disability and still hired me for the job knowing i wouldn't be able to do it, then forced me out based on the fact they could get someone else in. 100% discrimination", "Interview Questions": "my experience "}, {"date": "8 Feb 2020", "title": "Catering Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at English Heritage (Camelford, England) in Aug 2019", "Interview Descriptions": "I  was asked questions about previous experience and working hours, If I have done food safety requirements and HACCP tests and was explained what my role would be at the work location.", "Interview Questions": "If I have done certain food safety tests."}, {"date": "11 Jan 2022", "title": "Customer Assistant Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at English Heritage (Dover, England) in Jun 2019", "Interview Descriptions": "Interview involved a group exercise, set under specific rules whilst being monitored by EH staff. Candidates were also asked to pick two items that are on sale from the gift shop. Then candidates were interviewed individually and asked to give sales pitches to interviewers", "Interview Questions": "Role play selling items from the gift shop"}, {"date": "9 Apr 2019", "title": "Historic Property Steward Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at English Heritage (Berwick-Upon-Tweed, England) in Mar 2019", "Interview Descriptions": "Interviewed by 2 people. Interview was 30 mins long and was based mostly on the application questions. A lot of focus on selling and sales and not much emphasis on History. \r\nI was sitting between the shop and the museum on a swivel chair, which was very distracting! Customers wandered into the shop during my interview and when I was mid flow, my interviewer held up his hand and said 'hold on a minute'. Not really interested in my questions at the end as he said the interview had finished! I think this was because the next candidate had arrived.", "Interview Questions": "Here is the guide book. We'll give you 5 minutes, then sell it to us!"}, {"date": "17 Feb 2019", "title": "Historic Property Steward Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at English Heritage", "Interview Descriptions": "Interview took at least two and half hours when it could easily have been done in one hour.  There was a lot of unnecessary  waiting around.  There were six of us and we were put in a room with a basket full of English Heritage products.  We were given no clear instructions and didn't know what we were supposed to do.  We discussed the items and came up with ways to sell them.  Then we were watched by numerous interviewers as we did a group problem solving activity.  We were each given a clue and we had to work out as a team which farmer had the apples and which farmer had the truck.  Then we had individual interviews where we did a sales pitch followed by the usual standard questions.", "Interview Questions": "Why do you want to work for English Heritage? (I was so fed up with waiting around that I almost lost the will to live and couldn't wait to get home as the interview had sort of started around 11am and it was past 1pm)  H(again standard question but for some reason I didn't have a clue how to answer) "}, {"date": "14 Feb 2019", "title": "Historic Property Steward Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at English Heritage", "Interview Descriptions": "Relatively simple questions on the online form such as giving an example of a time that I provided or received excellent service, before going to interview at the site I applied to.", "Interview Questions": "Tell us about a time when you've had to follow set guidelines and/or instructions."}, {"date": "7 Feb 2019", "title": "Site Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at English Heritage (London, England)", "Interview Descriptions": "I was selected for an interview with 3 days notice so I had to decline. The position would have required relocation so I would have had to take a full day with the travelling for the assessment and another full day for the interview the following week. I was advised they would be in touch to reschedule but they never did. \nHonestly. If you are interviewing candidates of a certain grade you would expect to be offered more than 3 days notice. Really disappointed and put me off applying again.", "Interview Questions": "N/A"}, {"date": "11 Mar 2019", "title": "Historic Property Steward Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at English Heritage (Dover, England) in Feb 2019", "Interview Descriptions": "A group task, product sales pitch, and an interview. The process was generally a positive experience, however I received no further feedback regarding my unsuccessful application (even after requesting some with a follow up email).", "Interview Questions": "Give an example of how you have dealt with conflict in the workplace"}], [{"date": "19 Dec 2018", "title": "Administrative Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at English Heritage", "Interview Descriptions": "Good hiring and interivew and fairly straight forwad.  Positive response following interview at English Heritage and no negative feedback relating to the actual interivew itself.  Would be an interesting company to work for.", "Interview Questions": "Good selection of interivew questions"}, {"date": "22 Sept 2018", "title": "Steward Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at English Heritage (London, England) in Sept 2018", "Interview Descriptions": "Interviewed by 2 EH staff for a historic property steward role. OK interview, lack of focus on the history and contents of the building, which is surely why someone would want to work there. Seemed more interested in how I could raise revenue for the company. Sadly it was another tick box exercise in fulfilling the requirements  on paper, rather then looking at the individual in  front of them, and how their job experience was valid. \r\nPoor communication, I emailed after 5 days to see how it was progressing, only to have to wait another 5 days to hear back from the member of EH staff who interviewed me to learn I had been unsuccessful, no feedback was offered, so I enquired whether this was possible to help with application forms such as this. Eventually they got back to me with feedback, reason being that I hadn't been successful was due to my lack of 'till and tourism' experience, which is frankly insulting, when I have over 4 years experience in customer facing hospitality & significant cash handling. To conclude, the whole experience left a very bad impression of the company as a whole.", "Interview Questions": "Why do you want to work at EH"}, {"date": "15 Aug 2018", "title": "Properties Historian Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at English Heritage (London, England)", "Interview Descriptions": "Interview lasting roughly an hour with a three-person panel.  Starts with a general question about yourself and how your experience relates to the job as an ice-breaker before going into situational questions to test how you respond to a situation. Closes by inviting you to ask questions.", "Interview Questions": "Tell us about your experience and how it relates to the role?"}, {"date": "12 Jul 2018", "title": "Historic Property Steward Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at English Heritage", "Interview Descriptions": "Applied online, heard back after a couple of weeks. Invited for an interview online. \r\nInterview was simple enough, just generic questions about customer service and why did you apply to english heritage.", "Interview Questions": "Why English Heritage? Why this position? \r\nTake me through the process of how you would make a sale."}, {"date": "29 Sept 2018", "title": "Historic Property Steward Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at English Heritage (Northampton, England) in Jun 2018", "Interview Descriptions": "After successful application, a small interview in an informal style usually at the site of the position. Very easy and pleasant as you are able to learn more about the job role and what it entails as well as answering a range of situational questions.", "Interview Questions": "What would you do if a member of the public brought an unauthorised pet on site. "}, {"date": "14 Mar 2021", "title": "Historic Properties Steward Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at English Heritage (Portchester, England) in Feb 2018", "Interview Descriptions": "It was an interview day with around six other people being interviewed. It was a three-part process: teamwork skills with the other interviewees, a sales exercise, then the standard competency-based questions.", "Interview Questions": "Explain a time when you had to deal with a challenging situation. "}, {"date": "11 Feb 2018", "title": "Digital Marketing Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through a staffing agency. The process took 3 days. I interviewed at English Heritage (Swindon, Wiltshire, South West England, England) in Jan 2018", "Interview Descriptions": "Applied through a recruitment agency, first stage was a telephone interview. Following that I was asked to attend an in-person interview and to prepare a presentation giving an in-depth look at the performance of one of their properties. There was also a written test to assess SQL skills and knowledge of Google Analytics and other digital analytics tools such as regular expressions (regex).\r\nIn the end I wasn't extended an offer - feedback was that they are planning a restructure in April and they plan to split this role into two roles instead.", "Interview Questions": "What is the most exciting digital insight you've encountered in your current role?\r\nWhat do you do when you don't know how to approach a task?\r\nCan you work effectively on your own?\r\nDescribe a time you brought about a significant change at your current role? How did you do it? What benefit did it bring?\r\n"}, {"date": "22 Jul 2017", "title": "Administrator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at English Heritage (Newport, South East England, England) in Jun 2017", "Interview Descriptions": "Two tests.  One was a prioritisation of tasks and the other was to do a response letter to a customer complaint.  Followed by interview with two managers.   Both people were clearly tired of interviewing by the time they saw me.  I got no feedback on the tasks that I carried out.  Their interviewing technique was very inflexible.  There was no opportunity to showcase my ability to to do the job.  I had a portfolio which they declined to look at.  Every question was about dealing with stress.  This would have been a relatively stress free post and so I feel that the questions posed were a little inappropriate.  The role involved was clearly customer service based.  This is an area in which I am fully competent but they did not allow for any diversification from the questions that they had on a sheet of paper.  I feel that the two people doing the interviews were not experienced in getting the best out of their interviewees.", "Interview Questions": "Pretty much every single question was 'how would you cope in this stressful situation?'  'Give me an example of when you encountered this kind of scenario'.  Very rigid  process, no interest in personal skills or personality."}, {"date": "26 May 2017", "title": "Retail Supervisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at English Heritage (Battle, England) in Apr 2017", "Interview Descriptions": "I applied a month before the closing date but didn't hear that  had an interview until 2 weeks after the advert had closed, I was then given 2 days notice and no option as to when my interview was apart from the time.\r\nThe interview itself was fine.\r\nI then was emailed 2 weeks later to be offered a second interview a month later, I had been offered a position with a different company by this point and let them know.\r\nI was then emailed again 2 weeks after being offered a second interview and turning them down , that they would not be taking my application further!\r\nFrankly I don't see how anyone could wait 3 months from first applying to offer which was a shame as I would liked to have worked for them despite the low age.", "Interview Questions": "How would I prepare for big events for over 12,000 people?"}, {"date": "4 Oct 2016", "title": "Ecommerce Assistant Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at English Heritage (Swindon, Wiltshire, South West England, England) in Sept 2016", "Interview Descriptions": "After writing the application I was contacted a week or so later to attend a face to face interview. The interview was with two people and I was asked to answer competency based questions, I was then giving a copy writing task. First impression was okay so I was happy to attend a second interview to which i was invited a few days later. I was asked to complete another test before attending the second interview. Second interview was with the hiring manager and her boss. He made a sexist comment towards me which was unwelcome and inappropriate. I was offered the job but rejected it as the salary was low, long commute and a sexist boss is not acceptable.", "Interview Questions": "What are three essential skills for this job?"}], [{"date": "7 Jul 2019", "title": "Historic Property Steward Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at English Heritage (Birmingham, England) in Mar 2016", "Interview Descriptions": "I recieved an email with a time and date for my interview. It was a basic question and answer interview with various scenarios etc. It was led by the Site Manager and Area Manager. Answers were graded provided you give specific details. It was a fairly comfortable interview process and took about 15 - 30 minutes.", "Interview Questions": "Do you have experience with health and safety? "}, {"date": "26 Feb 2017", "title": "Historic Property Steward Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at English Heritage (Belsay, England) in Feb 2016", "Interview Descriptions": "Advertised position on their website. Lengthy application with questions requiring somewhat of essay length responses. \r\nReceived a phone call inviting me to the interview.\r\nInterview session began with a group of applicants sitting around a large table. I'm sure we were being observed while we engaged with each other. They split the group into two. We played a game where we had to imagine we were in Canada in the winter and needed to survive but had to choose from a list of suggested objects those that would help us in our survival and why. The panel watched how we interacted with each other. After that we pulled out of a bag a stationery object. We then had minutes to come up with a sales pitch to sell it the object to the individual who woul be interviewing us.\r\nThe one-on-one segment of the interview began with the sales pitch and then a more traditional interview process began. Best read through all of English Heritage's documentation on 'access', mission statement, projected goals etc. Always important to have some very well thought out questions prepared.", "Interview Questions": "It was regarding how to respond to a question on accessibility within a site for a disabled person."}, {"date": "28 Jul 2016", "title": "Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at English Heritage (London, England) in Jan 2016", "Interview Descriptions": "Very old fashioned. Not welcoming. Not interested in their core business. Felt like the civil service of the 1950s. Obsessed with process. Competency based questions. Impatient with any questions received.", "Interview Questions": "Give me an example of.... All competency based."}, {"date": "14 Feb 2015", "title": "Historic Property Steward Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at English Heritage (Shrewsbury, England) in Feb 2015", "Interview Descriptions": "Invited to group interview. Lasted 2 & 1/2 hrs. Covered health & safety on site, 1;1 interview, time to study/prep for: a) selling to customers b) dealing with customer complaints, putting together a shop display", "Interview Questions": "Give an example of when you 'went the extra mile' for a customer.."}, {"date": "9 Jan 2018", "title": "Historian Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 8 weeks. I interviewed at English Heritage (London, England) in Jun 2013", "Interview Descriptions": "Great questions relating to the future position, picture test, good opportunity for discussion and to show your personality and ability to think on your feet; responsive and engaged interviewing panel, good an fair grading system", "Interview Questions": "To anayse architectural drawings"}, {"date": "18 Mar 2016", "title": "Historic Properties Steward (Part-time) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at English Heritage (Chollerton, England) in Jun 2013", "Interview Descriptions": "After completing an online application form, I attended an interview on site, where I was interviewed by the site manager and area manager. The interview took about 25 minutes. Questions were based on my experience in working with children and my availability for the role.", "Interview Questions": "As the job involved working with children, I had to show how I would react to a child who was feeling left out of an activity. I had to act and pretend that the child was there in front of the interviews."}, {"date": "18 Feb 2015", "title": "Historic Properties Team Member Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at English Heritage (Bedford, England) in Mar 2011", "Interview Descriptions": "I applied for the position online, was subsequently asked via email to attend an interview, I attended the interview,  but didn't hear anything for weeks on end and assumed I had not been successful, however, I was then contacted to be told that there had been a 'HR error' and immediately received an offer, I accepted the offer.", "Interview Questions": "Describe a situation where you have acted under pressure"}, {"date": "28 May 2012", "title": "Retail Buyer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at English Heritage (Swindon, Gloucestershire, South West England, England) in Feb 2011", "Interview Descriptions": "Two interviews - firstly with direct line manager and then Second interview with Category Director - not really taxing", "Interview Questions": "How would you deal with using only UK based suppliers"}, {"date": "16 May 2014", "title": "Archive Support Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through other source. The process took 4 weeks. I interviewed at English Heritage (Swindon, Wiltshire, South West England, England) in Nov 2010", "Interview Descriptions": "The position was advertised in the local paper but the job description was generic and much more complicated than was actually needed to do the job.  Vacancies are also advertised on the company website and you can register for job alerts.  The application form on line is really good as after you have filled it in for one position you can use it again if applying for another job as your details are remembered.  Interviews may be by a panel of line managers concerned with your particular role.  It is good to do some research prior to interview and it may be possible to go on a tour to find out more about the place where you will be working.  Water is provided at interviews and staff take it in turns to ask questions.  You may need to sit a test for some roles.  People are selected for interview according to their skills experience and appropriate attributes for the role.  A reserve will also be selected in case someone does not turn up.", "Interview Questions": "What is your previous knowledge and experience of English Heritage."}]]