[[{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great development start-up with growing recognition in the development sector", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "13 Dec 2019", "job_title": "Client Facing Employee in Dakar", "duration": "N/A", "pros": "To me, the number one pro are the fantastic colleagues : the organisation is packed with intellectually curious, dedicated and distinctively kind people who deeply care about the world around them. There are other pros: \r\n* A dedication to build a well-oiled organisation: this is a fast growing organisation, and things aren't always perfect, but the Leadership works visibly hard to improve what should be improved on (systems and processes notably). One thing that noticeably improved last year for instance was IDinsight's external comms;\r\n* Real opportunities to build a career: this year, most new Senior Managers,  Associate Directors and Directors came through internal promotions. There are career paths for Economists and Project management roles, and non-PhD holders  can apply for Economist or Junior Economist positions internally;\r\n* As the reputation of the organisation grows, projects are becoming more exciting too (larger scope, more influential partners,  new geographies);  \r\n* Generous benefit package (great health insurance, paid leave): the organisation cares for the well-being of its staff !", "cons": "* The culture is still very much entrepreneurial / start-up, which isn't for everyone;\r\n* As others wrote, work/life balance is nowhere like with management consulting jobs, but these are not 9 to5 jobs. During fieldwork especially,  work days can be long;"}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 0, "Culture & Values": 4, "Diversity and Inclusion": 3, "Career Opportunities": 4, "Compensation and Benefits": 0, "Senior Management": 3, "review_title": "Challenging but Rewarding", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "17 May 2023", "job_title": "Manager in Dakar", "duration": "N/A", "pros": "Great coworkers, interesting work, growth opportunity", "cons": "Understaffed, fast-paced environment, low salary"}]]