[[{"date": "7 Jun 2023", "title": "Resource Development Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at United Way", "Interview Descriptions": "Required 2 interviews. Got interviewed by a total of 5 different people including the CEO. Normal interview questions. It was very friendly. Answered all of my questions with ease. Very professional and seems like a good place to work. Overall very impressed with the interview structure.", "Interview Questions": "Why do I want this job"}, {"date": "30 Mar 2023", "title": "Director, Corporate Relations Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at United Way (Boston, MA)", "Interview Descriptions": "Group interview with the VP and several folks on the CR team. Everyone seemed a bit flustered and the VP eventually logged off in the middle of the interview to take a call. It was not a great experience.", "Interview Questions": "They asked about my current industry so I could make connections if I got the job."}, {"date": "20 Mar 2023", "title": "Director of Community Relations Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at United Way", "Interview Descriptions": "The interview process went pretty smoothly. A phone interview with the President, followed by an in person formal interview. Next, an interview with the team and board members. Then I was offered the job.", "Interview Questions": "How do you work individually and as a team? What does equity look like to you? Describe a time when you were faced with a time demand and how did you meet this deadline?"}, {"date": "8 Jun 2023", "title": "Program Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at United Way in Mar 2023", "Interview Descriptions": "Three interviews: first with HR, second with supervisory team, third with a panel of employees across the organization. Was, overall, unimpressed by HR's lack of organization (showing up late w/o notice to interviews, putting the wrong applicant name on emails, etc.). Although HR stated that they would reach out with a decision a week after the final interview, they never followed up and didn’t respond to multiple follow-up emails. Given that UW is a large and well-established non-profit, I was really thrown by their lack of professionalism and will likely avoid applying to positions with them again.", "Interview Questions": "Tell us about your commitment to diversity, equity, and inclusion."}, {"date": "24 Mar 2023", "title": "Community Schools Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at United Way in Mar 2023", "Interview Descriptions": "I was asked to set up a phone screening a month after submitting my application. I spoke on the phone to a United Way employee for about 15 minutes about the role and my interest. I then had an interview with UW employees and school staff. The interview was rigorous and I was not offered the position.", "Interview Questions": "How does this role contribute to United Way's commitment to equity? What do you need to be successful? What experience do you have with family and community outreach?"}, {"date": "11 Feb 2023", "title": "Benefits Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at United Way (Rocky Hill, CT) in Feb 2023", "Interview Descriptions": "They send me an assessment test with over 60 questions. Then you have 20 math question that need to be finish in 10 minutes and then grammatical question 20 in total to finish in 5 minutes. Next day they email me saying that I will no move in the interview step. It seems I didn’t go well in the assessment question even though I pass the math and grammatical. However it seem they don’t care about your experience but just the fact of you passing ridiculous questions about if you will get persuaded easily. I always have believe those assessments question they give you a score is a waste of time. A lot of people will lie how they will behave at work. You should go by experience and referrals.", "Interview Questions": "Assessment, math and grammatical questions"}, {"date": "9 Mar 2023", "title": "IT Sr Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at United Way (Detroit, MI) in Feb 2023", "Interview Descriptions": "The initial interview is a brief screening with HR. The following interview was with the department manager and an HR representative. The third meeting is with HR, the department manager, and two additional team members. I believe one is a diversity inclusion officer, and the other is someone from another department. Each interview was extremely relaxing. They ask questions about what you know about the company. I would suggest going over the mission statement. They also ask various random questions relating to the position. I would suggest really getting to know the position that you are applying for. Show how you would add value to that team. I did not get selected, however, it wasn’t shocking. I had just returned to town. I had flew out to deal with family emergency and literally had to pull over on the way home to take the call. I missed the flight the day before, and almost missed that flight due to weather delays. It was extremely stressful. I felt like I’d be on the side of the road taking that call, so I was dressed for the camera, however, my mind was way off into my emergency. I should have rescheduled to get an opportunity to clear my mind. I say all of this to say…. If you are dealing with any issues that would throw your interview off, just reschedule. It’s better to go in with a clear mind. I may not have gotten the job anyways, however, I will never know since I canned my last meeting. I do believe that the staff would be an amazing staff to work with. So, give yourself your best shot. Good luck!", "Interview Questions": "What do you know about United Way? Why do you want to work here?"}, {"date": "19 Jan 2023", "title": "Director of Programs Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at United Way", "Interview Descriptions": "Time was set up - arrived early to fill out paperwork and had interview for about 45 minutes. Questions were standard. Interviewed with 2 employees. Heard back within 2 weeks.", "Interview Questions": "Tell us about yourself and your past roles"}, {"date": "14 Jan 2023", "title": "Director Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at United Way", "Interview Descriptions": "The process was efficient all throughout until after the final round I did not hear back. I assume it went to someone else but I think I should have removed a personal notification after the time spent interviewing.", "Interview Questions": "What was your work experience"}, {"date": "10 Feb 2023", "title": "Contracts Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 months. I interviewed at United Way (Los Angeles, CA) in Dec 2022", "Interview Descriptions": "From first call for the interview to the decision date. It was a 2 month process. Do not lay all your eggs in one basket if you are actively seeking other opportunities. -Pre-screening Interview - 15 min - easy -1 interview with Executive - 1 hour Standard interview that went well asking about my abilities and scenarios where I would fill the role -1 interview with Executive - 1 hour Standard interview questions but there was one question the interviewer was not satisfied with my answer and I gave multiple examples and multiple scenarios and it but they continued to re-ask the same question because my answers were too positive -1 interview with Human Resources - 1 hour Went well and connected with interviewer. Asked more about my personality and how I would fit in with the company culture and non-profit.", "Interview Questions": "Name a time where you thought a way to make a process more efficient?"}], [{"date": "6 Dec 2022", "title": "Development Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at United Way (Dallas, TX) in Dec 2022", "Interview Descriptions": "Thirty minute interview with hiring manager with basic questions relating to the job. Hiring manager was very helpful in describing the role and answering questions. Was informed that use of cell phone and personal vehicle required for role.", "Interview Questions": "why are you interested in the role, what do you think you could contribute to the position, etc."}, {"date": "29 Nov 2022", "title": "HR Associate Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at United Way", "Interview Descriptions": "I applied with a resume and was invited to a first interview. I was then offered the opportunity for a followo-up interview. At that point, I was offered the job.", "Interview Questions": "Why are you interested in this position?"}, {"date": "27 Nov 2022", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at United Way", "Interview Descriptions": "Background info, STAR based questions. For example Tell about a time when you had to manage multiple projects and conflicting timeliness. Several rounds of formal interviews and the informal chat with a fee team members", "Interview Questions": "Tell me about a time when you had to manage multiple projects."}, {"date": "27 Nov 2022", "title": "Executive Team Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at United Way", "Interview Descriptions": "I applied online and received an email asking me to interview but also explaining that the salary level was actually lower than advertised. This was a big red flag but I decided to interview anyway for the practice. I had a really nice interview with a senior member of the executive team who promised to get back to me the next week regarding an interview with the Executive Director. Instead they completely ghosted me even after 3 follow up emails asking for an update. Two months later and I still haven’t heard back from them.", "Interview Questions": "How do you stay organized when you’re under pressure?"}, {"date": "22 Nov 2022", "title": "Corporate Relations Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at United Way", "Interview Descriptions": "In person interview with 3 senior representatives. Questions regarding education, background, and how those would be applicable to the position. A detailed overview of the company and job responsibilities is given.", "Interview Questions": "Why are you a good fit?"}, {"date": "3 Nov 2022", "title": "Policy Advocate Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at United Way", "Interview Descriptions": "Applied for a position on their website, and had a phone interview with two people about a week or two later. They loved my resume, experience, and all that. Then they discussed salary. The position was posted with a range of 60-100k find out they lied, the position would only pay in the mid-50s. So if you apply, assume they are lying about pay. Hung up because they are one of the wealthiest nonprofits in the city and I was not interested in taking a pay cut. Bunch of brunch liberals pretending to care about working people.", "Interview Questions": "They asked me about my work experience and questions to see if I would fit their office culture."}, {"date": "2 Nov 2022", "title": "Grants Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at United Way", "Interview Descriptions": "Initial interview with position supervisor followed by another interview with same supervisor plus two weeks others. Asked lots of behavioral questions. One of the interviewers seemed to have unreasonable expectations as she wanted to hire someone who would require “really no training at all” although the position only paid 55-65k.", "Interview Questions": "How do you manage competing deadlines and fast paved environment?"}, {"date": "8 Oct 2022", "title": "Relationship Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at United Way", "Interview Descriptions": "Phone screen with the HR representative was first, then an interview with the hiring manager, then a panel interview, and last a final interview with the department head or CEO.", "Interview Questions": "Experience with fundraising or account management"}, {"date": "10 Sept 2022", "title": "Volunteer Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 2 months. I interviewed at United Way (Asheville, NC)", "Interview Descriptions": "It was a panel interview consisting of two staff members and two volunteers. One of the staff members would have been my supervisor. She keep excusing herself and taking phone calls the entire time... I'm talking every 5 minutes. She was hardly in the room. For someone who was supposed to be interviewing me as a worker for her department in a small business, it didn't make sense - she just did the interview as a favor and let it be known. But could have had the curtesy to at lease listen to me. I could have surprised her.\n\nHer loss. I wouldn't want to work for someone with work ethics like that anyhow. And surprise, surprise - I got ghosted after the interview.", "Interview Questions": "Why do you want to work here?"}, {"date": "27 Sept 2022", "title": "Content Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at United Way (Chicago, IL) in Sept 2022", "Interview Descriptions": "2 zoom calls both with 2 interviewers. They lasted 45 minutes each. the first was with 2 members of the marketing team. The second interview was with the CMO and a client outreach specialist. ", "Interview Questions": "What is one thing you could improve on when it comes to your career"}], [{"date": "19 Aug 2022", "title": "Development Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at United Way", "Interview Descriptions": "Quick to reply to set up interview on Zoom, everyone turned off their cameras during the interview except the interviewee. Very awkward. Very long interview. Said they would call later that week and I never heard from again.", "Interview Questions": "General routine questions designed to feel out candidates"}, {"date": "9 Aug 2022", "title": "Director Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at United Way", "Interview Descriptions": "First round with internal recruiter, then a video call with CEO, HR Director, and another program director. Felt conversational and the interviewers were nice and welcoming. There were planned questions but the conversation was organic and we delved into other topics as well. Org was communicative throughout the process.", "Interview Questions": "Question about working collaboratively across departments. "}, {"date": "20 Jun 2022", "title": "Customer Service Representative Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at United Way", "Interview Descriptions": "Panel interview, lasted over 30 minutes. 4 person from section got the questions before the interview emailed. I enjoyed the process. I felt right away I was not headed to the second interview as some of the interviewers became disengaged.", "Interview Questions": "Why do you want to work here\r\n"}, {"date": "6 Jun 2022", "title": "Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at United Way", "Interview Descriptions": "I found the interview process to be unorganized, difficult to navigate, frustrating, and lacking in transparency.  It was difficult to obtain info on the status of the hiring process and whether I was still in the running.", "Interview Questions": "Your 5 year goals and how this job fit into those"}, {"date": "30 Jun 2022", "title": "Director of Community Relations Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at United Way in Jun 2022", "Interview Descriptions": "Received email for interview request months after application. Interviewed at physical location with CEO and volunteer.  They said it could be a few weeks before they had a decision. I emailed to follow up two weeks later and didn’t get a response back, which I thought was odd because the interview went exceedingly well, and it was communicated they would let me know either way if I would be offered the position. I called another week later and left a voicemail just asking if I could receive a call back to let me know if they had any status updates. I received an email a couple hours later telling me someone else had accepted their offer. I have understanding people are busy, but after being told I would be informed either way, and to be blatantly ignored when I initiated contact twice was not okay in my book. Very disheartening.", "Interview Questions": "Why do you think you would be a good fit? How does your experience and education prepare you for this job? Strengths and weaknesses?"}, {"date": "31 May 2022", "title": "Corporate Engagement Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at United Way", "Interview Descriptions": "the interview process was done over zoom, email, and phone. I only had to do one zoom interview and received a response in a timely manner. a background check was required after being offered the job.", "Interview Questions": "What makes you qualified for this job"}, {"date": "12 Jan 2023", "title": "Researcher Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at United Way (San Jose, CA) in Jun 2022", "Interview Descriptions": "I first had an interview with an HR representative, then on another day I had an interview with the department director, a Partnerships Manager, a Senior Data Manager, and a program analyst. After that second interview, I was assigned a task and I had an hour to present the results. When I presented my analysis I also had another round of questions. After the interview process, I received an email saying I was not selected for the position and there was no feed back.", "Interview Questions": "There were many questions and cannot remember most of them, but one of the questions was about DEI and my attitude toward it"}, {"date": "20 May 2022", "title": "Director of Volunteer Services Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at United Way", "Interview Descriptions": "Three interviews, each with different team members. The process seemed straightforward until it was requested that I attend a fourth interview with other team members.  Process was confusing and employer was not responsive.", "Interview Questions": "They asked me to tell them about myself"}, {"date": "23 Dec 2022", "title": "Project Lead Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at United Way (Bengaluru) in May 2022", "Interview Descriptions": "Telephonic Interview Technical Round - Assignment Presentation of the Assignment In-person interview Interview with the leadership team H R round of interview Offer letter Overall it was interesting and effective hiring process.", "Interview Questions": "Why are you interested work at Unitedway"}, {"date": "26 May 2022", "title": "211 Specialist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at United Way (Orlando, FL) in May 2022", "Interview Descriptions": "A very extensive interview and hiring process.  Many difficult questions to answer throughout the entire hiring process.  Extremely extensive training process as well with a unique mixture of individual.  Very small training group.", "Interview Questions": "How would you handle a suicidal caller"}], [{"date": "2 May 2023", "title": "Food Security Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at United Way (Seattle, WA) in Apr 2022", "Interview Descriptions": "I applied for the position through their career’s page. Someone from HR emailed me to set up a time to interview. Then I did a video call with 4 other panelists where they asked me a series of questions.", "Interview Questions": "Please describe how you have demonstrated your commitment to racial and social justice, using professional or personal experiences, and how would you continue to promote a racially just work culture within your department and the organization?"}, {"date": "8 Mar 2022", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at United Way", "Interview Descriptions": "Went through one stage of interviews with the Manager of the team and it was very conversational and easygoing. Questions weren’t hard or challenging at all. No behavioral questions—just getting to know you questions", "Interview Questions": "Tell us about yourself and why you want to work for United Way"}, {"date": "13 May 2022", "title": "Director, Operations and Corporate Relations Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at United Way (Statesville, NC) in Feb 2022", "Interview Descriptions": "Simple, straightforward interview with a focus on past experience and how that experience would benefit the company if selected. Job description was well defined and explained. Post-interview communication was sorely lacking.", "Interview Questions": "How has your past experience prepared you for this role?"}, {"date": "1 Sept 2022", "title": "Capacity Building & Evaluation Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at United Way (Cincinnati, OH) in Feb 2022", "Interview Descriptions": "I had a phone interview followed by two virtual interviews.  The phone interview was pretty basic first interview kinds of questions.  The second interview went more in depth and for the third interview I was given the questions ahead of time.  I took it upon myself to create a presentation for the third interview.", "Interview Questions": "If you could design the perfect capacity building workshop to help community partners collectively build a systems change focused evaluation plans together (for example if they are working on a shared goal)– what might that look like or what components/ format would be important to a successful workshop?"}, {"date": "13 Nov 2022", "title": "Project Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at United Way (Remo, VA) in Jan 2022", "Interview Descriptions": "Started with phone call from hr. The one in one with hiring manager and then team interview. All virtual. Hr was very friendly. Team call was good, technology hick up made it so we could not see each out.", "Interview Questions": "What is a quality that you have that others don’t?"}, {"date": "23 Dec 2022", "title": "Development Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at United Way (Madison, WI) in Jan 2022", "Interview Descriptions": "I had a phone screen, a Zoom interview and then a Zoom panel. All went extremely well. I had the experience and passion, and a history of volunteering with United Way at my previous employer. I really thought I landed the job. They ghosted me completely, not even an email to tell me I didn't get the role.", "Interview Questions": "They asked me (due to my experience volunteering with United Way) one thing that I'd change."}, {"date": "6 Jan 2022", "title": "Controller Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at United Way (South Burlington, VT) in Jan 2022", "Interview Descriptions": "Two interviews.  One zoom with HR, prospective manager and a potential direct report.  Second was hybrid with the same three as before and three department heads and one board member.  Asked many standard questions, but provided little information about culture and work conditions.  Seemed very cold.", "Interview Questions": "Tell us about a difficult conversation you had.   Tell us about a major project you managed.  How many direct reports did you have.  A few other standard ones.  "}, {"date": "4 Dec 2021", "title": "Program Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at United Way", "Interview Descriptions": "It was simple, initial interview with the team and then HR and the director. They got back to me very quickly with an offer, which I will be accepting. The interview process was done via zoom.", "Interview Questions": "Why do I want the position? "}, {"date": "1 Dec 2021", "title": "Onsite Coodinator Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at United Way", "Interview Descriptions": "There is a HR phone screening, followed by an in-person one-hour meeting with hiring manager to discuss role and team dynamics. Then call back with senior leader and hiring manager. Followed by job offer.", "Interview Questions": "Tell me about a time when..."}, {"date": "24 Nov 2021", "title": "Campaign Manager Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at United Way", "Interview Descriptions": "The interview process was well coordinated and clearly communicated throughout. I had the opportunity to meet with several key people I would be working with and they did a great job of hearing my perspectives and answering my questions", "Interview Questions": "My approach to process development and organization and prioritization of opportunities "}], [{"date": "20 Nov 2021", "title": "Project Coordinator Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at United Way", "Interview Descriptions": "About a week after applying, they called me to set up in person interview. Two people interviewed me, asked pretty basic and standard interview questions. I was able to ask questions in return. They offered me the job within a few days.", "Interview Questions": "What is your relevant experience. \nWhy are you interested in this role"}, {"date": "4 Nov 2021", "title": "Intern Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at United Way", "Interview Descriptions": "Emailed me to interview. Went in for the interview and they asked a lot of questions. Not a lot about the job. Not very friendly. Glad I  didn't get the job.", "Interview Questions": "Tell me about yourself and why you want the job"}, {"date": "7 Jan 2022", "title": "Finance Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at United Way in Nov 2021", "Interview Descriptions": "Applied online was called for an interview after a week. The interview was very relax. Interview lasted over an hour and few of their questions were actually about the job. Was told I would get a call by the end of the week to schedule the second interview (there are three interviews in total). Well the week came to an end and they never call. I called them back and left a message and send an email but never heard back from them. I found out through social media that they had filled the position.  Overall not very professional.", "Interview Questions": "What is something people would not believe about you?"}, {"date": "5 Jan 2022", "title": "Director, Finance Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 months. I interviewed at United Way (Memphis, TN) in Nov 2021", "Interview Descriptions": "The process for such a small company took forever, it was very up and down, and one of the issues they were trying to hire someone to help fix was the culture and complaints/attitudes from the staff. They made an offer and recinded it after stating they were hiring an internal candidate, even though I was told in the initial interview there weren't any internal candidates that qualified. How everything was handled shows the bad culture comes from the top and trickles down. This is an issue that leadership as a whole has allowed to seep into and effect the success of the organization as a whole. There is no \"one person\" that can change this. Happy I dodged this bullet.", "Interview Questions": "What's your methodology with helping, encouraging, and supporting employees in their desire to grow."}, {"date": "6 Aug 2021", "title": "Program Associate Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at United Way", "Interview Descriptions": "Made it to the second round of interviews. The person who was supposed to conduct the second interview was unable to interview me so someone else stood in. Ended up having to reach out to them to get an update after the second interview.", "Interview Questions": "How do you normally go about organizing complex projects?"}, {"date": "17 Mar 2022", "title": "Vice President Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at United Way (New York, NY) in Aug 2021", "Interview Descriptions": "This interview was with the United Way NYC. The process was dreadful from top to bottom. I applied immediately after the position was posted, and received a screening interview immediately. About one week later I was interviewed by two people in the HR department. After this I was ghosted for weeks, and then was shocked to get invited back for another interview. I was on vacation when their HR department reached out about doing another interview, and when it took me longer than a few minutes to reply they reached out by phone as if this interview was somehow urgent. The interview was then scheduled for three weeks into the future. The interview was with a panel of people, none of which work directly with the position being filled. They asked me all kinds of off-topic questions about random things, sometimes even saying they weren't going to judge me by my answers. So why waste all this time with these questions? After this, again weeks went by before I heard from them again. I was then invited for a final round interview and told that I would get a decision the following week. Weeks came and went and I heard nothing. I followed up by email twice with their HR department and was consistently told that the position had not yet been filled and that I was still being considered. After a month, I gave up. It's now been four months and the position still hasn't been filled, I was never notified, and the position is still posted. It's been nearly a year since the position was first posted.", "Interview Questions": "How does your background relate to this position "}, {"date": "13 Oct 2021", "title": "Lead, Community Impact Social Venture Partners Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at United Way in Aug 2021", "Interview Descriptions": "I was invited to two interviews. The first was a screener interview with HR. The second was a full interview (over Zoom) with the program director and person from HR. At that point I was not invited to continue.", "Interview Questions": "Why do you want to work here?"}, {"date": "25 Jul 2021", "title": "Director of Communications Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at United Way", "Interview Descriptions": "The interview and application process was lengthy, but ultimately went smoothly. There seems to be some disorganization within the organization in Connecticut. I would recommend you try to speak to someone to make sure the people you would work with are the best fit.", "Interview Questions": "average questions on background, previous work experience, relevancy"}, {"date": "21 Jul 2021", "title": "Ambassador Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at United Way", "Interview Descriptions": "The interview process was easy and straightforward and lasted no more than 30 minutes. The interviewers are friendly and make the process a breeze.  There are preliminary tests to complete before the interview process.", "Interview Questions": "What are some challenges you have overcome on a previous work setting and how did you overcome them? "}, {"date": "25 Aug 2021", "title": "Program Evaluator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at United Way (Las Vegas, NV) in Jul 2021", "Interview Descriptions": "They seemed disinterested from the start. The questions had little to do with the job and stuck in the 90’s hiring practices. One interviewer was a bit confrontational in approach.", "Interview Questions": "What are three of your strengths. "}], [{"date": "18 Mar 2022", "title": "Rental Assistance Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. The process took 2 weeks. I interviewed at United Way (Riverside, CA) in Jul 2021", "Interview Descriptions": "Very quick. They asked me to discuss my qualifications and experience. There were no follow up questions after. (I was interviewing through a temp agency and eventually got hired on.)", "Interview Questions": "Can you please describe your prior experience to this job?"}, {"date": "28 Jun 2021", "title": "Operations Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at United Way", "Interview Descriptions": "Interview took more of a conversational approach. Interviewer was friendly  and the entire process seemed like it went great to me. However no one got back to me afterwards, even after I had reached out.", "Interview Questions": "1. Why you are the best candidate for the job.\n2. What you know about United Way.\n3. Brief background about yourself."}, {"date": "22 Jun 2021", "title": "Director of Major Gifts Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at United Way (Memphis, TN)", "Interview Descriptions": "I had 4 people who rotated during the  interview process and the final interview was with the CEO. The Initial interview was with the VP off site, discussion of position.", "Interview Questions": "What are your strengths and weaknesses "}, {"date": "18 Jun 2021", "title": "Executive Director, Non-Profit Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 4 days. I interviewed at United Way (Yuba City, CA)", "Interview Descriptions": "Straightforward application process, panel interview. Took about 45 minutes. Questions were standard - no surprises. They seemed more interested in continuing the YSUW trajectory, rather than exploring different ideas. Going into the interview, I knew who some of the applicants were and was not surprised at the selection, as the candidate was very qualified and experienced.", "Interview Questions": "What ideas do you have about adding additional fundraising events to the program? "}, {"date": "20 May 2021", "title": "Account Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at United Way", "Interview Descriptions": "Very professional however a slow process to get through all the rounds. Was interviewed with HR present in all round including hitting manager and executive. From start to finish probably took 3 months.", "Interview Questions": "What was the biggest challenge you experienced?"}, {"date": "7 Jul 2021", "title": "International Finance Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at United Way (Washington, DC) in May 2021", "Interview Descriptions": "The interview process is very smooth and straightforward. The director directly contacts me and offers me an interview. The questions are all basic behavioral questions, noting hard. After the interview, I got the position.", "Interview Questions": "Basic behavioral questions. Describe youself. Why you interested in the company? Why non-profit? "}, {"date": "20 Apr 2021", "title": "Project Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at United Way", "Interview Descriptions": "The interview went well in that it was quick and easy.  I enjoyed speaking with two people at one time who made me feel at ease.  I don't feel that I had enough time to speak about my skills and experience.", "Interview Questions": "Do you think you're a good fit for this position?"}, {"date": "13 Apr 2021", "title": "Partner Engagement Lead Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at United Way", "Interview Descriptions": "I did a phone screening with a really nice HR representative, but the HR team seemed disconnected from the needs and wants of the hiring team. She was really engaged and excited about our interview, I know I was qualified for the role but I never heard from the hiring manager.", "Interview Questions": "How do you handle difficult deadlines?"}, {"date": "12 Apr 2021", "title": "Resource Development Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at United Way", "Interview Descriptions": "I thoroughly enjoyed being interviewed at United Way. They were easy to discuss with and I would be happy to work here one day. I felt if I were selected, I would be well supported by the team and taught everything I needed to know about the ins and outs of the organization.", "Interview Questions": "Their fun question was to ask me about guilty pleasure television "}, {"date": "22 Mar 2021", "title": "Corporate Engagement Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at United Way", "Interview Descriptions": "The First interview was a Team interview, with all members of the team asking questions. A lot to do with sales and how well you network.  Second round included just the Vice President and Associate Director", "Interview Questions": "Tell me about your personal philanthropic interest? "}], [{"date": "18 Mar 2021", "title": "Director, Operations Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at United Way", "Interview Descriptions": "The process took about 3 months from first interview to final offer. Along the way there were multiple interview cycles with long gaps in between including 5 weeks with no information or response and then a job offer which I accepted.", "Interview Questions": "Questions were specific to operations such as managing budgets, timelines, teams. "}, {"date": "15 Mar 2021", "title": "Director of Technology Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at United Way", "Interview Descriptions": "I only had a phone screening interview.  The call went very well,  was told they were excited to talk to me more and would be scheduling interviews at the end of the week. I was not called back. The next week, I emailed for follow-up and was informed they had selected a candidate.", "Interview Questions": "Have you worked with outside service providers?"}, {"date": "4 May 2021", "title": "Database Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at United Way (Halifax, NS) in Mar 2021", "Interview Descriptions": "Interview was conducted online via MS Teams. The interview atmosphere was not stressful or intense. The interviewers were very casual and relaxed. The interview was short at about 20 minutes.", "Interview Questions": "Describe a time when you changed the way you approach something and how it turned out."}, {"date": "24 Feb 2021", "title": "Donor Relations Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at United Way", "Interview Descriptions": "A phone interview was first then I had three in person interviews. The phone interview was with HR, the first in person was with my manager along with another manager, then a group interview with the whole team, then an interview with an AVP. There was also a skills based test on a computer that dealt with responding to a donor and a simple math test.", "Interview Questions": "Why are you interested in United Way?\nAre you detailed oriented?"}, {"date": "8 Feb 2021", "title": "Project Manager Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at United Way", "Interview Descriptions": "what is your role in the job and why you like it. is there any problems in your previous jobs. you have any problems with working with a team or group of people", "Interview Questions": "what is your role in the job"}, {"date": "5 Feb 2021", "title": "Development Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at United Way", "Interview Descriptions": "Was a pretty short process and well communicated information shared before and after which made it clear and concise which I appreciated a lot, the manager was really nice and patient and communicative", "Interview Questions": "Describe your experience with donor data"}, {"date": "13 Feb 2021", "title": "Volunteer Engagement Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at United Way in Jan 2021", "Interview Descriptions": "One interview by phone (no video), and then a second interview on zoom. I was told during the second interview that there was a third interview, and specifically that I would be told either way of the team's decision on whether I would move forward the next day. After following up twice for two weeks after the interview, I never heard back. I wouldn't have been so offended if I hadn't gone through multiple rounds of interviews already and if they hadn't EXPLICITLY told me they would get back to me either way. How can you claim to support the needs of the people in your community well when you can't even find the time to send a two-line email explaining that you're moving forward with a different candidate?", "Interview Questions": "What is one time that you've experienced failure?"}, {"date": "20 Dec 2020", "title": "Marketing Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. I interviewed at United Way (Denver, CO) in Dec 2020", "Interview Descriptions": "Because of COVID it was through zoom. It went really good and it was easy to talk to the person. Very kind and makes you feel comfortable. It's a great place to get involved and learn.", "Interview Questions": "How would your involvement help the community?"}, {"date": "13 Jun 2023", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at United Way (Alexandria, VA) in Nov 2020", "Interview Descriptions": "I applied online where I filled out an application and wrote a short response outlining my interest in working here. I was later reached out to for an interview over Microsoft Teams, then received information about completing a background check followed by an offer.", "Interview Questions": "What skills will you be able to bring to this position?"}, {"date": "24 Nov 2020", "title": "Intern Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at United Way in Nov 2020", "Interview Descriptions": "A week after applying, I was emailed asking if I could set up a Zoom interview. It wasn’t a bad interview, but I felt that the interviewer could have been more professional. The interviewer showed up to the Zoom a few minutes late, very disheveled. The questions were laid back, although it felt like they were coming off the top of the interviewer’s head. In the end, the interviewer took no time to email me back about whether they denied or accepted me, so ultimately I chose to accept a different internship. \r\nAnother note: I do wish these internships were paid, but it’s no surprise that a non-profit can use the social values tied to their interns as a way to excuse a lack of pay.", "Interview Questions": "What do you hope to gain/learn from this internship?"}], [{"date": "26 Oct 2020", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at United Way", "Interview Descriptions": "I had a phone interview due to the pandemic where I was  asked about my prior work expereince and why I wanted this position and what I hoped to learn from it.", "Interview Questions": "Why do you want this job?"}, {"date": "21 Oct 2020", "title": "Marketing Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at United Way", "Interview Descriptions": "This was a  Zoom phone interview. The interview itself was a little bit awkward. I felt like it was more a Q&A than a fluid discussion- which is what I think a good job interview should be.", "Interview Questions": "Tell us about your past marketing campaign process"}, {"date": "13 Jan 2021", "title": "Corporate Relations Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at United Way (Irvine, CA) in Oct 2020", "Interview Descriptions": "The interview process was fairly straightforward with 2 rounds of online video interviews. The first was a group interview with the team and the second was an interview with the director. Both were around 45-60 minutes.", "Interview Questions": "Why are you interested in working at the United Way?"}, {"date": "21 Sept 2020", "title": "Public Policy and Advocacy Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at United Way", "Interview Descriptions": "The interview went fine, it was a little more casual than I expected.  It was a little awkward because it was online due to COVID-19, but that is not the fault of interviewer.", "Interview Questions": "They asked about past experiences with policy work and GOTV efforts. "}, {"date": "15 Aug 2020", "title": "Change Network Facilitator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at United Way", "Interview Descriptions": "Group interview with three program staff and one HR person. Each staff person took a turn asking me a question from their list of questions. In the end, I didn't get a lot of feedback on how well they thought I did in the interview. But I was told that this was a first round interview and that if chosen to go on to the second round, then I would interview with the Director.", "Interview Questions": "Tell us what United Way's Mission Statement is in your own words and how you would explain it to other people. "}, {"date": "8 Aug 2020", "title": "Chief Operating Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at United Way", "Interview Descriptions": "3 interviews.  4 staff on last interview for 1 hour.  Zoom interview on COVID.  Interviewers were too far from camera and difficult to hear at times.  Nice people, very professional.", "Interview Questions": "Past history,  Poor question on what I thought the job entails vice them telling me."}, {"date": "20 Jan 2021", "title": "Customer Service Representative Projects Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at United Way (London, England) in Jul 2020", "Interview Descriptions": "The interview process was long, even with the COVID pandemic. There were also 4 rounds of interviews despite this being just a part-time, low-paid role. On the first interview, the interviewer actually forgot about our meeting. I had to wait for her to call me back later.", "Interview Questions": "Deliver a presentation on a project or event you managed."}, {"date": "4 Sept 2022", "title": "IT Business Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at United Way (Portland, OR) in Jul 2020", "Interview Descriptions": "Weel organized and instructions were clear.  \nRecieved a list of topics 30 minutes before the interview and was allowed to write notes inpreparation for the interview.  When questions were asked they all related to the topic list I was given.", "Interview Questions": "If I were to go on vacation would you provide coverage for me going above beyond your job description"}, {"date": "15 Jun 2020", "title": "Loaned Executive Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at United Way", "Interview Descriptions": "Brief phone call to schedule an in person interview, then the in-person interview was held by a relationship manager who asked a few questions and interview lasted for about 30 minutes", "Interview Questions": "Tell me about your resume\r\nWhat do you know about United Way?"}, {"date": "6 Dec 2021", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at United Way (Washington, DC) in Jun 2020", "Interview Descriptions": "The interview process was straightforward and quick. They asked about my interests and my studies as well as questions about previous projects I've worked on.  It took about 30 minutes and my interviewer was my supervisor.", "Interview Questions": "What are your long term goals?\nWhat have you studied?\nWhat is your availability?\nWhy United Way?\n"}], [{"date": "27 Jul 2020", "title": "Influencer Marketing Intern Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at United Way in Jun 2020", "Interview Descriptions": "I applied over the weekend and got an email Monday morning to set up an interview. I had a half hour interview on Zoom the next day with the director of the department. \r\n\r\nHere's my issue. I was specifically told that I would find out if I didn't get an offer for the position. However, after following up with the person I interviewed with twice, I still have been ghosted by the company. It is very unprofessional to leave a candidate hanging after they have taken the time to fill out an application, prepare for an interview, and interview. It takes thirty seconds to send an email saying \"Unfortunately, we decided to proceed with another candidate but appreciate you taking the time to speak with us and wish you the best.\" I greatly admire the work that United Way does, but based on this experience, I wouldn't apply to work there again. By ghosting me after my interview, it tells me that they do not value my time or have any respect for their candidates by not letting them know they were rejected.", "Interview Questions": "Tell me about yourself. "}, {"date": "24 Oct 2020", "title": "Business Analyst Intern Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at United Way in Jun 2020", "Interview Descriptions": "I wasn't informed whether it's going to be HR or technical interview.  I have prepared myself for HR and they asked technical as well. They have taken very long time to reply back and haven't given any feedback.", "Interview Questions": "Describe your Excel ability (intermediate/beginner)?"}, {"date": "24 Jun 2020", "title": "Community Impact Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at United Way in May 2020", "Interview Descriptions": "I applied online, had a phone screen, then an in-person interview with Executive, then individual meetings with board members.  Because of COVID it was mostly through zoom. It was a long process but I can understand why it was like that.", "Interview Questions": "Why United way?"}, {"date": "25 Apr 2020", "title": "Program Manager Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at United Way in Feb 2020", "Interview Descriptions": "Interview was very disorganized and whole proc.ess took place on telephone. initial round of GD followed telephonic interview and in the end final round of interview.r based on your final interview you will offered or will get rejected.  Generally HR interacts while following up the results.", "Interview Questions": "How you will contribute in your role with the help of academic knowledge that you have gathered ?"}, {"date": "15 Jan 2020", "title": "211 Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at United Way (Orlando, FL)", "Interview Descriptions": "Very easy. Straight forward questions. Interviewed by the Assistant director \r\nWritten empathy test used to determine your range of empathy.\r\nMost difficult part was the suicide role play. This was used to determine your suicide assessment skills.", "Interview Questions": "Why do you want this job? "}, {"date": "3 Mar 2020", "title": "Community Relations Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at United Way (Dayton, OH) in Jan 2020", "Interview Descriptions": "Good first phone interview and within a week scheduled for an in person interview for two weeks later. Met with 3 individuals, one who would be my direct supervisor. Pretty typical behavioral question roundtable. Took about 45 minutes total. I was prepared with my portfolio and questions for the team. Overall a positive interview experience. \r\n\r\nI was told there were five final candidates and all would be interviewed over the next week and I would hear back by the 10th of the month. At this point I believe I’ve been ghosted by the HR department. I sent follow-up thank you cards, but nothing from the company. I really think this is bad practice from such a reputable company that I donate to from every paycheck currently.", "Interview Questions": "Tell us about a time you had a bad coworker who caused issue for you, and how did you resolve the situation."}, {"date": "6 Dec 2019", "title": "Executive Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at United Way", "Interview Descriptions": "Very straight forward the interviewer mentioned there would be multiple interviews in the process but seemed pleased with what she saw. They said they will reach out within a few days with a verdict", "Interview Questions": "What are your benefits ?"}, {"date": "14 Oct 2019", "title": "Site Manager Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at United Way (Seattle, WA)", "Interview Descriptions": "Three employees heading three departments all related to the project. All seem to be very new hires and not very experienced in interviewing. I was ready - they hemmed and hawed...didn't go through my resume'!  A few behavioral questions - not a lot of thought went into their interview questions.", "Interview Questions": "What would you do to handle an angry..yada, yada."}, {"date": "9 Oct 2019", "title": "Service Champion Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at United Way", "Interview Descriptions": "Simple conversation. The lady was kind and very straightforward. Also you will file another application at this time. Not much too say to be honesty. \r\n\r\nSimple conversation. The lady was kind and very straightforward. Also you will file another application at this time. Not much too say to be honesty.", "Interview Questions": "Why you want to work for the program?"}, {"date": "23 Oct 2019", "title": "Care Navagator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at United Way (Cleveland, OH) in Oct 2019", "Interview Descriptions": "Found the job online on Indeed and applied. First time application. About a week later I was scheduled for a 30 minute phone interview with the HR department as an inicial phone screening.", "Interview Questions": "What is your strengths and weaknesses?"}], [{"date": "30 Sept 2019", "title": "Information Specialist Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at United Way", "Interview Descriptions": "The interview process is a multi-stage process for hiring new employees. The interview process typically includes the following steps: writing a job description, posting a job, scheduling interviews, conducting preliminary interviews, conducting in-person interviews, following up", "Interview Questions": "What is my weakness"}, {"date": "16 Sept 2019", "title": "Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 3 weeks. I interviewed at United Way (New York, NY)", "Interview Descriptions": "Had 3 interviews and then didn't hear back, despite following up twice. It was a pleasant process until then, but I was really surprised by the radio silence even after I tried several times to just get a quick email response of yes or no.", "Interview Questions": "Why do you want to work here?"}, {"date": "11 Nov 2019", "title": "Volunteer Coordinator Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at United Way (North Charleston, SC) in Sept 2019", "Interview Descriptions": "After applying online and submitting my cover letter and resume I received a call from HR first, then the hiring supervisor.  After the calls, I was asked to attend the first interview. Both the HR manager and hiring supervisor were present during the initial interview.", "Interview Questions": "Describe a time to were in a stressful situation and how you chose to handle it."}, {"date": "5 Sept 2019", "title": "Corporate Engagement Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at United Way (Chicago, IL) in Aug 2019", "Interview Descriptions": "Got called for a phone interview one month after applying online via their application process.  Phone interview took about 20 minutes asking me about myself, why I want this role, how did I hear about them. One week later asked to come in for an in-person interview.", "Interview Questions": "Describe your communication style"}, {"date": "29 Oct 2019", "title": "Campaign Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at United Way (Greensboro, NC) in Aug 2019", "Interview Descriptions": "The interview process was very professional but still made you comfortable. Nothing intimidating. The interview made me learn a lot individually and about United Way. I was grateful for the experience. First, I spoke on the phone and had an interview. The second round was with a panel of individuals that worked at that location.", "Interview Questions": "How could you contribute to United Way?"}, {"date": "4 Feb 2020", "title": "Grants Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at United Way (Los Angeles, CA) in Jul 2019", "Interview Descriptions": "Very informative and thoughtful interview process, with a somewhat intense behavioral that one of the HR associates informed me about beforehand. After about an hour of behavior questions, I interviewed with a separate HR associate about cultural fit, which was also comfortable and very professional.", "Interview Questions": "If someone were to ask to be involved with a project you knew they would deride, how could you politely reject their offer to help or contribute? "}, {"date": "23 Jul 2019", "title": "Fellow Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at United Way (Dallas, TX) in Jul 2019", "Interview Descriptions": "Sent my resume in online, they set up a quick phone interview (15 mins) within a week of submitting my application, then they set up a 30 minute panel interview within a few days of the call interview.", "Interview Questions": "What experience do you have with research?"}, {"date": "3 Jun 2019", "title": "Community Impact Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at United Way", "Interview Descriptions": "Got called within a week and was called in for an interview. The interview was very straightforward, was asked a few random questions like \"What color crayon would you consider yourself if you had to pick\" but it was more conversational and very casual. Received a tour right after of the facility. Overall easy experience", "Interview Questions": "What color crayon would you consider yourself if you had to pick?"}, {"date": "29 May 2019", "title": "Manager, Community Impact Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at United Way (Vienna, VA)", "Interview Descriptions": "I was first contacted by a HR recruiter and had my phone screening scheduled.  She was late to the call and was unprepared.   She wasn't sure if I had to call her or if she was supposed to call me but that wasn't an issue.  She then scrambled to get my files open to start the screening and began describing the wrong person.  I let her know that it was not my resume.  She was able to only answer limited questions I had about the position so I saved them for the hiring manager. \r\n\r\nI was later scheduled to do an in person interview with 4-6 management personnel (including the hiring manager) but I never made it to the actual interview because 2 hours before my 1.5 hour panel interview, the HR recruiter canceled all of the interviews via email without any explanation.   I felt that cancelling all of the interviews that close to the scheduled time and not receiving at least a  personal phone call was very unprofessional to say the least.  When I further asked the HR recruiter what happened and why they were all cancelled she was unable to explain as she was out of the loop and suggested that I contact the VP, HR directly, someone who I had never spoken to before.  I did email the VP, HR and did not get any response, which was also very unprofessional.  I was highly dissapointed with this process and experience.", "Interview Questions": "N/A"}, {"date": "3 Oct 2019", "title": "IT Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at United Way (York, PA) in May 2019", "Interview Descriptions": "Very friendly, emailed me to get in touch, scheduled a skype interview. They asked me a few technical questions based on HTML, CSS, PHP, JavaScript and a few behavioral questions:", "Interview Questions": "They asked me a few technical questions based on HTML, CSS, PHP, JavaScript and a few behavioral questions:\r\n\r\n- Describe an instance of a time when you worked with a group or a team\r\n- What would you say is your best academic achievement\r\n- How would your experience benefit you in this role"}], [{"date": "19 Jul 2021", "title": "Assistant Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 2 weeks. I interviewed at United Way in Mar 2019", "Interview Descriptions": "Very easy going! Many questions in reference to the company as a whole and how one would benefit from employment and how the employer would benefit from your presence. Think a lot about the common strengths and weaknesses question!", "Interview Questions": "Q: Have you been affiliated with United Way before? How so?"}, {"date": "8 May 2019", "title": "Senior Director Corporate Relations Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at United Way in Feb 2019", "Interview Descriptions": "I submitted my application, immediately received a reply to set up an interview over the phone.  Replied to confirm, didn't hear anything back... weird from what I know of this particular UW. To confirm our meeting, I sent  an email the day before our meeting- still, no reply. The morning of my interview I called right away in the morning and left a message  for the contact person, again, to confirm our meeting. Then, 45 minutes AFTER our scheduled time I received a call from a person in HR (not my contact) to apologize for not getting back to me. Apparently, my emails were going to their spam folder.  It was clear she was flustered and scrambling to get settled in to talk with me. During my interview it was clear she hadn't read my cover letter or reviewed my resume. \r\n\r\nI got an email 2 weeks later saying they were not going to hire for the position because they were revamping the development department.", "Interview Questions": "Tell me what you know about United Way"}, {"date": "5 Oct 2020", "title": "Portfolio Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at United Way (Saint Louis, MO) in Feb 2019", "Interview Descriptions": "First step was a phone interview screening, then I had an in person interview. The interview was with four other managers plus the hiring manager. It was fairly informal but filled with lots of questions about how I'd handle certain situations.", "Interview Questions": "How would you handle a grantee that is non-compliant?"}, {"date": "29 Jan 2019", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at United Way", "Interview Descriptions": "phone interview, then in person interview after. it was in the office with the hiring director. asked questions about my past role and how I could use those skills at their company", "Interview Questions": "what are your strengths and weaknesses?"}, {"date": "29 Jun 2019", "title": "Director of Operations Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at United Way (London, England) in Jan 2019", "Interview Descriptions": "Non structured interview, interviewees didn’t seem to know what to say, the CEO seemed very insecure, they did not feel excited about the role. Abrupt. They told me\r\nThey would get back to me within 2 days  but took weeks", "Interview Questions": "Why did you apply?"}, {"date": "30 Jan 2019", "title": "Development Associate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. The process took 1 day. I interviewed at United Way (Deer Park, NY) in Jan 2019", "Interview Descriptions": "One in-person interview. Conversation was nice, Development manager was personable, ended on a pleasant note, with her telling me she would be in touch regardless of the decision. A month later, I have not heard back, despite three follow-up emails. I don't mind missing out on the opportunity, but as a person looking for work, I would like to know where I fell short so I can improve. I found it to be very unprofessional.", "Interview Questions": "Why do you want to work for United Way?"}, {"date": "24 Apr 2019", "title": "Community Impact Program Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at United Way (Washington, DC) in Jan 2019", "Interview Descriptions": "Supposedly, there is a three to four step process; phone interview and/or in-person (one on one), panel interview (at least three panelists) and final meeting with the person in charge of the department. \r\n\r\nI traveled about three hours away for the in-person interview and no one followed up with me regarding the final decision for the position. \r\n\r\nEven after I reached out a few times, once via email to show gratitude for the opportunity and receive feedback from the interview directly with the point of contact -- whom I had correspondence with previously-- I called a couple times over a period of two weeks or so,  yet still no response.\r\n\r\nOut of professionalism and representing the organization in a positive view, when it comes to dealing with potential candidates the least one could do, is send an automatic email response \"thank you...however, we have decided to...\" or something to that affect. I was completely turned off with how this organization handled my request and not providing any kind of update, even if something else had  occurred (i.e.  position canceled,  oversight). \r\n\r\nJust beware if you don't hear anything back AFTER you've interviewed, you'll never know what happened! Especially since no one answers the phone and apparently there is only one person that handles calling candidates and setting up interviews.", "Interview Questions": "I honestly can't remember any of the questions asked. I do remember two pages of questions were read and the interviewer did not write one thing down. I am not sure what that was about especially since another candidate came in right after me. There is no way one could remember all my responses...unless the interview was just a protocol and they already someone in mind (hire within the agency) to fill the position."}, {"date": "21 Dec 2018", "title": "Marketing Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1+ week. I interviewed at United Way (Dayton, OH) in Dec 2018", "Interview Descriptions": "I sent in my application via email and received an in person interview not long after. However, the in person interview did not end up working out on their end now I have sent two emails trying to reschedule and they have not replied. Very confused!", "Interview Questions": "What past marketing experience do you have"}, {"date": "2 Nov 2018", "title": "Community Impact Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at United Way", "Interview Descriptions": "Interview was non-existent.  A few months after applying for the job at United Way of Greater Portland Maine, I finally received a rejection letter stating they had found someone with more relevant \"skills and experience\".  Later looked and saw they hired a former volunteer who was just out of college.  I have 15 years of experience working with their relevant communities, and particularly ones in the Portland, with barely a blemish on my resume and impeccable references.  Makes you wonder if the intent of their program is biased considering they hire a kid basically right out of college, and though it pains me to say this, if you look at their staff page only 20% of their staff are male.", "Interview Questions": "N/A"}, {"date": "10 Sept 2018", "title": "Stewardship Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at United Way", "Interview Descriptions": "I applied online. Got an email a couple of days after to set up a 20 min phone interview and was asked to send in writing samples. Next day, received an email stating that HR Coordinator would reach out. HR Coordinator called about a week later set up Skype interview with 4 colleagues. Was also given a writing prompt to send in after the group interview.", "Interview Questions": "What is your writing process? How do you prioritize tasks with different deadlines? How are your excel skills?"}], [{"date": "10 Jun 2019", "title": "Campaign Outreach Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at United Way (Detroit, MI) in Sept 2018", "Interview Descriptions": "The interview process wasn't very difficult. The main difficulty was simply the repetition of documentation, in that I seemed to be restating my experience several times in the process. However, the process was smooth and straight forward for the most part. My interviewers were kind and open, we even laughed quite a bit during the interview. They do an good job of making their interviewees comfortable, making it easier for one to be open and confident in one's dialogue.", "Interview Questions": "What drives you to do your work?"}, {"date": "17 Aug 2018", "title": "Staff Attorney Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at United Way", "Interview Descriptions": "There were 2 levels of interviews. First was a one on one with the General Counsel, which lasted about 45 minutes. The second was a combo of panel and one on one. The HR director and another executive were present.", "Interview Questions": "Traditional interview questions. They wanted to know why I was interested in the United Way. They asked about my past experiences (relating to the legal role, when I had to make tough decisions, how do I work with difficult coworkers).  The executives asked some interesting ethical questions.   The HR questions were very standard office etiquette, integrity, examples of  hypotheticals, etc.     "}, {"date": "13 Aug 2018", "title": "Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at United Way", "Interview Descriptions": "In-person interview where you get asked basic questions. Such as, why you want to work there, what are your strength, what are your weaknesses. People are very nice. The process is very easy and smooth.", "Interview Questions": "What are your strengths? "}, {"date": "10 Aug 2018", "title": "Nav Spe Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at United Way", "Interview Descriptions": "I dont remember the interview at all. It was a long time ago. I dont remember what was asked, or what I said. It was probably just normal interview questions, I probably answered like the way that everyone answeres those kinds of quesions", "Interview Questions": "Describe something that was stressful"}, {"date": "8 Aug 2018", "title": "Digital Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at United Way (Alexandria, VA)", "Interview Descriptions": "Don't waste your time. AVOID AVOID AVOID! \r\n\r\nI spoke on the phone with a couple of people before being asked to come in for an in person interview. They were very nice even up to the in person interview. However, while continually trying to follow up with them afterwards when they said they would follow up I never received a response. I did this interview back in mid-July so as of now I'm going to assume I didn't get the position however, incredibly unprofessional on their part. I'm reading the other reviews for interviews with this company and this seems to be common practice with them. I don't understand why it's so hard to email someone back to let them know they didn't get the job. If having an unpleasant conversation with potential candidates is something you can't handle, that's a huge red flag. Be better United Way.", "Interview Questions": "N/A"}, {"date": "2 Sept 2018", "title": "Campaign Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1+ week. I interviewed at United Way (Atlanta, GA) in Aug 2018", "Interview Descriptions": "I applied online through a third party website. I was contacted a week later to interview. The interview was straight forward. I was informed of the requirements and expectations prior to beginning the interview. The interview was easy going and everyone was very nice. I was hired a week after my interview.", "Interview Questions": "Do you have experience in public speaking?\n\nAre you able to work outdoors?\nExplain your experience and how it relates to this role."}, {"date": "6 Nov 2018", "title": "Senior Director of Marketing Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at United Way (Columbus, OH) in Aug 2018", "Interview Descriptions": "Had a phone screening with HR where all comp was shared as well as typical screening questions. \r\n\r\nMet with CEO 1:1\r\n\r\n panel interview was conducted\r\n\r\nMarketing advisor interview was required.\r\n\r\nTeam interview would be final step.", "Interview Questions": "Evaluate our existing digital marketing presence and tell us what we could be doing better."}, {"date": "24 Aug 2022", "title": "Director of Community Impact Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 10 months. I interviewed at United Way in Jul 2018", "Interview Descriptions": "This was a very slow moving and long drawn out process. It took roughly 10 months from when my application was submitted (January) to my official start date (September). From January to July I heard nothing from management regarding my application.", "Interview Questions": "My experience in the three pillars of United way- education, health, and financial stability "}, {"date": "11 Jun 2018", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at United Way (Boston, MA)", "Interview Descriptions": "Had brief phone screening to discuss qualifications, resume, relevant background and dates for in person interview.  In person interview was really relaxed and laid back. We just discussed the position and what the internship would include.", "Interview Questions": "How do you handle monotonous tasks where the end goal is not clearly in site. "}, {"date": "5 Jun 2018", "title": "Relationship Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at United Way", "Interview Descriptions": "The phone interview was approximately 30 minutes. The next two interviews occurred within the next two weeks. The first interview consisted of 2 people, the next  one with 6.", "Interview Questions": "Which aspect of the job description would you find the most difficult?"}], [{"date": "21 May 2018", "title": "Program Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at United Way", "Interview Descriptions": "One phone interview with HR then asked to come in for second interview. Waited weeks. Finally got it scheduled and they canceled when I was in route to the actual interview (had spent a couple days preparing) and said they would reschedule. Never heard back. It appears the place is in turmoil right now with losing funding, ceo and staff, at least according to my experience and the news articles coming out.", "Interview Questions": "Standard questions about my background and why I wanted to work for UW"}, {"date": "28 Feb 2019", "title": "Loaned Executive Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at United Way (Athens, GA) in Apr 2018", "Interview Descriptions": "Very brief. Very conversational. Asked a lot about my resume and past experiences. There were two ladies who were very nice and wanted to actually learn more about what I had to offer as oppose to aimlessly quizzing me.", "Interview Questions": "What was your educational background?"}, {"date": "10 Mar 2018", "title": "Campaign Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at United Way", "Interview Descriptions": "Great process. Had an interview with the HR manager, Director of Workplace and the VP of Resource Development. Very standard questions, time to discuss the role. Really organized and supportive environment. It's important to prepare for behavioural questions.", "Interview Questions": "Tell me about a time when you faced a challenge at work. How did you deal with it?"}, {"date": "19 Feb 2018", "title": "Campaign Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at United Way", "Interview Descriptions": "Simple, to the point questions.  They didn't try to trick you or ask anything outrageous. Most questions were about experience and how you would handle certain situations. Interviewers were friendly and conversation was easy.", "Interview Questions": "Describe a time you worked with a team"}, {"date": "12 Feb 2018", "title": "Data Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied through a recruiter. I interviewed at United Way", "Interview Descriptions": "Interview Process was straight forward. However, HR is poorly run.  Neither the person who interviewed me nor the HR person who scheduled the interview will follow up. Upon asking if a decision will me made, the organization has been silent.", "Interview Questions": "What do you know about our organization? Standard Jazz. "}, {"date": "18 Jan 2018", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at United Way (Allentown, PA)", "Interview Descriptions": "Pleasant interview that lasted about thirty minutes.  It started out by the interviewer giving a short history about the company,  department structure and internship details then it followed by general questions from my resume.", "Interview Questions": "What do you expect to get from this internship?"}, {"date": "16 Feb 2022", "title": "Prosperity Campaign Resource Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at United Way (Land O' Lakes, FL) in Jan 2018", "Interview Descriptions": "It was not a hard interview and I only met with one person, not multiple interviews for the job. The branch of the UW that I worked for was very small so this process could differ in bigger markets.", "Interview Questions": "Why do you want to work here?"}, {"date": "31 Jan 2018", "title": "Engagement Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at United Way (Boston, MA) in Jan 2018", "Interview Descriptions": "I applied for the position a week after it was posted on their website. I heard back from them almost two months later. I had a phone screening with HR which went really well and she had me schedule an interview with the Director for two weeks out. I showed up to my interview twenty minutes early because I was worried about parking. I paid 30 bucks to park down the road and got to the office with 15 minutes to spare. The front desk called around to each department but none of them recalled scheduling an interview for that day. HR wasn't in the office so she couldn't even call them to double check. So after waiting for about 45 minutes to get a hold of someone, I was told my interview would be rescheduled. By the time I got home, I received several apology calls and rescheduled for the following day. I showed up to my interview after paying another 30 bucks to park and it went great. The staff was super nice and we all seemed to get along. I got a called almost an hour later to schedule my second interview for the following week. This time, I met with 5 staff members. Again, the interview went really well. The whole thing lasted about 45 minutes and ended with us chatting about our personal lives. Then I was ghosted for a month. I sent a follow-up email immediately after the interview as well as a card in the mail to thank them for their time. Nothing. After two and a half weeks, I sent another email and the director replied three days after that to let me know that the process is in HR's hands now and they'll be in touch. Two weeks after that, I got the email that they went with someone else.", "Interview Questions": "How do you stay organized? Where do you see yourself in 5 or 10 years? What makes you stand out from other candidates?"}, {"date": "19 Jan 2018", "title": "Social Media Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at United Way (Minneapolis, MN) in Dec 2017", "Interview Descriptions": "I applied for the Greater Twin Cities United Way (Minneapolis, MN) Social Media Specialist position in December 2017. Took around 2 months to complete the process. Their HR recruiter was very unprofessional. They were supposed to do a phone screen interview at first but they rescheduled three times, two of the times without an explanation. In one of their excuses as to why they canceled they actually forwarded me an entire email thread between them and another candidate. An email that I shouldn't seen, nor should have been forwarded. To me and other organizations, that's a breach of privacy and confidentiality. They even addressed me by a different name. As an apology, they opted out of phone screening me to help move along the process. Moving on to the in-person interview, which was a different person, and this individual didn't have any written questions or specific questions to ask that they brought. I practically interviewed myself. Following the in-person interview, if they thought I was a good candidate, I would move onto a second round of interviews with a panel. I heard back from the recruiter and again they rescheduled with me twice to call me and say that I wasn't chosen for a second round. I was extremely patient with this person and as an applicant, you don't want to complain about the company you're trying to get a job at in fear of compromising your opportunity at getting that job. But I wanted to share my experience with future candidates because it was extremely frustrating and I had to take time off work to accommodate for their interview times to be canceled on several times.", "Interview Questions": "Have you ever had to put out a PR fire?"}, {"date": "23 Oct 2017", "title": "Call Center Representative Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at United Way in Oct 2017", "Interview Descriptions": "Very efficient and organized from start to finish.  I declined second interview due to salary range and limited upward mobility within this section of the company.  Interviewers were very professional and welcoming throughout the process.", "Interview Questions": "Developmental questions regarding infants and toddlers"}], [{"date": "5 Sept 2017", "title": "Manager Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at United Way", "Interview Descriptions": "This review is specifically for United Way NYC. Would not recommend. I received absolutely no follow-up regarding my status after multiple interviews. It would have been helpful to receive some type of update after reaching out several times. Lack of follow-up is not a good sign, in my opinion.", "Interview Questions": "N/A"}, {"date": "31 Aug 2017", "title": "Resource Center Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at United Way (Tampa, FL)", "Interview Descriptions": "I applied online and heard back within a week. I was called to interview over the phone in order to screen for an in person interview. The phone interview went well.", "Interview Questions": "Tell me about your self. "}, {"date": "26 Jan 2021", "title": "Claims Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at United Way (Birmingham, AL) in Sept 2017", "Interview Descriptions": "Interviewed first with the hiring manager and then with human resources  and program manager.   Went through background check and drug screening and then offered job.  Total process took about three weeks.", "Interview Questions": "Why am I the best fit for the job?"}, {"date": "7 Aug 2018", "title": "Internship Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at United Way (Boston, MA) in Sept 2017", "Interview Descriptions": "I met with two employees who initially seemed interest during the interview process but both people started looking at their phones and one actually took a call. Her phone continued to go off for the entire interview. The role would have been ideal but if that is how the environment is....no thank you. They do great work but I don't think it would be the right place for me to gain training through an internship.", "Interview Questions": "What about the position caught my attention?"}, {"date": "2 Mar 2018", "title": "Finance Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 5 days. I interviewed at United Way (Columbus, OH) in Sept 2017", "Interview Descriptions": "The interview process is just normal, and the interviewer is friendly. Just some normal interview questions, followed by casual chatting. The whole process is easy, not make you feel nervous and give you a lot of pressure. And it takes no more than 30 minutes.", "Interview Questions": "Why do you want to work for our organization"}, {"date": "5 Sept 2017", "title": "Marketing Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at United Way (Tacoma, WA) in Aug 2017", "Interview Descriptions": "It was a panel interview with 3 executives after an email with instructions on how and where to park, etc.  It took approx. one hour.  They took turns asking questions.", "Interview Questions": "Specific past experiences and proposed solutions to certain issues"}, {"date": "6 Sept 2017", "title": "Program Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at United Way (Boston, MA) in Aug 2017", "Interview Descriptions": "I was called about a week after I applied and asked to come in for an in-person interview the following week. I interviewed with the supervisor of the position and the employee who has the job previously and who had moved up to a new role. They were very welcoming and made me feel comfortable.", "Interview Questions": "What do you feel you can bring to this position?"}, {"date": "5 Oct 2017", "title": "Digital Content Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at United Way (Nashville, TN) in Aug 2017", "Interview Descriptions": "There was an initial interview, a call back and a shadow day. Very organized and within a timely manner. The first interview was was pretty lengthy but they didnt ask super tricky question. Just a general overview of my experience.", "Interview Questions": "What is the most important characteristic for someone to have? "}, {"date": "27 Mar 2018", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at United Way (Tallahassee, FL) in Aug 2017", "Interview Descriptions": "I had one interview. Then was offered the job. It was very easy to talk the interviewer.  I am working there now and I enjoy going into the office. Whenever someone passes your office door they will talk to you and ask how your doing and interested in learning what you are working on.", "Interview Questions": "Tell me about yourself. "}, {"date": "2 Sept 2017", "title": "Loaned Executive Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at United Way (Seattle, WA) in Jul 2017", "Interview Descriptions": "I applied, they got back to me quickly to set a time for an interview. They kept me informed throughout the process. Wonderfully easy. Then they said they would be in touch, probably by the end of the week. This was Tuesday morning. Nothing, nothing, nothing. I emailed, which generated a \"we'll be in touch\" reply. I sent along an relevant article and an announcement for a local workshop, which generated \"thanks for this\" responses. Finally, 3 1/2 weeks later, they responded to my \"I'm still interested\" email with the notice that they had filled the position.", "Interview Questions": "Tell us what you know about the United Way of King County and what inspired you to apply? How would this fundraising position enhance your personal and professional career goals?"}], [{"date": "20 Jul 2017", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at United Way (Salt Lake City, UT) in Jul 2017", "Interview Descriptions": "Video interview--interviewed by 4 total staff members who I would be reporting to, then was told I would hear back the next day if I was moved to second round. Went on to second round with a peer interview.", "Interview Questions": "How do  I prove that I am reliable? "}, {"date": "27 Jul 2017", "title": "Digital Content Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at United Way (Nashville, TN) in Jun 2017", "Interview Descriptions": "The first round was a brief phone call about the position. It was very pleasant and went well. \r\n\r\nThen they reached out to me for another call, and I assumed I had a second interview. \r\n\r\nOnce on the call, I realized they were asking me the same exact questions, and it was the same person as before. \r\n\r\nAn absolute waste of time.", "Interview Questions": "Be prepared to speak about your content experience."}, {"date": "24 Apr 2017", "title": "Donor Relations Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at United Way", "Interview Descriptions": "They gave me a case study with a problem to resolve for the interview. Was asked to give strategies to move donors from one level to the other within a certain budget and what would be the best way to move a donor to major giving.", "Interview Questions": "Basic questions, relative to fundraising and knowledge of direct mail, etc."}, {"date": "19 Feb 2021", "title": "Fundraiser Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at United Way (New Orleans, LA) in Mar 2017", "Interview Descriptions": "The hiring manager did not listen to me. She completely blew past answers she didn't want to hear or any questions I had. She seemed in a rush and just wanted to get it over with.", "Interview Questions": "Why do you want to work here?\nDo you have previous fundraising experience?\nWere you successful in your previous roles?"}, {"date": "25 Oct 2017", "title": "Marketing Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2+ months. I interviewed at United Way (Alexandria, VA) in Mar 2017", "Interview Descriptions": "Pleasant, professional.  Met with several people. Some behavioral interview questions.  Specific questions about my experience.  Employees I met with were friendly and helpful. Nice facility, with beautiful river view.  Very accessible from D.C.", "Interview Questions": "Why do you want to work here?"}, {"date": "9 Feb 2017", "title": "Special Events Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at United Way", "Interview Descriptions": "One phone interview that lasted about 20 to 30 minutews. One final in-person interview that probably lasted the same amount as the first, with an offer at the end.", "Interview Questions": "Any marketing experience? Name a challenging work situation."}, {"date": "10 Jun 2018", "title": "Intern Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 2 weeks. I interviewed at United Way (Budapest) in Jan 2017", "Interview Descriptions": "We got in contact through email and we agreed on a meeting in their offices in Budapest. They were very punctual and I got interviewed by two persons. They were very friendly and encouraged questions. \nThe only downside to the process is that I had specified in my emails previously that I did not speak Hungarian but was told it wasn't an issue. Later, I received an email saying that all their administrative papers were in Hungarian and therefore they needed someone who spoke the language. That was the only unprofessional aspect of the whole process.", "Interview Questions": "What do you know about United Way?"}, {"date": "11 Jul 2017", "title": "Lead Preschool Teacher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at United Way (Miami, FL) in Jan 2017", "Interview Descriptions": "It is a panel in which there is the director, a supervisor , a family engagement staff and and an external person. The first day is the interview, if you passed it they called you to spend the morning in the classroom, and the last step is to interview with a parent.", "Interview Questions": "They ask about your experience, knowledge of classroom management and how will you deal with a specific situation. "}, {"date": "8 Dec 2016", "title": "Content Writer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at United Way (Atlanta, GA)", "Interview Descriptions": "I applied online. About a week later, I had a phone interview with HR. They later brought me in for a panel interview. That was followed by an hour-long writing test, which was pretty easy. Everyone was friendly and the process was simple.", "Interview Questions": "How do I handle ambiguity? "}, {"date": "29 Nov 2016", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at United Way", "Interview Descriptions": "Very laid back, one on one interview. They will be interested in your prior community service experience, be prepared to give examples. The interview is basically just a walk through of your resume. They focus on your strengths rather than asking about weaknesses. It's not a typical interview with question and answer, rather very conversational.", "Interview Questions": "What interested you about this position?"}], [{"date": "29 Nov 2016", "title": "Corporate Relations Officer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at United Way", "Interview Descriptions": "I went straight to the panel interview with hiring manger, development assistant, current person in corporate manager role and human resources. HR mentioned it would take a few weeks for status. I emailed after two weeks and no response. After about a month I got a template rejection letter.", "Interview Questions": "How does your past experience make you a good candidate for this role? Give us a time when you had a donor say, \"no\" and how did you change their mind to a yes."}, {"date": "2 Apr 2017", "title": "Marketing Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at United Way (San Diego, CA) in Nov 2016", "Interview Descriptions": "My interview was in one of their conference rooms with the Marketing Director and Human Resources recruiter for about 30-40 minutes to discuss my qualifications. They primarily asked the type of marketing strategies I would use to promote United Way's message, as well my experience with creating new strategies.", "Interview Questions": "What are some websites/advertisements you have seen that are great examples of marketing?"}, {"date": "13 Oct 2016", "title": "Lead Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at United Way in Oct 2016", "Interview Descriptions": "Applied online after employee referral. Heard back quickly afterwards to schedule a phone interview. Completed the phone screen and heard back within a week to schedule a panel interview over Skype.", "Interview Questions": "Tell me about your best boss. Tell me about your worst boss."}, {"date": "20 Jan 2017", "title": "Loaned Executive/Campaign Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at United Way (Atlanta, GA) in Sept 2016", "Interview Descriptions": "I was referred by a friend, but the process was fairly easy/accessible. Got there early. Waited for a bit. I was called in to a room with three executives.", "Interview Questions": "Do you have any background using CRM programs?"}, {"date": "12 Sept 2016", "title": "Corporate Relations Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at United Way (Tampa, FL) in Sept 2016", "Interview Descriptions": "I met with a VP in the development department 1 on 1 for about an hour. It felt pretty conversational, with the focus on her understanding more of my experience and interests, building off of my resume and cover letter. I also had a chance to ask quite a few questions about what working at United Way is like.", "Interview Questions": "Why United Way?"}, {"date": "8 Apr 2019", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at United Way (Oklahoma City, OK) in Sept 2016", "Interview Descriptions": "There were 3 interviews.  The first is with hr and the next is with your immediate supervisor and the last one with the ceo. The interviews were not long and there was a skills test in the second interview.", "Interview Questions": "What are some of the best bosses you have had?"}, {"date": "24 Aug 2016", "title": "Resource Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at United Way (Saint Louis, MO)", "Interview Descriptions": "Phone interview. Next step to prepare a presentation over company and present at interview. Interview asked multiple questions on how I would respond to negativity and how I would deal with regular levels of stress or higher.", "Interview Questions": "How I would respond to someone who is angry about their funded partners and allocations during a presentation."}, {"date": "14 Sept 2016", "title": "Campaign Relationship Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 5 days. I interviewed at United Way (Saint Louis, MO) in Aug 2016", "Interview Descriptions": "My interview process was somewhat unique compared to the other CRMs. I came through a placement agency. I spoke first with the agency to determine if this was the right fit for me. Then I interviewed over the phone with the United Way. The then scheduled a second interview for me, now face-to-face. Because Monsanto foots the bill for this portion of the United Way's business, I interviewed with both the United Way and Monsanto reps. From there, I was hired.", "Interview Questions": "How do you turn a \"no\" into a \"yes\"?"}, {"date": "21 Jul 2016", "title": "United Way Loaned Executive- Greater Atlanta Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at United Way (Atlanta, GA) in Jul 2016", "Interview Descriptions": "There were lots of people interviewing for the position but they have to hire more than 1 person. It was under 30 minutes and they only asked 4 to 5 questions.", "Interview Questions": "Why United Way of Atlanta? \r\nWhat Motivates You?\r\nTell us about a time in which you had to work on a team, what was accomplished?  \r\nTell us about a time where you have given a presentation, what did you do to prepare?\r\n\r\nTell me about a time where you experienced a major failure, How did you overcome it?\r\nA question was asked about a job on my resume"}, {"date": "26 Aug 2016", "title": "Corporate Relations Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at United Way (Tampa, FL) in Jun 2016", "Interview Descriptions": "Phone interview went great, was told I'd be contacted n a few days for a second interview. After ten days I followed up with an email to schedule a second interview. The interview was scheduled within twenty minutes of my follow up email. Second interview went well. Was given two weeks expectations for a turn around time. Tried following up with the interviewer via email but no response. We are four weeks from my second interview. I got completely ghosted. Very unprofessional for a major non profit.", "Interview Questions": "How do you deal with a difficult customer?"}], [{"date": "3 Jun 2016", "title": "Accounting Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at United Way", "Interview Descriptions": "I applied online and next day i was invited for an interview. the interview was pretty easy. The HR just asked me to introduce myself and some basic question about my resume.", "Interview Questions": "just go over my resume"}, {"date": "13 Jul 2016", "title": "Campaign Fundraiser Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at United Way (Philadelphia, PA) in Jun 2016", "Interview Descriptions": "Initial phone interview and then In Person Interview.  A person from HR first called to set up a phone chat with a Director of Fundraising.  The phone interview was approximately 30 minutes and it seemed to mainly highlight yourself to see if you are a candidate they want to go further to 1:1 interviews.", "Interview Questions": "Highlight from my resume the things that would make be good at the position"}, {"date": "29 Mar 2017", "title": "Marketing Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at United Way (Cincinnati, OH) in May 2016", "Interview Descriptions": "I was contacted by email to schedule the interview, and then sent confirmation of the date and time. The tone was very pleasant before and during the interview, and I was informed afterward that I was not selected for the position.", "Interview Questions": "Am I comfortable with date entry of marketing stats for the target audience."}, {"date": "30 Jul 2016", "title": "Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at United Way (Washington, DC) in May 2016", "Interview Descriptions": "Was asked to come in and connected through a mutual friend. Arrived on time but waited 20 minutes for interview, staff was polite overall but interviewer made it seem they were doing me a favor having me in. Most of the questions were theoretical i.e. \"what would you do in this instance?\" Understand wanting to get to know personality but interviewer was not very expressive throughout. Was also told it was good I was interviewing other places. Overall just bizarre and not direct interview process.", "Interview Questions": "How do you navigate tough partnerships?"}, {"date": "2 Apr 2016", "title": "Development Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at United Way", "Interview Descriptions": "I went through two interviews. On the second interview they asked for samples of how I'd revamp their brochure and write a press release for them. They wanted a fit for their office and someone who would work well for them. It was an easy interview and I felt confident but wouldn't be available for a few months.", "Interview Questions": "N/A"}, {"date": "17 Apr 2016", "title": "Medicaid Contact Center Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at United Way (Columbia, SC) in Apr 2016", "Interview Descriptions": "I applied a week ago for this position. I received a call on last week and interviewed the following day. the overall interview went well. The interviewer was very pleasant and easy to speak to. He asked basic situational questions and we were very conversartional the entire time. He gave me a description of the position the pay and what to expect next. He stated to expect a call from him next week .", "Interview Questions": "How do you handle stress?"}, {"date": "17 Jan 2018", "title": "Marketing Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 6 months. I interviewed at United Way (Chicago, IL) in Mar 2016", "Interview Descriptions": "Two interviewers in the room. They asked me questions based on my cv and how long i am planning to stay here in USA. They were keen on knowing if i had relevant work experience in USA. They asked if i know anyone who had worked in organization previously.", "Interview Questions": "relevant work experience"}, {"date": "16 Apr 2017", "title": "Volunteer Recruitment Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at United Way (Provo, UT) in Mar 2016", "Interview Descriptions": "I sent in my cover letter and resume and got a call for an interview a couple days later. The interview itself went okay and I didn't hear back for about a week.", "Interview Questions": "One question they asked was what was a conflict I had with a co-worker and how did I resolve it. Another one was how would I go about finding volunteers."}, {"date": "7 Feb 2016", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at United Way", "Interview Descriptions": "very brief interview process. submitted application and heard back about a week later. had interview in person; very relaxed process. mostly behavioral questions. nothing was particularly challenging. very nice experience and smooth application process", "Interview Questions": "why nonprofit?"}], [{"date": "10 Jan 2017", "title": "Marketing Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at United Way (Boston, MA) in Feb 2016", "Interview Descriptions": "I was recommended by a current employee. I came in to talk to two individuals who I would be working for. Quick interview, only lasted 30 min. Easy questions about experience and what I am interested in. We talked about personal interests and my courses at school. They were very friendly, nice, and professional.", "Interview Questions": "What is your experience with Events and Marketing?"}, {"date": "8 Mar 2016", "title": "Community Impact Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 2 days. I interviewed at United Way (Halifax, NS) in Jan 2016", "Interview Descriptions": "Hired through recruiter and they wanted someone to start right away. I had done an interview with the recruiter prior to this but not for a specific job. They called me and asked if I could start this job the next day. It was very fast", "Interview Questions": "N/A"}, {"date": "16 Jan 2018", "title": "Intern Marketing Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 3 days. I interviewed at United Way (Deer Park, NY) in Jan 2016", "Interview Descriptions": "I met with a marketing associate and then the marketing director. The interview was conversational and very positive. I was asked about what type of skills I could offer the organization.", "Interview Questions": "How do you see yourself succeeding in this role?"}, {"date": "1 Jun 2016", "title": "Marketing Communications Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 7 weeks. I interviewed at United Way in Jan 2016", "Interview Descriptions": "Quick turnaround from application to interview but took 6 weeks to follow up after first interview. Not very professional for a major non-profit. Group interview for first interview, lots of multi-part questions. Was not offered the position.", "Interview Questions": "In your experience, how have other non-profit organizations successfully conducted outreach with the millennial generation."}, {"date": "12 Dec 2015", "title": "Community Engagement Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at United Way (Rockaway, NJ)", "Interview Descriptions": "Super informal, done via Skype (I was living in NJ and this particular United Way was in SF, CA). Was asked a battery of questions to gauge skills and personality, likely to see if I was a good fit with the team I was applying to become a member of. Spoke with two people: one was a former VISTA and current member of the org in an operations role; the other was the head of the dept/team I would be working with and under, respectively.", "Interview Questions": "Why is this position important to you"}, {"date": "4 Dec 2015", "title": "Site Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at United Way", "Interview Descriptions": "Tax program manager did the interview for me. One-round interview. It was an easy process. I was a volunteer in the prior year so the manager kind of knew my performance.", "Interview Questions": "What type of manager do you like?"}, {"date": "4 Nov 2015", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at United Way", "Interview Descriptions": "With a panel of five senior directors each taking turns asking questions.  Only one interview.   Process may have taken a couple of weeks.  Responsive human resources staff.", "Interview Questions": "Asked about integrity and past work experience"}, {"date": "17 Feb 2016", "title": "211 Navagational Specialist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at United Way (Austin, TX) in Nov 2015", "Interview Descriptions": "First there was a phone interview where they asked basic questions about my resume. Next there was an in person interview with three employees who asked slightly more challenging questions.", "Interview Questions": "What would be a difficulty you would have in working this job?"}, {"date": "12 Oct 2015", "title": "Intern - Hourly Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at United Way", "Interview Descriptions": "Multiple interviews, no coordination between interviewers. Asked the same questions in every interview. The experience was similar to most other interviews I have been too in the past besides the repetition. The whole experience took a couple of hours. They made an offer and I accepted for a temporary position.", "Interview Questions": "Why do you want to work for United Way?"}, {"date": "27 Sept 2017", "title": "Volunteer Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at United Way (Boston, MA) in Oct 2015", "Interview Descriptions": "Was given a phone screen at first, then called in for a first round interview and then second round interview. The interview process was smooth and took about 2-3 weeks.", "Interview Questions": "How would I find a volunteer event in the community?"}], [{"date": "8 May 2016", "title": "Campaign Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at United Way (Tallahassee, FL) in Oct 2015", "Interview Descriptions": "It was really fun and comfortable. We discussed the position as well as spent some time getting to know each other. It's a small office so it's important that everyone meshes well and the interview sort of formed around that. We did the second interview at a coffee shop and that was also really great and kept things from getting awkward as they often do in interviews.", "Interview Questions": "How would my previous employees rate me?"}, {"date": "11 Sept 2015", "title": "Campaign Account Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at United Way (San Diego, CA)", "Interview Descriptions": "I had a three part interview. Phone, in person (small group) then panel. The in person portion also included a 3 minute speech on United Way, as if you were presenting to a local business.", "Interview Questions": "Provide examples of your strengths and weaknesses. "}, {"date": "25 Jul 2016", "title": "Campaign Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at United Way (Toronto, ON) in Sept 2015", "Interview Descriptions": "Was referred through a friend. Process moved pretty quickly, had one interview with one hr representative and one manager. Relatively easy interview with basic questions and the job started 2 weeks after the initial interview.", "Interview Questions": "Why do you feel you would be a good fit?"}, {"date": "15 Aug 2017", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at United Way in Sept 2015", "Interview Descriptions": "Was a one on one interview with the Director. Very calm, very relaxed atmosphere. She asked direct questions. It felt more like a nice conversation. She also gave me information on the company and detailed description on what I would be doing. She introduced me to the office after our interview concluded.", "Interview Questions": "Why do you want to work for us?"}, {"date": "20 Aug 2015", "title": "Program Manager: International Donor Advised Giving Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at United Way", "Interview Descriptions": "3 interviews.  \r\n\r\n1st interview) phone call with would-be peer.\r\n2nd interview) in person with would-be colleagues. \r\n3rd interview) Skype with director \r\n\r\nBiggest disappointment: Although they specifically asked for salary requirements in the application, only after going through the interview process did United Way make it clear that they were not willing to match current or requested salary.", "Interview Questions": "From Director: \"name 3 good and bad things that a friend would say about you\""}, {"date": "15 Aug 2015", "title": "Program Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at United Way", "Interview Descriptions": "Process took about 2 weeks. First interview was a Q&A type-- took about 45 minutes. They had a set list of questions they asked and were looking to see how you answered them. Asked the normal interview type questions. Also looked to see how your background applied to the job description. Second interview was a practical-- took almost 3 hours. They provided you with a task and it was your job to come up with a presentation. You had an hour and 15 to complete the project and then an hour to present it to the panel.", "Interview Questions": "If you could wave a magic wand and create the most ideal working environment. What would it look like? "}, {"date": "12 Apr 2016", "title": "Campaign Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at United Way (Dallas, TX) in Aug 2015", "Interview Descriptions": "Professional, relaxed and to the point.  Direct questions about experience as relates to the job.  Since it was a seasonal position this was stressed during the interview. Very detailed on what the position entailed.", "Interview Questions": "Asked about my project management experience."}, {"date": "20 Jan 2016", "title": "Data Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at United Way (Pittsburgh, PA) in Aug 2015", "Interview Descriptions": "I interviewed at the United Way office. They briefly introduce me to the United Way and talk about the job duty. We then briefly talk about my resume and they asked me some position related questions and ask me what will be my approach. They were friendly and the overall conversation went well.", "Interview Questions": "The database needs to be update constantly but will require inputs from 3rd party. Any way to constantly update the database content without having the 3rd party sending their updated information."}, {"date": "28 Dec 2016", "title": "Evening Receptionist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at United Way (Lakeland, FL) in Aug 2015", "Interview Descriptions": "Call in and ask a set of questions then they have you do experience with the job for a couple hours. They then show you the ropes of the equipment.", "Interview Questions": "What are your weaknesses?"}, {"date": "9 Jul 2015", "title": "Fundraising Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at United Way (Toronto, ON)", "Interview Descriptions": "More or less your standard interview with the usual questions except for some very skill-specific questions. The online job description did not specify some skills they were looking for. There were a number of technical skills that were not in the job ad.", "Interview Questions": "As we were just seated and chatting before we formally began the interview, it was assumed that I did not have children and an inappropriate comment was made about disliking children. No illegal questions about children were asked, but it was uncomfortable."}], [{"date": "4 Feb 2017", "title": "Financial Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at United Way (Huntington, WV) in Jul 2015", "Interview Descriptions": "I sent in my application when I received a referral email from a friend who worked at United Way. I was contacted by the Director of Finance of the branch for my first interview. After a week I received their invitation for the 2nd interview with the Executive Director. Everything went smoothly and I got their 3rd and final interview request within a week. Unfortunately, they canceled the interview due to insufficient budget and they could no longer afford to fill in this position. Overall it was a great 1st time experience having interviews with a non-profit organization", "Interview Questions": "What does the word \"United\" mean to you?"}, {"date": "25 Jul 2015", "title": "Assistant Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at United Way in Jul 2015", "Interview Descriptions": "Best part of the whole process...until you realize it was all a facade.  You're called promptly and scheduled.  Interviewers were late, interview rushed and there was a air of contempt with the two interviwing - almost as if I step into the middle of a lover's quarrel.   It was very uncomfortable.", "Interview Questions": "Why do you think you would be good for United Way?"}, {"date": "12 Jun 2015", "title": "Case Management Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at United Way", "Interview Descriptions": "It was normal and welcoming. The interviewer was nice and made me feel comfortable, unfortunately the job did not turn out to be a positive experience. The interview was about average.", "Interview Questions": "Why are you interested in this position?"}, {"date": "7 Jul 2015", "title": "Program Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at United Way (Savannah, GA) in Jun 2015", "Interview Descriptions": "Set up interview within a week. After the interview they informed me that due to travel they would get back to me in a couple of weeks, so I am still waiting to hear about a second interview.", "Interview Questions": "Do I have any volunteer coordinating experience? \r\n\r\nWhat drives you?\r\n\r\nWhere do you see yourself in 5 years?"}, {"date": "15 Jan 2016", "title": "Social Media Strategist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 5 days. I interviewed at United Way (Milwaukee, WI) in Jun 2015", "Interview Descriptions": "Called Kathy and after asking a few questions about my experience she had me come in for an interview and was interested in hiring me, then I just had to wait for the background to come back and started right away", "Interview Questions": "social media experience"}, {"date": "30 Jun 2016", "title": "Loaned Executive Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 1 day. I interviewed at United Way (Houma, LA) in Jun 2015", "Interview Descriptions": "The interview process was relaxed yet extremely informative. The employer was very upfront of the task and duties of the position and the pay. The interview lasted for about 20-30min. It consisted of the employer describing the company as a whole and then the position in which I was being interviewed for. They then asked the basic interview questions that one might hear in most interviews and then I was given a chance to ask any questions I may have had about the job/company.", "Interview Questions": "If I was comfortable with public speaking? (The job position consist of going out to businesses in the community, both big and small, and informing them about United Way and one can give through United Way.)"}, {"date": "20 Jun 2019", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at United Way (Baltimore, MD) in Jun 2015", "Interview Descriptions": "The overall interview process was pretty straightforward. I applied online and it took about  two weeks to get contacted by a manager. I interview one on one at the office", "Interview Questions": "Why United way?"}, {"date": "5 Jul 2016", "title": "Community Investment Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1+ week. I interviewed at United Way (Asheville, NC) in Jun 2015", "Interview Descriptions": "Submitted and resume and cover letter, then was brought in for an interview. This was late in the process close to application deadline so within a day of the interview I was brought in for a 2nd interview at which point there were only 2 or 3 candidates in the pool.", "Interview Questions": "Why do you want to work at United Way?"}, {"date": "27 May 2015", "title": "Community Impact Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at United Way (Danville, VA)", "Interview Descriptions": "A very laid back interview. Questions were based on community needs, and creative ideals for improving work. The organization is under new leadership so I sure much has changed. But overall the organization and interview was relaxing. Dress business casual, as this organization deals with c-suite individuals on day-to-day operations. The quality of knowledge and business and community by the staff is impressive. The experience overall was a good one.", "Interview Questions": "What would you do to help the organization meet its fundraising goals?"}, {"date": "27 Jun 2016", "title": "Program Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at United Way (New Orleans, LA) in May 2015", "Interview Descriptions": "After applying online, I was contacted to set up an in person interview. The process was done through a secretary, so it felt very formal. The interview itself was a one on one and while the questions were typical interview questions, the interviewer was warm and personable. Unfortunately it took several weeks of me contacting them to finally find out that I was not selected. I think if I hadn't reached out to them they would have just never gotten back to me.", "Interview Questions": "Describe a time you were faced with a difficult situation and overcame it. "}], [{"date": "29 Mar 2015", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at United Way (Detroit, MI)", "Interview Descriptions": "I interviewed at the Detroit location.  Phone interview went well and left me feeling positive.  In person interview was different.  They held the interview at a high barstooled table which was awkward to get up and sit.  Questions were asked by 2 people who fired questions at interviewee. Very uncomfortable.  No responses given after interview to email or phone communications.", "Interview Questions": "Typical questions"}, {"date": "29 Aug 2015", "title": "Marketing and Communications Associate Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at United Way (Cleveland, OH) in Mar 2015", "Interview Descriptions": "After applying online, I was called for a phone interview. The interviewer was very pleasant and nice. I got called in for a face-to-face interview. Was interviewed by 3 different people. I thought it went really well and sent a follow up thank you email, only to never hear back.", "Interview Questions": "What is the aspect of United Way that you like the best?"}, {"date": "3 Jan 2017", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at United Way (Toronto, ON) in Feb 2015", "Interview Descriptions": "Typical, very dry and overly serious for such an \"entry-level\" position. You're given scenarios, what would you do in this situation, that situation. There were two interviews. Basically, the more bland you are the better it is, they want you to be a true conformist, smile and nod your head to everything. Also, there was a test administered, testing your Excel abilities. Some things you have never heard of before and will not use in your job.", "Interview Questions": "I can't really remember, but I know it was one of those typical dull questions (e.g. What would you if you didn't know how to complete a certain task? or What if you had a conflict with another employee and had to have the 'courageous conversation'?)."}, {"date": "14 Jul 2015", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at United Way (Columbia, MO) in Feb 2015", "Interview Descriptions": "It was set up through my university.  I emailed back and forth with someone from united way before going in for an interview.  one on one interview, took about a half hour.", "Interview Questions": "Tell me about yourself\r\nwhy are you interested in non profit"}, {"date": "17 Jul 2017", "title": "Accountant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at United Way (Huntington, NY) in Feb 2015", "Interview Descriptions": "Interviewed with entire Staff, the process took 3 months, Background check was not completed until I worked for 6 months with the company.  Great group of people.  Always food and now I'm just typing out many words for this program to allow me to continue the registration process.  I attempted to register for a job search and it has forced me to review prior jobs and review an interview process before going forward to apply for real jobs. I've wasted at least an hour trying to do this.   United Way is a great company and a great privilege to work for.", "Interview Questions": "What are your hobbies"}, {"date": "12 Jan 2015", "title": "One Million Meals Campaign Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at United Way", "Interview Descriptions": "Group interview led by a panel of about 5 people. They only asked 3 questions so it was pretty easy. You also had to participate in a few activities so they could see how well your worked in a team.", "Interview Questions": "tell us about yourself"}, {"date": "7 Jan 2015", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 3 days. I interviewed at United Way", "Interview Descriptions": "Spoke with recruiter and then met with the employer and was trained over one day, the team were pushed for time and were very accomodating. They assisted me over the next few weeks as I only had one day training for the role.", "Interview Questions": "N/A"}, {"date": "10 Nov 2018", "title": "Program Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 5 weeks. I interviewed at United Way (Seattle, WA) in Jan 2015", "Interview Descriptions": "All behavioral questions, first with a panel, then a few weeks later with hiring manager and HR. Very slow process, could take months to hear back. Questions weren't challenging, and hiring managers were pretty transparent in what they were looking for - workplace diversity, ability to navigate change, and motivation driven by performance metrics.", "Interview Questions": "Tell us about your project management experience. "}, {"date": "5 Apr 2015", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 6 days. I interviewed at United Way (Dallas, TX) in Jan 2015", "Interview Descriptions": "It is a pity that there is no interview process with the site manager in this program, before we start to volunteer. It will be better for the manager to talk with us and know what we need before they make the decisions.", "Interview Questions": "N/A"}], [{"date": "3 Dec 2014", "title": "Director, Community Impact and Investment Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied through other source. I interviewed at United Way", "Interview Descriptions": "I was hired as a temporary employee to perform a position in the community that I worked with United Way on for several years.  I was laid-off and they asked me to help them temporarily, so there was no interview.  When I demonstrated the skills for an open position, I was promoted.", "Interview Questions": "There were no difficult questions.  My reputation and background was well-known, and many of the people that I worked with at my last position, I continue to work with in this position."}, {"date": "2 Dec 2014", "title": "Accounting Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 5 days. I interviewed at United Way (Saint Cloud, MN)", "Interview Descriptions": "Interview was with two people. The interview process was really relaxed, conversational. They both were believers in United Way before they obtained their current positions. Very nice. This was a positive interview experience, they ended up hiring within.", "Interview Questions": "N/A"}, {"date": "27 Jul 2015", "title": "Business Strategist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 3 months. I interviewed at United Way (Baltimore, MD) in Dec 2014", "Interview Descriptions": "It was for 211 program. It lasted half an hour. The interviewer is Brian Gerardo. He is nice and friendly. Just relax. He asked a lot of interesting questions. Maybe it was because it was for an NGO.", "Interview Questions": "Many many questions. What would you do if you have a million dollars?"}, {"date": "21 Nov 2014", "title": "Community Impact Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at United Way", "Interview Descriptions": "I applied online and then had one phone interview. I was offered the job before i even hung up. The on boarding process was a bit awkward. They threw me in a room and introduced me to everyone at the company one on one. Each in counter lasted about 15 seconds. Other than this first awkward filled day, It was a great place to work.", "Interview Questions": "Questions are simple for the most part. The interview started with the generic tell me about yourself."}, {"date": "6 Oct 2014", "title": "Campaign Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at United Way", "Interview Descriptions": "After applying online, a phone interview answering behavioral type questions. The in-person interview was a 5 minute presentation on United Way. Don't go over 5 minutes! Being concise and impactful is important, don't read straight from a paper. I focused on expanding on the mission and did my research to be able to present relevant statistics.", "Interview Questions": "Presentation"}, {"date": "13 Sept 2014", "title": "Intern Interview", "results": "Declined Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at United Way", "Interview Descriptions": "Very lax - was interviewed informally and my hiring director left the company one week after I started. Very unorganized and not a proper structure.  Told me that they would structure position around me and then did not.", "Interview Questions": "What is your interest?"}, {"date": "30 Aug 2014", "title": "Director - Event Planning Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 9 months. I interviewed at United Way", "Interview Descriptions": "I first applied for the opportunity via a job board with no response from the hiring manager. Over six months later I was referred to the hiring manager by her management. This referral led to an interview.  \r\n\r\nDuring the interview with the hiring manager, it was evident she had not looked at my resume. It took her a minute to locate my resume among the piles of paper on her desk. Her questions were surface. Not one of her questions attempted to understand how I would perform in the role or draw a parallel between my experience and how i would successfully apply it.  \r\n\r\nThe interview lasted approximately 20 minutes and her demeanor was absolutely off-putting. The most bizarre aspect of the interview were her descriptions about how she survived working at the organization through multiple layoff rounds.", "Interview Questions": "Cannot recall a difficult or unexpected question. Though there were unexpected comments from the interviewer.  "}, {"date": "7 Mar 2016", "title": "Customer Support Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. The process took 1 day. I interviewed at United Way (Columbia, SC) in Sept 2014", "Interview Descriptions": "No interview was required because I was contracted through Aerotek Staffing. There was a small one on one interview before the training started. It was very basic and easy to complete the entire process. the HR woman comes across as a bit belittling and not so nice but that is imply her personality and I do not think she had any ill intent or feelings during the process", "Interview Questions": "What did I like most about my previous position?"}, {"date": "25 Oct 2018", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at United Way (Cincinnati, OH) in Aug 2014", "Interview Descriptions": "Quick and easy. I knew some people working there and that seemed to really help. \r\n\r\nOffice is almost 100% women and they seemed to care about what I wore, so make sure to have a good interview outfit ready.", "Interview Questions": "Tell me about yourself"}, {"date": "21 Sept 2016", "title": "2-1-1 Information and Referral Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 1 day. I interviewed at United Way (Madison, WI) in Aug 2014", "Interview Descriptions": "The interview was pretty straight forward but I was asked a lot of behavior based questions. They were trying to gauge if I had the skills and personality to handle difficult situations that may arise at 2-1-1. They also asked basic questions like what is it about United Way that interests you, what skills do you feel you possess that would make you successful in this position, what do you consider your strengths and weaknesses, etc.", "Interview Questions": "Someone calls and is very angry and upset, how would you respond?"}], [{"date": "12 Aug 2014", "title": "Account Executive Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at United Way in Jul 2014", "Interview Descriptions": "Everyone was very nice.  It was a group interview process.  They told me about the job and asked a few questions about my experience.  I asked several questions also.", "Interview Questions": "No difficult questions!"}, {"date": "9 Jul 2015", "title": "Sponsored Loan Executive Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at United Way (Louisville, KY) in Jul 2014", "Interview Descriptions": "I was interviewed by two people. It was a very loose environment, and it was easy to read their body language. Lasted between 30-45 minutes. Recommend a dress shirt and tie but not suit jacket.", "Interview Questions": "Can you provide examples of when you were required to speak publicly and examples of when you provided leadership?"}, {"date": "12 Feb 2015", "title": "Campaign Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 2 days. I interviewed at United Way (Charlotte, NC) in Jun 2014", "Interview Descriptions": "I was interviewed by the Director of HR, then two supervisors from Donor Relations. They asked the basic questions and explained a little bit more about the job. After the interview I had to take an Excel quiz and personality test online.", "Interview Questions": "Are you comfortable with public speaking?"}, {"date": "2 Dec 2015", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at United Way (Alexandria, VA) in Jun 2014", "Interview Descriptions": "It was a great interview process, though the hiring process took months. The interview process began with a phone interview, then was followed by an in-person interview with a few staff members. Almost all the questions were behavioral (tell us about a time when... give us an example of a time when...) and came from an HR-approved sheet of questions.", "Interview Questions": "Tell us about a time when..."}, {"date": "15 Dec 2014", "title": "Navigator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at United Way in Jun 2014", "Interview Descriptions": "Submit application, phone interview, one-on-one interview, writing sample, and panel interview. Friendly staff, typical questions. If you are passionate and actually want this job (I can't see why you would apply if you didn't, such a small stipend!) then you will be able to answer the questions easily. Just show passion and excitement. The staff is friendly, didn't feel like an interrogation, but a friendly conversation where the people actually felt invested in my answers. Went for probably over an hour on the group panel interview. Sometimes previous members will sit on the panel as well.", "Interview Questions": "N/A"}, {"date": "27 Oct 2016", "title": "Development Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at United Way (San Diego, CA) in Jun 2014", "Interview Descriptions": "The initial interview was conducted by phone as a basic screening by HR.  Once completed, I was invited to a final in person interview with a panel including the VP, manager, and HR Generalist.  I was asked a series of questions by the panel of 3 and was prompted to give a 3-5 minute presentation.  I was told in my initial interview that a presentation was expected. The interview concluded with a couple of additional questions and an opportunity to ask any questions of my own.", "Interview Questions": "What is your spirit animal?"}, {"date": "13 May 2014", "title": "Data Entry Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at United Way", "Interview Descriptions": "Very pleasant, overall no complaints. Very professionally handled, no \"curveball\" type questions. My interviewer ensured that I was comfortable and additionally was very personable.  I was not kept waiting long. Overall, pleasant experience", "Interview Questions": "I was asked about gaps in employment"}, {"date": "27 Feb 2014", "title": "Resource Development Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied through other source. The process took 2 weeks. I interviewed at United Way", "Interview Descriptions": "The interview process is very simple. Having past experience in the industry is a plus.", "Interview Questions": "N/A"}, {"date": "19 Oct 2015", "title": "Director Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at United Way (Grand Rapids, MI) in Mar 2014", "Interview Descriptions": "Long and disorganized.  The interview process lasted three months. Internally, they didn't seem to know what/who they wanted for the position. This suspicion was confirmed after I started.  As I understand it, after I was went through the interview process, the CEO came down with a case of second-guessing and was tempted to rewrite the job description. When she couldn't figure out how to rewrite, she relented and let the folks hire me. That was a harbinger of things to come.", "Interview Questions": "What do you know about the organization?  How would you improve the department you are applying for?  How does your past experience fit into this position (that you are interviewing for)?  Do you have contacts in the local Grand Rapids charitable community? Why do you want the job? What are your three best accomplishments in previous positions?  What are your strengths as an employee? What are your weaknesses?  Do you prefer to work alone or as part of a group?"}, {"date": "7 Feb 2014", "title": "Education Program Manager Interview", "results": "No Offer", "experience": "N/A", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at United Way (New York, NY)", "Interview Descriptions": "Applied online about 3 weeks later received a call for a in person interview.  Fairly easy interview with two people.  Didn't make it to the 2nd round but felt very positive about the interview, perhaps it just wasn't a good fit.", "Interview Questions": "None, Felt they could of posed more challenging questions."}], [{"date": "31 Jan 2014", "title": "Marketing Assistant Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at United Way", "Interview Descriptions": "About a week after submitting my application online, I was called by an HR rep at the company to schedule an interview. My interview was scheduled for one week later, and was a panel of three people in the department I was applying to. The interview was short, and they didn't ask anything unexpected.", "Interview Questions": "Nothing unexpected - asked about what types of software I was familiar with and my experiences managing events and budgets."}, {"date": "16 Jan 2014", "title": "Director, Community Impact Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at United Way", "Interview Descriptions": "The interview process consisted of a phone screen and two in-person interviews. You should have a really good sense of the major policy issues, trends and challenges in the field. Major plus if you know how to analyze data. Also be sure to be able to demonstrate your knowledge about what is happening in the community. Also a plus if you already know people in the field that you could potentially work with if you got the job. Community Impact is full of smart, committed people that are passionate about the work. Demonstrate your passion too.", "Interview Questions": "If you don't have a ton of experience in the field, then it will be difficult to answer specific questions about your previous work. Also, if you don't have a good sense of public policy issues you might have difficultly answering some of the questions."}, {"date": "23 Jan 2014", "title": "Marketing Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at United Way", "Interview Descriptions": "I applied via their online portal and got a phone interview with two members of the team. The interview was pretty straight-forward - very job specific and less personality oriented. They were specifically looking for someone with a lot of experience in events and list management, which was not my niche.", "Interview Questions": "Nothing was entirely difficult or unexpected. They simply asked detailed questions about common questions. i.e. In regards to list management: what programs have you used, are you familiar with the backend, etc."}, {"date": "1 Mar 2018", "title": "Development Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at United Way in Jan 2014", "Interview Descriptions": "The interview process was really smooth and I felt confident that this was a warm and strong team. In the end I decided the job wasn't the right fit for me.", "Interview Questions": "N/A"}, {"date": "2 Oct 2014", "title": "Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "The process took 3 weeks. I interviewed at United Way in Jan 2014", "Interview Descriptions": "Resume submitted by a current employee, had phone interview the same day.  During phone interview was asked to come in for in person interview.  Immediately after in person interview was asked to come back for second interview.  Was then told one of the members of panel interview could not attend, asked for a second phone interview.  Before completing completing second in person interview all of my references were called including my current employer. Completed second in person interview and after following up was informed I was not selected for the position.", "Interview Questions": "What is your greatest weakness?"}, {"date": "29 Sept 2015", "title": "Volunteer Income Tax Assistant Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at United Way (Lake City, King, WA) in Jan 2014", "Interview Descriptions": "No need of interviewing process for this position. The tax site, however, is a joke in this area. We had around 10 people up and read to do returns for ANYONE that walks in. But I was there for 2 volunteer days and only 2 customers that actually showed up for the whole 4 hours that we were there help people with preparing their tax returns!", "Interview Questions": "How was my day going?"}, {"date": "11 Nov 2015", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 days. I interviewed at United Way (Omaha, NE) in Jan 2014", "Interview Descriptions": "Easy interview. Mostly tell me about yourself type questions. The recruiter was very nice. i think they  were looking for the fit more than anything else. Overall very nice and enjoyable", "Interview Questions": "Tell me about yourself."}, {"date": "6 Dec 2013", "title": "Executive Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at United Way", "Interview Descriptions": "Posted in local newspaper.  Board Members screened applications, narrowed to 3-6 to interview.  2 Board members conducted initial intervews.  Called for a second interview with additional Board members.  Board met to make their decision and a representative call with the job offer.", "Interview Questions": "How would you increase donor dollars?"}, {"date": "22 Jul 2015", "title": "Marketing Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at United Way (Madison, WI) in Dec 2013", "Interview Descriptions": "I was interview by two of the marketing team members. They just went over my resume and asked some questions about the school projects. They also explained a bit about what to expect from an intern point of view.", "Interview Questions": "Why are you applying at United Way?\r\nWould you like to apply for a FT  position with us after graduation?\r\nSome marketing related questions as I applied for a marketing position."}, {"date": "6 Sept 2017", "title": "V P Communications Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. I interviewed at United Way (Alexandria, VA) in Nov 2013", "Interview Descriptions": "The interview process was thorough.  I had a phone interview.  Then I interviewed with the direct supervisor and then she had me interview with with the department head and then he had me interview with the SVP. The whole process took only about 3 weeks.", "Interview Questions": "What unique skills do you bring?"}], [{"date": "21 Dec 2015", "title": "Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at United Way (Los Angeles, CA) in Nov 2013", "Interview Descriptions": "The interview process included a face to face, both with the CAO and head of HR and a personality and competency test. The competency/personality test was timed and asked slightly reworded questions to get at consistency.", "Interview Questions": "Questions were directed at professional and interpersonal fit."}, {"date": "18 Dec 2016", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at United Way (Ottawa, ON) in Oct 2013", "Interview Descriptions": "Phone prescreen - asked question about salary expectations\r\n2-panel members - direct supervisors\r\n45-60 mins face-to-face interview\r\nabout 10 questions\r\nsecond interview with the head of the department\r\nasked for 2 references\r\nmade an offer after they received the references", "Interview Questions": "Tell us about yourself."}, {"date": "4 Sept 2014", "title": "Finance Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 5 weeks. I interviewed at United Way in Oct 2013", "Interview Descriptions": "Although I was referred for the position by a board member, the interviewer failed to contact me to acknowledge receipt of my resume or to schedule an interview until two days prior to the interview date. Interviewer never responded to a single follow-up email or phone call after our conversation, including to let me know I wasn't under consideration for the position.", "Interview Questions": "\"How would you organize the data to be able to answer questions quickly?\" The entire job is data management and the entire conversation was about the level of detail that needed to be maintained to do the job well. Prior to the question being asked we discussed systems, how data was managed currently, and how the organization's needs were being met in the interim. There ought to have been satisfactory systems in place already, and if there weren't that should have been part of the conversation and job description."}, {"date": "15 Aug 2013", "title": "Summer Intern Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at United Way", "Interview Descriptions": "The interview was very laid back. They asked you about your general interests and background, and how that was related to your interest in the job posting. They were very concerned about whether you would feel comfortable participating in or leading actual volunteer projects. The interviewers were incredibly nice and friendly.", "Interview Questions": "There were really no difficult or unexpected questions during the interview."}, {"date": "7 Aug 2013", "title": "Relationship Manager - Corporate Development Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at United Way", "Interview Descriptions": "It took 6 months to hire me, 4 different interviews, no clear timeline to hire. interviews were formal, but not structured well.", "Interview Questions": "I was asked to give a presentation on United Way"}, {"date": "7 Aug 2013", "title": "Development Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at United Way", "Interview Descriptions": "Resume and cover. One on one with Executive Director. Casual conversation about fundraising experience.", "Interview Questions": "No difficult of unexpected questions. Very straight forward."}, {"date": "28 Jul 2013", "title": "Campaign Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at United Way", "Interview Descriptions": "Two face-to-face meetings over lunch with the Department VP, panel interview with the entire Campaign Department, final interview with the Chapter CEO.", "Interview Questions": "Why do you want to work with us?\r\nWhat skills do you think you have that would make you a good fundraiser?"}, {"date": "7 Oct 2015", "title": "Resource Development Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at United Way (Philadelphia, PA) in Jul 2013", "Interview Descriptions": "Pretty straightforward. Relaxed atmosphere, felt like a conversation instead of an interrogation. When you walk in, you'll pretty much feel comfortable.  Beautiful design, everyone from the receptionist to the interviewers were pleasant.  Interviews are very quick as pretty much all of the employees there have to get back to their multiple roles.  The interview will be easy as long as you have answers ready for the typical \"tell me about a time..\" questions.  Not the overly complex ones, but the ones that ask about your leadership and how your experience meshes well with the position they have available.", "Interview Questions": "They wanted me to go into detail of my experience. I didnt get too many of the typical behavioral questions."}, {"date": "13 Jul 2017", "title": "Loaned Executive Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at United Way (New York, NY) in Jul 2013", "Interview Descriptions": "I was referred by a volunteer.  They conducted a phone interview to screen and discuss my experience.  I had a follow up in person interview with the Development Manager.  The interview lasted about 45 minutes.", "Interview Questions": "Why do you want to work at United Way?"}, {"date": "18 Apr 2016", "title": "Director, Resource Development Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at United Way (Macon, GA) in May 2013", "Interview Descriptions": "1. Phone interview with VP of Resource Development\r\n2. Face-to-face interview with CEO and VP of Resource Development\r\nCEO is very passionate about the work UWCG is doing and he demands excellence from anyone brought on board. His passion was helpful during the interview because he is very engaging and made the interview more like a conversation than a typical interview. The VP is no longer at the UWCG.", "Interview Questions": "Why is it important for you to work at UWCG?"}], [{"date": "5 Jan 2014", "title": "Development Intern - United Way of Dane County Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at United Way (Madison, WI) in Apr 2013", "Interview Descriptions": "Excellent communication and very organized. I heard back from the organization shortly after submitting my application and having interview. The woman that conducted the interview was very friendly and gave me a lot of information about the organization.", "Interview Questions": "Describe a challenge you faced when working in a group project. How did you overcome this challenge?"}, {"date": "5 Mar 2013", "title": "Creative Services Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at United Way", "Interview Descriptions": "The interview is thorough, dialog-based with several key individuals. Be prepared to answer specific questions with specific answers. Bring a strong portfolio and understand the materials that they produce.", "Interview Questions": "Name a time when you worked in a group and something didn't work out. How did you fix the problem?"}, {"date": "13 May 2015", "title": "Campaign Associate Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at United Way (San Jose, CA) in Mar 2013", "Interview Descriptions": "It was more a conversational interview with the HR person by phone. They looked at your resume and asked you to elaborate on key points highlighted there. I did not move further on after this, and did not receive a reply to a follow up email from the HR person where they were in the process.", "Interview Questions": "How does your experience fit in with their current campaign strategy."}, {"date": "12 Feb 2013", "title": "Associate Relationship Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 5 weeks. I interviewed at United Way", "Interview Descriptions": "My résumé was submitted by a current staff member to the development division, I received  a phone to schedule an interview  within a week. I still have about two more rounds of interviews to go through. Everyone was really nice, and the enviornment in the office when I entered was very welcoming. Everyone was smiling and conversing and seemed really happy to be there. \r\nI was told that the quickness of your interview process can vary based upon the season at united way. If they are in the middle of a major fundraising the process can take a little longer.", "Interview Questions": "N/A"}, {"date": "1 Jun 2017", "title": "Case Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at United Way (Milltown, NJ) in Jan 2013", "Interview Descriptions": "Called within a week of submitting application. The interview was just over an hour long. Was called three days level with acceptance and started three days after that. There was only one person in the interview office. They seemed like a very nice group of people and very opening in the interview process.", "Interview Questions": "biggest weakness and strength, questions based off each past job duties, how are you a fit with your experience related to this job."}, {"date": "8 Oct 2015", "title": "Area Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at United Way (Atlanta, GA) in Nov 2012", "Interview Descriptions": "United Way utilizes group interviews and usually consists of the HR Director, the Supervisor of the department you are interviewing with and various others.  All in attendance are allowed to ask questions and you are answering each one as they each take a turn.  The Supervisor of the department you are interviewing with will usually have the most questions for you to answer.", "Interview Questions": "How I would grow United Way's development department and ensure all funding goals were met."}, {"date": "13 Oct 2012", "title": "Director Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at United Way (Seattle, WA)", "Interview Descriptions": "Panel, set questions, very formal/structured.", "Interview Questions": "N/A"}, {"date": "22 May 2016", "title": "Resource Development Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at United Way in Sept 2012", "Interview Descriptions": "Easy and fun, people were more than willing to talk with you to make sure it was a cultural as well as profession fit. It was nice to meet the staff and learn about how their jobs fit the mission of the organization.", "Interview Questions": "How would I represent the organization in the community?"}, {"date": "7 Aug 2012", "title": "Communications Manager Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at United Way", "Interview Descriptions": "The interview consisted of two rounds, as well as a written assignment. It was a fairly detailed process in terms of determing fit for the job on both sides, particularly because I was transferring from a large, public company to a nonprofit.", "Interview Questions": "All of the questions were straightforward and expected."}, {"date": "8 Jul 2016", "title": "Resource Development Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at United Way (London, ON) in Jul 2012", "Interview Descriptions": "The process was fairly standard. There was a screening interview and a couple of in-person interviews following. The entire process took about a month's time. Everyone was fairly organized and managed expectations well.", "Interview Questions": "Questions are all behaviour-based."}], [{"date": "5 Aug 2015", "title": "Marketing Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at United Way (Amarillo, TX) in Jul 2012", "Interview Descriptions": "I saw a classified ad in the newspaper, and emailed about it. Got a reply, and interview was arranged over email. I was one of about 80 applicants, and I interviewed once, and was called in for a second interview. When I had my second interview, they offered me the job and I accepted. Didn't have to deal with a complicated HR department so that was nice. Easy process overall.", "Interview Questions": "How would you do well in this job?"}, {"date": "27 Apr 2015", "title": "Program Coordinator Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at United Way (New York, NY) in Jul 2012", "Interview Descriptions": "It starts off as a phone interview,then a in person interview ,followed by 1 on 1 with senior management interview .As you progress they may ask you to submit a writing sample to test against other candidates.Overall,they ask basic questions in regards to the position and responsibilities .", "Interview Questions": "Why do you want to work for United way?"}, {"date": "25 Jun 2012", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at United Way in Jun 2012", "Interview Descriptions": "It was a very pleasant and friendly interview. I was pleased with the length and time of interview, the questions were pretty straightforward and not terribly thought provoking.", "Interview Questions": "Describe your sales experience...."}, {"date": "3 Apr 2014", "title": "Administrative Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at United Way (Chicago, IL) in Jun 2012", "Interview Descriptions": "I applied online to the organization, was contacted by HR for a phone interview, then had an in-person interview at my specific office. I was told that there would be second interviews but was called shortly after and offered the job.", "Interview Questions": "All questions were fairly expected."}, {"date": "14 Feb 2013", "title": "Accounting Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 6 months. I interviewed at United Way (Wilmington, DE) in May 2012", "Interview Descriptions": "one interview by manager and hr\r\n\r\nafter almost one week, they gave me the offer\r\n\r\njust ask basic questions, no surprise\r\n\r\nlike what's your goal\r\nwhat they are looking for \r\nexplain of the job", "Interview Questions": "why united way"}, {"date": "25 Apr 2016", "title": "Program Director Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at United Way (Los Angeles, CA) in May 2012", "Interview Descriptions": "Great team of interviewers.  Thoughtful questions and dialogue -  Explain your experience as it relates to the position.  Ask questions of the organization to better understand their needs. Talk about the changes you made in previous jobs and how you would handle the first 3 months.  How you would engage your team and employees.  Highlight the successes and the challenges you have faced in prevous positions.", "Interview Questions": "Previous experience."}, {"date": "30 Aug 2016", "title": "Finance Associate Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at United Way (Columbus, OH) in Apr 2012", "Interview Descriptions": "I heard that it can be a long process and it was. I went through a phone interview, 2 on 1 interview and then a panel interview. It was lengthy but pretty standard questions were asked. Just come prepared and know about the organization and why you think you can contribute to their mission.", "Interview Questions": "The interview questions were your standard interview questions."}, {"date": "19 Jan 2016", "title": "Executive Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at United Way (Phila, PA) in Feb 2012", "Interview Descriptions": "Intensive Interview process with phone interview, in-person interview with Search committee chair and panel interview with Board Representatives.\r\n\r\nBe prepared and know your local United Way history and current work in the community.  be prepared to discuss your experience with Boards, volunteers and fundraising as well as knowledge of the local community and funded partners.", "Interview Questions": "Behaviorally based questions reflecting core job functions.  What do you know about the United Way?\r\nUnderstanding of Collective Impact"}, {"date": "1 Feb 2012", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 2 days. I interviewed at United Way in Jan 2012", "Interview Descriptions": "They asked about why I wanted to work for them, as well as what I had to bring to the team. I told them of my past experience, as well as my drive to help their cause. They explained the responsibilities I would have, asked if they sounded acceptable to me and they were.", "Interview Questions": "How have your past experiences influenced you to seek employment with us?"}, {"date": "2 Oct 2015", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 4 weeks. I interviewed at United Way (Cleveland, OH) in Dec 2011", "Interview Descriptions": "I had a interview many years ago with a Human Resources Manager on the phone for about 30 minutes and was called later called to meet the two managers that I would be working for. Overall everyone was very nice and did not feel intimated at all. There were good intelligent questions provided by the hiring managers. It did take longer for the process probably because of the time of year and a little slower process overall.", "Interview Questions": "Tell me about a time when you did something to improve a process in a previous job."}], [{"date": "26 Feb 2014", "title": "Campaign Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at United Way (Fresno, CA) in Nov 2011", "Interview Descriptions": "2 interviews in total. Will ask you basic questions about your work experience.", "Interview Questions": "They asked me to give a sales pitch during the interview."}, {"date": "29 Jan 2014", "title": "Teacher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at United Way (Conyers, GA) in Nov 2011", "Interview Descriptions": "I was accepted into a teaching class after receiving my B.A. degree and trained from the Early Learning Teaching program for a week and received my CPR and First Aid certification then I was given a certificate and used that to work in various schools, facilities", "Interview Questions": "What is my availability..A person must be flexible"}, {"date": "17 Oct 2011", "title": "Administration Manager Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 5 days. I interviewed at United Way (Sacramento, CA) in Oct 2011", "Interview Descriptions": "United Way-Sacramento/Rancho Cordova responded very quickly after receiving and reviewing my resume. I was scheduled quickly and for an early time slot. A time for the interview was offered and no other information was provided other than the decided time and that the interview was a panel interview.  I was expecting a phone interview and surprised that that was not the case.  The interviewers had printed and prepared questions for the interview.  The interviewers provided a very nice booklet on the United Way and its mission and services.  My interviewers were very professional and passionate about the United Way!  I found this to be a very attractive company.  I think working for the United Way could provide an opportunity to expand your personal development and gain rewarding experiences in a non profit arena.", "Interview Questions": "Describe how you keep yourself organized."}, {"date": "17 Jul 2015", "title": "Secretary Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 1 week. I interviewed at United Way (Detroit, MI) in Oct 2011", "Interview Descriptions": "Was called by Human Resources and met with them. Had to take a test and I passed that and was told that I would be contacted once a decision  was made. Was called back a week later with offer and I accepted.", "Interview Questions": "Why do you feel you are a good candidate  for this position?"}, {"date": "2 Jan 2012", "title": "Data Entry Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 1 day. I interviewed at United Way (Fort Lauderdale, FL) in Oct 2011", "Interview Descriptions": "I heard about the position from a friend and  applied. Interview process consisted of a short pre-qualifying phone interview and then I was invited for face to face interview thereafter. I was told I was too experienced.  Disappointing & puzzling since they had had my resume a whole week prior before calling me for an interview.I guess they thought I would get bored with the project and quit before project was finished I wouldn't have.", "Interview Questions": "Why do you want to work for United Way?"}, {"date": "14 Apr 2013", "title": "Digital Content Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 2 weeks. I interviewed at United Way (Detroit, MI) in Sept 2011", "Interview Descriptions": "I met with higher ups before a job was initially posted. If you want to pursue a job at UWSEM, it helps to see the office, volunteer or offer your services before a job is even posted. Be on the radar.\r\nAfter I had the initial introduction to UWSEM,  I met with the direct supervisor for the position that was open. It was casual -- at a Starbucks. After that, I was given \"Strengthsfinder 2.0\" to complete and send my results back. A quick phone interview with HR and I was ready to go.", "Interview Questions": "This was a new position, so I really had to have a game plan for what I envisioned for the job. Know the business before applying!"}, {"date": "20 Dec 2011", "title": "Development Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through other source. The process took 2 weeks. I interviewed at United Way (Sarasota, FL) in May 2011", "Interview Descriptions": "Very nice interviewers, a development director and interim CEO. Found it incredibly unprofessional that they never contacted me that they had selected someone else. I even sent a handwritten, snail mail thank you note. I have been in their position and was easily able to contact every person we spoke to.", "Interview Questions": "Why should we hire you over anyone else."}, {"date": "14 Jan 2012", "title": "BoardServe Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at United Way (New York, NY) in May 2011", "Interview Descriptions": "Applied online with a standard resume and cover letter, responding to a posting found on idealist.org. First interview was a phone interview, in which I was questioned on my basic skills, experience and interests. I was asked what I knew about the organization and was detailed on the specific program. Two weeks later I went to UWNYC for an interview with the program manager and another associate. Here I was asked about more situational experience- my experience with data entry, feelings about working with nonprofits and professionals, background with social media tools and IT changes/databases, etc. Not too intimidating, both interviewers were nice and conversational. Dress was business casual, though I was in business professional and would always suggest overdressing than under. Immediately sent a hand written thank you letter following the interview which was worked greatly in my favor, I would suggest it to any fellow interviewees.", "Interview Questions": "What IT experience do you having with building, working on and updating websites?"}, {"date": "15 Sept 2011", "title": "General Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 months. I interviewed at United Way (Boston, MA) in Apr 2011", "Interview Descriptions": "Very friendly staff. Very slow with little communication on their end as to the status of your application. I was kept waiting for weeks at a time.", "Interview Questions": "How will this job be different from your last? (I am not from a non-profit background)"}, {"date": "20 Apr 2015", "title": "Campaign Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at United Way (New York, NY) in Apr 2011", "Interview Descriptions": "Begin process with HR manager and the application is moved on to Campaign manager. If selected one more meeting with VP of campaign. This meeting generally means that you are hired.", "Interview Questions": "Knowledge of United Way"}], [{"date": "26 Jan 2011", "title": "Resources Development Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 1+ week. I interviewed at United Way in Jan 2011", "Interview Descriptions": "Relatively quick process.  Able to speak with key players early on in the process.", "Interview Questions": "Who are the most influential people you have recently met."}, {"date": "3 Aug 2012", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at United Way (Charlotte, NC) in Oct 2010", "Interview Descriptions": "Interview initiated by employer and, after interim period, offered full-time employment.", "Interview Questions": "What salary level are you seeking?"}, {"date": "8 Mar 2011", "title": "Finance Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at United Way in Sept 2010", "Interview Descriptions": "United Way's hiring and interview process was an absolute Joy to go through. It was incredibly simple, but it took longer than it should have.\r\n\r\nTo begin, the job posting was posted on CareerBuilder with a contact email at the bottom, so sending my resume/coverletter took seconds as I already had it ready to go on my desktop.  I was called for an interview about two weeks later at a specific date and time because their interviewing schedule was very tight. I would have missed the opportunity to interview if I didn't come in at the time they chose.\r\n\r\n As I arrived, I IMMEDIATELY felt comfortable. The receptionist was cordial and professional, the building was pleasant to the eye and the HR lady came down to meet with me very quick -- just like I like it.\r\n\r\nAs I spoke with her, she effortlessly described the great things about United Way; how the organization helps the community, the benefits of working there, the laid back culture...\r\n\r\nAnd it gets even better : My interviewers were very relaxed and friendly. After discussing my resume and the position, we had a great conversation about whatever came to our minds : Nevada, Life, Travel, future plans, goals, etc.\r\n\r\n\"This was the place I'm looking for!\" I thought. I instantly felt apart of the family. \r\n\r\nAfter extending the interview an hour past the scheduled end point, I walked out knowing that the position was mine.\r\n\r\nA call for salary requirements came three weeks later. Second interview came another two weeks later, which consisted of more people to meet. Questions remained simple -- I enjoyed that they seemed more interested in my personality than my experience (although I have 4+years in Finance)\r\n\r\nReference check came another week later and each call lasted about 20 mins. All four of my references joked that it felt like they should have the position instead of me, because unfortunately for them, the reference check was an interview in itself. :)\r\n\r\nThen, another person checked three of my references.\r\n\r\nThen another.  They were doing everything in their power to make sure everything was valid about me. They take hiring very seriously.\r\n\r\nIt all worked out in the end though. The job offer came the next day, and MY GOD, the pay was beautiful.\r\n\r\nDrug test followed a week later.", "Interview Questions": "Tell me about yourself. Are you in school?"}, {"date": "16 Jul 2011", "title": "AmeriCorps VIP Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at United Way (Rancho Cucamonga, CA) in Sept 2010", "Interview Descriptions": "I had applied for the position over 3 months before I received a call back.  I was called in to \"interview\" which was mostly discussion about the position and then I was in.", "Interview Questions": "How would your coworkers describe you?"}, {"date": "21 May 2012", "title": "Business Analyst Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 2 months. I interviewed at United Way in Sept 2010", "Interview Descriptions": "Applied for several positions. Contacted by HR manager for phone interview. Initial phone interview cancelled and hiring freeze insitituted. Followed up by email for several weeks. Phone interview finally rescheduled and was successful. Called in for face to face. Had with three different managers.", "Interview Questions": "What is a natural join?"}, {"date": "16 May 2011", "title": "Fundraising Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at United Way in Jul 2010", "Interview Descriptions": "I applied online and also have a couple of employees vouch for my candidacy.  The interview had three panelists - one from HR, the hiring manager and one panelist from the fundraising team.  The panelists indicated before the interview began what the interview process would be like. Each panelist took turns asking questions, and other panelists took turns writiing down my response if the information resonates with them positively.  The hiring manager told me before the interview began that there wouldn't be any 2-way dialogue - just question and answer, so it's rather stilted.  After the panelists finished the questions, I had a few minutes to ask questions.  The interview took 1 hour.  It took a few weeks for me to find out the outcome and be offered a position, contingent on the outcome of a background check.", "Interview Questions": "What would you do if you fell behind the timeline schedule?"}, {"date": "5 Dec 2010", "title": "Campaign Representative Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at United Way (Granite City, IL) in Jun 2010", "Interview Descriptions": "I emailed the vice president of the Illinois Division and she set up an interview with the Resource Development woman for a week later. At the interview she read over my resume and asked  simple behavior questions (\"how would you handle this..if this happened..\") and since I was still in school she asked what my major was and when I was expected to graduate. The interview was about 10 minutes long. She then introduced me to the other people in the office and gave me a tour. It seemed like she knew she was going to hire me before I walked in.", "Interview Questions": "Are you capable of working on your own with little to no supervision?"}, {"date": "2 Dec 2013", "title": "Loaned Executive Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at United Way (San Antonio, TX) in Jun 2010", "Interview Descriptions": "Opportunity was offered through the graduate MPA (Master's of Public Administration) program at UTSA. Went through the internship department in the college of public policy and applied. The internship is paid, and offers school credit for the MPA program. Highly competitive but amazing opportunity.", "Interview Questions": "They will ask you why you deserve the internship, and you must do this standing as if you are giving a speech \"selling yourself\". "}, {"date": "16 Jun 2010", "title": "Finance Coordinator Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at United Way in Jun 2010", "Interview Descriptions": "It took a while for someone to contact me.  I was finally contacted by phone.  I was completely overdressed.  I wore a pant suit with a collared shirt.  The interview was with the executive director.  He was wearing flip flops and cargo pants.  Obviously, the culture was extremely laid back.  Everyone was very nice.  The interview was over a hour.  After the first interview, I was contacted by email to return and meet members of their board.  However, at this point I realized the organization was not for me.  I declined to continue the application process.  I would suggest that if you are interviewing, you are able to related your previous work experience with the job you are interviewing for.  As previously stated, they are extremely low key.  Regardless, they are looking for employees who are comfortable working and communicating with people on all different levels.", "Interview Questions": "What did you like and dislike most about your previous jobs?"}, {"date": "27 May 2014", "title": "Campaign Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at United Way in May 2010", "Interview Descriptions": "Interviewed with Vice President of Development.  Standard questions about previous fundraising experience.  It was the best interview I've had.  The pay was just too low and they micromanged staff.", "Interview Questions": "N/A"}], [{"date": "21 Dec 2014", "title": "Grants Manager Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at United Way in Feb 2010", "Interview Descriptions": "Interviewed with the VP i would be reporting to, then my potential co-workers--no HR previews.  the hiring manager also looks at and sorts through the resume, HR merely controls the benefits and run pay checks", "Interview Questions": "What did I know about the United Way and the work it does?  So much has changed with this organization over the years--they do way more!  I researched the company by searching through the archives of the local newspaper and checking their website."}, {"date": "31 Jan 2010", "title": "Monitoring and Evaluation Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at United Way (Rochester, NY) in Nov 2009", "Interview Descriptions": "Very cordial, very engaging discussion with the person who supervises the position.  Work environment seemed quiet and not quite casual.  The gentleman who conducted the interview focussed the discussion on a pre-established set of questions relevant to my experience.  The questions were quite general in nature, and didn't provide much scope for discussing the particularities of the position on offer.  (I suppose i needed to get to the next round for that....)", "Interview Questions": "Why should we hire you?"}, {"date": "17 Feb 2010", "title": "211 Coordinator Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 4 weeks. I interviewed at United Way (Orlando, FL) in Nov 2009", "Interview Descriptions": "I was contacted by a representative of a recruiting agency. The agency was in Texas and the job was located in Orlando Florida. I thought that was kind of weird, but I guess its a corporate thing. The recruiter scheduled a phone interview for a later date. On the day of the call, the recruiter was almost 45 minutes late calling. She asked standard questions and inquired about my knowledge of the non-profit industry.", "Interview Questions": "What salary are you looking for?"}, {"date": "13 Jul 2010", "title": "Nonprofit Management Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at United Way in May 2009", "Interview Descriptions": "I had a positive experience with United Way, overall. I applied for a position via their online system and heard back from someone in the HR department fairly quickly. I had a pleasant but somewhat intensive phone interview with a member of the hiring team, and was then invited in for an in-person interview. The first interview was with 2-3 people and was fairly straightforward. A few days later they called me in for a second interview. That interview was in a \"panel\" format, with 5 or 6 participants from various departments, and was much more in-depth. The participants asked intelligent and insightful questions about my experience and qualifications, as well as how I would approach various challenges and situations (most of which were clearly based on the realities of the position). The panel members were very friendly and  personable and helpful, and made sure I had plenty of time to ask questions, etc. It was a very pleasant interview experience; after the meeting the HR rep had me fill out some forms and provide my reference info, and said they'd let me know. However, nobody ever contacted me. I called the HR rep and left two messages inquiring if the position had been filled, but never got a response. I didn't mind not being offered the job - it was a very tight job market and a very desirable position - but I would have appreciated a phone call letting me know either way. They seemed to be going through some organizational turmoil, so that may have been a factor, but it was a disappointing end to the experience.", "Interview Questions": "N/A"}, {"date": "8 Mar 2010", "title": "Development Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 2 weeks. I interviewed at United Way in Jun 2008", "Interview Descriptions": "First there was a quick phone interview, then 1 long interview where groups of 2 interview you and then you meet with HR\r\n\r\ninterviews are easy because there is no real structure or questions", "Interview Questions": "What are interest ad hobbies, why would you be good at this job?"}, {"date": "12 Jan 2010", "title": "Marketing Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 4 weeks. I interviewed at United Way (Boston, MA) in Jan 2008", "Interview Descriptions": "I initially applied for one job and was offered my choice between that one and another for which they thought my skills were a fit.  They seemed interested in figuring out how to match my interests and skills to an open position in the organization.  Downside: The hiring process to a really long time.  A REALLY long time.  So long that I had thought they had moved on.", "Interview Questions": "Tell us about an experience that equipped you for this role"}]]