[[{"date": "1 Jul 2023", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Inova", "Interview Descriptions": "Pretty standard and surface level questions. They took a while to get back to me after I applied. After they got back to me, I did a phone interview and then after that I was invited for an in person interview. They took some time after that to get back to me.", "Interview Questions": "Why do you want to work here at Inova?"}, {"date": "12 Jun 2023", "title": "Clinical Technician I Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Inova (Fairfax, VA)", "Interview Descriptions": "Clinical Technician Interview ... Phone screen interview with the talent scout person. Then they will email you again if you got to the second phase of the interview with the clinical director and hiring nurse.", "Interview Questions": "describe a time you went above and beyond to help a patient?"}, {"date": "9 Jun 2023", "title": "Clinical Technician I Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Inova (Alexandria, VA)", "Interview Descriptions": "2 steps, phone interview then in person on unit, straight to the point, thorough, 2 supervisors during in person invterview, asked questions about previous healthcare experience, asked about willing start date", "Interview Questions": "why did you leave your last position?"}, {"date": "7 Jun 2023", "title": "Medical Technologist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Inova (Alexandria, VA)", "Interview Descriptions": "interview was very technical based. they asked questions about lab processess. they also wanted to make sure I am flexible because they expect you to work alot of night shifts and cover off shifts in general", "Interview Questions": "asked a question regarding hematology sample with cold agglutinin"}, {"date": "28 Jun 2023", "title": "Senior Financial Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Inova (Fairfax, VA) in Jun 2023", "Interview Descriptions": "Via zoom, a bit impersonal. Team culture not well described. Pay seemed well below market average for similar positions elsewhere. Seemed to be squeezing interviews in vs dedicating time to listen and respond appropriately.", "Interview Questions": "Excel skills, why leaving, etc."}, {"date": "7 Jun 2023", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Inova (Fairfax, VA) in Jun 2023", "Interview Descriptions": "You get a phone call from a hiring recruiter, if they like you and you qualify then you get an interview which is usually with a few members of the team. They ask basic questions such as tell me about yourself, what are your strengths and weaknesses, and why you chose inova.", "Interview Questions": "Tell me about a team you dealt with a difficult patient or coworker and how you overcame it"}, {"date": "5 Jun 2023", "title": "Medical Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Inova (McLean, VA) in May 2023", "Interview Descriptions": "I first interviewed with a recruiter, who referred me to a more specific recruiter. After that, I interviewed with the hiring manager in the specific medical office I was applying to. Finally, I went into the medical office to shadow the others in the position I applied for. The shadowing process took about an hour. They then got back to me by the end of the week.", "Interview Questions": "Why do you want to work in healthcare?"}, {"date": "19 May 2023", "title": "Educator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Inova (Fairfax, VA) in May 2023", "Interview Descriptions": "Easy! Recruiters great to work with. Everyone gave glowing reviews of this workplace. Seems like a very supportive place to start working. Would recommend to a friend. Prepare for the interview with reflective questions, they care about who you are and not just what is one your resume - though they do read that too!", "Interview Questions": "How have you grown since starting school?"}, {"date": "22 Apr 2023", "title": "Patient Financial Services Representative Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 2 weeks. I interviewed at Inova (Falls Church, VA)", "Interview Descriptions": "The interview team was delightful, and the job description exactly matched my qualifications. It was a dream come true. Unfortunately there was a screening call that should have happened before the video interview. Hiring managers had reviewed my qualifications, and pushed me forward in the process. During the screening interview that followed, I learned of a stumbling block. When they say on the cover page that every employee must be vaccinated, yes. They do even mean remote customer service roles.", "Interview Questions": "Give an example of excellent customer service you have provided in the past."}, {"date": "18 Apr 2023", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Inova", "Interview Descriptions": "Interview was first on the phone with hiring managers and then in person with larger team. Quick process overall but long day of interviewing. 1 month total from application to offer.", "Interview Questions": "Why I wanted to join inova"}], [{"date": "4 Apr 2023", "title": "Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Inova (Fairfax, VA)", "Interview Descriptions": "Applied online via website. Made it easier to already have a connection via someone in the department or from working in another area. Came in for interview which consisted of primary manager and department manager. Process easy and fair.", "Interview Questions": "Why work for this department?"}, {"date": "4 Apr 2023", "title": "New Grad RN Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Inova", "Interview Descriptions": "The new grad recruiter emailed me a week or two after I submitted my application. We set up a meeting time to discuss availabilities. If you want a specialty, apply 6+ months out from start date, as July spots were already filled when I applied in early February. The recruiter was a bit pushy on which units to apply to. After this initial meeting, you have an interview with the unit manager. Some units have virtual interviews while others ask for you to come in person. The interview was straightforward, asked why I wanted to work on that unit, and questions about my experiences. I think most units try to arrange a shadow day before sending you an offer letter.", "Interview Questions": "Why are you interested in this unit?"}, {"date": "20 Apr 2023", "title": "Registered Respiratory Therapist (RRT) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1+ week. I interviewed at Inova (Falls Church, VA) in Apr 2023", "Interview Descriptions": "Applied via INOVA website received an email by the clinical manager for an in person interview after sending in my CV had an in person interview with in a week of applying", "Interview Questions": "asked me a couple of behavioral questions and how that impacted my decisions"}, {"date": "29 Jun 2023", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Inova (Fairfax, VA) in Apr 2023", "Interview Descriptions": "I've had 4 interviews with different people for different jobs at INOVA over the past 3 months. Most of them were pleasant and not too challenging, your standard run through of jobs, why I left, what I did in between if it wasn't nursing...not a single behavioral example requested; maybe that's at the next step (which I never made it to). To back up for a minute, I am an RN returning to the field after time off for some growth and good stuff (relocation, working in retail for a bit) and some difficult reasons (dad's cancer, my disillusionment with healthcare...,). My resume shows all my nursing jobs and some of the jobs I held when I wasn't working as a nurse. Well, one INOVA interviewer clearly was suspicious. She asked me in 3 different ways if I had been incarcerated, and scoffed at my 3rd answer. So I just said something like, \"I was not in jail. I have never been in jail or even accused of a crime. And don't you do background checks?\" After a pause, she continued with the interrogation about employment gaps (nothing about my jobs as a nurse, that wasn't of interest apparently) and then was wrapping it up. I decided to save us time, and said, \"So, it seems you're needing someone with more recent experience as an RN.\" Indeed she was. In fact, she could have saved us both an hour if she had noted that at the start of the interview, since my resume is reverse chronological and my last nursing job ended in 2019.", "Interview Questions": "\"We have a policy that employees with any convictions disclose them in the hiring process. Will it be a problem to comply with this?\""}, {"date": "28 Mar 2023", "title": "Clinical Technician Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Inova", "Interview Descriptions": "sure easy! They call to set up an in person interview, and you show up on your desired date and time. The hospital is big but they give you great instructions.", "Interview Questions": "Describe a time where you had a difficult patient"}, {"date": "6 Mar 2023", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Inova", "Interview Descriptions": "with manager, then shadow day. It was a 30 minute interview including questions about my nursing school experience. They allowed me to state what I would hope to get out of the position and the role of the educator as a new grad", "Interview Questions": "How would you handle ___insert two different stressful or difficult patient situations and which would you choose to handle first?"}, {"date": "8 Mar 2023", "title": "Unit Secretary Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Inova", "Interview Descriptions": "Very easy, had an interview with two people. This was an extremely good interview process. Everyone was nice and very engaged with the interview, which made me feel very comfortable", "Interview Questions": "Why are you a good fit for this job"}, {"date": "8 Mar 2023", "title": "Social Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Inova", "Interview Descriptions": "One interview. Virtual. 15 min if that. Didn’t even have to prep which was concerning. I believe at the time they were desperately looking for employees and my resume happen to fit their needs", "Interview Questions": "What type of shift would you like"}, {"date": "7 Mar 2023", "title": "Call Center Representative Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Inova", "Interview Descriptions": "The first interview was over the phone with a recruiter , it was a couple of questions and now I have a zoom interview with the office and will see how that goes moving foward", "Interview Questions": "How would you describe yourself"}, {"date": "5 May 2023", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 1 week. I interviewed at Inova (Falls Church, VA) in Mar 2023", "Interview Descriptions": "Spoke to Recruiter then nurse manager, then direct team I would work with. Emailed with all 3 to clarify questions I had. Recruiter sent offer with lower salary than originally stated.", "Interview Questions": "What value would you add to the team? What do you bring to the table?"}], [{"date": "20 Feb 2023", "title": "Social Worker Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Inova", "Interview Descriptions": "They will schedule interviews and frequently no-show to them. The interviewing process is virtually over zoom. Even after reaching back out by email, you will receive no communication about why the no-show occurred.", "Interview Questions": "They didn't ask questions, they no-showed to the appointment that they required me to confirm 3 separate times."}, {"date": "6 Feb 2023", "title": "New Grad RN Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Inova", "Interview Descriptions": "Went through a couple of phone interviews before moving on to the next step and later a video interview via zoom. Eventually went and did an interview with a panel.", "Interview Questions": "Gave scenario questions and asked what you would do in said scenario"}, {"date": "13 Jun 2023", "title": "Advanced Practice Provider Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 months. I interviewed at Inova (Fairfax, VA) in Feb 2023", "Interview Descriptions": "First you do a phone screen, then interview with a hiring manager, then on to the members of the team, can be numerous team members. Depends on the specialty that you are interviewing for.", "Interview Questions": "Describe your experience. Tell us why you'd be a good fit here. Describe your strengths and weaknesses. Highlight of your career."}, {"date": "24 Jan 2023", "title": "Resale Associate Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Inova", "Interview Descriptions": "I submitted the application on their website, and then was contacted pretty quickly to schedule an interview. They have three rounds of interviews through Zoom. The first interview went by pretty quickly. At the second interview, I was being interviewed by the potential colleagues, and then didn't hear anything back after that.", "Interview Questions": "Where do you see yourself five years from now? How are you with different personalities/ diversity? Tell me about yourself."}, {"date": "24 Jan 2023", "title": "Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Inova", "Interview Descriptions": "It was nice and simple. I did not have a panel. The interviewers were so kind but professional. I started my interview with introducing myself and exchanging conversation with them. It was great and made me want to join the team.", "Interview Questions": "1. Explain what I did in my previous jobs? 2. How did you deal with difficult patients? 3. what made I apply for the position?"}, {"date": "4 Jan 2023", "title": "Phlebotomist/Clin Tech III Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Inova", "Interview Descriptions": "It wasn’t too bad depends on the department that you’re interviewing for the overall was generally easy you just need to follow up with a six week orientation that teaches you phlebotomy IV and foley catheter insertion", "Interview Questions": "experience and knowledge about the job"}, {"date": "30 Dec 2022", "title": "Licensed Practical Nurse (LPN) Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Inova", "Interview Descriptions": "Not too bad. Interview over phone. Then a peer interview with a couple of nurses from the department that you are applying for. The peer interview lasted for an 45 minutes to an hour.", "Interview Questions": "What do you do for fun?"}, {"date": "28 Nov 2022", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Inova", "Interview Descriptions": "The recruiter reached out to interview. They were very kind in walking through the resume. The recruiter also set up an interview with the manager to schedule a second interview.", "Interview Questions": "What experiences do you have as an MA"}, {"date": "21 Nov 2022", "title": "Physician Assistant Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. I interviewed at Inova", "Interview Descriptions": "Pretty straight forward, more going over schedule and salary expectation. They will train you as a full time staff but not if you’re PRN. Do not accept as a new grad and prn position. I recommend full time so they will properly train and invest in you. Staff is very nice, but difficult position as a hospitalist if you’re new.", "Interview Questions": "Where do you see yourself in 10 years?"}, {"date": "18 Nov 2022", "title": "Patient Access Representative Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Inova", "Interview Descriptions": "I was well over qualified so I am not sure why I didn't even get an interview it was horrible never again. They want people with HS diplomas and medical experience how are you supposed to have medical experience if you don't give people the chance", "Interview Questions": "what is your availablity in the next couple weeks"}], [{"date": "20 Dec 2022", "title": "Senior Director Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Inova (Remote) in Nov 2022", "Interview Descriptions": "The questions were fast passed and it appeared as though they were only interested in understanding if I knew anyone. The process isn't too long if you get selected to interview with the hiring manager.", "Interview Questions": "1) Explain your past experience 2) Why would you be a good fit."}, {"date": "9 Nov 2022", "title": "Registered Nurse, BSN Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Inova (Fairfax, VA) in Nov 2022", "Interview Descriptions": "The interviewer appeared interested and paid attention to my answers to circle back to them and was happy to answer my questions. After my application was submitted I heard back the next day to set up an interview and the process was overall very relaxed.", "Interview Questions": "Describe a time you had a difficult experience with a coworker/patient and describe what you did to resolve the issue?"}, {"date": "20 Oct 2022", "title": "Unit Secretary Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Inova", "Interview Descriptions": "Over zoom (during Covid). 1. Interview over the phone and the another interview with the unit manager. They ask you questions about your previous experience and if you have any medical background. Even if you don’t, it’s okay.", "Interview Questions": "Have I ever worked with a difficult customer?"}, {"date": "19 Oct 2022", "title": "Registered Nurse Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Inova", "Interview Descriptions": "quick interview, not personable, would not choose to work there. I did not like it. did not accept the job. chose to work elsewhere. oh my gosh quick interview, not personable, would not choose to work there. I did not like it. did not accept the job. chose to work elsewhere. oh my gosh", "Interview Questions": "tell me about yourself please"}, {"date": "12 Oct 2022", "title": "Behavioral Health Therapist I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Inova (Leesburg, VA) in Oct 2022", "Interview Descriptions": "Applied for this position and another. Received a call from a supervisor just a few hours later to set up a Zoom interview the following week. During phone interview, I was asked about my experience. Later that day I received another call from the supervisor about my prospective salary. One day later, I was asked to come in for a tour of the unit I would be working on. A few days later, I was given the tour and the day after that I was extended an offer from HR and accepted.", "Interview Questions": "Since you only have experience in case management, are you still interested in this role providing therapy?"}, {"date": "28 Sept 2022", "title": "Phlebotomist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Inova", "Interview Descriptions": "About the adverse effects of the workers on patients as they work under the Inova department. Be honest regarding your past and why you chose their hospital compared to the other ones.", "Interview Questions": "What kind of impact would you want in the healthcare field?"}, {"date": "21 Sept 2022", "title": "Registered Nurse, BSN Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Inova", "Interview Descriptions": "\nInterview feedback is a type of feedback offered to a candidate after they finish interviewing with your company. Giving productive interview feedback can be good for your employer brand and general company reputation. More often than not, interview feedback is given when a candidate did not the job.", "Interview Questions": "What was the nature of your last role."}, {"date": "24 Aug 2022", "title": "Certified Medical Assistant (CMA) Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Inova", "Interview Descriptions": "Job fair held with multiple positions offered. Refreshments served. On the spot interviews with staff from various sites. Good way to meet potential workplace staff and ask any and all questions.", "Interview Questions": "Describe a time you’ve dealt with a difficult workplace situation and how did you handle it"}, {"date": "28 Jul 2022", "title": "Radiologic Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Inova", "Interview Descriptions": "It was quite easy. The recruiter actually looked out for me. They encouraged me to round my experience, which resulted in more pay. I was very impressed  with the hiring process.", "Interview Questions": "N/A"}, {"date": "14 Jul 2022", "title": "Clinical Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Inova", "Interview Descriptions": "ones you get a call from a recruiter the process is fast. they are very responsive. very smooth process.  the recruiter was very helpful ones the process started. only down side is waiting when applying for someone to get to you.", "Interview Questions": "why are you interested in this position "}], [{"date": "8 Jul 2022", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at Inova", "Interview Descriptions": "Interview process was fairly standard, and I appreciated the opportunity to shadow the unit. However, I was never contacted when I didn't get an offer, and had to log in to the portal to find out I was no longer being considered. I would have appreciated at least a letter.", "Interview Questions": "Tell us about a time you disagreed with a coworker and how you handled it. \r\n\r\nTell us about a time you advocated for a patient.\r\n\r\nWhere do you hope to be in a two years?"}, {"date": "30 Aug 2022", "title": "Talent Acquisition Sourcer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Inova (Falls Church, VA) in Jul 2022", "Interview Descriptions": "Applied online and had one interview on Zoom with the hm. She advised me of her hard deadline of when she will get back to me with a decision, but I still haven't heard anything back. My status says \"Under Consideration\" a month after she said she would get back to me.\r\n\r\nIf the hiring decision is this slow, it makes me wonder if the department is a hot mess and disorganized.  If you can't decide between 4-5 people, I question your judgment skills. \r\n\r\nRed flag!!!", "Interview Questions": "Where do you see yourself in five years?"}, {"date": "28 Jul 2022", "title": "Senior Program Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Inova in Jul 2022", "Interview Descriptions": "I didn't actually get to the interview process but had a negative experience trying to schedule an interview. \nI was contacted by a senior recruiter to set up a 15 minute phone screen, using their scheduly account. I received an email confirmation of the time and day of received a text message confirming the time I selected. The recruiter called and left me a mean voicemail 30 minutes before our scheduled call saying that they waited for me but didn't have time to wait around and that I could call them later in the day. When I got in touch with the recruiter at our confirmed scheduled time, they notified me that my original scheduled screen time no longer worked for them and they had rescheduled my screen a half hour earlier--but never notified me. I communicated this to them and their answer was \"well it's on my calendar, so it must be your error\". \nAnnoyed, but still interested in the position, I agreed to call back at the new time we agreed upon. However, I called the recruiter twice at the new time with no answer and their voicemail box full so I could not leave a message. The recruiter never called me back, but instead sent an email over the weekend apologizing for the confusion and asked to reschedule. I emailed and gave a couple times I was available for rescheduling and never heard back from the recruiter. \nIt's highly unprofessional and if this is how they treat job applicants, I can't imagine how they treat actual employees.", "Interview Questions": "N/A"}, {"date": "29 Jan 2023", "title": "Nurse Navigator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 3 weeks. I interviewed at Inova in Jul 2022", "Interview Descriptions": "The Nurse Recruiter set up separate Zoom interviews with the manager and various team members. I never had an opportunity to see the facility before being extended an offer. An offer was made not too long afterwards.", "Interview Questions": "Why are you interested in this position?"}, {"date": "31 May 2022", "title": "Clinical Therapist I Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Inova (Falls Church, VA)", "Interview Descriptions": "HR reached out to me a month after I applied and set up a phone interview. HR staff was very kind and did his best to answer my questions. Afterwards they set up a zoom interview with two directors and another staff member. The interview questions were straightforward and felt more like a conversation. Everyone was super kind however, they were extremely late (about an hour). I understand the medical field is very busy and things happen so I did not take it personal. The director answered all my specific questions and was very responsive to follow up email.", "Interview Questions": "They asked about trauma informed care and your knowledge about trauma"}, {"date": "6 Jul 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Inova in Jun 2022", "Interview Descriptions": "The interview was both brief and questions were relatively straightforward. The hiring manager and staff on the unit were very warm and welcoming.  I was also able to stay afterwards and shadow on the unit.", "Interview Questions": "Tell me a time when your coworkers could tell you were stressed, and how did you handle this situation? \n\nHow do you respond to criticism in the workplace? \n\nTell me a time when you advocated for a patient."}, {"date": "31 May 2023", "title": "ROI Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Inova (Fairfax, VA) in May 2022", "Interview Descriptions": "Applied for the position, at first, I received phone call from recruter, after zoom interview, after 3 weeks in person interview 25+ questions no salary discussed , after 2 weeks letter offer.", "Interview Questions": "What is your strength and weakness"}, {"date": "20 May 2022", "title": "Social Worker Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Inova (Fairfax, VA) in May 2022", "Interview Descriptions": "asked questions about scenarios I have experienced in the past and how I handled them.  What types of treatment plans I would use in therapy. They asked about situations where things got out of control and how I handled them.", "Interview Questions": "Describe a time when you has to prioritize different tasks and how did you do that. "}, {"date": "28 Apr 2022", "title": "Psych Emergency Clinician I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Inova", "Interview Descriptions": "Standard interview questions (how would you handle difficult clients, etc.), short and to the point. It was a zoom call. Discussed what to expect in an average shift and who would be on your team willing to support you.", "Interview Questions": "\"How would you respond to an organizational shift that you were not informed about?\""}, {"date": "27 Apr 2022", "title": "PC Technician Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Inova", "Interview Descriptions": "It was pretty simple and easy. prior experience in the it field was not required and the recruiter was very nice. however, it really depends on the management you work with", "Interview Questions": "What is some prior experience you have"}], [{"date": "25 Apr 2022", "title": "Social Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Inova (Arlington, VA)", "Interview Descriptions": "There was a panel interview and I was given an opportunity to ask any questions that I had at the end. Th interview was about 45 minutes and I heard back weeks later.", "Interview Questions": "Situational questions because of the line of work."}, {"date": "16 Jul 2022", "title": "RN/BSN Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Inova (Washington, DC) in Apr 2022", "Interview Descriptions": "Interview by computer with the nurse manager the INOVA. The manager was so rude in the end the interview. I was so nrvous and I think that I was prejudy by my english, because I don't speaking english very well. But this was my frist interview and I think the emphaty is so important in this moments.", "Interview Questions": "what type of vasoactive drugs do you use?"}, {"date": "29 Mar 2022", "title": "Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Inova", "Interview Descriptions": "It was professional and organized. I believe it was one of the best interviews i have went through. The manager was respectful and allowed me to ask questions. I would recommend looking into this health system.", "Interview Questions": "Why did you choose to apply with INOVA?"}, {"date": "28 Mar 2022", "title": "Child Life Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Inova", "Interview Descriptions": "Professional and appropriate, courteous staff, knowledgeable and answered questions.  Easy to contact director, answered questions, transparent about expectations. Flexible and considerate with needs. Would recommend interviewing with this organization. Good experience and well done.", "Interview Questions": "Past experiences and how to handle situations."}, {"date": "24 Mar 2022", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Inova", "Interview Descriptions": "The Manager provided me with an application, asked me to complete it along with two professional references and submit back to the noted contact. Within two weeks I received a call from the site manager to discuss my availability to join the team.", "Interview Questions": "What day(s) are you available to work?"}, {"date": "3 Mar 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Inova", "Interview Descriptions": "Interview process set up thru the recruiter. It was organized well. I met with recruiter he interviewed me.  then followed up to see if the higher up would like to meet me. He scheduled a meeting with unit and others.", "Interview Questions": "Why did you choose this profession"}, {"date": "28 Nov 2022", "title": "Unit Secretary Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Inova (Fairfax, VA) in Mar 2022", "Interview Descriptions": "The interviewer do most of the talking. Tell me something about yourself, what project has you work with excel, how did you overcome something. 7-10 question at most and very easy.", "Interview Questions": "The interviewer do most of the talking. Tell me something about yourself, what project has you work with excel, how did you overcome something. 7-10 question at most and very easy."}, {"date": "30 Dec 2021", "title": "Clinical Technician I Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Inova", "Interview Descriptions": "First thing was to make a phone screening appointment. Some floors ask you to email them your availability while others give you a link to make it. During the phone screening, the recruiter will ask about your experience in healthcare and your interest in the position. If they feel you’re a good candidate, you’ll be placed in the Clinical Tech Academy where you’ll be learning from 8-4 and possibly overtime. \r\n\r\n**One thing that made me iffy was that the recruiter was half an hour late to my screening. I’m not sure if if was indicative to their management/floor.**", "Interview Questions": "Tell me about yourself and any experience you have in healthcare "}, {"date": "11 Jan 2023", "title": "Registered Nurse Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Inova (Fairfax, VA) in Jan 2022", "Interview Descriptions": "You need to submit online application then recruiter reaches out for phone interview. then, virtual/in-person interview with shadowing I was pretty typical type of interview process very friendly very easy process", "Interview Questions": "Why are you changing specialty? Why did you quick the previous job?"}, {"date": "30 Dec 2021", "title": "Research Project Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Inova", "Interview Descriptions": "It was a two part interview - a zoom call and an in-person shadowing experience. I was able to meet some team members in person and see what a day to day activity was like for my team mates.", "Interview Questions": "How do you handle stressful situations?"}], [{"date": "29 Dec 2021", "title": "Registered Nurse Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Inova", "Interview Descriptions": "It was long and thorough and took a long time to get interviews. I did enjoy talking to most managers as they were transparent with the job. I wish the recruiters would reach out fast enough.", "Interview Questions": "What is your current salary"}, {"date": "7 Dec 2021", "title": "Nursing Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Inova", "Interview Descriptions": "First Call interview , secondly, HR interviews.  Waiting for a weeks to heard back the results . One of question about why you want to join the Inova? Do you have any experience pertaining to the job", "Interview Questions": "Why are you interested in joining iNOVa"}, {"date": "2 Jun 2022", "title": "MLS Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 3 weeks. I interviewed at Inova in Dec 2021", "Interview Descriptions": "Interview was over zoom. They were very fast to be honest, though they are a popular school for MLS so I'm sure they have lots of candidates to get through. The interview questions are mostly straight forward though and I did not feel intimidated by the people interviewing me.", "Interview Questions": "They asked what my favorite science specialization was and what skills I could provide to Inova."}, {"date": "5 Jul 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Inova (Falls Church, VA) in Dec 2021", "Interview Descriptions": "Panel like interview where the regular “tell me about yourself” questions were asked. Staff were included on the panel as well as the nurse educators and nurse manager. Afterwards you were given the option to tour the unit.", "Interview Questions": "Tell us a little bit about you."}, {"date": "28 Sept 2021", "title": "Clinical Technician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Inova (Arlington, VA) in Sept 2021", "Interview Descriptions": "Phone screen interview with the talent scout person. Then they will email you again if you got to the second phase of the interview process. Usually takes about a week or even a few days to hear back if you got the second interview or not.", "Interview Questions": "What are your biggest strengths?"}, {"date": "10 Jul 2021", "title": "Public Relations Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through other source. I interviewed at Inova (Falls Church, VA)", "Interview Descriptions": "Surprisingly, it was a short interview process. There were two rounds of one on one interviews and then I received the offer. Both interviews were long and discussed strategy, background and specific experience.", "Interview Questions": "‘Describe a time when you collaborated across multiple groups. "}, {"date": "2 Jul 2021", "title": "Registered Nurse Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Inova", "Interview Descriptions": "The HR representative came completely unprepared to a prescheduled phone interview. She hadn’t even looked at my resume and was unsure of the role I was applying for. It was a waste of both of our time.", "Interview Questions": "She asked me about my previous experience but it was basic information that was on my resume. She didn’t dive deeper and said that I could be offered a role for part time rather than the per diem role I was applying for."}, {"date": "10 Sept 2021", "title": "Human Resources Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Inova in Jul 2021", "Interview Descriptions": "The interview process took longer than expected. It took about 2 weeks before I got a callback. Once I did I was scheduled with a manager for an interview. The interview with the manager was okay. Then the recruiter followed up with the offer but seemed unorganized and didn't know what was going on.", "Interview Questions": "Tell me about a situation in which you had to deal with a difficult client. "}, {"date": "25 Jun 2021", "title": "Registered Nurse, Emergency Room Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Inova", "Interview Descriptions": "Smooth application process. Talked to bith a recruiter first and then had a zoom interview around a week later. Both people that I talked to were nice and very easy to talk to.", "Interview Questions": "What was a time you had to advocate for a patient?"}, {"date": "19 May 2021", "title": "PTA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Inova", "Interview Descriptions": "easy on board with lots of assistance. Inova staff is very helpful and looking for you to succeed. Although, it did take some time with paperwork, training and on board, it was worth it.", "Interview Questions": "What brings you to inova?"}], [{"date": "18 May 2021", "title": "Patient Registration Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Inova", "Interview Descriptions": "Interview process was well coordinated and ran smoothly. I had an interview with the hiring manager and was scheduled for employee screening after accepting the position. I was also required to go off site for training prior to starting job.", "Interview Questions": "How precious experience matched position I was interested in. "}, {"date": "18 May 2021", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Inova", "Interview Descriptions": "Very easy video interview. Interview was with the department manager first, and then another interview with a current department employee. In person interview was deferred due to COVID. Scheduling was easy. Great experience overall.", "Interview Questions": "Tell me about your past employment."}, {"date": "24 Apr 2021", "title": "Communications Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Inova", "Interview Descriptions": "Applied online.  Was contacted by two different people in recruitment for a phone screen. Scheduled a time for a zoom call.  Logged into zoom at the scheduled time, the interviewer never showed up.  After 10 minutes I sent a follow up email offering to to re-schedule, never heard from them again.  No clue what happened on their side. They couldn't even be professional enough to cancel the interview or apologize for wasting my time.", "Interview Questions": "Didn't have any. They didn't bother to show up for the interview"}, {"date": "28 Apr 2021", "title": "New Grad RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Inova", "Interview Descriptions": "Easy but stressful. I applied online on their website, got an email from a recruiter in about a week for a phone interview, then an email from the unit manager a week later to set up an in person shadow and interview.", "Interview Questions": "Why do you want to work at Inova?"}, {"date": "14 Jun 2021", "title": "BH Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Inova (Fairfax, VA) in Apr 2021", "Interview Descriptions": "Positive, hopeful and efficient. It was quickly established and followed up on, and the interviewers were kind and allowed me to highlight my skills. We're going to be a great match!", "Interview Questions": "I was asked questions re: knowledge of theoretical approaches "}, {"date": "15 Mar 2021", "title": "Medical Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Inova", "Interview Descriptions": "I got in touch with a recruiter recently. This actually has taken over a year for me. She was very helpful over the phone and friendly.  Unfortunately, I was not fit for the position I applied for. Thankfully, the recruiter helped find a different position she thought I was best fit for.", "Interview Questions": "Tell me about your experience in the clinical setting?"}, {"date": "30 Jan 2021", "title": "Clinic Manager Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Inova", "Interview Descriptions": "Phone screening with recruiting personnel the phone screening by the director  followed by multiple rounds of panel interviews with leadership personnnel involving various questions about your background and experience as well as future career desires.", "Interview Questions": "How  do you deal with difficult situations "}, {"date": "28 Jan 2021", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Inova", "Interview Descriptions": "Panel interview with several people including the nurse educator, the nurse manager, and a couple other members of the team. It was a good interview and the vibes were great. It was a very diverse environment", "Interview Questions": "Pick three things to describe yourself."}, {"date": "27 Jan 2021", "title": "Medical Scribe Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Inova", "Interview Descriptions": "One time interview. Super simple. Asked about previous experience. Tell Me About Yourself.\nHow Did You Hear About This Position?\nWhy Do You Want to Work at This Company?\nWhy Do You Want This Job?", "Interview Questions": "Why Do You Want to Work at This Company?"}, {"date": "19 Jan 2021", "title": "Manager Outpatient Practice Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Inova", "Interview Descriptions": "I applied on the LinkedIn app. It was easy to apply through the LinkedIn app with easy apply feature. I did hear back quickly from them. I didn’t get an interview.", "Interview Questions": "Didn’t get through to interview "}], [{"date": "30 Dec 2020", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Inova", "Interview Descriptions": "The interview was a group interview with the units management, educator, and floor RN. Mostly situational questions asking how I would handle certain situations. I was extended an offer with in a week.", "Interview Questions": "Talk about a time when you made a mistake while working. "}, {"date": "24 Jan 2021", "title": "New Grad RN Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Inova (Arlington, VA) in Jan 2021", "Interview Descriptions": "got an email from a recruiter asking if I was still interested in the position that I applied for - \nhad and a brief interview with the recruiter and the hiring nurse. waiting for a job offer or not... still pending", "Interview Questions": "Why do you want to work for Inova?"}, {"date": "4 May 2021", "title": "Health Educator II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Inova in Jan 2021", "Interview Descriptions": "Just one phone interview, nothing in person. very, fast easy, they're trying to hire bodies it seemed. Hired almost everyone they interviewed (assuming). Really kind and nice hiring manager. Really fast process, offered the position immediately over the phone", "Interview Questions": "Background, school, experience in customer service, what you're schedule is like, how many hours"}, {"date": "31 Jan 2021", "title": "Nurse Extern Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Inova (Fairfax, VA) in Jan 2021", "Interview Descriptions": "Similar questions to email questions so all interview questions had already been thought about. Online application, then email question and answers then verbal interview, which was over zoom for covid. 1 month until offer", "Interview Questions": "Why do you want to work here\r\nWhat is a strength and weaknesz"}, {"date": "23 Dec 2020", "title": "Analytics Designer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Inova", "Interview Descriptions": "I got an invitation for interview 5hrs after I applied. Got interview scheduled so fast. The recruiter was so nice just asked basic questions and told me the exact day  I will get the update.", "Interview Questions": "Why did you apply for this position?"}, {"date": "24 Nov 2020", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Inova", "Interview Descriptions": "You first get an e-mail about whether you are up for the position or not. Then you talk with the RN recruiter then he/she will let you talk to the hiring manager", "Interview Questions": "-Why did you want to work for INOVA?\n-What made you want to be a nurse?"}, {"date": "3 Jan 2021", "title": "Registered Nurse, BSN Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Inova (Fairfax, VA) in Nov 2020", "Interview Descriptions": "Applied online. Received an e-mail from the recruiter the next day.  Scheduled an on-site interview the same or the following week.  Interviewed with the unit manager and educator. Many situational questions.", "Interview Questions": "\"Tell me about yourself, why do you want to work in this unit and why did you chose INOVA?\""}, {"date": "5 Nov 2020", "title": "Administrative Fellowship Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Inova in Oct 2020", "Interview Descriptions": "The entire process took about 3 weeks including four different virtual interviews with a total of 7 Inova leaders including the CFO and CPO.  It was portrayed that they were working on improving their culture.  Everyone I interviewed with was upbeat, positive and friendly.  The interview questions themselves were fairly generic and easy.  Unfortunately, it appears that I have been ghosted since the final round as e-mails have not been returned and I have not heard of a decision.  This is unacceptable for any organization especially one where leaders went out of their way to speak about how important culture is.", "Interview Questions": "Why do you want this position?  What do you think are the current and future challenges in medicine?"}, {"date": "14 Sept 2020", "title": "Case Management Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Inova", "Interview Descriptions": "First was a quick phone interview with a recruiter, then a video interview with the director, followed by a panel video interview with current employees. Total process took a couple weeks to go through.", "Interview Questions": "What are your strengths and weaknesses?"}, {"date": "10 Sept 2020", "title": "New Grad Registered Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Inova", "Interview Descriptions": "I applied online through indeed, I had to make an account for INOVA applicants and answer a few questions. I was contacted by a recruiter via email and we set up a time to talk a couple days later. The phone interview was with a recruiter and it  was quick, only 3 questions and I am moving on to the next stage which is an in-person interview.", "Interview Questions": "Start by telling me a little about yourself."}], [{"date": "8 Sept 2020", "title": "New RN Grad Fellowship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Inova in Jul 2020", "Interview Descriptions": "I was first contacted by a recruiter through email to schedule a phone interview. The phone interview was about 10 minutes long. I was asked about my interests and experience and about where I was in my licensure process. The recruiter told me she would send my information to the unit manager and email me if the unit manager wanted to schedule a zoom interview. I got an email a few days later to schedule a zoom interview with three of the unit managers. The zoom interview was very relaxed and the managers were very friendly and seemed very interested in getting to know me. I got a call later that afternoon from the recruiter telling me that I was extended an offer and I accepted.", "Interview Questions": "What are you most excited about working here/ what are you most scared of?"}, {"date": "31 Mar 2023", "title": "EMT-B Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Inova in May 2020", "Interview Descriptions": "Asked general healthcare questions you'd expect in an interview for an ER technician. They were respectful and gave a tour of the department afterwards. Waited a bit before the interview but they called me back as soon as they were available.", "Interview Questions": "What do you think is an important skill a healthcare provider should have?"}, {"date": "11 Mar 2020", "title": "Unit Secretary Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Inova", "Interview Descriptions": "It wa slovely experience and fun. Question level was easy and would definutely recommend. Was given small notice for coming. There were two people who interviewed me and then introduced me around the place.", "Interview Questions": "Goals in 5 yr"}, {"date": "10 Aug 2020", "title": "New Grad RN Residency Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Inova in Mar 2020", "Interview Descriptions": "Contacted by a recruiter, had a video interview with two unit managers, then notified a fee days later about the offer. Overall it was straight forward and and easy process. I think they have stopped video interviews and have switched back to in person.", "Interview Questions": "Why do you want to be a nurse?"}, {"date": "28 Feb 2020", "title": "New Grad RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Inova in Feb 2020", "Interview Descriptions": "Applied at 10pm and received an email the next day in the morning. Phone interview scheduled per my availability. On site interview at the unit one week later per my schedule. Received an offer the next day.", "Interview Questions": "What are your weaknesses? What do you need to improve on?"}, {"date": "8 Mar 2020", "title": "Clinical Technician Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Inova (Falls Church, VA) in Feb 2020", "Interview Descriptions": "You are interviewed by the head nurse, basically; then you are interviewed by the charge nurse, along with a clinical technician. After that, you will be shown around the unit.", "Interview Questions": "How did you dealt with conflict in a workplace?"}, {"date": "7 Feb 2020", "title": "Registered Nurse, BSN Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Inova (Fairfax, VA) in Jan 2020", "Interview Descriptions": "It really depends on the recruiters that's working on your application. Some are pretty quick and some takes forever to respond until you get an opportunity for the phone interview.", "Interview Questions": "Why did you choose nursing, what are your long-term goals"}, {"date": "6 Nov 2019", "title": "Student Extern Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Inova", "Interview Descriptions": "Very easy, went in asked a few questions. I was early so they actually took me early. Many other people were interviewing at the same time but with different people. It took 2 months to hear back.", "Interview Questions": "What would your clinical instructor say about you?"}, {"date": "7 Oct 2019", "title": "Occupational Therapist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "The process took 2 weeks. I interviewed at Inova (New York, NY)", "Interview Descriptions": "Filled out an online form . I received an email from a recruiter from their hr  department and an interview was set up immediately. The interview which would be the first I assume.  It was a  indept 40 minute quiz of various diagnosis that you may end up treating. R cva versus L cva , Asia scale, ranchos Los amigos..ect  Verbalizing making goals on the spot ect , it felt like a verbal board exam than an interview to be honest. It did not come off as a warm nor friendly enviorment to grow and learn. There was no tour of the facility nor tour of treatment gyms . They seemed very clear on what they wanted however I did not feel comfortable. \n\nMy work ethic could have been ask via my references that were also never asked of. Rather then getting to know me felt like I was going to be a cog in the wheel . I did not feel like it was a good fit for me.  However it may be for someone else .  \n\nThe work life culture as well as holidays were explained pretty fast . They will always be mentors around however they want you to be independent.  Of course with hospital systems holidays are few . When you worked on weekends you take a day off . It didnt seem like you had a designation of diagnosis to treat. You treat where you are needed . So you may get various diagnosis.  You are not assigned a doc patient caseload which can be confusing with communication of needs ect although I'm sure not a big deal. \n\nI did not get an offer . So take this with a grain of salt . But I will say this i have worked in a hospital system before and felt absolutely welcomed . Go with your gut instinct if you feel like you will be valued as a person and you will get the opportunity to learn and grow as a therapist and not just valued by your work in hours as an employee then by all means take it.", "Interview Questions": "what's the difference between a r cva and L cva"}, {"date": "2 Oct 2019", "title": "Clinical Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Inova", "Interview Descriptions": "Had an interview with the Charge Nurse, it was fast simple and they were super friendly. I waited on the break room for 10 minutes then i was taken to the an office.", "Interview Questions": "how would you handle a problem/argument  with a coworker? "}], [{"date": "5 Sept 2019", "title": "MHT Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Inova", "Interview Descriptions": "Met with manager and charge nurse, was asked questions from both. Was not prepared when attending orientation; did not know what came next. Had to call manager and be informed I was to report to the hospital the next day- was unprepared due to this", "Interview Questions": "What is one time you faced a challenge in the workplace?"}, {"date": "27 Sept 2019", "title": "Human Resources Generalist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Inova (Merrifield, VA) in Sept 2019", "Interview Descriptions": "Smooth, staff very friendly.  From the moment I walked in I felt very welcomed.  I was introduced to the team I would work with and the supervising team as well.", "Interview Questions": "Basic HR Questions and \"what would you do\" questions. "}, {"date": "23 Sept 2019", "title": "Pharmacy Technician Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 3 months. I interviewed at Inova (Falls Church, VA) in Aug 2019", "Interview Descriptions": "You are contacted by a recruiter that sets you up for onsite interview. The recruiting process is excellent and they try to work to get you placed. But the staffing that does the onsite interview is horrible. They really waste your time giving you false information", "Interview Questions": "What made you choose Inova?"}, {"date": "17 Jul 2019", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Inova", "Interview Descriptions": "Great interview process very easy. Great people. Great company to work for. Amazing atmosphere . Hiring process was easy and simple. No complaints. Stress free. Hiring process I had to take a test and a personality exam on the computer", "Interview Questions": "How did you hear about us?\r\nHow would you describe life as an RN?\r\nHow do you like your friends and family?\r\nHow did you get here today?"}, {"date": "15 Jul 2019", "title": "Team Leader Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 7 weeks. I interviewed at Inova", "Interview Descriptions": "Quick interview process overall. From the phone screening to the in person interview. The organization looks to hire quickly. Usually, the phone interview is ten minutes max, and the in- person can be up to an hour.", "Interview Questions": "What are five words, you would use to describe yourself? "}, {"date": "3 Jul 2019", "title": "Rehabilitation Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Inova", "Interview Descriptions": "Great Interview process,  employers took the time to answer all questions and concerns.  Once the interview was over, I was given the opportunity to tour the facility.  Great place to work", "Interview Questions": "Why did you want to be in this field? "}, {"date": "29 Jun 2019", "title": "EMT Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Inova", "Interview Descriptions": "Initial application is filled out online. The recruiter will contact you to schedule an in-person interview. The in-person interview is with the clinical director. The recruiter will contact you again if you get an offer.", "Interview Questions": "What do you think the role of the EMT is in the ER?"}, {"date": "30 Sept 2019", "title": "Research Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Inova (Fairfax, VA) in Jul 2019", "Interview Descriptions": "First came in for an interview with 2 of the team supervisors, then came in the next week for a shadowing and panel interview with 4 or 5 of the other research associates and a different supervisor. The first interview went well, pretty typical questions about you and your general work experience. The second interview/shadowing was much harder, the other research associates were all pretty nice, however the other supervisor was almost condescending in the way she asked questions. There were times when she would ask me a question and then interrupt halfway through my response which just became awkward at a certain point. I'm sure she had the best intentions but I felt like she was talking to me like I was a complete idiot to the point where I could already tell she would get on my nerves had I taken a position. Following the interview I spent time shadowing the other associates throughout the hospital and they were all much nicer and curious to learn about my goals and ambitions.", "Interview Questions": "First interview was also questions about your work history and habits, typical of any interview. The second interview was work related habits and problems and how you dealt with them."}, {"date": "31 Jul 2020", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Inova in Jul 2019", "Interview Descriptions": "very straight forward, clinical director was friendly and made interview easy. Manager showed me around the unit and introduced me to the staff. The process was straight forward and i got a response from the clinical director about the job, a few days after the interview.", "Interview Questions": "How do have you resolved conflict in the past with a coworker "}, {"date": "19 May 2019", "title": "NICU New Graduate Nurse Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 3 months. I interviewed at Inova (Fairfax, VA) in May 2019", "Interview Descriptions": "Applied online recieved an invitation to interview about 2 months later. Interviewed a week later and heard back about 2 weeks after the interview.  The process after you are contacted is pretty smoothe but they take a while to sort through the applications.", "Interview Questions": "Why NICU? Tell us about a time where you worked as apart of a team? Strengths and weaknesses? "}], [{"date": "1 Sept 2021", "title": "Registered Nurse - Cardiac Operating Room Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Inova in May 2019", "Interview Descriptions": "Applied with 3yrs main OR experience, application reviewed by educator to interview on this unit. 6 hour process: unit shadowing, peer interview, and interview by management (lead first assist, educator, unit manager).", "Interview Questions": "Career goals within 3 years"}, {"date": "14 Apr 2019", "title": "Senior Administrative Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Inova (Fairfax, VA) in Apr 2019", "Interview Descriptions": "I applied online and received an email from the recruiter. The recruiter asked preliminary questions which I responded through email. Next, the recruiter scheduled a phone screening the following week.  The phone screening was to make sure I had the minimum qualifications. The recruiter was great. She set me up with 3 interviews in different departments at one of the hospitals. I went to two out of three interviews. The first one consisted of 2 in person interview: One with the hiring manager, then a panel interview with the physicians and admin team. The other interview consisted of a phone interview with the hiring manager, then an onsite interview with the physicians and admin team. Both interviews went well. The atmosphere was laid back and friendly. I received offers from both departments and chose which department  I felt would be the best fit.", "Interview Questions": "Name a time I had to deal with a difficult patient "}, {"date": "20 Jan 2020", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 5 days. I interviewed at Inova in Apr 2019", "Interview Descriptions": "Brief phone interview with manager. Since this was an unpaid internship the screening process wasn’t very difficult at all. I talked to the manager twice over the phone and was offered the volunteer/internship position.", "Interview Questions": "What experience do you have relating to this position "}, {"date": "4 Mar 2019", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. I interviewed at Inova", "Interview Descriptions": "Hired for prn through a recruiter. The process was organized and I received excellent training even though I came in with experience.  I still didn't feel rushed to be on my own before I felt completely comfortable.", "Interview Questions": "Tell me about yourself and why you want to work here "}, {"date": "22 Feb 2019", "title": "Clinical Technician Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Inova (Alexandria, VA) in Feb 2019", "Interview Descriptions": "Had a phone interview after 1 week of applying online. During the phone interview, I had in-person interview scheduled. My in-person interview lasted around 30 min with hiring manager and a nurse.", "Interview Questions": "If there were several nurse that come up to you with different task at one time, how would you deal with that situation."}, {"date": "22 Jan 2020", "title": "CMA Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Inova (Arlington, VA) in Feb 2019", "Interview Descriptions": "I spoke with the recruiter. She submitted my profile and scheduled an interview. My interview was with 3 people. It wasn't intense and they asked great questions about myself and my wo", "Interview Questions": "Why do I want to work with this company?"}, {"date": "19 Nov 2021", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Inova (Falls Church, VA) in Jan 2019", "Interview Descriptions": "Interview consisted of myself and 2 nurse leaders. The questions were focused of practical nursing strategies an handling cultural differences in the workplace. The interviewers were friendly and easy to converse with.", "Interview Questions": "Can you think of a time when you had to care for a patient whose cultural practices were against your personal beliefs. "}, {"date": "19 Feb 2023", "title": "Recruiter Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Inova in Jan 2019", "Interview Descriptions": "The interview process was quick and easy. I was in and out in less than an hour. It was a panel interview with 3 Inova TA leaders. It was a very easy interview.", "Interview Questions": "How have you handled working with tricky hiring managers in the past?"}, {"date": "19 Dec 2018", "title": "Financial Services Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at Inova", "Interview Descriptions": "It was about 20-30 minutes long. It was a phone interview. The recruiter asked 2 to 3 questions. The questions were easy and straight forward. The recruiter went over job responsibilities, pay and the company. There is also a follow up interview in person.", "Interview Questions": "Why do you want to work for the company? \r\nDescribe your work experience related to the position you applied for ? "}, {"date": "9 Nov 2022", "title": "Administrative Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Inova in Dec 2018", "Interview Descriptions": "The interview process was easy. I sat down with three managers and each individual asked me questions. It was a little nerve-wracking at first because I only expected one person however, I was able to answer the questions an ease.", "Interview Questions": "what are your greatest streghths?"}], [{"date": "19 Nov 2018", "title": "Senior Financial Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Inova in Oct 2018", "Interview Descriptions": "Phone interview with HR recruiter. Within 2 business days recruiter contacted for an in person panel interview. After panel interview almost another 2 business days later contacted for a second interview with a Director and AVP. Both went smoothly. Offered job after 2 days of second interview. Very quick turnaround", "Interview Questions": "Interview questions were the typical behavioral and competency questions I expected and studied for."}, {"date": "14 Feb 2022", "title": "Social Worker Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Inova (Washington, DC) in Oct 2018", "Interview Descriptions": "It was pretty basic, I am actually pleased with how it went. I would say be ready to answer questions that you would have to come up with detailed answers for.", "Interview Questions": "What do you think you really excel in in the field of social work?"}, {"date": "24 Sept 2018", "title": "Spec Programs Financial Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Inova", "Interview Descriptions": "The process was standard. I filled out the online application. Few days later, the hiring manager called and set up the phone interview. Few days after, I was called in and had a face to face group interview with the dept.", "Interview Questions": "How have you handled  a difficult situation with a customer/client?"}, {"date": "17 Sept 2018", "title": "Scheduler Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Inova", "Interview Descriptions": "The interview process wasn't to bad. Talked on the phone with a recruiter at first then they link you up with a higher somewhere in that department.  After that you they make you an offer and whether or not you take it will continue on to the next step", "Interview Questions": "Tell me about yourself"}, {"date": "24 Sept 2018", "title": "Clinical Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Inova in Sept 2018", "Interview Descriptions": "I applied online and received a call about a week later. I talked to a recruiter for about 25 minutes about my qualifications and experience and I was set up for an in person interview. The in person interview took about 45 minutes and I met with two women and we went over what the job entails and my experience again. Afterwards they invited me back for a “shadow day”.", "Interview Questions": "What was a positive was you’ve dealt with an irate patient? "}, {"date": "7 Sept 2018", "title": "Staff RN Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Inova (Chesapeake, VA) in Sept 2018", "Interview Descriptions": "SO far I have gotten an Email for an interview. I am so excited and looking forward to it. I was asked to fill out an application however, I received an error when attempting to submit it filled out. I have emailed the interviewer and hopefully, I will hear back soon.", "Interview Questions": "Haven't had a formal interview yet. "}, {"date": "29 Aug 2018", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Inova (Fairfax, VA)", "Interview Descriptions": "Talked to staff RN and unit manager. They asked some questions and I answered them truthfully. Very conversational and pleasant. I was not overly intimidated. It was done in an office on the unit I was interviewing for.", "Interview Questions": "What makes you a good fit here?"}, {"date": "5 Aug 2018", "title": "RN Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I applied in-person. I interviewed at Inova", "Interview Descriptions": "First  you meet the HR and then the Unit Management. Afterwards, they check your reference and give you a tour of the facility. If they are interested, you would hear a call back. Orientation was great!", "Interview Questions": "What are your strength and weaknesses?"}, {"date": "9 Aug 2018", "title": "Mental Health Therapist-PRN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 1 week. I interviewed at Inova (Fairfax, VA) in Aug 2018", "Interview Descriptions": "I had a phone interview with hiring recruiter. After phone interview, I had an interview in person with with supervisor of the unit. Very laid back and went into detail about the job. I was asked simple questions about my background working in the field. At the end, I was given a tour of the unit.", "Interview Questions": "What is your experience working in the mental health field?"}, {"date": "29 Aug 2018", "title": "Program Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Inova (Fairfax, VA) in Aug 2018", "Interview Descriptions": "The process was not complicated at all. I submitted my application and was contacted by a recruiter to set up a phone interview. Afterwards I was scheduled for a in person interview.", "Interview Questions": "Give a time that you missed a deadline"}], [{"date": "25 Jul 2019", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Inova (Alexandria, VA) in Aug 2018", "Interview Descriptions": "Once I got in touch with a recruiter (this took several weeks/months) I had a phone interview with her. Then she set up an in-person group interview with the hiring nurse manager and a nurse from the floor. After that, they made an offer.", "Interview Questions": "If a doctor wrote an incorrect order, how would you approach the situation? Would you have trouble questioning the doctor?"}, {"date": "28 Aug 2019", "title": "EMT Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Inova in Aug 2018", "Interview Descriptions": "A screening call followed by an in person interview and then a tour of the ER. I was asked why I wanted to join the company and my experiences before hand.", "Interview Questions": "What would you do if you saw a co-worker doing a procedure incorrectly? "}, {"date": "9 Aug 2020", "title": "Secretary Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Inova (Arlington, VA) in Aug 2018", "Interview Descriptions": "Was lengthy it included 3 phone interviews and a face to face . I was assigned to a acute unit which there was a reason no one had filled the vacancy it was a trap!", "Interview Questions": "How do you feel about working with psych patients"}, {"date": "30 Jul 2018", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Inova", "Interview Descriptions": "Applied online. Received email from recruiter for a phone interview to set up an in-person interview with nurse manager. Interviewed at facility, and heard back the next day with job offer. Total process took 2 weeks.", "Interview Questions": "How would you handle a patient who was dissatisfied with their care?"}, {"date": "4 Jul 2018", "title": "Patient Care Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Inova", "Interview Descriptions": "You are contacted by a recruiter who sets you up with an on-site interview. After that interview you are asked to come back for another on-site interview this time with a panel.", "Interview Questions": "In a perfect world where do you see yourself in 5-10 years? \r\nWhy should we hire you?"}, {"date": "3 May 2018", "title": "Tech Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1+ week. I interviewed at Inova", "Interview Descriptions": "Straight forward and the basic interview questions. Response took about a week from the recruiter which screened me and forwarded my information to the manager which reached out to me.", "Interview Questions": "What skills do you have to bring into the facility?"}, {"date": "21 Nov 2018", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Inova (Fairfax, VA) in May 2018", "Interview Descriptions": "The interview process was pretty average and was similar to what I have been through with other companies. The other thing that hindered the process was occupational health had very limited hours and I had to drive very far to the location with the earliest appointment.", "Interview Questions": "The asked about my previous experience"}, {"date": "19 Apr 2018", "title": "New Grad RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Inova (Fairfax, VA) in Mar 2018", "Interview Descriptions": "Interviewed with two RNs on the unit. After the interview they allowed me to ask questions and showed me around the unit. I heard back form them within two days and was extended an offer.", "Interview Questions": "What experience have you had in this specific area? Why do you want this unit?"}, {"date": "12 Mar 2018", "title": "Birth Registar Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Inova (Fairfax, VA) in Mar 2018", "Interview Descriptions": "Met with the hiring manager, she was very nice and asked all the right questions. Got a call back a couple days later for the second interview with my peers. That lasted about a hour as they asked get  to know you type of questions as well as ideal situation questions.", "Interview Questions": "why do you feel like your the best candidate for the job?"}, {"date": "28 Mar 2019", "title": "Summer Nurse Extern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Inova (Fairfax, VA) in Mar 2018", "Interview Descriptions": "Very brief twenty five minute interview. My interviewer was very personable and the process was relaxed. We went over my qualifications and why I wanted to join their team. My interviewer went over salary, hours, and job requirements.  The interview questions were simple and easy to answer.", "Interview Questions": "why do you want to be a nurse?"}], [{"date": "29 May 2018", "title": "Contract Pricing Analyst and Supply Chain Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at Inova (Falls Church, VA) in Feb 2018", "Interview Descriptions": "Recruiter contacted me twice by phone and email and I participated two separate interviews for 2 positions at Supply Chain Department. Secretary of the department was unfriendly with unhappy grouchy face and did not make any welcome statement. I felt not welcomed and uncomfortable at all. These \"uncool\" interviewers gave cold shoulders and there is a lack of support in diversity. Their preoccupied judgment and snob attitude left bad impression. One lady (interviewer) did not talk anything and acted like a statue with communication mute mode. Each interview took 2 hours. It was very hectic and stressful. I had unexpected vomit after negative experience. I got unpleasant impression about Inova Health System Supply Chain Department.", "Interview Questions": "The interview style was group/panel. There were endless questions for 2 hours of each interview. Examples:  Do you know ERP data software? What contracting types you performed in Supply Chain? Are you using mathematical quantitative approaches in analysis? Any aptitude for mathematics and newest data software ERP?"}, {"date": "15 May 2018", "title": "Human Resources Director Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 3 weeks. I interviewed at Inova (Fairfax, VA) in Feb 2018", "Interview Descriptions": "I was very impressed with how I was recruited for this HR leadership position. Senior Recruiter, Valerie Hernandez treated me professionally and when I was invited for the on-site interview back in February, Valerie and the HR and Executive Team treated me like a top candidate for this job! Varlie continues to stay in contact with me regarding potential HR leadership opportunities. This makes me feel very valued.", "Interview Questions": "What is one of your greatest work accomplishments?"}, {"date": "31 Jan 2018", "title": "Clinical Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Inova (Leesburg, VA) in Jan 2018", "Interview Descriptions": "I applied online, waited about a month and got a call for a job. Had a phone interview, was asked why I wanted the job. Went in  for an interview , with the head director. It was an fairly average interview.", "Interview Questions": "Why do you want this job?\r\n"}, {"date": "13 Dec 2017", "title": "Mental Health Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Inova", "Interview Descriptions": "Not too stressful, interviewer asked many situational questions and provided more info about the position. They love if you have background experience to fall back on. Overall I had a positive experience with the interview.", "Interview Questions": "situational questions"}, {"date": "1 Dec 2017", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 7 weeks. I interviewed at Inova in Nov 2017", "Interview Descriptions": "I met the nurse recruiter at a job fair and was given an interview date.  I interviewed with 3 managers and I have to say. They actually looked through my resume and asked me questions based on what I wrote. Very fair interview; I was nervous but the entire interview was comfortable.", "Interview Questions": "how is my time management?"}, {"date": "11 Jan 2018", "title": "Transportation Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Inova (Fairfax, VA) in Nov 2017", "Interview Descriptions": "I applied online uploading my resume. I was invited to a phone interview by a HR specialist within a week of submitting. The person asked standard questions similar to a phone screen and not much specific to the position. I was not invited to the next round and was not offered.", "Interview Questions": "How did you get interested in this field?"}, {"date": "16 Oct 2017", "title": "Client Services Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Inova", "Interview Descriptions": "I received an email 3 weeks ago asking for available day and times for a phone interview. I sent up to two weeks of available days and times and did not hear from the recruiter at all. I sent a follow up email asking was the position still available and offered additional days and times of availability. The recruiter offered a day of her choosing and I replied that I was not available on that day. I didn’t receive a response. I sent a third email asking why I had not heard anything, and the recruiter replied that she had been under the weather, but was ready to conduct the phone interview. She never called. \r\nThis is one of the most unprofessional organizations that I have dealt with in all of my life. The lack of communication leads me to believe that this is not a place that I would want to work for.", "Interview Questions": "N/A"}, {"date": "28 Sept 2017", "title": "Sustainability Coordinator Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Inova", "Interview Descriptions": "I received an email on a Thursday evening from Inova's \"Recruiter Team Lead\" about setting up a phone interview for either the following day (Friday) or Monday. I replied back that Friday would work best for me. No response. I emailed again on Sunday to see if I could do it on Monday. Still no response. This all happened shortly before Labor Day weekend so I emailed again after the long weekend writing that I was still interested in the position. Again, no response.\r\n\r\nWhile I was certainly interested in the position, the complete unresponsiveness has turned me off to the employer as a whole.", "Interview Questions": "N/A"}, {"date": "20 Nov 2017", "title": "New Grad RN Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Inova (Fairfax, VA) in Oct 2017", "Interview Descriptions": "They asked me the usual questions for formality.  It took them a few weeks to get back to me for a phone interview. It is competitive to get to the units you are looking for. I feel as if you must know someone from the inside to get ahead in the process or even be considered.", "Interview Questions": "Why are you interested in this unit?"}, {"date": "18 Jul 2018", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Inova (Alexandria, VA) in Oct 2017", "Interview Descriptions": "Quick and simple.  With department manager.  Department was so short staffed that it was less than 30 minutes.  First clue to run should have been when she told me about the recent high turnover.", "Interview Questions": "Do you get along with people with very strong personalities"}], [{"date": "12 Sept 2017", "title": "RN Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Inova", "Interview Descriptions": "I has just moved to the area. I visited the hospital. Met with the nurse manager and inquired about a job. We walked around the unit and she hired me.", "Interview Questions": "I was asked if I was comfortable working in a fast paced department."}, {"date": "27 Sept 2017", "title": "PRN ICU RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Inova in Aug 2017", "Interview Descriptions": "Applied on their website, received email from recruiter. Interviewed with recruiter over the phone and then set up and appointment for an in-person interview at the hospital with the unit manager.", "Interview Questions": "Why did you apply for this job?"}, {"date": "31 Aug 2017", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Inova (Falls Church, VA)", "Interview Descriptions": "Very unorganized and disconnected. I get mixed messages from different interviewers and my recruiter was unresponsive. I had to chase her down for an interview and to request the details of the interview.", "Interview Questions": "What was your biggest accomplishment? "}, {"date": "25 Sept 2017", "title": "Clinical Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Inova (Alexandria, VA) in Sept 2017", "Interview Descriptions": "First there will be a phone interview. After the phone interview, they will set up a time for an in person interview with the nurse managers. Following that interview, you will interview with some of the staff after shadowing and then they will decide.", "Interview Questions": "What do you want to work at INOVA?"}, {"date": "18 Aug 2019", "title": "Credentialing Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Inova in Sept 2017", "Interview Descriptions": "nice, easy as long as you prepare. show up on time and study behavioral normal interview questions before you go and you should be fine. look at job description, know who you're meeting with and about the companys background", "Interview Questions": "what are your strengths"}, {"date": "23 Sept 2017", "title": "Medical Technologist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Inova (Alexandria, VA) in Sept 2017", "Interview Descriptions": "I applied online a few days after I had a phone interview and a few weeks after that I was called for a personal interview that was scheduled for about a week or less after the call. I can not give any other feedback since I am still in the process.", "Interview Questions": "Questions were more about what would you do on different scenarios, down equipment, coworkers issues, sampling problems, etc."}, {"date": "17 Aug 2017", "title": "Medical Education Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 6 weeks. I interviewed at Inova (Washington, DC)", "Interview Descriptions": "Initially seemed good. Everything moved fast at first. Wasted time and money since I lived out of town. I was told they were jealous because of my Master's. Could've interviewed via Skype since they saw I had a degree. Never called back to reject me. I ended up callin them and they were short.", "Interview Questions": "Strength and weakness? \nGeneral background? \nSituation questions? \nSmall talk and warm conversation about who I am and questions from there?"}, {"date": "15 Aug 2017", "title": "New Grad RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. I interviewed at Inova (Falls Church, VA)", "Interview Descriptions": "Submitted my resume  for their Talent Network; recruiter emailed me within 2 days to schedule a phone interview. During the phone interview an in-person interview was scheduled for the following week. Met with members of the unit who conducted the interview. Recruiter called me two days later and told me that they wanted to extend me an offer.", "Interview Questions": "Priority -- which patient would you see first?"}, {"date": "3 Jan 2018", "title": "Clinical Technician L Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Inova (Falls Church, VA) in Jul 2017", "Interview Descriptions": "One phone interview, one in-person group panel interview, decision made to hire me 2 weeks later. Classroom and hands on full time training of 2 weeks at Inova Fairfax Hospital Medical Campus. Lastly, on the floor unit of the unit you have been hired on hands-on training and showing with your preceptor (s). Then you begin working alone as a Clinical Technician l or lll.", "Interview Questions": "N/A"}, {"date": "3 Jul 2017", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Inova (Alexandria, VA)", "Interview Descriptions": "Overall the hiring and interview process was a good experience. 2 sets of interviews and some screening by the recruiter.   Everyone was friendly and I received an offer very quickly.  Was promoted after a year.", "Interview Questions": "Behavioral interviewing questions"}], [{"date": "30 Jun 2017", "title": "Postdoctoral Research Fellow Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Inova", "Interview Descriptions": "Interviewed for a job in a research lab.  My prospective boss called me 'babe' during the interview and made multiple sexist comments.  He berated my current boss at the time. Completely inappropriate.  Contacted the facilitator of my interview multiple times to receive my reimbursement for my interview and haven't heard back for months.  Met many administrative members of Inova who were very nice but overall my interview was absolutely terrible.  I made it very clear at the end that I was in no way interested in the position.", "Interview Questions": "General questions about my research experience.  Questions about my career goals."}, {"date": "29 May 2017", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Inova", "Interview Descriptions": "Easy, not intimidating at all. Very friendly. I was interviewed by 4 people. Questions were mostly behavioral questions. Took about 45 min overall. Was contacted within a week after the interview.", "Interview Questions": "Tell me about a time when you faced a challenge."}, {"date": "14 Jun 2017", "title": "Certified Registered Nurse Anesthetist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Inova (Fairfax, VA) in Jun 2017", "Interview Descriptions": "Overall Simple interview process. Relaxed environment. The interview is set up with a recruiter and you will most likely speak with the Chief Anesthesiologist prior to the interview. The in person interview was relaxed and they take you on a tour of the OR. You also have the chance to meet current employees and ask questions. They allow you to ask questions of your own through the process.", "Interview Questions": "What sets you apart?"}, {"date": "8 Oct 2017", "title": "Team Leader Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 days. I interviewed at Inova in Jun 2017", "Interview Descriptions": "Analyical process in the hiring process, first pre-screening interview. first interview maybe second interview. Third offer provided, go to orientation process, and some off site training. Overall process takes a week.", "Interview Questions": "List five charactertics about yourself, and why should we hire you? "}, {"date": "22 May 2017", "title": "Clinical Case Manager Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Inova", "Interview Descriptions": "Applied online; then received an email from the recruiter for s phone interview. Reapplied with dates available. Did phone interview, asked couple of questions then scheduled an in person interview with the manager.", "Interview Questions": "Why do I want to work here?"}, {"date": "21 May 2017", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. I interviewed at Inova (Fairfax, VA)", "Interview Descriptions": "It was mostly just formalities and going over what working there would be like, how long the orientation would be, etc.  Few here and there questions about my background and experience. It was a pretty easy interview.", "Interview Questions": "Tell me about yourself"}, {"date": "13 Jun 2017", "title": "New Grad RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Inova (Fairfax, VA) in May 2017", "Interview Descriptions": "great super quick interview. They take you in and meet with the manager. You end up talking to them. Then after that you go and shadow a nurse for an hour or so and she or he shows you around the unit.", "Interview Questions": "honestly i felt like we had a casual conversation more than an interview"}, {"date": "28 Jan 2019", "title": "Scheduler Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Inova (Falls Church, VA) in May 2017", "Interview Descriptions": "I applied online  and then got an email from a recruiter to schedule an interview for the position. It took  4 weeks after the interview to finally start working at my position.", "Interview Questions": "What your experience?\r\nWhy did you wanted to work at this company?"}, {"date": "3 Apr 2017", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Inova (Fairfax, VA)", "Interview Descriptions": "I applied on the Inova website. The recruiter reached out to me by phone to set up the interview. I met with the manager and one other staff member. The manager asked me questions from a list asking for specific examples. The interview ended. The manager told me they would get back to me by the end of the week. The recruiter called me later that day offering me the position.", "Interview Questions": "\"Give me an example of a time when you had a conflict with a coworker and how did you resolve it\""}, {"date": "8 Mar 2017", "title": "Medical Technologist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Inova in Mar 2017", "Interview Descriptions": "I got an email from a lady at INOVA's HR for a phone interview on Thursday 3/3/17. I was really excited and looking forward to it. She asked when was a good time for a phone interview. I replied promptly that I was available all day. Nothing heard from her until the end of the day with an apology for replying late. I thanked her for replying any way. She asked me again about the following day. I specified the time at 10 am. She told me she would be in the meeting not able to talk and asked for any other time on that day. I right away gave her all day availability until 5pm. Nothing heard from her again a second time. On Monday the following week, I decided to shoot an email to ask if she was still interested to have a phone interview. She had a quick response with \"Yes\" and asked when should she call me. This time I also specified the time 3 pm. Nothing heard from her at all again the third time. I waited one more day for her to get back. Nothing at all. I was very anxious and frustrated. I decided to express my disappointment and not pursuing career at this company anymore by email. She replied in the early morning that \"we are not interested to interview you any longer.\"  What is going on with this company? Do you psychologically evaluate people through this process? It was horrible. Your ignorance is considered unacceptable and unprofessional. I've never been treated by any HR like this before. I was contacted  from many places for opportunities. They were all professional. I was so disappointed with this kind of big company. I will never apply for job here for the rest of my life.", "Interview Questions": "N/A"}], [{"date": "1 Mar 2017", "title": "Clinical Research Associate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Inova", "Interview Descriptions": "I had a phone interview and at the end of it we set up an in-person interview. She told me that HR will get back to me for all the logistics. Nope, never heard from HR. I tried to contact the manager but she ignored all of my messages.  Friend of mine who works for INOVA even tried to follow-up with HR and the manager and was also ignored. I figured that if I wasn't a good fit, they would at least let me know. I don't appreciate being led on just to waste my time. Be courteous and professional.", "Interview Questions": "Why do you want to work for INOVA?"}, {"date": "1 Apr 2017", "title": "Diagnostic Medical Sonographer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Inova (Alexandria, VA) in Mar 2017", "Interview Descriptions": "Completed an Online application. My interview was scheduled less than a week later and an offer was extended the next day. Extremely quick hiring process. The offer made was excellent.", "Interview Questions": "Explain a time when I was faced with a difficult situation and how I handled it"}, {"date": "22 Mar 2017", "title": "Clinical Pharmacist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Inova in Feb 2017", "Interview Descriptions": "I recently applied for a pharmacist position and spoke with an HR lady for an initial phone screening a few days later. I was told that my application would be passed on to the hiring manager and I would be contacted within the next week or two for an onsite interview. I never heard from HR again. I have called HR multiple times and sent multiple emails. I was finally able to speak to the HR secretary (I think she was a secretary) who told me that she has passed my information and calls on to the original HR lady multiple times. I still haven't heard from them and it has been over 1 month. It seems like maybe I wasn't a good fit for the job or perhaps the position is on hold but it would have been nice to at least have been notified. This was a very frustrating process that ultimately left me with more questions than answers.", "Interview Questions": "Describe yourself and your goals. What are your strengths? Why are you interested in this position and company?"}, {"date": "27 Feb 2017", "title": "Research Technician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Inova (Fairfax, VA) in Feb 2017", "Interview Descriptions": "Applied for job on Indeed job board. Human resource reached out to me to arrange for on-site interview. Got there and was interviewed by potential future colleagues. They asked pretty basic interview questions.\r\nLater on was Interviewed by the manager's assistant and the manager later on.\r\nGot a tour of the lab, was a very cozy working environment. Everyone is very friendly. The equipments were all very new and high standard.\r\nITMI Have very similar research goals with mine", "Interview Questions": "Basic interview questions\r\nHave you had any experiences with meeting the deadline in a business setting"}, {"date": "21 Jan 2017", "title": "Communications Coordinator Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Inova", "Interview Descriptions": "Very easy and basic.You get a phone interview, then with your manager, the Director. Waiting period about a month.You get an overall description of your responsibilities, your duties with all details. Expectations. You feel very comfortable and is a non stress environment.", "Interview Questions": "How do you see yourself in five years"}, {"date": "25 Jan 2017", "title": "New Grad RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Inova (Fairfax, VA) in Jan 2017", "Interview Descriptions": "Phone screening with HR followed by in person peer interview on the unit and shadowing. I liked that they did a shadowing with the interview because I got a good feel for the unit. Was offered the position less than a week later. My HR rep was very responsive and helpful. Very positive, good experience with the hiring process here.", "Interview Questions": "Describe a memorable patient care experience from your clinicals?"}, {"date": "17 Apr 2017", "title": "Process Consultant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Inova (Fairfax, VA) in Jan 2017", "Interview Descriptions": "It was so so interview. Nothing special. Asked the same predictable questions and not impressed. Spoke with someone over the phone first and then went in for 1:1 and group interviews.", "Interview Questions": "Nothing really specific outside my previous experience and it's applicable to the current position. Asked how long I have been in the healthcare industry and why Inova. Most questions are answerable if you research little about the company."}, {"date": "15 Jan 2018", "title": "Clinical Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Inova (Fairfax, VA) in Jan 2017", "Interview Descriptions": "I applied to many positions, finally got a phone interview and then a week or so later I received an in person interview. After the in person interview I received a call back and was offered the job. Very nice interview set up.", "Interview Questions": "Have you ever worked in patient care?"}, {"date": "20 Feb 2017", "title": "Product Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Inova (Waldorf, MD) in Jan 2017", "Interview Descriptions": "Before even getting to ANY interview at all, I was asked to take a 30-min. \"Online Personality Test\".  I considered this quite an afront.  Not even after 1sdt, 2nd or 3rd interview.  But in order to even be considered I have to submit myself to and pass some digitized, algorithmed judgement via a \"Personality Test\".  Maybe if after 2nd or 3rd interview - But before even being considered?!!!  Offensive.", "Interview Questions": "\"Please go to the link below and take this 30-min. personality test.\""}, {"date": "5 Apr 2017", "title": "fundraisng Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Inova (Washington, DC) in Jan 2017", "Interview Descriptions": "Inova'a interview process was lengthy. After I applied in response to an online posting, I had two phone interviews with a consulting firm, then two Skype interviews. The firm required and interviewed four references. After the reference interviews, I was scheuled for an in person interview with the a consultant, which narrowed the candidates to two or three for a final interview with the department lead and decision maker. She was an hour late.", "Interview Questions": "What did you find difficult about your current/previous supervisor?"}], [{"date": "2 Nov 2016", "title": "Fundraising Officer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Inova (Falls Church, VA)", "Interview Descriptions": "Initial phone screen with a series of in-person interviews. Was strung along for each interview even though I was never offered a position. I even met with some very high-level Inova staff.\r\n\r\nIt was a lot of time wasted and I only found out I was no longer being considered after I emailed asking what was going on. In the end, little understanding of customer service when it comes to treating job applicants with respect.\r\n\r\nMore egregious was being asked the question about my schmoozing abilities (see below). Development work is minimized to being a paid \"schmoozer\" apparently...", "Interview Questions": "\"How are my schmoozing abilities\""}, {"date": "11 Nov 2016", "title": "Unit Secretary Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at Inova (Fairfax, VA) in Nov 2016", "Interview Descriptions": "I applied and heard a couple weeks later by email from a recruiter. We had to reschedule the phone interview a couple times, but she was very nice. I got an in-person interview the next day, didn't feel nervous and got the job ! Realized its not compatible with my schedule and it had rotating shifts so i had to decline.", "Interview Questions": "Did you ever have a patient or customer who was unsatisfied and what did you do?"}, {"date": "16 Oct 2016", "title": "Amb Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied through a recruiter. The process took 3 weeks. I interviewed at Inova", "Interview Descriptions": "While there are as many different possible interview questions as there are interviewers, it always helps to be ready for anything. Which is why we've taken the time to prepare this list of 100 potential interview questions. \r\n\r\nWill you face them all? We pray no interviewer would be that cruel.\r\n\r\nWill you face a few? Probably.", "Interview Questions": "Tell me about yourself."}, {"date": "10 Nov 2016", "title": "Clinical Technician I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Inova (Fair Oaks, VA) in Oct 2016", "Interview Descriptions": "I was first contacted by a recruiter, it took about two day after I turned in the application. They confirmed that you are aware of the time and type of position. Clinical tech is not a walk in the park, you are on your feet and working your whole shift. She confirmed the pay and checked to see if you had another position you were interested in and then told me she would send my resume and application on to the hiring manager. Within a few hours that same day I received a call from the hiring manager who runs the medical unit. She checks to see why you want to work as a clinical tech and why you want to work in their unit. They also make sure you are committing to working at least 1-2 years. Then I scheduled and interview for the very next morning. It was a panel interview with one of the nurse supervisors and the unit secretary as well as the hiring manager. I also got a tour of the unit and talked with a new hire tech who answered all my questions about the job and expectations.\r\n\r\nThey will hire people with no medical experince, if you desire to pursue nursing or go into medicine it helps your odds a lot. You don't need a degree but again it helps to have some college course under your belt.", "Interview Questions": "It's a behavioral interview, you are told to think of specific situations. If you have not worked medical it makes it a little bit harder but lots of jobs have carry over situtions. \r\nGive a time when you had a difficult patient and how you handled tha situation? \r\n\r\nGive a situation when you had limited resources how did you handle the situation? \r\n\r\nExplain a program/ process you implemented to inmporve your work enviornment? \r\n\r\nExplain a time when you have a coworker who was not doing their job, how did you handle it? \r\n\r\nExplain a time when you had to advocate for a patient? \r\n\r\nExplain your leadership roles."}, {"date": "16 Mar 2017", "title": "Unit Secretary Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Inova in Oct 2016", "Interview Descriptions": "took about 2 weeks to respond, they did a quick phone interview and then called me in 2 days later for in person. I didn't take the job bc it interfered too much with my schedule as I was unaware of the diversity of all shifts", "Interview Questions": "did you ever have an unsatisfied customer/patient and what did you do?"}, {"date": "27 Sept 2016", "title": "Licensed Practical Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at Inova (Burke, VA) in Sept 2016", "Interview Descriptions": "1) I met nurse recruiter at a networking/hiring event. Gave resume during that time. 2) I was called approximately 2 weeks later for an interview. 3) Phone interview with office RN. Then was asked for a in-person panel interview before phone interview ended. 4) Panel interview with Dr, office personnel, hiring manager, and RN (from phone interview). 5) Office tour", "Interview Questions": "Tell me about your last job. Describe a typical day."}, {"date": "8 Aug 2016", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Inova (Alexandria, VA) in Aug 2016", "Interview Descriptions": "An HR rep called me a few days after applying online. I was asked a few questions verifying my experience/job preferences. The rep told me she was going to forward my application to the unit manager and if the unit manager was interested, I would be contacted for an interview with her/him. I was called about a week later to schedule an interview with the unit manager. I interviewed the next day- it was a panel interview on the unit with the unit manager, charge nurse, two staff RNs, and a tech. They each took turns asking questions from a prepared script. I was asked around 12-15 questions (some were follow-up questions). I was called the next day with an offer.", "Interview Questions": "Describe a time you dealt with a challenging patient and how you responded."}, {"date": "13 Apr 2017", "title": "HR Business Partner Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Inova (Fairfax, VA) in Aug 2016", "Interview Descriptions": "I applied and a recruiter contacted me within a week.  My interview with the hiring manager took place approximately a week after that.  Then I had my in person interview within 2 weeks.  I then received my offer a week after that.  So it took approximately a month from recruiter first contact.", "Interview Questions": "Describe some of your current duties?"}, {"date": "2 Oct 2020", "title": "Histology Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Inova (Fairfax, VA) in Aug 2016", "Interview Descriptions": "Interview with a department manager then two other employees joined and took about 20 minutes asking questions and tour the working area \r\nThe interview was pretty casual and questions were not that hard to answer", "Interview Questions": "why did you choose histology? \r\nany experience in laboratory setting?\r\nhow do you handle conflict?\r\neducational background /job experience "}, {"date": "21 Feb 2018", "title": "Discharge Planner Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Inova (Fairfax, VA) in Aug 2016", "Interview Descriptions": "A nice interview that was very thorough. I interviewed with my supervisor and knew at this point that I liked my supervisor and would enjoy working with her. I also met the team I would be working with and knew I would like working with them. It was nice to meet everyone right away.", "Interview Questions": "Why do you want to work here?"}], [{"date": "18 Oct 2016", "title": "Senior Financial Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 5 days. I interviewed at Inova (Falls Church, VA) in Jul 2016", "Interview Descriptions": "Pretty laid back. Interviewed with two different managers back to back. Both managers were easy to talk to and get along with. The director I interviewed with also showed me around introduced me to the team and gave me a good idea of what exactly I would be doing and how I could contribute to the team. I was surprised to find that the team I was interviewing for was actually a pretty young team which made for a great fit. Great managers, young smart team that I got to talk to a little bit as well.", "Interview Questions": "Tell me about yourself outside of work"}, {"date": "23 Jun 2016", "title": "Patient Registration Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Inova", "Interview Descriptions": "The hiring process was easy, first they do a phone interview followed by a person interview. Usually there's two people interviewing you and they have a list of questions for you to answer", "Interview Questions": "Name a difficulty you had to face in your current position"}, {"date": "1 Aug 2016", "title": "Pcu Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Inova (Fairfax, VA) in Jul 2016", "Interview Descriptions": "Lengthy to get a call back from a recruiter. Once you finally get an interview with a manager it's quick. So an initial screen on the phone with the recruiter who forwards your application. If the manager wants a face to face interview you are notified. You find out by the next day if you get the position.", "Interview Questions": "Describe how you handled a difficult situation."}, {"date": "16 Sept 2016", "title": "Registered Nurse Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Inova (Alexandria, VA) in Jun 2016", "Interview Descriptions": "The process was quick - the same day I was interviewed I received a job offer. In total, the process took around 3 weeks after I was first contacted by the recruiter, but only because I was not available for an earlier interview. First, I interviewed with the hiring manager and then interviewed with some members of the team. It was a comfortable atmosphere to interview in and everyone was friendly. Additionally, the recruiter was very helpful and kept me very up to date during the whole process.", "Interview Questions": "If you were any animal, what would you want to be?"}, {"date": "25 Jul 2016", "title": "Clinical Technician I Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Inova (Centreville, VA) in Jun 2016", "Interview Descriptions": "I applied online through the INOVA job portal. I didn't hear back for weeks so I called the Urgent Care location to get the contact information for the Manager. I had an in-person interview at the office that was easy-going and relaxed. Afterwards I was shown a brief tour of the office and told I would be in contact with the head of HR in 1-2 weeks.", "Interview Questions": "Describe a time when you worked as a team member."}, {"date": "20 Jul 2016", "title": "Nurse Aide Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Inova (Leesburg, VA) in Jun 2016", "Interview Descriptions": "Discuss how your experiences will make you a great CNA, prepare answer & question why do you to work as CNA? Why this you leave your last job? Where do you want to be 5 years from now ?", "Interview Questions": "how your experiences will make you a great CNA?"}, {"date": "25 May 2016", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Inova", "Interview Descriptions": "Apply online, get contacted by hr for interview, interview with dept manager, work with recruiter for salary negotiation and on boarding process. It is a long process that could take up to 2 months.", "Interview Questions": "tell me about a time you went above and beyond for a pt"}, {"date": "18 May 2016", "title": "ER Volunteer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "The process took 4 weeks. I interviewed at Inova", "Interview Descriptions": "Fairly easy, casual interview process. The volunteer coordinator reached out to me via email a couple of weeks after mailing in an application. Basically any typical interview questions were primarily asked in the application. The \"interview\" was really just a meeting to discuss  hours of availability and areas of the hospital that I'd be interested in assisting.", "Interview Questions": "Why do you want to volunteer at INOVA? (on application) "}, {"date": "20 Jun 2016", "title": "Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Inova (McLean, VA) in May 2016", "Interview Descriptions": "If Inova wanted someone ONLY with hospital experience, then why bother calling me at all? Why wasn't that specifically put in the position ad? I felt that INOVA completely wasted my time. With the tests, the phone interviews and the Essay write up I did - I could have put that time into applying for a position with a company that knew who they were looking for. I have 6 years of healthcare IT experience and 15 years overall Marketing experience - I was very clear about my background in the application.\r\n\r\nFirst took two tests in order to complete the application, one was IQ based and one personality based. I have Six years of healthcare IT experience. Two years at VP level. The qualifications did not say that I was required to have hospital experience, but in the healthcare field. The interview with the recruiter was very nice. Then I had a second interview with the hiring manager. She was late, she told me she had 20 minutes for me. It took 20 minutes to go through my resume. Then she asked me to write an email proving that I had healthcare experience that would relate to hospitals. From the get go she put me on the defensive. Why interview me at all if she wanted strictly hospital experience.\r\n\r\nI wrote an excellent email about my experience with 6 examples. Two were strategic and two were specific examples of how my experience would relate. I've been a hiring manager in her shoes at this level, this was an excellent example of exactly what she asked for. No response for two and a half weeks and then I get an email saying I didn't get the job because of my lack of hospital expererience and how my experience did not specifically relate.", "Interview Questions": "Tell me about your background and how it relates to the position at Inova"}, {"date": "20 Jul 2019", "title": "Sterile Processing Technician Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Inova (Leesburg, VA) in May 2016", "Interview Descriptions": "Took well over a month. Phone interview and then in person interview. Took at least 3 weeks after my offer to get a start date. My interviewer (manager) was late to the interview, which should have given me a tip on how she would end up being as a manager.", "Interview Questions": "Standard printed out behavior questions. "}], [{"date": "29 Apr 2016", "title": "Clinical Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Inova (Fairfax, VA) in Apr 2016", "Interview Descriptions": "The interview process was fairly easy. I applied online and a day later I was called. I did a phone interview with HR. He asked me questions and we went over my resume. He then set up an interview with the clinical director of the department I wanted to interview for. Two days later I interviewed with the the clinical director and another two days later I received an offer for the position.", "Interview Questions": "Name a time where you had a disgruntled patient and what did you do to fix the situation."}, {"date": "14 Apr 2016", "title": "Technician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. The process took 12 months. I interviewed at Inova", "Interview Descriptions": "Not A permanent employee yet. It took about a year to finally get a response back from HR. I finally got a phone interview today. I got a face to face interview next we so well see how this goes.", "Interview Questions": "describe diffcult patient"}, {"date": "8 Apr 2016", "title": "RN Staff Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Inova (Fairfax, VA)", "Interview Descriptions": "Casual discussion and tour of unit. Focus spent on the plans for OBED model of new triage unit in new women's hospital, and big move to the new space. Met with Manager of the unit, as well as line leader for triage, and some of the nurses working on staff that day. All extremely friendly and welcoming.", "Interview Questions": "Discussed background and experience. This was a very informal process, as I had the position based on my years of experience and many references from current employees."}, {"date": "13 Apr 2017", "title": "Unit Secretary Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 4 days. I interviewed at Inova (Falls Church, VA) in Apr 2016", "Interview Descriptions": "The clinical director called me personally, we set up a day to meet in her office and begin the interview process. She just asked me a few things about my personality and would I be willing to work a 12 hour shift and help out the nurses, and do other things unit secretaries do.", "Interview Questions": "Do you like children? (The position was for a children's unit)"}, {"date": "22 Nov 2019", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Inova (Falls Church, VA) in Apr 2016", "Interview Descriptions": "It's pretty standard with a multi-level colleague/ committee interview. They give you time to discuss your work history and goes and desire for the position you applied for. They then will discuss with you the position you applied for along with all the criteria and expectation for doing the job. They then may give you a tour as well.", "Interview Questions": "The famous \"Tell me about a time you failed at something\"."}, {"date": "7 Apr 2016", "title": "Graduate Nurse Emergency Room Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Inova in Mar 2016", "Interview Descriptions": "The process went smoothly and quickly. I received a call from HR with an offer shortly after my interview. Everyone was so pleasant and welcoming. I was given a tour of the unit and I met with the staff. The nurse manager was a blast and had a simulation portion to the interview. Great time!!!!", "Interview Questions": "what are your strengths?"}, {"date": "9 Jan 2016", "title": "New Grad RN Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Inova (Fairfax, VA)", "Interview Descriptions": "Applied for the new grad position online. I was contacted by human resources within 24 hours asking for my availability to meet with the hiring manager for an interview. I interviewed the following week with the hiring manager and 4 others. Each person on the panel sits there with a piece of paper in front of them to jot down notes. The interview questions were all situational based and majority of them involved conflict resolution. Nothing really involving professional experience.", "Interview Questions": "Describe a time when you had conflict with a co-worker and how you resolved it?"}, {"date": "10 Jan 2016", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at Inova", "Interview Descriptions": "Had a phone interview with the recruiter, then she set up an interview with the RN manager and charge nurse. They are all very helpful, nice and friendly. Got a call for positive feedback 4 hours later.", "Interview Questions": "Where do you see yourself in 2 years?"}, {"date": "6 May 2017", "title": "Clinical Technician Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Inova (Falls Church, VA) in Jan 2016", "Interview Descriptions": "The interview process was short and to the point.I was contacted over the phone and from there i set my interview date. The interview itself lasted about 30 minutes.I was interviewed by the clinical director on the unit I would be working.", "Interview Questions": "why do you want to work here"}, {"date": "20 Apr 2017", "title": "Clinical Technician Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Inova in Jan 2016", "Interview Descriptions": "It took about 3 months to actually get in for an interview.  When I finally got an interview i had to come about several times. I eventually ended up have about 4 interviews with different people.", "Interview Questions": "Why do you want to work in the hospital?"}], [{"date": "11 Oct 2016", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Inova (New York, NY) in Jan 2016", "Interview Descriptions": "easy and relaxed environment. Manager was very easy to talk too and asked me questions about my skill set and experience. Went over details of job and day to day tasks.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "3 Jan 2019", "title": "Registration Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Inova (Falls Church, VA) in Dec 2015", "Interview Descriptions": "First you get contacted by Hr , then you get set up with an interview and you interview with managers, team leads and sometimes shift leads. It is sometimes nerve wrecking because so many people are judging you at the same time.", "Interview Questions": "What is a difficult time that you had to overcome when dealing with patients. "}, {"date": "4 May 2016", "title": "Accountant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Inova (Fairfax, VA) in Nov 2015", "Interview Descriptions": "I applied through company's website and received an email informing me I had been selected to have an interview. I interviewed for about 40 minutes with manager and two senior accountant. Questions were very straight forward, with no surprises. Mostly just wanted to determine if you were a good fit.", "Interview Questions": "what's your 3 strengths?"}, {"date": "23 Jan 2016", "title": "Clinical Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Inova (Falls Church, VA) in Oct 2015", "Interview Descriptions": "I talked to a manager in one of the units at the Fairfax Hospital and since I just wanted experience and I didn't want a specific unit, they placed me wherever they needed people and they believed I would be a good fit.", "Interview Questions": "When there was a moment I disagreed with something that my manager or supervisor was doing, how did I handle that situation?"}, {"date": "8 Oct 2015", "title": "Systems Office Employee Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Inova", "Interview Descriptions": "I applied online, the recruiter contacted me for a phone screen. The recruiter sent an email to coordinate an interview with the hiring manager. I met with 1 hiring manager the first week. For another week, I interviewed with 2 team members. I received offer and I negotiated the low salary. To off set that, I accepted the sign on bonus.", "Interview Questions": "What's impact have you had with our customers?"}, {"date": "1 Dec 2015", "title": "Executive Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Inova (Fairfax, VA) in Oct 2015", "Interview Descriptions": "I got a phone call soon after I applied on the website from a recruiter. I was briefly interveiwed and was asked to come in and have a face to face interview with the hiring manager. The interview went very well.", "Interview Questions": "What brings you to Inova Hospital?"}, {"date": "14 Jan 2016", "title": "Telecommunications Operator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Inova (Falls Church, VA) in Aug 2015", "Interview Descriptions": "I was referred by a friend and employee of Inova, then I applied online.  I was contacted by a HR Recruiter who conducted the telephone interview. I was then selected for a face to face with the IT Communications department manager about 2 weeks later. Once I went on my interview, I was offered the position by the Manager. The process after interview was 6 weeks until orientation.  The On-boarding process for New Employees made the hire process refreshing and easy.  The applications used is user friendly and helpful for new employees to ensure all requirements were met.", "Interview Questions": "Tell me about yourself? I did not have many questions. My Interview was with the Department Manager and Supervisor/Trainer. The interview was very warm and welcoming. My Manager was more very interested in learning about \"me\" as a person. The interview flowed more like a conversation. Questions were free flowing."}, {"date": "19 Sept 2016", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Inova (Fairfax, VA) in Aug 2015", "Interview Descriptions": "Took basically three months to be hired. Waited 3 months before I received a call back. Applied in May interviewed in August started position end of august early September. There was a lot of miscommunication with the recruiters on interview date and location. Eventually interviewed with program manager/coordinator asked very simple questions.", "Interview Questions": "name a time you had a workplace conflict and how did you resolve the issue"}, {"date": "16 Jul 2015", "title": "New Grad RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 3 days. I interviewed at Inova in Jul 2015", "Interview Descriptions": "I registered to the BSN Open house that was advertised. Recruitment team later sent an invitation to sign up for a interview time slot before the day. I selected my slot and arrived 45 minutes before my interview to ensure I wouldn't run into any traffic issues or issues finding the location. They asked that you bring two resumes. When I arrived they gave me a folder to put my resumes in and asked me to fill out a small questionnaire on the front of the folder which asked for your experience if any and what are the top two areas you are interested in among a list of 6 areas (Medical, Surgical, Women's Health, Oncology are the ones I could remember). In the waiting area they provided water, coffee, tea, and light refreshments while you wait for an recruiter to call you. Once called they used the auditorium to interview candidates. Throughout the interview they fill you in with what areas have openings and offer to contact a manager to come and interview you if they are available.", "Interview Questions": "Describe a time you had to share difficult medical information with a nurse or physician."}, {"date": "25 Jun 2015", "title": "Clinical Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 2 weeks. I interviewed at Inova", "Interview Descriptions": "It was a very easygoing interview. The interviewer read off a list of questions & took notes. The interviewer was friendly. Hospital environment and employees were also friendly and helpful.", "Interview Questions": "What does compassion mean to you?"}], [{"date": "29 Jul 2015", "title": "New Grad RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Inova in Jun 2015", "Interview Descriptions": "First, there was a phone interview, then a 1 on 1 with the hiring manager. Lastly, a panel interview with the Unit managers. The interview was set up by the nursing recruiter and the process was fairly smooth and quick. The hiring manager and unit staff were very nice and welcoming. I felt nervous during the interview but it wasn't because I felt intimidated or anything. They seemed very interested in learning about my medical field background. The environment was professional yet comfortable. I left the first in-person interview feeling very confident. The panel interview was more intense but I still felt that I still had a good chance in getting an offer.", "Interview Questions": "Tell me about a problem you had and a creative way you fixed it."}, {"date": "25 Jul 2015", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Inova (Fairfax, VA) in Jun 2015", "Interview Descriptions": "Telephone Interview with Nursing Recruiter, In person interview with Unit Management and peer review with current staff nurses.  Filled out an application online and submitted resume...then telephone interview with recruiter.  Second telephone interview with recruiter and follow up with filling out yet another, very similar, online application and resume submission.  People answers survey followed.  A week or so later was telephoned to set up an in person interview with management , in which more application details were needed.  A peer / panel interview was held at the same time.  Received an offer which was contingent on background check , health assessment and drug screen results.", "Interview Questions": "How I would handle a situation where what I learned in class ( textbook ) may differ from what my preceptor may be instructing me was the way that procedure may actually handled on the unit."}, {"date": "19 Sept 2015", "title": "Manager-Inova Health Systems Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Inova (Falls Church, VA) in Jun 2015", "Interview Descriptions": "Interviewed and got offer.. 2 month s later resigned. BAD departs,rude, arguments, angry employees, very nasty to each other and no management for a long time. NOT a professional at all. Power struggling and very back stabbing place to save their job in the older people that has been there forever.", "Interview Questions": "Easy but rude attitude with each other. Most scared to speak cause culture is that if you say the wrong thing...you fired...snitchers to save their jobs. most don't know what to do"}, {"date": "20 Jul 2016", "title": "Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 7 weeks. I interviewed at Inova (Falls Church, VA) in Jun 2015", "Interview Descriptions": "Overall interview was smooth. You are first screened by an HR representative. They tell you nothing about the job. If you make the first round cut then you meet with each person from the department individually.  Then HR lets you know if they are interested in moving on or not.", "Interview Questions": "Strengths/weaknesses"}, {"date": "3 Jul 2015", "title": "Patient Access Manager Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Inova (Alexandria, VA) in May 2015", "Interview Descriptions": "The interview process was rigorous and repetitive.\r\nThree interviews too many. Some of the same questions were asked by diffrent people. Communicaton between the HR staff and I could have been better. Weeks would go by without knowing the next step. Overall the process was ok.", "Interview Questions": "How would you motivate your employees."}, {"date": "26 Oct 2015", "title": "Clinical Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Inova (Fairfax, VA) in Apr 2015", "Interview Descriptions": "Run of the mill questions, how do you handle stressful situations, how would you handle co-workers etc. no negotiating pay. 3 people interviewed me. wasn't difficult to answer if you have any common sense.", "Interview Questions": "What would you do in an emergency situation that is out of your scope of practice."}, {"date": "10 Apr 2015", "title": "Data Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "The process took 4 weeks. I interviewed at Inova", "Interview Descriptions": "The recruiter did not know how to ask questions about skills. \nI had been negotiating salary during the first phone call, which was unexpected and weird.\nThe next step to talk in person with the manager was soon arranged right after the call.\nDuring the face-to-face interview, the behavioral questions were many and exhausted.  Managers are nice and cool.", "Interview Questions": "multi-project"}, {"date": "20 Jul 2015", "title": "Credentialing Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. The process took 1 day. I interviewed at Inova (Falls Church, VA) in Apr 2015", "Interview Descriptions": "Referred to by staffing agency and received an over the phone interview. I was asked what I did on my last assignment and was explained what I would be doing on this assignment, which was very similar. Researching and implementing data in an excel spreadsheet from various database systems for provider credentialing.", "Interview Questions": "What did I do on the other job and am I a fast learner."}, {"date": "23 Jan 2017", "title": "Specialist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Inova (Falls Church, VA) in Mar 2015", "Interview Descriptions": "The hiring process was very lengthy (4 in-person interviews) and the HR representative was unorganized.  Once I was offered the position, the HR representative did not give clear directions on how to complete my health screening which almost delayed my start date.", "Interview Questions": "Tell me about your experience/background in the not-for-profit sector."}, {"date": "15 Sept 2016", "title": "Human Resources Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 4 weeks. I interviewed at Inova (Falls Church, VA) in Mar 2015", "Interview Descriptions": "It is was the classic process, phone screen, in person, 2nd interview with peers and client group.\r\n\r\n(I do not have 30 more words I have to say about the process)", "Interview Questions": "Tell me why I should hire you?"}], [{"date": "29 Jan 2015", "title": "Project Manager Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Inova (Falls Church, VA)", "Interview Descriptions": "Very fragmented and unprofessional. Was contacted by e-mail but was not told what the job title or responsibilities were despite repeated questions. Was given a mean salary for the position that was totally off base; the amount I was offered was far below the mean I had been quoted. Interview went well. The specific department I am in is run well and not reflective of the larger organization as a while.", "Interview Questions": "N/A"}, {"date": "19 Jul 2015", "title": "New Grad RN Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Inova (Fairfax, VA) in Feb 2015", "Interview Descriptions": "submit application online (kind of long and format is not clear), finish a test before interview (personality test and basic test); after that, receive a phone call to schedule the interview", "Interview Questions": "what&amp;#039;s your strength"}, {"date": "13 Jan 2015", "title": "Psychiatric Unit RN Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 months. I interviewed at Inova", "Interview Descriptions": "Was promised a full time position that never materialized. Also, this group laid off around 600 nurses in 2013. There was no warning from admin that this was about to take place.", "Interview Questions": "Questions related to my experience as a volunteer in the behavioral unit."}, {"date": "9 Jul 2015", "title": "Unit Secretary Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Inova (Leesburg, VA) in Jan 2015", "Interview Descriptions": "There were two of them who interviewed me. It was calm and good. They explained to me the job responsibilities and how it works around the department. They also showed me and introduced me around.", "Interview Questions": "Why would you like to work at this department? Tell us about yourself."}, {"date": "7 Jun 2019", "title": "Clinical Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Inova (Alexandria, VA) in Jan 2015", "Interview Descriptions": "you will meet one or two person you will going to work with, be prepared , bring your resume and copies, courteous. Members of the team will going to check how you work in teams, if you can able to manage working in fast paced environment and so on...", "Interview Questions": "if a patient call for a bathroom while your doing a vital signs what will you do first?"}, {"date": "25 Apr 2019", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Inova (Alexandria, VA) in Jan 2015", "Interview Descriptions": "Strictly professional and must be efficient and knowledgeable. Given the opportunity to answer questions about self and experience. Presentation of what you bring to the company. Computer skills. Opportunity given to ask questions about the company", "Interview Questions": "Why Inova?"}, {"date": "10 Sept 2015", "title": "Schedule Registration Representative II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Inova (Fairfax, VA) in Jan 2015", "Interview Descriptions": "Lasted approx.1 hour, it was conducted professionally. The process itself was positive and constructive. There was ample time for Q & A. Interviewer extremely interested in going beyond mere job experiences in order to clearly identify soft skills.", "Interview Questions": "Besides the obvious questions on past working experiences, a lot of attention was put into understanding my soft skills."}, {"date": "16 Dec 2014", "title": "Systems Analyst Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Inova", "Interview Descriptions": "Pretty simple.  Back round check, interview with HR, Director and Hiring Manager.  Interview questions were related to the job function and past experiences. What's my 5 year plan and how will I contribute to the team and system.", "Interview Questions": "What's the one thing that you could improve on."}, {"date": "18 Oct 2014", "title": "Unit Secretary Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "The process took 2 months. I interviewed at Inova", "Interview Descriptions": "Applied for several positions within the INOVA Health System, took 7 weeks to hear anything. One interview with head of the department, offer within 2 days, but was mislead on what the offer would be ahead of time with no opportunity to negotiate.", "Interview Questions": "None- the interview felt like a formality. I think the person who interviewed me was new to her role at the time and may have been less than prepared, as she was not the person who normally was responsible for interviewing new candidates. I was probably asked about overcoming a difficult work situation in the past and whether I could work well under pressure."}, {"date": "25 Aug 2014", "title": "Clinical Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Inova", "Interview Descriptions": "Applied online and received a call from HR two weeks later to come in for a personality and aptitude test.  A day or two after the test I received another call to set up a group interview with the Nurse Manager and Patient Care Director, was given a tour of the unit, and all tolled it took about two hours.  Received a call at the end of that week with an offer, I accepted, and two weeks after that I started my orientation process.", "Interview Questions": "Give me an example of a time where you experienced conflict with a co-worker, and how did you resolve it."}], [{"date": "23 Nov 2015", "title": "Patient Registration Representative Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Inova (Falls Church, VA) in Jul 2014", "Interview Descriptions": "Interviewers were extremely outgoing/friendly and asked position-related questions only. Great back and forth in the conversation; both interviewers were extremely open to answering my questions about work environment, inclement weather policies, and benefits of the job. They spoke about continuing education credits and training in various subjects (spanish for healthcare classes, accounting and billing seminars, etc.)", "Interview Questions": "Describe a time when you had to interact with an angry patient and how did you handle the situation?"}, {"date": "4 Jun 2014", "title": "Radiology Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 3 days. I interviewed at Inova", "Interview Descriptions": "Hired during student training.  Group interview consisted of clinical instructor, supervisor, and senior mgr.  Questions were related to strengths/weaknesses, least and favorite areas of work, and personality questions.", "Interview Questions": "Most difficult question was: Describe an incidence where you delivered excellent patient care."}, {"date": "27 May 2015", "title": "Clinical Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Inova (Alexandria, VA) in Jun 2014", "Interview Descriptions": "The interview itself  was a brief they just asked for my availability along with past experiences and, just some general questions. the interviewer was nice and understanding of my schedule needs.", "Interview Questions": "what is your future plans?\r\nwhy did you apply here?\r\nhave you worked in these kinds of settings?"}, {"date": "17 Sept 2015", "title": "Unit Secretary Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Inova (Fairfax, VA) in May 2014", "Interview Descriptions": "The interview process was not too intense. I first received a call with a brief phone interview and then was called in for an in person interview with the direct manager.", "Interview Questions": "Why do you want to work for a hospital?"}, {"date": "3 Jun 2016", "title": "Cook Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at Inova (Alexandria, VA) in May 2014", "Interview Descriptions": "The interview process was very interesting. I showed up 30min early to find the location of my interview. They were upset cause I was early and I apologize for interrupt anything they had going. I also told them that I wait till the meet was over. He said no let going head a finish the interview. The whole time the chef who was to interview me had someone else do it for him. Then when interview started the other chef instead of him allowing me to explain myself in my own way. He want to make he correct my employee history. Say that I wasn't a cook cause I didn't have the proper culinary history like he had and this went down through the whole interview. Even though they end up hiring me he still made sure that I know that he will be on my back the whole time.", "Interview Questions": "Where did I get my culinary experience?"}, {"date": "14 Mar 2014", "title": "Schedule Registration Representative I Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 3 weeks. I interviewed at Inova", "Interview Descriptions": "Recruiter contacts you to tell you a bit about the position, the interview is set up, you go in for the interview and here something with in a week by phone.", "Interview Questions": "N/A"}, {"date": "26 Mar 2014", "title": "Clinical Technician I Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Inova in Feb 2014", "Interview Descriptions": "I applied online and heard about about a 3 weeks to a month later. I had a group interview, 4 interviewers. They each asked me a few questions, mostly behavioral.", "Interview Questions": "Describe to me a time where you came across a difficult person? What did you do?"}, {"date": "25 Jan 2014", "title": "Clinical Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Inova (Falls Church, VA)", "Interview Descriptions": "There was one interview with the nurse manager and 3 other nurses on the floor\r\nThey went through my resume and asked questions about my experience and skills\r\nThey do a personality test online as well and the drug and immunity tests come after being hired", "Interview Questions": "Tell me a time you had a conflict or disagreement with another person"}, {"date": "17 Jan 2014", "title": "Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Inova (Falls Church, VA)", "Interview Descriptions": "I was an internal candidate with experience who had a  panel interviewed with senior leadership team.  The skill set they desired as ideal was not completely my skill set, although I have potential.  Too many people wanted few available positions.", "Interview Questions": "How would I prioritize my workload.  "}, {"date": "11 Jul 2017", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Inova (Falls Church, VA) in Jan 2014", "Interview Descriptions": "Short and to the point, very laid back, managers were very friendly and open to questions I had. Made the atmosphere seem very welcoming, they were both funny. Dressed professionally, but probably could have just worn scrubs.", "Interview Questions": "Name a time when you had to tell a patient no to a request."}], [{"date": "10 Oct 2013", "title": "Accounts Receivable Supervisor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Inova", "Interview Descriptions": "Inova has developed a very standardized way hiring and interviewing. However, my Director did not want to adhere to the new and standardized process which I found to be very irritating. She always said \"this is my ship and I will run it the way I want to\"... anyway, the process was to do a phone screening first and then bring the candidate in for an interview.\r\n\r\nAs an AR Supervisor, we look for AR Reps to fill the open roles in the department. So, you would typically expect to only meet with one or two people to interview you... Well, not with Inova. They like to have every freaking PFS Supervisor be involved in the interview process. You'd think we are interviewing for the next president. So, the candidate comes in and meets with a panel of supervisors who ask all behavioral based questions in addition to some AR skill set questions.\r\n\r\nThen, after you leave we talk about you and decide if you are worth pursuing. We use a scorecard to evaluate how you answered the behavioral based questions and give it to our Director. At that point, it's up to her how she wants to proceed. The process can be long and daunting.", "Interview Questions": "Explain a time when you had multiple competing priorities. How did you handle it?"}, {"date": "13 Jun 2015", "title": "Physician Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Inova (Fairfax, VA) in Oct 2013", "Interview Descriptions": "Very thorough and personalized. The HR representatives were very polite, well-informed, and able to answer many of many questions. All of the idndividuals who worked with me were incredibly helpful, positive, and created a very hospitable environment of excellence.", "Interview Questions": "How do you handle conflict?"}, {"date": "21 Sept 2013", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. I interviewed at Inova (Falls Church, VA)", "Interview Descriptions": "This depraved bureaucratic hospital takes weeks to months to hire.  If you do not make personal contact with the unit manager it make take over a month to secure an interview. The HR department does not freely communicate with managers regarding new applicants.", "Interview Questions": "What is the most difficult situation you have been in and how was it resolved?"}, {"date": "26 Jan 2017", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at Inova (Alexandria, VA) in Jun 2013", "Interview Descriptions": "Comprehensive, informative and positive.  The manager was very up front about what the job entailed and what the expectations were.  She discussed salary and benefits.  She told me about the culture of the department.", "Interview Questions": "Tell us about your previous experience."}, {"date": "3 Apr 2013", "title": "IT Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Inova (Dulles, VA)", "Interview Descriptions": "The interview process is very thorough.  The initial contact will be for a brief phone interview.  You start with meeting your potential new supervisor on a 1:1 interview.  It all goes well, then you will be contacted to have a second interview with the department manager or director.  The third interview is a panel/group interview with select members of the team you will be working with.  The entire process took almost 2 months.", "Interview Questions": "You will be asked about your interest in the company.  It is best to be prepared to be familiar with the organization and show interest in what they do.  Be prepared to have examples of Analytic experience.  The job revolves heavily on Analysis and you need to show that you can do that type of work."}, {"date": "4 Oct 2013", "title": "RN II Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Inova (Loudoun Heights, VA) in Mar 2013", "Interview Descriptions": "Lengthy and tiring. Unorganized.", "Interview Questions": "Discuss your weaknesses."}, {"date": "18 Dec 2015", "title": "RN II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Inova (Fairfax, VA) in Dec 2012", "Interview Descriptions": "Recruiter calls you to confirm your interest of the job your applied on line. The recruiter reviews your credentials to ensure that you qualify for the job. He also presents other job opportunity and coordinates the interview schedule for the parties involved.", "Interview Questions": "They had a based preset of questions to gauge your ability to adapt, to solve problems and to relate well with co-workers"}, {"date": "26 Mar 2016", "title": "Him Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at Inova (Fairfax, VA) in Oct 2012", "Interview Descriptions": "Old fashion round-table interview with a panel of peers asking templated, open-ended questions.  I initially interviewed at the hospital with the directors and CFO and later interviewed with the corporate VP of HIM and later with the Director of HIM  at Fairfax, Va", "Interview Questions": "Describe your strong points"}, {"date": "3 Aug 2013", "title": "Administrative Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Inova (Falls Church, VA) in Oct 2012", "Interview Descriptions": "Very easy going.  Asked about prior experience and if multi-tasking comes naturally.", "Interview Questions": "Ask about strengths and weaknesses."}, {"date": "18 Jul 2016", "title": "Certified Clinical Medical Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Inova (Annandale, VA) in Sept 2012", "Interview Descriptions": "HR calls you to setup interview with manager of applied site. Interview with manager, filled outelectronic paper work, do blood work, background check etc. then start work as long as everything goes well", "Interview Questions": "Do you have ortho experience and do you have a sense of humor"}], [{"date": "28 Mar 2014", "title": "Program Assistant Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Inova (Fairfax, VA) in Sept 2012", "Interview Descriptions": "You interview with a couple of program managers to see which program They think you are a fit for not the program you want.\r\nThey ask you the typical questions about your experience in jobs where you have had an issue and how you fixed it, what are your strengths and weaknesses.", "Interview Questions": "N/A"}, {"date": "12 Oct 2012", "title": "Department Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Inova (Fairfax, VA) in Aug 2012", "Interview Descriptions": "Initial contact from Human Resources that entailed questions regarding experience and desired salary. Inova pays on a scale that is not negotiable. Years of experience and position dictate compensation.", "Interview Questions": "N/A"}, {"date": "20 Sept 2013", "title": "Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Inova (Falls Church, VA) in Jun 2012", "Interview Descriptions": "Started with a phone interview with the hiring manager.  Inova flew me in to interview in person with the hiring manager.  Decision was made the day of the in-person interview.  HR called to let me know and set up my orientation within an hour of the interview.", "Interview Questions": "Why do you want to leave your current position?"}, {"date": "9 Feb 2016", "title": "Clinical Technician Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Inova (Arlington, VA) in Jun 2012", "Interview Descriptions": "starts with a brief phone interview with an HR manager, they set up an in person interview.  you meet with the unit manager for 20-30 minutes, it is a behavioral interview.  a lot of if this happened how would you respond, etc. after that you meet with 2 to 3 current employees for a peer interview which is also fairly quick.", "Interview Questions": "describe a time you failed a patient in your role as a health care provider and what did you learn?"}, {"date": "18 Jan 2016", "title": "Clinical Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Inova (Fairfax, VA) in Jun 2012", "Interview Descriptions": "Simple and to the point\r\nStrengths/weaknesses\r\nWhy i wanted to work there\r\nBackground and experience\r\n\r\nI was introduced to the director and she explained the logistics of the job and asked me specific questions. I was offered the job the next day and loved it!", "Interview Questions": "N/A"}, {"date": "14 Jun 2012", "title": "Trainer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Inova (Falls Church, VA) in May 2012", "Interview Descriptions": "1. Phone interview \r\n2. Interview w recruiter\r\n3. Interview w hiring manager\r\n\r\nWhy do u want to work with epic?", "Interview Questions": "Why do u want to work w epic?"}, {"date": "22 Oct 2013", "title": "Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Inova in May 2012", "Interview Descriptions": "Normal process for most hospitals", "Interview Questions": "How will you improve HCAPS? "}, {"date": "11 Mar 2016", "title": "Telecommunications Operator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 days. I interviewed at Inova in Apr 2012", "Interview Descriptions": "They just asked me of my background and my interest in healthcare.. Also questions to determine if I am social, friendly.. am I competent to answer hospital related calls in a professional manner.", "Interview Questions": "Do you have any foreign language skills?"}, {"date": "20 Sept 2013", "title": "Surgical Tech II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Inova (Fairfax, VA) in Feb 2012", "Interview Descriptions": "I applied online, traveled for a 1:1 interview with HR and the OR Educator, received an offer maybe two days later. wasn't able to start until Inova offered a hospital wide three day orientation to anyone hired in that time [approximately a month and a half after the initial interview]", "Interview Questions": "N/A"}, {"date": "30 Mar 2013", "title": "IT Voice Lead Operator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at Inova in Nov 2011", "Interview Descriptions": "I was referred to the position by a friend. I submitted my resume and application on line a few weeks later I received a call from an HR rep. Following the interview I was given an offer and I started training about a month later.", "Interview Questions": "N/A I interview pretty well. But you may want to read the job description and make sure you fully understand everything that the position will require. "}], [{"date": "9 Oct 2015", "title": "Mental Health Technician Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Inova (Falls Church, VA) in Aug 2011", "Interview Descriptions": "initial phone interview with a recruiter where they just set up a time for you to come in to meet with management.  when you come in for the initial interview you meet with two managers for about 20 to 30 minutes and then have a peer interview with 2 to 3 current employees.  a few days after that you will receive a phone call regarding whether or not you got the job", "Interview Questions": "how would you handle an unruly patient"}, {"date": "6 Oct 2015", "title": "Unit Secretary Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 months. I interviewed at Inova in Jul 2011", "Interview Descriptions": "Easy - Met with Boss , she asked me a few questions about my past jobs, asked me about what I'm doing to further my education and career. After I took tour of the unit , met with potential coworkers - found out I got the job a week later!", "Interview Questions": "Few questions - past work history and work ethic (Less than 5 minutes)"}, {"date": "2 Jul 2012", "title": "Patient Financial Services Representative III Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 6 weeks. I interviewed at Inova (Falls Church, VA) in Apr 2011", "Interview Descriptions": "I was first called by HR and scheduled face to face with hiring manager. Met hiring manager and interview went very well. After 4 weeks I was called by the Director and 2 weeks after that I was offered the position.", "Interview Questions": "Tell me something about yourself"}, {"date": "19 Nov 2011", "title": "Human Resources Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Inova (Fairfax, VA) in Apr 2011", "Interview Descriptions": "Interview process was good.  Recruiter was very good in following up and scheduling additional interviews.  Process was thorough and organized.  Interview process included initial telephone interview with recruiter and hiring manager, followed by face-to-face interview with manager and panel interview of three.  The information regarding next steps was very good and helpful, again due to the excellent recruiter assigned to the position.", "Interview Questions": "Tell me about a time when you were not successful in building rapport with a colleague."}, {"date": "15 Dec 2015", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Inova (Fairfax, VA) in Mar 2011", "Interview Descriptions": "Too long, convoluted and very difficult to get thru to HR. Lots of good applicants never make it past the gate keeping of HR because HR doesn't know how to screen for RN positions.", "Interview Questions": "Why do you want to work for Inova?"}, {"date": "14 May 2015", "title": "New Grad RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Inova (Arlington, VA) in Mar 2011", "Interview Descriptions": "The interview process once you get the interview is OK but the recruiting process is horrible. They never get back to you, take forever to set up the interview, they are very disorganized", "Interview Questions": "What would you do if you have a difficult physician to deal with."}, {"date": "1 Sept 2015", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Inova (Leesburg, VA) in Mar 2011", "Interview Descriptions": "It was very direct, brief, and informative. They asked me multiple questions regarding why I wanted to work there and they were very descriptive on what I had to do.", "Interview Questions": "They asked me why I wanted to be there. I said I wanted to be there to improve my resume and to gain experience working in a hospital."}, {"date": "27 Oct 2015", "title": "Occupational Therapist - PRN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Inova in Jan 2011", "Interview Descriptions": "Applied online, and received a call from HR fairly quickly.  Set up an in person interview within two weeks.  Initial interview was with an HR rep, very personable, and gave overview of organization, and potential hiring process.   PRN position was without benefits, which is customary, so no discussion.   Then escorted to hiring manager interview, which was focused on my skills as an OT, along with a brief tour of the facility.", "Interview Questions": "What is one of your key strengths as an OT?"}, {"date": "21 Jan 2015", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Inova in Jan 2011", "Interview Descriptions": "Interview process went well. The practice manager asked pretty general questions such as, \"where do you see yourself in 5 years?\" \"Where do you see yourself in 10 years?\" It was very brief, but she made it comfortable", "Interview Questions": "N/A"}, {"date": "25 Apr 2014", "title": "Physician Extender Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Inova (Falls Church, VA) in Sept 2010", "Interview Descriptions": "Met with supervising physician, submitted a plan of ideas to implement, received a phone call with an offer from HR with a low ball offer.", "Interview Questions": "Asked how I would handle different clinical situations."}], [{"date": "21 Mar 2012", "title": "Clinical Research Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Inova (Falls Church, VA) in Aug 2010", "Interview Descriptions": "Interviewed by a couple people from the team and then brought back to meet the rest of the team on a second day. The interview process was a pleasant experience, but I have very good interviewing skills. I have heard of some teams asking candidates to shadow prior to being offered the job. I think that is a total waste of time, and don't know why they do it.", "Interview Questions": "Basic generic interview questions and some technical questions related to the job."}, {"date": "5 Mar 2011", "title": "RN II In the NICU At CNMC Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Inova (Fairfax, VA) in Jan 2009", "Interview Descriptions": "Application online\r\nThey called the next day.\r\nInterviewed within a couple weeks.\r\nJob offered to me.\r\nOffer letter received in the mail with salary specifications and benefits.", "Interview Questions": "N/A"}, {"date": "31 Aug 2012", "title": "Supervisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Inova (Falls Church, VA) in May 2008", "Interview Descriptions": "I submitted my application online. About 3 days later I received a call from a recruiter requesting that I interview with the departments director. During interview the director was very cordial and basically used behavior based interview questions. I was offered the job immediately and was advised that HR would contact me with additional requirements. The following day I was contacted by HR to respond to Telstar Court for a personality profile test. The following day I was, again, contacted by HR to report for New Employee Orientation. The entire process took about two weeks.", "Interview Questions": "Describe for me; (1) a difficult employee performance deficiency that you have had to handle, (2) how you handled it, (3) was there a positive outcome?"}]]