[[{"date": "30 Mar 2023", "title": "Server Engineer Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Tanner Health System in Feb 2023", "Interview Descriptions": "An hour long conversation with prepared and off the cuff questions. Discussed environment and expectations of the position specific to the position as well as other fields that you may be called on to support. Also rotation schedules and on call generalities.", "Interview Questions": "What would you do if you couldn't get into vCenter?"}, {"date": "30 Jan 2023", "title": "CCHT/Patient Care Technician Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Tanner Health System", "Interview Descriptions": "Think this is a great place to work I think that they are very professional and understanding will definitely recommend to other healthcare professionals if they are interested the distance is really close for me and the opportunity is amazing", "Interview Questions": "What do you intent to do at a tanner health"}, {"date": "16 Sept 2022", "title": "Imaging Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Tanner Health System", "Interview Descriptions": "Standard process with the expected interview questions, nothing out of the ordinary.  People are very nice.  Not sure what else I can add.  Prepare for the typical interview questions, apply all routine guidelines", "Interview Questions": "What is your greatest strength "}, {"date": "29 Jul 2022", "title": "Intake Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Tanner Health System (Atlanta, GA)", "Interview Descriptions": "Spoke with manager and completed a peer interview. Manager asked great questions. I was able to ask questions. Afterwards I was able to tour facility. Staff was friendly. Nice facility.", "Interview Questions": "What’s your definition of teamwork "}, {"date": "7 Jul 2022", "title": "Certified Nursing Assistant CNA Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Tanner Health System", "Interview Descriptions": "I applied for the position online. I was called in for a interview. The interview was easy and not at all nerve wrecking.  I would say just come in professional and prepared. Don't be afraid to ask questions", "Interview Questions": "Why do you want to work for tanner"}, {"date": "8 Jan 2022", "title": "Nurse Practitioner Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Tanner Health System (Carrollton, GA) in Dec 2021", "Interview Descriptions": "Applied online and was contacted for a phone interview to review my experience. Had 2nd interview at Tanner Health where I met other providers and was given a tour. It was like a rolling interview to meet everyone and allowed them to ask any questions.", "Interview Questions": "Asked about education and work experience briefly. \r\nDo you have any questions? "}, {"date": "29 Nov 2021", "title": "Sleep Technologist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Tanner Health System", "Interview Descriptions": "Interview was straight forward and I felt at ease and comfortable. Sometimes in an interview you cam feel judged, but I didn't feel that way at all. Actually asked relevant questions to my education and experience, rather than just general \"what do you do in xx situation\"", "Interview Questions": "What is your greatest weakness"}, {"date": "26 Nov 2021", "title": "Lab Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Tanner Health System (Oxford, AL) in Sept 2021", "Interview Descriptions": "it was new. I did an over the phone. I had never one one of them before and it was different.  it was not overly difficult. I although had a hard time hearing her on the phone.", "Interview Questions": "They asked, \"how I saw myself?\""}, {"date": "8 Nov 2021", "title": "Sonographer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Tanner Health System (Carrollton, GA) in Aug 2021", "Interview Descriptions": "The interview process was very easy and smooth. I was able to meet some of the staff I would be working with as well as getting a small tour of the hospital", "Interview Questions": "what school I attended, did I have any experience"}], [{"date": "26 Jul 2021", "title": "Caseworker III (Associate Clinical Therapist) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Tanner Health System", "Interview Descriptions": "The interview process was very easy going and all parties involved stayed on top of each task. Communication was amazing and everyone was delightful. Even through Zoom complications, the interviewing process was great.", "Interview Questions": "What made you chose this particular  company? "}, {"date": "7 Jul 2021", "title": "Certified Nurse Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Tanner Health System (Carrollton, GA)", "Interview Descriptions": "I first had a telephone interview and then was set up for an in person interview with a Nursing Manager. I was actually contacted by another nurse manager and interviewed with both same day. Kayla Holland in HR is a doll! She made the interview process so much more relaxed. She was very helpful from the initial phone interview to the moment I accepted the offer.", "Interview Questions": "Why did you choose Tanner?"}, {"date": "24 May 2021", "title": "Patient Access Representative II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Tanner Health System", "Interview Descriptions": "Phone interview then in person interview then after that they will offer you a job do a backround check check references and drug testing. If you don't have already college or school transcripts they will ask for you to retrieve them from your schools.", "Interview Questions": "Tell me about yourself?\nWhy should we hire you?\nIn 5 years where do you see yourself in your career\nHow do you handle conflict \nWhat is your greatest strengths \nWhat are your weakness?\nWhy did you leave your last employer?"}, {"date": "27 Jun 2021", "title": "Talent Acquisition Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 2+ months. I interviewed at Tanner Health System (Atlanta, GA) in Apr 2021", "Interview Descriptions": "My interview for this particular position turned more so into an interview for a position within the Tanner Health System that I did not apply for, nor was I interested in, because it seemed they were desperate to fill another position besides the one I applied. Over a month went by before I heard back from the interviewer declining me for the position by an automated email.", "Interview Questions": "How would you pitch the department to a class of children?"}, {"date": "2 Sept 2020", "title": "Patient Access Representative Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Tanner Health System", "Interview Descriptions": "I was interviewed by two different people on the same day. They were most concerned about my availability and what I thought I could bring to the company. They ask you about what you plan on doing in your future I think to grasp how long you are planning on staying at Tanner. They ask about what you do in your free time. Overall it was pretty laid back.", "Interview Questions": "What does your schedule look like on a weekly basis?"}, {"date": "18 Sept 2020", "title": "Radiological Technologist (ARRT) Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Tanner Health System (Carrollton, GA) in Sept 2020", "Interview Descriptions": "I talked to HR today for my first interview. It went very well I think. The lady was super easy to talk to and very kind. She asked basic questions about your previous work experiences, who you are, why you choose Tanner Health, if you are willing to expand your horizon, and how you handled past situations. Overall, it was a great experience.  Tomorrow I have my phone interview with the hiring manager.", "Interview Questions": "They asked me about a past situation that was difficult to deal with, and how I handled the situation. It could include a difficult patient, coworker, manager, or anything that made the situation difficult. "}, {"date": "15 Jan 2020", "title": "Patient Access Representative/Cashier Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Tanner Health System (Carrollton, GA) in Dec 2019", "Interview Descriptions": "Applied online. Received a phone call to reply to an email and choose a date to interview. I scheduled a date.  During the interview I was asked a serious of questions.  I've been on many interviews for different jobs and never get a call back, even though it seemed positive and everything went well. They seem a bit unorganized since I was called back for the same position and a different location. They told me that they should have done a phone interview instead. waset of my time  to be honest. I tried for 5 months to get in and they wanted me to do more references even though I already gave them, and was within the 6 month period. References are good for 6 months but wanted me to do them again for a different position. I applied for cashier position as well and they told me they were desperate, but needed to rate me on a scale, they never called and I keep seeing the same ads online for all the positioned I applied for.", "Interview Questions": "Who do you admire?"}, {"date": "22 Sept 2019", "title": "IT, Help Desk Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Tanner Health System (Carrollton, GA) in Sept 2019", "Interview Descriptions": "I applied online 41 days before they contacted me but they may have not considered my application until I went back 39 days later and added \"additional documents\" which where listed as optional (I went back because I was applying for a different position). A couple of days later, I received the email requesting me to schedule an interview and I was able to schedule it for the following morning (there was a plethora of dates and times available). I met an HR rep for the initial interview at the instructed location and after managing to not screw it up I was told that I was fit to meet the IT department head. Idk if it was just coincidence but I was able to schedule the meeting for thirty minutes later, just enough time to find the right building.  We discussed the job duties and she essentially, but not officially offered me the job and we discussed the start date. Later that day the HR rep I interviewed with called and we discussed the offer. She said she'd send the official, contingent offer in '15 minutes or as fast as she can type' but I didn't receive it until I emailed her to check on it the following day.  It happens. The offer was contingent on my ability to pass a background check, drug screen, and my references verifying my skill set. On that note, I was supposed to receive an email with a link to skillsurvey.com to put in my references \"within 24 business hours of scheduling [my] interview\" but I didn't get it until like a day after I received the offer. An important thing to note is that you'll need 5 references. I had 3 on hand since that's what most places require but I had to call on college colleagues to get the other 2. Similarly", "Interview Questions": "Tell me about yourself"}, {"date": "3 Oct 2019", "title": "New Grad Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 1 week. I interviewed at Tanner Health System (Carrollton, GA) in Sept 2019", "Interview Descriptions": "There was not really an interview process. I went to a job fair and was offered a job on the spot. They spelled out the benefits and pay right there on the spot as well", "Interview Questions": "Why do you feel like you’re a fit for this department"}], [{"date": "25 Aug 2019", "title": "Primary Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Tanner Health System (Villa Rica, GA) in Aug 2019", "Interview Descriptions": "I meet the hiring manager at a meeting, sent her my resume, she called me for an interview, the HR called for an interview. The HR interview was suppose to be first but they need the position filled quickly.", "Interview Questions": "Tell me about yourself. Therapeutic style? How do you handle conflict? How do you handle difficult client?"}, {"date": "3 Jul 2019", "title": "Patient Registrar Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Tanner Health System", "Interview Descriptions": "Quick interview, I applied was called the next day. An interview was scheduled at HR the following week I went in and spoke with an HR representative she immediately told me I had a second interview after asking me questions. The second interview was right after at another facility, I was asked a few questions then told I would hear back by the end of the week. I didn't hear back for 2 weeks", "Interview Questions": "Tell me about yourself?\r\nWhy would you be a good fit for us?"}, {"date": "11 Jul 2019", "title": "Patient Access Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Tanner Health System (Carrollton, GA) in Jul 2019", "Interview Descriptions": "I applied online and it took them 6 days to respond. I first had an interview with a lady in Human Resources. She then forwarded me to the hiring manager at the hospital in Carrollton. I interviewed with two hiring managers. Said it would take 2-3 weeks to respond. But I got a job offer the next day. The interviews were great, and I got to tour the emergency room.", "Interview Questions": "Who do you admire most?"}, {"date": "4 Aug 2019", "title": "Staff Licensed Practical Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Tanner Health System (Carrollton, GA) in Jul 2019", "Interview Descriptions": "Applied online and received and email 3 days later to setup an in person interview. I arrived on time and waited about 7 minutes to meet with recruiter. We spoke for about 30 minutes on the position and why I would be a fit for the company. I then met with unit manager at hospital who described position and unit and made me feel I had the position.", "Interview Questions": "Tell me about yourself, tell me about your experience. "}, {"date": "10 May 2019", "title": "ER Tech Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Tanner Health System", "Interview Descriptions": "I was asked a series of questions related to the job choice. I was also asked about my schooling and what I was working towards as far as working in the medical field.", "Interview Questions": "Would you be able to be on call?"}, {"date": "6 Aug 2019", "title": "Intake Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Tanner Health System (Villa Rica, GA) in May 2019", "Interview Descriptions": "I had a positive experience. Staff was very friendly and attentive.  I completed the phone interview first and was asked to come in for a face to face interview. I would recommend this position to someone fresh out of school. The starting hourly rate was the reason I declined the position. I am still open to working for the company and check the job listings regularly.", "Interview Questions": "Why did you leave your last job. "}, {"date": "31 Dec 2018", "title": "Speech Language Pathologist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at Tanner Health System", "Interview Descriptions": "I applied for a posted position and was contacted by phone and email. I listened to the voicemail after hours so I responded to the email with days and times I was available to speak. I didn't get a response to that email, but received another email a few days later from the same person. I decided to call this time, and then voicemail I received listed a number different than the one I dialed. I decided to leave it alone at that point. A few days ago (about 2 months after I first applied) I got an email from the system stating that my credentials didn't match their needs, which doesn't quite make sense for the type of job for which I applied. This was altogether a very strange experience. I'm not sure if the issue was with the particular HR person or Tanner as a whole, but I am very displeased.", "Interview Questions": "None, since the HR person was unprofessional and didn't respond to emails and calls (after first contacting me)"}, {"date": "13 Aug 2018", "title": "Communications Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Tanner Health System (Carrollton, GA) in Jul 2018", "Interview Descriptions": "A few days after an online application, I was contacted for an interview.\r\nBelow I have pasted literally (not joking) the entirety of the job call.\r\n\r\n>>The Epic Communication Manager develops, oversees and executes communications for the Epic project.\r\nQUALIFICATIONS: Bachelors Degree in public relations, marketing, communications or journalism.\r\nFive years of previous experience in communications.\r\nProficient in Microsoft Office applications Word, Excel, and PowerPoint.<<\r\n\r\nThat's it, so I called to ask questions before accepting the interview. I was directed to an out-of-state contractor who turned out to be the only useful or helpful person in the process.\r\n\r\nIn interview, I was met by two people and the contractor by phone. It lasted under 20 minutes, clearly rushed, and they had us lined up to churn out. They must have been packing in 3 interviews per hour, and they still didn't know what they wanted the job to be. It was a mess.", "Interview Questions": "Tell us about yourself"}, {"date": "24 Jul 2018", "title": "Patient Access Representative Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Tanner Health System (Atlanta, GA) in Jul 2018", "Interview Descriptions": "Very easy questions, took a typing test which I did great on. It was an open interview day so anyone could be there. Had interview did not hear back from them", "Interview Questions": "What interests you to work here, what skills do you have, how would you describe team work, what are your strengths and weaknesses"}, {"date": "5 Jun 2018", "title": "Clinical Educator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Tanner Health System (Carrollton, GA) in Apr 2018", "Interview Descriptions": "I interviewed first with the HR rep where my previous experience was reviewed and a more detailed description of the job was given. I then drove to the hospital where I interviewed with the Director.", "Interview Questions": "What questions do you have for me?"}], [{"date": "9 Apr 2020", "title": "Human Resources Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Tanner Health System in Mar 2018", "Interview Descriptions": "Went through 3 interviews. Each was helpful and insightful. HR rep was very knowledgeable about the position & the needs required of me.  After initial offer was made, I completed background check and drug/alcohol/fit for duty test. Began work and a week later attended orientation", "Interview Questions": "How well do I handle change?"}, {"date": "8 Mar 2021", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Tanner Health System (Carrollton, GA) in Nov 2017", "Interview Descriptions": "Very smooth process. The staff was friendly and welcoming. I was aware of what time and where to be. I was also encouraged to bring an additional copy of the resume. I was pleased they were so willing to work with my schedule considering I worked night shift at the time. They were very responsive to any question or concern I had prior to my interview.", "Interview Questions": "What brings you to apply to our company? "}, {"date": "5 Nov 2017", "title": "Licensed Practical Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Tanner Health System (Carrollton, GA) in Feb 2017", "Interview Descriptions": "Started with interview screening in human resources. Then spoke with nurse manager regarding position and expectations for position. Had time to ask questions and saw unit. Very relaxed interview process.", "Interview Questions": "Why did I want to leave former job"}, {"date": "13 Mar 2017", "title": "Patient Access Representative Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Tanner Health System (Carrollton, GA) in Feb 2017", "Interview Descriptions": "First I spoke with Human Resources.  They asked the typical interview questions.  I took a typing test.  Next I interviewed with the hiring manager.  She told me a about the job and asked a few questions about my skills and strengths and weaknesses.", "Interview Questions": "What are your weaknesses?"}, {"date": "3 Nov 2016", "title": "Phlebotomist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Tanner Health System (Carrollton, GA)", "Interview Descriptions": "Answer interview questions at HR. Answer questions about past employment and experience. After talking with HR you will go to the department to speak with the supervisor. If everyone likes you they will offer employment.", "Interview Questions": "Past employment"}, {"date": "6 Sept 2016", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Tanner Health System (Carrollton, GA) in Sept 2016", "Interview Descriptions": "New Grad First interview was laid back and relaxed. Basically talked about current and past experience. I was asked if I had any questions. I did ask about the orientation for New Grad RNs, benefits, and shifts available for this position. It moved quickly and I was offered the next interview with a panel.", "Interview Questions": "Describe a time when you went above and beyond for a client."}, {"date": "4 May 2016", "title": "Patient Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Tanner Health System (Carrollton, GA) in Mar 2015", "Interview Descriptions": "general interview...it took them months to call me for the interview...tobacco/dug test/background check required...i interviewed with the HR personnel then she called the department supervisor and he came and interviewed with me and offered me the position.", "Interview Questions": "my experience? what will i do in certain situations?"}, {"date": "29 Oct 2014", "title": "Patient Access Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Tanner Health System", "Interview Descriptions": "Applied online for this position at a minimum of five times. It seems to take awhile to get into this company, probably due to it being a smaller company in a small town (meaning most people know someone who can at least get them an interview) I knew no one, and it took quite a while to receive an interview. I met with an HR rep, who interviewed me, then introduced me to the hiring manager, who asked additional questions. Everyone was very professional. I received a call back approximately two weeks later from HR informing me I received the position. I also had to take a typing test at the beginning of the interview before I spoke with anyone.", "Interview Questions": "This was so long ago, the only thing I remember being asked were the typical questions (tell me about a previous time when you handled an upset customer, tell me about your previous work, what did you like most about your previous jobs)"}, {"date": "15 May 2014", "title": "Patient Services Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Tanner Health System (Carrollton, GA) in May 2014", "Interview Descriptions": "Went to first interview. Things went great the interviewer told me I did well. And I should hear back sometime that week. So a few hours after the interview. I got a call for a second interview a few days later. At that interview I was told about the job. He didn't ask me anymore interview questions. Told me what location I would be working. A lot of basic information that made me feel as if I had the job. But I checked online a week later and it said they were proceeding with other candidates. Didn't even check my references.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "11 Apr 2014", "title": "Health Advocate Interview", "results": "No Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Tanner Health System", "Interview Descriptions": "Was contacted by phone to set up initial interview, HR lady was very nice and willing to work with my school schedule. Scheduled appointment for the next day. Interview was very laid back, easy questions, and then I went to interview with the boss of my department. That interview was also very laid back and she Didn't really ask many questions, just told me about the position.", "Interview Questions": "If you could change one thing about your current job, what would it be?"}], [{"date": "22 Oct 2013", "title": "Human Resource Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Tanner Health System (Carrollton, GA)", "Interview Descriptions": "I interviewed with such a lovely person. She was great and had an amazing sense of humor. I felt we hit it off but I didn't get the job.  I had to take the Word and Excel test which was fairly easy if you used the programs before. A drug test is required but an alcohol and nicotine test is too.  No smoking or drinking when working for this company. They also encourage exercising. Very health oriented (of course considering it's a medical center)", "Interview Questions": "Why do you want to work at Tanner?"}, {"date": "17 Jul 2016", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Tanner Health System (Carrollton, GA) in Jun 2012", "Interview Descriptions": "It was very casual and helpful. It was one on one which is my favorite way to interview. They were very open about what they were looking for. They helped me grow as a nurse.", "Interview Questions": "Why do you want to work for Tanner?"}, {"date": "15 Dec 2015", "title": "Mlt Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Tanner Health System (Carrollton, GA) in Jan 2012", "Interview Descriptions": "was very informal and relaxing I had no problems with the interview and was very much looking forward to going to work as soon as I could. the workplace was very nice I received a tour of the facility.", "Interview Questions": "what is my work experience"}, {"date": "5 Nov 2011", "title": "Clinical Support Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 2 weeks. I interviewed at Tanner Health System (Carrollton, GA) in Dec 2009", "Interview Descriptions": "after setting up the interview via phone, I had an interview one on one, fairly simple questions, very nice interviewer, managed to get the job with such nerves making my answers mediocre at best. e ven with the friendly interviewer I was never made to be at ease, The entire process was two weeks, It made me very impatient, but excited when they finally called back.", "Interview Questions": "why should we hire you?"}]]