[[{"date": "18 Aug 2022", "title": "Project Management Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Terros Health", "Interview Descriptions": "I had an initial phone interview with an HR rep, then I had an in-person interview with 3 employees. The process was simple and quick. Great people, great atmosphere, easy process.", "Interview Questions": "Tell me about a time you led a project."}, {"date": "11 Aug 2022", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Terros Health", "Interview Descriptions": "Had multiple interviews with them and then they completely ghosted me. I tried to reach out for a follow up and nobody was able to get back to me. It was pretty disappointing since I had reached out a couple weeks later when they said they’d get back to me after a week.", "Interview Questions": "Why do you want to work for Terros?"}, {"date": "18 Mar 2021", "title": "Clinician Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Terros Health (Mesa, AZ) in Mar 2021", "Interview Descriptions": "Easy to schedule and quick to contact. Ready to answer questions and acknowledge the schedule and high case loads at the start. Easy to talk to and encouraging. Will work with you to find the right placement for you.", "Interview Questions": "How do you manage high case loads?"}, {"date": "6 Aug 2020", "title": "Behavioral Health Technician Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Terros Health", "Interview Descriptions": "The man that interviewed me was very nice, and asked about previous experience and why I wanted to work in the field of behavioral health. In addition, he asked about my education and background.", "Interview Questions": "If I knew how to write a progress note- gave me a scenario"}, {"date": "26 Nov 2019", "title": "Clinician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Terros Health", "Interview Descriptions": "apply online, outreached by HR for phone prescreen, called by manager for interview.  The interview was lengthy. the manager told me about both the pros and cons of the position which was helpful.", "Interview Questions": "N/A"}, {"date": "16 Oct 2019", "title": "Behavioral Health Technician Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Terros Health (Phoenix, AZ) in Oct 2019", "Interview Descriptions": "Easy process. I was asked a lot of questions related to the position. I was able to tie my previous experiences to the job. Found out later that day that I got the position.", "Interview Questions": "Describe a difficult situation and what you did to overcome it."}, {"date": "5 Aug 2019", "title": "BI Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Terros Health (Phoenix, AZ) in Jul 2019", "Interview Descriptions": "First they will do a phone screen. If that goes well, you will get invited to the office fairly quickly. After that they will disappear and not let you know where  you stand. It is frankly rude to not update candidates.", "Interview Questions": "What can you do in Python?"}, {"date": "4 Oct 2018", "title": "Peer Support Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Terros Health (Tempe, AZ) in Oct 2018", "Interview Descriptions": "Interviewing staff was very professional and personable.  Questions they asked were relevant and easy to understand.  They did a great job of making me feel welcome and that they were exited to have me join their team.", "Interview Questions": "Describe a time when a conflict occurred in the work place and how did you handle it."}, {"date": "23 Oct 2018", "title": "Case Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Terros Health (Phoenix, AZ) in Jul 2017", "Interview Descriptions": "Very poorly done no compassion at all she nerver called me back until I called her she said she was just gonna call every one she interviewed so she decided to go with her passed employees something she should of known before haveing people come out to interview", "Interview Questions": "About my experience goes back to 1983 when I arrived in america my moms passing I took care of her for 8 years before she passed on my experience has been very wide spread"}, {"date": "28 Feb 2017", "title": "Administrative Role Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Terros Health", "Interview Descriptions": "I literally had 4 interviews with this company. During my last interview, the interviewer continuously answered her cell phone. Her attention was on that and not on the interview at hand. The interview felt rushed as if she had other things to do. She informed me that she did not know why she was interviewing me as she doesn't have a say in which individual is selected for this role. Hiring manager gave me his business card and I emailed once and left a voice mail message and he never responded to my request. I know this position has been posted for at least 5 months. No candidate in 5 months is good enough for this company.", "Interview Questions": "Typical behavior interview questions"}], [{"date": "10 Mar 2016", "title": "RBHA Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Terros Health (Phoenix, AZ) in Jan 2016", "Interview Descriptions": "The Process was very Professional, outline what the job it entailed in full detail. Explained what the expectations of the job would be. In addition, explained their current billing situations and software issues they are encountering and ask what could be done to remedy the situation in detail. I was there the first candidate for this position.", "Interview Questions": "Please explain in detail your revenue cycle experience. "}, {"date": "3 Dec 2015", "title": "Case Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Terros Health (Phoenix, AZ) in Apr 2014", "Interview Descriptions": "About a half an hour process different situational questions about how to handle clients.  I was given a tour and asked about my work experience and explained the details of the job.  I asked questions and the interviewer asked me how I handle different issues with co-workers in the past and what I like about this field of work.", "Interview Questions": "Situational questions. Why you want the position?"}]]