[[{"date": "27 Feb 2023", "title": "Team Member Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Wisconsin Union", "Interview Descriptions": "Very simple and easy interview process carried out on Zoom. Questions were basic and mainly about availability and preference on where to work. An easy place to work for students.", "Interview Questions": "What is your biggest strength?"}, {"date": "16 Sept 2021", "title": "Kiosk Worker Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Wisconsin Union", "Interview Descriptions": "Very easy. Basically just come in and talk to the hiring managers or general manager and figure out when you want to work. This was a few years ago though.", "Interview Questions": "When are you available to work?"}, {"date": "16 Jun 2021", "title": "Barista Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Wisconsin Union", "Interview Descriptions": "It was super easy and more conversational. Went through my resume and talked about the experience I had from working in a restaurant. The interview lasted maybe only 20 minutes.", "Interview Questions": "Have you made coffee drinks before?"}, {"date": "20 Apr 2019", "title": "Dining Services Marketing Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Wisconsin Union", "Interview Descriptions": "A brief 20 minute interview that was friendly and relaxed, but still thorough. It was a one on one with the person looking to hire two new interns for the position. I did not feel stressed in the situation, and left wanting to work for the employer because they made the job seem like a very valuable experience- in the end, it was.", "Interview Questions": "What are your career aspirations after graduation?"}, {"date": "24 Sept 2018", "title": "Production Associate Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Wisconsin Union", "Interview Descriptions": "The process took maybe 2 weeks. I applied online and then got an interview soon after. He described the job, its functions, the company, and what we do on a day-to-day basis, and then offered it to me without saying a word.", "Interview Questions": "So, you want the job?"}, {"date": "29 Jun 2021", "title": "Admisnitrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Wisconsin Union in Jun 2018", "Interview Descriptions": "It was a warm experience with nice people. It took a while to get an interview but I heard on a decision rather quickly in comparison to other jobs that i have had in the past.", "Interview Questions": "How would you compare your time management and organizational skills to other peers and why?"}, {"date": "25 Jan 2016", "title": "Communications Director of the Wisconsin Union Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Wisconsin Union (Madison, WI)", "Interview Descriptions": "Brief on my part. I submitted a resume and cover letter, then received a call asking to set up a phone interview. The phone interview was with 5 people and lasted only 10 minutes, which is a little short to really get a good feel for a candidate, but it was an initial screening. \r\n\r\nI didn't make it past that portion, but the hiring manager was tremendous in making a personal phone call to inform me that I would not be considered past that point for the position because they are going with candidates with more experience, and thanking me for applying and taking the time to interview over the phone. \r\n\r\nThat was truly the most professional experience I've had with a potential employer and deserves to be noted. I can't even be miffed that I didn't get the position because they treated me with the utmost respect.", "Interview Questions": "Related to scenarios on the job"}, {"date": "5 Feb 2018", "title": "Building Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Wisconsin Union (Madison, WI) in Jan 2016", "Interview Descriptions": "They ask a lot of situational questions. Be able to demonstrate your ability to multi-task and interact with difficult people, ability to work nights and weekends, they like a relaxed demeanor. Ability to balance school, extracurriculars and your job at the Union.", "Interview Questions": "They give a question about a bunch of things going on at once and you have to explain what you would do in what order and why."}, {"date": "11 Dec 2015", "title": "Daily Scoop Cashier Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Wisconsin Union", "Interview Descriptions": "I filled out an application online. The manager got back to me within a few days. I came in for an interview and the manager showed me around a bit. I wasn't asked much other than what my availability was and when I could start then the manager offered me the job right away.", "Interview Questions": "What is your availability?"}, {"date": "11 Dec 2015", "title": "Building Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 5 days. I interviewed at Wisconsin Union (Madison, WI) in Aug 2014", "Interview Descriptions": "Set of scenario related questions on how you interact with customers. Customer service and good workplace relationships are key. It's only one round. No prior manager experience is needed. If they feel that they need to know more about you, you could potentially be called in for a second interview but probably won't need to. References will be checked and you should hear back within a week.", "Interview Questions": "Why do you want to become a BM?"}], [{"date": "20 Jul 2015", "title": "Graphic Design Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Wisconsin Union (Madison, WI) in May 2013", "Interview Descriptions": "Casual, brief, informative. 2 person panel - both were my future bosses. Both seemed nice and had good questions. Gave decent, detailed feedback on my work. Total time was about twenty minutes.", "Interview Questions": "What is your favorite project in your portfolio?"}, {"date": "6 Oct 2015", "title": "Badger Market Cashier Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Wisconsin Union (Madison, WI) in Feb 2013", "Interview Descriptions": "Company was looking to do a mass hiring for new building and other locations. Lasted about 20 minutes. Discussed availability, but did not get assigned a unit/location until job offer.", "Interview Questions": "Asked general questions about customer service experience."}, {"date": "30 Sept 2015", "title": "Cashier Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Wisconsin Union in Jan 2013", "Interview Descriptions": "There was not much of a hiring interview, they did not ask many question just general if I have this amount of money how much should you return the customer and all that", "Interview Questions": "N/A"}, {"date": "2 Oct 2013", "title": "Team Member Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Wisconsin Union (Madison, WI) in Oct 2012", "Interview Descriptions": "There is only online application, and got the job after that", "Interview Questions": "what is your best customer service experience"}, {"date": "5 Nov 2016", "title": "Barista Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1+ week. I interviewed at Wisconsin Union (Madison, WI) in May 2012", "Interview Descriptions": "The interviewing process was very good. I liked the interviewing process a lot. Some really good processes were used in the interviewing process. I wish every employer used their interviewing process. The world would be a better place if their interview processes were used everywhere. Really outstanding interview processes and a really good experience. I hope this helps inform people about the really good interviewing process here. More people should know about how good the interviewing process is. Yeah.", "Interview Questions": "They asked about previous experience"}, {"date": "27 Dec 2013", "title": "Wisconsin Union Building Services Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 4 days. I interviewed at Wisconsin Union (Madison, WI) in May 2012", "Interview Descriptions": "It was very short and informal. You get asked why you want the job and how available you are. Then you submit the necessary paperwork and you work in no time. Just dress nicely and I'm sure you'll be accepted!", "Interview Questions": "It was very simple."}, {"date": "31 Jul 2014", "title": "Supervisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Wisconsin Union in Feb 2012", "Interview Descriptions": "I brought my CV into an interview and a manager just asked me why I wanted to work there and what my availability was. They hired me on the spot.", "Interview Questions": "\"What was your least favorite part about your previous job?\" "}, {"date": "31 May 2013", "title": "Part-time Student Job Within the Administrative Area Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Wisconsin Union (Madison, WI) in Jan 2011", "Interview Descriptions": "Start with applying the position online through the Wisconsin Union website. Either HR or managers will contact you through phone or email to schedule an interview with you if they deem you qualified for the position. For my position, most of the interview questions are simple and straightforward, such as “tell us about your self.”, “why are you interested in this position?”. Spanish fluency would be a plus.", "Interview Questions": "If you have a chance, who do you want to dine with? "}]]