[[{"date": "19 Jan 2023", "title": "Program Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Compass Health (Seattle, WA)", "Interview Descriptions": "They are a large employer and often hire from within, but not without wasting external candidates time interviewing, No ‘thank you’ for interviewing notice either. If Compass wants quality, they need to give it.", "Interview Questions": "Good interview questions were asked, but no probing for detail or unique assets."}, {"date": "23 Jan 2023", "title": "Care Coordinator Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Compass Health in Jun 2022", "Interview Descriptions": "I was asked to complete a response to a hypothetical scenario before the interview. In the interview, they never referenced it or asked me about it. When talking to coworkers, they said they didn't reference it either. I was asked about my experience, preferred manager style, teamwork ability, and coping methods due to the nature of the job. Extremely simple, offered the next day even though they said they would let me know a week later.", "Interview Questions": "What is your preferred manager style?"}, {"date": "1 May 2021", "title": "Psychiatrist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Compass Health (Chicago, IL) in Apr 2021", "Interview Descriptions": "Virtual - met with HR , then met with 4 clinicians who headed departments I would be working with, then I met with chief medical officer. The meeting with chief medical officer was on a separate day. The other interviews were back to back.", "Interview Questions": "I can’t remember specifics but there were not any off the wall or unexpected questions"}, {"date": "2 Oct 2019", "title": "PM Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Compass Health in Jul 2019", "Interview Descriptions": "Required recorded video responses, and was given no follow up feedback. This contributed to a highly impersonal and time consuming \"interview.\" The same questions could have been asked via phone for a more interactive experience.", "Interview Questions": "Standard background summary and role specific questions. "}, {"date": "23 Jan 2019", "title": "Clinician I Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Compass Health (Mount Vernon, WA) in Jan 2019", "Interview Descriptions": "The process was relatively quick. It took a week to hear from them after applying for the job. The interview was scheduled the following week and I had an offer a week later. They offered 17.74 to begin.", "Interview Questions": "How would you handle working with difficult clients. "}, {"date": "26 Jul 2018", "title": "Integrated Health Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Compass Health", "Interview Descriptions": "Applied and within a week I received an email to set up an interview time .  The interviewer was professional and friendly,m.  This was probably the toughest interview I have ever had .", "Interview Questions": "What is your greatest strength/weakness."}, {"date": "14 Jun 2018", "title": "Mental Health Technician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Compass Health", "Interview Descriptions": "I came in for the interview and met with one of the supervisors who was very friendly and personable. The interview itself did not feel natural because the supervisor who interviewed me had to write down my answers to all of the required questions. I would have preferred a more conversational style interview.", "Interview Questions": "What are the challenges of working in a group?"}, {"date": "19 Apr 2019", "title": "Peer Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Compass Health (Everett, WA) in May 2018", "Interview Descriptions": "The first thing they are going to want to know is did you have the proper training from dshs with online and in person training and completed certificate? They will ask about your recovery story I recommend not sharing clean date.", "Interview Questions": "What would you do if someone wants to kill themselves and are in crisis?"}, {"date": "4 Oct 2017", "title": "Hospital Transitions Program Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Compass Health (Everett, WA) in Sept 2017", "Interview Descriptions": "I corresponded with the supervisor looking to fill this position through email. She was extremely nice and friendly. The interview was with two women, the direct supervisor and the director. The hour was about an hour long.", "Interview Questions": "Describe a time you had a difficult time with a coworker. How did you handle it?"}, {"date": "15 Oct 2020", "title": "Office Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Compass Health (Everett, WA) in Sept 2017", "Interview Descriptions": "Interview is conducted by a program manager. It is a structured interview which contained  behavioral and scenario questions. There were about 14 questions total. My interview was about an hour long.", "Interview Questions": "What do you look for in a supervisor?"}], [{"date": "20 Jul 2018", "title": "Clinician I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Compass Health in Jul 2017", "Interview Descriptions": "The interview process was as follows:\r\n1. Phone screen with Program manager approx 15mins asking general questions about background and interests. Vetting to see if personality is a good fit as well\r\n2. Email request for any volunteer experience that is related to job functions of open position with a break down of hours served, number of years, location of service, and contact info (I made a spreadsheet and sent this to them) The Union pay scale allows them to utilize volunteer hours towards pay steps so definitely don't skip that step\r\n3.In person interview with program manager, office manager, and director of the WISe program over all Compass sites", "Interview Questions": "Lots of situation-based questions like \"What would you do if a distraught parent called you while you are on crisis pager saying their kid has locked themselves in their room and is destroying things?\""}, {"date": "13 May 2017", "title": "Mental Health Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Compass Health (Everett, WA) in Mar 2017", "Interview Descriptions": "Very easy process. Submitted an interview on a hiring website (I think it was indeed.com). Got a call a few weeks later to come in for an interview. The interview was about 30-45 minutes and only had 2 people sitting in on it. They were warm and engaging and asked questions that were easy for me to answer.", "Interview Questions": "They wanted to know about my education history and my work with children and at risk youth. They also wanted to know about my knowledge of at risk children's behavior and my passion for helping children in less than ideal situations improve their mental health. Good to have a background in dealing with proper boundaries of therapeutic relationships for both the individual and families. "}, {"date": "6 Apr 2016", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Compass Health (Everett, WA)", "Interview Descriptions": "I met with a recruiter at my school's career fair and filled out an application there. I was later contacted for some references (they check your references so please let your references know to pick up the phone). Then I got called in for an in person interview.", "Interview Questions": "Why do you want this job?\r\nWhat are your strengths and weaknesses?"}, {"date": "24 Jun 2016", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Compass Health (Everett, WA) in Apr 2016", "Interview Descriptions": "I was called in for an interview a few days before the actual interview. I met with the Manager that oversees the programs I'd be working with, as well as her boss, the director of the programs. They asked me all about myself, as well as your typical interview questions. They also had me sign a document stating I understood and could perform the duties required. It was very professional and they were both very friendly and talkative.", "Interview Questions": "What experience do you have working with data entry and medical charts?"}, {"date": "4 Feb 2020", "title": "Integrated Health Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Compass Health (Wentzville, MO) in Feb 2016", "Interview Descriptions": "Begin by applying online, submitting resume to HR and then wait for call. Scheduled interview was within 1 week, and was with direct supervisor as well as department director. Was notified within 3 days of job offer.", "Interview Questions": "Describe a difficult time in your current or previous role in which you felt a sense of accomplishment. "}, {"date": "14 Jul 2016", "title": "Accounting AP Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 5 days. I interviewed at Compass Health (Clinton, MO) in Aug 2015", "Interview Descriptions": "Emailed HR for them to contact supervisor, wait to receive email from supervisor about a possible interview.  Once email is received, the supervisor tells you about interview times and asks if you will accept a time slot.  Once accepted your interview is set up and you have time to prepare.", "Interview Questions": "How did you learn of this position?"}, {"date": "24 Jul 2015", "title": "Controller Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Compass Health (Crowley, LA) in Jul 2015", "Interview Descriptions": "2 interviews.  1st interview was about 2 hours.  No open ended questions.  Very nice and informative.\r\nSecond interview was to go over a few more details and then presented me with an offer.", "Interview Questions": "Are you good with deadlines?"}, {"date": "3 Aug 2015", "title": "Clinician II (Mental Health Counselor) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Compass Health (Mount Vernon, WA) in Sept 2014", "Interview Descriptions": "Brief phone interview which basically went over vague details of the work. In person interview with 3 people, who posed various questions from a form. Pretty easy-going. After the interview, it took a lot of follow up calls and emails to actually get the job offer. Not sure if they were considering other candidates or if there were funding issues.", "Interview Questions": "How have you responded to an uncomfortable situation with a coworker?"}, {"date": "19 May 2016", "title": "Clinician II (Mental Health Counselor) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Compass Health (Everett, WA) in Jul 2014", "Interview Descriptions": "The interview was basic and focused around theoretical orientation, past experiences and ways you self-care. I was interviewed by two people at the same time and it lasted about an hour. The interviewers were kind, professional and answered any questions I had for them and the position available. Based on my experience interviewing in the field before and after this interview, I would say it was average.", "Interview Questions": "Tell us about a time you acted in a way with a client during a crisis and what you would have done differently. "}, {"date": "10 May 2014", "title": "RN Charge Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Compass Health (Opelousas, LA) in Jun 2012", "Interview Descriptions": "Easy I was recommended by a friend. They needed a nurse right away..so I was hired..they gave me the salary I wanted. I did have to do a drug screenng and background check. They were very nice during the interview..however I do not think anybody else had applied.", "Interview Questions": "N/A"}]]