[[{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Highly valuable organization for Professional Development", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "8 Dec 2022", "job_title": "Manager in London, England", "duration": "N/A", "pros": "As its a small team, there is ample opportunity for one to explore and demonstrate various facets of water domain and engage with senior water leaders and institutions. This would definitely add to building your network and carrier opportunities in the international arena.", "cons": "Subtle Involvement in the various activities of the organization in addition to job description."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Bad", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Good experience", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "21 May 2022", "job_title": "Manager in London, England", "duration": "N/A", "pros": "Start-up culture, opportunity to work with experts in the water sector from around the world (mainly from universities), exposure to digital events. Good place to work if you want to build career in water sector", "cons": "Remote working was not good. Sometimes work becomes really hectic"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": 5, "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Working at IWA", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "15 Jun 2022", "job_title": "Director in London, England", "duration": "N/A", "pros": "Great to work with scientists and practitioners from across the world", "cons": "IWA has a lean workforce"}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Toxic Sewage!", "rating": "1.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "9 May 2022", "job_title": "Marketing Officer in London, England", "duration": "N/A", "pros": "The office was clean and safe.", "cons": "Toxic environment of bullying, poor inept management. \r\nComplaints were not handled well. \r\nDishonesty going on within some parts of company"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Terrible experience", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "13 Mar 2022", "job_title": "Officer in London, England", "duration": "N/A", "pros": "- Small Team\r\n- Based in London", "cons": "- Small team\r\n- Micro management\r\n- Terrible Pay\r\n- Rude managerial Staff\r\n- Asked to work late at night to do menial tasks"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Good employer", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "4 Jan 2022", "job_title": "Manager in London, England", "duration": "N/A", "pros": "Very good company to work for….open culture, new ideas are always welcome", "cons": "Work from home has impacted the work"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Definitely a good organisation to work", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "24 Aug 2021", "job_title": "Anonymous Employee in London, England", "duration": "N/A", "pros": "Good company for a professional in the water sector. One can get really good exposure working with leading water experts in the world. Ability to get access to the best publications", "cons": "Nothing I can think of....Can be hectic during conferences"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Truly International", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "3 Aug 2021", "job_title": "Anonymous Employee in London, England", "duration": "N/A", "pros": "Opportunity to work with a diverse group of staff and members around the world. Also, I am delighted to work for an organisation that contributes to sustainability.", "cons": "Limited opportunity to travel due to covid related restrictions and hopefully we will start traveling soon."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Toxic environment and an awful experience", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "24 Feb 2021", "job_title": "Anonymous Employee in London, England", "duration": "N/A", "pros": "I worked at IWA for a while and have been part of a small team, which has been an interesting experience. \r\n\r\nYou have to figure out solutions, ideas, and everything independently, other than causing you immense stress you gain experience\r\n\r\nThe junior staff are extremely approachable\r\n\r\nWork-life balance isn't hard to distinguish for me was a bit hectic, but learnt to put my foot down", "cons": "Where do I begin with the cons… There are far too many. \r\n\r\nNo, catch-up meetings to discuss progress, no review if you passed your probation period or not. I had to chase up HR several times to understand such a basic aspect of any employment. HR was also very a temporary thing, no true hr. Which is very strange. A Toxic Workplace Likely Has Rapid Employee Turnover, and this company has one of the highest one I've ever experienced. \r\n\r\nThere is unprofessional behavior from senior staff, particularly in my experience. As a professional often you can feel a little discriminated against due to experience, age, and particularly gender. Often experienced degrading comments, or talked down to. Often comparisons are made between you and others, which is immensely unprofessional.\r\n\r\nOften in junior positions, you can feel like a PA to your seniors made to do minuscule unrewarding tasks, simply because your “Boss” cannot be bothered or doesn't actually understand how to do some simple things. There is a sense of authority which is held by senior staff, which never quite sat well with me. There is no true growth in the role.\r\n\r\nKeeps you in the dark regarding a lot of important business information that can impact you as an employee. \r\n\r\nThere is no transparency between the management team and salary increase, when I joined I was told there will be a “review” after 6 months, regardless of how many times this was brought up by me, they aren’t interested in having any reviews. Salaries are below industry standards.\r\n\r\nIt’s difficult working with people who are extremely set in their ways. Collaboration is not an easy process when you are expected to do all the work around it and the seniors are just expected to get their way regarding an easier workload.\r\n\r\nMicro-management was a huge issue - expected to provide often daily updates of all tasks I had to do, and the breakdowns of them in a written format (how long exactly each task took in minutes and hours) if something takes longer due to a blocker on the item, then you are made to feel guilty, no matter what the issue is. However, not a two-way thing, only you are to provide updates, however no such updates from your \"boss\". If you ask about their schedule, or what they are doing it was taken very very defensively. When in a team you are supposed to communicate schedules, updates etc. \r\n\r\nA very toxic working environment in my team. No matter how positive you try to be, the situation is too toxic to overcome. A supposed charity has made the work environment so toxic, it's appalling. The senior employees do not receive criticism well, at all, which is ironic, because all you hear is criticism from them. \r\n\r\nDuring the initial lockdown, they favored those who went into the office. Regardless of the situation. If you didn’t due to health concerns, and just by following the governmental advice you were made to feel extremely guilty and like an awful, undedicated employee. Regardless of whether your goals were achievable remotely, you were guilt-tripped if you weren't desperate about going into the office. \r\n\r\nThe company doesn’t take much of an interest in the growth of its employees (there is no true “training” when you onboard either). \r\n\r\nLots of expectations from the employee to go above and beyond, without true recognition. \r\n\r\nDepending on the role, you are often expected to do overtime without truly getting your time back (most companies provide either overtime pay or the idea of taking time back, not the case here...) \r\n\r\nMessy Organisation Structure, no business continuity plan, no strategy. \r\n\r\nI blamed myself for feeling this way, but only have realised after reading the reviews wasn't just me. I wish I saw these reviews before accepting the job and jeopardizing my mental health and confidence."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 4, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Please do not ignore the reviews!", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "28 Feb 2020", "job_title": " in London, England", "duration": "N/A", "pros": "The travel - depending on the team you’re working with and my team members were great", "cons": "Where do I begin. \n\nI’ll start off by saying again, please listen to the reviews you are reading. I really wish I had, hindsight is a funny thing.\n\nA part of me would believe the good reviews were written by higher management but I don’t believe they care enough to so maybe by people who’ve never worked anywhere else.\n\nThere are many in the company who have been there for years and it was their first job out of university and it shows, those who have worked elsewhere don’t usually stay very long as they know better.\n\nThe company as a whole are not very transparent about salaries. They hire a lot of young people so they can underpay them. Not much room for progression as the older people at the top don’t leave. \n\nNothing is offered for growth or development. It’s a shambles really."}], []]