[[{"date": "5 Jun 2021", "title": "Distance Learning Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Riverside City College in May 2021", "Interview Descriptions": "committee interview consisting of about 5-6 staff/faculty. No one was interested or engaging with me through the interview it was more of a ask the questions and let’s get it over with to check the boxes. The questions were based on the skills of the position which I normally don’t mind but I study the job description and it was something completely different than advertised. One example is the software used for the position. I was also thrown into an assessment with the expectation of knowing the software when my resume clearly describes my certifications.", "Interview Questions": "What are the accessible issues that faculty encounter. "}, {"date": "9 Jan 2021", "title": "Admin Assistant II Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Riverside City College (Riverside, CA) in Dec 2020", "Interview Descriptions": "During COVID, so a pane of 5 interviewed me on Zoom.  Felt very impersonal.  When the candidates were told they didn’t make the cut to the 2nd interview, it was sent out as a group message.  Couldn’t believe the lack of confidentiality on HR’s part.  Everyone candidate’s email address showed up on my own message.  Including the “reply-to-all” responses!  Yikes!", "Interview Questions": "What is your definition of diversity and how has it effected you in the workplace?"}, {"date": "10 Feb 2022", "title": "Disability Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Riverside City College (Riverside, CA) in Dec 2020", "Interview Descriptions": "The interview process can sometimes be very competitive depending on the salary grade your going for. Some times the  panel can be biased and already have a person in mind.", "Interview Questions": "Please describe what makes you qualified for this position?"}, {"date": "18 Apr 2021", "title": "Instructional Department Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Riverside City College in Nov 2020", "Interview Descriptions": "Applied online through HR site, two months later received an email invitation to interview, selected date and time. The interview was conducted via zoom with six members on the interview committee; three assistant professors, one instructional department specialist, one employment placement coordinator, and one human resource generalist.", "Interview Questions": "Q: Have you worked with a diverse population of students and faculty/staff? \nQ: Situation student comes in your office, the phone is ringing, and you have a request from a department chair for a report. In order what do you take care of first. \nQ: Explain your process for a large data entry project? \nQ: Do you have any experience sending large communication out to students? \nQ: What do you know about our department? \nQ: What programs are you familiar with? \nQ: Why should we hire you? "}, {"date": "21 May 2018", "title": "Student Financial Services Outreach Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Riverside City College", "Interview Descriptions": "I applied online and received an email that included my interview date, time and location. I came in and the HR rep gave me a packet containing the panelists, job description and interview. Gave me some time to prepare answers", "Interview Questions": "Experience with financial aid"}, {"date": "5 Dec 2018", "title": "SGL Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Riverside City College (Riverside, CA) in Sept 2017", "Interview Descriptions": "1 hour interview with one of the bosses where they just ask you about leadership, and your academic traits and success. They also asked if you had any experience tutoring or anything related.", "Interview Questions": "Do you think anyone can be good at math? "}, {"date": "29 Oct 2017", "title": "Cafeteria Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Riverside City College (Riverside, CA) in Jul 2015", "Interview Descriptions": "I submitted an application and was called to confirm when my interview would be. I got an interview within a couple weeks and it was held in the cafeteria at the boss's room. It was during the summer, before fall semester began. Very friendly and easy interview.", "Interview Questions": "Tell me about yourself.\r\nDo you have any experience working with food?\r\nDo you have a food handler's card already?"}, {"date": "20 Sept 2017", "title": "Supplemental Instructional Leader Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Riverside City College (Riverside, CA) in Jan 2013", "Interview Descriptions": "I was asked to give a brief demo of how to conduct a study session. The group of interviewers pretended to be my students. I prepared a presentation on teaching some rules of Linear Algebra.", "Interview Questions": "Describe a method that can help students to memorize the rules of math."}, {"date": "14 Sept 2016", "title": "Anonymous Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Riverside City College (Riverside, CA) in Oct 2012", "Interview Descriptions": "It was a long process...from the initial application in September to the offer in December. The online application was quite involved, requiring letters of reference and transcripts. There were 3 total in-person interviews.", "Interview Questions": "What is your experience working with students and diverse populations?"}, {"date": "28 Jan 2016", "title": "Adjuct Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 2 days. I interviewed at Riverside City College (Riverside, CA) in Mar 2012", "Interview Descriptions": "very intense. nerve wracking; it was a panel interview and everyone gets a chance to ask uyou questions and it is situational and very hard at time that you have to constantly answer to the  questions that they ask.", "Interview Questions": "what is your perception of the school"}]]