[[{"date": "26 Apr 2023", "title": "Executive Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Singapore University of Social Sciences", "Interview Descriptions": "Quite well organised. HR sent details such as timing. I asked for Interviewer's name. Direct Supervisor and colleague who I will be working closely with interviewed me. They just asked question to find out whether I'll be a good fit for their department.", "Interview Questions": "How long you intend to work?"}, {"date": "30 Apr 2023", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Singapore University of Social Sciences (Singapore) in Mar 2023", "Interview Descriptions": "Don't be taken in by the interview. Done in a random manner. \nWas offered the following day. \nOn the eighth day of my job, I was told it didn't work out due to unsuitability. \n\nThey are wasting time due to their haphazard and poor hiring process. \n\nMOM/TAFEP was notified.", "Interview Questions": "Read my hiring and interview process review."}, {"date": "13 Mar 2022", "title": "Executive Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Singapore University of Social Sciences", "Interview Descriptions": "Well organised and rather fast\r\nAsked very direct questions\r\nFelt a little threatened/intimidated\r\nDon't feel the boss is friendly but don't know yet till actually work after some time\r\nCan be interviewed by a few persons at the same time\r\nBetter to ask what you want to know during the interview", "Interview Questions": "What are your job challenges"}, {"date": "1 Jun 2022", "title": "Lecturer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Singapore University of Social Sciences (Singapore) in Nov 2021", "Interview Descriptions": "It was a fairly easy process with a lot of help from the Hr department intern of scheduling. I was interviewed by the director of the Center. It was a 30 minutes interview, which is a rather rushed one", "Interview Questions": "Why did you choose this company"}, {"date": "13 Sept 2021", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Singapore University of Social Sciences (Singapore)", "Interview Descriptions": "Was phoned to schedule a Zoom interview, Zoom interview was planned with two lead researchers. We met on Zoom and they asked some questions. Unfortunately was not suitable due to my residence status", "Interview Questions": "I was asked to talk about previous research experience and how that relates to the current role. Also general get to know questions I'm getting to see whether I was a good fit culturally."}, {"date": "9 Apr 2023", "title": "Full-time Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Singapore University of Social Sciences in Apr 2021", "Interview Descriptions": "There are four stages for SUSS' interview process which include a response essay, an online cognitive test, a group discussion (usually 5-6 students involved in group discussion) and an individual interview. The whole interview process was done on Zoom.", "Interview Questions": "Q: Why did you choose SUSS?"}, {"date": "30 Mar 2021", "title": "HumanResources Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Singapore University of Social Sciences (Singapore) in Mar 2021", "Interview Descriptions": "4 stage interview process inclusive of\r\n- wonderlic test\r\n- written essay component \r\n- group interview\r\n- individual interview \r\n\r\n** note do put emphasise on group interview & written essay portion as there would be higher weightage", "Interview Questions": "What are you interested in joining this course"}, {"date": "22 Feb 2022", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Singapore University of Social Sciences in Feb 2021", "Interview Descriptions": "- Interviewed with 2 professors and 1 research associate.\r\n\r\n- After that, interviewed with the director with similar questions. Very friendly.\r\n\r\nAfter both interview, I received the job offer. However, there was some communication issues regarding the salary. Overall, relatively smooth.", "Interview Questions": "- They asked about my experiences and goals moving forward.\r\n- They asked what can I bring to the table in this role."}], [{"date": "6 Dec 2020", "title": "Business Development Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Singapore University of Social Sciences (Singapore) in Dec 2020", "Interview Descriptions": "The interview was setup for Institute of Adult Learning (Centre for Workplace Learning & Performance - CWLP)  and was generally went well until...\r\n\r\nHiring manager paying too much attention on candidate's knowledge about its initiatives and the organisation's scope of \"business\" in CWLP, much to the extent of like a close-book examination, rather than focusing on candidate's ability to develop new \"customers\" i.e. members for its initiative.   Isnt interview is best be conduct like a flow of business discussion to evaluate candidate credential ?\r\n\r\nHiring manager, coming from education domain, don't seem to be aligned with \"business-trained\" candidate's lingo, and kept correcting words coming from my mouth\r\n\r\nIn addition, via the HR to do the forwarding to hiring manager, I have took great pain to craft some of my past work samples for hiring manager to evaluate my foundation for the role but she claimed she didnt receive anything.  She replied reviewing my resume is good enough, obviously standing at HR side.  Before interview, HR claimed he had forwarded them already.  Time spent has been completely wasted !   Disappointed with HR too!", "Interview Questions": "Do you know what is CWLP?  (better dont google when ask)"}, {"date": "14 Dec 2020", "title": "Senior Executive/Assistant Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Singapore University of Social Sciences (Singapore) in Dec 2020", "Interview Descriptions": "One interview with the department and one interview with the prof. The department head expected the candidate to  elaborate everyone about him or her all within that one question - tell me about yourself.", "Interview Questions": "Tell me about yourself. "}, {"date": "8 Jul 2023", "title": "Executive Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Singapore University of Social Sciences (Clementi New Town, ) in Dec 2020", "Interview Descriptions": "The panel comprised a director, 2 staff and one HR Business Partner. It lasted for about 20 minutes. One of them asked if I have experience in crunching numbers. The role was heavily based on statistics.", "Interview Questions": "Why did you leave your last job?"}, {"date": "14 Aug 2020", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Singapore University of Social Sciences (Singapore) in Apr 2020", "Interview Descriptions": "Two interview stages - one was in person, the other was over Zoom video.  The first round was with the hiring manager and section director, the other one was with the section director and his reporting officer. It was held quite close together - almost a week in between, which was great!", "Interview Questions": "To describe and elaborate on my previous work experience and share more on the case study that I was tasked to prepare and present on."}, {"date": "21 Aug 2019", "title": "Lecturer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Singapore University of Social Sciences", "Interview Descriptions": "I was asked to craft and present a short talk on my area of expertise, and subsequently answered questions from the interviewers. I was also given the chance to pose questions of my own about the university structure.", "Interview Questions": "My experience in adult learning"}, {"date": "15 Aug 2019", "title": "Executive Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Singapore University of Social Sciences (Singapore) in Aug 2019", "Interview Descriptions": "Interview process is fairly fast. However, HR staff might not be competent as one my original certificates went missing after verification by HR. Had to come back to SUSS HR on another day just to collect my missing cert. Interviewed by Vice Dean, a department staff and a HR Staff. Had to do a written assessment before the interview.", "Interview Questions": "Tell me about yourself."}, {"date": "15 May 2019", "title": "Executive Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Singapore University of Social Sciences", "Interview Descriptions": "On the day of the interview, there was a 30 minutes written test. Afterwhich, there was a panel of 5 interviewers, including a HR senior officer, Dean, Vice-dean and 2 managers.", "Interview Questions": "Why are you interested in this position?  "}, {"date": "16 Apr 2019", "title": "Associate Lecturer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Singapore University of Social Sciences", "Interview Descriptions": "Casual. It was a conversation between fellow academics, sharing on the experiences of teaching and also discussing working conditions in the university. There was also a discussion on the teaching policy.", "Interview Questions": "Have you taught elsewhere before?"}, {"date": "19 Jun 2019", "title": "Officer Interview Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Singapore University of Social Sciences (Singapore) in Mar 2019", "Interview Descriptions": "The whole process took about 1 hour. 30 minutes writing test (Replying to a complaint e-mail of a student) and 30 minutes of a face-to-face interview. Had an interview with the HR Manager and the in-charge. They were nice, very professional. They asked about my previous job experience and talked about a difficult situation I faced. \r\n\r\nThe job description mentioned that it was a Monday - Friday job, and I only found out that the job requires shift work and weekends as well.", "Interview Questions": "What are your strengths and weaknesses?"}, {"date": "11 Jul 2017", "title": "Officer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Singapore University of Social Sciences", "Interview Descriptions": "Received a call from HR to have the interview within 3 days,  after I had applied the position online. The interview consists of a half and hour written test (replying to a complaint email from a student) and face to face interview. Whole process took about one hour. \nInterviewed by 2 department managers and probably 1 HR manager. Although questions was threw to me continuously but it was not those type of difficult questions.", "Interview Questions": "What's your weaknesses"}], [{"date": "12 Aug 2017", "title": "Systems Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Singapore University of Social Sciences in Mar 2017", "Interview Descriptions": "The interview Started with 30 mins writing test, followed by  face to face interview by 2 interviewers from IT and 1 HR person. HR checked all the certificates and explain what benefits they have.", "Interview Questions": "Intro yourself"}, {"date": "1 Aug 2016", "title": "Lecturer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Singapore University of Social Sciences", "Interview Descriptions": "Two rounds of interviews. There will be a pre job talk interview with senior management and the head of department. After going through the first round of interview, there will be another session scheduled for presentation. Interviewee has the autonomy to choose the topic of presentation. Presentation is open to all faculty members of the university. Through the presentation and interaction with faculty members, the recruitment committee will decide if the candidate is suitable for the opening.", "Interview Questions": "Methodology"}, {"date": "26 Sept 2017", "title": "Executive Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Singapore University of Social Sciences (Singapore) in Aug 2015", "Interview Descriptions": "First, there was a 30 minutes written test on a complain letter from student, then followed by an interview with a HR senior officer and 2 managers. \r\nThe whole experience was very unpleasant as they keep probing into my personal life, rather than focusing on questions related to the position or the company. They would also want to look through all the academic results from university all the way to secondary school.", "Interview Questions": "What do you know about UniSIM?"}, {"date": "17 Aug 2015", "title": "Executive Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Singapore University of Social Sciences (Singapore) in Aug 2015", "Interview Descriptions": "The HR officer called and asked if I was all right to take a pay cut. A week later, she called to arrange a time for an interview. On the day of the interview, I had to write an essay. Afterwhich, there was a panel of 4 interviewers.", "Interview Questions": "Q: Why did you apply for this job?\r\nQ: What is your dream job?"}, {"date": "28 Sept 2017", "title": "Student Recruitment Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 1 week. I interviewed at Singapore University of Social Sciences in Aug 2014", "Interview Descriptions": "Had a panel of 3 persons involved in interview. Direct superior, director and hr. Interview process tested your knowledge about the company, getting to understand your past experiences and a test in your written communication skills.", "Interview Questions": "What is the difference between UniSIM (previous name of SUSS ) and SIM Global Education?"}, {"date": "13 Jun 2015", "title": "Associate Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Singapore University of Social Sciences (Singapore) in Feb 2014", "Interview Descriptions": "The interview process was very quick and easy.  However, I did email the department head directly to ask about my application and that is why the interview was scheduled so quickly.  I met the department head, answered her questions about my academic, teaching and research background and then did a 5 minute mock lesson (I was told in advance about this) using PowerPoint.   It was kind of assumed after that, that I'd be hired to teach one course for the upcoming semester.", "Interview Questions": "What kind of teaching experience do you have?"}, {"date": "24 Jul 2013", "title": "Accountant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 3 weeks. I interviewed at Singapore University of Social Sciences in Jun 2013", "Interview Descriptions": "Meet up HR and Hiring Manager on first round on job scope review and 2nd interview by the directors.", "Interview Questions": "N/A"}, {"date": "30 Jan 2013", "title": "Officer Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Singapore University of Social Sciences", "Interview Descriptions": "I was interviewed by  the Manager and the HR Manager and it is a pleasant experience through the interview. The whole interview was pleasant and professional. Neither of the personnel tried to undermine and put you down like other corporates that I had encountered.", "Interview Questions": "N/A"}, {"date": "25 Jan 2011", "title": "Executive Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Singapore University of Social Sciences (Singapore) in Jun 2009", "Interview Descriptions": "The interview began with a meeting with the Provost and Dean at the university. After formal introductions, I was asked about my educational background and technical skills that I can offer to the job. Some informal chatting ensued. I asked questions about what the position is about and they shared with me who I will be working with and what I can expect. They also mentioned that their expectations were high as the position was to spearhead a new project that the university was embarking on. I then joined the Dean for tea and a one-on-one interview where she asked me what my strengths and weaknesses are and if there was anything else I would like to know about the position.", "Interview Questions": "Do you have any questions about what the position is about?"}]]