[[{"date": "5 Nov 2021", "title": "Academic Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 4 days. I interviewed at University of Central Missouri in Jun 2021", "Interview Descriptions": "Very great interview. Everyone is so nice and welcoming. The interview process was great and they asked very good questions. So happy to be working at UCM. It really feels like home and my coworkers and supervisors are all so nice and understanding.", "Interview Questions": "Name a time you handled a situation with a student. "}, {"date": "24 Feb 2022", "title": "Community Advsior Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Central Missouri in Apr 2021", "Interview Descriptions": "Very simple and easy process. It was required to get a recommendation from a previous dorm advisor but that was easy if you lived in dorms already. Had to apply online and if they liked your qualifications, they'd ask you in for an interview.", "Interview Questions": "Why do you want to be a community advisor? "}, {"date": "15 Feb 2021", "title": "Custodian Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of Central Missouri", "Interview Descriptions": "Ask questions about why you want the job, what qualities you have that would be good for the job.  They asked if you were self-motivated and could work without supervision. Interview lasted about 10 minutes", "Interview Questions": "Are you a self-motivated person. How so?"}, {"date": "30 Jan 2021", "title": "Office Professional Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Central Missouri", "Interview Descriptions": "I had a phone interview with the person with whom I would directly report. I had an in person face to face interview with the team that I would work with.", "Interview Questions": "Personality questions. Prioritization questions. Basic experience with accounting and use of word processing, excel and calendaring. Knowledge of procurement processes. "}, {"date": "9 Mar 2022", "title": "Front Desk Receptionist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at University of Central Missouri (Warrensburg, MO) in Aug 2019", "Interview Descriptions": "Paper copy with personal questions interview about handling situations. Met with the dean of harmon college business and professional studies along with associate dean and administrative assistant and faculty members.", "Interview Questions": "How would you handle a difficult situation? "}, {"date": "15 Oct 2019", "title": "Student Office Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at University of Central Missouri (Warrensburg, MO) in Jun 2019", "Interview Descriptions": "Small room with 4 people asking me questions. Very relaxed environment, easy to communicate. Asked a lot of different questions but most were common questions that took no preparation to answer.  Completed a typing test afterwards. Followed up with a job offer on the same day as interview.", "Interview Questions": "What is your best attribute?"}, {"date": "29 Sept 2018", "title": "Graduate Student Worker Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 5 days. I interviewed at University of Central Missouri", "Interview Descriptions": "It was a brief process. It takes recommendation from existing student workers to get you selected for the interview process, the overall process if fair. But it doesn't hurt to have good recommendations from existing student workers.", "Interview Questions": "Why do you want to work as a student worker?"}, {"date": "8 Apr 2019", "title": "Campus Events Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 days. I interviewed at University of Central Missouri in Jan 2018", "Interview Descriptions": "Multiple staff interview, they care more about character than experience. Ethics based questions, along with resume review. Low stress interview, will not grill you with questions, more of a conversation.", "Interview Questions": "Describe a situation where you were facing a problem, and how did you handle that situation?"}, {"date": "29 Dec 2017", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Central Missouri", "Interview Descriptions": "The interview was conducted in a friendly environment. It depends upon the department in which you are applying. Generally, the employer asks questions about strengths and weaknesses, background, short and long term goals, motivations for the job, etc.", "Interview Questions": "Describe your short and long-term goals"}, {"date": "25 Sept 2017", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of Central Missouri", "Interview Descriptions": "Just basic questions about experience and profile. And getting to know the candidate. Is the degree you're studying going to help with the daily job functions. The interviewer also asks if the candidate is able to come when called upon to help.", "Interview Questions": "How did you find the job?"}], [{"date": "5 Mar 2021", "title": "Web Developer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of Central Missouri (Warrensburg, MO) in Apr 2017", "Interview Descriptions": "The whole process was very easy. A couple of coding challenges and then some talk about interests and then about what it would be like to work there. Then walk around for meet and greet.", "Interview Questions": "Fizz Buzz coding question, very basic"}, {"date": "20 Feb 2017", "title": "Associate Marketing Director Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of Central Missouri (Warrensburg, MO) in Jan 2017", "Interview Descriptions": "The Director called me personally to schedule a phone interview. I really enjoyed speaking to her and think the department as a whole is doing a great job from what I've heard and seen. Then I interviewed with her and 3 other members from the department. Mostly questions based on knowledge of the function of this role, as it pertained to higher education, nothing out of the ordinary or unexpected. \r\n\r\nWhere it got interesting was that one of the members mentioned her experience with UCM as \"humbling\", which made it sound as if she wasn't particularly enjoying it and that they were back filling the position, due to the exit of the previous person in this position. I didn't get the role at the end of the day but it worked out both ways, as I ended up in a similar role at a top tier national institution. I was really appreciative of the interview opportunity, as it likely helped me better my next interview, and wish UCM the best.", "Interview Questions": "Several questions about marketing theory and utilizing of social media in a higher educational front."}, {"date": "6 Sept 2016", "title": "TRIO Academic Coach Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at University of Central Missouri (Warrensburg, MO) in Aug 2015", "Interview Descriptions": "I submitted a resume and cover letter online through the UCM student jobs page. I followed up with the person in charge of hiring and set up an interview. The interview was really relaxed. She just wanted to get to know me to see what I was about. I talked about my previous tutoring experience and my passion for helping students succeed. She immediately offered me the position at the end of the interview.", "Interview Questions": "Why are you passionate about tutoring? "}, {"date": "25 Dec 2016", "title": "Student Woker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at University of Central Missouri (Warrensburg, MO) in Mar 2015", "Interview Descriptions": "small interview not so tough and anyone can crack it because they ask about work ethics etc and they mainly concentrate on what do you know about the work. they expect basic answers and truthful answers.", "Interview Questions": "how to do you overcome constructive criticism?  "}, {"date": "15 May 2018", "title": "Office Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 5 days. I interviewed at University of Central Missouri (Warrensburg, MO) in May 2014", "Interview Descriptions": "It was brief, it was with a panel of three full time staff members in the office. It was very informal and pretty easy going Interview. The campus is very pretty and they are proud of that and at the end of the interview gave a tour, so it was a real pleasant experience.", "Interview Questions": "How well do you handle high stress situations? "}, {"date": "24 Mar 2014", "title": "Caller Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at University of Central Missouri", "Interview Descriptions": "You fill out an application on-line at the Mules for Hire website. You are then emailed about setting up a time for an interview. You will either interview with the Graduate Assistant or the Director of Annual Giving. If you are offered a position, you will contacted within a couple of days by email.", "Interview Questions": "They are no difficult or unexpected questions. It is a typical job interview. "}, {"date": "28 Oct 2015", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at University of Central Missouri (Warrensburg, MO) in Dec 2013", "Interview Descriptions": "Was just a face-face interview, with about 4 people on the panel. Mostly experienced based. Would look out for communication and inter personal skills. General questions, behavioral based. Good experience, easy going.", "Interview Questions": "My experience and background"}, {"date": "28 Oct 2014", "title": "Teaching Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at University of Central Missouri in Sept 2013", "Interview Descriptions": "My hiring process was very simple. The professor that I worked for had had me in several classes and knew that I was intelligent and a hard worker so she simply asked me if I would like to be her TA.", "Interview Questions": "N/A"}, {"date": "20 Jul 2017", "title": "Office Professional Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Central Missouri (Warrensburg, MO) in Jun 2013", "Interview Descriptions": "I met with the Department Head, and a few of his staff. They asked me questions regarding my work experience, and office computer programs. I was then asked in turn to ask any questions regarding the job position.", "Interview Questions": "Why did I want to work in their Department?"}, {"date": "13 Mar 2016", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at University of Central Missouri (Warrensburg, MO) in Mar 2013", "Interview Descriptions": "Received an email. Replied with the times available for an interview. Got an interview date scheduled. Came in for the interview, and got a job offer afterwards. Scheduled a date to come in for training. Training was extremely easy. Got my work schedule. Worked one week of buyback, then was offered a full-time student position.", "Interview Questions": "Do you have any cashiering experience?"}], [{"date": "10 Oct 2013", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at University of Central Missouri in Nov 2011", "Interview Descriptions": "Very professional. I felt comfortable and confident. Questions were straight to the point.", "Interview Questions": "What does it mean to you to be proactive?"}, {"date": "22 Aug 2013", "title": "Custodial Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Central Missouri (Warrensburg, MO) in Dec 2009", "Interview Descriptions": "Applied online, got a call two weeks later. Basic 2:1 interview with Supervisor and foreperson.", "Interview Questions": "None, all questions where basic questions about my experience and skills."}, {"date": "20 Nov 2013", "title": "Server Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at University of Central Missouri in Sept 2009", "Interview Descriptions": "It was not hard and they only needed me to have a willing-to-learn attitude. Made an application and of course they called me back pretty soon. Was well trained quickly and started the work force. I would work 3 hours at times and others all day during things like weddings. Got to do a few concession stands during the mules games too.", "Interview Questions": "N/A"}]]