[[{"date": "26 Nov 2022", "title": "Project Coordinator Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Colgate University", "Interview Descriptions": "The interview was good it was positive everything started on time. The interviewer asked a lot of questions about my interest and was excited to hear and I was happy to share my skill sets with them", "Interview Questions": "What are your strengths and weakness"}, {"date": "1 Nov 2022", "title": "Alumni Relations Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Colgate University", "Interview Descriptions": "Multi-stage process beginning with a phone/video screen with search committee. Fairly standard thirty minute interview that included some small talk, behavioral interview questions, and left time for Q&A at the end.", "Interview Questions": "Describe how you have approach to relationship development with a new client or team member."}, {"date": "6 Feb 2023", "title": "Assistant Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "The process took 5 months. I interviewed at Colgate University (Hamilton, NY) in Aug 2022", "Interview Descriptions": "Fairly simple 30 minute introduction interview in front of a five person panel. The members of the panel were very pleasant and answered all of my questions. After the interview, I was told that I would hear something within two weeks. Two weeks turned into five months, when I finally received an email that I had not been selected for the position. If they were still considering me for the position for all of this time, it would have been nice to know that. Conversely, if I was not what they were looking for after this initial interview they should have said something then. I just feel like the communication could have been better.", "Interview Questions": "Why Colgate? What is your experience?"}, {"date": "14 May 2022", "title": "Student Life Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 months. I interviewed at Colgate University", "Interview Descriptions": "It was good . People were friendly. They had a phone interview and then an in person interview. I felt very welcomed and could be honest and open with them. However, they never followed up and so I can only assume they’ve accepted someone else & i wasn’t worth a rejection email. Okay", "Interview Questions": "Why colgate?\r\nWhy now?\r\nWhat experience do you  bring?\r\nFive year plan?"}, {"date": "13 Nov 2021", "title": "Assistant Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Colgate University", "Interview Descriptions": "The interview has a few different phases, from an initial screening interview, to potential middle stages interview, and finally a full day with several rounds of interviews with different campus partner. Everyone at Colgate is often friendly, and many of their questions will get you thinking about how you can implement new ideas on campus for your role. Given that you can go through a day meeting with a number of interviews (four is probably a safe bet), do everything to bring your A-game for the multiple rounds.", "Interview Questions": "What programs would I create to reach out to students and educate them on the offerings of our department?"}, {"date": "7 May 2021", "title": "Assistant Professor of Economics Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Colgate University", "Interview Descriptions": "The interview was very well organized. The interviewers were very professional, very knowledgeable, and very polite. They asked questions about my current research works and future research agenda. They also asked questions about the courses I have taught.", "Interview Questions": "Tell us about your current research. "}, {"date": "10 Mar 2021", "title": "Admission Ambassador Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Colgate University", "Interview Descriptions": "It was really enjoyable. The interviewer was a nice and easy guy to talk with. I was really relaxed talking to him. He didn't ask many followup questions but he will keep nodding and giving in-time feedback so that you know where to lead to conversation", "Interview Questions": "What was something you are proud of?"}, {"date": "26 Feb 2021", "title": "Assistant Director of Employer Relations Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Colgate University", "Interview Descriptions": "Got a email from the hiring manager. Accepted to go to final round of interviews. Had two 1-1 interviews with hiring manager. 3 separate panels of departments of the career center and other administrators. Hiring manager said they would get back to me in a couple days, fast forward a week, did not hear from them. Wrote an apology email after one week and heard that selected someone else for the role.", "Interview Questions": "Why Colgate?\r\nWhy Employer Relations?\r\nIf you could describe yourself in one word, what would it be?"}, {"date": "17 Jan 2020", "title": "IT ASSISTANT Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Colgate University", "Interview Descriptions": "I connected with the supervisor through a related class I was taking and spoke to him about wanting the position. It was a part time position since I was a student. He spoke to a professor he knew at the time and I was able to start soon after submitting paperwork.", "Interview Questions": "Why are you interested in this position?"}, {"date": "18 Sept 2019", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Colgate University", "Interview Descriptions": "The interview is super chill and the professor is very helpful. They genuinely want to get to know you. There's only one interview in person and the essay you wrote", "Interview Questions": "Why do you want the position? "}], [{"date": "14 Jun 2017", "title": "Visiting Assistant Professor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Colgate University (Hamilton, NY) in May 2017", "Interview Descriptions": "Submitted the application materials online.  In about a week, I received an email requesting a phone interview.  A couple of days later, I got another email inviting me to the campus. The campus interview was scheduled on two weeks  from that day (later, it turned out that I was the last  who visited the campus). \r\n\r\nHad a dinner with two faculty the day I flew in.  The next day, I met with a few people, did a teaching demonstration at 3pm, and an interview with the search committee at 4pm.  The long day finally ended at 5pm. \r\n\r\nBefore I left, I was told that the decision would be made in a week.  However, I didn't hear anything until 3 weeks later. Got the email saying that the job was offered and accepted by another candidate.", "Interview Questions": "How would your students describe you?"}, {"date": "5 Sept 2016", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Colgate University", "Interview Descriptions": "Quick phone call to see if you are still interested giving you salary information, then a phone interview with department heads. If you are selected you then have a campus interview about 1 week later. Great interview, then found out they called my references. Never heard anything till 2 weeks later through email, thanks, but no thanks.\r\nFound out I was going to be offered the job but then, they hired an admin assistant from another department who decided to transfer at last minute. \r\nThe process takes a long time. You apply on line and it can take weeks before you hear anything. Your application status remains\" under review by committee\" for a long time.", "Interview Questions": "How would you change things to run more smoothly"}, {"date": "5 Aug 2016", "title": "Assistant Dean of Admission Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Colgate University in May 2016", "Interview Descriptions": "Very thorough interview process. As with many areas of education, the interview process involved meeting with and interviewing with multiple individuals from not only the admission department, but from other departments as well (including Athletics, Human Resources, Diversity & Inclusion, etc.). The interviewers from within the Admission Department were quite welcoming and warm, and made my visit to campus a treat.", "Interview Questions": "Touched on all aspects of my resume, very thorough."}, {"date": "17 Nov 2015", "title": "Assistant Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Colgate University (Hamilton, NY) in Nov 2015", "Interview Descriptions": "There are two talks, teaching and research. You meet with all the faculty members and talk to different deans. The process was joyful but also long. They are very thoughtful and will organize everything extremely well. Prepare the two talks really well.", "Interview Questions": "Why do you consider Colgate University?"}, {"date": "20 Jul 2015", "title": "Program Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Colgate University", "Interview Descriptions": "I first received a call to schedule the interview with the search committee. It was about 30min and it was a phone interview. The committee members took turns to ask questions, and they left few minutes for me to ask questions as well. All members sounded nice. The downside is that they did not follow up about anything after the interview.", "Interview Questions": "Why Colgate?"}, {"date": "30 Jul 2015", "title": "Marketing Strategist/Graphic Designer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 2 months. I interviewed at Colgate University in Jun 2015", "Interview Descriptions": "Applied through an agency designed to help disabled individuals find employment. The application did not allow me to self identify as disabled but did allow me to say where I found the job posting; which indicates whoever reviewed my application was aware of my disability. Nowhere in the hiring process did they ask about if I needed any accommodations, in fairness their website does indicate that you may ask for accommodations however this is not applicable as I did not apply through their website directly.\r\n\r\nI was contacted by someone in human resources about a week after applying to ask for a word document describing my work experience. Despite already turning in a resume with my work experience listed under two bold headers of \"EMPLOYMENT\" and \"EXPERIENCE\" I followed through and sent a more expanded explanation in a word document.\r\n\r\nAnother week passes, I get a phone call from the same person in human resources asking me how much of a salary I would be willing to take. They explain that they want me to agree to a salary before going through the process any further because, \"they don't want to waste to much time.\" I ask about what the benefits are for this position before I agree on a salary, they tell me to look on their website and that if I want to be a candidate for this position I have to make a decision by tomorrow. As I explained already, I had never been on Colgate's employment website as I applied through an agency. So I was not able to find a link to the benefits for this position and had to send an e-mail asking for a direct link. I received a response the next day with a direct link but felt extremely rushed into making a decision. \r\n\r\nApproximately one week later I get a phone call from the manager for this position. They inform me that they would like to schedule a one-on-one phone interview next week; I schedule an interview. When I receive the call I am immediately intimidated by the fact that four people are on the phone line. Normally I would have asked for an accommodation to handle a situation like this due to my disability at the very least a warning that it was going to be more than one person would have helped me immensely, particularly since I clarified it was going to be a conversation with one person.\r\n\r\nI was already intimidated by the interview due to the mix up involving how many people would be on the line. However the answer to the first question they asked me made me even more intimidated. They asked me, \"Why are interested in working at Colgate University and academia in general?\" As I said already, I am disabled and looking for an employer willing to understand the difficulties of this situation. So my attempt at acknowledging this without directly saying that was, \"When I apply to an institution, I try to find somewhere that has values similar to my own. I was looking at Colgate's mission statement and particularly enjoyed your commitment to inclusiveness and diversity.\" The response to this was, \"You do realize that this is a job at the bookstore and not the university?\" This shocked me. In essence they revealed to me that the bookstore does not have the same values as the university.\r\n\r\nAs for the rest of interview, it was difficult to hear the interviewers on the speaker phone at times. I'm not sure why they didn't have individual phones on a conference call or at the very least sit in close proximity to the phone they were speaking into. Most of the questions were aimed at business experience, which I did not have much of as my resume, education, and work experience already indicated. Strangely the job posting didn't even mention this was what they were looking for and had far more of an emphasis on the graphic art/design side.\r\n\r\nAfter the interview I did not hear back from them for another month. I received a generic response from a generic HR e-mail telling me I was no longer in consideration. At the very least I would have liked to have heard back from the same person I spoke with in HR for the duration of two months.", "Interview Questions": "Why are interested in working at Colgate University and academia in general?"}, {"date": "12 Jun 2017", "title": "Senior Textbook Buyer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Colgate University (Hamilton, NY) in Jan 2015", "Interview Descriptions": "It was very general, not at all difficult or unexpected. It was quite easy, like going off of a list of questions. There were only a few difficult questions.", "Interview Questions": "Experience with POS "}, {"date": "1 Oct 2014", "title": "Community Leader/Resident Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 3 weeks. I interviewed at Colgate University", "Interview Descriptions": "Interview process involves a standard application, a reference letter from your current RA, and asks for you to list the names of some professors you can use as a reference. The interview is not hard but can end up being long (about 1 hour). Standard behavioral question which ask you about why you want to be a CL/RA, leadership experiences, teamwork experiences etcetera. Other questions involve situations you might have to deal with as an RA and how you will approach them.", "Interview Questions": "How would you respond if you saw a friend breaking university policies?"}, {"date": "15 Oct 2015", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Colgate University (Hamilton, NY) in Apr 2014", "Interview Descriptions": "Basically, you have to get to know the professor(s) that you want to work for beforehand. Most of the time you have probably worked for them, but it is possible to get summer position under professors that you have never worked for with a good reference and sometimes previous research.", "Interview Questions": "For me, I was asked basic python data structures."}, {"date": "16 Mar 2017", "title": "Program Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Colgate University (Hamilton Center, NY) in Mar 2014", "Interview Descriptions": "It's a full day interview with various people who attend or work at the university. They will usually start off with a breakfast meet up with you and the head of the search committee. Then you'll go through the first round of interviews with staff. Then a short break, and maybe a tour (pay close attention to the tour). Then you have a group interview with another department. Then usually the last interview with a group of students.", "Interview Questions": "What is a common misconception people have of you, and how have you worked through that? "}], [{"date": "21 Nov 2013", "title": "Community Leader Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Colgate University (Hamilton, NY) in Mar 2013", "Interview Descriptions": "Submit a form indicating why you want the job, and whether you are in good academic standing. The interview itself was 7 panels with 3 people on each panel asking different  questions.", "Interview Questions": "What do you anticipate to be the most difficult decision you will have to make as a community leader"}, {"date": "7 Oct 2012", "title": "Part Time RA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 2 days. I interviewed at Colgate University (Hamilton, NY) in Aug 2012", "Interview Descriptions": "There is no interview process- you just have to know professors who are doing research and then take it from there. Just get in a professor's good books and prove yourself reliable so that when he or she needs to ask someone to do extra grunt work for research, you will be the first one he or she thinks of", "Interview Questions": "Like I said, there were no interviews"}]]