[[{"date": "13 Jun 2023", "title": "Adjunct Faculty Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Prince George's Community College (Largo, MD) in Feb 2023", "Interview Descriptions": "Interview entails a panel interview of colleagues with a lecture presentation on an assigned subject matter. The timeframe between 1st and 2nd round interviews moves slowly as there was almost a month between 1st round interviews and second round interviews.", "Interview Questions": "How would you deal with a student that was upset about something you did that they deemed unfair?"}, {"date": "22 May 2022", "title": "Admissions Recruiter Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 3 days. I interviewed at Prince George's Community College (Largo, MD)", "Interview Descriptions": "Internal applicant; I received  a stipend to complete the job for about a year before the interview.  \r\n\r\nI was interviewed (team panel) and the day after was told they decided to go outside to fill the position.  They also attempted to pressure me to train the new person; I advised the VP of the unfair hiring practices.  The VP offer me the job and I declined due to feeling blindsided by the team; I quit shortly after that.", "Interview Questions": "They asked general questions about admissions and recruitment. "}, {"date": "28 Apr 2022", "title": "Program Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Prince George's Community College (Largo, MD) in Feb 2022", "Interview Descriptions": "Interview was standard and conducted via Zoom with potential direct supervisor and her colleague. INterview questions were specific to role and experience with students. I wasn't offered the job and can honestly say that I didn't do well in the interview, but I also didn't receive any follow up communication after. Still haven't and it's been two months.", "Interview Questions": "-how do I relate to this generation of students?\n-what technology have I used in advising \n-how would I go about getting students invested via virtual learning"}, {"date": "25 Aug 2021", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Prince George's Community College", "Interview Descriptions": "Filled out an application. Turned in my resume during the interview. Received phone call with available buildings and locations. Selected from list. Began working. Fingerprints and background check was completed.", "Interview Questions": "How would you handle _____ situation?"}, {"date": "16 Jun 2021", "title": "Professor Of English Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. I interviewed at Prince George's Community College (Upper Marlboro, MD) in Apr 2020", "Interview Descriptions": "Staff was polite and patient. Made me feel comfortable. Challenging questions about teaching skill and behavioral questions. Had to teach in front of the panel which was a bit nerve-wracking. Overall I felt good about the experience.", "Interview Questions": "How would you deal with a difficult student?"}, {"date": "6 Jan 2023", "title": "Administrative Budget Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Prince George's Community College (Largo, MD) in Mar 2019", "Interview Descriptions": "Well thought out and easy process. One over the phone interview and two in person interviews with a panel of 4 employees within the department. Open communication through email, to keep me inform with the process and where I was in the process.", "Interview Questions": "Where do you see yourself in 5 years."}, {"date": "23 Oct 2018", "title": "Graphic Designer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Prince George's Community College in Oct 2018", "Interview Descriptions": "Very informal, through Google Hangout, it was typical to scam formats. I'll report back on the result of the situation. I doubt the actual college is a scam, but someone might be using their name. *unconfirmed  \r\n\"Does your bank allows you to make a cheque Deposit Via ATM to avoid you standing in line and to Enable the Company to Confirm the Deposit through the Deposit receipt?\"", "Interview Questions": "Let’s say you’re designing a new logo for our school . What would it look like?"}, {"date": "16 Feb 2018", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 months. I interviewed at Prince George's Community College", "Interview Descriptions": "I was asked to produce a lesson plan and then deliver a full lesson to a group of current faculty members and administrators.  I was also asked some standard questions about my experience and how I would handle being in a racially/ ethnically diverse classroom setting.", "Interview Questions": "What is your teaching pedagogy? How comfortable are you with teaching racially diverse students?"}, {"date": "11 Sept 2019", "title": "Adjunct Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Prince George's Community College (Hyattsville, MD) in Jan 2018", "Interview Descriptions": "There was first a screening call then a an interview with 2 staffs and 10 minutes teaching with lesson plan demo was asked . If i remember correctly, the interview was done in actual class room.", "Interview Questions": "How do you deal with students who may work 2 jobs and may be so tired when they come to your class ?"}, {"date": "10 Oct 2019", "title": "Sales Associate/Cashier Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Prince George's Community College (Largo, MD) in Sept 2017", "Interview Descriptions": "Interview process was very short, it was entirely based on need and a first come, first serve basis for students who needed extra pocket money. Be prepared to know what you're plans are long term or short term. It's no pressure, but don't seem lazy and unmotivated. It will be a turn off regardless.", "Interview Questions": "What are your goals if you are a student? "}], [{"date": "4 Apr 2017", "title": "Recruitment Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Prince George's Community College in Mar 2017", "Interview Descriptions": "Email saying I got a phone interview. Then a quick 20-30 minute phone Interview which I thought went sort of well, and the woman interviewing me sounded like she was willing to give me an in person interview. After the phone interview she told me that she thought I was a strong candidate and should hear back in a few days. Never heard back after 1.5 weeks.", "Interview Questions": "Describe your recruitment process for the company you currently work for?"}, {"date": "5 May 2016", "title": "Adjunct Faculty Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Prince George's Community College (Largo, MD) in Feb 2015", "Interview Descriptions": "I was contacted by email and was told I was recommended by a mutual colleague. Was asked if I was interested in teaching a course. It was very last-minute and subject to approval almost after the fact. Contacted by phone to discuss the particulars and the textbook. Really seemed like they were just looking for a warm body.", "Interview Questions": "Are you interested in teaching a course?"}, {"date": "19 Dec 2017", "title": "Recruiter Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Prince George's Community College (Largo, MD) in Jan 2015", "Interview Descriptions": "There is always a panel interview.  Generally, the panel has already pre-selected who they'd like to hire.  The \"panel interview\" is just for human resources purposes.  They ask about 10 - 12 questions and then you can ask questions of the panel.", "Interview Questions": "Why do you want the position?"}, {"date": "26 Nov 2018", "title": "Recruiting Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Prince George's Community College (Largo, MD) in Dec 2014", "Interview Descriptions": "No matter what was said in my interview, the panel had already made up their minds that I would not be considered for second round interviews.  It didn’t matter that I was an internal candidate, had more educational background than anyone that I interviewed and had been doing the job for a year.   Horrible management & leadership robbed me of an opportunity to grown with the school.", "Interview Questions": "A time where you felt challenged. "}, {"date": "27 Mar 2016", "title": "Reader/Scribe Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Prince George's Community College (Largo, MD) in Sept 2014", "Interview Descriptions": "It was super quick and easy. I applied, came in for an interview and got the job on the spot. I initially worked there as a volunteer so my foot was already in the door. That's how I'd recommend getting the job anyways. Volunteer first and then you'll be hired eventually if you want to be.", "Interview Questions": "What classes have you taken so far at PGCC?"}, {"date": "8 May 2018", "title": "Work At Home Telephone Customer Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Prince George's Community College (Largo, MD) in Jun 2014", "Interview Descriptions": "The interview is very appropriate for screening and weeding.  Employers try to complete the necessary intake to make a good and prosperous fit for the company for positive outcomes.", "Interview Questions": "What and how to handle sexual harassment by a co-worker?"}, {"date": "22 Aug 2017", "title": "ESL Teacher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. I interviewed at Prince George's Community College (Hyattsville, MD) in Jun 2013", "Interview Descriptions": "The review was very professional. I was asked about teaching experience, how I would handle certain situations, and a description was given of the job duties and time required.  I was told about the registration process, the extremely high number of students who would show up for registration, and the inability of the University, due to lack of funding for the requisite number of teachers, to service all who appear to register.", "Interview Questions": "Have you worked with students, in the past, who may not totally understand English?"}, {"date": "3 Aug 2015", "title": "Math Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Prince George's Community College (Largo, MD) in May 2013", "Interview Descriptions": "Briefly discussed my qualifications for becoming a math tutor. The interview went smoothly since I passed the minimum prerequisite of obtaining a C in College Algebra. Since I was an Engineering major I did well in my remaining matchless up to Differential Equations. But I did not take Statistics.", "Interview Questions": "Did I passed all the prerequisites for becoming a Math Tutor?"}, {"date": "1 Dec 2015", "title": "Recruiter Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Prince George's Community College (Largo, MD) in Jun 2011", "Interview Descriptions": "The hiring managers make the final selection. Interview questions are given before the interview. Positions are filled in a timely basis based upon budgetary requirements and the needs of the individual department.", "Interview Questions": "Where do you see yourself in five years."}]]