[[{"date": "26 Jan 2019", "title": "Counselor Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "The process took 1 week. I interviewed at Gaudenzia (West Chester, PA)", "Interview Descriptions": "I had the chance to interview for 2 different departments, West Chester house and Kindred House.  You go into the interview and they ask you to fill out an application, but the application is like 30 pgs and includes new hire paperwork (which sends mix messages).  Interview questions are not focused on getting to know you as a counselor/therapist.\nInterview Experience for Kindred house - I arrive and my interviewer called out, so her supervisor conducts the interview.  Very pleasant, but has me filling out all this paperwork while conducting interview.  Interview was easy going and was told I would hear something by the end of the week and that \"You are a strong candidate.\"  That Friday I recieved a call from Supervisor to come in for a second interview with the original interviewer that called out.  Arrive and interviewer thought it was later in the day and asked if we can reschedule.  I was so annoyed. I told her not really, I drove an hour to get here.  Does the interview super quick and never hear from them again.\nInterview Experience for west chester house - interview was easy going but was expected to bring degrees and official transcripts without offer.  I personally feel I should have to pay for official transcripts without an offer.  Position's saraly was too low, and would be taking a pay cut.", "Interview Questions": "How your driving record?"}, {"date": "22 Dec 2017", "title": "Billing Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Gaudenzia (Baltimore, MD) in Jul 2017", "Interview Descriptions": "The interview was fast and pretty typical. I met with the director and looked over my resume and he hired me on the spot.  It was a lot of standard paperwork to fill out and I had to get a criminal background and CPS check, which, at first, I thought was odd since the position in billing and has nothing to with children.", "Interview Questions": "Are you in recovery?"}, {"date": "9 Feb 2016", "title": "Addictions Counselor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Gaudenzia (Pittsburgh, PA) in Jun 2015", "Interview Descriptions": "The interview process was very long. It took over a month to get a response from the initial application, a month to hear back from the first interview, and then finally a second interview. They wouldn't tell you the result of the experience until getting a hold of all references so it took them a month to get back to me about it. But no phone call was initiated until I called myself to check the status.", "Interview Questions": "Experience"}, {"date": "12 Jun 2016", "title": "Recovery Specialist Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at Gaudenzia (Bristol, PA) in Dec 2014", "Interview Descriptions": "I had 3 interviews and they were very professional The first interview was with the devison director which was alittle intimidating. Once we started the interview i was able to calm down and ne less tense. He was very friendly and ask very to the point question. The second interview was with the devison director and the program director again i was very nervous once it stated they made me feel bery welcome and comfortable. The questions they asked were very normal for and interview and they very welcome and happy with the level of honesty. The final interview was to meet the staff and tour the facility. After doing so they offered me a position and gave me an offer. After all the interview process was a little long i thought but was worth it in the long run.", "Interview Questions": "What experience do you have? What do you think you can bring to our company? Are you in recovery?"}, {"date": "28 May 2015", "title": "Drug and Alcohol Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Gaudenzia (Baltimore, MD) in May 2014", "Interview Descriptions": "Friendly, clear and concise. Also indicated if you had potential to make it to second round of interviews as well as made you an offer at end of seconf interview if they were interested in hiring individual.", "Interview Questions": "Open ended questions related to your experience in handling different work scenarios"}, {"date": "22 Oct 2016", "title": "Director Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Gaudenzia (Phila, PA) in Apr 2014", "Interview Descriptions": "Interview questions were direct, basic description of job was given, and process was cordial.  Minimal interest in what I was bringing to the company.  Interview was late and almost didn't occur after sitting for 1/2 hour waiting. Interviewers were pleasant enough and did not cause discomfort.", "Interview Questions": "Do you have a vision for this program?"}, {"date": "13 Aug 2014", "title": "Counselor I/Substance Abuse Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Gaudenzia (Sykesville, MD) in Apr 2014", "Interview Descriptions": "two interview process, appropriate documentation of credentials to meet job title/position requirements. 1st interview was with 3 supervisors, but not with immediate supervisor (in order to see if prison services was as \"good fit\"/SUPERVISOR TO EMPLOYEE/COUNSELOR. 2nd  interview was wih head of prison services: salary was offered: I accepted than handed over to coordinator of prison services. Completed back ground check which took two weeks and was working 6 weeks after 1st interview", "Interview Questions": "N/A"}, {"date": "17 Feb 2013", "title": "Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Gaudenzia (Harrisburg, PA)", "Interview Descriptions": "Initial interview with supervisor, second interview with supervisor and director. Interview was pretty laid back. Benefits were discussed in first interview, salary in second. I got the impression that the people interviewing me did not have control over salary offer.", "Interview Questions": "Asked what I would do if both director and supervisor quit."}, {"date": "27 Jan 2014", "title": "Assistant Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Gaudenzia (Harrisburg, PA) in Jan 2010", "Interview Descriptions": "I initially applied for a counselor position but someone from another department contacted me for an interview. Once I had the interview we both realized that I was not qualified for the position but she stated that my qualities are good and that I can be used in another department and work my way up. So maybe a week or two later, the supervisor from another department called me for an interview after that I was called for a second interview with the director.", "Interview Questions": "I only remember being asked what is addiction, there were alot of questions."}]]