[[{"date": "24 Dec 2020", "title": "Help Desk Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Western Illinois University", "Interview Descriptions": "It was a short interview process, friendly meeting with other help desk staff and director for a student position. I was willing to work longer hours but was restricted by the agreements with the University to not work more than part-time while taking courses.", "Interview Questions": "How would you handle a difficult caller looking for training certificates they could not find?"}, {"date": "21 Nov 2018", "title": "Teaching Support Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 days. I interviewed at Western Illinois University (Chicago, IL) in Jan 2018", "Interview Descriptions": "The interview was for a Teaching Support Assistant, it was a 2 days interview, a background check, one on the phone interview and a one on one technical and qualificatins interview", "Interview Questions": "Why did you apply for the position"}, {"date": "10 Oct 2019", "title": "Custodian Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Western Illinois University (Moline, IL) in Aug 2017", "Interview Descriptions": "Very informal interview. They just checked whether my schedule would allow me to do my minimum hours. I contacted the job coordinator on campus, she reviewed my skills and gave me some advice, that i ended up not needing at all. I applied and i received an email back the same day. It was on a friday. On Monday i had done the interview, and i hmwas ready to start", "Interview Questions": "They just basically asked for my schedule, to see if my schedule would allow me to work. They were looking for students and i guess there weren't many applying so they took me right away "}, {"date": "19 Jan 2018", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 months. I interviewed at Western Illinois University (Macomb, IL) in Apr 2017", "Interview Descriptions": "The teachers were great.  I was relaxed.  I knew the program and trusted the professors.  Once I was accepted as a grad student, everything was pretty smooth.  I even got two classes to teach, so I'm pretty busy!", "Interview Questions": "What strengths do you bring to teaching?"}, {"date": "8 May 2016", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Western Illinois University", "Interview Descriptions": "Met with a current faculty member and discussed the needs of the department and my needs as a potential student. Overall the process was streamline and easy to understand. The people there are pleasant and willing to assist any way they can. The department chairs are also required to submit a reason why they did or did not hire you- so no waiting for an answer that may or may not come.", "Interview Questions": "Please explain, given your background, why you are choosing to pursue this course of research?"}, {"date": "13 Jul 2017", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Western Illinois University (Macomb, IL) in Sept 2015", "Interview Descriptions": "Easy quick questions. Not difficult at all. They will work around your school schedule.  all you do is apply, the school will call you set up a time to meet, then they will give you a building to work in and the hours you work", "Interview Questions": "What is your school schedule "}, {"date": "12 Feb 2017", "title": "Desk Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 3 weeks. I interviewed at Western Illinois University in Mar 2015", "Interview Descriptions": "The interview process was fast, simple and easy. Straight forward application interview wait a few weeks then get a response. Took a while to get a response, but once I did it was exciting to get the job.", "Interview Questions": "What kind of related experience do you have to the position?"}, {"date": "13 Nov 2014", "title": "Graduate Teaching Assistant Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied through college or university. I interviewed at Western Illinois University", "Interview Descriptions": "You will have a phone interview before you are called for one on one interview.  \r\nThe major thing they will like to know whether you have experience in teaching and how many years experience. you will be given a class scenario for you to decide how to handle a situation", "Interview Questions": "share your teaching experience."}, {"date": "25 Jun 2014", "title": "Complex Director Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 2 months. I interviewed at Western Illinois University (Macomb, IL)", "Interview Descriptions": "This is your standard interview process for residence life. They read questions from a sheet, fear to deviate from the sheet, and often do not ask follow up questions. There is an interview with undergraduate students, graduate/professional staff, the Assistant Vice President that's more of a chat session, lunch with some other staff.", "Interview Questions": "There weren't any that were out of left field"}, {"date": "25 Dec 2014", "title": "Lab Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Western Illinois University in May 2014", "Interview Descriptions": "Was requested to work on a senior design project from the professor who thought I would be qualified for.  As soon as he asked me if I wanted to have the job, I replied yes.  I started working the next week.", "Interview Questions": "The most difficult question was whether the position would interest me."}], [{"date": "6 Aug 2015", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Western Illinois University in Apr 2014", "Interview Descriptions": "Based on my application , I availed the opportunity which comes with monthly stipends along with no tuition. There was no particular interview session that took place but depending on individuals credentials, one get a opportunity to work as teaching assistant.", "Interview Questions": "N/A"}, {"date": "10 Jun 2015", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 3 weeks. I interviewed at Western Illinois University (Moline, IL) in Jan 2014", "Interview Descriptions": "As a graduate student, you can apply to be a Teaching Assistant for the semester. As long as you do your work well, you can continue to be an Assistant for as long as you are a student. There is a pretty standard application that asks for your resume, cover letter, and some background information. References from Professors are key to getting the position. Once it is submitted, they make a decision. There is no actual formal interview.", "Interview Questions": "Why do you think you would be a good Teaching Assistant?"}, {"date": "14 Jul 2017", "title": "Resident Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Western Illinois University (Macomb, IL) in Aug 2013", "Interview Descriptions": "Speed interview process. Three tables with a head staff member and current RA at each. Each table focuses on a different aspect of the job. Each table asks about 5-8 questions. Rotate to another table after 15 minutes. About 45 minutes in total.", "Interview Questions": "How do you not play favoritism, if a friend of yours is one of your residents?"}, {"date": "4 Nov 2015", "title": "Resident Hall Information Desk Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Western Illinois University (Macomb, IL) in Feb 2013", "Interview Descriptions": "It's a group interview process. You and two other candidates sit across two interviewers in a conference room. You are asked a series of questions and given a hypothetical scenario to work thew. The interviewer look for confidence and critical thinking ability.", "Interview Questions": "How would you handle a disgruntle customer? Example: Someone comes to you angry because they did not received a package they were expecting in the mail."}, {"date": "17 Nov 2012", "title": "Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at Western Illinois University (Macomb, IL)", "Interview Descriptions": "Focused on talent and tasks rather than on cultural/personality fit.", "Interview Questions": "N/A"}, {"date": "27 Jun 2015", "title": "Faculty Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Western Illinois University (Macomb, IL) in May 2011", "Interview Descriptions": "I sat down in front of a panel of current employees of the department as well as the head of the department itself. Interview was based on knowledge of systems, web development experience & grant writing. It took probably 45 minutes to an hour from start to finish and was a little unnerving being questioned by so many people but the questions themselves were not difficult.", "Interview Questions": "Tell me about your experience writing grants"}, {"date": "8 Dec 2012", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Western Illinois University (Macomb, IL) in May 2011", "Interview Descriptions": "Email sent out before end of semester for staffing next semester's classes requesting resume and application. Need three references and at least two letters of recommendation. Called for interview a week later. Asked several questions about how I would respond to situations that could be raised in a class. Application is sent to a committee who determines if you are hired. Notified within two weeks after that.", "Interview Questions": "How would you handle a disruptive student who walks in ten minutes late to class."}, {"date": "22 Apr 2010", "title": "Lab Repair Technical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Western Illinois University (Macomb, IL) in Dec 2009", "Interview Descriptions": "Emailed my resume in, as per instructions on WIU website. Heard back via email within 2 days. Was in boss's office for interview the day after I got the response. Talked about my interests and why I wanted the job. Just got to know each other a bit. Second interview consisted of me talking to certified Apple and Dell repair rep.'s they asked questions to make sure I knew the basics of hardware repair. Got called with the job offer shortly after that.", "Interview Questions": "Why are manhole covers round?"}]]