[[{"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Na", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "23 Feb 2023", "job_title": "Complete Coach in Knoxville, TN", "duration": "N/A", "pros": "Great work being done for students!", "cons": "There is some travel depending on position"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Employee Beware", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "18 Oct 2022", "job_title": "Complete Coach in Nashville, TN", "duration": "N/A", "pros": "PTO Fellow Coaches The students", "cons": "I’ve gone back and forth on how I wanted to write this review and have settled with the fact that I genuinely want to warn anyone who is thinking of working here. The pay is okay (although when I was hired, the base pay for coaches was only raised because someone in a different office noticed the LinkedIn posting was offering better pay than what actual current and seasoned coaches were making)… The PTO is great, but you will have to work during your time off if you don’t want to be completely swamped the next week. What I found to be the absolute hardest and worst part of the job is Senior Staff. They can be incredibly rude and very gossipy (they even have their own term for it called “the swirl”). They tend to speak very poorly of the coaches when they think they aren’t being overheard. During the second week of my employment, which was literally still when we were in orientation, it became very clear that they didn’t really like me and a big bulk of my job was essentially doing everything in my power not to further tick them off. I had tons of “check ins” which was really a meeting with a member of Senior Staff when they would spend the majority of the time criticizing me and leaving me feeling torn down and not lifted up or better equipped to coach my students. There is always something you can be doing more or better. Their micro aggressions are undeniable and they don’t realize the toxicity of some of the remarks they casually make. Unfortunately, it seems to have become a shared culture amongst the Senior Staff. tnAchieves as an organization undeniably makes a great impact on students, but the coaches, who do the bulk of student interaction, are treated beyond poorly. If your goal is to aid in student success, there are plenty of ways to do that that don’t come at the expense of your mental health. I know for certain I am not the only one who felt this way. The lack of empathy is evident in the way they speak to their coaches, and I would caution you before accepting a position here. I feel lucky to have found a position elsewhere and resign when I did."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": 4, "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Making a real difference!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "13 Apr 2022", "job_title": "Anonymous Employee in Knoxville, TN", "duration": "N/A", "pros": "Professional development,culture centered around growth mindset,integrity from leadership, oppurtunity to impact your community, collaborative atmosphere, onboarding and support", "cons": "There is a lot of information and it can take some time and patience to learn it all."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Terrible Management", "rating": "1.0", "reviewer_affiliation": "Former Contractor", "job_date": "11 Aug 2021", "job_title": "Complete Coach in Knoxville, TN", "duration": "N/A", "pros": "It’s a job that pays", "cons": "Terrible management, extremely cut throat, required to learn on your own, no sense of leadership, you are told not to speak unless spoken to"}], []]