[[{"date": "6 Apr 2023", "title": "Patient Sitter Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at West Jefferson Medical Center", "Interview Descriptions": "Very fast and easy it was straight forward and very organized the managers were very nice and staff directed you without a problem it took about 2 weeks to begin working", "Interview Questions": "Why do I want to work here"}, {"date": "29 Jun 2022", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at West Jefferson Medical Center", "Interview Descriptions": "Applied in person and turned in documents needed. Not much of an interview. Make sure to check the date and time of orientation. The ladies that run the program are very nice.", "Interview Questions": "What do you plan on doing in the future?"}, {"date": "23 May 2022", "title": "Nurse Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at West Jefferson Medical Center", "Interview Descriptions": "I had 3 rounds of interviews withing the nursing administration team. Each interview was 30 minutes in person. They also gave me a tour of the department/floor I would be working if given the job.", "Interview Questions": "How soon could I start? "}, {"date": "7 Apr 2021", "title": "Financial Controller Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at West Jefferson Medical Center (Seattle, WA) in Nov 2020", "Interview Descriptions": "Full day interview with multiple teams and departments. Casual environment with some specific questions, but more of discussion type interview. Long day, but overall it was a great interview and experience.", "Interview Questions": "What could you bring to the table?"}, {"date": "16 Feb 2021", "title": "Customer Service Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at West Jefferson Medical Center (Marrero, LA) in Oct 2019", "Interview Descriptions": "I met with the manager of the department. She gave me a description of the things I will be doing in the job position along with starting pay. She also gave me a tour of the department. She definitely made the interview process easy and comfortable for me.", "Interview Questions": "Name a time when you had to go over and beyond to help meet the needs of a customer. "}, {"date": "15 Aug 2018", "title": "Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1+ week. I interviewed at West Jefferson Medical Center in Aug 2018", "Interview Descriptions": "Had a call for a face to face interview two days after applying to the job. Was told HR would reach out with the official offer of employment. Was introduced to department heads and shown the system that I would be working in.", "Interview Questions": "What kind of experience have you had in your current job and how is it compatible to the system that we have in place?"}, {"date": "17 May 2016", "title": "Staff RN Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at West Jefferson Medical Center (New York, NY)", "Interview Descriptions": "Applied online; filled everything out by hand (there was no \"resume attachment\" type of option). HR called within 24hours, telling me that they had a different position \"that seemed would fit me better\" available (applied for ER RN, got offered interview for ER observation unit RN position). The person I talked to on the phone was very pleasant and said she would schedule me for an interview and call me back - she did call back but didn't leave a message and I haven't heard back since - I didn't call her back myself so it seems we both dropped the ball. I expected that if they were interested they would have left a message asking me to call back or would have called back again at a later time. I also got an email later (couple weeks) stating that the job I had applied too was filled but that my application had be passed on to HR for other positions that matched my profile - that was an automated message, and I haven't received any contact from them since.", "Interview Questions": "When can you begin employment"}, {"date": "29 Jun 2017", "title": "Front Desk Clerk Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at West Jefferson Medical Center (Marrero, LA) in Jan 2016", "Interview Descriptions": "I was called and the manager wanted me to come in within the next hour, which is very last minute and not convenient. I arrived at the clinic and was taken into one of the doctor's personal office. She asked basic interview questions and said that HR will determine my pay. You have to go to industrial medicine to complete your drug testing and physical. Orientation was the following week and took about an hour. They COO and CEO were present and gave presentations, which was very nice of them.", "Interview Questions": "Do you speak Spanish?"}, {"date": "4 Jan 2014", "title": "Administrative Secretary Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at West Jefferson Medical Center", "Interview Descriptions": "Quick process.  New within the week the job offer.", "Interview Questions": "General tell me about yourself but no other questions"}, {"date": "8 Mar 2016", "title": "Case Management Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at West Jefferson Medical Center (New Orleans, LA) in Sept 2012", "Interview Descriptions": "They called me in for an initial face to face interview and then approximately a week after that I received a call and had to schedule a second interview.  I received a call back approximately a week later with a job interview.", "Interview Questions": "Describe a strength and a weakness"}], [{"date": "25 Jul 2010", "title": "RN Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at West Jefferson Medical Center (Marrero, LA) in Jun 2010", "Interview Descriptions": "The process was quick . online app done .HR called the next day", "Interview Questions": "N/A"}]]