[[{"date": "26 Jan 2023", "title": "Human Resources Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at One Acre Fund (Lagos)", "Interview Descriptions": "It was quite interesting, the process was different from the usual interviews by employers. All in all, the stages are about five including a 6-hour test to be taken at your convenience.", "Interview Questions": "Why do you want to join One Acre Fund?"}, {"date": "12 May 2021", "title": "Manager, Office of the Chief Executive Officer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at One Acre Fund", "Interview Descriptions": "Applied online and received an invitation for an online case study test. The test covered areas such as personnel management, cultural diversity, financial modelling and analytic thinking. It was a remote test which required me to answer the questions and email my answers within the set time period of 3 hours.", "Interview Questions": "Using provided data and some calculated assumptions, design a retention strategy. Your aim will be to analyze this data to: (i) determine our current\nretention rates, (ii) observe patterns in our senior level attrition"}, {"date": "17 May 2021", "title": "Associate Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at One Acre Fund in Mar 2021", "Interview Descriptions": "The process was easy especially if you are an experienced candidate. Most of the questions they ask you are related to the role you applied for. there are about 2-3 interviews before they give you the job.", "Interview Questions": "Please read my comment below"}, {"date": "20 Nov 2020", "title": "Field Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at One Acre Fund (Minna) in Sept 2020", "Interview Descriptions": "I would love to be as detailed as I possibly can, hoping that my experience helps someone out there.\r\n\r\nMy interview started with an aptitude test (by plum.io), after which I got invited for a 1-hour phone interview with a recruiter in Kenya. A week later, I was sent an exercise and asked to submit within 24 hours.\r\n\r\nFinally, a week later, I was called for another phone interview, then after that, I was told I didn't qualify for the next round of the interview.", "Interview Questions": "First Phone Interview:\r\n1. Why OAF?\r\n2. Tell us about a project you handled and how you executed it.\r\n3. Tell us about a challenge you faced and how to overcame it.\r\n4. State an instance when you demonstrated leadership.\r\n5. How would you plan a tree planting project? State 3 things you'll check 3 weeks and 1 week before execution.\r\n6. Why are you a good fit for this role?\r\n7. What skills would you love to develop?\r\n8. Any questions?\r\n\r\nSecond phone interview:\r\n1. Tell us about yourself.\r\n2. Why did you leave previous job? \r\n3. Tell us about your face-to-face interaction with farmers.\r\n4. While leading an expansion into a new location, tell us five steps you'll take.\r\n5. Failures you've had in the past and how you overcame it.\r\n6. State two operational difficulty you might encounter in executing your responsibilities.\r\n7. Summary of your exercise.\r\n8. What are top 3 problems smallholder farmers face? Pick one and say how OAF addresses it.\r\n9. What do you find interesting about OAF?\r\n10. Rate your fluency in Hausa.\r\n11. Differentiate between strategic management and project management.\r\n12. Any questions?"}, {"date": "1 Jul 2019", "title": "Rotation Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at One Acre Fund in Jun 2019", "Interview Descriptions": "The interview process was good. I had two telephone interviews and one written exercise where i was asked to manage a work scenario similar to what the role demanded. I responded by focusing on the methodology of getting the right data but i guess the interviewer was more interested in me naming actual solutions. So if you are interviewing for a role and they ask you to name solutions, please name specific solutions.", "Interview Questions": "How to manage data capture for operations"}], [{"date": "9 Feb 2019", "title": "Innovation Associate Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at One Acre Fund (Lagos) in Feb 2019", "Interview Descriptions": "I only participated in the plum survey and after a week I was informed that I was not selected for the next phase of the interview. But, I still learnt some things from the result of the plum survey because I now know some of my weak points that are needing improvement.", "Interview Questions": "Choose adjectives that are most like you and most unlike you"}, {"date": "28 Feb 2018", "title": "Program Associate Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at One Acre Fund (Lagos) in Feb 2018", "Interview Descriptions": "I applied for the Strategy & Operations Analyst role in Rwanda. Shortly afterwards, I was sent an email saying that although I met the qualifications, it'd be better if I continued the interview for the Program Associate role, Nigeria. \r\nI decided to continue and had to complete a 'Plum survey' which is quite similar to an MBTI (though it tries to simulate ones potential behavior in a real work context). Afterward taking the 'plum survey', I was asked to pick a date for the first of two (2) over-the-phone interviews (on Skype). I selected a date and started to prepare for common interview questions I found on Glassdoor (which,I must say, are very accurate!). \r\nI noticed that there was usually a question requesting 2 instances where one has displayed LEADERSHIP and a brain teaser. So I developed my stories and also prepared for other typical interview questions. \r\nMy interview lasted for about 1 hour 20 mins (after answering a mix of personal, professional and one case question; plus-my own questions on OAF). \r\nAfter  two (2) days, I was informed that my application was not selected to proceed to the next stage (another phone interview with perhaps, another member of OAF). \r\n\r\nOverall, they were quite engaging until the actual interview where I felt my interviewer could have done a better job communicating her expectations and giving feedback at the end of the interview.", "Interview Questions": "Here are the questions I was asked for the Program Associate (Nigeria) role:\r\n1) Tell us about yourself?\r\n2) Tell me two (2) instances when you embodied leadership. Give specific references to your role, contexts and results achieved\r\n3) Detailed case (abridged)\r\nYou're a new program associate in Rwanda leading a new trial on using limestone to reduce soil alkalinity and thereby, increase farm yields (by 20%) and farmer incomes (20%). You have    5 months leading up to the trials.\r\n+ How would you spend the first 3 weeks leading up to the trials? (just give a general sense of how you would spend the time. Specify steps and plans to be taken\r\n+ What specific tasks will you initiate?\r\n4) Why do you want to work with OAF and what led you to apply here?\r\n5) Specify deliverables in your last job role. Give context of projects and what exactly you had to do\r\n\r\n6) Do you have any questions you want to ask us?"}, {"date": "4 Jun 2016", "title": "Program Associate Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at One Acre Fund (Abuja, Niger) in May 2016", "Interview Descriptions": "I received an email requesting for a convenient time for a Skype Interview.\r\nI missed the first date due to connection issues, and so it was rescheduled for the following week. \r\nthe interviewer was quite pleasant, but you couldn't really tell if your responses were right or wrong. \r\nShe sounded impressed with everything which I must confess was quite misleading.", "Interview Questions": "1) Give examples when you have exhibited Leadership\r\n2) the tree Planting exercise"}]]