[[{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Supportive team and lots of opportunities to apply & develop skills!", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "26 May 2023", "job_title": "Therapy Team Manager and Complex Case Therapist in London, England", "duration": "N/A", "pros": "UP is very welcoming and supportive, with lots of opportunities to use and develop therapeutic and management skills.  UP's systems are very efficient and there are excellent resources available to support planning.   Hub Managers are accessible and thoughtful and I appreciate our regular team meetings and training. UP's Safeguarding policies and procedures are robust and give me confidence in keeping the children we work with safe. Perks include clinical supervision costs being covered by UP and you can book relevant CPD trainings within work hours.", "cons": "Time off in school holidays is a great bonus, however, this does mean the salary is pro-rata-ed down as a result. \r\nAt times being the only therapist on-site at school can feel lonely, so it's important to make use of the opportunities to link in with the rest of the team."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": 4, "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Growing and learning", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "27 Feb 2023", "job_title": "Employee in London, England", "duration": "N/A", "pros": "It’s lovely to work for an organisation that is really making a difference. The results speak for themselves. This charity is able to reach vulnerable children who are slipping through the net and is improving the children’s day to day experiences and life chances. The staff at Unlocking Potential are some of the most passionate, creative and determined people I have ever worked with. This means that the team tends to be very supportive of each other and makes it a great place to work.", "cons": "As you would expect, a small charity can’t match the benefits and salaries of large organisations, like the NHS and big corporates. However, they still prioritise staff’s mental health support staff with their CPD . We have access to the BUPA helpline, team building days, training for CPD and the charity closes for a fees days over Christmas which encourages staff to rest."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": 0, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Hard work is not reflected in salary", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "9 Jan 2023", "job_title": "Occupational Therapist in London, England", "duration": "N/A", "pros": "Unlocking Potential is a growing charity that supports many children in need.\r\nDedicated team of colleagues.", "cons": "Hard work in schools across London.\r\nThe salaries are okay for newly qualified staff needing to gain some experience. However, salaries remain the same and do not reflect input from experienced staff. Staff work hard, but the charity does not offer appraisals that recognise this. Only basic 1% salary increase in April, Unlocking Potential does not offer appraisals, promotions or any raises based on individual merit and hard work."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": 3, "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "A growing, committed and passionate charity", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "26 Sept 2022", "job_title": "Psychotherapist in London, England", "duration": "N/A", "pros": "Genuinely passionate about supporting the community, offering a range of interventions to suit different needs. \r\nRecently some management restructuring has meant more room for staff to grow and develop in a field where there aren't always such opportunities. \r\nA committed, thoughtful team that does its best to listen to staff and to take ideas and suggestions on board.", "cons": "In the past there weren't many CPD opportunities but this is rapidly changing and now staff is offered more training days. This process has been done with the participation of staff who were asked to let management know which areas they are in most need of support.\r\nMuch thought is given to how to promote diversity and inclusivity in the charity."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Growing charity who care for their employees", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "25 Oct 2022", "job_title": "Hub Manager in London, England", "duration": "N/A", "pros": "My colleagues are incredibly supportive. The leadership team are personable, kind and caring. We are encouraged to explore our professional interests and supported to complete CPD. The charity has a diverse range of psychotherapists/counsellors who are trained in many different modalities which adds depth to the Schools Programme and to the services we offer. As a Manager there are always new opportunities to develop/improve the operational aspects of the charity, as well as great opportunities to set up new provisions.", "cons": "There are very few cons, the charity excels above and beyond in many areas and it is almost impossible to find flaws, however if I had to name one area for development it would be the overall growth strategy."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 4, "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "A growing charity, talented and thoughtful colleagues", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "7 Nov 2022", "job_title": "Anonymous in London, England", "duration": "N/A", "pros": "UP have grown as a charity in recent years, this is opening up new opportunities for staff development. The staff are hugely talented , thoughtful and committed to the children and families; they are a brilliant and warm team to work with.", "cons": "There has been a lot of leadership change in recent years and previously there was little scope to develop. However this change settled, more management roles have been created, there is a larger team overall and this is allowing for growth and staff development."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": 4, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Great place to work", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "27 Sept 2022", "job_title": "Anonymous Employee in London, England", "duration": "N/A", "pros": "UP is a great charity to work for. At UP you'll be working with supportive colleagues who are committed to providing excellent therapeutic interventions to some of the most vulnerable children and young people across London. UP is committed to staff wellbeing understanding how vital this is in ensuring excellent services for the children and young people it supports.", "cons": "No cons, have found UP to be an excellent charity to work for"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Unpleasant back stabbing working environment", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "17 Aug 2022", "job_title": "Support Staff in London, England", "duration": "N/A", "pros": "Working with lovely young people.", "cons": "Unpleasant senior management team. Lack of diversity among senior management & trustee team considering they are dealing with different minority backgrounds."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "Unpleasant working environment", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "6 Jul 2021", "job_title": "Anonymous Employee in London, England", "duration": "N/A", "pros": "The opportunity to work with marginalised children and help them succeed.\r\nOne or two lovely people.", "cons": "Unpleasant staff members, bullying culture with no concern for mental health nor wellbeing.\r\nPoor location. Children kicking equipment into neighbours house due to lack of space.\r\n\r\nStaff have been attacked by dogs upon entering the building. \r\n\r\nParticular staff members making false allegations against other staff. Focus not on the children, moreso on power and being in control. Lack of structure and boundaries. Gossiping, backbiting and bullying.\r\n\r\nStaff who actually care about the children have been removed unfairly as a result of false allegations and spiteful behaviour. \r\n\r\n\r\nA lot of drama and picking on people. This is then picked up on by the children and its unacceptable. \r\nThe most horrible place I've ever worked in."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 0, "Career Opportunities": 5, "Compensation and Benefits": 3, "Senior Management": 5, "review_title": "Lovely place to work", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "21 Apr 2022", "job_title": "Team Manager in London, England", "duration": "N/A", "pros": "Have seen many colleagues progress in the charity. Our School based mental health service is growing , which is great given the need. The service is continually developing. Passionate and committed CEO and managers.", "cons": "None that come to mind"}], [{"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 0, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Disappointing and cut throat", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "1 Dec 2020", "job_title": "Administrative in London, England", "duration": "N/A", "pros": "Some staff are clearly passionate, committed and dedicated to their work \r\n\r\nWorking with young children and being able to see the positive impact the charity has to them.", "cons": "Extremely bad management and structure across the organisation. \r\n\r\nNo cohesion of staff amongst programmes.\r\n\r\nMajority of SMT are particularly cut-throat and self-motivated. \r\n\r\nLack of ethnic diversity across the organisation (extremely disappointing when the majority of the charities beneficiaries come from BAME background).\r\n\r\nCEO is prone to providing false information in all aspects of the charity. \r\n\r\nNot much opportunity to progress within the organisation."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 0, "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 4, "review_title": "Supportive team", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "28 Jan 2021", "job_title": "Team Manager in London, England", "duration": "N/A", "pros": "Great team of knowledgable therapists. Thoughtful approach.", "cons": "A lot of work for little pay. No career advancement opportunities."}]]