[[{"date": "5 Jul 2023", "title": "RFP Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Sentara (Virginia Beach, VA)", "Interview Descriptions": "The phone interview lasted about 30 minutes and went pretty well. The basic interview questions were answered, I shared a few things about myself and learned a few things about the company that excited me. Before the call ended I was asked to send writing samples which I did and to spend time correcting a sample document and answering questions that might pertain to the job. I was advised to send them by a certain date which I did well in advance to never hear anything back, this includes a follow up email asking the interviewee to confirm recipient of the writing samples. I had a good idea that I did not get the position but it was only confirmed when I went to check on the status of my job application and saw \"not selected.\" This is totally fine but it was very rude to not hear back either personally or the generic \"we've decided to pursue other candidates\" email.", "Interview Questions": "How do you prioritize your tasks?"}, {"date": "26 Jun 2023", "title": "Registered Nurse Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Sentara (Norfolk, VA)", "Interview Descriptions": "Straight forward and concise. Hiring managers are knowledgeable and friendly. Review the history of the organization and know a little about the unit/ location you are applying to. They are interested in why you are applying to the certain location and want to make sure it is the right fit for you.", "Interview Questions": "They asked about my professional strengths."}, {"date": "19 Jun 2023", "title": "Data Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Sentara (Norfolk, VA)", "Interview Descriptions": "Simple and quick. Call with a recruiter, 30-minute non-technical panel interview, and then received an offer. The team is fantastic and very friendly - typical large non profit. Very positive expeirnce end to end.", "Interview Questions": "Walk through your tech stack for BI dev and reporting"}, {"date": "30 Jun 2023", "title": "Registered Nurse Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Sentara (Charlottesville, VA) in Jun 2023", "Interview Descriptions": "Received initial interest from a recruiter who then organized me to have the interview. Had a virtual interview and then was asked to come out for a shadow opportunity. Loved the hospital amazing staff.", "Interview Questions": "What where the areas of interest?"}, {"date": "27 Jun 2023", "title": "Food Server Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Sentara (Virginia Beach, VA) in Jun 2023", "Interview Descriptions": "Very excited about the process. I learn a lot about the companies. During the interview . The people seem to care about who they hire to work for them. They ask a lot of questions and ask if I had any questions.", "Interview Questions": "Why do you want to work here?"}, {"date": "8 May 2023", "title": "PCR Technician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Sentara (Virginia Beach, VA)", "Interview Descriptions": "Great interview process everyone was nice, I hope to get hired, awesome benefits great atmosphere and people, management is pretty cool and I hope to work for them some day.", "Interview Questions": "Tell me a little about yourself"}, {"date": "19 May 2023", "title": "Clinical Exercise Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Sentara (Virginia Beach, VA) in May 2023", "Interview Descriptions": "Was brought in for an interview quickly and the questions were not typical interview questions, but were thoughtful and reflected the job. The interviewers listened to each of my responses and took them into consideration for future questions. They provided answers to my questions, as well, and gave information about salary and benefits without me having to ask.", "Interview Questions": "Q: How does a typical work day look to you? Q: Give 3 words that your friends and family would use to describe you. Q: How do you like to receive feedback? How do you like to give feedback?"}, {"date": "5 Apr 2023", "title": "Case Manager Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Sentara (Virginia Beach, VA)", "Interview Descriptions": "General questions about background. Your experience on your resume and how it pertains to the job your applying for. Also why you are looking to leave your current role to join their organization.", "Interview Questions": "Tell me about a day in the life of your current role"}, {"date": "2 Apr 2023", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Sentara", "Interview Descriptions": "Quick process for a new grad. Not many questions as I was not expected to have much experience. The time with HR was longer than the actual interview and was mostly about benefits and pay.", "Interview Questions": "Can you work every other weekend"}, {"date": "7 Mar 2023", "title": "Registered Dietitian Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Sentara", "Interview Descriptions": "The whole team made me feel very comfortable. The asked questions about my experience and what I’m looking for in a job, and they were happy to answer any questions I had as well.", "Interview Questions": "They asked about my favorite rotation in my internship."}], [{"date": "7 Apr 2023", "title": "Patient Access Representative Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Sentara (Woodbridge, VA) in Mar 2023", "Interview Descriptions": "Although there were many applicants, once I sat with interviewer, the interview went by quickly. The interviewer was actually the hiring manager so that was great. Overall, it went well.", "Interview Questions": "Tell me about your previous work experience and how it relates to this position"}, {"date": "5 Apr 2023", "title": "Senior Specialty Infrastructure Engineer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 3 weeks. I interviewed at Sentara (Virginia Beach, VA) in Mar 2023", "Interview Descriptions": "I recently had a series of interviews for a position that left me feeling disappointed. During the initial telephone interview, the manager did not show up, and the architect conducting the interview seemed unprepared, having not even looked at my resume beforehand. Despite this, the conversation was pleasant and engaging. The second interview was a lab interview, during which I encountered some confusion and nerves that ultimately prevented me from completing the lab. However, I offered to explain anything I didn't get to, in order to demonstrate my understanding of the material. Unfortunately, the interviewer was dismissive and ended the interview abruptly. Although I have a strong network of professional references who could vouch for my skills and character, I was informed after the interview that I was not offered the role due to lab and the negative feedback from someone at my previous workplace. Despite my attempts to get more information and provide evidence to contradict the feedback, the company refused to reconsider their decision.", "Interview Questions": "Describe your background and experience"}, {"date": "21 Feb 2023", "title": "Nurse Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Sentara", "Interview Descriptions": "Same day easy interview with manager and staff. Received the job offer within the hour after. Mainly questions on team work and patient care. This was an extremely simple interview.", "Interview Questions": "What experience do you have?"}, {"date": "16 Feb 2023", "title": "Business Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Sentara", "Interview Descriptions": "Received a call for an interview, and the interview was scheduled within 72 hours. The interview was a panel interview with 4 team members online. It was a technical conversational interview. Not difficult.", "Interview Questions": "Tell me the SDLC process for a release."}, {"date": "18 Jan 2023", "title": "Nurse Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Sentara", "Interview Descriptions": "2 interviews that I had to do. They were in person at an office. Asked about prior job experience. They also asked about my goals for the new job. They asked about salary expectations.", "Interview Questions": "Experience I had in medicine"}, {"date": "4 Jan 2023", "title": "Patient Transporter Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Sentara", "Interview Descriptions": "Started with a phone interview. Phone interview went well. Went over the basics of the company and the pay. Then scheduled an in person interview which included several people and was more specific to the job.", "Interview Questions": "They asked about experience and knowledge with ambulating patients."}, {"date": "21 Dec 2022", "title": "Registered Nurse Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Sentara", "Interview Descriptions": "Didn’t go into details, it felt off. And even the interviewer came off as disinterested. I have heard they have a lot of problems with management and all you have to do is look at the reviews. Those speak for themselves", "Interview Questions": "How will you prioritize your care?"}, {"date": "1 Dec 2022", "title": "Home Health Lpn Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Sentara", "Interview Descriptions": "A little too busy. Ultimately the interview went well but I didn't overlook that they did reiterate their expectations on staff returning to school to further their education. That and a peer I know being let go from Sentara because she didn't advance from RN to BSN made me pretty confident they weren't going to be a good fit. I'm ok with being an LPN and they should be also.", "Interview Questions": "Experience, Background, hours willing to work, knowledge of role expectations"}, {"date": "2 Jan 2023", "title": "Data Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Sentara in Nov 2022", "Interview Descriptions": "Went through a screen call and it was a pretty basic introduce yourself and go over your resume. Didn't ask any technical questions or anything too complex. Just know your resume and be comfortable speaking.", "Interview Questions": "What makes you want to work here?"}, {"date": "13 Oct 2022", "title": "Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Sentara", "Interview Descriptions": "First, there is an online screening, HR phone screwing with a recruiter, and then an interview with the hiring manager if he chooses to do so. Interviews may be in person, most likely it will be a video conference call.", "Interview Questions": "Scenario based questions: what would you do if…."}], [{"date": "6 Jul 2023", "title": "Certified Nursing Assistant CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Sentara (Woodbridge, VA) in Aug 2022", "Interview Descriptions": "Underpaid for the work that you do. The job posting will not be true to experience. Management can be quite tricky. Leadership is click based so be aware of that. But for the most part it’s a 8/10 type of job.", "Interview Questions": "They asked Basic Questions off google"}, {"date": "26 Oct 2022", "title": "Medical Technologist Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Sentara (Virginia Beach, VA) in Aug 2022", "Interview Descriptions": "Average interview face to face and over the phone. Recommend that you do both if you want to visit the facility first and see up close other current workers. This will help you decide whether to pursue the position.", "Interview Questions": "What was a time you had to tell a patient no?"}, {"date": "19 Aug 2022", "title": "Care Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Sentara in Aug 2022", "Interview Descriptions": "I applied online and received a call to schedule an interview 3 days later. The interview was scheduled for the following week. I never got any feedback or notification. I just noticed my application status was updated to “rejected.”", "Interview Questions": "The interview consisted of about 10 behavioral based questions. Some more difficult than others. For example, “tell me about something you have done in your career that has helped you and something that has held you back”"}, {"date": "6 Jul 2022", "title": "Clinical Exercise Specialist Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Sentara", "Interview Descriptions": "The process consisted of two phone interviews and a Zoom interview at respective location. It was an easy interview process and they were very responsive and time sensitive after initial contact.", "Interview Questions": "How would you describe teamwork in your on words?"}, {"date": "4 Aug 2022", "title": "Enrollment Specialist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Sentara in Jun 2022", "Interview Descriptions": "The interview process consisted of a group of panelist to include the Manager and Team Leaders.  They were very honest about the process and the Department needs.  They really care about your background and how it relates to the role.", "Interview Questions": "Tell me of a time that you were faced with a difficult task in the workplace that you were not familiar with. How did you manage?"}, {"date": "7 May 2022", "title": "Communications Consultant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Sentara", "Interview Descriptions": "First step was nice and friendly, but I never heard back from them, even after they gave me a day they’d get back to me by. I was expecting at least an automated email.", "Interview Questions": "What qualifications do you have for the position "}, {"date": "1 Jun 2022", "title": "Compliance Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Sentara in May 2022", "Interview Descriptions": "Frustrating. Recruiter reached out via email about scheduling a phone screen then disregarded the dates/times I provided. Interview with the hiring manager was rescheduled three times (with a week of radio-silence in between the last reschedule) due to issues on their end. The interviewers were friendly but the interview itself felt very forced and I wasn’t even given an opportunity to ask questions at the end. Was told that I’d hear back about a decision either way by the end of the following week but never did. My application status was recently updated to “REJECTED”. \n\nThere was probably a candidate who was better suited for the role, I get it. People were friendly but the whole process itself was frustrating and demeaning by the end.", "Interview Questions": "Standard STAR format/behavioral interview questions."}, {"date": "1 Apr 2022", "title": "Team Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Sentara", "Interview Descriptions": "Basically they will start of by asking you to describe yourself in a few words. They want to hear good traits that’s pertaining to the position you are applying for. Then have this form that they go by and ask you in their own words and will rate you depending on how you answer these questions.", "Interview Questions": "*Demonstrate a proven ability to deliver results\r\n*Display an ability that influence changed\r\n*Articulate a path to achieve operational goals\r\n*Conveyed capabilities in building relationships with department leaders\r\n*Track record in developing employee talent and team member engagement "}, {"date": "5 Jul 2022", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Sentara (Richmond, VA) in Apr 2022", "Interview Descriptions": "I applied via online. I received an invitation to do a one-way video interview. After, I received information from the recruiter regarding the next steps.  It was a webex interview with my prospective manager.", "Interview Questions": "Standard Interview Questions like Tell me about yourself? "}, {"date": "28 Mar 2022", "title": "Registered Nurse Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Sentara", "Interview Descriptions": "As a new grad you have to apply under the new grad application.  After that someone will call you and ask which hospitals you're interested in working at.  After that another few people will call you about what units are available and set up interviews for you at those units. You are asked to meet them near the lobby, They bring you up to the unit for the interview. After the interview many units will give you a tour.  They also encourage you to schedule a shadowing opportunity.", "Interview Questions": "Tell me a little about yourself."}], [{"date": "6 May 2023", "title": "Lab Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Sentara (Norfolk, VA) in Feb 2022", "Interview Descriptions": "Informative and engaging. Sufficient time was given to indicate the best meeting times. The interviewers asked questions that were relevant to the position. As a candidate, I was allowed to indicate accomplishments are skill that met the qualifications.", "Interview Questions": "Tell me something about yourself."}, {"date": "5 Jan 2022", "title": "Team Coordinator Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Sentara", "Interview Descriptions": "Hiring manager, then a panel interview with two equal counterparts, the IT program manager, the team lead, a direct report, and a supervisor. Focused on leadership questioning and what if scenarios.", "Interview Questions": "If you had an employee that was not completing their task in an appropriate amount of time, how would you handle that situation?"}, {"date": "5 Jan 2022", "title": "Director, Operations Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Sentara in Jan 2022", "Interview Descriptions": "The first interview was an online recording, you were given a link to ensure your computer was compatabile. You wer asked 8 questions, and your response was recorded, you were able to review it and either accept it or rerecord it.", "Interview Questions": "how did you hear about us"}, {"date": "10 Feb 2023", "title": "Nurse Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Sentara (Woodbridge, VA) in Jan 2022", "Interview Descriptions": "Quick an easy. They were very passionate about the role and wanted to me to start right away. The last person had quit abruptly. I will go back and hav a second panel interview next week", "Interview Questions": "What was your weakness and strenght"}, {"date": "5 Jan 2022", "title": "Senior Business Systems Analyst Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Sentara in Nov 2021", "Interview Descriptions": "Manager was very responsive and accommodating. Interviews were scheduled quickly, and they followed when they said they would. All in all, this was one of the best and smoothest job interview experiences I have had.", "Interview Questions": "Tell me about a time you disagreed with a colleague. How did you handle it?"}, {"date": "14 Oct 2021", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Sentara", "Interview Descriptions": "The nurse manager was very helpful. It is a virtual question Interview and an in person interview. Getting the in person interview did take some time but once they get that the rest is quick.", "Interview Questions": "They asked situational and background questions."}, {"date": "27 Sept 2021", "title": "Recruiter Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Sentara", "Interview Descriptions": "There was first an HR phone interview followed by a series of questions that I had to screen record my responses.  This was followed up by a Zoom interview and then was told I would hear within the next week, but I never received a follow-up.  Also, between the two interviews, I took a personality test.", "Interview Questions": "What was your previous recruiting experience like?"}, {"date": "22 Sept 2021", "title": "Nurse Case Manager Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Sentara", "Interview Descriptions": "I spoke with the Recruiter 1st and then you get sent to hiring manager who then reaches out to set up interview if they think you will be a good fit", "Interview Questions": "I did not go through interview with the hiring manager as I decided it was not the right fit for me"}, {"date": "6 Aug 2021", "title": "Phlebotomy Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Sentara", "Interview Descriptions": "Different and easy. I enjoyed the digital approach to the interview process. I was able to do it from my home and without confusion. They seem to have the process down packed.", "Interview Questions": "Did I graduate high school."}, {"date": "24 Jun 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Sentara in Aug 2021", "Interview Descriptions": "I had to interview by video recording myself, then I had to actually go and interview on the floor where I was interested in working. I was interviewed by the nurse manager and 3 nurses who worked on the floor.", "Interview Questions": "Why did you become a nurse?"}], [{"date": "20 Jul 2021", "title": "Licensed Practical Nurse (LPN) Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Sentara (Harrisonburg, VA) in Jul 2021", "Interview Descriptions": "Well organized and to the point. Spent about 30 minutes on the phone.  They Called right on the dot. Told me about benefits.  I got a scheduled face to face  interview before the call ended.  It was a pleasure to speak with the interviewer.", "Interview Questions": "To tell them about a different time and how I handled it."}, {"date": "25 Jun 2021", "title": "OR/Anesthesia Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Sentara (Virginia Beach, VA) in Jun 2021", "Interview Descriptions": "First Virtual One-Way Interview and you can re-record your responses if you don't like them before submitting. There were about 10 questions that were behavioral and experiential type questions. If you are forwarded to the Hiring Manager then if selected they will call you for an in person interview. My interview was with two people the department manager and the lead. They asked about 10 questions similar to virtual interview but also more about your future plans and prior experience.  They also asked a real life OTJ in the OR situational question. \"Basically how would you handle this\"", "Interview Questions": "Describe a time you had to deal with a difficult person?"}, {"date": "24 Jun 2021", "title": "Senior Business Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Sentara in Jun 2021", "Interview Descriptions": "I had a great experience in the interviews, actually. I met first with the hiring manager for 30 mins, then had another hour long interview with her and the rest of the team the position supported. I was told I would hear back the following week with an answer. I let that week pass, then reached out to both the hiring manager and recruiter asking for an update. I got an email back from the recruiter saying they would look into it, and then when I checked back in I never heard anything. I had a great experience in the interviews so would definitely reapply, but was disappointed with lack of communication at the end of the process.", "Interview Questions": "Based on the position description, what do you think is a good fit about it, and what do you think will be a challenge for you?"}, {"date": "1 Jul 2021", "title": "Clinical Nurse Educator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Sentara (Chesapeake, VA) in Jun 2021", "Interview Descriptions": "Applied online, HR made contact in 24 hrs and asked some screening questions, interview set up with the manager in a week. interview done with the manager and someone from the team. further interview with the team was requested the following week requesting a presentation. ------------------------------------------------------------------------------------------", "Interview Questions": "provide an example of going above and beyond for a customer"}, {"date": "1 Jun 2021", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Sentara (Virginia Beach, VA) in May 2021", "Interview Descriptions": "Managers were very helpful and open about describing the environment and expectations. Floor tours and shadowing were offered as well as meeting other staff. Detailed description of orientation and preceptor were given. As a new grad questions were more based on personality, work ethic, etc rather than clinical knowledge or judgement.", "Interview Questions": "How do you handle disgruntled patients/families?"}, {"date": "28 Apr 2021", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Sentara", "Interview Descriptions": "It went well and was very informative. I felt prepared for every question and answered honestly. The interviewer was very professional and extremely nice. knowing I was a new nurse she asked the appropriate questions for new graduates.", "Interview Questions": "How did you handle a situation with a coworker?\nHow would your previous boss describe you?\n"}, {"date": "22 Apr 2021", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Sentara (Virginia Beach, VA) in Apr 2021", "Interview Descriptions": "Applied for New Grad RN position. Recruiter set up interviews based on my initial virtual interview and interests. Interviewed by team coordinators/unit managers in-person. All were professional and the interviews went well.", "Interview Questions": "Can you tell me a time where you resolved a conflict with a patient?"}, {"date": "28 Aug 2021", "title": "Patient Access Representative Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at Sentara (Williamsburg, VA) in Apr 2021", "Interview Descriptions": "It was easy very informative. The interview process was short in one person on the panel after the interview I got a tour of the department met the staff and others that work for the group it was a lot of information", "Interview Questions": "Tell me about yourself . "}, {"date": "5 May 2021", "title": "Css Technician Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Sentara (Norfolk, VA) in Apr 2021", "Interview Descriptions": "Applied online, got a call back to schedule an interview in person. Met with two people for the interview. They asked very standard interview questions. Interview process would have been a positive experience, had the recruiter I set up my interview with told me the CORRECT hospital to go to.", "Interview Questions": "Tell us about yourself. \n\nTell us about your attention to detail. \n\nTalk about a time where you dealt with a difficult customer. "}, {"date": "25 Mar 2021", "title": "Sterile Processing Tech Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Sentara", "Interview Descriptions": "A digital interview followed with an in person interview by the supervisor and team members. Very professional, organized, and thoughtful questions. Very good follow up.  Team atmosphere really shines through.", "Interview Questions": "Questions pertained mostly to how you handle the kind of fast paced and changing environment that you'll encounter in a field like Sterile Processing. "}], [{"date": "22 Mar 2021", "title": "Nursing Care Partner Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Sentara", "Interview Descriptions": "Filled out app on a Thursday and received my 1st email Friday. They are just rolling in slowly for interviews. Have one phone interview and one recorded. I have not done it as yet.", "Interview Questions": "Describe what you think a nurse care partner does. "}, {"date": "20 Aug 2021", "title": "Clinical Exercise Physiologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Sentara (New York, NY) in Mar 2021", "Interview Descriptions": "One way interview and then follow up interview. One way interview was sent and looked into by the hiring manager and then shortly after got an email for a follow up interview. Basic and formal questions, very straight forward and not intimidating.", "Interview Questions": "Tell me a time where you had constructive criticism and how did you react to it?"}, {"date": "11 Feb 2021", "title": "RN New Grad Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Sentara", "Interview Descriptions": "Fast, Interviewed by multiple nurse leaders, they were very friendly & informative. They answered all of my questions and more. felt confident & not judged. Hope I hear back. Sounds like a great place to work for.", "Interview Questions": "What field are you interested in. "}, {"date": "3 Feb 2021", "title": "Clinical Lab Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Sentara (Woodbridge, VA) in Feb 2021", "Interview Descriptions": "This was a phone interview and it lasted for about 30 minutes.  It was very smooth and straight forward.  The interview jumped straight to it. The first question asked was \"Tell me about yourself\". Last set of questions asked about expectations from staff and upper management.", "Interview Questions": "What is your 5 year plan"}, {"date": "3 Feb 2021", "title": "Clinical Lab Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Sentara", "Interview Descriptions": "I had an in person interview, there was a long list of interview question that were asked but overall it was a pleasant experience but some of the question were a bit repetitive and difficult to answer they made a decision within the next week.", "Interview Questions": "What would you do if your coworker was not pulling their weight in the workplace "}, {"date": "20 Apr 2023", "title": "Patient Access Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Sentara (Norfolk, VA) in Jan 2021", "Interview Descriptions": "It went incredibly smooth and fast. I didn't feel the need to reach for unreasonable answers. The interviewer's were incredibly nice and made me feel very welcomed. It was definitely a confidence boost", "Interview Questions": "What makes me different from everyone else"}, {"date": "14 Dec 2020", "title": "Speech-Language Pathologist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Sentara", "Interview Descriptions": "The interview was automated, so it felt more like a screening than an in-person interview. They provided a list of questions (7 or 8 total) and asked to record responses. 30 seconds preparation for each question were given and re-recording was allowed, if need be.", "Interview Questions": "Describe a time when paying attention to detail paid off."}, {"date": "30 Sept 2020", "title": "Licensed Practical Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Sentara", "Interview Descriptions": "You apply for position  Then you talk  to recruiter. Interview is set up. You talk to office manager. You should hear something within a week or later. Good luck with it.", "Interview Questions": "Tell us about difficult patient experience "}, {"date": "13 Nov 2020", "title": "Online Interview Process Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Sentara (Norfolk, VA) in Oct 2020", "Interview Descriptions": "I participated in Sentara's video recording interview process. I understand they are a large corporation that needs to streamline interviews, but it felt uniquely impersonal and absorbed more time than I expected. I'm not sure in person interviews are something technology can replace!", "Interview Questions": "Provide an example of a time you had to perform multiple tasks at once, and how you were able to accomplish them."}, {"date": "25 May 2021", "title": "Talent Aquisition Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Sentara in Oct 2020", "Interview Descriptions": "The staff was engaging, friendly, and communicative. The interview process was straightforward and not intimidating. The initial interview was a one-way virtual interview that allowed you to record multiple attempts and view your responce.", "Interview Questions": "Please tell me about yourself."}], [{"date": "29 Oct 2020", "title": "Guest Relations Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Sentara (Hampton, VA) in Oct 2020", "Interview Descriptions": "Had a digital interview where you record yourself with about 3 questions that are asked. Then you will go complete a in-person one once they have reviewed your answers from the digital interview.", "Interview Questions": "Why would you want to work for us?"}, {"date": "31 Aug 2021", "title": "NCP/Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Sentara (Woodbridge, VA) in Sept 2020", "Interview Descriptions": "1 phone interview and 1 video interview. Drug screen, background check, and communication with the unit manager prior to starting training. 2 weeks of training on the clinical floor with preceptor with a lot of skills not applied in all clinical settings in the state of Virginia.", "Interview Questions": "How did you adapt to change in the work setting "}, {"date": "29 Sept 2020", "title": "Phlebotomist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Sentara (Norfolk, VA) in Sept 2020", "Interview Descriptions": "The application online was pretty simple and straight-forward.  After maybe a week, I got notified for an interview and was directed to do it before a certain date.  The process was smooth and now waiting to see what happens.", "Interview Questions": "When was a time you had a difficult situation, and how did you overcome it?"}, {"date": "28 Sept 2020", "title": "Admitting Representative Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Sentara (Woodbridge, VA) in Aug 2020", "Interview Descriptions": "There were online assessments, an online interview that was recorded with four questions,  then a phone screening, then an in person interview with three people. I am fine with waiting but they don't follow timelines or answer calls. My interview experience was very positive with excellent feedback but there was no full time day positions and I haven't heard anything encouraging (at interview they indicated they were just waiting for a full time position to open) or any feedback since. I was excited interviewing since the positive culture there is very obvious but I am looking elsewhere due to the lack of feedback. FYI I was overqualified but looking to change industries.", "Interview Questions": "What is customer service to you?"}, {"date": "4 Apr 2020", "title": "Human Resources Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. The process took 2 months. I interviewed at Sentara", "Interview Descriptions": "I had to interview with 9 people before I was offered the job. And it took several weeks for recruitment to contact me. The entire process took way too long", "Interview Questions": "I can’t even remember. I do remember the questions seemed canned and did not allow for a discussion or dialogue"}, {"date": "19 Feb 2020", "title": "EMT-B Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Sentara", "Interview Descriptions": "Pretty clean cut and clear.The interview was pretty straight cut. I got an offer the same day. The hiring manager was very responsive.The hiring manager was very responsive. I was nervous before but after talking to hiring manager I was relieved.I applied online. Was emailed to make an interview. The interview was pretty straight cut. I got an offer the same day. The hiring manager was very responsive. I was nervous before but after talking to hiring manager I was relieved.", "Interview Questions": "Tell me about yourself?"}, {"date": "11 Jan 2020", "title": "Licensed Practical Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Sentara", "Interview Descriptions": "Had a brief phone interview with a recruiter then had an in person interview with the office manager and 3 people from Sentara HR. Got offered the position roughly a week later. Then had to complete background check, health screening and submit references. I started orientation roughly a month after the initial interview.", "Interview Questions": "What would your former managers say about you? "}, {"date": "23 Mar 2022", "title": "Clinical Exercise Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Sentara (Virginia Beach, VA) in Nov 2019", "Interview Descriptions": "It was overall not stressful at all it was nice to sit down and really have a good conversation with the manager and also the district manager. It was put together well and also very organized.", "Interview Questions": "What is a way I can develop a sense of teamwork within the clinic "}, {"date": "30 Jun 2022", "title": "Nursing Care Partner Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Sentara (Norfolk, VA) in Nov 2019", "Interview Descriptions": "Process took about a week. I interviewed on a Tuesday, and received an offer the following Monday. After my interview I set up a shift to \"shadow\" the unit for a couple hours to stand out more.", "Interview Questions": "How would you handle a difficult patient? "}, {"date": "8 May 2021", "title": "manager in healthcare Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Sentara (Norfolk, VA) in Nov 2019", "Interview Descriptions": "Almost 1 month of interviews. Overall, fair communication with recruiter. Not sure if the delays were because of the hiring manager or the recruiter.  Job offer was negotiated and I received a higher salary.", "Interview Questions": "Leadership style and behavioral based questions. "}], [{"date": "15 Oct 2019", "title": "Physical Therapist Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Sentara", "Interview Descriptions": "The interview process is very straight forward. First you will receive a call from HR as your \"first\" phone screen interview. Then, you will get a second call from the supervisor of the position you applied for. From there, you will schedule an in-person interview with the supervisor.", "Interview Questions": "Describe a time when you went above and beyond?"}, {"date": "6 Mar 2023", "title": "Administrative Secretary Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at Sentara in Oct 2019", "Interview Descriptions": "Applied online. Received a “quick” phone call that was really 3-5 short interview questions, including salary expectations. This was followed by a one-hour, in-person interview with my direct supervisor. Offer came afterward via phone.", "Interview Questions": "Describe a time where you had to deliver bad news to an employee and/or customer."}, {"date": "27 Sept 2019", "title": "Monitor Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at Sentara (Williamsburg, VA) in Aug 2019", "Interview Descriptions": "It was laid back and comfortable. My manager was personable and unassuming.  The phone interview was from her home phone and she was working from home because of family problems.  She didn’t want to miss my interview.", "Interview Questions": "How did you help a coworker?"}, {"date": "25 Jul 2019", "title": "Admitting Representative Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Sentara", "Interview Descriptions": "For my first phone interview I talked to Kara, very sweet lady. She mostly asked me how I would handle behavioral problems with patients. You will talk to Kara first and then she will pass your resume along to the appropriate manager.", "Interview Questions": "Can you tell me a time you made a mistake and how did you fix it?"}, {"date": "14 Jun 2019", "title": "Physician Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Sentara (Norfolk, VA)", "Interview Descriptions": "Several phone and in person interviews over a period of a month.  First interview with the human resources rep by phone, then phone with office manager, then in person with group, the one on one with lead physician.", "Interview Questions": "About my background"}, {"date": "18 May 2019", "title": "Business Analyst Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through other source. The process took 3 weeks. I interviewed at Sentara (Norfolk, VA)", "Interview Descriptions": "I applied for the job and received a link to a personality test. Once I completed the personality test,  I received a streaming interview invitation.  Then I received a phone call.", "Interview Questions": "What are some of the tools I use as a business analyst?"}, {"date": "29 May 2019", "title": "Patient Care Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Sentara (Elizabeth City, NC) in May 2019", "Interview Descriptions": "I received a call on Thursday and following Tuesday was my interview. Was very nervous since it has been a long time going to one, but the interview was actually easy and laid back. My advice is to just be yourself and don't let your nerves get the best of you!", "Interview Questions": "Where do you see yourself in five years?"}, {"date": "17 Jan 2019", "title": "Lpn Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Sentara (Williamsburg, VA) in Jan 2019", "Interview Descriptions": "the first  interview was approxiamely 30 minutes. The people that worked in the doctor office was extremely friendly, the atmosphere was very inviting. I got interviewed by 3 people. they were very friendly. I was also given a tour around the doctor office/", "Interview Questions": "how well do you work under stress?"}, {"date": "27 Jan 2019", "title": "Certified Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Sentara (Suffolk, VA) in Jan 2019", "Interview Descriptions": "The interview process is pretty straight forward.  A character assessment is completed and based on those responses, a virtual interview link with directions is provided. The virtual interview is an experience for sure, but I liked it. The virtual interview is a great way to answer all of the basic and generic questions before having an interview in person.", "Interview Questions": "Why did you want to become a medical assistant?"}, {"date": "7 Dec 2018", "title": "Integated Care Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Sentara (Chesapeake, VA) in Dec 2018", "Interview Descriptions": "Applied on the Sentara website, received an invitation for a video interview (via Interview Stream) a week later. After the virtual interview was completed I received another invitation for an in person interview approximately a week later. After attending the in person interview I was offered the position by the recruiter a day later.", "Interview Questions": "The panel asked me questions off a pre-printed form such as describe how you deal with a stressful situation, explain a time you went above and beyond in a situation, etc."}], [{"date": "19 Dec 2019", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at Sentara (Virginia Beach, VA) in Oct 2018", "Interview Descriptions": "Once you apply to a floor, you're contacted by a recruiter who gets your demographics and matches you up with different floors based on staffing needs.\r\n2:1 interview with unit manager and unit cordinator. No technical questions, just discussing basic mechanics of floor and goals going forward in nursing.", "Interview Questions": "Where do you see yourself in 5 years."}, {"date": "18 Aug 2018", "title": "Ultrasound Technologist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 6 days. I interviewed at Sentara (Norfolk, VA) in Aug 2018", "Interview Descriptions": "4 step process with 1 Program Manager is the first part of interview what asks specific questions about job, 2 Peer interview asks questions about the day to day process in sonography, 3 Scanning Interview was aked to do an abdomen complete as my scan interview, 4 Shadowing process", "Interview Questions": "A mistake you made with a patient, and how did you correct it."}, {"date": "11 Jul 2018", "title": "Team Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Sentara", "Interview Descriptions": "The process was generic with the manager and one team member conducting the interview.  The interview questions are “behavior based” and designed to give an idea of how the candidate would act in various situations.", "Interview Questions": "Describe a time when things didn’t go as planned. What did you do to correct the situation? "}, {"date": "17 Jun 2018", "title": "Food Service Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Sentara (Norfolk, VA)", "Interview Descriptions": "Friendly, and informative about work and what would be expected of me, open and willing to answer any questions I had. I dont know what else to put just need to fill in the space for the 30 word minimum.", "Interview Questions": "My favorite dish to cook"}, {"date": "13 Jun 2018", "title": "Project Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 3 weeks. I interviewed at Sentara (Virginia Beach, VA) in Jun 2018", "Interview Descriptions": "30 minute initial phone interview. The interviewer was late, waited until half-way through the meeting to introduce himself with title. He asked 2 questions, I answered them, he ended the interview early. I was working with a recruiter to get the interview. I found out due to the fact I answered the questions verbose, not with concise answers, he did not like that so he ended the interview and eliminated me from the process. The interview process was a negative experience and reflected badly on Sentara, and the interviewer.  Just be careful when you interview with Sentara, I wish I could give advice how to answer the questions but I cannot.", "Interview Questions": "How did you evaluate risk in previous projects. "}, {"date": "18 Aug 2022", "title": "Licensed Practical Nurse (LPN) Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Sentara (South Boston, VA) in Jun 2018", "Interview Descriptions": "Interview process has changed now for the better. When I was interviewed in 2016, there was a lot of favoritism shown and if you knew someone who worked there, you got the job. Interview lasted like 30 minutes and I was asked a few common questions (Strengths, Weaknesses, etc..)", "Interview Questions": "Tell us why you want to work here?\nDescribe a time you went above and beyond?\nWhat are your strengths and weaknesses?"}, {"date": "16 Mar 2019", "title": "Admitting Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Sentara (South Boston, VA) in Jun 2018", "Interview Descriptions": "It was a length process. I applied in June and had to do a video interview in July. The a 2:1 interview about 2 weeks later. The manager and the department manager were present. The on-boarding process is long also. Getting the required reference surveys finished in time proved to be a task.", "Interview Questions": "What do you are your plans while working at Sentara?"}, {"date": "17 Aug 2022", "title": "Physical Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Sentara in May 2018", "Interview Descriptions": "Easy.  Worked with a recruiter over the course of a couple of weeks.  Completed a phone interview.  Later I received a phone call from the hiring manager.  The recruiter walked me through the entire process and was very pleasant.", "Interview Questions": "Why do you want this position"}, {"date": "17 Mar 2018", "title": "Radiologic Technologist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Sentara", "Interview Descriptions": "Very pleasant. Interviewed at an outpatient facility. Lasted about an hour. Walked through the department and met employees. Said to email them with anymore questions. I did never got a response back. They then filled the position and didn’t bother to let me know, I found out via online. They just seemed very genuine but I guess they found what they were looking for in someone else. Happy for that person because it’s hard to get a job.", "Interview Questions": "Do you work well with others?"}, {"date": "3 Feb 2018", "title": "Patient Care Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Sentara (Harrisonburg, VA)", "Interview Descriptions": "Phone screening interview  from corporate. Then and in person interview with two or more managers and or member of team. You will then get a follow up call from HR who will discuss salary/benefits, start date and details on orientation", "Interview Questions": "What are best qualities? "}], [{"date": "20 Jan 2018", "title": "Nursing Care Partner Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Sentara", "Interview Descriptions": "I received two phone call interviews since I am not living in state until end of my service and got offered a position within a week of completing both phone interviews. I was happy that they are willing to work with me even though I am not in area until my enlistment ends in 3 weeks!", "Interview Questions": "Q: Name a time when you dealt with a really difficult customer and how you resolved this issue?"}, {"date": "12 Aug 2020", "title": "Marketing Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Sentara (Norfolk, VA) in Jan 2018", "Interview Descriptions": "The interview process was a total of four rounds:  first with a recruiter, then an intro with the hiring manager, a team intro and finally a presentation open to the entire corporate marketing team. The process was fast, fair, and challenging.", "Interview Questions": "What are your greatest strengths?"}, {"date": "27 Nov 2017", "title": "Financial Analyst Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Sentara", "Interview Descriptions": "I got a call for a face to face.  2nd interview was to meet the current staff. Finally I received  a call back with a job offer. I was straight forward with my experience", "Interview Questions": "Whats the most difficult task you've done and how did you approach it?"}, {"date": "18 Oct 2017", "title": "Administrative Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Sentara (Chesapeake, VA) in Oct 2017", "Interview Descriptions": "The hiring process was fast, I applied online and was called by a recruiter within the next day she asked me 5 questions mainly about my strengths and weaknesses, my past jobs, and relationships. A day later I got a call for the formal interview, it took about 20 minutes with a tour at the end.", "Interview Questions": "Name a time at work where you had a problem with a coworker and what you did to resolve the situation."}, {"date": "18 Sept 2017", "title": "Admitting Representative Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Sentara (Norfolk, VA) in Sept 2017", "Interview Descriptions": "I received a phone call  on Friday to schedule a phone interview.  Scheduled the phone interview for Monday, but never received a phone call. \r\nTried to get in contact with them and there's no way of doing so. The only number listed is an automatic service number that doesn't allow you to speak to anyone. \r\nI've never experienced anything so unprofessional in my life.", "Interview Questions": "What are  your strength and weakness"}, {"date": "5 Aug 2017", "title": "Certified Surgical Technologist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Sentara (Virginia Beach, VA)", "Interview Descriptions": "Open interview for interested new grad rns, tech, etc.. Interviewed with a recruiter who took my resume, asked a few questions, and left to speak with a manager. Recruiter was not interested in the positions I applied for within the hospital system.", "Interview Questions": "What was the most important part of the job?"}, {"date": "10 Aug 2017", "title": "Transplant Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Sentara (Norfolk, VA) in Aug 2017", "Interview Descriptions": "This was a bogus process . I had multiple phone interviews and a webex interview with 2 different departments only to find they were using me, a highly qualified candidate to talk down another offer with a less qualified person. I wasted weeks on this job when I could have had multiple other interviews.", "Interview Questions": "What is your description of the position? "}, {"date": "2 Sept 2017", "title": "Lpn Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Sentara (Virginia Beach, VA) in Aug 2017", "Interview Descriptions": "I applied online. I received an email from a recruiter asking when was a good time to call. I emailed back because I was out of town. When I returned, I called her and I had an on the spot phone interview. My resume was forwarded to 2 open positions. I received a call from both managers that day. I set up interviews. I went to the first one and was interviewed by 4 different people that worked there. I was offered the position. I accepted.", "Interview Questions": "What was your response when you offended another person's culture on accident?"}, {"date": "13 Jul 2017", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Sentara", "Interview Descriptions": "Phone interview was quick to set up. Recruiter was very helpful in coordinating the in-person interview that followed the phone interview as well as answering any questions you may have about the position.", "Interview Questions": "Tell me a time you went above and beyond for a patient. "}, {"date": "31 Jan 2020", "title": "Monitor Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Sentara (Virginia Beach, VA) in Jul 2017", "Interview Descriptions": "Applied online. Was contacted by human resources for an over the phone interview. Human resources then scheduled an in person interview at the location I applied to. I had an interview with Director and Supervisor. I was asked about my strengths and weaknesses.", "Interview Questions": "What are some of your weaknesses"}], [{"date": "5 Aug 2017", "title": "Human Resources Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Sentara (Norfolk, VA) in Jul 2017", "Interview Descriptions": "I applied online. A couple of weeks later I received an email invitation for a virtual interview. I was able to complete the interview at my convenience which was nice. It was a little difficult to get the program to recognize my web cam & record my responses. It was 8 questions total some of them displayed on the screen & others pre-recorded. I did like the fact that I did not have to take time off my current position to travel to an interview, especially considering it is 3 weeks later. I assume I am not getting a call for a face-to-face.", "Interview Questions": "How do you deal with difficult people?"}, {"date": "22 May 2017", "title": "MA Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Sentara", "Interview Descriptions": "3 panel interview. There was an office manager, another MA and a PA. The PA was cocky and was very nasty. Management is horrible, they tell you anything just to get the position filled.", "Interview Questions": "They asked me about my skills."}, {"date": "19 Jun 2017", "title": "Nursing Care Partner Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at Sentara (Virginia Beach, VA) in May 2017", "Interview Descriptions": "Hiring manager walked me through the unit then we sat in her office. We talked about the benefits, hours and time off, and the expectation of a Nursing Care Partner.", "Interview Questions": "How important is communication between you and coworkers?"}, {"date": "26 May 2017", "title": "Admitting Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. I interviewed at Sentara (Virginia Beach, VA) in May 2017", "Interview Descriptions": "The interview was very laid back and relaxed. I was interview by manager and lead and they both seemed really nice. My interview was no more then 15 minutes long and it ended with a tour.  Before I even got home I got a call back saying I was hired.", "Interview Questions": "What is good customer service?"}, {"date": "7 Apr 2018", "title": "Registered Nurse Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 3 weeks. I interviewed at Sentara (Virginia Beach, VA) in Mar 2017", "Interview Descriptions": "Sentaras interview process was very nice. They do a great job.  Everything was great.  I would recommend just being yourself. Don't get nervous the staff is very friendly.", "Interview Questions": " What are your available hours"}, {"date": "25 Jul 2017", "title": "Patient Care Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Sentara (Harrisonburg, VA) in Feb 2017", "Interview Descriptions": "Interview with practice manager, drug screening, a health screening, and TB screening. There was also a tax screening and background check. Interview with current employee and practice manager, and about an hour of time to sit and observe the position.", "Interview Questions": "How have you handled stressful situations in your previous employment?"}, {"date": "25 Feb 2017", "title": "IT Help Desk Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Sentara (Fredericksburg, VA) in Dec 2016", "Interview Descriptions": "Very good in-person interview, the issue I have with the process is the feedback, no returned calls from the recruiters office after several voice mails left. The only way to check the status of the application is to check on the application page. After two months waiting they finally closed the position with no explanation. Most jobs I have interviewed with or the positions I have held the interviews myself, there is always a follow up call to the job seeker.", "Interview Questions": "Most of the questions revolved around past job history and why you are applying."}, {"date": "7 Nov 2016", "title": "Patient Care Technician Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Sentara (Arlington, VA)", "Interview Descriptions": "It took about three months from the moment I applied to being hired.  I submitted my application, and  then completed a questionnaire.  A month, almost two had passed before they made contact with me.  I had a brief phone interview, and then an in-person interview.", "Interview Questions": "Why do you want to work here?  What type of worker are you?  "}, {"date": "11 Oct 2016", "title": "Practice Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Sentara (Norfolk, VA)", "Interview Descriptions": "Director conducted informal screening on phone, first. Then personally interviewed for a casual discussion on my related background and how I can help. They weren't positive if another employee would be taking on this location in addition to existing duties.", "Interview Questions": "What was the biggest challenge to my most recent position?"}, {"date": "24 Sept 2017", "title": "Patient Care Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Sentara (Virginia Beach, VA) in Oct 2016", "Interview Descriptions": "I applied on indeed.com and got an email to complete my assessment. About two weeks later, I got a call from the practice manager to schedule a face to face interview. I was interviewed by the Nurse Coordinator and Practice Manager. I was asked a lot of situational questions. Lasted about an hour. I was told I would hear back within the week as they were still interviewing more people. I heard back on the very last hour of the day I was told I would hear from them and the practice manager said they still want to do another interview with the physician and nursing staff I would be paired up with to see if it's a great match. Depending how I did with them, they would then make a decision. I guess they liked me because I've been here for a year now.", "Interview Questions": "Reasons why I left previous employments. The physician and nursing staff went over my resume."}], [{"date": "23 Aug 2016", "title": "Scheduler Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 5 weeks. I interviewed at Sentara (Woodbridge, VA) in Aug 2016", "Interview Descriptions": "I applied for the position on 6/26/16 via online. I got a call from a recruiter on 7/14/16 where they briefly asked about my qualifications. They told me that they were forwarding my application to the hiring manager and they would call me in a few days to set up an interview. The hiring manager called on 7/25/16 and asked me some general scheduling questions and asked me to come in for an interview with her another manager and her team lead on 8/2/16. \r\nThe interview took about 40 min. Because they were running behind I was able to meet 4 other applicants interviewing for the same position. If you google \"example interview questions\", the top ten questions are the same exact questions you get in the interview...Why are you a good candidate? What is one flaw you see in yourself.....\r\nI felt like I did really well with the interview, however, it has been 3 weeks since the interview and I am probably not getting an offer. I really enjoyed the interview and I am sad I will not get to work with the ladies I interviewed with. They seemed to have a great team!", "Interview Questions": "If you google \"example interview questions\", the top ten questions are the same exact questions you get in the interview...Why are you a good candidate? What is one flaw you see in yourself....."}, {"date": "22 Aug 2016", "title": "Registered Nurse ICU Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Sentara (Virginia Beach, VA) in Aug 2016", "Interview Descriptions": "I received a call by recruiter who gave me a phone interview. Asked about skill set and experience. Interview set up through recruiter. Waited in main area of hospital and the interviewing nurse we come to get you. Attend interview. About 30 minutes. Interviewed by 2 nurses. Very casual and laid back atmosphere. Walked through icu with nurses. Wait for call back.", "Interview Questions": "What makes you feel like you would be good at this job?"}, {"date": "12 Oct 2016", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Sentara (Norfolk, VA) in Aug 2016", "Interview Descriptions": "I applied online and was contacted by a Sentara nurse recruiter for a phone interview. After she asked some basic employee screening-type questions, she set up an interview with the nurse manager. I went in to shadow on the unit for a few hours and had the interview afterward with the manager and CNS. Because I'm a new grad and don't have much experience in the specialty, most of my interview questions were behavioral and customer service-based. In exchange, I asked a few questions about orientation and new grad residency. Two days later I was offered the job.", "Interview Questions": "Why did you choose this specialty?"}, {"date": "14 Jul 2016", "title": "Senior Software Engineer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at Sentara", "Interview Descriptions": "The interview process was quite informal.  I met with the hiring manager once before interview day.  Additional, I had one formal day of three interviews, two with managers and one with team members.  The questions were a combination of culture fit and technical questions.", "Interview Questions": "Describe what a SQL Join is"}, {"date": "12 Jun 2016", "title": "Ecorp Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Sentara (Charlottesville, VA)", "Interview Descriptions": "Waited in the waiting room about 20 min and received an presentation about the job then met an interviewer. It was very casual and comfor table.she asked a general questions. The interview was very quick and simple but pleasant.", "Interview Questions": "Tell me about your experience with a difficult person. How did you handle it?"}, {"date": "29 Jun 2016", "title": "RN OR Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1+ week. I interviewed at Sentara (Harrisonburg, VA) in Jun 2016", "Interview Descriptions": "Went to a Sentara job fair. Managers were very nice and personable. Was able to get an interview scheduled for the next week. They spent some time answering my question and were very patient.", "Interview Questions": "Asked what shift I was interested in."}, {"date": "4 May 2016", "title": "Business Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 2 weeks. I interviewed at Sentara (Virginia Beach, VA) in May 2016", "Interview Descriptions": "I had a brief phone screening, followed up by a 2 part in person interview with the manager then a panel interview with all the team leads. Was invited to do a video interview and was called back for another in person interview.", "Interview Questions": "Normal behavioral questions and technical skills."}, {"date": "28 Mar 2016", "title": "Administrative Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Sentara", "Interview Descriptions": "Applied on line.  Application sort of long. Person called and asked about my work history and stuff.  Had to take a typing test. Think I passed but they won't tell you.  Hope to get another interivew.", "Interview Questions": "Tell me when you had to work with a difficult person.  "}, {"date": "21 Aug 2016", "title": "Patient Care Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Sentara (Norfolk, VA) in Mar 2016", "Interview Descriptions": "Sentara usually has a 4 panel interview process, I only had a 2 panel. I was asked general interview questions. More of the questions were.\"Tell me about a time when.\" I also had to take a drug screen and do a typing test as well. The process only took a matter of days. I was in the process of graduating and Sentara not only hired me but they allowed me to do my extern hours as well to finish my course.", "Interview Questions": "Tell me about a time when you went over and beyond for a patient"}, {"date": "2 Jul 2019", "title": "Infection Preventionist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Sentara (Norfolk, VA) in Mar 2016", "Interview Descriptions": "Two interviews, the first one was with Vice President of Medical Affairs, and the next one with quality, safety, regulatory staff and directors.  The system director of Infection Prevention also interviewed me.", "Interview Questions": "Why do you want to work here?"}], [{"date": "19 Apr 2016", "title": "Admitting Representative Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Sentara (Woodbridge, VA) in Feb 2016", "Interview Descriptions": "Spoke with the Supervisor and department head, they were very friendly and made me very comfortable.  Interview lasted approximately 1 hour.\r\n\r\nNumerous applicants for the position as benefits are offered for part time employees.", "Interview Questions": "Basically how I would handle numerous situations. They read off a piece of paper that I am assuming were pre determined questions."}, {"date": "4 May 2016", "title": "Ecorp Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Sentara in Feb 2016", "Interview Descriptions": "The hiring process for Sentara Healthcare was very thorough. It was a very pleasant process, it was handled quickly and efficiently. The interview asked many questions but all were very relevant to the position.", "Interview Questions": "How are you able to handle multiple tasks at once?"}, {"date": "19 Jan 2017", "title": "Nursing Care Partner Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Sentara (Hampton, VA) in Feb 2016", "Interview Descriptions": "HR called me day of application submitted. Interviewed a week later and offered job on spot. Great experience. Interview was very personable and great energy in the hospital. Everyone I encountered before and after the interview was very friendly.", "Interview Questions": "Tell me a bit about your experience?"}, {"date": "13 Sept 2016", "title": "Physical Therapist Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Sentara (Hampton, VA) in Feb 2016", "Interview Descriptions": "Three part interview process that spanned over a period of 2 weeks.\r\nFirst phone interview from Human Resources asking series of questions about your personality.\r\nSecond In-person interview with management reviewing a packet of system based questions/scenarios.\r\nThird Interview with care team.", "Interview Questions": "In what circumstance have you gone above and beyond for patient care?\r\n\r\nWhat would you consider to be your biggest flaw in the work place environment?\r\n\r\nWhere do you see yourself in your career path in 5 years?"}, {"date": "28 Jan 2016", "title": "Auditor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Sentara", "Interview Descriptions": "It was a video interview with computer generated questions. Very cold and no way they can get a true feel for the person interviewing. The instructions were four pages long for a 11 question interview.", "Interview Questions": "There were no difficult questions. "}, {"date": "3 Jan 2016", "title": "Cath Lab Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Sentara", "Interview Descriptions": "Very easy! Hr called did general info interview. Then manger called for face to face interview. Met staff and was able to talk with them. Met a doctor. Got a tour. Got offer during interview. Best interview I have had. I enjoyed the people", "Interview Questions": "How do handle stressful exams?"}, {"date": "8 Aug 2016", "title": "AR Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Sentara (Norfolk, VA) in Jan 2016", "Interview Descriptions": "Applied online, got a call a few weeks later, they set up a phone interview, if you do good on the phone interview then you get a in office interview. If you do good then you wait a week or so and get a callback telling you do you accept the job or not.", "Interview Questions": "What is a time you had to deal with a irate customer."}, {"date": "12 Jan 2016", "title": "AR Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Sentara (Norfolk, VA) in Jan 2016", "Interview Descriptions": "I submitted my resume on 2 days ago and got a call from their recruitment office today!!!!! I am scheduled for a phone interview tomorrow morning. I can't wait. I hope they offer good pay.", "Interview Questions": "How much experience in medical billing and claims follow-up do I have."}, {"date": "19 Aug 2020", "title": "Psychiatric Emergency Team Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Sentara (Arlington, VA) in Jan 2016", "Interview Descriptions": "years of experience, multiple scenarios, Emerency Custody Order process and procedures, legal issues, ethical issues,  find bed at another hospital, mental health evaluation documentation, credentials, supervision, availability for other shift, number of nights available to work", "Interview Questions": "Can you worked nights and weekends "}, {"date": "28 Jan 2020", "title": "Team Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Sentara (Norfolk, VA) in Jan 2016", "Interview Descriptions": "Can be brief or can be drawn out. Depends on the hiring manager and their desire to hire someone. Interviews can be one on one with manager or with group. Some managers will conduct both.", "Interview Questions": "Tell me something about yourself."}], [{"date": "12 Sept 2017", "title": "Director Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Sentara (Virginia Beach, VA) in Jan 2016", "Interview Descriptions": "Executive/management positions are pre-screened by H.R. and only a handful of top candidates get a face-to-face interview (if you get a face-to-face for an executive/management position - you are one of a few candidates).", "Interview Questions": "Tell me how you manage physician relations?"}, {"date": "25 Oct 2015", "title": "OTR Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. I interviewed at Sentara (Norfolk, VA)", "Interview Descriptions": "The interview process with Sentara healthcare, including hiring process, is quite thorough. But it is also flawed in many ways. There are too many positions involved, including a recruiter, management, sub management, peers. It is very difficult and lengthy to manage the process, from a candidate, and a lower management perspective.", "Interview Questions": "Past conflicts"}, {"date": "6 Jun 2019", "title": "Admitting Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Sentara (Norfolk, VA) in Oct 2015", "Interview Descriptions": "Applied online,  received a email for a Brief automated video interview where you record your responses.  then in person interview  with two people from management.  Drug test, background check, fit test", "Interview Questions": "How do you handle stressful situations "}, {"date": "16 May 2016", "title": "ECorps Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at Sentara (Harrisonburg, VA) in Oct 2015", "Interview Descriptions": "Mass interview and selection pool, took us through the basics of the job, what might be expected, and introduced us to the proper people. 15 minute one on one interview process that went through the normal interview questions, i.e. how did you hear of us? what are your qualifications and so on and so forth.", "Interview Questions": "Tell me of a time you dealt with a difficult personality and how you handled the situation"}, {"date": "26 Oct 2015", "title": "Finance Consultant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Sentara (Norfolk, VA) in Sept 2015", "Interview Descriptions": "Interview with hiring manager, director, and current team of employees. Asked basic interview questions along with more specific questions designed to weed out people not fit for the role.", "Interview Questions": "What experience do you have giving presentations in front of senior management?"}, {"date": "11 Aug 2015", "title": "Phlebotomy Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Sentara (Virginia Beach, VA)", "Interview Descriptions": "Laid back I interviewed with HR and then the department manager. They asked a lot of situational questions.  Typical three weakness and three strength questions.  They gave me a tour of the area and I heard from them the following week with a job offer.", "Interview Questions": "Situational questions."}, {"date": "2 Feb 2016", "title": "COTA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Sentara (Virginia Beach, VA) in Aug 2015", "Interview Descriptions": "informal. manager and people were very easy going and approachable. Casual dress. Interviewd by 2 people at one time. Team leader and manager both chose to ask questions. I would recommend anyone to work for this company. It will definitly be a worth while experience be it for learning or to build your resume.", "Interview Questions": "What do you look for in a manger? What are your expectations in working here with productivity?"}, {"date": "14 Sept 2015", "title": "Nursing Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Sentara (Virginia Beach, VA) in Aug 2015", "Interview Descriptions": "Lunch interview and very few questions were asked. It was more like I was holding the interview. The two interviewers seemed as if they were not prepared to interview me and one was late to the interview so we had to rehash what was previously discussed.", "Interview Questions": "Why are you seeking this job?"}, {"date": "15 Feb 2016", "title": "Licensed Practical Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Sentara (South Boston, VA) in Aug 2015", "Interview Descriptions": "The hiring process was great. The administrator was educated and professional. The facility was very presentable and the office staff was very welcoming. The interview was straight to the point and quick.", "Interview Questions": "Why I felt like I would be an asset to their company"}, {"date": "31 Aug 2015", "title": "Nursing Care Partner Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Sentara in Aug 2015", "Interview Descriptions": "Received a call Friday for a phone interview gentleman said he would send my application to the hiring manager ten mins later received a call from hiring manager for an interview the following Monday. Went to the interview was given a tour of the floor was asked 5 normal interview questions was offered the job on the spot", "Interview Questions": "How do you handle talking to a supervisor in the work place?"}], [{"date": "22 Jul 2015", "title": "Environmental Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Sentara (Clarksville, VA)", "Interview Descriptions": "1. Phone Interview\r\n2. Face to Face Interview\r\n3. Reference Check\r\n4. Background Check\r\n\r\nThe interview process was positive but became vague and slow at times. The position was placed on hold and then had closed a week prior to the reference and background check without notice.", "Interview Questions": "How would you describe your work ethic?"}, {"date": "13 Aug 2015", "title": "Patient Care Representative Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Sentara (Norfolk, VA) in Jul 2015", "Interview Descriptions": "My interview process was over the phone & on the computer via telecommunications,  I felt that the interview process went very well the only thing that was difficult was to clearly hear everything that was said because of the computer connection.", "Interview Questions": "Why was I looking to relocate?"}, {"date": "28 Jul 2015", "title": "Material Handler Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Sentara (Norfolk, VA) in Jul 2015", "Interview Descriptions": "There was an interview scheduled but before I actually was able to speak with anyone they filled the position. It took over a week for them to get back to me to even let me know.", "Interview Questions": "When can you come in?  We will get back to you with the time and specific day."}, {"date": "12 Jun 2015", "title": "CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Sentara (Norfolk, VA) in Jun 2015", "Interview Descriptions": "First they emailed me soon after I applied online saying that they had received my application and that it'll be a week at the most for someone to look over it. They called me with the over the phone interview and it seemed easy and I was accepted then they set up another interview but this time it was a one on one in person. When I arrived I wasn't waiting long and the one on one was easy but it was harder then the phone interview maybe because I was just nervous.", "Interview Questions": "Why did you consider healthcare work ?"}, {"date": "5 Jun 2015", "title": "Clinician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Sentara (Virginia Beach, VA) in May 2015", "Interview Descriptions": "It was thorough and I actually enjoyed it. All open ended experiential questioning that sought to see if applicant's experience was remotely close to the position's requirements. The interviewers were very particular in their line of questioning, but did a wonderful job in allowing me to be myself and not structuring the interview like a formal interview.", "Interview Questions": "What was an unethical task a supervisor or coworker has asked you to carry out and what was your response."}, {"date": "19 Apr 2015", "title": "Licensed Practical Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Sentara (Norfolk, VA) in Mar 2015", "Interview Descriptions": "Applied and got a call from HR the next day. Was selected to interview with the Nurse Manager of facility two days later. She hired me on the spot! HR called back to set up Occupational Health and paperwork appointments. I was set up for orientation the following week. Process took 2 weeks from initial interview. Everyone was courteous and I felt very welcomed by the company.", "Interview Questions": "Name a time you worked as part as a team. "}, {"date": "11 Oct 2017", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Sentara in Jan 2015", "Interview Descriptions": "Simple and straight to the point.\r\nBasic questions, non-clinical. Mostly behavioral. The process itself should be completed within a month. Between HR and setting up an interview and hearing back from the company.", "Interview Questions": "Why did you choose Sentara?"}, {"date": "19 Aug 2015", "title": "Floor RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Sentara (Norfolk, VA) in Dec 2014", "Interview Descriptions": "Interview with manager and their superior, asked questions relating to past experience and what goals were to be achieved from this job; required to be with another nurse prior to offer being made to see if the job was something that I would like", "Interview Questions": "why did you become a nurse, how do you feel about charting"}, {"date": "30 Oct 2014", "title": "Emergency Department Technician Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2+ months. I interviewed at Sentara", "Interview Descriptions": "Online application process only. After applying for the position you MUST stay on top of HR to make sure your application gets to the nursing manager of the department for review. It is almost impossible to speak to someone from HR at the time of your call the best thing to do is ask for the recruiters email and also ask to be forwarded to their voicemail. They tend to be good about getting back via email.  Most positions for Technicians are limited in the amount of openings per year so they have several applicants to sift through it is a great help if you know someone on the inside to put in a good word. Once It took about three weeks for me to get a call for an interview after applying online. HR does not update your application status online on a regular bases so I had to call both HR and the department manger several times over the course of three weeks to make sure that my application was being reviewed and that I got an interview. Once you interview with the nurse manager they give you a tour of the department even if they already know you are not the one that they are going to choose. During the interview process they ask basic questions such as previous work experience and how well did you get along with employees at your previous job. After you interview with the nurse manager if they are interested in hiring you they will set up a time to do a peer interview with other nurses and techs from the floor usually 1-2 days after your manager interview. Peer interview consist on 3 people at different clinical positions. This process was about 15 mins and was casual. They tend to ask you about your previous work experience and why you chose to come to their facility and if you know anyone that currently works in the department. They also ask everyone that will be in a direct patient care position a scenario question about several different patients all needing something and which one is the highest priority and why. They will also want you to put the other patients in order from highest to lowest needs. After your peer interview they consult with the nursing manager to decide if they should offer you the position. The nursing manager asks the peer reviewers you greatest trait and weakest trait and do they think you will be a good fit for the department. Usually within a week the nurse manager will call to offer you the position, even if you are ready to accept it they will ask you to take 2-3days to think about it and call them with an answer, however they will not tell you how much it pays HR should have already given you that information during your first contact with them, if you do not get offered the position you will receive a letter in the mail thanking you for your time and encouraging you to continue to seek employment with the company. The company only does new hire orientation training twice a month/every other week so if you are hired there may be a weeks time before you even start. On average the whole interview process takes about a 1.5 weeks. However there have been people who have applied, interviewed and hired all with 3 days.", "Interview Questions": "What was one time when you made a mistake at work and how did you handle it? What would you say is your weakest quality when it comes to your job tasks?"}, {"date": "27 Oct 2014", "title": "Allied Health Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 days. I interviewed at Sentara", "Interview Descriptions": "They had me meet with others in the lunch/break room.  It was very informal and awkward sine they had no planned questions and did not even know I would be there.  I also felt like I was intruding on their lunch.", "Interview Questions": "N/A"}], [{"date": "20 Sept 2014", "title": "Operations Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2+ months. I interviewed at Sentara in Sept 2014", "Interview Descriptions": "The process took 2 weeks.  I applied on Sentara's website. Recieved a call two days later from HR to do a quick interview over the phone. Answer  a couple of behavior questions. Interview was about 5 minutes long. HR person stated she would forward my application to the hirirng manager. I recieved a call from the hiring manager to come in for an interview the next couple of days. Interview with the hiring manager went well she was in a hurry to hire because she wanted to get the hired person trained with the person who was leaving.  Received a call from HR with an offer the next week.", "Interview Questions": "There were no difficult question.  Unexpected question was did I know medical terminology"}, {"date": "25 Jul 2014", "title": "Senior Account Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Sentara (Norfolk, VA)", "Interview Descriptions": "I knew they were interviewing so I went in for an interview. They told me that I was not registered to be there. They asked me to wait and they put me in a slot because someone did not show up for the interview. I was interviewed by 2 supervisors. Shortly afterwards I got a call saying I was hired. The people seemed nice and the process was very quick and easy going.", "Interview Questions": "The most difficult question was why I wanted to leave my current employer."}, {"date": "20 Jun 2018", "title": "Lab Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Sentara (Norfolk, VA) in Apr 2014", "Interview Descriptions": "What will it take to perform this task? What kind of person is this company looking for?\r\n\r\nIt will require good communication and interpersonal skills, and the ability to interface with a diverse group of people and levels. If these are your areas of strength, focus on letting the interviewer know that you have the ability and experience to interface well with many different groups.\r\n\r\nLike the speechwriter, you want your audience to remember the important points you have made. By concentrating on a handful of strengths, you will find that you are more focused and succinct about telling what you have to offer. More importantly, the folks you meet are more likely to remember you for your strengths.", "Interview Questions": "Basic interview questions:\r\nTell me about yourself.\r\nWhat are your strengths?\r\nWhat are your weaknesses?\r\nWhy do you want this job?\r\nWhere would you like to be in your career five years from now?\r\nWhat's your ideal company?\r\nWhat attracted you to this company?\r\nWhy should we hire you?\r\nWhat did you like least about your last job?\r\nWhen were you most satisfied in your job?\r\nWhat can you do for us that other candidates can't? \r\nWhat were the responsibilities of your last position?  \r\nWhy are you leaving your present job?\r\nWhat do you know about this industry?  \r\nWhat do you know about our company? \r\nAre you willing to relocate?  \r\nDo you have any questions for me?"}, {"date": "23 Sept 2017", "title": "RN Staff Nurse Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Sentara in Apr 2014", "Interview Descriptions": "The initial interview was the easy part. The manager asked reasonable questions and did a thorough job of explaining expectations. She was personable and professional, it seemed,  until she demonstrated that she did not have follow through.", "Interview Questions": "What was making me change from long ter care, where I had been for several years, to acute care."}, {"date": "29 Mar 2014", "title": "Emergency Department Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Sentara (Virginia Beach, VA)", "Interview Descriptions": "I had to apply 3 times before I received a call from their HR department.", "Interview Questions": "I can't remember it was over 5 years ago. I'm sorry I can help with this much needed info."}, {"date": "6 Mar 2014", "title": "Practice Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Sentara (Norfolk, VA)", "Interview Descriptions": "After applying online, I received an email from HR to set up a phone screening. After the phone screening, HR forwarded my information to the hiring manager. The hiring manager called me for a phone interview, then we set up an in-person interview. The in-person interview began at 10am, included lunch, and ended around 2pm.", "Interview Questions": "N/A"}, {"date": "8 Jan 2017", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Sentara (Virginia Beach, VA) in Mar 2014", "Interview Descriptions": "I applied on line for several positions at various Sentara Hospitals. I did not hear anything for several weeks.  Went to a job fair and after that the hiring process was easy", "Interview Questions": "Work experience, attitude"}, {"date": "18 Feb 2014", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Sentara (Norfolk, VA)", "Interview Descriptions": "I interviewed with a department Director and then the Vice President of the business unit.  Overall, it was a very casual experience and included both personal and professional discussions.  It was clear that both interviewers had reviewed my cover letter and resume thoroughly.  About half way through the interview, I was able to take control and basically interview them.", "Interview Questions": "The Vice President asked me to describe what steps I would take if I was asked to organize a fund raising event and what kind of event I would have.  This was odd because it had absolutely nothing to do with my experience of the position.  "}, {"date": "13 Feb 2014", "title": "Systems Analyst Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Sentara", "Interview Descriptions": "Extremely long process.  The hiring manager made sure I knew exactly how unqualified I was and used that as a way to bring me in cheaply.  There were three total interviews:  phone, interview 1, and interview 2.", "Interview Questions": "\"Give me one good reason why I should hire you.\""}, {"date": "26 Mar 2018", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Sentara in Feb 2014", "Interview Descriptions": "Began with applying online then in person interview. The hiring manager had just started and requested that other staff nurses sat in on the interview. It was informal, meeting in the lunch/lounge room with an open door.", "Interview Questions": "Why do you want to work in the ICU"}], [{"date": "24 Jan 2014", "title": "Customer Service Representative Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I applied online. The process took 4 days. I interviewed at Sentara (Virginia Beach, VA)", "Interview Descriptions": "Applied 1/16/14. Got an email on 1/20/14 describing pay and a link to take the assessment.. No scores were given ans Sentara does not give feedback on scores. So now it is a waiting game. Has anybody else gotten hired at Sentara? How long did it take for you to get hired? My job status as of today 1/24/14 says pending test results", "Interview Questions": "None as of yet"}, {"date": "26 Nov 2013", "title": "Practice Manager Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took a year or more. I interviewed at Sentara", "Interview Descriptions": "Was called at 9 pm on a Sat night, I returned the call to this \"director\" and we scheduled an interview the following Wednesday at 11am.  At 10:30 the director called me and asked if we could push the interview back to 11:30, I accommodated and still waited in the lobby for an additional 20 mins.  When I left, the director raved about how well the panel interview went and they'd \"call me later\".  I received a call ...EIGHT days later and the VM left verbatim was, \"I am calling you because you have been on my mind and the docs are very interested in you, everything is definitely moving in the right direction. I will follow up next week\". TWO weeks passed with no call, no VM, no form letter, no EM'.  HUGE disappointment .... HUGE.  Not to mention a huge waste of my time.  I had interviewed with Sentara previously and it was scheduled for 530 in the evening, I RUSHED to get there after work, changed etc. etc. to sit in a panel interview with a group of very grumpy, smug, albeit rude doctors.  One of which said THREE times, \"sorry, its been such a long a day\".  The interview was very unorganized with 30+ seconds of silence while they figured out who was going to ask the next question, very unprepared I knew half way through I did not want that job.  Not impressed, at all with Sentara.", "Interview Questions": "N/A"}, {"date": "12 Dec 2013", "title": "Department Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at Sentara (Williamsburg, VA) in Jul 2013", "Interview Descriptions": "I received a very thorough interview. The posting process to end of interview time period was very long but I received feedback throughout the process, which I appreciated. I had 3 separate panel type interviews.I was notified promptly following the panel's hiring decision.", "Interview Questions": "They asked several questions regarding how I had previously handled a difficult situation. It's never easy to show yourself in your best light in a conflict so this was challenging."}, {"date": "27 Jun 2013", "title": "Senior Security Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 3 weeks. I interviewed at Sentara (Norfolk, VA)", "Interview Descriptions": "Had worked with them as a contractor, and as long as I didn't wear my earrings I could get the job (though males with earrings was not mentioned in the employee handbook).", "Interview Questions": "Define a corporate policy for web application security (which was an AWESOME QUESTION)"}, {"date": "19 Jun 2013", "title": "Administrative Associate Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Sentara", "Interview Descriptions": "Easy", "Interview Questions": "N/A"}, {"date": "24 Apr 2016", "title": "Scheduling Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Sentara (Harrisonburg, VA) in May 2013", "Interview Descriptions": "First I had an interview over the phone to answer a few pre employment questions. Then therecwas a two step interview Iprocess. One I interviewed with the office manager I had to come back a second time and interview with the branch manager.", "Interview Questions": "Why do you feel that you would be a good canidate for this position?"}, {"date": "16 Apr 2014", "title": "Hospital Registration Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Sentara (Lake Ridge, VA) in Apr 2013", "Interview Descriptions": "I was only called in for one interview in person. I was met with by the director and training coordinator. They were pretty straight forward about the position and what they wanted from their employees. There was then another visit for drug screening. They also verified prior work experiences via email.", "Interview Questions": "During the interview they just asked if I was willing to come to work on time because that is a priority to them. They went over the training process, and what to expect from the position. They asked what customer service meant to me."}, {"date": "3 Sept 2017", "title": "Pharmacy Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Sentara (Woodbridge, VA) in Apr 2013", "Interview Descriptions": "Panel interview with all key staff and departments. Department tour and opportunity to speak with frontline staff not involved in the interview process. Discussion about department needs and clear expectations of employment.", "Interview Questions": "Why should we hire you?"}, {"date": "16 Dec 2017", "title": "Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Sentara (Virginia Beach, VA) in Jan 2013", "Interview Descriptions": "You apply for positions online and a recruiter will contact you if you seem to be a good match. The process is automated. The process is easier for current employees.", "Interview Questions": "How would your past co-workers describe you, "}, {"date": "20 Oct 2012", "title": "Emergency Department Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Sentara (Norfolk, VA) in Oct 2012", "Interview Descriptions": "The hiring process took about a month. My first interview involved interviewing with Team Manager and another ED Tech at the hospital I would be working at. Questions were very straightforward and basic - no curveballs. \"How would your experience help you?\" \"Are you a good team player?\" etc. Interviewer spent more time talking than I did. I was offered to shadow someone in my position a week later to determine if I would like the job. I was then asked to do another interview with two other members of the team I would be closely working with. This is interview was also straightforward. After I was offered the position, post-hire paperwork was required, including a health screening and drug test. Post hire paperwork was complicated and detailed, and including a three day timeline for completion. This included gathering references for review, so have references available beforehand.", "Interview Questions": "What video games do you play?"}], [{"date": "18 May 2012", "title": "Human Resource Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Sentara (Norfolk, VA) in Apr 2012", "Interview Descriptions": "Recently, I was interviewed for a position with Sentara. The position stated great job for a new college graduate. I qualified for the position and to add to this they are supposed to be one of the #1 companies hiring military spouses..Well I qualify for this as well and also have HR experience! Well I was told that a person with 5 years experience was selected. So what happened to the new graduate and hiring military spouses. I've been trying to get hired with Sentara for about 7 months now and have only received one interview, as I know I'm qualified for these positions. This just shows Sentara really isn't looking for the qualifications stated in the job announcements. If you don't know someone within the organization within a management position, guess what? You don't stand a chance. It's sad but true!\r\n\r\nA really aggravated candidate!", "Interview Questions": "If you are working within the organization in HR would you accept an application from a qualified candidate outside of the organization?"}, {"date": "28 Aug 2013", "title": "Emergency Department Scribe Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 3 weeks. I interviewed at Sentara (Williamsburg, VA) in Apr 2012", "Interview Descriptions": "Easy to work around scheduling. Slow process. Young, inexperienced interviewers.", "Interview Questions": "Why would you like to work as an emergency scribe?"}, {"date": "28 Jul 2015", "title": "Materials Consultant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at Sentara (Chesapeake, VA) in Dec 2011", "Interview Descriptions": "The interview was a one on one interview with the the Procurement Manager and the Contracts manager. I went very well. It was straight forward and direct. The Procurement Manager was very serious so she didn't show very much personality but I was ready. I was referred to the position by a former colleague who did a mock interview with me before meeting with her. I have a lot of experience in this field and I was confident before going into the interview so I was pretty sure I was going to get a job offer. The interview had a smooth rhythm and lasted for about an hour and a half, so I felt that was a good sign that they liked me. In the end I got the job.", "Interview Questions": "Why do I want to work for Sentara?"}, {"date": "4 Jul 2015", "title": "Senior Integrator Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. The process took 4 weeks. I interviewed at Sentara (Norfolk, VA) in Aug 2011", "Interview Descriptions": "Un-professional behavior, interview/testing does not match the environment you will be working in.  One manager constantly passes wind in the interview, closes the door and laughs.  This same manager passes on hiring women to his team and is very in-appropriate.", "Interview Questions": "\"What is the air speed velocity of an unladen swallow?\""}, {"date": "23 Sept 2015", "title": "Customer Service Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Sentara (Chesapeake, VA) in Jul 2011", "Interview Descriptions": "I was called for an nterview. I camea bout 15 early, A gentleman called my name and we went in a room where there was 3 other peolpe was waiting. I felt the interview went very well.", "Interview Questions": "N/A"}, {"date": "8 Aug 2012", "title": "Clinical Dietitian Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Sentara (Norfolk, VA) in Oct 2008", "Interview Descriptions": "I applied on Sentara's website and receive a call shortly after.  The interview was scheduled within a week's time.  Was interviewed by a panel of 20 people.  I did not feel I was being drilled, just needed to present what I could offer.  I had a portfolio and researched the company which made the interview run more smoothly.  I received a call within a week's time and was offered a part-time position, which I accepted.  However, before I even started, a full-time position had opened and I was offered that instead.  I was impressed to say the least.", "Interview Questions": "N/A"}, {"date": "28 Jun 2010", "title": "Business Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 5 days. I interviewed at Sentara (Norfolk, VA) in Feb 2008", "Interview Descriptions": "Went through a phone interview, followed by an in person interview, not many technical questions asked, more discussion of my background and what i would be able to provide the company with skills wise.", "Interview Questions": "What is a difficult situation with a customer, and how was it handled."}]]