[[{"date": "22 Feb 2023", "title": "Graduate Assistant Non Teaching Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at William Paterson University in Jun 2021", "Interview Descriptions": "It was pretty laidback. It depended on the department. I was interviewed by supervisors from three different departments. The one I ended up hearing back from was easy. It was conversational and asked about preferences. The ones that rejected me were supervisors who needed specific skills so asked about the skills.", "Interview Questions": "What are your strengths and weaknesses?"}, {"date": "4 Jun 2019", "title": "Assistant Professor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at William Paterson University (Wayne, NJ)", "Interview Descriptions": "About 5 hrs long. A teaching demonstration and discussion, then a formal group interview with a round table of questions, lunch, informal chats, meeting with the dean. All were friendly, seemed like a collaborative environment.", "Interview Questions": "Describe yourself in 3 words. "}, {"date": "22 Jan 2023", "title": "Program Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at William Paterson University (Edison, NJ) in Apr 2019", "Interview Descriptions": "I went on an interview and they asked me questions and I answered them. Then I waited for them to get back to me and I was told I got the job.", "Interview Questions": "How are you doing today"}, {"date": "4 Jan 2017", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at William Paterson University (Haledon, NJ)", "Interview Descriptions": "the interview process was fairly simple, they asked generic questions to get a feel for character and ability to handle certain situations as well as dealing with various people.", "Interview Questions": "Give an instance that you dealt with a stressful situation."}, {"date": "10 Jun 2018", "title": "Project Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at William Paterson University in Oct 2016", "Interview Descriptions": "Face to face meeting with hiring manager. Then met the other department personnel briefly to be introduced as prospective candidate for the position. Follow-up phone interview with 2nd line manager to learn more about onboarding process, tools, detailed job requirements.", "Interview Questions": "prior experience with training program coordination, experience working with trainee candidates of various skill levels"}, {"date": "3 Feb 2015", "title": "Clerk Typist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied through college or university. The process took 3 months. I interviewed at William Paterson University", "Interview Descriptions": "I applied to one position and was not offered the job. The university holds your resume for 6 months and happened to receive an offer for another interview in a different office. Went to the interview and sat in a room with all members of the office. After the interview, the hiring process took several weeks. I did not hear from the university until about 3 weeks later.", "Interview Questions": "No question was extremely difficult, but it was a large interview group and threw me off at the beginning. "}, {"date": "21 Aug 2015", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at William Paterson University (Fort Lee, NJ) in Jan 2015", "Interview Descriptions": "Via telephone, I did the interview. They mainly focus on how much experience on teaching, especially experience in assigned course. However, did not asked technical question related to the course.", "Interview Questions": "How long did you teach the course?\r\nWhat kind of methods do you use when in classroom?"}, {"date": "4 Feb 2016", "title": "Laboratory Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at William Paterson University (Wayne, NJ) in Sept 2013", "Interview Descriptions": "I was called for an interview after submiting a resume and cover letter based on an online job posing.  For the interview I met with 4 faculty for one combined Q&A.  They had a list of fairly standard questions that were asked to all applicants interviewed.  Each interviewer asked another question or two of their own that was more focused on my particular background.  It was clear that some of the interviewers did not get along.  Also, I was indirectly asked if I was ok with being yelled at.", "Interview Questions": "As this is a state job, how do you handle working with coworkers who are not very motivated and may not do their share?"}, {"date": "15 Jan 2014", "title": "Project Employee Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at William Paterson University (Wayne, NJ) in Jan 2013", "Interview Descriptions": "Typical interview process asking why you are interested in said position, talk about your experiences, etc.  She then went on to explain the hourly wage, hours (flexible), and what is expected of me.  Very informative and laid back.", "Interview Questions": "N/A"}, {"date": "27 Jan 2015", "title": "Director of Student Activities Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through other source. The process took 1 day. I interviewed at William Paterson University in Dec 2011", "Interview Descriptions": "Applied through an ad in the newspaper. I met with a number of administrators, faculty and students who asked stock questions, nothing very creative or imaginative.\r\n\r\nLater I met with a few upper level administrators and faculty members. They all kept looking at each other instead of at me.  They seemed unprepared. One faculty member slurred his speech, it seemed like he had been drinking.  I asked some of my own questions but they did not give direct answers.\r\n\r\nVery unprofessional administrators.", "Interview Questions": "How do you feel about being micro-managed?"}], [{"date": "15 Sept 2012", "title": "Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 months. I interviewed at William Paterson University (Wayne, NJ) in Feb 2008", "Interview Descriptions": "I was interviewed for a full day (9 AM - 7 PM).", "Interview Questions": "No questions were difficult or unexpected."}]]