[[{"date": "15 Mar 2023", "title": "Behavior Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Fraser in Sept 2022", "Interview Descriptions": "I applied online and did a zoom interview with 2 people. They were very nice and set me at ease. They were personable and listened well; you could tell they cared about their jobs.", "Interview Questions": "Do you have experience taking daily documentation?"}, {"date": "17 Aug 2022", "title": "Assistant Teacher Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Fraser (Minneapolis, MN) in Jun 2022", "Interview Descriptions": "The people were kind, but the interview process was long and drawn out. Lots of work for a first round interview. Offices in need of updating. In the end, I didn’t get the job, and they didn’t tell me why. Whole interview was 2 hours.", "Interview Questions": "How have you handled disagreements between children? Tell me about a time where you needed to de-escalate a situation."}, {"date": "4 Feb 2022", "title": "Case Manager Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Fraser", "Interview Descriptions": "Topical interview process, the manager that interviewed me was wonderful! Super kind, as was the head of HR. Small written paper for interview questions about experience. Nothing too stressful. Would recommend taking an interview here!", "Interview Questions": "Experience, de-escalating abilities, salary, etc. all typical questions "}, {"date": "19 Jul 2021", "title": "Outbound Medical Scheduler Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Fraser", "Interview Descriptions": "process was was great with Fraser just did a interview over the phone have to do a 2nd interview with them in see what comes next with the interview process", "Interview Questions": "why would you like to work here?"}, {"date": "16 Mar 2021", "title": "Behavioral Technician Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Fraser in Mar 2021", "Interview Descriptions": "The interview process was fairly simple. It consists of one phone call asking general questions and then if they reached out to you again, you would do a Zoom virtual interview. The second interview was done by two individuals and it was general interview questions. I thought the second interview was kind of dull as they asked pre-written questions and it was not much of a conversation.", "Interview Questions": "Do you have any experience with diversity and inclusion and what did that look like?"}, {"date": "4 Feb 2021", "title": "Speech Language Pathologist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Fraser (Minneapolis, MN) in Jan 2021", "Interview Descriptions": "Typical interview questions. The interviewer was kind. It was exactly what I expected from the interview. If you practice basic interview questions you will be prepared. The complete interview process took less than an hour.", "Interview Questions": "What is one mistake you have made and how did you fix it?"}, {"date": "28 Feb 2022", "title": "MHP II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Fraser in Aug 2020", "Interview Descriptions": "The interviewers asked insightful questions about experience, reasons for wanting the job, etc. They also very clearly laid out job description and duties. I appreciated the effort they put in. Multiple interviewers gave efficient information as well.", "Interview Questions": "Strengths and weaknesses, as well as reasons for wanting to work in the position."}, {"date": "28 Sept 2019", "title": "CPA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Fraser", "Interview Descriptions": "I got an email to confirm a phone interview then waited about a week to confirm an in person interview and another week to know if I got an offer or not.", "Interview Questions": "Why do you want to work here? Experience, Education, Goals, and more questions that are typically asked. "}, {"date": "6 Apr 2020", "title": "Behavior Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Fraser in Jun 2019", "Interview Descriptions": "the interview process was very short and easy, basic question, very nice people interviewed me. they gave a quick tour of the building and a brief history, again it was short and simple.", "Interview Questions": "why do i want to work there"}, {"date": "23 Jan 2019", "title": "Clinician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Fraser", "Interview Descriptions": "Excellent and easy process.  The interviewer created a respectful and comfortable environment. It was a phone interview with two phases.  The interviewer was accessible and a good listener person.", "Interview Questions": "Talk about you profesional experience "}], [{"date": "22 Aug 2018", "title": "Developmental Trainee Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Fraser (Eden Prairie, MN)", "Interview Descriptions": "The interview process was very fast which was extremely nice. I really liked how there was a phone interview taking with an HR rep instead of just a recorded phone interview screen. To follow the phone interview  there was an in person interview with the hiring manager.", "Interview Questions": "Strengths/Weaknesses"}, {"date": "23 Aug 2018", "title": "Human Resources Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Fraser", "Interview Descriptions": "Quick, thorough, professional. Fun and  upbeat, informative phone interview. I was made to feel welcome and comfortable, relaxed panel style interview in person. Questions didn’t seem scripted or generic, interviewers genuinely interested in my answers.", "Interview Questions": "How would you apply your experience to this role? "}, {"date": "1 Aug 2018", "title": "Developmental Trainee Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Fraser", "Interview Descriptions": "It was a phone interview and the HR gave me a brief intro of Fraser. Just like other comments, you don't need to prepare much. The HR would do most talking. \r\n\r\nI got the call  a few weeks ago, but since I couldn't start to work until September. The HR said she would reach out again if they still need people by then.", "Interview Questions": "I don't remember the question, but it was a very easy one."}, {"date": "13 May 2018", "title": "Mental Health Practitioner II Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Fraser (Minneapolis, MN)", "Interview Descriptions": "I applied online, received a request to set up a phone interview less than a week later. After the phone interview, I was invited to an in-person interview. The HR recruiter was very nice and friendly, as was the Licensed Professional I interviewed with. \r\nHowever, I had a few issues during my interview and hiring process. During my phone interview, the HR rep outlined two different MHPII roles at Fraser, and discussed which one I was being considered for. However, when I arrived at the in-person interview, I was interviewed for the alternate role.  I called the HR rep out on this discrepancy, and she apologized for the confusion, and stated that several roles had changed internally, leading them to  change to requirements of the position. Understandable, but it was still not communicated to me, and put me in a tough spot during the in-person interview. \r\nDespite this issue during the interview process, I accepted the position. My second concern arose when I received my employment paperwork. Fraser advertises clinical supervision as a benefit of employment, and having internal supervision was a strength of the company that HR really pushed during the interview. However, when I received my employment contract, I also received a supervision repayment clause. Furthermore, when HR sent my paperwork, they gave me a 24 hour deadline to sign and return all paperwork. Since individual supervision at Fraser is actually scheduled as unpaid time, and I was not told of this expectation during my interview process, I was very uncomfortable with this clause. I contacted the recruiter and told her I may have to rescind my acceptance of employment based on this clause and their lack of transparency regarding this. HR immediately set up a call with myself and their Compliance Rep.  I was told in this call that Fraser would be changing their policy regarding this, and I did not need to sign the clause. \r\nHowever, I have now learned that Fraser continues to require repayment for supervision time should clinicians leave before a certain time.\r\n**So, long story short, Fraser may not require you to sign that contract if you push them on it, and I highly recommend that you have a discussion with them about it.**", "Interview Questions": "Educational background, work background, questions regarding knowledge of ASD, perspective on behavior, how to supported children with no/limited language, etc. "}, {"date": "6 May 2018", "title": "Preschool Teacher Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Fraser (Richfield, MN)", "Interview Descriptions": "HR was really polite and went smoothly. Phone interview and then follow up on-site interview. People are friendly and professional. Asked a lots of questions about behavior, and your background", "Interview Questions": "Questions about your background. Children related questions"}, {"date": "18 Mar 2019", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Fraser (Minneapolis, MN) in Mar 2018", "Interview Descriptions": "Very quick, took about 1 week for verifying information. Started with a phone interview then in person. Manager was extremely helpful and willing to make time to speak over the phone then in person.", "Interview Questions": "What makes you want to work at Fraser "}, {"date": "30 Aug 2017", "title": "Developmental Trainee Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Fraser", "Interview Descriptions": "I was contacted by HR for phone interview, then went to an in-person interview at the location. It went pretty quickly. Phone interview was mostly the HR rep talking.", "Interview Questions": "Experience with kids"}, {"date": "29 Oct 2017", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Fraser (Richfield, MN) in Jul 2017", "Interview Descriptions": "Contacted by Human Resources rep who did phone screen. Then had in-person interview with two directors.  Interview lasted an hour.  They had many prepared questions.  Asked for specific details.  After my interview, I was called with an offer within a few days.  This is a great place to work.", "Interview Questions": "Am I familiar with a Metrics Based Environment"}, {"date": "8 Nov 2017", "title": "Clinical Services Scheduler Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Fraser (Richfield, MN) in Jun 2017", "Interview Descriptions": "I was contacted quickly, brought in within a few days and interview was professional.  Unfortunately I was not given the information on the process of the job and was not given a tour of the desk/building.  There is a great deal of information with little training.   Great mission statement and working forward for the betterment of the kids, clients and families.", "Interview Questions": "Questions were typical, if there was a challenging coworker how would you handle it.  "}], [{"date": "30 Mar 2016", "title": "Developmental Trainee Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Fraser in Jun 2015", "Interview Descriptions": "Average and feel comfortable. It is not so hard as long as you have the related experiences, The Programs in Occupational Therapy are committed to the highest academic and professional\r\nstandards. To this end, there is an expectation that all students, faculty and staff will act in\r\nways consistent with these standards.", "Interview Questions": "strength?"}, {"date": "4 Apr 2019", "title": "Mental Health Practitioner Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Fraser (Eden Prairie, MN) in Jan 2015", "Interview Descriptions": "They called me to do a phone interview and then had me come in for an in person one. They were very nice, professional, on time and open to questions.", "Interview Questions": "What are your strengths?"}, {"date": "28 Jul 2015", "title": "Mental Health Practitioner II Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Fraser (Minneapolis, MN) in Jan 2015", "Interview Descriptions": "Very professional and quick responses.  First discussed the position over the phone and went on the schedule an in-person interview.  Met with two hiring supervisors and it was very casual.  Asked a lot about leadership experiences and conflict management.", "Interview Questions": "Asked about leadership experience"}, {"date": "9 Nov 2015", "title": "Dt Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Fraser (Minneapolis, MN) in Aug 2014", "Interview Descriptions": "Very quick- high turnover in this position and they were eager to hireextremely short and casual interview. I'm fairly convinced they hire most people for the DT position since they are so in need for employees.", "Interview Questions": "extremely short and casual interview. I'm fairly convinced they hire most people for the DT position since they are so in need for employees."}, {"date": "8 Aug 2015", "title": "Developmental Trainee Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Fraser (Minneapolis, MN) in Jan 2014", "Interview Descriptions": "First, I was interviewed over the phone by an HR representative. Next, I was brought into the corporate office for an interview with the same HR representative and the supervisor of the position I was interviewing for. The interview was laid back and mostly focused on my own experiences.", "Interview Questions": "Describe a challenge you've faced and how you've handled it?"}, {"date": "1 Jan 2018", "title": "Mental Health Practitioner Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Fraser (Minneapolis, MN) in Jan 2014", "Interview Descriptions": "Easy because I had been a former employee. If you have never been an employee I would recommend making sure your resume looks good! Also possibly call in to \"check\" on your application?", "Interview Questions": "What are the biggest accomplishments you have had in your current position?"}, {"date": "4 Sept 2017", "title": "Developmental Trainee Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Fraser (Minneapolis, MN) in Jan 2013", "Interview Descriptions": "There was first a group interview, where they asked more general questions. Seemed as if they were comparing applicants. Then there was an individual interview, that was like your average interview.", "Interview Questions": "Do you have experience working with children?"}, {"date": "26 Apr 2015", "title": "Mental Health Practitioner II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Fraser (Minneapolis, MN) in Oct 2011", "Interview Descriptions": "I met with a clinical supervisor and HR. The process was comfortable and both interviewers were able to answer all of my questions. My interview took about 30 minutes and within a few days I received a phone call back from HR. I again had a few questions to ask over the phone and the HR staff was able to answer all of my questions and make me feel comfortable with the offer.", "Interview Questions": "current and past work experience."}]]