[[{"date": "3 Mar 2023", "title": "Registered Nurse Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Southern New Hampshire Health", "Interview Descriptions": "It was good. HR took awhile but that's the usual these days. Overall positive experience. I would recommend following up after you apply and being assertive. It will help you get your foot in the door and have your name there", "Interview Questions": "They asked a lot of tell me about a time questions."}, {"date": "9 Mar 2022", "title": "Physical Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Southern New Hampshire Health", "Interview Descriptions": "The interview process was formal, performed by clinic manager and clinic director. The interview lasted for roughly 1 hour including my own questions and with a tour around the facility.", "Interview Questions": "what is your biggest weakness"}, {"date": "8 Jun 2021", "title": "Patient Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Southern New Hampshire Health (Nashua, NH) in Feb 2021", "Interview Descriptions": "The process was your typical interview process. I had a phone interview first with the hiring manager, and then an in person interview afterwards. I was offered the position after that.", "Interview Questions": "What is one thing you think you need to work on to improve?"}, {"date": "20 Oct 2017", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Southern New Hampshire Health (Nashua, NH)", "Interview Descriptions": "I waa interviewed by the DON & Nurse Manager. They asked me about my previous work experience, the type of patients I managed and some behaviral quesgions. They offer a really good orientation program and training opportunities. But I wasn't fully prepared for this interview.", "Interview Questions": "What do you see yourself in 5 yrs time"}, {"date": "2 Jun 2017", "title": "Executive Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Southern New Hampshire Health (Nashua, NH) in Sept 2016", "Interview Descriptions": "Very friendly, felt like more of a conversation than an interview.  I met with the two executives I would be supporting and talked about what their needs were and how I might help to achieve their success.", "Interview Questions": "What were some of my favorite projects in previous position "}, {"date": "18 Sept 2015", "title": "Office Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Southern New Hampshire Health", "Interview Descriptions": "Very straight forward. No difficult questions. Asked me about myself and what I'm looking for and my background. Told me about the job and what it entails, which doctor I would be working with, etc. Straightforward questions. Interviewed with another RN in the office and the office manager. Took approximately 30-45 minutes.", "Interview Questions": "Tell me about yourself?"}, {"date": "28 Jun 2015", "title": "Office Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "The process took 4 weeks. I interviewed at Southern New Hampshire Health", "Interview Descriptions": "They called after a month of waiting. Granted, they probably had many submittals. Got one interview in which I was told I would be a great fit. I was hopeful. Second interview, once again, positive and thought I had nailed it only to be told I didn't get the job. Too much internal competition I believe. Deceiving. They shouldn't waste time on people who have full time jobs if they know they typically hire from within.", "Interview Questions": "Tell me a little about yourself."}, {"date": "28 Jan 2015", "title": "Office Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Southern New Hampshire Health (Nashua, NH)", "Interview Descriptions": "Applied online, was contacted directly by hiring manager for a telephone interview about one week later, scheduled a sit down interview during that phone call. Interviewed, didn't hear anything for 5 weeks. Applied for another position, was called by that hiring manager to schedule an interview. When I returned that phone call I was told they couldn't interview me after all because I'd been hired for the first position I had applied for (the one 5 weeks before) - gee, thanks for telling me about it! So then I spoke with the original hiring manager again and then went for my drig screen, physical, paperwork, backgrounbd check, etc. The whole process took more than 2 months.", "Interview Questions": "Name a mistake you made while caring for a patient"}, {"date": "22 Apr 2015", "title": "Med Surg RN Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Southern New Hampshire Health (Nashua, NH) in Sept 2014", "Interview Descriptions": "It was a typical nursing interview--but was discouraged by the woman interviewing me.  She basically told me they are run on budgets and its difficult to get time off. She said it is an extremely difficult place to work.  So with that, I went home and sent her an email that based on what she told me I do not want to work there.", "Interview Questions": "N/A"}, {"date": "29 May 2014", "title": "Clinician Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Southern New Hampshire Health (Nashua, NH)", "Interview Descriptions": "Communication good in initial hiring phase. 3 interviews. Required work physical. Later in process, communication and follow through was not as good. None. Laid back interview. I was surprised. They do a great job of telling you about the organization and history during the interview. None. Laid back interview. I was surprised. They do a great job of telling you about the organization and history during the interview.", "Interview Questions": "None. Laid back interview. I was surprised. They do a great job of telling you about the organization and history during the interview."}], [{"date": "11 Oct 2016", "title": "Credentialing Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Southern New Hampshire Health (Nashua, NH) in Mar 2012", "Interview Descriptions": "Was done with 3-4 people over a period of a couple weeks, call backs and phone interviews were a part of it, coming in and interviewing with a group of managers was also part of it", "Interview Questions": "What is your healthcare experience"}, {"date": "11 Mar 2010", "title": "Executive Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Southern New Hampshire Health (Boston, MA) in Feb 2010", "Interview Descriptions": "Interview was group interview", "Interview Questions": "Tell me how you multi task"}]]