[[{"date": "7 Jun 2023", "title": "HR Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at University of Central Arkansas (Conway, AR)", "Interview Descriptions": "Simple 2 step interview process. Phone call with the department then department interview with 4 or more established members of the team. Process was simple and straight forward. Took less than a few weeks.", "Interview Questions": "First Question: Tell me about yourself"}, {"date": "3 Mar 2021", "title": "Visiting Assistant Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of Central Arkansas", "Interview Descriptions": "First, I had a phone interview with the chair of the department. Next, I was invited to do a teaching demonstration and  an interview with the full search committee via Zoom. Finally, I was offered the job.", "Interview Questions": "Why do you want to work at UCA?"}, {"date": "1 Aug 2019", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Central Arkansas", "Interview Descriptions": "It was a nice atmosphere, not intimidating at all. Interviewers were nice and made me feel comfortable.  It took about two weeks after I applied to receive an interview offer and another 2 weeks after the interview to hear back from the employer. I received the offer and accepted.", "Interview Questions": "What can you contribute to the company? "}, {"date": "18 Dec 2018", "title": "Graduate Research Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 2 weeks. I interviewed at University of Central Arkansas", "Interview Descriptions": "I’m just filling this out so I can get to see other information. Please disregard. It’s not impossible for y’all though I gotta was it the last day of my two", "Interview Questions": "Yeah I think so we are going"}, {"date": "13 Apr 2021", "title": "Center for Writing and Communication Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at University of Central Arkansas (Conway, AR) in Feb 2017", "Interview Descriptions": "You can only interview for a job here if you are a student or graduate student. Overall, though, I thoroughly enjoyed the interview/recruiting process. I was able to represent myself well and ask plenty of questions about the position.", "Interview Questions": "What is your greatest accomplishment in writing?"}, {"date": "7 Apr 2016", "title": "Assistant Professor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 months. I interviewed at University of Central Arkansas (Conway, AR) in Jan 2016", "Interview Descriptions": "The interview process involved a skype interview and on-campus visit. The skype interview was a few weeks after the application. About 2 weeks after the skype interview, they contacted me to let me know that they wanted to bring me to campus for an interview. The on-campus involved meeting with the key administrators in the college, HR, departmental faculty, and a presentation. The interview went well and at the end of the interview, they told me that they'd be making their decision and had very confident hopes of making an offer within the next two weeks. About a week later, they let me know that HR was requiring them to bring in another candidate for administrative purposes. I was continually assured I'd be getting an offer. After 4 weeks of waiting, I finally said that I needed to know. They told me that they'd offered to another candidate earlier in the week. The mixed messages were incredibly unprofessional.", "Interview Questions": "Would you be able to handle teaching 3 preps in one semester?"}, {"date": "20 Jul 2017", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at University of Central Arkansas (Conway, AR) in Jul 2015", "Interview Descriptions": "Pretty straight forward, I met with the head of the MBA's and he wanted to gauge my character more than anything else. Behavior questions were asked and small talk to see f I was a good fit for the work environment.", "Interview Questions": "Name a time you disagreed with a team member"}, {"date": "2 May 2016", "title": "Adjunct Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at University of Central Arkansas (Conway, AR) in Jul 2015", "Interview Descriptions": "Very low-key. I got the position through a former employee of UCA who sent my resume to the hiring department head. We corresponded over email and eventually had a face-to-face meeting, where we chatted and discussed the goals of the course and the department.", "Interview Questions": "They asked about my experience teaching college students, experience with the language I was teaching, textbooks, etc."}, {"date": "27 Nov 2013", "title": "Executive Assistant to the Advancement Vice President Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 4 days. I interviewed at University of Central Arkansas (Conway, AR) in Oct 2011", "Interview Descriptions": "The HR Dept on campus found me this position. The HR Director set up interview with the Advancement VP. It wasn't anything too detailed pretty simple and it worked out well. After the interview I received a call within 3 days or so offering the position to me.", "Interview Questions": "I did not feel there were any difficult or unexpected questions asked. The questions that were asked were regarding my previous work experience and how those experiences would help things run better at this office."}, {"date": "6 May 2015", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at University of Central Arkansas (Conway, AR) in May 2011", "Interview Descriptions": "Panel interview with mix of faculty and staff. Pleasant and welcoming.  Took about an hour and a half. Interview was half questions and half tour of the building and meeting some of the graduate students and other faculty.", "Interview Questions": "How woul you deal with crying students and helicopter parents?"}], [{"date": "8 Mar 2011", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at University of Central Arkansas (Conway, AR) in Sept 2010", "Interview Descriptions": "I sent in my resume and job application documents in late June.  I finally received a call from the department in mid September.  I set up an appointment for an interview.  I was interviewed by the department director and the secretary at the same time in the director's office.  They described the various tasks I would have and asked if I would be able to handle all of it.  They then asked about different areas of leadership and about my past work experiences.  They also asked about my expertise with computer hardware and software.  Overall, it was a decent interview.  It was relaxed and not too formal.", "Interview Questions": "Describe a past experience where you had to lead or show a degree of leadership.  How did you handle the situation?  What was the outcome?"}, {"date": "1 Sept 2010", "title": "Program Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at University of Central Arkansas (Conway, AR) in Apr 2008", "Interview Descriptions": "I had to interview for about 4 hours meeting with the managers of various departments.", "Interview Questions": "What is your counseling philosophy?"}]]