[[{"date": "5 May 2023", "title": "Summer Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Eastern Illinois University (Charleston, IL)", "Interview Descriptions": "Very informal, basic questions about schedules. They dressed in casual clothing. But you should dress in professional clothes. They will ask why you want to work here. What experience you have. It is okay if you are not super experienced, they support learning and growing on the job", "Interview Questions": "What is your schedule? What do you know about this specific department?"}, {"date": "1 Dec 2021", "title": "Dining Student Worker Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at Eastern Illinois University (Charleston, IL)", "Interview Descriptions": "Ridiculously simple. When they're desperate, you can tell. My friend said that they accept anyone but I thought they were overexaggerating. They weren't. Pretty much they have a sheet to ask you questions off of but my interviewer already marked everything off and was basically \"going through the motions\" of the interview. I could've not tried and still gotten the job. They ask you the typical job interview questions and then say you got the job. That was my experience. My take away: they really don't care who they hire.", "Interview Questions": "Why do you believe you'd be a good fit for the job?"}, {"date": "9 Nov 2021", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Eastern Illinois University (Charleston, IL)", "Interview Descriptions": "There was no formal interview process. Only online application. You will need to apply for a graduate course at Eastern Illinois University then followed by the application for a graduate assistant.", "Interview Questions": "There was no formal interview. Only online qusetions. "}, {"date": "12 Aug 2019", "title": "Front Desk Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Eastern Illinois University", "Interview Descriptions": "Laid back, informal interview with basic questions about diversity, inclusion, and customer service.  There wasn't a lot of pressure and everything was very convenient for students that live on campus.", "Interview Questions": "What is diversity to you?"}, {"date": "26 Nov 2019", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Eastern Illinois University (Charleston, IL) in Mar 2019", "Interview Descriptions": "Interview was a group/panel of about six people who would ask questions of all types, ranging from what my career goals are to what my strengths and weaknesses are. It was intense and engaging at the same time.", "Interview Questions": "How will you manage a conflict involving a parent at work? "}, {"date": "20 Jul 2020", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Eastern Illinois University (Charleston, IL) in Dec 2018", "Interview Descriptions": "I had an awesome interaction with the team. I had prepared much prior to the interview and I was able to impress the panel with my delivery. I explained to the panel what I have to bring to the table. I also ended the interview by asking the most significant thing the company seeks to improve upon in the coming year.", "Interview Questions": "Why would you want to work with us?"}, {"date": "11 Oct 2018", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Eastern Illinois University", "Interview Descriptions": "there was a first round in person interview and then the next round was meeting with the person that you would be working with. It was very professional and had a lot of opportunities within the graduate school.", "Interview Questions": "tell me about yourself."}, {"date": "11 Mar 2018", "title": "Resident Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Eastern Illinois University", "Interview Descriptions": "Online application - easy to fill out with mostly basic demographic and experience information. Two interviews - one in-hall with building current RAs and one departmental with current ARDs and RDs", "Interview Questions": "What does diversity mean to you"}, {"date": "6 Jan 2018", "title": "Fitness Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Eastern Illinois University (Charleston, IL) in Feb 2016", "Interview Descriptions": "Telephone interview with 2-3 current employees. Asked general questions about my background and experience in Campus recreation. Didn't ask any questions that were too difficult and gave opportunity to ask questions.", "Interview Questions": "Why should we hire you?"}, {"date": "15 Jul 2015", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Eastern Illinois University (Charleston, IL) in Dec 2014", "Interview Descriptions": "I actually did not have an interview. I was contacted by my former graduate adviser. She had asked if I would be available to teach a few classes as a former faculty left suddenly. I really did not have much of an opportunity to decline some of the courses I was teaching, but I did have the time to put together the 3 classes. I had met with the chair, assistant chair, and the director of the dietetic program to discuss the classes I would be teaching and any potential job opportunities that would be available.", "Interview Questions": "As I was teaching they did ask me if I like this place and if my goals would be to stay as long as they would be able to fulfill my contract."}], [{"date": "24 Mar 2017", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Eastern Illinois University (Charleston, IL) in Oct 2014", "Interview Descriptions": "Talk with professors. Ask each professor to see if there is the position open. Then, professors will talk with you personally see if you have the ability to do the work and research.", "Interview Questions": "Talk with professors"}, {"date": "16 Dec 2016", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Eastern Illinois University (Charleston, IL) in Dec 2013", "Interview Descriptions": "It was a quick online answer and question. I applied online and got a call about two weeks later for a quick phone interview. Then I went into the hiring office to fill out some paperwork and do online training.", "Interview Questions": "What my schedule for the semester looked like"}, {"date": "17 Aug 2017", "title": "Adjunct Lecturer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Eastern Illinois University (Charleston, IL) in May 2013", "Interview Descriptions": "The department chair reviewed my CV, and then promptly informed me I wasn't a fit for the position. I acknowledged that my degree wasn't in the area specified, but was instead in a related area. The department chair person seemed frustrated and impatient during the conversation. I didn't meet with members of a search committee, only the department chair.", "Interview Questions": "What is your experience teaching in this field?"}, {"date": "2 Jan 2016", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 1 day. I interviewed at Eastern Illinois University (Charleston, IL) in Aug 2012", "Interview Descriptions": "I was placed with the International Office, so there was not much of an interview process. I spoke with the office manager and she asked me general questions about myself and about my previous work experience.", "Interview Questions": "Do you have experience with Word and Excel."}, {"date": "28 Jun 2012", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Eastern Illinois University (Charleston, IL) in Dec 2008", "Interview Descriptions": "I was interviewed by my supervisor as well as his supervisor (my supervisor's supervisor). They asked me general questions about my experience to ensure I was competent, as well as some personality questions to ensure I would work well with the existing staff.", "Interview Questions": "Tell me about a time when you had two or more projects simultaneously. What did you do to manage those projects?"}]]