[[{"date": "12 Jan 2023", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Salt Lake Community College", "Interview Descriptions": "They asked questions and then I answered them. Pretty standard stuff. Not too hard at all. The questions were easy to answer. They weren’t as in depth as I thought they would be so it was simple", "Interview Questions": "What is your previous work history?"}, {"date": "3 Jan 2022", "title": "Staffing Specialist I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Salt Lake Community College", "Interview Descriptions": "The interview was quick and easy. The manager get back to the candidate within a couple days which good because didn't left candidate clueless for a long time. They also only did one round of interview which is nice but did ask for 4 or more professional references for only a part time position.", "Interview Questions": "How many year of Customer service do you have?"}, {"date": "1 Nov 2021", "title": "Communications Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Salt Lake Community College (Salt Lake City, UT) in Oct 2021", "Interview Descriptions": "Was done on zoom.  3 Interviewers and me. There was nothing unique to describe. I have nothing else to say. But I need to add a bit more, apparently.  Still a bit more, I guess.", "Interview Questions": "Tell us about a time you overcame an obstacle that involved getting other people on the same strategy. "}, {"date": "25 Sept 2021", "title": "Student Services Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Salt Lake Community College", "Interview Descriptions": "Nice and welcoming, to be honest I’m leaving this review to view a different positions reviews but my time working at SLCC was really nice and the college has a very welcoming admissions and orientation staff.", "Interview Questions": "Describe a conflict you navigated in the past."}, {"date": "8 Oct 2021", "title": "Lab Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Salt Lake Community College (Salt Lake City, UT) in Sept 2021", "Interview Descriptions": "Well scheduled at zoom. Same 7 questions for all candidates were given. Adequate answers are given from managers. Result was sent by e-mail within 7 days after the interview.  Great experience.", "Interview Questions": "Why do I think that I am suitable for this position"}, {"date": "26 Aug 2021", "title": "Fundraising Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Salt Lake Community College", "Interview Descriptions": "Entire department asked questions for about an hour on a wide range of topics. A lot of it was based on prior experience and background with fundraising. It did help me get a feel for the team and the company culture.", "Interview Questions": "What is your past experience with fundraising? "}, {"date": "18 Nov 2021", "title": "Event Support Specialist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Salt Lake Community College (Salt Lake City, UT) in Aug 2021", "Interview Descriptions": "Was contacted for an interview over the phone shortly after applying, interview was over zoom with a panel of 3 interviewers each taking turns asking different questions. The three people involved were individuals working in different areas related to the position.", "Interview Questions": "What is your experience in a diverse work environment?"}, {"date": "10 Aug 2021", "title": "Community Engagement Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Salt Lake Community College (Sandy, UT) in Jul 2021", "Interview Descriptions": "I applied over a month ago. I was called into an zoom interview after two weeks which involved a panel of 4. Two out of the four introduced themself as, “Hi, my name is ________. I prefer the pronouns, he, she and they.” It was awkward because I didn’t know if I should introduce myself the same way. I didn’t even have a chance to use the pronounce so it seemed out of place. It was a good interview and they asked about my skill set and experience. It took 30 minutes. The promised to let me know in a week and half, I sent a thank you email after 5 days. When I had another job offer and 13 days had passed I left a voicemail inquiring if I’d be moving forward or not and got a nice rejection email.", "Interview Questions": "What is your experience using Salesforce.  I appreciated not having the same old questions like , “Tell me about yourself” and “what is your greatest weakness”"}, {"date": "28 Oct 2021", "title": "Library Aide Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Salt Lake Community College (Salt Lake City, UT) in Jan 2020", "Interview Descriptions": "It took about 2 weeks after I applied to hear back, but the interview process was very fair. I was surprised to meet with more than one person given the level of the position. The interviewers asked really good questions and seemed to really care about finding the right person not just the right qualifications.", "Interview Questions": "What does a Library represent to you? How do you face difficult interactions?"}, {"date": "7 Apr 2020", "title": "Corporate Trainer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Salt Lake Community College in Sept 2019", "Interview Descriptions": "Corresponded via email, applied online with a required resume and cover letter.  Had an in-person interview with a couple staff members. After the interview, they called back for a teaching demonstration. Very friendly people that care about hiring quality instructors.", "Interview Questions": "What are you're experiences with adult learners?"}], [{"date": "16 Aug 2019", "title": "Onboarding Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Salt Lake Community College", "Interview Descriptions": "Standard in person interview with the two people that did the onboarding. The questions were more about examples of handling things rather than questions about resume. It was average in difficulty.", "Interview Questions": "Tell me about a time when you solved a problem."}, {"date": "3 Aug 2019", "title": "Testing Proctor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Salt Lake Community College", "Interview Descriptions": "Contacted me and asked me to come in for an interview. The interview was with the head of the testing department for all campuses. It was a one on one interview and only lasted about five minutes and started doing the paperwork to hire me during my interview.", "Interview Questions": "Tell me about yourself?"}, {"date": "4 Dec 2019", "title": "Academic Computing Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 2 weeks. I interviewed at Salt Lake Community College in Aug 2019", "Interview Descriptions": "Panel Interview, 10 questions, followed by a light question and answer session. Director of Tech, a manager of another department, and a peer were part of the process. All three took turns asking questions and grading each answer on a scale of 1-10", "Interview Questions": "An employee comes to you and says they've made a mistake. How do you deal with the situation?"}, {"date": "28 Dec 2020", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Salt Lake Community College in Aug 2019", "Interview Descriptions": "In person interview with a panel and then you had an interview after with the hiring manager. It was super simple and stress free.  Once you apply you have to wait a few weeks and then you will hear back about the interview. They took about a week as well to send in the offer letter. All offer letters are pending on the completion of a background check.", "Interview Questions": "Why do you want to work here?"}, {"date": "20 Jun 2019", "title": "Survey & Qualitative Researcher Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Salt Lake Community College", "Interview Descriptions": "It was a quick online video interview, possibly because I'm from out of state. There was a panel of four interviewers. They asked me 7-8 questions, and then I asked them a few questions. It lasted about 15 minutes.", "Interview Questions": "How would you design a survey? What kind of challenges have you faced in survey design?"}, {"date": "24 Aug 2018", "title": "Lab Instructor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Salt Lake Community College (Taylorsville, UT) in Aug 2018", "Interview Descriptions": "Met with another instructor who met me for about 1 hour. They reviewed the textbook I would be using and then went over the actual lab if I were to accept the job. They also showed me safety equipment in event of a concern in the lab. She was proud to show me the microscopes and how each student had one.", "Interview Questions": "What did you study? What classes have you taught? What is your teaching experience? How would you do if there was a student with ______ issue? "}, {"date": "14 Dec 2017", "title": "Director, Strategic Communications Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Salt Lake Community College", "Interview Descriptions": "Never interviewed, but wanted to alert older job seekers that the application asked the following question: \"Are you over 40?\" It was not an optional question. My qualifications ticked every one of their required and desired and I got the standard no thanks email right after the job closed.  This isn't sour milk, but I've never seen an organization ask someone's age and it certainly makes this someone over 40 take pause.", "Interview Questions": "Are you over 40?"}, {"date": "8 Nov 2017", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Salt Lake Community College (Salt Lake City, UT)", "Interview Descriptions": "In person interview.  Very relaxed and informal.  Took place on campus in the chair's office.  They had my resume on file and was made comfortable during the process.", "Interview Questions": "Why do you want to teach at Salt Lake Community College"}, {"date": "16 Sept 2019", "title": "Specialist II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Salt Lake Community College (Salt Lake City, UT) in Feb 2017", "Interview Descriptions": "It was pretty straightforward. The only downside, I would say is they usually have someone in mind for the job when they have a listing. So, it can be pretty hard to secure a job.", "Interview Questions": "3 skills and 3 weaknesses."}, {"date": "1 Oct 2017", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Salt Lake Community College (Salt Lake City, UT) in Sept 2016", "Interview Descriptions": "They called me for interview. They asked 5-7 basic questions. They were reading interview questions. They weren't prepared for any answers when I asked some questions. Very unorganized interview process. When I received a job offer, it didn't presented professional way.", "Interview Questions": "Tell me about yourself. "}], [{"date": "2 Aug 2016", "title": "Adjunct Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Salt Lake Community College (Salt Lake City, UT) in Aug 2016", "Interview Descriptions": "My interviewer was easygoing and very pleasant. The whole process felt like an informal conversation rather than an interview. She gave me a few minutes to review the questions she was going to ask and all of them were straightforward like my prior experience and my views on how the class should be conducted. She also asked me to solve some of the problems on the board in order to test whether I knew the material I was going to teach.", "Interview Questions": "What are your views on extra credit?"}, {"date": "21 Sept 2015", "title": "Infrastructure Specialist III Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Salt Lake Community College (Salt Lake City, UT) in Sept 2015", "Interview Descriptions": "Terrible Interview. The job listing did not mention VOIP. Most of the questions were about VOIP. The job description also did not mention that this position was for a Team Lead. I met with 3 members of the team I would be joining. The hiring manager was not even present for the interview. They had a list of 12 questions that they told me they could not elaborate on and they could only ask those questions. \r\n\r\nI was told that the 3 people I met with did not have hiring power and they just send their notes from the interview up to higher ups who would make the decision. \r\n\r\nWith the amount of Bureaucracy I saw just for this interview, I will not be accepting this position if it is even offered to me.", "Interview Questions": "Explain how RTP and SIP help in regards to quality."}, {"date": "22 Aug 2019", "title": "Specialist I Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Salt Lake Community College (Taylorsville, UT) in Mar 2015", "Interview Descriptions": "I interviewed first with the dept manager, what followed was a panel asking questions about my work experience and hobbies. The process was lengthy but not difficult. Cultural fit is not as important as the school celebrates diversity.", "Interview Questions": "What is your experience with customers?"}, {"date": "26 May 2017", "title": "Math Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Salt Lake Community College (Salt Lake City, UT) in Feb 2015", "Interview Descriptions": "Applied online through school's web page. Emailed back within days asking for an in person interview. Interviewed the following week and was offered the position the week after. Process was quick and simple.", "Interview Questions": "What is something challenging for you when working with others?"}, {"date": "13 Oct 2014", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Salt Lake Community College (Salt Lake City, UT)", "Interview Descriptions": "Very formal and structured interview with five people around a giant conference table with me at the head. Interviewers couldn't deviate from a script of pre-determined questions and I wasn't allowed to ask for clarification. Points were given for ability to answer questions satisfactorily. I would call it an interrogation more than an interview. Interviewers had bland, disinterested expressions and monotone voices. I was terrified by the process. I also had to take a computer skills test with no clarification provided. Anyone but an unfeeling automaton would be ruled out of the competition.", "Interview Questions": "There was nothing unexpected, in fact it was very predictable. \"How do you stay organized?\" \"How do you handle conflict?\" In a way, these are very difficult questions because they are so lame. Was told that this is the way HR wants interviews to go so that everyone has an equal chance at the job."}, {"date": "26 Oct 2017", "title": "Adjunct Professor Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Salt Lake Community College (Salt Lake City, UT) in Jan 2014", "Interview Descriptions": "This interview was conducted in person with a current professor of architecture. She contacted me at my current place of employment and asked if I would be interested in working as an adjunct professor.", "Interview Questions": "My education experience. "}, {"date": "29 May 2013", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Salt Lake Community College", "Interview Descriptions": "In-person interview first with committee (5 people), then second interview with hiring manager.  Spiel from an affirmative action rep before you go in, then each person takes turns asking you a question.  Modeled after job description, committee often takes notes while you talk.  Given questions in front of me at table on a piece of paper.  They ask you if you have any questions, and then just say \"thank you\" and return to their note/score sheets and you are expected to pickup your things and leave (very unnerving and unfriendly).  Second interview had me do a test on a computer in MS office, very basic things, writing a memo, making a simple table of figures in excel, etc.  It did take a while to get a call back and for the whole process to complete.  Offer contingent upon background check coming back clean. I know now that not all AA interviews require the test, but if they do they may not tell you beforehand.", "Interview Questions": "What did you like the least about your last boss"}, {"date": "20 Oct 2015", "title": "Adjunct Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Salt Lake Community College (Salt Lake City, UT) in Dec 2012", "Interview Descriptions": "Basic interview with the Dean, nothing special. He asked a lot about hypotheticals: what would you do if you got another full time job, what would you do if a student was like this...that sort of thing. Talked some about my own teaching philosophy and ideas about what I wanted to teach.", "Interview Questions": "What would you do if you got a full time job somewhere else?"}, {"date": "2 Nov 2015", "title": "Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Salt Lake Community College (Salt Lake City, UT) in Oct 2012", "Interview Descriptions": "Panel interview with a hiring committee made up of individuals I would be working with. Each person took a turn asking me a question pre-approved by the HR department. In fact they tapped the list of questions to the table right in front of me so I could refer to them as I was being asked each question.", "Interview Questions": "I was asked about my experience using Social Media in reaching students."}, {"date": "21 Feb 2015", "title": "Secretary Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Salt Lake Community College (Taylorsville, UT) in Jul 2012", "Interview Descriptions": "The interview process was fairly easy for this position. Just one interview with one person. The interviewer was very cordial, mature, and could see my skills very clearly. It was a pleasant, easy process.", "Interview Questions": "Questions about various skills, handling high volume of calls, students, able to network with other departments."}], [{"date": "16 Nov 2015", "title": "Director Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 9 months. I interviewed at Salt Lake Community College (Salt Lake City, UT) in Feb 2012", "Interview Descriptions": "5 Questions as I recall posed by different members of a committee, usually without a hiring manger present, although depends on the work area and manager. \r\n\r\nThe questions are to tie into the job descriptions and be scored sole on the responses and material submitted with the application.  Weighting is to be given for the areas significance to job success.\r\n\r\nThe organization typically has extensive \"primary areas\" I don't think anyone ever told them major areas should represent 20% of the time-so they will have 15+.\r\n\r\nMake sure you use a CV (more detail and length) versus a resume (short and sweet) format, getting volume can matter more.  Being on staff does not mean they know what you can do, and they have to have it in the file for compliance reasons.\r\n\r\nMost areas hire based on disclosed criteria.  I have heard that  some of managers will have a predetermined preference, which the committee may not even know.", "Interview Questions": "Provide a situation where you had to develop consensus among different groups, how did you go about developing that, and overcoming obstacles?"}]]