[[{"date": "4 Dec 2022", "title": "Graduate Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Lamar University (Beaumont, TX) in Nov 2022", "Interview Descriptions": "The interview process typically involves the applicant submitting a resume and/or application to the organization, followed by an interview. The interview may be conducted in person, over the phone, or through a video conference. During the interview, the interviewer will ask questions related to the applicant's experience, skills, and qualifications. The interviewer may also ask situational or hypothetical questions to gain further insight into the candidate's skills and abilities. After the interview, the interviewer may provide feedback to the applicant and the organization may make a decision about whether or not to hire the applicant.", "Interview Questions": "1. What experience do you have in this field? 2. What motivated you to pursue a career in this field? 3. How do you handle stress and pressure? 4. What challenges have you faced in your previous roles and how did you overcome them? 5. What do you think are the most important qualities for being successful in this role? 6. Describe a time when you had to work with a difficult team member."}, {"date": "15 Oct 2022", "title": "Lab Technician Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Lamar University", "Interview Descriptions": "One interview with supervisor about previous experience and technical skills and one other with HR. Easy and straightforward process. The hiring process take a month overall.. The pay is extremely low though", "Interview Questions": "Have you worked with undergraduate students?"}, {"date": "9 May 2022", "title": "Study Abroad Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Lamar University", "Interview Descriptions": "Took some time but when finally met them they were nice and very friendly people. Was called to set up interview then had face to face interview with 3 employees", "Interview Questions": "Event planning, Study abroad, internship"}, {"date": "24 Oct 2022", "title": "Human Resources Generalist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Lamar University (Beaumont, TX) in Jan 2022", "Interview Descriptions": "Confusing, I interviewed for a position that was already filled. We discussed a different position, then was told 2 weeks later that I could not interview for the 2nd position that I already interviewed for, because that isn't the one I originally applied for. That lady then described a completely unrelated position that she thought I was applying for.", "Interview Questions": "Mostly just chit chatted aimlessly."}, {"date": "5 Oct 2021", "title": "Lab Tech II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Lamar University (Beaumont, TX)", "Interview Descriptions": "position posted on lamar company website. I applied and received interview email after one week. The week after I received offer letter. Generally, the interviewer was department Chair, it was easy!", "Interview Questions": "Tell me about yourself? \nWhy you think you'd be a good fit for this position?"}, {"date": "16 Sept 2021", "title": "Associate Director Ug Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Lamar University", "Interview Descriptions": "quick and thought through process, quick turn around, communication was professional, felt the interview process was fair and professional, I would recommend employment at LU. I have no complaints regarding interview or employment", "Interview Questions": "How would you contribute to team"}, {"date": "21 Sept 2020", "title": "Orientation Leader Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Lamar University", "Interview Descriptions": "There were multiple rounds. After the application approval, the first interview was more group activity based. There were different stations (5?) where it demonstrated your interpersonal skills and how you handle certain situations. One we were given props and we had to create an educational skit for potential LU students. After the group interview, if selected, the next step was the questionnaire interview. This was more behavioral based and asked questions about my relationship with LU.", "Interview Questions": "You had to bring in one thing that resembles your time at Lamar University. What is that item?\nWhy do you have to be dissociated from your organizations during your time as an orientation leader?"}, {"date": "19 Dec 2020", "title": "Administrator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Lamar University (Beaumont, TX) in Sept 2020", "Interview Descriptions": "groups, thorough, professional, behavioral based, video interviews, professional, multi disciplined, website  good, met entire team, no students though, applied and received a quick response, online application is dated and had to manually input information which takes a long time, had to request transcripts", "Interview Questions": "N/A"}, {"date": "8 Sept 2019", "title": "Instructional Designer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Lamar University (Beaumont, TX)", "Interview Descriptions": "Had one web conference interview and one onsite interview. Was asked job specific questions. Was asked about my experience. Was asked about problem solving. Was asked about ID models.", "Interview Questions": "How do you create a course?"}, {"date": "29 May 2019", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Lamar University (Beaumont, TX)", "Interview Descriptions": "It was a phone interview conducted by four people. They sent me an email in the morning which had an activity I was supposed to answer in the phone call.  My interview was almost half an hour long.", "Interview Questions": "They gave me an activity to work on"}], [{"date": "20 Dec 2022", "title": "Rec Center Attendant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Lamar University (Beaumont, TX) in Mar 2019", "Interview Descriptions": "Very easy, and the supervisors are pretty chill when it comes to talking to them. They are regular students like you. All the questions are simple to answer. No worries", "Interview Questions": "Why do you think you deserve this job?"}, {"date": "3 Dec 2020", "title": "Student IT Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. I interviewed at Lamar University (Beaumont, TX) in Sept 2018", "Interview Descriptions": "Very basic review of skills and on job duties. More of asking about the potential employee's personality and work ethic than knowledge. An overview of potential job duties was given as well as hourly work limitations.", "Interview Questions": "If a printer was broken how would I solve the problem?"}, {"date": "11 Aug 2020", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Lamar University (Beaumont, TX) in Aug 2018", "Interview Descriptions": "1 Interview and the process was done. Very easy and simple. Staying on campus and going to class on campus. The job was made for students because I got to study a lot.", "Interview Questions": "Can you tell me about yourself "}, {"date": "17 Nov 2018", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Lamar University (Beaumont, TX) in Jul 2017", "Interview Descriptions": "In person interview with the faculty.  We discussed my research idea and his new research project. The faculty asked some basic question about the subject and the went deep with a topic. Introduced me to the way he conducts the class and what he expects me to do.", "Interview Questions": "What is your research interest? How this job will help you to accomplish your future goal?"}, {"date": "23 Sept 2018", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Lamar University (Beaumont, TX) in Mar 2017", "Interview Descriptions": "There are not many qualified or interested students. The professors select the best student who applies for the research assistant job. So, basically, it is up to you to prove your merits. If you have good grades and can show the interest in the research. It should do the work.", "Interview Questions": "Why this research?"}, {"date": "24 Jan 2017", "title": "Adjunct Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Lamar University", "Interview Descriptions": "It was easy for adjunct. Send in your resume to the department chair. And then they contact me to offer the adjunt. So it was pretty simple. I did not have to interview.  I have been adjuct for almost 5 years.", "Interview Questions": "N/A"}, {"date": "12 Mar 2018", "title": "S T A R S Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Lamar University (Beaumont, TX) in Aug 2016", "Interview Descriptions": "It was incredibly easy. As long as you meet the qualifications and are able to tutor needed classes you should get the job. You go in and get asked a few basic questions (mainly about your school and subject experience) then they will likely just give you an offer there. It is possible you get a written test to test your skills in math. However, this is extremely basic.", "Interview Questions": "What classes are you willing/able to tutor?"}, {"date": "12 Jun 2016", "title": "Development Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 2 days. I interviewed at Lamar University (Beaumont, TX) in May 2016", "Interview Descriptions": "Very informative interview of what job entails and expectations  for the position. Small department. Looking for a good fit and someone wanting to stay long term.   I would have loved working there but there was concerns that I was over qualified and would not be satisfied long term", "Interview Questions": "What do you know about the foundation"}, {"date": "17 Jan 2017", "title": "Graphic Designer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Lamar University (Beaumont, TX) in May 2016", "Interview Descriptions": "The interview was well constructed with questions that were fairly easy to answer. It was a 1:1 interview, giving me time to respond adequately. The interview was around 20 minutes long and I had the time to ask questions at the end.", "Interview Questions": "How to you plan to handle multiple deadlines?"}, {"date": "14 Mar 2017", "title": "Resident Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 3 weeks. I interviewed at Lamar University (Beaumont, TX) in Feb 2016", "Interview Descriptions": "Three steps, individual, group and then  individual again. If you can work together, speak up, and have people skills then you're good. It's great for those who don't have a great academic record because they look for people skills", "Interview Questions": "What was the greatest challenge you've dealt with and how did you overcome it?"}], [{"date": "31 May 2019", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Lamar University (Hattiesburg, MS) in Feb 2016", "Interview Descriptions": "It was an over the phone interview.  There was a panel of 3 interviewers that each asked 10 questions a piece. Once they had all asked their questions, they allowed me to ask a few of mine.", "Interview Questions": "How do you adapt to challenges that arise between work and school.  "}, {"date": "26 Nov 2018", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 3 weeks. I interviewed at Lamar University (Beaumont, TX) in Aug 2015", "Interview Descriptions": "Initially you need to submit a aplication form from the university website. Submit to the relevant office or the department. Department schedules a written aptitude test in the university for all the applicants submitted the profile. Then candidates are shortlisted from the test results. The selected candidates are asked to give face to face interview. After 3 weeks the final results are announced. From hundreds of applicants only 2-3 candidates are chosen.", "Interview Questions": "Aptitude and office management related questions. How do you manage two tasks at a time? How do you set priorities? How do you avoid conflicts with other people in the office? How well do you handle MS Office?"}, {"date": "16 Aug 2017", "title": "Assistant Program Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Lamar University (Beaumont, TX) in Aug 2015", "Interview Descriptions": "Meet in front panel of 3 professors/deans/directors, Informal setting, but very formal and specific questions. Interview was very conversational in nature and lasted about 1 hour from start to finish.", "Interview Questions": "Why I would be a good hire?"}, {"date": "24 Aug 2015", "title": "Graphic Design Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Lamar University (Dallas, TX) in Jun 2015", "Interview Descriptions": "I came into the office and got to interview face to face, I showed him my printed portfolio and my digital portfolio with my newest projects got good feedback on my work and advice on my portfolio, so in the end it was more of a portfolio review, but the interview went well and the owner was cool and excited about my work and what I've been up to. An overall friendly interview and guy.", "Interview Questions": "Questions were based off work that I showed him, like; \r\nWhy did you do this design this way? \r\nDid you design the whole mock up?\r\nWhat did you learn in China?"}, {"date": "26 Mar 2018", "title": "Resident Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 months. I interviewed at Lamar University (Beaumont, TX) in Apr 2015", "Interview Descriptions": "Your first year, you needed 2 recommendation letters and had to fill out open ended response questions in an app packet. If they liked your responses, you made the panel interview. After the panel, there was a group interview where they saw how you perform being a part of the team.", "Interview Questions": "How do you manage conflict\r\nWhat one work ethnic problem that you can't work with\r\nWhat type of personalities do  you get along with"}, {"date": "25 Apr 2017", "title": "Resident Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Lamar University (Beaumont, TX) in Feb 2015", "Interview Descriptions": "2 interview process, second one with panel of resident directors, team building activities in group interview. Laid back. Took a couple weeks to hear back.  Sent an email if we were selected and assigned to a specific hall.", "Interview Questions": "How would you handle conflict?"}, {"date": "22 Sept 2016", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Lamar University (Beaumont, TX) in Jan 2015", "Interview Descriptions": "form fillout with course registration and hours available for job,previous employment,\r\nin person question and answers,in person interview,brief questions about basic chemistry,brief questions about basic chemistry,\r\nform fillout with course registration and hours available for job,previous employment,\r\nin person question and answers,in person interview,brief questions about basic chemistry,brief questions about basic chemistry", "Interview Questions": "brief questions about basic chemistry"}, {"date": "23 Mar 2016", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 5 days. I interviewed at Lamar University (Beaumont, TX) in Jan 2015", "Interview Descriptions": "Two interviewers alternated asking questions. They wrote down almost every word I spoke. Questions were mostly standard but included one curve ball (kitchen utensil question). The position was found by word-of-mouth, so the interview was more of a formality for me. It is a good position for me while I continue to work towards my master's degree. I can't wait to get a real job and move out of beaumont.", "Interview Questions": "If you were a kitchen utensil, what would you be and why?"}, {"date": "28 Dec 2014", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Lamar University", "Interview Descriptions": "2 interviews - 1 required from career and testing, the other is for the dept hiring you. \r\n\r\nUsually interview questions are pretty standard with dept specific questions thrown in. \r\n\r\nLimited number of jobs makes it slightly more competitive.", "Interview Questions": "Tell me about a time when.... "}, {"date": "9 May 2015", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Lamar University (Beaumont, TX) in Aug 2014", "Interview Descriptions": "Most of the faculty are interested in PhD students. It is always beneficial to take the courses of the faculty before joining his research group. After sending my CV to the faculty, I was asked to explain one of his research papers.", "Interview Questions": "Regarding research interests. I was given a research paper and was asked to explain."}], [{"date": "2 Aug 2013", "title": "Academic Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Lamar University", "Interview Descriptions": "Met with the Dean, Associate Dean, and the head advisor in the Dean's conference room.  Was asked typical interview questions, greatest strength, etc.", "Interview Questions": "At least for me, the most difficult question was what was the best piece of advice ever given.  "}, {"date": "28 Nov 2014", "title": "Web Developer, Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Lamar University (Beaumont, TX) in Sept 2012", "Interview Descriptions": "First you have to show your capability to the department head. If he likes your experience and resume he may want to talk to you face to face. If you are smart enough to show confident about the  accomplishment of job requirements you are hired. There is only one position open at a time. So its almost mandatory to get a reference from the previous developer who is about to leave his position.", "Interview Questions": "Not that hard. Basically questions about what you have done so far related to software development and database."}, {"date": "1 Jan 2017", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1+ week. I interviewed at Lamar University (Beaumont, TX) in Feb 2012", "Interview Descriptions": "Like any other. Depending on the position you are applying for the interview panel can range from 1 to a whole department. If one is applying for a teaching position then, after providing credential of academic records (publications; patents and conference) and passing that stage, their will be a presentation to the engineering board. The presentation will be an opportunity for the candidate to provide an insight of research interest and accomplishments. Also, provide a path forward pertaining to the research field and if already in possession what grant is available for him/her to fund research. Please note irrespective of wether the candidate already has grants if selected, the school provides research funds support to new faculty members.", "Interview Questions": "what is your motivation to embark in such a journey?"}, {"date": "3 Dec 2012", "title": "Assistant Systems Administrator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Lamar University (Beaumont, TX) in Jun 2011", "Interview Descriptions": "I met the the System Administrator of the Computer Science department at the a Physics expo at school towards the end of the Spring semester in may of of 2011. Towards the end of the Expo we exchanged phone numbers. In June of 2011, he calls me and ask about my interest on the open position. He goes on and ask about skills that I have that set me apart from others and also asked me a specific situation where I had to resolve a difficult problem. He asked me if I could send a copy of my resume to his email, that he would take to the department Chair to verify if I was eligible to work for the department. \r\nThree days later the System Administrator called me back saying that the department Chair would like to meet me in person. The Chair asked me about the same questions, we went over my resume and than he made me the offer to work part-time for the department while I was a full-time student.", "Interview Questions": "Asked me a specific situation where I had to resolve a difficult problem."}, {"date": "8 Jul 2014", "title": "Associate Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at Lamar University (Beaumont, TX) in Aug 2010", "Interview Descriptions": "I was recruited by a tenured professor to move to Lamar from another state university. It was late in the summer and it really put my university n a bind to replace me so quickly. However, I went, and the interview at Lamar was positive and pleasant. Everyone was friendly and positive and the questions mainly centered on my background and experience as a practitioner. They believed that one needed experience in the area they were teaching. I was a match!", "Interview Questions": "Would you be willing to provide your money out of your pocket for traveling to required meetings and conferences/"}, {"date": "13 Jan 2013", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Lamar University (Beaumont, TX) in Dec 2009", "Interview Descriptions": "Because of my past experience with the professors and staff at Lamar, I was contacted by a close friend who knew of an opening in their department.  (Networking is key!)  I met with the Department Chair regarding the possibility of teaching part-time, and asked questions about expectations for an Adjunct Professor.  Everyone was warm and friendly, and after completing the new hire paperwork and a day-long orientation process, I began teaching during the subsequent full term.  The university did lose my new hire paperwork and I had to complete it a second time; however, that did not prevent me from starting my work on time.", "Interview Questions": "n/a - All questions were typical and related to my work experience both teaching and in other industries.  The most challenging questions was whether I was interested in teaching a class centered around material I had not used in a while."}, {"date": "5 Jan 2013", "title": "Research Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Lamar University (Beaumont, TX) in Mar 2009", "Interview Descriptions": "The statement of purpose is the main document required to get in to the University. There after experience in the filed of electrical engineering counts. Only 4 students will be give the research assistant job. If more than 4 are there, on performance basis the job will be given.", "Interview Questions": "none"}, {"date": "17 Aug 2010", "title": "Recruitment Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through other source. The process took 1 day. I interviewed at Lamar University (Beaumont, TX) in Jan 2008", "Interview Descriptions": "The office was very professional. Understanding the roles and responsibilities of the company  was essential.", "Interview Questions": "How vital do you feel part time employment is is to the University setting?"}]]