[[{"date": "5 May 2023", "title": "Marketing Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Kettering Health Network (Miamisburg, OH)", "Interview Descriptions": "An automated email comes first. Once meeting in person, it is Very quick, met with the manager, very friendly. Young environment. They go over experience and discuss the day to day of the position.", "Interview Questions": "Why are you interested in this position?"}, {"date": "26 Mar 2023", "title": "Nurse Practitioner Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Kettering Health Network", "Interview Descriptions": "Very organized with great communication about the process. I met a lot of the staff at once which was great but a little overwhelming at times. They were all so friendly though and gave me a tour of the hospital. I felt like I got a good sense of how it would be to work there.", "Interview Questions": "Tell us the most difficult situation you’ve had at work."}, {"date": "18 Jan 2023", "title": "Patient Registration Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Kettering Health Network in Nov 2022", "Interview Descriptions": "Interview with two to three managers no longer than 40 min, friendly staff, a lot of situational and hypothetical questions. Go over benefits, different positions open, and training process. Background and drug test within next 2-3 days", "Interview Questions": "How I handle disruptive coworkers"}, {"date": "28 Sept 2022", "title": "Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Kettering Health Network", "Interview Descriptions": "First round phone interview with a detailed job description and behavioral questions, then a virtual peer interview with 3-4 other team members,  then in-person skills evaluation, behavioral interview and facility tour.", "Interview Questions": "How do you manage deadlines?"}, {"date": "8 Jul 2022", "title": "Supply Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Kettering Health Network (Miamisburg, OH) in Apr 2022", "Interview Descriptions": "Quick and not stressful. Had 2 interviews one with manager, another with 3 peers. Takes about 2 months to get started. Everyone was extremely polite and professional. Very relatable in the one on one interview.", "Interview Questions": "Why I wanted to work in healthcare"}, {"date": "26 Feb 2022", "title": "Report Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Kettering Health Network (Dayton, OH)", "Interview Descriptions": "Your application will have lot better chance getting selected if you get employee referral! Kettering seems to hire majority of the people through their referral process. Interview process took less than a week. The process was not stressful and went smoothly. I applied through their website and got an email to schedule initial interview after a day of two. The initial interview was 30 mins long with the team manager of the department. The manager talked about the job description and responsibilities. Asked me questions about my experience and skills. I was told that I will have to get Epic certification for this position. I had opportunity to ask lot of questions. It was a very easy and relaxed conversion. \r\n\r\nWe schedule another interview with the manager and 3 other members of the team. It was a 1 hour interview. They asked me basic interview questions and I had the opportunity to ask them more questions. They asked about my experience with SQL, Epic, and Power BI.  I talked about my experience with SQL and Tableau. I also talked about my dedication to learning new skills. I got offer for the position the next day via a phone call from HR.", "Interview Questions": "Tell us about your self?"}, {"date": "28 Mar 2022", "title": "Medical Laboratory Technician Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Kettering Health Network (Troy, OH) in Mar 2022", "Interview Descriptions": "Was called to schedule an interview. Was not informed it would be with 4 area managers which means 3 other managers from places I didn't apply to were in the interview. Interview was virtual, you have to have your camera on but none of the other people in the interview have their cameras on. Was asked multiple times what position I was applying for and what shift, as if they weren't looking for someone for the specific position and shift that I applied for. They asked general interview questions I suppose but there was a lot of silence like I didn't answer their questions sufficiently. They didn't really discuss my work history which was surprising. The main lady starting the interview sounded like she wasn't interested in having an interview so I'm not surprised I didn't get offered a position. This was my first interview for MLT as I will be graduating soon and wanted to have a job before graduation but I guess I will look elsewhere as this wasn't a pleasant experience.", "Interview Questions": "Tell me about a time when you felt you didn't have all the tools you needed, and how you handled the situation.\n\nAre you comfortable multitasking and can you give me an example of a time when you had to multitask?\n\n"}, {"date": "9 Feb 2022", "title": "Helping Hands Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Kettering Health Network", "Interview Descriptions": "Did not hold an interview. Applied for the job and the next week they offered a position at the network. Very rewarding work and fun opportuinities to do different work than normal.", "Interview Questions": "there was no interview held"}, {"date": "11 Oct 2022", "title": "Food Operations Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Kettering Health Network (Dayton, OH) in Feb 2022", "Interview Descriptions": "Quick easy relaxed. Heard back right away. Very professional. Felt the job was important to overall success. Would recommend this job to anyone looking to help make a difference. Great place to work.", "Interview Questions": "Why I chose Kettering Health"}, {"date": "16 Jun 2022", "title": "Marketing Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 3 months. I interviewed at Kettering Health Network (Dayton, OH) in Jan 2022", "Interview Descriptions": "I did not seek this position out or apply. A friend sent my resume to the Comms Director for a networking intro,  who then expressed interest about hiring me instead. \r\n\r\nI was not in Ohio at the time, but the Marketing Director did reach out to explore the role. I was open because I was currently in a big transition phase and was willing to move if the position was worth it. \r\n\r\nThree rounds of interviews. First was just with the Director and was very casual. Ask about my background and if I had any questions. Didn't offer a lot in the way of the role unless I asked. \r\n\r\nSecond was more formal and also just with the Director. When I mentioned my salary range she seemed a bit taken aback. I purposely went high with the expectation that we'd negotiate. She said that wasn't possible for that area of Ohio but did meet me at the lower end. \r\n\r\nThird interview (which came WEEKS later) was put on a call with the 4 other managers at my level. Director was not on the call and did not communicate she wouldn't be there or who else would be present, so I was a bit surprised and thrown off. The team interview was weird. One girl mentioned I seemed more like an executive and didn't understand why I wanted to work there. It felt like they weren't very prepared and maybe told to do this at the last minute.\r\n\r\nI still followed up with a thank you the next day, naming each person and thanking them for their time. No response back. Nothing. Was ghosted and never contacted again. \r\n\r\nIn general, I found the lack of communication and clear expectations about the interview process and role itself to be unprofessional and lazy.  Considering I was asked out of the blue to interview and was not looking for the position, not receiving a formal 'thanks but no thanks' it felt rude and like a tremendous waste of my time. Relayed this to my friend who was pretty angry. \r\n\r\nI gathered from the calls that there are other healthcare networks in that area that pay better and offer more in the way of professional support, so if I were in Ohio actively looking for a Comms role with a healthcare network, I'd try another place first or at least keep your options open while interviewing here. I'd move on if you don't hear anything within a few days after an interview because they won't give the courtesy of a formal no.", "Interview Questions": "Why do you want to work with Kettering Health? \r\nTell me a little about yourself."}], [{"date": "1 Feb 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Kettering Health Network in Oct 2021", "Interview Descriptions": "Interview was fairly straightforward and comfortable. Asked about previous employment and what I liked and didn't like about those positions. Told me about the unit and how it operates. I do feel like the unit was misrepresented in regards to isolation patients. I was told we do not take isolation patients on our unit and I would not have any COVID positive patients and this has been proven to be untrue.", "Interview Questions": "Please see description thank you ."}, {"date": "16 Apr 2021", "title": "Patient Care Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Kettering Health Network", "Interview Descriptions": "They have a great process that actually takes time to learn about your experience and you spend more than 10 minutes talking with someone. Highly recommend. A lot of positions require at least a year of tech experience though", "Interview Questions": "Why are you leaving your current job?"}, {"date": "26 Mar 2021", "title": "Registered Nurse Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Kettering Health Network", "Interview Descriptions": "Lengthy interview process. You are interviewed multiple times by several people. Orientation is an all day event but food is provided. Questions in interview were ordinary. Ok company to work for.", "Interview Questions": "Recall a situation that you"}, {"date": "24 Sept 2020", "title": "Nurse Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Kettering Health Network", "Interview Descriptions": "To me, this was an amazing process! Everything was to the point and didn’t take long at all. I appreciate that questions that were asked and how comfortable I felt during it.", "Interview Questions": "How have you handled an issue with a co-worker in the past?"}, {"date": "6 Oct 2020", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Kettering Health Network (Kettering, OH) in Sept 2020", "Interview Descriptions": "Practice manager talks to you in a very simple manner, explains everything you need to know about the facility, such as pay, benefits, schedule and duties of the position.", "Interview Questions": "About past experiences in the medical field"}, {"date": "24 Aug 2020", "title": "Nurse Practitioner Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Kettering Health Network", "Interview Descriptions": "Respectful, - was recruited while working as a registered nurse.  Given a tour of the clinics where I would work - everyone was very  welcoming and the interview was brief because they already knew me.", "Interview Questions": "When can you start working for us?"}, {"date": "6 May 2020", "title": "Medical Center Representative Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Kettering Health Network", "Interview Descriptions": "Interview went OK. The usual questions. Tell me about a time when you dealt with a difficult customer. I would say it lasted about 20 minutes. The manager seemed nice and friendly.", "Interview Questions": "Tell me about a time you dealt with a difficult customer."}, {"date": "30 Jan 2020", "title": "Registered Nurse, BSN Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Kettering Health Network (Dayton, OH) in Jan 2020", "Interview Descriptions": "The process went well, smooth. Asked lots of questions. I interviewed with doctor, NP, and director that was the contact person. I was shown the clinic and given the process of how things would go on a daily basis. I was told my expectations.", "Interview Questions": "Tell me about a time you had conflict with another employee and how you handled it. "}, {"date": "25 Jan 2020", "title": "RN, Bsn Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Kettering Health Network (Cedarville, OH) in Nov 2019", "Interview Descriptions": "I was able to have a face to face interview with a hiring manager. It was pleasant, professional, and informative. She took my resume and we talked about potential jobs, and I was able to ask her what certain units look like.", "Interview Questions": "Have you worked here before or had any clinicals at our network?"}, {"date": "18 Sept 2019", "title": "Nurse Practitioner Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Kettering Health Network", "Interview Descriptions": "3 interviews: meet the office manager, meet the providers, final decision at corporate HQ. Questions from office manager were equivalent to googling top interview questions for NPs. Never discuss salary in first interview. Orientation set-up through human resources, not office manager.", "Interview Questions": "Why do you want to be a NP? Why are you interested in working here? Strengths? Weaknesses?"}], [{"date": "6 Aug 2019", "title": "Advanced Practice Provider - Electro Physiology Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Kettering Health Network (Dayton, OH) in Jun 2019", "Interview Descriptions": "Had a few email discussions and a preliminary phone interview with the APP Recruiter.  Conversation was great, lasted around 45-50 minutes, we had a lot in common.  Discussed a lot about my past experience in Cardiology and specifically in Electrophysiology.  Took notes and said he would forward them to the Cardiology team who would then contact candidates to set up another interview or to let them know they were not selected to move forward in the hiring process.", "Interview Questions": "Tell me about your experiences in Cardiology.  Why did you choose the graduate study path that you chose?  Why did you apply with Kettering Health System?"}, {"date": "7 Jul 2019", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Kettering Health Network (Kettering, OH) in Jan 2019", "Interview Descriptions": "Group interview with 6 individuals. Timed for 20 minutes. Very difficult to ask questions. Had to pick from 2 days within a 3 week time frame when they were conducting interviews. Once offered the position, they didn't give me 2 weeks to tell my current employer which was stressful because they wanted to start training quickly.", "Interview Questions": "Why did you choose us?"}, {"date": "18 Sept 2018", "title": "Team Lead Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Kettering Health Network", "Interview Descriptions": "Kettering does behaviorial based interviews asking you to describe situations and how you handled them based on their questions.  This was followed by in-depth description of the job.", "Interview Questions": "Was there a time you did not agree with management decision? How did you handle this?"}, {"date": "16 Sept 2018", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Kettering Health Network in Sept 2018", "Interview Descriptions": "Interview process was quick and painless. Just had one interview with the Nursing Supervisor and Nurse educator on the unit I applied to. Both were very nice and created a calm, positive atmosphere. I was offered the position at the end of the interview. Probably lasted about 20-30 min.", "Interview Questions": "Tell me about yourself?\r\nDescribe a time you went above and beyond?\r\nDescribe the worst shift you ever worked?\r\nAsked about previous work experience."}, {"date": "3 Sept 2018", "title": "Scheduler Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Kettering Health Network (Miamisburg, OH) in Aug 2018", "Interview Descriptions": "Submitted online application via website. Was contacted within a week via phone to schedule an in-person interview with department supervisor and manager. Went on interview and spoke with supervisor and manager separately. Job shadowed for 45 minutes. Received a call with an offer the very next day. Currently in the process of providing references and background check.", "Interview Questions": "What are 2 strengths/weaknesses you have?"}, {"date": "13 Jul 2018", "title": "Office Assistant I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Kettering Health Network (Dayton, OH) in Jul 2018", "Interview Descriptions": "I met with the manager there she was very nice and professional. Questions asked were basic interview questions. She was very easy going and personable which made the interview flow naturally.", "Interview Questions": "Describe a time you had a difficult situation at work, and how did you handle it?"}, {"date": "5 Apr 2018", "title": "Administrative Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Kettering Health Network (New York, NY) in Mar 2018", "Interview Descriptions": "Honestly the hiring process has really dragged out. Took a while to hear back. Phone interview. A week to hear back from that. Then scheduled a in person interview two weeks later. 3 people interviewed me at once.  They did try and make it a pleasant experience, small talk before to ease the situation.", "Interview Questions": "interview questions"}, {"date": "22 Mar 2018", "title": "Clinical Nurse Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Kettering Health Network (Kettering, OH) in Mar 2018", "Interview Descriptions": "I was called for an interview a month after applying. Quit setup for the interview. Slow to notify on job offer. 2 step proceeds was done. 1 meet and talk with directors and 2 m eet with directors, managers, ancillary department heads, and HR.", "Interview Questions": "What would you do if..."}, {"date": "28 Nov 2021", "title": "Trainer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Kettering Health Network in Mar 2018", "Interview Descriptions": "Had to create a power point presentation. Sat in a group of 6 people, first was a phone interview, next step was a presentation. It wasn’t bad interview, but the actual job was just teaching it was a lot more to it and very overwhelming.", "Interview Questions": "Just your basic psychological questions"}, {"date": "1 Feb 2018", "title": "Administrative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Kettering Health Network", "Interview Descriptions": "Simple and straightforward. Very direct with the questions and responses as they pertain to the position in which you are applying. Easy and laid back process. Interview was one that was enjoyable and to the point.", "Interview Questions": "N/A"}], [{"date": "7 Mar 2018", "title": "Medical Records Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Kettering Health Network (Miamisburg, OH) in Feb 2018", "Interview Descriptions": "Interview Process was smooth.  Interviewer asked me about \"myself and my experience\" and after that she took a Behavioral assessment interview.  It was 30 minutes interview with so many behavior related question, \"Give an example of a goal you reached and tell me how you achieved it.\r\nGive an example of a goal you didn't meet and how you handled it.\r\nDescribe a stressful situation at work and how you handled it.\"", "Interview Questions": "Give an example of a goal you reached and tell me how you achieved it.\r\nGive an example of a goal you didn't meet and how you handled it.\r\nDescribe a stressful situation at work and how you handled it."}, {"date": "23 Oct 2017", "title": "Admitting Representative Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Kettering Health Network in Sept 2017", "Interview Descriptions": "We talked briefly about work, & non-work related things.  The interview was short & sweet, I was asked a handful of normal interview questions.  Ultimately they went with someone different, as I didn't hear anything back until I emailed the supervisor my follow-up email!", "Interview Questions": "They asked about a time when at a previous employer who changed the procedures, how I was able to cope with the changes."}, {"date": "19 May 2017", "title": "Scheduler Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Kettering Health Network (Kettering, OH) in May 2017", "Interview Descriptions": "Applied for scheduler position at the cancer center. Met with the manager, Laura, who was very nice and relaxing to interview with. We talked about work and non-work related things. She took me on a short tour of their new facilities.  I was told that I would hear back but did not hear anything for almost 2 weeks. At that point I was told it was between me and one other candidate and that she would make her decision and contact HR to begin the process but I would hear back from her either way. A week later, I still have not heard from her or HR so I'm assuming I did not get the position.", "Interview Questions": "Why do you want this job?"}, {"date": "10 Mar 2017", "title": "Office Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Kettering Health Network", "Interview Descriptions": "Process went very smooth.  You receive a call to set a date for the interview.  You meet with the manager.  My interview was a 1:1 and I heard back within a week.", "Interview Questions": "How do you handle stress."}, {"date": "31 Jan 2017", "title": "PACU MANAGER Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Kettering Health Network (Dayton, OH) in Jan 2017", "Interview Descriptions": "Interviewed with Director. Scheduled by HR. It lasted an hour; was structured and fairly routine. Director was direct about expectations. She was clear about next steps. She needed me to wait until she was finished with an unscheduled interaction with staff. I think HR could have done a better job with instructions and directions.\r\nI have a second interview", "Interview Questions": "Why I wanted to work at Kettering? What is my background (both leadership and clinically)? What is my communication style?"}, {"date": "28 Feb 2017", "title": "Network Recruiter Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Kettering Health Network in Nov 2016", "Interview Descriptions": "Prescreen, face-to-face with team, face-to-face with VP, assessment, face-to-face with Director/team. The assessment was 90 minutes over the phone. The team is very inviting and welcoming. No one played the bad cop during the process.", "Interview Questions": "What is so appealing about KHN that would make you want to work here?"}, {"date": "16 Oct 2017", "title": "Leave Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Kettering Health Network (Dayton, OH) in Oct 2016", "Interview Descriptions": "The interview process was a panel of Managers and Directors of that dept. They would proceed with behavioral questions and then go into my past experience. They have also asked how my experience related to the job I had applied for?  The interview was vague in my opinion because, they already knew whom they wanted for this position. I felt I was being interviewed to keep within legal processes.", "Interview Questions": "The questions are behavioral questions. For example: Tell me a time when you helped a patient who was upset, and how did you handle the situation?"}, {"date": "5 Oct 2017", "title": "Program Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Kettering Health Network in Oct 2016", "Interview Descriptions": "You send in your resume and meet with the manager of that department and staff and tour the location, They go over what they expect in their employee. you go through a screening no nicotine in your system!", "Interview Questions": "Where do you see your self in five years"}, {"date": "14 Sept 2016", "title": "Administrative Fellow Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Kettering Health Network (Dayton, OH) in May 2016", "Interview Descriptions": "I have not gotten a chance to interview yet but from the time I applied to received an interview was very quick and streamline. It is nice to have such an organized group to deal with so that it is not dragged out for weeks.", "Interview Questions": "Tell me about yourself"}, {"date": "26 Feb 2017", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Kettering Health Network (Kettering, OH) in Apr 2016", "Interview Descriptions": "A lot of steps to go through for a position and it takes forever for them to get back to you. In the end I chose another opportunity. This is a tedious process unless you know someone that already works there.", "Interview Questions": "Tell me about how you handled a conflict with a manager"}], [{"date": "15 Mar 2016", "title": "Nutrition Service Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Kettering Health Network", "Interview Descriptions": "Very calm and laid back there was 3 people in a room from different hospitals asking questions. The lady's who interview are very chilled and make it a comfortable situation.", "Interview Questions": "Tell Me About A Time You Had To Be A Leader?"}, {"date": "9 Mar 2019", "title": "Clinical Lab Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Kettering Health Network (Beavercreek, OH) in Dec 2015", "Interview Descriptions": "A personal one on one interview with the immediate supervisor and her attitude made me feel right at home ! She was very personable and very down to earth! The explanation of job requirements and responsibilities were given in full detail and she asked if I had any questions after each description!", "Interview Questions": "Why are you wanting to work for Kettering?"}, {"date": "14 Aug 2015", "title": "Administrative Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 3 days. I interviewed at Kettering Health Network (Huntsville, AL) in Apr 2015", "Interview Descriptions": "Kettering Health Network came to my school,Oakwood University, to do a presentation and gauge the interests of students. I interviewed with them when they first came down and then they followed up by inviting us to fly up to Dayton and have a full day of interviewing with the executive team.  The third time 2 executives drove back to my school, we interviewed again and they offered me a position.", "Interview Questions": "Demonstrate a time you showed leadership in the workplace?"}, {"date": "2 Jun 2015", "title": "Patient Transporter Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at Kettering Health Network (Kettering, OH) in Jun 2014", "Interview Descriptions": "Easy. Not a lot of pressure. Met with direct supervisor and manager of department. Sat at a desk with them and they asked several questions. The entire interview only lasted about 20 minutes. They also asked about any applicable training or education that I had.", "Interview Questions": "Tell me about a difficult situation at a previous job and how you worked through it. What do you see yourself doing in five years. What makes you want to work here."}, {"date": "14 Jan 2018", "title": "HUC/NA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Kettering Health Network (Dayton, OH) in Jun 2014", "Interview Descriptions": "It was good , very easy and thorough at the same time. A great interview at that. I would love if all my interviews went this well and smooth.", "Interview Questions": "If I would make this a career"}, {"date": "21 Oct 2013", "title": "Admissions Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Kettering Health Network", "Interview Descriptions": "Please be aware that all of Kettering Health Network is TERRIBLE at the hiring process. From the beginner job page to the long waits and inexcusable HR/management inconsistency. \r\n\r\nWith that said...\r\n\r\nApplied through the KHN website and waiting for a call. Don't bother with watching the \"progress\" page as I have never heard it to be accurate.\r\n\r\nReceived a call for interview > Received phone interview which lasted about 30 minutes (as we know, phone interviews can last from 10-50 minutes, so plan accordingly) > in-person interview.\r\n\r\nThey'll either tell you right there or with a phone call if you have secured the position--it happened for me and everyone I know who works there.", "Interview Questions": "\"What kind of flower are you?\""}, {"date": "29 Jan 2013", "title": "RN Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Kettering Health Network in Jan 2013", "Interview Descriptions": "resume HR call back , HR interview, Unit manager interview peer interview", "Interview Questions": "There really wasn't any.. be honest and it works the best. "}, {"date": "18 Apr 2014", "title": "Medical Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Kettering Health Network (Beavercreek, OH) in Jan 2012", "Interview Descriptions": "Very smooth, and pointed questions", "Interview Questions": "What did I do doing an argument with a co-worker"}, {"date": "9 Nov 2015", "title": "Health Unit Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Kettering Health Network in May 2011", "Interview Descriptions": "Interview consisted of a sit down with HR where basic interview questions were asked about what made you well suited for the position and your strengths and weaknesses. Asked if there was any management style you disliked. Overall the interview took about 20 minutes. Second interview was with the unit manager which involved a tour of the hospital and the unit specifically meeting some of the staff. Sit down interview in their office which took about 15 minutes asking more experience related questions and about individual characteristics and goals.", "Interview Questions": "What experiences have you had that would lend you well to this position?"}, {"date": "18 Jan 2012", "title": "Nursing Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 1 day. I interviewed at Kettering Health Network (Dayton, OH) in Apr 2010", "Interview Descriptions": "The interview was very quick.  I received a tour of the facility and my questions were answered.  I met the management and my future coworkers.  Pay was not discussed.  I really liked the hospital so I decided to work there without hesitation", "Interview Questions": "What is your weakness?"}], [{"date": "27 Nov 2013", "title": "Financial Analyst Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Kettering Health Network in Aug 2009", "Interview Descriptions": "Grueling interview process.  Initially met with department director.  Then was brought back for a second interview with a table full of no less than 10 people!", "Interview Questions": "N/A"}]]