[[{"date": "12 Jun 2023", "title": "Project Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Save the Children (Rome)", "Interview Descriptions": "Il colloquio per la posizione include una serie di prove scritte e un'intervista orale, mirate a valutare le competenze tecniche e la compatibilità con l'organizzazione. Questo processo di selezione è fondamentale per identificare il candidato ideale.", "Interview Questions": "come la tua esperienza di lavoro attuale puo' essere utile in questo incarico?"}, {"date": "11 May 2023", "title": "Philanthropy Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Save the Children (New York, NY)", "Interview Descriptions": "The questions were mostly scenario based questions but they sent them before the interview which was very helpful as you were able to prepare. The interviewers were friendly and gave helpful feedback", "Interview Questions": "Tell us about a time where you had to influence a cold prospect"}, {"date": "10 May 2023", "title": "Data Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Save the Children (Berlin) in May 2023", "Interview Descriptions": "They were so nice and friendly without any stress. The company's atmosphere was friendly, and I felt like I was talking with my friends during the interview. Even the team leader was a nice guy.", "Interview Questions": "I am still waiting for their answer."}, {"date": "16 Apr 2023", "title": "Trainer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Save the Children (Cairo, Cairo Governorate)", "Interview Descriptions": "1 hour of question related to technical and team work and it’s not easy to get shortlisted until you have someone from inside and the panel consists of three members and they measure a lot of things", "Interview Questions": "What is the team member characteristics that you can’t deal with"}, {"date": "10 Apr 2023", "title": "Advocacy Advisor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Save the Children", "Interview Descriptions": "I had four rounds of interviews for the Advocacy Advisor position: a writing assessment with 6 questions, a 1:1 interview with the position's supervisor, a panel interview with the advocacy team, and a 1:1 interview with the department head.", "Interview Questions": "Questions asked during the writing assessment: 1) What is most important to you in the next step of your career? Why do you feel that this position is the right step for you? 2) What is your experience working on political or advocacy campaigns. 3) Describe your experience in strategic planning. What steps did you take during planning? Tell us about the presentation of the proposal. 4) Please share an example where you have influenced stakeholders, either internally or externally. What steps did you take and what was the result 5) Tell us about an accomplishment you’re proud of. What did you learn 6) What experience do you have with working with Board of Directors? What did you enjoy the most and what challenges did you face in the work? Questions asked during interviews: 1) Based on the job description, what are your strengths that are detailed in the JD? 2) What skills have you developed that would make you successful in this role? 3) How do you approach organizing deadlines and projects with colleagues? 4) Think of a time where you affected change where you had some amount of influence. What happened? 5) Give an example of of when you managed conflict at a senior level: what was the situation, what was my role, what actions were taken, and what was end result? 6) Describe your experience working with others that have different backgrounds than your own 7) What do you expect to be the biggest challenges in this role? 8)"}, {"date": "12 Apr 2023", "title": "stage comunicazione Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Save the Children (Rome)", "Interview Descriptions": "2 colloqui, uno conoscitivo e uno tecnico in cui era richiesto di mostrare la propria personalità e le proprie abilità professionali. Colloquio stimolante e esperienza assolutamente positiva. Le responsabili mettono a proprio agio il candidato", "Interview Questions": "Domande per approfondire percorso di studio e percorso professionale"}, {"date": "21 Feb 2023", "title": "Contractor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Save the Children", "Interview Descriptions": "The interview process was clear and straightforward. It was clear considering the ever shifting, complexity of needs for a project. There wasn’t much of a wait time between communication channels and this was distinct against other organizations navigating bureaucracy. The staff was kind and professional and this was also notable.", "Interview Questions": "Tell me about your background. What would previous organizations say about you."}, {"date": "18 Feb 2023", "title": "Shop Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Save the Children", "Interview Descriptions": "The interview process was very natural and the shop manager taught all the in-store tasks through two hours. At the same time getting your hands on the execution。Culling clothes, pricing, cashiering and window display", "Interview Questions": "Why did you come to volunteer?"}, {"date": "24 Feb 2023", "title": "External Collaborator-Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Save the Children (Waikabubak) in Jan 2023", "Interview Descriptions": "It was okay. they ask you more about you experience in handling children and communities, and how you handle a fast paced environment work. i got the offer 3 days after the interview", "Interview Questions": "What is you experience in handling children and communities."}, {"date": "4 Jan 2023", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Save the Children in Dec 2022", "Interview Descriptions": "First off there was a written test conducted virtually, if you were successful you were invited for a face-to-face interview at their offices. If you are successful they will request three references from you.", "Interview Questions": "Would you rather finish a task fast or do the task efficiently"}], [{"date": "27 Feb 2023", "title": "Program Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Save the Children in Dec 2022", "Interview Descriptions": "I was contacted by HR for an initial screening call. After the initial screening call I was invited to a 1 hour panel interview with my perspective supervisors. the Panel interview was divided into categories from technical questions, to people management questions.", "Interview Questions": "Scenario based questions on how I would manage programing issues."}, {"date": "13 Nov 2022", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Save the Children", "Interview Descriptions": "Took about a little over a month to respond to an interview. Overall, very easy-going interview process; asked me basic questions. It took around 20-30 minutes and got an offer a week after the interview.", "Interview Questions": "Why were you interested in this position? What experiences do you have that make you a good fit for this internship?"}, {"date": "9 Nov 2022", "title": "HR Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Save the Children (Ḩawwārah, Amman Governorate)", "Interview Descriptions": "The interview usually has 2-3 pannels asking general HR questions and one of them is about the organization's policy, which they already send by email before the interview. in addition, they look to your English skills to be good and you can explain your ideas clearly.", "Interview Questions": "Introduce yourself. What is your management style? Did you read our policies and what did you understand?"}, {"date": "2 Mar 2023", "title": "Lead Associate Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Save the Children in Oct 2022", "Interview Descriptions": "The first step was an email with a few detailed questions about you and your expectations for salary. I thought they were great questions to start and set the tone for both sides.", "Interview Questions": "They asked for specific examples of my experience using Microsoft Excel."}, {"date": "26 Oct 2022", "title": "Program Advisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Save the Children in Oct 2022", "Interview Descriptions": "Poor. I was contacted over a month after I submitted my application to answer some supplementary questions. In that email I was told that they were \"fast-tracking\" the hiring for this position, and needed the responses back in 48 hours. I returned the answers, but wasn't contacted again for several weeks. They finally responded, inviting me for an interview. The HR person said the hiring manager would contact me within the next couple days to set up an appointment. Two weeks later, I contacted them again to inquire about the interview. When we finally scheduled the interview, they were ten minutes late to start. The interview questions were merely the exact same questions as the written questions. The entire process was quite unprofessional, and I'm disappointed that I didn't read the reviews about the company sooner.", "Interview Questions": "Tell us how you would safeguard employees. Tell us how you would safeguard children."}, {"date": "9 Sept 2022", "title": "Senior Technical Advisor Child Health and Nutrition Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Save the Children", "Interview Descriptions": "Fair. The interview lasted for an hour, and I needed to finish another written test prior to the interview. At least one question in the interview and the written test were about their organizational policies concerning children's safety.", "Interview Questions": "Organizational policies concerning children's safety, which they send you to read prior to the interview."}, {"date": "28 Aug 2022", "title": "Managing Director, Monitoring and Evaluation Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 5 months. I interviewed at Save the Children (Washington, DC)", "Interview Descriptions": "Started with two rounds of essay questions about experience, leadership style, salary history, communications approach, and navigating politics. Then an interview with the VP followed by a panel interview with the supervisor and colleagues from different teams. I was offered the position but got a lot of pushback when I requested to give my employer a months notice, which seems standard at this level of leadership. Ultimately, I got major red flags about the leadership style and work culture.", "Interview Questions": "Technical skill set. Content expertise. Leadership and management style. Experience with conflict resolution/problem solving. Anticipated challenges."}, {"date": "12 Aug 2022", "title": "Analytics Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Save the Children", "Interview Descriptions": "Interviewed by someone junior to the role who only actually asked 2 questions but spoke a lot and meant really couldn’t show of skills or suitability for the job. Found out afterwards has happened with all 10+ candidates put forward so far so feels like process isn’t working", "Interview Questions": "Only 2 asked in total 30m interview "}, {"date": "9 Aug 2022", "title": "Program Intern Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Save the Children (Shanghai, Shanghai) in Aug 2022", "Interview Descriptions": "send cover letter and cv\na phone call to make an appointment for an interview\na 25 minutes interview\nThe HR team is nice and the process is efficient.A very good experience.", "Interview Questions": "Tell me about yourself\nWhy our organization?\nShare some relevant experiences."}, {"date": "12 Nov 2022", "title": "Program Officer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Save the Children (Shanghai, Shanghai) in Aug 2022", "Interview Descriptions": "The interview panels were made up of 3 project staff and a HR staff. Basically a competency-based interview, ask you to use example to elaborate some of your skills and experience. Salary for national staff is low.", "Interview Questions": "Q: planning and organization skills Q: stakeholder communications Q: donor communications Q: M&E skills"}], [{"date": "14 Jul 2022", "title": "Admin Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Save the Children", "Interview Descriptions": "Process was ok.  Office was small.  Not really convenient to get to.  Not too far from the subway. Didn't think room for growth. If you like to work in a small office environment, with same faces, this could work for you.", "Interview Questions": "What do you know about Save the Children?"}, {"date": "15 Mar 2023", "title": "Advisor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Save the Children in Jul 2022", "Interview Descriptions": "The first phone screen took about 15 minutes and they asked me general questions about my experience in Community Development and about my past experience. This was conducted by someone outside the \"team\" they were hiring. Then, I was sent a list of questions to answer in short paragraph form and resubmitted. Then, I had a second interview with one person on the actual team where they asked more technical questions about community development work and the actual subject area I would be working in.", "Interview Questions": "Please share your experience with cultivating partnerships and building relationships with stakeholders."}, {"date": "1 Jun 2022", "title": "Senior Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 3 weeks. I interviewed at Save the Children", "Interview Descriptions": "I had 2 rounds of interviews. The first round was with the recruiter for the role and a colleague.  The second was with 2 more senior employees. \r\n\r\nThe interviewers asked typical questions, including behavioral questions specifically related to the job description for the role.", "Interview Questions": "Why do you want to work for Save the Children?"}, {"date": "6 Mar 2023", "title": "Lead Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Save the Children in Jun 2022", "Interview Descriptions": "After applying online, I received an email several weeks later from an HR representative asking me to answer several (5-10) background questions. After submitting responses to those questions, I was then contacted by someone from the hiring team to schedule an interview over Zoom.", "Interview Questions": "Q: What is one aspect of the job that you feel would come naturally, and one aspect of the job that would require some adjustment?"}, {"date": "25 May 2022", "title": "Snr Health Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Save the Children", "Interview Descriptions": "First is the written interview where a set of carefully chosen test questions (technical) are administered and to be resubmitted back within 2 hours. This is followed by a panel interview comprising the hiring manager, technical advisor, HR Manager and other departmental heads. The next level is the interview with the head of mission.", "Interview Questions": "What is child Safeguarding, and how do you ensure it?"}, {"date": "18 May 2022", "title": "Shop Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Save the Children", "Interview Descriptions": "I found the  interview process to be straight forward and relaxed. I was asked some questions about availability and to expand on some of the information I had put in my written application.", "Interview Questions": "When are you available to volunteer?"}, {"date": "27 Mar 2022", "title": "Advocate Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Save the Children", "Interview Descriptions": "Before being asked to interview, I answered 4 in detail questions related to the position over email, after submitting my cover letter and resume. During the interview, they asked technical questions about the position, no \"general\" interview questions. The interviewers were nice but professional.", "Interview Questions": "What are your experiences in advocacy? "}, {"date": "28 Mar 2022", "title": "Senior Associate Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Save the Children (New York, NY)", "Interview Descriptions": "The overall interview process went well and everyone I have interviewed with from HR to the team I was going to join was great. First step was basic screening questions with HR, and then second step was interwiew with the hiring manager for about 45 minutes. Afterwards , an hour interview with the panel of three people that also went well.\nWhat I absolutely hated is the fact that they asked about the minimum salary that I wanted during the screening questions, and then after the  multiple interviews, they make an offer lower than my minimum request ....and that was the best they could do. Even for such a great company, I am not willing to settle for less than what I believe is a fair rate.  Let's be respectful of one another's time and start acting like mature people.", "Interview Questions": "What is your motivation to work with Save The Children?"}, {"date": "23 Mar 2022", "title": "Superviseur HSE Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Save the Children", "Interview Descriptions": "Le jury était très patient et vraiment à l'écoute. Il ont posé des questions des questions pertinentes et savait aussi faire les relances . Il n'hésite pas à motiver le candidat qui se sent pas à la hauteur", "Interview Questions": "Quel sera votre apport pour la structure"}, {"date": "11 Mar 2022", "title": "Associate Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Save the Children", "Interview Descriptions": "The interview process for this position was fairly standard.  I had an initial email from HR with screening questions that I needed to answer, followed by a panel interview with 4 staff members.", "Interview Questions": "Why are you interested in this role?"}], [{"date": "8 Mar 2022", "title": "Child Protection Practitioner Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Save the Children", "Interview Descriptions": "Easy to follow, with clear steps, friendly environment and clear objectives. The interviewers seemed particularly interested in verifying knowledge of safeguarding policies from the candidate. This was a major priority for the role", "Interview Questions": "Knowledge of safeguarding policies was inportant"}, {"date": "7 Apr 2022", "title": "Development Officer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Save the Children in Mar 2022", "Interview Descriptions": "Applied online and was asked to do a Zoom Interview with HR. It was quick and relatively painless but the interviewer seemed very inexperienced  which makes it a little awkward. Questions were so broad and vague that it was hard to know what they were getting at - like, “Tell me how you build partnerships.” At the end, I asked about the rest of the process and she assured me I’d hear from her within a week. One month and two follow-up emails later and I’ve still not heard from them again. If you have time to interview someone for 30 minutes, you have time to send them a quick email about the status of their candidacy. Disappointing and unprofessional.", "Interview Questions": "Tell me how you build partnerships."}, {"date": "24 Feb 2022", "title": "Supply Chain Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Save the Children", "Interview Descriptions": "They ask you for an exam after receiving the application. based on the exam, they contact you for interview. based on that they decide whether the applicant is the right fit.", "Interview Questions": "How could you navigate the  differences shattering the country?"}, {"date": "15 Feb 2022", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Save the Children", "Interview Descriptions": "I applied online the the jobs portal and within a week or so was invited for an interview  by phone with two people in the department.  I answered questions about my background, my studies, and my interests.  I heard back a couple days later that I got the position.", "Interview Questions": "Please tell us about yourself."}, {"date": "6 Mar 2022", "title": "Influencer and PR Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Save the Children (New York, NY) in Feb 2022", "Interview Descriptions": "I applied online and a recruiter reached out. She wanted me to answer a few job-related questions and reached back out to let me know someone on staff wanted to interview me. It was a fairly easy interview. The staffer let me know there had been a lot of recent turnover and she was in the process of constructing a new team. She said she was still interviewing other candidates at the time. It's been about 2 weeks and I haven't heard back from the organization at all.", "Interview Questions": "Why do you want to work here?\r\n\r\nHow does your experience apply?"}, {"date": "13 Jan 2022", "title": "Oficial de salud Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Save the Children", "Interview Descriptions": "Agradable , puntual, una entrevista de manera horizontal con 3 reclutadores, muy amables, en tiempos adecuados , la entrevista fue virtual duro aproximadamente 30 minutos en un marco de preguntas de 3 minutos por respuesta, dividido entre 3 reclutadores que realizaban preguntas con respecto a tu experiencia laboral, desempeño en momentos complicados , psicologicos etc.", "Interview Questions": "Experiencia laboral y como enfrentar los retos"}, {"date": "3 Jan 2022", "title": "Marketing Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Save the Children", "Interview Descriptions": "The interviewer was very polite and accessible. She explained well the job, posed relevant questions for the position, and made me fell comfortable. The interview was online and it took about 40 minutes.", "Interview Questions": "Why do you want this position and how it relates to your past professional experiences."}, {"date": "22 Feb 2023", "title": "Program Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Save the Children in Jan 2022", "Interview Descriptions": "applied via online and online interview with 4 panelists, regional manager, director, Health TA and HR . Duration 1 hour question and answer related to how to manage program and maintain communication with stakeholder", "Interview Questions": "program management , technical aspect related to program, multitasking skill"}, {"date": "16 Nov 2021", "title": "Digital Marketing Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Save the Children", "Interview Descriptions": "It was very smooth and easy going  , they asked a lot of questions about the Save the children's vision and other skill based questions. Overall it was a good experience  the both interviews were very nice and knowledgeable.", "Interview Questions": "When is a time you resolved an issues in you last employment.  "}, {"date": "5 Nov 2021", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Save the Children", "Interview Descriptions": "the interview was online they asked about my expectations and motivation for the internship. then they explained to me what was their expectations.  it was not too long like 15 minutes", "Interview Questions": "why did you choose this organization"}], [{"date": "2 Oct 2021", "title": "Child Protection Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Save the Children (Sarajevo)", "Interview Descriptions": "20 minute online process, pretty simple. Education background, work experience and motivation is important. Easy to prepare for, just prepare your PC and learn about your specific location of work ( country, situation)", "Interview Questions": "Say something about your motivation."}, {"date": "18 Sept 2021", "title": "Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Save the Children", "Interview Descriptions": "1 hour meeting with different technical questions appropriate to the job, nothing too complicated or creative, but the responses had to be specific and elaborate. About 15 to 20 questions.", "Interview Questions": "What are the common challenges of [specific process] for [specific target group]"}, {"date": "10 Sept 2021", "title": "SBCC Senior Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Save the Children", "Interview Descriptions": "One  round written exam remotely with in the given fixed time \nOne  round interview for more than an hour \nOne  round written exam remotely with in the given fixed time \nOne  round interview for more than an hour", "Interview Questions": "What SBCC models used for WaSH services? "}, {"date": "6 Oct 2021", "title": "Child Protection Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Save the Children in Sept 2021", "Interview Descriptions": "Resume selection and then online panel interview with two program officers and the HR. Start with self-introduction and then Q&A, what questions do I want to ask. A bit casual chat in the end.", "Interview Questions": "Thank god no \"tell me about a time when you...\" type of storytelling questions. The interview is more about the motivation, expectation and actual knowledge of the program, as well as some organizing skill questions."}, {"date": "26 Nov 2021", "title": "Intern Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Save the Children (Nairobi) in Sept 2021", "Interview Descriptions": "the interview was great though I was not chosen and I believe I would have been chosen if I had prepared well. the interviewers were friendly and made me at ease", "Interview Questions": "can you tell us about yourself"}, {"date": "10 Jul 2021", "title": "Praktikum Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Save the Children", "Interview Descriptions": "small talk first and then they started to ask question based on my CV and later my further plan about master. They were very nice and kind. It was a good interview", "Interview Questions": "Problem solving, Hobbys, What i will study in master."}, {"date": "3 Jun 2021", "title": "Scrum Master Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Save the Children", "Interview Descriptions": "telephone screening to talk about general role and experience, and then invired to a second interview via  video call with hiring manager and lead agile coach and a scrum master, they asked 3-4 questions each.", "Interview Questions": "describe a time you overcome a difficult situation. "}, {"date": "11 Oct 2022", "title": "Assistant Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. I interviewed at Save the Children (New Delhi) in Jun 2021", "Interview Descriptions": "The interview process was lengthy and took a long time to close.  There were several days where there would be no response even after follow ups.\r\nThe HR personnel was not supportive enough to enable a smooth transition.", "Interview Questions": "Round one comprised of basic introductory questions. Round two was more organisation specific and round three was primarily on compensation negotiation"}, {"date": "4 May 2021", "title": "Awards Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Save the Children", "Interview Descriptions": "I firstly sent my CV and Cover letter on their platform, then I have been pre-selected and invited to Videocall interview with a panel of three representatives.  After two weeks I have been contacted and offered the position.", "Interview Questions": "Most of the questions were technical. However, I was given the time to present myself and express my motivation."}, {"date": "16 May 2021", "title": "Operations Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Save the Children (London, England) in May 2021", "Interview Descriptions": "First  stage was a pre call, and if successfully,  second stage had 10 a minute presentation followed by competency based questions from the group. This was done over teams online.", "Interview Questions": "How to keep team motivated? How to  support multiple teams with limited resources "}], [{"date": "13 Apr 2021", "title": "Grants Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Save the Children", "Interview Descriptions": "The interview came through quickly, but the actually interview was somewhat disjointed. It seems like the people interviewing me were concerned that I was overqualified and focused on that, rather than asking why I was interested in the position and what I had to offer.", "Interview Questions": "What didn't you like about your last job? "}, {"date": "10 Apr 2021", "title": "MEAL Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Save the Children", "Interview Descriptions": "Panel interview with three staff members. It lasted approximately 40 minutes. Pleasant atmosphere. They try to make you feel comfortable. Before the interview, I had a written test.\nAfter the interview, it took them just one day to give me the results.", "Interview Questions": "They asked several job-related questions, such as \"Describe how would you conduct internal evaluation\", several questions about the experience."}, {"date": "9 Mar 2021", "title": "Senior Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Save the Children", "Interview Descriptions": "They were fast to respond and very attentive. The team I interviewed with seemed to be very interested and were able to explain the question thoroughly. I think it went smoothly.", "Interview Questions": "What kind of databases have you worked with?"}, {"date": "5 Mar 2021", "title": "Award Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Save the Children", "Interview Descriptions": "It was a long process, it took more than 2 months to complete it. First you take a written test, afterwards and interview with three staff members, and finally post interviews checks.", "Interview Questions": "What would I thought about save guarding childhood  policy? "}, {"date": "1 Apr 2021", "title": "Medical Doctor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Save the Children (Mogadishu) in Mar 2021", "Interview Descriptions": "After a written exam, save the child send an email 3 weeks later requesting an interview. The interview was through skype audio, three people from the organization interviewed me. It took 30 min maximum for the interview to finish.", "Interview Questions": "Most of the questions was about the mandate of the organization, and how they deliver services to the people in need.\nAlso they asked about the child protection and safeguarding."}, {"date": "16 Jan 2023", "title": "Project Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Save the Children (Nairobi) in Mar 2021", "Interview Descriptions": "3 days notice to the interview, little or no time for preparation. The process was online where it was more like an exam, timed to be completed in under 2 hours", "Interview Questions": "This was a Written interview"}, {"date": "29 May 2022", "title": "Clinical Mentor Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Save the Children in Mar 2021", "Interview Descriptions": "Five Interviewer, asked questions on practical situation basis, asked questions on team work, work ethics, sexual harrasement and many more. It was quite standard and good.  They gave me many situational doubts, happening, something to do and asked me to solve the problem on my own, how to handle those situation. I thing it was really good one to have interview in that way. they also asked me some statistics related to my job position and responsibility.", "Interview Questions": "Which was asked on sexual harrasement"}, {"date": "17 Mar 2021", "title": "Project Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Save the Children (China, ME) in Mar 2021", "Interview Descriptions": "A phone call to check your time several days later\n\n1.1-h written test;\n2.1-h 4vs1 interview\n\n2 weeks later, the officer telephoened me to inform me about the result.s\n\nGuess there is only 1-round interview because it's an entry level post. Overall speaking,", "Interview Questions": "Interview, both in English and Chinese: self-introduction, understanding on the post, local policy, behavioural questions about team work and government relationship"}, {"date": "8 Jun 2021", "title": "Executive Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Save the Children in Mar 2021", "Interview Descriptions": "Phone call with a recruiter followed by a zoom interview with the person who would be my direct boss. Sadly did not proceed after that. Next step would be a panel zoom interview", "Interview Questions": "Looking at the job posting, what is something you would knot be able to do on the first day? "}, {"date": "26 Feb 2021", "title": "Facilities Protection Supervisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Save the Children (Athens, Athens, Attica)", "Interview Descriptions": "The interview was easy and didn’t take long. Safeguarding questions and case studies and analysis.    It lasted around 30 minutes and the panel was two people. You might have a small interview with hr afterwards.", "Interview Questions": "How would you react if one of your team members was really close to one of the children? "}], [{"date": "20 Feb 2021", "title": "Project Manager Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Save the Children", "Interview Descriptions": "It was heart wrenching. I waited for over 3 hours. HR acted like they were not interested in me. they looked very distracted the whole time of the interview. They made me feel worthless. I proved them wrong though. HR very knefficient", "Interview Questions": "What are project management tools?"}, {"date": "25 May 2021", "title": "Research and Experimentation Specialist (CUBIC) Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Save the Children (Singapore) in Feb 2021", "Interview Descriptions": "The interview process included: 1) an application, 2) a written test of case study questions, 3) an interview that entailed creating/presenting a presentation, behavioral questions, and standard interview questions. \nI went through the entire process, but was unfortunately not offered a position. I would have rated my overall experience as neutral, however,  after the interview process, I was frustrated that they did not respond to my request for feedback after. Of course, they do not owe me this. That said, given the amount of time applicants had to invest into the process (the written test, creating a presentation, interviews, etc),  it would have been more professional to provide feedback to all the candidates.", "Interview Questions": "- Create a presentation on one of your previous data collection projects (with instructions) to be presented during the interview"}, {"date": "24 May 2021", "title": "Volontario Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at Save the Children (Ro) in Feb 2021", "Interview Descriptions": "Il colloquio è stato effettuato online insieme ad altri candidati. A ciascun candidato è stato richiesto di parlare di se e delle proprie esperienze. Dopo qualche settimana ho ricevuto una chiamata per iniziare la mia esperienza di volontariato.", "Interview Questions": "Parlami un po' di te. "}, {"date": "18 Jan 2021", "title": "Knowledge Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Save the Children", "Interview Descriptions": "process was relatively simple . there was a short written test and two interviews - one with the team and one with the director.  style was conversational and questions were conventional questions on strength, weakness, and scenarios", "Interview Questions": "What are you strengths and weakness"}, {"date": "18 Jan 2021", "title": "Project Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Save the Children (Sarajevo)", "Interview Descriptions": "During the interview the atmosphere was nice and relaxed, 3 panel members, cca 35min long interview, starting with opening questions (motivation, previous experience) and than  continue with competency based questions.. usually around 4 or 5 questions. Child Safeguarding is always must ask question", "Interview Questions": "Explain previous experiences, motivation, questions regarding Child Protection (case studies or have will you approach the issues), Child Safeguarding is always asked... "}, {"date": "14 Jan 2023", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Save the Children (Beirut) in Jan 2021", "Interview Descriptions": "Easy It was online and 2 people were in the panel. Introduce yourself What is a Pdm or post distribution monitoring What would you do if a beneficiary refuses to answer", "Interview Questions": "Introduce yourself What is a Pdm What would you do if a beneficiary refuses to answer"}, {"date": "5 May 2021", "title": "Promoter In Marketing Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Save the Children (Palermo) in Jan 2021", "Interview Descriptions": "A causa covid il colloquio è avvenuto via whatsapp,mi sono presentato parlando un po' della mia vita le mie passioni e dei miei lavori precedenti.persone davvero competente e appassionate del loro lavoro.", "Interview Questions": "Per quale motivo vorresti lavorare per gli enti umanitari."}, {"date": "18 Feb 2022", "title": "Program Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Save the Children (Washington, DC) in Jan 2021", "Interview Descriptions": "The main interview included mostly standard questions as well as a couple on child safeguarding (even if the job doesn't involve direct interaction with children). There was a panel of 3 interviewers who took turns asking questions.", "Interview Questions": "Describe a time when you've worked in a stressful environment. How did you manage?"}, {"date": "16 Sept 2021", "title": "Associate Director, Partnerships Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Save the Children (Washington, DC) in Jan 2021", "Interview Descriptions": "The process took a very long time. I felt those conducting the interview were not always prepped in advance of the interview. The team was uncertain on the new role.", "Interview Questions": "Why are you the best fit for this role? "}], [{"date": "25 Dec 2020", "title": "Program Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Save the Children (Toronto, ON)", "Interview Descriptions": "There was one phone screening interview, followed by two zoom interviews with hiring manager(s) and other relevant staff.  However, I was not offered the position.  The overall experience was OK.", "Interview Questions": "Tell us about your relevant experience ?"}, {"date": "22 Feb 2021", "title": "Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Save the Children in Oct 2020", "Interview Descriptions": "There were 3 rounds of interviews:\n\n1. A 15-20 minute basic phone screening interview with HR recruiter to obtain the basic information\n\n2. A panel interview with team manager and team members to discuss the specific roles and skills, and how my experience would be relevant\n\n3. A panel interview with team manager and department head to discuss overall contribution to department and team through role\n\nThe interviews were extremely educational and informative. They consisted of a dialog / discussion of  the position, its fit with other roles, and contribution to the mission and department.  \n\nThree round of interviews were intense for the Coordinator level position. However, the departmental work and team is also top level and intense, so it was made sense.\n\nThe interviewers were very helpful, explained / educated and taught me through the interview process, and they were kind putting me at easy. They also made sure that I had an accurate grasp and understanding of the role. It was fascinating and mind opening, and truly gave me an accurate glimpse of what it would be like working in the organization in this particular department. I was given an opportunity to also ask questions and make comments.", "Interview Questions": "Why are you interested in this position?\nWhat skills / experience make you a good fit for this position?\nWhat is your understanding of what you'd be doing in this job?\nWhat experience do you have with .... [specific task from job description]\nHow familiar are you with [specific program used for the position]\nHow do you work in a diverse workplace?\nHow do you handle it if a coworker or someone around you may not be following the rules? \nWhat would you do in the case of ... [insert program specific situation here]\nHow do you go about keeping children safe?\nDo you have any questions for us? [make sure to have 3-4 good questions lined up for interviewers]"}, {"date": "15 Oct 2020", "title": "IT Support Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Save the Children", "Interview Descriptions": "General questions, how will you act if... Basically understanding how you deal with issues\r\nWhen you are part of a distributed team. Multi stage. Previous phone screen. Nothing like technical questions or extensive list of topics", "Interview Questions": "Tell me about a time you have to say no."}, {"date": "30 Sept 2020", "title": "Programme Officer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at Save the Children", "Interview Descriptions": "The process starts with a written assessment and then, if selected, you move on to an interview. \r\nThe person from HR at Save the Children UK was extremely disorganized, they had some technical issues and instead of apologizing and rescheduling, she let the candidates await for a written test that never came. Later, she was very inflexible about possible dates for rescheduling it. However, what is truly demotivating is that, after I did the written assessment, I received no response from HR. They also didn't respond to my emails inquiring about the results. They did the same to a colleague who was going through the same process. \r\n\r\nAn HR Department that ghosts candidates after making them do a written assessment and/or interview is thoroughly unprofessional.  It speaks quite badly about the organization as a whole.", "Interview Questions": "The assessment lasted 45 minutes and it had two questions. The first was to read through a request for funding, fill in a questionnaire, and determine whether you would provide funding. The question asked how I would deal with a committee member that was not acting impartially. "}, {"date": "22 Oct 2020", "title": "Case Worker Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Save the Children (Istanbul) in Oct 2020", "Interview Descriptions": "I think ıt was very hard. I applied Turkish country office.  There was 4 person in the interview. It was online interview. I don't saw them. They saw me. I can only  hear them. That's why I think ıt is very excating. Firstly shortlist then tecnic test and online interview. This interview  asked a lot of questions they for me. For example; tell me about yourself, what do you think case worker about, what do you do case worker, SCI policy ( Child Safeguard and Harressment Intımidation and bulling policy) i.e. Then english control. But I was very exciting for speak. I wasn't speak . I hope they call me. I think Save The Children ınternational best child safeguarding company.  I hope to join you.", "Interview Questions": " This interview  asked a lot of questions they for me. For example; tell me about yourself, what do you think case worker about, what do you do case worker i.e."}, {"date": "18 May 2021", "title": "Technical Advisor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Save the Children in Oct 2020", "Interview Descriptions": "It was an okay interview process that included screening with written responses to questions and an interview or two that were about an hour each. However, they did not get back to me until a week after I followed up, after a week or two after they were supposed to inform me their decision.", "Interview Questions": "How well do you know USAID's strategic plan?"}, {"date": "4 Sept 2020", "title": "Health Program Manager Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at Save the Children", "Interview Descriptions": "it takes 2 weeks, a lady with a very professional background interviewed me, and checked some technical problems on program management, especially on health program design, monitoring and evaluation, as well as how to build indicator system.", "Interview Questions": "what health programs you've done ? "}], [{"date": "22 Aug 2020", "title": "Admin Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Save the Children", "Interview Descriptions": "Written questions about the role of an admin assistant, was easy  overall,  the test was one-hour in length, the environment was really calm and the coordinator was really helpful after we finished we saved the test in the laptops and finally print it in hard copy", "Interview Questions": "What is required form an admin assistant?"}, {"date": "18 Oct 2021", "title": "Fundraising Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Save the Children in Aug 2020", "Interview Descriptions": "I first spoke with HR recruiter. I then had meetings with the hiring manager and the team. Everyone was warm and friendly and the communication regarding the interviews was smooth.", "Interview Questions": "They asked about my ability to deal with and adapt to change. "}, {"date": "25 Aug 2020", "title": "Project Manager Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at Save the Children (Melbourne) in Jul 2020", "Interview Descriptions": "The interview process involved three steps. The first was application, second video interview and finally interview with the team. The process was pretty standard and straight forward. The interviewers were quite friendly and personable,", "Interview Questions": "General questions about previous experiences in similar roles."}, {"date": "27 Jul 2020", "title": "HR Business Partner Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 4 weeks. I interviewed at Save the Children (London, England) in May 2020", "Interview Descriptions": "I was kept well informed and it was a smooth process. The interviewers were friendly and gave me plenty of opportunity to ask questions. I was informed quickly as to the outcome of the interview and provided with feedback.", "Interview Questions": "Question regarding my commitment to safeguarding"}, {"date": "12 Apr 2020", "title": "Data Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at Save the Children", "Interview Descriptions": "Pretty straight forward and easy but was a little confused with the timeline. Didn’t hear back for several months and different information upon checking in, otherwise friendly and calm.", "Interview Questions": "Previous experience and interest in the organization "}, {"date": "28 Jan 2020", "title": "Assistente de Programas Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Save the Children (Beira) in Jan 2020", "Interview Descriptions": "O processo selectivo foi por via de documentos.  com base nos anos de experiência, referencias e organizações por onde passei e as posições ocupadas.\r\nSeguido do processo de entrevista profissional  do conhecimento técnico e dominio da area para que me candidatava.", "Interview Questions": "A minha experiencia em gestão de programas, elaboração de planos anos, trimestrais e mensais."}, {"date": "13 Dec 2019", "title": "Insegnante di chitarra Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at Save the Children", "Interview Descriptions": "Ho avuto un incontro con una delegata, mi ha illustrato il numero di lezioni e le necessità di cui tener conto, lo stipendio all'ora e un percorso da seguire. Successivamente ho accettato, perché ero stato scelto per le mie competenze", "Interview Questions": "Non ricordo"}, {"date": "10 Dec 2019", "title": "Fundraising Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Save the Children", "Interview Descriptions": "A competency based interview with general questions about teamwork, organisation, meeting deadlines, and my reasons for applying. Experience was admin focused.\r\nGood interview process that was straight forward.\r\nInterviewed by two members of staff from the fundraising department.", "Interview Questions": "Describe a time you had to handle multiple deadlines "}], [{"date": "19 Nov 2019", "title": "Spring Influencers and PartnershipsPosition Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Save the Children in Nov 2019", "Interview Descriptions": "Applied online through their website and they emailed me about a month later. Scheduled a phone interview that lasted about 45 minutes. Half of the time was spent on the description of the position and the rest was about me and one actual interview question.", "Interview Questions": "What has been your favorite class?"}, {"date": "18 Dec 2019", "title": "Communications Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Save the Children (Gurgaon, Haryana) in Oct 2019", "Interview Descriptions": "It began with a phone interview, followed by a 45 minute written test at their office, then a face-to-face interview with a panel consisting of program team and an HR.", "Interview Questions": "Some were focused on my previous experience and related to the job. But most did not have a context and general. "}, {"date": "10 Aug 2021", "title": "Sr Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Save the Children (Washington, DC) in Sept 2019", "Interview Descriptions": "I was contacted to confirm if I can take the position in a specific location.  Upon my confirmation,  the interview time was set and the interview was conducted.  At the end,  a feed back email was sent for the outcome of the interview", "Interview Questions": "The panel asked about my experience in proposal development and new business development "}, {"date": "20 Aug 2020", "title": "Policy and Advocacy Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Save the Children in Aug 2019", "Interview Descriptions": "Had a phone interview with the program coordinator and assistant director of the department, straightforward common questions about interests and background, and why I would be a good fit, and what they were looking for.", "Interview Questions": "Why do you want to work at Save the Children?"}, {"date": "21 Jun 2019", "title": "Project Monitoring and Evaluation Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 2 weeks. I interviewed at Save the Children (London, England)", "Interview Descriptions": "Telephonic, written test and personal interview \r\nThe first round of telephonic interview was not an HR round but a committee asking you theoretical questions like - What is co-relation? what would be the indicator for a particular project ?", "Interview Questions": "N/A"}, {"date": "3 Nov 2019", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Save the Children (Hendon, England) in Jun 2019", "Interview Descriptions": "Those over 18 may print from STC website or from a local STC retailer they may fetch, fill out and deliver the STC application form giving two referees (non-family).", "Interview Questions": "Why do you want to work for STC?"}, {"date": "30 Nov 2020", "title": "Fundraising Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Save the Children (Jakarta) in Jun 2019", "Interview Descriptions": "First, they will call you on skype and then ask about available time. The process depends on what you apply for but for fundraising, they will see you experience and cv and cover letter", "Interview Questions": "The strategy of fundraising and how can you achieve the target"}], [{"date": "9 May 2019", "title": "Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Save the Children", "Interview Descriptions": "Applied online and heard back within a couple of weeks about a phone screening and then in-person interview. It was a very smooth process, HR kept me very up to date and responded quickly to any questions/concerns.", "Interview Questions": "How do you work under high pressure/stress situations? Give us an example"}, {"date": "14 Apr 2019", "title": "Digital Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Save the Children (London, England)", "Interview Descriptions": "3 stage interview, took too long to get info on the decision, however, the online system was good to remember the interview details.  overall was positive and the panel was very accommodating and professional.", "Interview Questions": "Typical for specific subject, methodologies, experience, why you are leaving the present job, etc"}, {"date": "14 Apr 2019", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Save the Children", "Interview Descriptions": "I applied for the internship online through the Save the Children website. HR from Connecticut reached out and had a phone interview with HR.  I had a final phone interview with the hiring manager and the department coordinator. Received my decision via email the same day.", "Interview Questions": "Tell us about yourself. Why do you want to intern with Save the Children?"}, {"date": "15 Mar 2019", "title": "Intern Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Save the Children", "Interview Descriptions": "Applied online, heard back for an interview after a week. Phone interview with three people, one was the program director. Overall all easy questions related to the position. Unpaid internship.", "Interview Questions": "Any policy research related experience? "}, {"date": "5 May 2022", "title": "Manager, Regional Capacity Planning Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Save the Children (Nairobi) in Mar 2019", "Interview Descriptions": "The interview process was good,  the first stage of the interview was a written test followed by a face to face interview. The staff were very friendly and supportive throughout the interview process.", "Interview Questions": "How can you build consensus in a team?"}, {"date": "9 Dec 2020", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Save the Children (New York, NY) in Mar 2019", "Interview Descriptions": "The interview was very interactive. The staff at the interview were friendly. This made me to be at ease and to answer their questions without stress. I was able to answer almost all the questions and got the position", "Interview Questions": "Can you tell us about yourself_"}, {"date": "12 Apr 2023", "title": "Senior Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Save the Children (Washington, DC) in Mar 2019", "Interview Descriptions": "I was recruited by a former colleague who wanted me to come work on her team. Everything was hunky dory until I met with the (now former) COO. She asked me about lobbying in the EU, and when I said that I thought it wouldn't be a problem and explained that it was a US-based job, she got very angry with me. I felt that I was polite, but I think I embarrassed her in front of one of her subordinates and that was a big no-no.", "Interview Questions": "How would you lobby the EC?"}, {"date": "12 Feb 2019", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Save the Children", "Interview Descriptions": "Very standard, I applied and got an email asking to come in for an in - person interview. Interview lasted about 30 minutes, where they had a series of questions prepared", "Interview Questions": "About past job experience, and experience related to the job I was applying for. "}], [{"date": "14 Mar 2019", "title": "Celebrity Engagement Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Save the Children (Los Angeles, CA) in Feb 2019", "Interview Descriptions": "Human Resources staff does not follow up. They first reach out and then leave you waiting for weeks with no answer. Then out of sudden, they do a generic email about you not being selected.  Extremely unprofessional search process. They do not honor their mission. I am not recommending anyone to donate to their cause. Save the Children Human Resources staff service is unacceptable. Don't bother, poor experience poor organization.", "Interview Questions": "N/A"}, {"date": "26 Apr 2019", "title": "Program Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Save the Children (Nairobi) in Feb 2019", "Interview Descriptions": "The interview process was quite okay with two interviews on the same day. One was a written test which tested on Ms Excel proficiency and the second one was an oral interview with three panelists. They were so friendly but thorough.", "Interview Questions": "What is Child Safeguarding"}, {"date": "2 Mar 2022", "title": "Social Worker/Case Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Save the Children (Ibb) in Jan 2019", "Interview Descriptions": "Interview was so fantastic, they called me to make interview. They were saying us. Sit out when we would invite you, you can come. Then I made interview they asking me questions.  They said that you can select languages to asking you in perfer your language.  I selected language then start to ask me questions.\r\nWho were in interviews. \r\nFiled manager \r\nHR employee \r\nThe coordinator of projects \"protection projects\"", "Interview Questions": "Introduce about yourself? \r\nAsking about the organization? \r\nAsking about Protection Department. \r\nAking about job. \r\nAsking about If you find problem in Friendly Spaces. What will you do?\r\n"}, {"date": "14 Dec 2018", "title": "Fundraising Coordinator Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Save the Children", "Interview Descriptions": "Short interview- roughly 15 minutes. Asked about prior experience and thoroughly explained the history of the foundation and the responsibilities of the role. Asked about personality traits that would make one well-equipped for this type of job.", "Interview Questions": "Are you comfortable with the working conditions (outside for extended periods of time, bad weather, etc)?"}, {"date": "5 Dec 2018", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied in-person. The process took 3 weeks. I interviewed at Save the Children", "Interview Descriptions": "Fill out a form,  give to the store and then they review the form and do a background check and then they will call you after they call then you go to the assigned day that you told the supervisor.", "Interview Questions": "What days you want to work. "}, {"date": "20 Jan 2019", "title": "Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Save the Children (Washington, DC) in Dec 2018", "Interview Descriptions": "After applying, I heard back via email and was invited for a phone interview with the hiring manager. Overall, we had a good discussion that covered with the basic interview questions, as well as some more technical questions to learn about my specific experience. I didn’t feel like the job was really what I was looking for and I think the hiring manager could tell, as I never heard back.", "Interview Questions": "Are you a member of other communities of practice or relevant associations?"}, {"date": "25 Nov 2018", "title": "Global Gender Policy Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Save the Children", "Interview Descriptions": "Very friendly interview, phone call interview.  The questions were focused on my previous personal, academic, and work experiences. Got an email three days later asking me for a follow-up phone interview.", "Interview Questions": "Why are you interested in Save the Children?\r\nWhat previous work or academic experience do you have on gender?"}, {"date": "8 Feb 2019", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Save the Children (Washington, DC) in Nov 2018", "Interview Descriptions": "The interview process was not that bad. It was two rounds of interview with my manager and the HR team. I am very happy that I am part of Save now. The people are really nice and you get so many resources to work on.", "Interview Questions": "It was mostly about my experiences and what I can bring to the internship "}], [{"date": "6 Dec 2018", "title": "Senior Adviser Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Save the Children (London, England) in Aug 2018", "Interview Descriptions": "One hour interview and 30 minutes written test. There were two interviewers reading all the questions. All the questions were about the role, about your experience related to the job, a time when you failed, an experience you are proud of.", "Interview Questions": "A time when you did not agree with your boss\r\nA time when you did not succ"}, {"date": "15 Feb 2019", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Save the Children in Aug 2018", "Interview Descriptions": "Great interview process. Very friendly interviewers. I had two interview. The first was a general interview over the phone - expected questions. The second interview was with other employees who had questions about specific skills that would be helpful for their project. Great overall.", "Interview Questions": "What is a strength of yours?"}, {"date": "22 Jul 2018", "title": "Accounts Payable Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 2 weeks. I interviewed at Save the Children", "Interview Descriptions": "The process was simple and quick. I submitted my resume online and was contacted by a recruiter two days later. The interview was scheduled for the following week.", "Interview Questions": "Why do you want to work for Save the Children. What's your greatest weakness/strength. How would your coworkers describe you"}, {"date": "15 Jun 2018", "title": "Project Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Save the Children", "Interview Descriptions": "Hiring is generally in Four steps,HR telephonically interview,  written interview, Panel interview and final interview.  Staff is very kind and they understands you well. Just be prepared about the position applied for and the do  some research about the project you would be handling.", "Interview Questions": "Any situation is asked and how to handle the same."}, {"date": "28 Jun 2018", "title": "Project Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 7 months. I interviewed at Save the Children in Mar 2018", "Interview Descriptions": "It took 2 months from the day I subbmitted the application to the day I received a call from HR to participate in the test and interview. On the interview day, it took 60 minutes for written test and 60 - 90 minutes for  the panel interview. After near 4 months no receiveing any information/feedbacks from HR, I was called and offerred for a same position but working in different workplace.", "Interview Questions": "1. Some basic questions like introduce yourself, why do you apply for this position, your strengthens and weeknesses\r\n2. What obstacles do you have to overcome when working with the local authorities?"}, {"date": "15 Apr 2022", "title": "Internship Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 5 days. I interviewed at Save the Children (Singapore) in Mar 2018", "Interview Descriptions": "It was a 30-min phone call - interviewer was polite and courteous. Very patient in answering all my queries too. Too bad I blew my chances by dropping my phone twice hence the call was a bit disruptive.", "Interview Questions": "Tell me about yourself and why would you like to join us? "}, {"date": "27 Feb 2018", "title": "Desk Officer/Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Save the Children (Remote, OR) in Feb 2018", "Interview Descriptions": "It was conducted remotely due to field location. The interviewers internet wouldn't support a group call. We had spent 30 minutes trying to get connected and ultimately agreed that I would arrange a teleconference call.", "Interview Questions": "When the interview began, I sensed immediately that the interviewers were in a rush. This was confirmed by them saying things like 'keep your answers brief'. At one point the interviews cut me off mid-answer. I found this very off-putting. It was clear that they were rushing through the questions. Also, the connection dropped out several times mid-answer which meant I had to re-dial and begin the answer again. It was supremely frustrating and disruptive. I am sure it impacted my overall performance. \r\n\r\nThe questions asked were highly technical (not competency based) and in my view not very relevant or helpful in assessing my ability to perform in the role.  An example was asking for my opinion on the current problems in that technical area - very general, probably more suited to a high-level senior manager type role (someone who would, for example, be directing strategy and so on)."}], [{"date": "2 May 2018", "title": "Human Resources Advisor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Save the Children in Jan 2018", "Interview Descriptions": "A 30 minute telephone interview and then an invite for a face to face interview. \nDemand for the role was very specific which did not reflect in the job description.", "Interview Questions": "Give an example when you faced  a difficult HR situation?"}, {"date": "31 May 2022", "title": "Program Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Save the Children in Jan 2018", "Interview Descriptions": "Screening.  conduct a preliminary interview to determine whether you're a viable candidate for the job.\r\nFirst interview. Typically, the first interview is the first face-to-face meeting with HR and the team\r\nSecond interview. If you've succeeded in impressing them in the first interview, you may be asked to return for a second meeting with supervisor\r\nThird interview. not so often they conduct third interview to help them make a final decision. \r\nThe decision. The final step in the interview process, is usually a job offer contingent upon your background check and references.", "Interview Questions": "Tell us about your self"}, {"date": "29 Sept 2020", "title": "Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Save the Children (London, England) in Jan 2018", "Interview Descriptions": "The interview panel was very accommodating and made me feel very comfortable to respond to questions. It was a really good experience. I also had the opportunity to ask questions about the organization as well as the project I would be supporting.", "Interview Questions": "General workplace skills related questions."}, {"date": "11 Dec 2017", "title": "Program Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Save the Children", "Interview Descriptions": "It was very long. I applied in early November and did not get a response back for an interview until a month later. The interview process took about an hour and it was three people and they asked extensive questions even though this position was a entry level position.", "Interview Questions": "What is your experience with knowledge management and what can you do that will help us in this area"}, {"date": "17 Dec 2020", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Save the Children (Fairfield, CT) in Dec 2017", "Interview Descriptions": "Had a 30 min phone interview with HR to review my resume & see if it was a good fit. Then went for an in-person and met with the hiring manager. We spoke about my experience, what I was hoping to learn, and school.", "Interview Questions": "Why do  you want to intern at Save the Children?"}, {"date": "26 Nov 2017", "title": "Data Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Save the Children (Fairfield, CT)", "Interview Descriptions": "No phone screen, just an interview offer over the phone. The interview was very relaxed, informal, and brief. The interviewer quickly determined I was over qualified for the role and my salary expectations were, therefore, too high. I wish they'd conducted a phone screen to save both parties the time and effort.", "Interview Questions": "Tell us about a challenging project you managed."}, {"date": "2 Apr 2018", "title": "Senior Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Save the Children (Washington, DC) in Oct 2017", "Interview Descriptions": "I applied online and shortly after the closing date had a phone interview. Several weeks later I had an in-person interview with two staff. It went very well, but it seems they were trying to attract back someone who had recently left the NGO, so I am not sure how serious they were in looking for new talent. About two weeks later I received an automated email stating that I was not successful. The process was pretty cold, and I was disappointed by that.", "Interview Questions": "Mostly technical questions"}, {"date": "7 Oct 2017", "title": "Country Director Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Save the Children", "Interview Descriptions": "I did well in the interview but didn’t like some aspects of the job so I pulled out.  The terms were not also comparable with with what I am currently enjoying.", "Interview Questions": "What value do you think you bring on board for the organization. "}], [{"date": "29 May 2017", "title": "Administrative Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Save the Children (London, England) in May 2017", "Interview Descriptions": "I undertook two interviews for two different administrative positions at Save the Children. I was given very little notice to prepare (2 days), and both times had to complete pre-interview tests (prioritising and spreadsheet comprehension based.)\r\n\r\nWhile the interviewers were generally polite during both interviews, they came across very snooty. This is a problem in the international development sector anyhow. Yes, you work to 'save children', but have a bit of humility please! \r\nThe office is beautiful, but the small room in which they my interviews meant I could see everything impolite which was getting written about me, which is very off-putting!\r\n\r\nBut the worst part for me is that after both interviews, none of them contacted me with the result. I've clearly been declined, but please recognize the massive effort and emotional-toll on the job seeker that has decided to approach you. They have, for however long, taken rejection after rejection, and have probably worked very hard just to prepare for this interview. It takes very little time to copy and paste a rejection to me and the 6 or 7 other people you reject at interview stage. In fact I'd consider it basic politeness.\r\n\r\nI knew after walking out of there that I wouldn't fit in anyhow, because I want to help the needy too, but I don't need to look down my nose at other people in the process.", "Interview Questions": "* How do you prioritise between urgent and important\r\n* How do you deal with stress\r\n* Have you handled big budgets"}, {"date": "25 Jun 2021", "title": "Encargado De Monitoreo Y Evaluación Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Save the Children (Ciudad del Maíz) in Feb 2017", "Interview Descriptions": "Después de la postulación tarde al menos 3 meses en terminar todo el proceso desde los documentos hasta la entrevista. Buen proceso de contratación un poco tardado pero todo muy bien.", "Interview Questions": "formación \r\nplanes profesionales\r\nexperiencia \r\nsueldo esperado"}, {"date": "18 Oct 2017", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Save the Children (Washington, DC) in Dec 2016", "Interview Descriptions": "First round: Phone interview for behavioral questions, this is more about screening.\r\nSecond round: In-person interview at Washington DC to understand your connections.\r\nThird round: Skype interview to double check all requirements, and the team made a decision in the following week.", "Interview Questions": "Why Save the Children? How could you combine your past experience of consulting to this job?"}, {"date": "22 Oct 2016", "title": "Senior Digital Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 2 weeks. I interviewed at Save the Children (London, England)", "Interview Descriptions": "I was asked about previous experience from documentation handling to technical knowledge and to share examples, plus advise on the effectiveness of past PM tools used.\r\n\r\nCurrent DBS required. \r\n\r\nInterview friendly, but professional.  Suit not required for this role but smart appearance necessary.\r\n\r\nThey look for a keen interest in their organisation and preferences of charity background, but not essential.", "Interview Questions": "What PM tools have you used? On what projects? How did you find them?"}, {"date": "11 Jul 2016", "title": "Finance Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Save the Children (London, England)", "Interview Descriptions": "Applied online. Interview was also booked online. Arrived at H/O -meeting was on time and took an hour. It was well structured and interesting. I was told briefly about the set up of the department, than had to answer series of questions about my current job and abilities. It took just over a week to hear back. The whole process was very a possitive experience, was made to feel comfortable and at ease. People working there are very motivated by the job that they do. It seemed like it would be a busy but rewarding place to work.", "Interview Questions": "flexibility"}], [{"date": "16 Aug 2016", "title": "Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Save the Children (Washington, DC) in May 2016", "Interview Descriptions": "Scheduled by HR. Hiring person who conducted the interview had not looked at my resume so did not know who I was, and did not know for which open position I had applied. Typical arrogant Hill veteran personality, probably already knew who planned to hire and all my hopes and preparation were for nothing.", "Interview Questions": "What position are interviewing for?"}, {"date": "8 Nov 2016", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Save the Children (Fairfield, CT) in Apr 2016", "Interview Descriptions": "The time frame from when I first submitted my application to getting an interview took about 4 weeks. The interview was done online via Skype and lasted an hour. The person who interviewed me was the director of the department that I would be interning for. The interview process was not very stressful and the person interviewing me was very friendly and also took the time to answer questions that I had.", "Interview Questions": "1. Why would you like to work for Save the Children?\r\n2. What is your educational experience and how does it apply to the internship? \r\n3. What is your work background?"}, {"date": "3 May 2016", "title": "Logistician Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Save the Children (Dakar) in Apr 2016", "Interview Descriptions": "generally before going through an interview you pass by a previous written test. Generally to answer this test you are given 1 or ½ hour to answer. If you have the change to pass this test, you get the interview which last about 20 min.", "Interview Questions": "I applied few times to STC jobs, but every time I had very bad experiences when the interviewers were speaking from the fields.\r\nFirst of all, note that before going through an interview you pass by a previous written test. Generally to answer this test you are given 1 or ½ hour to answer. Questions are very badly formulated, without any sense in respect of the job you applied for.\r\nIf you have the change to pass this test, you get the interview. Every time I got this opportunity I spoke with unprofessional people. I don’t know why, but they are always in a hurry, are non-punctual and very unprofessional in terms of behavior. Their questions are not focused at all on the job and their time to interview you is always very short. How can someone could in 20 minutes time to do understand if you are the right one for the job?"}, {"date": "19 Sept 2016", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Save the Children in Mar 2016", "Interview Descriptions": "I applied on their website and soon got an email from an individual in HR. I then had a phone call with the individual about my background and why I wanted to intern there. A few weeks later I received an email from the individual in HR that I should set up a time to speak with another individual in Resource Development. I had a phone call with them and then received an offer email a few days later.", "Interview Questions": "Why do you want to work at Save the Children?"}, {"date": "3 Feb 2016", "title": "Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Save the Children (Washington, DC)", "Interview Descriptions": "The interview process was quick. I spoke with HR and the hiring manager on the phone and then I had a three hour interview in person with team members.", "Interview Questions": "why do you want this job? "}, {"date": "2 Dec 2020", "title": "IT Officer Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Save the Children (Sanaa) in Jan 2016", "Interview Descriptions": "It was ok, I don't remember any questions but they asked general stuff, most of the questions weren't about my position, random questions that do not help to assess the candidate.", "Interview Questions": "N/A"}, {"date": "2 Jul 2016", "title": "Senior Program Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Save the Children (Abuja Nigeria) in Dec 2015", "Interview Descriptions": "The interview process was objective and pleasant. There was a mix of simple and difficult questions and a 3-person panel. I enjoyed the interview, but one of the interviewers walked out of the interview while it was still going on, without explaining why he did so and without excusing himself. I felt a bit hurt and thought it was because of his dislike of me.", "Interview Questions": "How much salary would you want to earn?"}, {"date": "17 Sept 2015", "title": "Advocate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Save the Children (Denver, CO) in Sept 2015", "Interview Descriptions": "Extremely Easy. I knew I had the job within 5 min. Talked for 30 min. Very nice hiring manager. They are looking for outgoing type people for canvassing. (I wasn't exactly sure what I was in for going in)", "Interview Questions": "Tell me about yourself. We mainly talked about what it means to canvass"}, {"date": "5 May 2018", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Save the Children (London, England) in Sept 2015", "Interview Descriptions": "lengthy process for an administrator role, with multiple interview rounds. 2 at most would have been sufficient for the level of this role . I did a phone screening, a panel interview a test and another panel interview.", "Interview Questions": "how do you manage competing priorities"}], [{"date": "22 Aug 2015", "title": "Supporter Care Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. The process took 2 weeks. I interviewed at Save the Children in Aug 2015", "Interview Descriptions": "Telephone interview, took around 15-20 minutes. Applied through an agency and while I was initially turned down after interview another position opened up shortly after and I was given an offer without a second interview.", "Interview Questions": "How do you cope with pressure?"}, {"date": "19 Oct 2015", "title": "Digital Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Save the Children (London, England) in Jul 2015", "Interview Descriptions": "The interview process took place over two stages, with questions and an exercise at the first stage and both a presentation and questions at the second. There was a panel of two at stage one, and a panel of three at the second stage. Questions ranged from generic 'Why StC' to more targeted questions around the role and requirements, as you'd expect.", "Interview Questions": "Why do you want to work at Save the Children?"}, {"date": "6 Jun 2015", "title": "Area Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Save the Children (Rangoon)", "Interview Descriptions": "Interview information by phone. The first panel interview by panel of hiring managers and the second one by senoir management . The first and the second interviews were 2 weeks apart.The interview language was English even though for local position.", "Interview Questions": "General questions such as experineces . Behavioural questions and case senerios."}, {"date": "15 Jun 2016", "title": "Program Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Save the Children (Washington, DC) in May 2015", "Interview Descriptions": "For the first interview, the HR individual almost forgot about the call. Second interview, went fine I followed up with the required documents. I was given a one week turnaround time, when I didn't hear back I was told that they were still finalizing their decision. I emailed again and same answer was given. I never received an answer from HR.", "Interview Questions": "Questions related to my experience in education."}, {"date": "20 May 2016", "title": "Project Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Save the Children in May 2015", "Interview Descriptions": "Telephone interview walked through my cv and described the role followed by face to face Competency based interview. 4 competency questions from job description supplied followed by opportunity to ask my own questions. Very friendly and put me at my ease. They are new to competency based questions. Overall a positive experience.", "Interview Questions": "Tell us about a time you delivered results"}, {"date": "2 Apr 2015", "title": "Director Position Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at Save the Children", "Interview Descriptions": "The HR Recruiter had a 30 minute conversation with me and flat out said that I was going to be having an interview with the hiring manager. I did my due diligence and spent a ton of time preparing.  She never bothered to return another email or phone call. Completely unprofessional. She showed zero integrity.", "Interview Questions": "There were no difficult questions. "}, {"date": "13 Mar 2019", "title": "Finance Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Save the Children (Telephone, TX) in Apr 2015", "Interview Descriptions": "Telephone interview with the direct supervisor, one technical specialist and one HR specialist. Questions read by a panel, with interesting, probing questions against what seemed to be a pre-prepared list of questions.", "Interview Questions": "How my experience qualified my for the position"}, {"date": "30 Mar 2015", "title": "Project Coordinator Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Save the Children (London, England) in Mar 2015", "Interview Descriptions": "Interview was over Skype. My interviewers looked like they were in their pajamas, I acknowledge that's there's a time difference, but still would be respectful to dress appropriately. At one point, one interviewer left room and wandered off to another room, without excusing herself, a little distracting.  Was given 1.5 days notice for the interview.", "Interview Questions": "How do you like to be managed?\r\nHow would you track a project with lots of stakeholders?"}, {"date": "10 Nov 2015", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Save the Children (Washington, DC) in Mar 2015", "Interview Descriptions": "My interview was essentially not an interview. They just told me about the job and asked very few questions about me.  It seemed like they did not have any other possible applicants for the position, so the essentially needed to sell it to me more than I needed to sell myself.  This should have told me that it was not going to be a great internship....", "Interview Questions": "Explain so and so on your resume..."}, {"date": "5 Feb 2015", "title": "Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Save the Children", "Interview Descriptions": "I was contacted 1 week after applying. From the email to the meeting, the interviewer seemed to just want to get the interview out of the way. The interviewer seemed preoccupied and disorganized; asked a few questions; and it was over in 10 minutes. I walked out of there feeling they already made their decision. Complete waste of time.", "Interview Questions": "How do you stay organized?"}], [{"date": "2 Jan 2016", "title": "Head of A Technical Sector Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 1+ week. I interviewed at Save the Children (London, England) in Feb 2015", "Interview Descriptions": "I applied online and had two interviews: a first with two managers on the phone, tgen a tehnical test and eventually got the last round which was a panel face to face interview with two senior managers. After the interview process tge human resources department contacted two of my referees and ran a background check on me to ensure that I can work with children.", "Interview Questions": "Experience of security incidents in the field"}, {"date": "12 Jan 2015", "title": "Health Specialist Interview", "results": "No Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Save the Children", "Interview Descriptions": "I received a call from the DC office to schedule an interview for two different positions on two different days.  I was interviewed by two people.  It was an interesting interview.", "Interview Questions": "The question were directly related to the position.  Like, what would you do in this type of situation, or what would your methods or procedure be."}, {"date": "22 Jan 2016", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Save the Children in Jan 2015", "Interview Descriptions": "Interview process was too long and not very organized for this type of role. HR does screening, and then had a phone interview ,and in person interview was the same thing, with the same person. No additional questions.", "Interview Questions": "No difficult or unexpected question"}, {"date": "18 Nov 2014", "title": "Intern Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Save the Children (Nairobi)", "Interview Descriptions": "Hiring starts by advertisement then after deadline of application takes two weeks for selection, one is then invited for an interview which is basically a written assessment then if successful you are then invited for an interview which is an oral interview where there will be a panel of 3-5 mostly 3 people,a department guy who will be basically your supervisor, a hr guy and one person from the administration department or support service personnel.If you are successful you will be send an email notifying you that your referee are being contacted and they will be sent forms  to fill about your conduct and how well they know you such stuff.Each process takes two weeks,the written interview will be technical questions that will measure how well you are in your are of specialty. The oral interview will consist of the general part of the interview and technical part restrictively. Caution some people have both interviews at the same day depending on the urgency of the position/recruitment so come prepared for any of the two cases.All the best contract for internship is 3 months and will be extended by a month or max 2 months.", "Interview Questions": "5 Policies that you would put in place to ensure safeguarding of cash and cash equivalents"}, {"date": "6 Mar 2015", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Save the Children in Nov 2014", "Interview Descriptions": "Brief phone screen by HR, then brief phone interview with manager (I was not located near offices). They didn't ask very difficult questions, they just wanted me to tell them about myself, and they wanted tell me about the position. The process from the time I applied to the time I got hired took maybe 1.5 months.", "Interview Questions": "What do you want to get out of this internship?"}, {"date": "13 Mar 2018", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Save the Children (London, England) in Oct 2014", "Interview Descriptions": "I went in and asked the manager if I could volunteer as part of my DOfE awards. She accepted right away and asked me when I'd like to start and how many times a week would I like to volunteer.", "Interview Questions": "It was not a proper interview. The manager just asked me which days I'd like to volunteer."}, {"date": "25 Sept 2014", "title": "Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Save the Children in Sept 2014", "Interview Descriptions": "got a call from Beijing HQ office for scheduling an interview in Shanghai;\r\nthe interview consists of one manager, one HR, and one HR from Beijing HQ (by phone);\r\nit lasts about half an hour;\r\nlater they gave me 40 minutes to come out with an action plan, given a specific topic. It has to be in English.", "Interview Questions": "They asked me what is my expected salary for this position, I said working in NGO has always been my dream and I know it perfectly that NGO is not a place for seeking big fortune. As long as it's reasonable I'm fine with it. Two days later they called me and gave me offer, the salary was satisfying, especially comparing to local NGOs in China."}, {"date": "2 Oct 2014", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Save the Children (Westlands) in Jul 2014", "Interview Descriptions": "The position is first advertised through the regions website though its also circulated through various advertisers.If you are successful and pass the CV screening process that usually takes 2-3 weeks, you are then invited to an assessment this is basically skills test relevant with the department you are applying for don't panic just remember what you learnt in school and emerging issues in the industry and sector that will take a week to get the feedback and the assessment is usually an hour.If you are successful the next step is the panel interview that has 3-4 people.The department manager or coordinator that will be your line manager, the hr department assistant and the operations department rep usually an assistant or officer,but for me i got the pleasure of being interviewed by the operations director;very friendly let not the title give you chills.During the interview there is the general questions part and the technical part both will last 30-45 minutes then you will be given a chance to ask the panel some questions.For the general part each will ask about 3 questions then the technical part would basically consist of the department and support guess because its more of a departmental review.If you are successful it will take you a week to get the feedback and they usually ask if you will be available in a week.Most probably they will also have asked that during the interview.Bingo you are up n running.", "Interview Questions": "Internal controls that an organisation like save the children would put to safe guard its cash and bank assets."}, {"date": "13 Mar 2014", "title": "Advisor Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Save the Children", "Interview Descriptions": "Initial communications were clear via email and phone. The process can be longer as people travel within the company.", "Interview Questions": "Directly asking about what salary I would want."}, {"date": "2 Nov 2017", "title": "Social Worker Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Save the Children (Alexandria, LA) in Mar 2014", "Interview Descriptions": "A panel of interviewers from various departments which consisted of at least 6 members - was not conducted by the HR department.  I questioned the legitimacy of the process - none of the panel members had HR experience nor the educational background to conduct the process.  In addition, the process was intimidating  - 6 members interviewing one individual.  The atmosphere was more like being on trial.  Save the Children's corporate office needs to investigate the Alexandria, Louisiana hiring process.", "Interview Questions": "My experienced with working with diverse populations specifically lower socioeconomic populations. "}], [{"date": "18 Nov 2015", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Save the Children (Westport, CT) in Jan 2014", "Interview Descriptions": "First around: phone interview. Talking about your background and availability during tne next few months. Second,onsite: very easy, briefly reviewed your resume and introduced the organization, discussed your the hours.", "Interview Questions": "How long can you work for us"}, {"date": "13 May 2016", "title": "Education Program Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Save the Children (Ḩawwārah, Amman Governorate) in Sept 2013", "Interview Descriptions": "It was very smooth. I got interviewed by the Education Program Manager. They called me in after i submitted my CV to the HR. And a week after the interview I was hired. Now the recruitment process is more demanding than when i was  hired back in 2013.", "Interview Questions": "Tell us about yourself and why you are applying to Save the children Jordan"}, {"date": "9 Aug 2015", "title": "IYC Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Save the Children (Peshāwar) in Jun 2013", "Interview Descriptions": "Apply on the Brights pyre for vacancy. After shortlisting received call for interview. In interview compete competitors with excellent knowledge and skills. After gaining good score and winning the interview competition received Joining and selection call.", "Interview Questions": "IYCF stand for?"}, {"date": "16 Mar 2014", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1+ week. I interviewed at Save the Children (Washington, DC) in Mar 2013", "Interview Descriptions": "There were two telephone interviews.  The first was an initial screening with the department assistant.  The second was with the hiring manager.  Both were straightforward.  I was asked to describe my relevant experience and how I could contribute to the team.  I prepared by reading relevant Save the Children publications.", "Interview Questions": "What advice can you offer us for improving our organization?"}, {"date": "13 Feb 2013", "title": "Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Save the Children (Washington, DC)", "Interview Descriptions": "The phone interview was set up via e-mail by and HR person how confirmed that she would initiate the call. Questions were general and then relied on the the position description.\r\n\r\nThe in person (1:1) interview was set up by one of the project team members.  \r\n\r\nThe 1:1 interview was strange and somewhat unprofessional. The Interviewer was pleasant but seemed unprepared and inexperienced. For example, the interviewer had not previously reviewed my resume and left me in the interview room to get a drink.  There were few questions about my work experience or technical skills. Interviewer asked personal questions and  spoke more if his/her own experience and then basically insulted everyone who didn't work in her specific field.", "Interview Questions": "Have you spoken to your family about this position?"}, {"date": "6 Aug 2015", "title": "Communications Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 days. I interviewed at Save the Children (Westport, CT) in May 2012", "Interview Descriptions": "I sat with the director who would be overseeing my work. She was extremely nice and was super helpful with information. Answered all of my questions first. Didn't get personal about me. Just wanted to make sure I was qualified. She didn't ask many questions but it was for a temp position so she didn't really need to I suppose. Easy.", "Interview Questions": "My experience in the field"}, {"date": "15 Jul 2012", "title": "Documentation Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Save the Children (Islamabad, Islamabad) in Mar 2012", "Interview Descriptions": "2 interviews i have gave.", "Interview Questions": "the question was related to documentation.\r\n"}, {"date": "12 Apr 2016", "title": "Documentation Officer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Save the Children (Islamabad, Islamabad) in Feb 2012", "Interview Descriptions": "Though not up to the standard as interviewing HR personal are also mostly not up to the standard they just have few typical questions which more or less every person knew and when it come to have typical questions about your skills the manager sitting there then uses the favoritism for the selected list they wanted to hire based upon their caste or cultural background. \r\nThe standard process for interview is not taken into consideration every time.", "Interview Questions": "what is Child protection , what is the difference between disaster and risk, Classify emergencies and its forms etc etc"}], [{"date": "15 May 2015", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Save the Children (Washington, DC) in Oct 2011", "Interview Descriptions": "Applied online with application and writing sample. They also asked to perform a background check, and also provided me with the results. Met with Program Coordinator, then Director for final interview. They did read the writing sample and asked about its contents during the interview.", "Interview Questions": "Asked about research skills."}, {"date": "25 Jul 2012", "title": "Distribution/Program Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Save the Children (Rājanpur, Punjab) in Oct 2011", "Interview Descriptions": "What is Distribution procedure?\r\nHow to  request the commodities for distribution?\r\nhow to manage if any problem occurred at distribution point?\r\nWhat is SRF?\r\nWhat is Outlet Report?", "Interview Questions": "what will your first action if quarrel occurred in the community?"}, {"date": "31 Oct 2015", "title": "Shop Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 5 days. I interviewed at Save the Children (Cheam, England) in Sept 2011", "Interview Descriptions": "Phoning the branch to have an initial chat with acting shop manager, discussing motives, availability etc. Then being called in for an informal interview/chat in person to assess your suitability for the role and also to be shown around the shop. Was a really straightforward process and once we'd discussed what days I was available I was ready to start the next week! At that time I was under the legal age for operating a till so this was one of the things we discussed - alternatives and how I could get involved e.g. with sorting donations in the back room.", "Interview Questions": "Why do you want to work for Save The Children?"}, {"date": "10 Jun 2012", "title": "Operations Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Save the Children (New Delhi) in Jun 2011", "Interview Descriptions": "First round of Telephonic Interview, if get shortlisted you would be called in for a 1:1 Interview round. Final round of Interview would be conducted to finalize the salary part. After all the discussions you would be asked to submit your previous employment documents and references if all is clear you will be contact to confirm the Date Of Joining.", "Interview Questions": "Reason for a change ?"}, {"date": "8 Aug 2012", "title": "Foold Security and Livelihoods Community Mobilization Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Save the Children (Islamabad, Islamabad) in Sept 2010", "Interview Descriptions": "Save the Children conducted test to short list the candidates for interviews. After that shortlisted candidates were called for interviews. A panel of six persons including HR, Program, Child Protection conducted interviews.", "Interview Questions": "When the child rights ordnance passed in Pakistan "}, {"date": "28 Oct 2011", "title": "Program Associate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Save the Children (Washington, DC) in Mar 2010", "Interview Descriptions": "After first being contacted for an interview, and finally going in for an interview, the hiring manager never contacted me to let me know that they had chosen another candidate. Save the Children is a very reputable organization, however this was not a good example of professionalism from one of their employees.", "Interview Questions": "How do you thrive in a fast-paced, ever changing environment?"}, {"date": "21 Aug 2010", "title": "Communications Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 2 weeks. I interviewed at Save the Children in Aug 2009", "Interview Descriptions": "It was a phone interview followed by a one on one. It was very competitive and I think most candidates were hugely overqualified for the position.", "Interview Questions": "N/A"}, {"date": "19 Mar 2010", "title": "Desktop Support Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Save the Children in Mar 2008", "Interview Descriptions": "The first interview was a brief interview with H.R. for screening purposes.  The second interview was a few days later with the IT manager and a couple folks from the team.  I was asked the usual desktop support questions and it went very well.  I was invited back for a third interview witht the IT director a few days after that.  This interview consisted more of the \"where do you see yourself in 5 years\" type questions.  This also went very well.  Here is my gripe... I was never notified.  I waited two weeks or so and finally emailed the IT manager.  He replied that they found someone that better fit the position.  OK, great, but don't leave people hanging like that.  Very annoying because it's not easy getting to these interviews (mid day mind you so I have to take time from work) and they don't have the courtesy to call or even email you?  After 3 interviews?", "Interview Questions": "Provide an example where you were not able to solve a problem and what did you do about it?"}]]