[[{"date": "25 Jul 2023", "title": "Post Doctoral Researcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Karolinska Institute (Solna, Stockholm) in Dec 2022", "Interview Descriptions": "After you submit the Post doc position and then you will get interview. In 3-4 weeks after interview, they will contact you if you get that position. If you accept that position , HR will contact you to do the contract.", "Interview Questions": "Could you please tell us about your Ph.D work?"}, {"date": "8 Nov 2022", "title": "Postdoctoral Fellow Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Karolinska Institute (Stockholm, Stockholm) in Sept 2022", "Interview Descriptions": "2 rounds . One general and one webinar. On webinar they asked to present previous work to lab members. Followed by Q&A session. They took 3 weeks in total for 2 rounds", "Interview Questions": "Why you want to join our group? Describe your previous experience"}, {"date": "2 May 2022", "title": "PhD Student Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Karolinska Institute", "Interview Descriptions": "I had 3 interviews, one where I presented myself and my work, another where I presented a paper from the employer and suggested future experiments, and a last one where I met the members of the team.", "Interview Questions": "N/A"}, {"date": "24 Aug 2022", "title": "PhD Student Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Karolinska Institute in May 2022", "Interview Descriptions": "The interview was comfortable, and I was very nervous at the beginning, but after speaking with the interviewer, I became more relaxed. The interviewer was kind and the interview proceeded smoothly. In fact, I did not even notice when the interview was over. The questions were designed to learn more about my personality and what I am capable of doing. It was a very promising interview, but unfortunately, I did not receive the position.", "Interview Questions": "Questions about my background, my education, and my personality "}, {"date": "8 Apr 2022", "title": "Postdoctoral Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Karolinska Institute", "Interview Descriptions": "The interview is usually 2 rounds. First round was talking with PI, PI will ask about your research, corresponding experience and skillset. The 2nd round is to meet the team, sometimes one by one, to know each other.", "Interview Questions": "Tell me about your research."}, {"date": "7 May 2023", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Karolinska Institute (Stockholm, Stockholm) in Feb 2022", "Interview Descriptions": "It was typical conversation with friently atmosphere. They asked about me like: what I have done before, what I am looking for. Also they described me the project with a small presentation, they told me about the city. At the end they gave me some general advices before I take my decision.", "Interview Questions": "What have you done before?"}, {"date": "8 Mar 2021", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Karolinska Institute", "Interview Descriptions": "online application through the website and online interview were the interview process. first, they asked about my previous experience of research and they introduced their ongoing projects. overall, the interview took about 30 minutes.", "Interview Questions": "what was your previous experience of research."}, {"date": "23 Mar 2021", "title": "Biomedical Engineer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Karolinska Institute (Stockholm, Stockholm) in Mar 2021", "Interview Descriptions": "First interview was good and informitive. It was through teams and nothing serious. It was couestions bout you, how you are as a person, your technical interests, how you work in a group and so on.", "Interview Questions": "How should a boss be"}, {"date": "9 Jan 2021", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Karolinska Institute", "Interview Descriptions": "This interview was for the Covid diagnostic centre of Karolinska institute. The interview was quite casual and 1 to 1 with one of the managers. During the interview was told whether I got the position or not and immediately a trainingsession was planned.", "Interview Questions": "How do you deal with mistakes in your work.\nWhat role do you take when working in a team."}, {"date": "23 Oct 2020", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Karolinska Institute", "Interview Descriptions": "It was a great experience and different from most interviews I have attended. It was more like a conversation and very calm. Of course i had to prepare, however, the interviewers were so nice and made me feel comfortable and relaxed.", "Interview Questions": "Why are you interested in working with our research group? "}], [{"date": "18 Apr 2020", "title": "PhD Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Karolinska Institute", "Interview Descriptions": "The process interview was smooth and fast. People were welcoming and friendly. Application online by submitting your CV.  Later, the first round was a skype interview with a panel of persons and finally interview on site", "Interview Questions": "First round - skype. Questions about yourself and to describe your previous experience\r\nSecond  round - on site - oral presentation to the group regarding my MSc project."}, {"date": "6 Dec 2019", "title": "Senior Researcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Karolinska Institute", "Interview Descriptions": "Easy process since it the not a classical recruitment. Mainly based on CV. Basically you had to fill the criteria and get a good connection with the employer. I had a good experience on it", "Interview Questions": "Background and project."}, {"date": "23 Dec 2021", "title": "PhD Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Karolinska Institute in Sept 2017", "Interview Descriptions": "On zoom, very casual. Mostly personal/standard interview questions, very different from other more formal interviews. No science-specific questions from the interviewer. I was the one to discuss specific scientific aspects of the project, which lead to a nice, informal discussion.", "Interview Questions": "What are your strengths/weaknesses?\r\nWhy did you apply for this specific Ph.D.?\r\n"}, {"date": "5 Jan 2018", "title": "Postdoctoral Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 5 weeks. I interviewed at Karolinska Institute (Stockholm, Stockholm) in Sept 2016", "Interview Descriptions": "First talked via SKYPE. Second round is a trip to Sweden for group presentation. Need to prepare a 30 min previous research summary for presentation. Following the presentation, need to discuss with the supervisor for future plan. The University contract process is actually very quick.", "Interview Questions": "All field specific questions"}, {"date": "15 Jun 2018", "title": "Student Representative Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Karolinska Institute in Jul 2016", "Interview Descriptions": "It was through an email application. I sent my CV and cover letter to the responsible HR of the unit and after two days I got her email with the job congrats. I was lucky and happy to take the part-time job. It was great to meet with international students who have the various background.", "Interview Questions": "Describe yourself, previous student working experience and why you are interested in the position"}, {"date": "13 Oct 2020", "title": "PhD Candidate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Karolinska Institute (Stockholm, Stockholm) in Jan 2016", "Interview Descriptions": "Selection by CV followed by online interview (sometimes there is small test aiming to understand your critical/analytical thinking by reading and interpreting a scientific paper. Not a big deal). Once among the top 3, invitation for an onsite interview.", "Interview Questions": " Questions span from the educational background to previous working experiences (mainly lab-related work if applying for a position which includes lab work).  "}, {"date": "12 Sept 2015", "title": "Postdoctoral Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. I interviewed at Karolinska Institute", "Interview Descriptions": "After sending application, one or two Skype interviews with the boss. Afterwards personal meeting with boss and division in the Institute. Had to present my previous work and talk to current employees.", "Interview Questions": "General questions about methodology and experience"}, {"date": "12 Nov 2019", "title": "Postdoctoral Researcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Karolinska Institute (Stockholm, Stockholm) in Feb 2015", "Interview Descriptions": "One Skype meeting. We talked about the position and requirement as well as my skills. I presented myself and my PhD project. We discussed about the projects and how I can work on these projects.", "Interview Questions": "Explain me your PhD project."}, {"date": "16 Apr 2018", "title": "PhD Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Karolinska Institute (Huddinge) in Jan 2014", "Interview Descriptions": "Very relaxed. Stayed for a day including lunch and got to talk to many different people of the group/department. Everyone was very friendly and open. I was shown around the lab and offices and met already a good number of people I later worked with.", "Interview Questions": "What I worked with previously. My studies/background/interests. \r\nWeaknesses? Strength?\r\nWhy I want to do a PhD? Why in this specific subject"}, {"date": "12 Nov 2013", "title": "PhD Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 days. I interviewed at Karolinska Institute (Solna, Stockholm)", "Interview Descriptions": "Was difficult to reach the group leader by email (he treats job enquiries as junk email for the most part), so had to call, but he didn't pick up his phone; finally got a secretary to take pity on me and give me his cell phone. From there it was a brieze.", "Interview Questions": "It really was all very simple and straightforward - I guess prospective PhD students don't typically present to a lab meeting, which I did, as I had been working in a lab elsewhere before and had enough data for it."}], [{"date": "4 May 2017", "title": "PhD Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Karolinska Institute (Stockholm, Stockholm) in Jun 2013", "Interview Descriptions": "Group interview with a half hour presentation and half hour group discussion. Then interviewed by each member of the group. It is normal to start with a half year internship as research student and then to be registered as PhD student if they are happy with your performance", "Interview Questions": "Main about previous project and your skills. Nothing strange"}, {"date": "24 Feb 2016", "title": "PhD Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 5 months. I interviewed at Karolinska Institute (Stockholm, Stockholm) in May 2012", "Interview Descriptions": "The process was not so formal then. I contacted the supervisor and asked for an opening and if was able to bring home a grant on their idea which i did then they were happy to take me on after the money was in", "Interview Questions": "can you do this? The process was not so formal then. I contacted the supervisor and asked for an opening and if was able to bring home a grant on their idea which i did then they were happy to take me on after the money was in. Nice?"}, {"date": "28 Sept 2015", "title": "PhD Student Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at Karolinska Institute (Stockholm, Stockholm) in Oct 2011", "Interview Descriptions": "you start with preparatory course before starting PhD program. sometimes there are many shadow students who have not been registered for many years, but now a days it seems to be more transparent. Before you register as PhD student, you do 6-12 months preparatory program with starting of future phd studies, and then in your PhD registration seminar, you show preliminary data with 4 years program to the committee.", "Interview Questions": "Your research plan for 4 years will be suitable to finish in time?"}, {"date": "3 Aug 2012", "title": "PhD Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 days. I interviewed at Karolinska Institute (Stockholm, Stockholm) in Jul 2011", "Interview Descriptions": "Experience in the related field is what counts mostly. Secondly being innovative and passionate in your field is also necessary. Having a journal publication and poster presentations will help very much and also of course good communication skill", "Interview Questions": "No questions were very difficult or unexpected"}, {"date": "17 Aug 2010", "title": "Assistant Professor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Karolinska Institute (Stockholm, Stockholm) in Apr 2010", "Interview Descriptions": "The 1:1 interview focused on discussions of my research experience, leadership experience, communications experience and vision for a specific project. The employer was searching for someone who could switch between and integrate different resolution levels involved in project management, from the design, implementation, analysis and interpretation of specific experiments, to the recruitment, management and training of team members, to tactical decision making on project directions, and also strategic decision making on long term project development and targeting.\r\n\r\nA presentation to the host laboratory involved explanation of past findings, methodological capabilities and most critically, vision for the future of the project in question. Q and A was open ended but focused predominantly on scientific findings rather than project/management issues.\r\n\r\nAn extensive document (fitting a KI pro-forma) was required detailing past research, training, management, and leadership experience. Publication lists, conference and invited speaker presentations, patents/licenses held, commercialisation history, and awards/fellowships/grants were all key parameters for external review by internationally renowned professors.", "Interview Questions": "How do you envisage the development of the specific (technical development and implementation) project over the next 5 years?"}, {"date": "28 Apr 2012", "title": "PhD Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 1 day. I interviewed at Karolinska Institute (Stockholm, Stockholm) in Jan 2010", "Interview Descriptions": "Had to work hard to make contact with group leader - they get tons of junk applications, so if you don't hear from them by email, don't give up. Emailed a couple times, no word. Started calling office, no answer. Eventually, after many calls over a couple weeks, was forwarded to secretary who took pity on me and gave me his cell phone number, made contact. At this point he was already impressed which made the rest a lot easier.\r\nFlew over at group leader's expense. If you visit other group leaders there, say so or they will get very annoyed. Made a research presentation (unusual for PhD studentships), two 1:1 interviews, one with group leader, other with close collaborator in the department. Very straightforward, although I was familiar with the field, no surprises, no brain-teasers. Generally was a discussion of projects, science, and personal history. Offered idea for a project, which was clearly appreciated, although equally clearly not seriously considered. Met lab members who described ongoing projects in the lab. Lunch with the boss and collaborator. Dinner with the lab, minus boss.\r\nOverall, exciting, fun, interesting, busy, and lots of information to absorb.", "Interview Questions": "Why are you interested in coming here?"}, {"date": "2 Apr 2011", "title": "R&D Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Karolinska Institute (Huddinge) in May 2009", "Interview Descriptions": "I received the phone interview at first and was invited then to visit the place. It was a one-day interview and nearly every member of the group had a brief discussion with me, introducing their work. Finally, I had a private conversation with the group leader about my future work and research topics.", "Interview Questions": "technical question about your background and main research topics"}, {"date": "11 Sept 2011", "title": "Postdoctoral Researcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Karolinska Institute (Stockholm, Stockholm) in Apr 2009", "Interview Descriptions": "I received an email after application stating that my application was under review. A few days later, I received an email for setting up a Phone interview appointment. It was an enjoyable interview and many questions were asked, many general, some on the philosophy of research and some about the practical considerations of the job. Then I was asked to visit the workplace for a 1:1 interview. I made a presentation of a about an hour and was interviewed and got to meet with many people at various levels in the organization. At the end of the day, I was asked for my opinion and consent and also offered the position. It was a very enjoyable process overall. The phone calls were prompt and things were well taken care of.", "Interview Questions": "why do you want to work here?"}]]