[[{"date": "25 Jun 2023", "title": "Welcome Center Representative Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Harrisburg Area Community College", "Interview Descriptions": "Phone interview followed by a zoom interview, then had to go to the campus to do an in person interview. You would think this was a high paying job for all the time it took to interview but it was only in the 30,000+ range. They think they are academic elites but they offer a mediocre education. I thought the interviewers were really full of themselves and somewhat rude.", "Interview Questions": "What would you do if someone used a racial slur at the welcome desk"}, {"date": "7 Mar 2023", "title": "Gift Processing Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Harrisburg Area Community College", "Interview Descriptions": "The interview was a Zoom interview including several team members. The team was friendly and took turns asking interview-type questions. There is a question about diversity that was very different from typical interview questions.", "Interview Questions": "Tell me a time when you were expected to promote diversity at a previous position."}, {"date": "16 Jan 2023", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Harrisburg Area Community College (Harrisburg, PA) in May 2022", "Interview Descriptions": "Interviewed by the department head and the Dean of the department by zoom. The interview was about an hour long. That call was followed by emails back and forth with links to portfolio and projects.", "Interview Questions": "What do you think in important to be an instructor at the college level?"}, {"date": "27 Mar 2022", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Harrisburg Area Community College", "Interview Descriptions": "The in-person part of the interview included discussion of teaching methodologies and application within classroom scenarios, along with a mock lecture and giving of an assignment. Demonstrating how the assignment would be structured for remote learners was also required.", "Interview Questions": "How would you address the differences in students’ experience level with the curriculum for this course?"}, {"date": "24 Aug 2021", "title": "IT Systems Administrator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Harrisburg Area Community College (Harrisburg, PA) in Jul 2021", "Interview Descriptions": "The interview was a Zoom based interview for a remote position, that occurred in two stages. The first stage was with supervisors and the hiring manager, then progressed to a panel of individuals who were selected to represent different parts of the organization. \n\nThe organization is excessively reinforcing an artificial corporate culture of diversity. It's only good if it's authentic. \n\nDuring the first part of the interview we went over the usual interview questions for the position explaining why I would be a good fit etc. Toward the end after the manager explained what diversity meant to them \"no one should be judged based on how they look\". later asked, \"Why aren't you wearing a tie? \" To which I explained that this is a remote position, I was dressed appropriately in a nice solid color button-up shirt, and that the industry has moved to a more casual position on dress. To me this indicates that the employer cares less about the qualifications and more about control over the individual and how they look. \n\nDuring the first and second part of the interview as well as the application I was told to explain my view on diversity in the workplace 4 times. Diversity is important but it shouldn't be something someone needs to actively pursue, to be authentic about it, it should come naturally. This indicates to me that the culture of the workplace is struggling with diversity.\n\nThe interviewers also brought my age into consideration stating that I was pretty young and new to the field (5 years of industry experience) for this mid level position. Experience and qualifications should be the only thing discussed in an interview not age. Pay range was also below the industry normal. The interviewers had been with the company for decades, I don't believe they have had to hire a new addition to their team in a long time. \n\nOverall the staff on the board seemed friendly but there were too many red flags for me to consider this position if I were to get an offer. I have not heard from the organization, and the interview was a month ago.", "Interview Questions": "Why do you think diversity is important in the workplace? \n\nTroubleshooting questions"}, {"date": "3 Jun 2021", "title": "Records Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Harrisburg Area Community College (Harrisburg, PA) in Mar 2021", "Interview Descriptions": "A bunch of older ladies who know very little about the jobs they actually perform. Their questions were very basic and I understood clearly that my expertise overshadowed their own work by a factor of 10.  This place is a bust if you're a minority applying for any job even if your more experienced than the actual staff already working there.", "Interview Questions": "How well do you work on teams? "}, {"date": "19 Dec 2022", "title": "Math Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Harrisburg Area Community College (Harrisburg, PA) in Aug 2018", "Interview Descriptions": "it was an easy process because I was one of the student in the math class and the professor just asked if I wanted to be a tutor to help her out with the students", "Interview Questions": "Have you ever had any experiences in teaching?"}, {"date": "1 Jun 2018", "title": "Nursing Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Harrisburg Area Community College (Lancaster, PA)", "Interview Descriptions": "Applied online.  Took some time until was contacted for an interview, probably several weeks.  Spoke over the phone. Set up an interview meeting. Presented a teaching presentation.   Was offered the position. Then met with Human Resources.", "Interview Questions": "Education/teaching style "}, {"date": "31 Jul 2019", "title": "Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Harrisburg Area Community College (Harrisburg, PA) in Apr 2017", "Interview Descriptions": "Had to meet with several different parties including HR, administration, and faculty members.  Met with HR for background check and educational audit then met with the dean and department chair for one on one interviews before a final teaching demonstration and open Q&A session with the department faculty.", "Interview Questions": "I was asked about my teaching experience with adult learners."}, {"date": "27 Oct 2015", "title": "Career Counselor Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Harrisburg Area Community College", "Interview Descriptions": "This is one of those situations where you're pretty sure the job was already filled before you even applied, and you're just going through the motions of helping them off all the right boxes to make it look legit.", "Interview Questions": "The questions were canned and corny and not really representative of the job requirements. "}], [{"date": "22 Jan 2018", "title": "Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 days. I interviewed at Harrisburg Area Community College (Harrisburg, PA) in Sept 2015", "Interview Descriptions": "easy, a Professor referred to me. I did not really have an interview. I was hired on the spot. They just asked me for my bank account and routing number at the interview so they could send me my direct deposit.", "Interview Questions": "N/A"}, {"date": "7 May 2015", "title": "Career Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Harrisburg Area Community College", "Interview Descriptions": "There was a multi-step interview that spanned about 3 hours. I was interviewed by Human Resources followed by a team from the department where I was hired, and also by central supervisors and personnel. After my interview, I was told they would call me either way within a couple of weeks.", "Interview Questions": "Describe your philosophy of higher education?"}, {"date": "30 Apr 2014", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Harrisburg Area Community College (West York, PA) in Mar 2013", "Interview Descriptions": "I did receive an email, asking if I was available for an interview for the position that I applied to. The interview was for the following week. I was to meet with the HR rep and she took me to the interview room. I was interviewed by the Associate Dean and other Administrative Assistants. I was asked about my skills, and what level my skills were. I was also asked how I decide what projects need to be completed first. They seemed to like all of my answers.", "Interview Questions": "How would I handle an upset or angry student who insisted on talking to the Dean if the Dean was not available to speak with the student at that moment?"}, {"date": "31 Aug 2013", "title": "Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Harrisburg Area Community College (Harrisburg, PA) in Aug 2010", "Interview Descriptions": "Recommended for position by professor while I was a student.  Initial interview showing writing samples. Two day training all day with grammar quiz.", "Interview Questions": "N/A"}, {"date": "22 Sept 2009", "title": "Administrative Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "The process took 1 day. I interviewed at Harrisburg Area Community College (Harrisburg, PA) in Jan 2009", "Interview Descriptions": "It takes forever to hear from them (months) once you submit an application to their website. When they do call for the interview, the people are very friendly and helpful. The interview process is a total head-scratcher though. Basically it's anywhere from 3-7 people who each take turns asking scripted questions. No follow-up questions, they just move onto the next questions. The questions are strange as well. They seem to be very cerebral and would give the interviewers absolutely no idea of what the person being interviewed is actually like. It is odd to give answers and have no one comment on the answers or ask a follow-up question. I've had 3 interviews with them, and it's been the same way each time. I've also felt like it was a waste of time, because twice they decided to pull the position and not hire anyone due to lack of funding or something. Seems like a very, very nice place to work, though, provided you can get past the very strange interviews.", "Interview Questions": "What is important about global management of a learner centered environment?"}]]