[[{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "A great place to work for people who want to make a real difference", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "4 Feb 2021", "job_title": "Anonymous Employee in London, England", "duration": "N/A", "pros": "- you get to work for an organisation which is achieving real, tangible change\r\n- everyone has the opportunity to put their ideas forward, no matter how junior. If it's a good one, you can run with it \r\n- the opportunity to take part in demos, leafletting, etc. during work hours \r\n- a vegan office so no stinky egg sandwiches or meat \r\n- dogs to play with during breaks!", "cons": "- it's a fast paced, dynamic environment with many changing priorities, which may not suit everyone's working style"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Believe the hype, it is *really* that bad.", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "10 Oct 2022", "job_title": "Anonymous Employee in London, England", "duration": "N/A", "pros": "- You will meet like-minded colleagues, a lot of good people pass through\r\n- Occasionally free vegan food\r\n- Good office location\r\n- Easy to get a role here with little or no experience, due to reasons below. But if you have another option, take it.", "cons": "- One of the worst things is the deadly silent office. It is literally depressing to have to be in that space everyday (even if you have friends there, I imagine it would be intolerable without any). There is NO oral communication and everything is done through digital channels. If you do try to talk or chat, even in the kitchen area, management will complain about you.\r\n- Very low salary. Expected at an NGO, but this organisation will actively take steps to pay you as little as possible, and still expects everyone to work from the (obviously expensive to access) London office. \r\n- They mainly hire only very young and inexperienced people. This is because there is absolutely no interest in hearing ideas or innovation from staff, you are simply expected to be the dogsbody who will carry our their outdated strategies that come directly from the U.S. and the Director Ingrid Newkirk. Because of this, there are almost no learning opportunities.\r\n- No scope for growth or progression (even if you push for it) beyond minor vanity promotions (slightly changed title and tiny pay increase). They would rather hire a new staff member in your place that they can pay minimum wage than promote you. Staff are just numbers to them, the cheaper the better. \r\n- Constant turnover. They also create and change roles constantly without informing the team until the new staff member(s) arrive, leaving you unsure where you stand. \r\n- No job security. I saw people dismissed (with immediate effect) simply because they are not liked by \"favoured\" colleagues or the management. These are people who gave up real careers and prospects to dedicate their time to the cause for animals. Some people also have their probations extended seemingly endlessly. \r\n- You are not given feedback, but rather there is gossip amongst management that you eventually find out about.\r\n- I had managers make inappropriate comments about my personal life and even spread this invented gossip amongst colleagues. I am more than up for some banter .etc, but it was beyond that. \r\n- You write a \"weekly report\" with detailed information on every task you completed. This gets sent all the way up through management chains to Ingrid Newkirk, who apparently reads them all. Whilst reporting on progress is normal, this system is just weird. \r\n- Management are surely aware of all these issues and their constant staff turnover, but do not care or act. Ultimately, there is no compassion for people here."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Not what you think!", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "30 Apr 2022", "job_title": "Anonymous Employee in London, England", "duration": "N/A", "pros": "Vegan office and you'll get free vegan food there sometimes.", "cons": "I've seen so many people entering this place like it was DisneyWorld and founding out shortly after that it's anything but. Favouritism is appalling and looking at their turnover rate speaks for itself, managers are rude, there's also not a nice atmosphere in the office. Everything is asked to be done at the last minute, good work isn’t praised (criticism on the other hand…) and there’s little room for growth, not to mention wage inequality. They will make you believe that your ideas will be put to use when it's still the same group that dictates everything. They also take ownership of victories of other organisations when it's a collective effort really, especially since sending out petitions and organising 5-minute demonstrations in the street just to get media coverage does not require huge amounts of donations. Honestly, if you want to be active for animals, you will do so much more by participating and organising events yourself, and donating to small charities that actually help animals."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Worst job in recent memory", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "24 Feb 2022", "job_title": "Anonymous Employee in London, England", "duration": "N/A", "pros": "Completely vegan kitchen. No animal products allowed in office (Kings Cross). Bagels every week. Office situated near to VX cafe. Access to lots of animal rights / vegan materials.", "cons": "Eerily silent office, but only when managers are in. People told to get back to work when talking in kitchen. Ignorant (white) staff comparing animal rights to the abolition of slavery. Managers continually demote capable staff and extend probation periods for no good reason at all. Dogs are brought into the office with no consideration for anyone who might not be comfortable around dogs (cynophobia is real). Office is freezing cold all year round. No consideration shown to staff who struggled with the low temperature to the point where they couldn't focus on their work. Staff are forbidden from using one exit of the office purely because PETA President said they should walk through the office and say goodbye to everyone when they leave. Junior staff called into a patronising meeting and ordered not to leave any clutter on their desks. Serious lack of diversity in the office. I only saw one non-white employee when I was there. As others have said, \"the animals have it worse\" is used to justify overworking staff and expecting them to give up their free time to join protests. Workaholics are promoted. Managers are very self-important and condescending. As soon as staff resign (which happens very often), management make it clear they don't want them in the office and encourage them to take their notice period as leave. I didn't even know that was possible until I worked here. But then I had never worked for a cult before.\r\n\r\nWhen I got the job, I thought working at PETA would be a dream come true. But it quickly turned into a nightmare. I feel so much better since I left. I still do all I can for animals, but I'm no longer part of a cult."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 3, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Oh boy...", "rating": "2.0", "reviewer_affiliation": "Former Employee", "job_date": "9 Feb 2021", "job_title": "Fundraising in London, England", "duration": "N/A", "pros": "- PETA UK is an organisation filled with people who want to make the world a better place for animals, and are truly passionate about it. I have made some lifelong connections getting to meet such likeminded people\r\n\r\n- PETA UK’s HR department works tirelessly to make the workplace as good as it can be. They’re compassionate and caring and completely essential.", "cons": "- PETA love to use the excuse that ‘the animals have it worse’ to justify stress, overwork and no work life balance. For an organisation that stands for compassion, it’s very rarely extended to its staff and it is baffling how even those in higher management positions let themselves live on the cusp of burnout for years on end.\r\n\r\n- People don’t leave PETA because they decide they’re against the cause. I would have stayed indefinitely if I didn’t have my confidence shattered, my spirit broken and become completely burnt out. All these people who are passionate about making the world a better place for animals have that taken advantage of and end up belittled for their choice to prioritise their own lives.\r\n\r\n- There is so little trust in anyone - even people who have been there for years - to the point that inboxes are read, chats are monitored and each week a report of what you have done is sent to president to monitor staff. Not until I left did I realise quite how bizarre that is. Not a casual chat with your manager about work progress but a full blown written report of your completed and ongoing tasks that is passed up through varying stages of management and is often questioned if the output doesn’t look good enough. \r\n\r\n- When I left, the entire office was white. Any members of staff who were not white had left after being tokenised or completely mistreated by upper management. Any staff concerns raised about this - or around any kind of intersectionality - were ‘listened to’ but completely dismissed. Nothing in my time was ever changed, and there was a limited effort to rectify huge inequalities."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Horrendous. Do not work here under any circumstances. It's a cult.", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "17 Dec 2020", "job_title": "Shift Supervisor in London, England", "duration": "N/A", "pros": "- Working with and making friends with people passionate about animal rights.\r\n\r\n- Office is on a good location next to the canal.\r\n\r\n- Oh you get a couple of bagels a week.", "cons": "- A very disturbing and sinister experience. I had never worked in a cult before. \r\n\r\n- Some of what goes on is truly shocking.\r\n\r\n- After observing what went on it didn't take long to realise that PETA actually wanted to test and break their staff mentally and psychologically.\r\n\r\n- The managers are not nice people. They are disrespectful, cold and downright rude. They literally ignore you for the vast majority of the time. The managers treat the staff – good, compassionate people – quite horribly. They will not speak to you or acknowledge you in the kitchen. They will literally blank you. One manager never said a single word to me on a personal level during my employment with PETA.\r\n\r\n- It doesn't matter how hard you do or don't work or whether you (try to) fit in and adapt to the PETA 'culture' - you will still be treated despicably whether you're 'cut out for it' or not. It's all the same regardless. Hard workers get treated awfully too.\r\n\r\n- Ignore the HR replies to the posts on here. It's not the fault of any HR staff though. They can do nothing so long as management want the situation to continue. So nothing changes. Management are not in the slightest interested in the well-being of their employees and making the PETA office in the least bit bearable, never mind actually nice, pleasant and welcoming. They do not care. Indeed this is the working environment they wish to cultivate because if not after years of such feedback then they would of addressed the very serious and alarming issues repeatedly raised. That ex-employees flag the same issues again and again repeatedly but nothing changes tells the story of what working at PETA is all about.\r\n\r\n- They exploit the idealism of young staff (who put up with a workplace environment and stay for longer than they otherwise would because of the difficulty of getting other employment in animal rights) who don’t know much or any different and that the cultish conditions and atmosphere are not normal and very, very wrong. \r\n\r\n- They have a shameful and disgraceful policy of (continually) extending probations for trivial and spurious reasons to avoid giving staff a permanent contract and the security and piece of mind that gives when living and working in a very expensive city like London.\r\n\r\n- There is near total and absolute silence for most of the time. It was an utterly surreal and bizarre experience for adults to have to liaise professionally and communicate by whispering so often.\r\n\r\n- There is a genuine atmosphere of fear. People are literally afraid to talk. People get told off for talking to each other in the kitchen. I've never known anything like it.\r\n\r\n- PETA are incredibly harsh with people arriving late for whatever reason, with little to no concern that you may have had a stressful journey, or any consideration for and understanding of travelling and commuting in London and the delays that can occur which you are in no way responsible for. They can be rather selective with this though, as some staff get given more slack on this than others. Yet many staff work late each evening and give up their free time of an evening or of a weekend to attend demos and protests. That counts for absolutely nothing though if your tube line is down or has delays!\r\n\r\n- Staff re-locate from other countries, leave their previous jobs or turn down other jobs they have had offers for when they accept what they assume would be a dream job with PETA which soon turns into a nightmare experience. People can and do make huge changes to their lives to come and work for PETA and the animals, only to be treated appallingly for doing so. Hence why relatively few even see out a year at PETA.\r\n\r\n- Shocking and disgraceful treatment - rather than compassion and kindness - for those that have medical appointments and medical conditions.\r\n\r\n- Some promotions make absolutely no sense in terms of experience and suitability. It makes total sense with regard to favouritism though.\r\n\r\n- The staff turnover is unsurprisingly staggering and if only donors and supporters knew the cost and waste of the constant recruitment merry-go-round! You would always wonder who would be the next to leave. You would never have to wait very long at all though to find out. \r\n\r\n- Good, decent and talented people don't stay for very long who could achieved so much for PETA - and more importantly the animals - as there is a limit to how much people will put up with.\r\n\r\n- It's an even harder and more stressful experience if staff have few or any office friends or are not a part of any of the cliques.\r\n\r\n- Such a shame as it could of been so, so different.\r\n\r\n- Avoid at all costs."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Like Scientology but the pay is bad", "rating": "2.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "22 Jan 2020", "job_title": "Administrator in London, England", "duration": "N/A", "pros": "- you work in an organisation where everybody shares some of your values\r\n- King's Cross office location\r\n- dogs in the office", "cons": "- there is no HR function to speak of, other than high turnover and endless recruitment\r\n- you're made to watch videos of animal cruelty as your induction but not to undertake any structured training\r\n- office is weirdly quiet\r\n- hostile atmosphere with cliques and aloof management who you never speak to\r\n- you are not trusted to work from home regardless of your role\r\n- management snoops into your life and brings your personal life into the office"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Avoid avoid avoid!", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "27 Nov 2019", "job_title": "Campaigner in London, England", "duration": "N/A", "pros": "Sometimes you get free food", "cons": "- Poor salary compared with other nonprofits in London\r\n- Awful management who are basically untrained and free to act as they wish due to lack of concrete HR dep. The managers don't receive regular training, are not good communicators and speak to their underlings with pure disrespect (usually by email as most of them aren't there in person). \r\n- Hostile working environment\r\n- Lack of diversity and minorities used as campaign material\r\n- Poor training and impossible standards\r\n- Passive aggressive working relationships, conducted by email even if colleague is in the office therefore no creative collaboration\r\n- Very strict working from home conditions for low level employees even if managers are there in person once every two months and the job is doable from home\r\n- No emotional intelligence from managers with regards to personal issues\r\n- Absolutely no benefits at all - not healthcare, not gym, not travel just an occasional free meal\r\n- Just ask \"HR\" about the attrition rates\r\n- Even my friends who stayed absolutely hate being there and are only doing it to put on their CV"}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Absolute shambles! \nBut only some people were friendly and kind.", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "29 Mar 2019", "job_title": "Database Administrator in London, England", "duration": "N/A", "pros": "Made a good few amazing friends!\nDogs in the office", "cons": "Unprofessional management \nLack of support\nFavouritism from Manager/s\nNo structure in training \nLack of acknowledgement from the Manager \nGloomy and very uncomfortable as well as extremely annoying surrounding on the far end table of the office"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Amazing work place - career progression for hard workers & you get to work towards an important cause everyday", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "23 Sept 2020", "job_title": "Fundraising in Kings Cross, England", "duration": "N/A", "pros": "- Dynamic working environment. \r\n- Fast-paced exciting work. \r\n- Friendly team. \r\n- Career progression (if you show your dedication and work hard)\r\n- Everyday the work you do makes a huge difference towards animals lives and well being. \r\n- Everyone is vegan - no hypocrites in the office eating meat. \r\n- People genuinely care about animals. \r\n- Good communication. \r\n- You get to work with alot of different people. \r\n- Lots of women in the office instead of over run by males - which makes an amazing change!", "cons": "- Upsetting when you see negative reviews from individuals who have either not worked in the office in their life or had a negative experience (most likely caused by themselves such as the very negative one shown below)"}], [{"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "A dynamic, challenging and rewarding place to work", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "12 Aug 2019", "job_title": "Fundraising in London, England", "duration": "N/A", "pros": "+  Empathetic , encouraging and attentive management \r\n+ Knowing that every day you play a role in advancing PETA's incredible work for animal rights\r\n+ Working for PETA's international affiliates and learning about Fundraising in a variety of markets \r\n+  If you work hard, managers will reward you with the opportunity to handle your projects independently \r\n+ Great work-culture with vegan pot-lucks and awesome Christmas parties!\r\n+ Opportunities to be involved with activism \r\n+ Working from home is offered after two years", "cons": "+ The workload is heavy and not everyone is cut out for it."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Worst workplace ever", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "2 Aug 2019", "job_title": "Anonymous Employee in London, England", "duration": "N/A", "pros": "Convenient location in King's Cross.", "cons": "I'm very disappointed in how working for PETA has turned out. I would have thought that a charity that uses the word \"ethical\" in its title would treat its employees respectful.\r\n\r\nI don't recommend working at PETA UK for several reasons:\r\n\r\n- High turnover in employees, only a few stay longer than a year (there is a reason for this) \r\n- Disrespectful and sometimes discriminative behaviour towards employees\r\n- Work climate is hostile and unhealthy\r\n- No trust basis between management level and employees\r\n- Incompetent management level, micromanagement\r\n- Employment policies that overlap into private life\r\n- Very low wages compared to similar charities\r\n- No benefits whatsoever\r\n- Working from home is not allowed\r\n- No training or development opportunities\r\n- No overtime compensation"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Worst charity ever", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "1 Feb 2017", "job_title": "Fundraising in London, England", "duration": "N/A", "pros": "You can put it on your CV, thats the only benefit, and even then, no employer i talk to has ever herd of PETA", "cons": "PETA is an organisation funded by people who have good intentions, who think by donating money to PETA they are saving the life of a dog. In fact they are supporting a bunch of vegan hippies use women as sex objects and degrade the work of animal rights. Since leaving the charity i understand how unimportant there work is, nothing has changed, I see no mentioned of PETA ever, they are so out of touch with people, no body cares about there work....\r\n\r\nThe pay is beyond a joke, i needed a second job to survive."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "A people-hating, cult-like organisation that will damage your mental health", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "24 Jul 2020", "job_title": "Communications Specialist in London, England", "duration": "N/A", "pros": "There are none apart from I made good friends", "cons": "A people-hating, cult-like organisation that will damage your mental health \r\n\r\n- PETA wants to appear as if it's making the world a better place for animals, but really they do very little. They waste tonnes of money on PR stunts, protests that achieve nothing (only conducted to look like they're doing something for animals), and gather donations from the public that'll go on providing the newest IPhones and flights to Christmas parties abroad for it's senior management who don't have a life. \r\n\r\n- They are deeply corrupt, covertly racist (probably 0% diversity currently - all white staff who are young girls who think it's okay to get paid peanuts and are essentially exploited because of their compassion for animals). When I say corrupt, I mean they genuinely mistreat staff and use the excuse that everything we do is for animals, so if you have to work weekends without overtime pay you're 'doing it for the animals'. \r\n\r\n- You've got to be insane to stay at PETA for more than a few years, all of the negative footage they make your watch has a detrimental impact on mental health. It explains why senior management is so deluded and mistreat junior staff. Managers commonly blame junior members of staff for their mistakes, and they have no intention of mentoring, training or genuinely wanting you to progress. \r\n\r\nYOU'LL LOSE YOUR CONFIDENCE, SELF-ESTEEM AND INDEPENDENCE IF YOU WORK AT PETA. \r\n\r\nHR will just tell you to speak to your manager if you have any problems, which is impossible to do because junior opinions never matter here. It's honestly a losing battle. Best thing I did was leave, now I feel like myself again."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "AVOID", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "26 Sept 2017", "job_title": "Anonymous Employee in London, England", "duration": "N/A", "pros": "None - they appear nice but in reality are cold and dismissive.", "cons": "They are extreme and offer no guidance. Extremely unprofessional and lack any respect for individuals. Do not waste your time applying here as you could miss other good opportunities."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "A strange place to work with a hostile atmosphere", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "26 Jul 2018", "job_title": " in London, England", "duration": "N/A", "pros": "It's near Kings Cross. That's all I can think of.", "cons": "Almost deadly silent office, poor management, no real HR department"}]]