[[{"date": "18 Mar 2023", "title": "Intern Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at NYLAG", "Interview Descriptions": "Short. They said they ask generic questions to all applicants in the name of fairness to each interviewee and then give you time at the end to add in anything else you want them to know.", "Interview Questions": "Where do you see yourself in five years?"}, {"date": "16 Apr 2022", "title": "Paralegal Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at NYLAG in Mar 2022", "Interview Descriptions": "I did not enjoy this interview process. I've never been grilled with questions in an interview, but that's what happened here. The asked me a series of similar questions with no follow-up questions nor did they engage with anything I said. There were about 6 people in my interview, which was odd because only one person spoke. I've worked for legal nonprofits before, so I'm wary of the burnout you can get from working for one. I asked them what they did to prevent burnout in their employees and they had no response, which is a red flag for me. The entire interview lasted about half an hour and there was only one round, which is also a red flag for me since I feel like you need more than that to make a good staffing decision. Also, they never got back to me after the interview.", "Interview Questions": "Why NYLAG? Why this specific department? How do you keep organized? "}, {"date": "5 Feb 2022", "title": "Summer Internship Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at NYLAG", "Interview Descriptions": "Submitted resume/CV through NY law job career fair. Got interview through career fair, interviewed for about twenty minutes with one lawyer, had follow up interview scheduled with someone program-specific later in the day.", "Interview Questions": "General questions: why law, why NYLAG, what groups interest you and why. "}, {"date": "23 Jan 2022", "title": "Paralegal Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at NYLAG", "Interview Descriptions": "Applied and received an interview request within a week. Relatively disorganized process I would say though as they wanted to interview me the next day and I didn't get a confirmed date and time until the day of the interview. It was ok, they used an interview script so it was hard to build much of a connection with the interviewer. Sent a thank you the next day and received a second interview request for the following week. I confirmed and didn't hear anything back. The day of the second interview no one showed up at the specified time.  I emailed them and got a short apology the next day and was  offered a new time the following week. This interview only lasted ten minutes as it seemed the attorney was in a rush to go to a court hearing. Wasn't able to ask any questions. I sent a thank you letter the next day and a follow up email the next week asking where they were at and never received any response. I would expect some kind of communication letting me know I wasn't selected considering I interviewed twice.  \r\n\r\nI wouldn't be surprised if they are the type organization to contact old applicants months later when their new hires quit. They made reference to two \r\nof their paralegals quitting abruptly and it seemed like they felt it was unprofessional and were disappointed. But now I am wondering if it is the disorganized office culture and poor communication practices of the organization that is to blame. Overall, I can't recommend applying to this organization.\r\n\r\nInterview Difficulty * Not difficult, just disorganized.", "Interview Questions": "Why are you passionate about public interest law?"}, {"date": "7 Dec 2021", "title": "Summer Legal Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at NYLAG", "Interview Descriptions": "I interviewed as a first year law school student for a summer legal internship. Interview was great. The attorneys are genuinely interested in learning more about your past experiences and are super friendly. I received an offer about 2 weeks later.", "Interview Questions": "One question I was asked was about my experience with clients who have experienced trauma"}, {"date": "22 Jul 2021", "title": "Paralegal Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at NYLAG (New York, NY) in Jul 2021", "Interview Descriptions": "Interview was with five other staffers. It was about 30 minutes long and they send you the questionnaire before hand. Everyone was extremely nice and welcoming. They responded quickly after the interview", "Interview Questions": "How well do you work in a team. Describe a time you had to deal with difficult people "}, {"date": "14 Jan 2020", "title": "Anonymous Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at NYLAG (New York, NY) in Jan 2020", "Interview Descriptions": "Applied online and within days got a call back for an in person interview. No phone interview. The vibe wasn't very inviting or friendly since It is primarily a legal office. It was instantly off putting. Wouldn't recommend if you're looking for an atmosphere that is less corporate.", "Interview Questions": "Normal interview questions. Random questions about why I didn't do certain things with my career. "}, {"date": "23 Jul 2019", "title": "Paralegal Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at NYLAG (New York, NY) in Jun 2019", "Interview Descriptions": "Applied online, was called in for an interview. There seems to have been little to no preparation as questions were repeated and one interviewer kept working at his screen as I answered questions. Company made it very clear that they wanted to pay me the minimum requirement even though I have above-average experience for a recent college grad. I was then made an offer the next day, although for a different job than the one I'd applied for, and then in turn was only offered 24 hours to accept a job that theoretically wouldn't start until a month and a half from then. When I asked if I could have at least a week to consider, considering that this job offer was for a completely different position, I was denied anything more than a 24 hour period because the *backup* candidate had a different job offer to reply to. \r\n\r\nDo better.", "Interview Questions": "Tell us about your experience "}, {"date": "10 Jun 2019", "title": "Legal Assistant/Paralegal Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at NYLAG in May 2019", "Interview Descriptions": "I was contacted for a video interview two days after applying. Interview took about 30 minutes and was with an attorney as well as a paralegal. They contacted me about a week after the interview to say that I had not been selected.", "Interview Questions": "Why do you want this position?"}, {"date": "7 Apr 2019", "title": "Paralegal Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at NYLAG", "Interview Descriptions": "Typical interview process, but there were about 5 people in the room including attorneys, paralegals, and the supervisor. They were all very friendly, but going in I assumed that I was only going to be meeting with one person. Typical interview questions, nothing to trip you up.", "Interview Questions": "The interview questions were not difficult. I just gave them some background on myself and they asked me more about that. "}], [{"date": "21 Feb 2019", "title": "Paralegal Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 3 weeks. I interviewed at NYLAG", "Interview Descriptions": "It was a quick and steady interview process. Please be ready to interview with multiple people at once. The interview process can range from 1 week to 4 weeks depending on what unit and position you are applying for.", "Interview Questions": "Why this specific position and how is your previous job experience help you in this new role?"}, {"date": "13 Aug 2018", "title": "Paralegal Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at NYLAG (New York, NY) in Jun 2018", "Interview Descriptions": "The first interview round was intense, I first met with the paralegals of that department for around 30 mins and then for the next 30 mins I met with a some attorneys. After a week and a half I was contacted for a second interview. I met with the main director of the department and with other two attorneys. After the interview I was asked to submit my references and was asked if I could provide my current supervisor's contact info (who was not listed as a reference). I did not hear anything back until I emailed the director asking for an update (after a few weeks)  in which I was told that they had already hired someone else.", "Interview Questions": "What is the hardest part about not being able to assist a client (not being able to take their case) and how would you assist a client whose case cannot be seen by NYLAG?"}, {"date": "23 Apr 2018", "title": "Bilingual Paralegal Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at NYLAG (New York, NY) in Apr 2018", "Interview Descriptions": "I applied online and was contacted by the Director of the team I would be working for a couple of hours after I submitted my resume, cover letter, and writing sample. I scheduled an interview for the following week. The interview consisted of a phone screening, and then a group interview with the attorneys and paralegals of the department/team you applied to. The questions are pre-written because they want to standardize the interview process for all applicants,", "Interview Questions": "Why NYLAG/ the specific department you applied to?"}, {"date": "23 Mar 2018", "title": "Legal Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at NYLAG (New York, NY) in Oct 2017", "Interview Descriptions": "I applied online and received an interview invitation within a week. The interview went well and it's pretty much like a conversation with the staff attorneys. They asked me questions regarding my resume and my previous working/schooling experiences.", "Interview Questions": "Walk me through your resume"}, {"date": "22 Jan 2021", "title": "Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at NYLAG (New York, NY) in Apr 2017", "Interview Descriptions": "Pretty easy and straight forward questions. Three interviewers at once. Be prepared to discuss your previous experience and how you plan to tackle the role you applied for. They're looking for someone who shares the same passion but also has experience, not looking to learn or start new.", "Interview Questions": "Why do you want to work here? "}, {"date": "6 Feb 2017", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at NYLAG (New York, NY) in Oct 2016", "Interview Descriptions": "It was really wonderful, they guided me thorough the steps and were really welcoming into the company and appreciative of my time and respectful of the fact that I was volunteering", "Interview Questions": "Why do I want to go into law?"}, {"date": "15 Jul 2016", "title": "Staff Attorney Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at NYLAG (New York, NY) in Jun 2016", "Interview Descriptions": "The process was a bit long, the interviews are not one on one so it's a  bit challenging but not a big deal. Meeting so many people is a bit hard to keep up with all the names. The organization is very big but looks as if it's organized.", "Interview Questions": "Asked about intimidating opposing counsels?"}, {"date": "11 Mar 2017", "title": "Paralegal Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at NYLAG (New York, NY) in May 2016", "Interview Descriptions": "VERY EASY. State all the duties of a paralegal and you're in. There is nothing much left to say. It is a very thorough job. As long as you have legal background and can handle clerical work, you'll get the position.", "Interview Questions": "How do you organize yourself?"}, {"date": "27 Feb 2019", "title": "Staff Attorney Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at NYLAG (New York, NY) in Jan 2016", "Interview Descriptions": "Interview was with two attorneys simultaneously, but overall seemed like a friendly, but professional interview. Standard interview questions for most part with some focus on questions related to the work as well as specific questions about experiences from my resume.", "Interview Questions": "What's your greatest strength as an attorney and greatest weakness as an attorney?"}, {"date": "27 Dec 2016", "title": "Law Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 3 weeks. I interviewed at NYLAG (New York, NY) in Dec 2015", "Interview Descriptions": "Super informal! Took forever to schedule though most likely because it was the holiday season. The upper management was nice but direct and straight to the point. She offered me the position on the spot.", "Interview Questions": "Why this field of law?"}], [{"date": "23 Sept 2015", "title": "Extern/ Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at NYLAG (Las Vegas, NV) in Dec 2014", "Interview Descriptions": "Over the phone, cursory questions with several people. Usually it would have been more formal but as I had already accepted an offer elsewhere they shoehorned it in for me on Chiristmas day morning so I conducted this sitting in a bedroom in Las Vegas. It was pretty surreal.", "Interview Questions": "What kind of skills would you bring to an agency like this?"}, {"date": "17 Aug 2016", "title": "Immigrant Protection Unit Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 months. I interviewed at NYLAG (New York, NY) in Dec 2014", "Interview Descriptions": "Phone interview, focus on foreign language proficiency and experience, as this job isn't for the monolingual. Also since this is a wide field that affected every American family at some point but by definition no American directly at the moment cross-cultural familiarity - in terms of how well you know the community, was asked about, and of course, availability - full time preferred, full time + even better. It's not exactly the most comprehensive interview but I'm guessing that's because, well, when I walked in they had my whole packet ready so they kept it to clarifications.", "Interview Questions": "Q. What would you say your language ability is like conversationally in a formal situation?"}, {"date": "23 Feb 2015", "title": "Paralegal Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at NYLAG (New York, NY) in May 2014", "Interview Descriptions": "I was contacted over the phone to schedule an in person interview with a director. I was not informed that this was going to be an interview with the director and another lawyer in the room. It would have been nice to know that so I could prepare since I was in shock. However, I managed to go through the interview. Just a tip: the second step of the interview is a group meeting with the paralegals of the particular division.", "Interview Questions": "My interest in the position, experience with clients in legal settings, working with clients who are victims of trafficking, etc."}, {"date": "8 Jul 2016", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 1+ week. I interviewed at NYLAG (New York, NY) in Aug 2013", "Interview Descriptions": "I was contacted by email by my university advisor about setting up the interview with NYLAG. I emailed the contact at NYLAG, and was responded to within a couple days and set an interview for the following week. I was interviewed by the two heads of the department and another member of the department (the person I had contacted about the interview) I was interviewing for at NYLAG. They asked questions pertaining to my previous experience and why I wanted to intern at NYLAG. I heard back from them a week later to say I was chosen as one of the interns.", "Interview Questions": "Q: What most interests you about working at this organization?\r\nQ: What would you like to takeaway from this internship?"}]]