[[{"date": "16 Feb 2023", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Virginia Mason Franciscan Health in Feb 2023", "Interview Descriptions": "Pretty easy. I Zoom interview with two directors for PACU. I applied 3 weeks prior before I got an email to schedule an interview. My interview was approx 30 minutes. I got an offer about an hour after that via email from HR asking when would be a good time to talk. I also got a text from HR.", "Interview Questions": "Typical. How do you communicate with team or with difficult situations/people. Why chose us. etc Just be honest they're not looking for the meaning of life."}, {"date": "19 Jan 2023", "title": "Patient Access Representative Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Virginia Mason Franciscan Health", "Interview Descriptions": "Good interview, timely response, generalized questions. I felt like they took the time to get to know you and took interest in what you were saying. would often ask additional questions based on your answers.", "Interview Questions": "Strengths and weaknesses, challenges with coworkers"}, {"date": "1 Mar 2023", "title": "Medical Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Virginia Mason Franciscan Health in Jan 2023", "Interview Descriptions": "I Applied online, and an interview was set up the next day. A seconded interview was given the following week. So this process roughly took one week. I Overall great experience and would highly recommend.", "Interview Questions": "What is your greatest strength."}, {"date": "11 Apr 2023", "title": "Primary Care Physician Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 6 weeks. I interviewed at Virginia Mason Franciscan Health in Jan 2023", "Interview Descriptions": "Very unorganized and unprofessional. HR randomly books you for zoom interview without letting me know. When asked for an alternative time they get mad. Very toxic process. Sounds like toxic environment.", "Interview Questions": "Tell me about an unreasonable patient request and how it was handled?"}, {"date": "19 Dec 2022", "title": "Patient Access Representative Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Virginia Mason Franciscan Health (Lakewood, WA) in Nov 2022", "Interview Descriptions": "Met with department manager via zoom, overall not super stressful. Typical interview questions. Job description left me concerned if the position was what I was looking for. Position was currently vacant, nobody else was cross trained, coverage was not available if needed", "Interview Questions": "They asked me what my biggest accomplishment to date had been"}, {"date": "8 Nov 2022", "title": "RN Residency Program Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Virginia Mason Franciscan Health (Seattle, WA) in Nov 2022", "Interview Descriptions": "Applied to the surgery unit. Hiring manager contacted me on a Tuesday, interviewed on Thursday, by Monday got an offer. Was interviewed over zoom by rn manager for the unit and another manager.", "Interview Questions": "Why this unit at Virginia mason? Which of our values do you most align with? Greatest strength?"}, {"date": "2 May 2023", "title": "Patient Access Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Virginia Mason Franciscan Health (Tacoma, WA) in Sept 2022", "Interview Descriptions": "Interview took about an hour. Lots of questions and also behavioral questions but manager make you comfortable by having small talk in between questions and tell you a bit about the job", "Interview Questions": "What are long term goals"}, {"date": "10 Oct 2022", "title": "Clinician Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Virginia Mason Franciscan Health (Tacoma, WA) in Aug 2022", "Interview Descriptions": "It was totally disorganized. For one position, I had an initial phone interview with recruiter which went very well. Then multiple virtual interviews were arranged with various leaders, clinicians, & managers. During virtual interviews it was obvious that some of the panel members were not paying attention and were engrossed in something else on their computers. Additionally, during a virtual interview, one of the managers/directors told me point blank, \"The people that work in this office are not a tight knit group. Do not expect it to feel like a family. If that is your expectation, you should seek work elsewhere.\" This was followed by an in person interview. When I arrived, there was no agenda and none of the staff involved in practice area had actually set aside time to meet with me. The primary leader of the practice failed to show up without notice to 3 interviews and never followed up. In the end, I reached out after the in person interview but was ghosted. Retrospectively, it was an environment with way too much disorganization and I wouldn't have been happy to work there anyway.", "Interview Questions": "Tell us about your relevant experience."}, {"date": "3 Jun 2022", "title": "Registered Nurse Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Virginia Mason Franciscan Health", "Interview Descriptions": "Spoke with recruiter first and had a informal phone interview. She set up another phone interview with hiring manager which was nice. It was laid back and overall a easy interview. I didn’t feel intimidated at all.", "Interview Questions": "What would your precepting nurses during school have to say about you? "}, {"date": "2 Nov 2022", "title": "Physician Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Virginia Mason Franciscan Health (Renton, WA) in May 2022", "Interview Descriptions": "The screening interview was very intense. I was asked \" tell me a time your belief system was changed\". \" do you want to have kids\". Did not appreciate these questions.", "Interview Questions": "N/A"}], [{"date": "17 Mar 2022", "title": "Agile Coach Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Virginia Mason Franciscan Health", "Interview Descriptions": "Long - it can take up to a month - Panel interview is preferred - they have managers from ndifferent departments join in - If you applied for a certain positions and manager does not think you are a good fit - other managers can pitch and work with you to see if you are interested - That is if you are a good fit for the department", "Interview Questions": "Why do you think Virginia mason is a great fit for you?"}, {"date": "7 Mar 2022", "title": "Program Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Virginia Mason Franciscan Health", "Interview Descriptions": "I interviewed for position that was given to an internal candidate. Wished my time could have been saved by being up front about the process. The interview  process was quick.", "Interview Questions": "What is your Management style?"}, {"date": "17 Mar 2022", "title": "Administration Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Virginia Mason Franciscan Health in Feb 2022", "Interview Descriptions": "Standard phone interview process. Follow ups were timely, and requested information and details were within reason. I was offered the job and accepted, but it didn't end up working out. Would have been a nice place to work!", "Interview Questions": "They do like to ask you to elaborate on one of their missions statement attributes, for example I chose integrity."}, {"date": "15 Nov 2022", "title": "Nurse Practitioner Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Virginia Mason Franciscan Health (Seattle, WA) in Jan 2022", "Interview Descriptions": "Multiple rounds, starting with a phone interview with recruiter then met team on another day. Met with physicians and nurse practitioners, as well as admin. Lunch provided. Length was approximately 6 hours. Very casual atmosphere.", "Interview Questions": "What are the types of patients you are use to seeing?"}, {"date": "21 Nov 2021", "title": "Physician Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Virginia Mason Franciscan Health", "Interview Descriptions": "Phone screen with a recruiter. I then had a zoom interview with the supervising physician and one other hiring member. They were all very kind people, but I did not receive an offer and have not received any feedback. It seems like a good organization, but unfortunately I will not get the chance to experience it.", "Interview Questions": "What are you most afraid of for this position?"}, {"date": "3 Dec 2021", "title": "Certified Nursing Assistant CNA Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Virginia Mason Franciscan Health in Nov 2021", "Interview Descriptions": "Phone interview. I was asked informational questions in the beginning such as shift preferences and how I found out about the position, three behavioral questions, and if I had any questions for them.", "Interview Questions": "Tell me about a time you made a mistake and how you fixed it."}, {"date": "5 Oct 2021", "title": "Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Virginia Mason Franciscan Health", "Interview Descriptions": "Very professional through the whole process.\r\nRecruiter was a former nurse, and was very tactful in their approach to gauging my experience. \r\nthe process seemed to be as one of an organized business.", "Interview Questions": "N/A"}, {"date": "22 Sept 2021", "title": "Resident Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Virginia Mason Franciscan Health (Seattle, WA) in Sept 2021", "Interview Descriptions": "First they do a phone interview that took around 30-40 minutes and then was a group interview over Skype. They want to hear honest answers and life experiences to back up your answers.", "Interview Questions": "Lots of scenarios questions, and what would you do."}, {"date": "6 Jul 2021", "title": "Certified Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Virginia Mason Franciscan Health", "Interview Descriptions": "It was great. Have questions prepared and your greatest strength and weakness. Also, make sure to have examples of your patient experience and make sure you have done your research about the organization and are knowledgeable about the company .", "Interview Questions": "When was a time you had to deal with an angry patient? "}], [{"date": "1 Jul 2021", "title": "Imaging Technician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Virginia Mason Franciscan Health", "Interview Descriptions": "The whole interview process went smoothly with slight pressure. Two interviewers were nice and friendly. The questions were not too sharp, including general questions and some professional questions. Review your textbook before the interview.", "Interview Questions": "Why you choose this career?"}, {"date": "3 May 2021", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Virginia Mason Franciscan Health (State College, PA)", "Interview Descriptions": "It was over zoom with the nurse recruiter, we went back and forth over email to establish a time that worked for both of us. Convenient as I am not on the west coast. Nurse recruiter was very nice, asked me questions I anticipated answering.", "Interview Questions": "Why Virginia Mason? \nWhat was one of your most rewarding patient experience? \nWhat was your most difficult patient experience?"}, {"date": "10 May 2021", "title": "RN Resident Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at Virginia Mason Franciscan Health in May 2021", "Interview Descriptions": "The recruiter started by asking screening questions about working at Virginia Mason and then asked behavioral questions such as the \"tell me about a time when...\" style questions. The interview took about 20 minutes and was conducted on Brazen.", "Interview Questions": "Tell me about a time when you went above and beyond for a patient"}, {"date": "15 Mar 2021", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Virginia Mason Franciscan Health", "Interview Descriptions": "Amazing interview! Felt extremely comfortable and enjoyed discussing the position/company. Great questions and the recorded part of the interview will be sent to other hiring managers for the next steps.", "Interview Questions": "Customer service experience/general behavioral questions. "}, {"date": "29 Jan 2021", "title": "PCT/CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Virginia Mason Franciscan Health", "Interview Descriptions": "First interview is more like a pre-screen. The recruiter will ask some general questions about your background and availability. The second interview is more in-depth and, if virtual, is recorded so the department manager can watch it. Second interview is all behavioral questions.", "Interview Questions": "What do you know about Virginia Mason?\nWhy did you leave your last position?\nWhat did you enjoy about your last position?\nWhat are your salary expectations?\nWhat are your long-term career goals?\nCan you talk about an ethical dilemma you faced and how did you resolve it?\nWhen was the last time you struggled with time management and how did you address this?\nTalk about a time when you had to deal with a difficult client or coworker.\nGive an example of a time when you had to solve a problem.\nTalk about a time when you had a language barrier with a patient/client – how did you overcome this?\nWhat is the most surprising piece of professional feedback you’ve ever received?"}, {"date": "30 Jan 2021", "title": "Data Processing Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Virginia Mason Franciscan Health (Charlotte, NC) in Jan 2021", "Interview Descriptions": "The interview process was simple and pretty typical . I have been offered an opportunity completely electronically . This is definitely a first for me. It was easier than a face to face. Which made it that much more skeptical.", "Interview Questions": "All questions were Typical questions! I’m sure has heard them before. "}, {"date": "28 Jan 2021", "title": "Patient Access Specialist - Temporary Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Virginia Mason Franciscan Health in Jan 2021", "Interview Descriptions": "I received a follow-up email the day after applying from an employee supporting the hiring manager/ team. VM has streamlined their process due to the high demand for call center support. The interviewer was thoughtful and focused throughout the interview. Unfortunately, because the interviewer was removed from the hiring team, I wasn't able to have all of my questions answered thoroughly.", "Interview Questions": "Tell me about a time where a customer or patient had an unreasonable request. How did you handle that?"}, {"date": "9 Dec 2020", "title": "Nurse Residency Program Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Virginia Mason Franciscan Health", "Interview Descriptions": "It was with 2 nurse managers. They were both super nice. They asked me mostly behavioral questions. I used a lot of clinical and work circumstances to answer these questions. They were very honest about the process.", "Interview Questions": "Why do you want to work at Virginia Mason? "}, {"date": "4 Dec 2020", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Virginia Mason Franciscan Health", "Interview Descriptions": "Normal interview questions, no tricky questions, questions about your past nursing experience, nothing too difficult, plan to be true and honest, be yourself. DO not try to impress. I really don't know what else to say.", "Interview Questions": "Where do you see yourself in 5 years from now"}], [{"date": "2 Nov 2020", "title": "Patient Care Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Virginia Mason Franciscan Health (Seattle, WA) in Oct 2020", "Interview Descriptions": "First interview was asking administrative questions and going over resume. Second interview was asking behavioral questions. There was a lot of questions and they wanted patient care examples for each. This interview was with direct supervisor and they asked a few more questions and I was able to ask more job-specific questions.", "Interview Questions": "Specific examples of how I used time management, overcame language barriers, worked with patients with different cultural beliefs, organization, and asking personal strengths and weaknesses."}, {"date": "23 Feb 2022", "title": "Data Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Virginia Mason Franciscan Health (Seattle, WA) in Aug 2020", "Interview Descriptions": "Used star method and met with team. It went fine. Pretty standard. Word limit is a tad high so I’m going to fill the space with this sentence. It would be helpful if Glassdoor provided a word counter.", "Interview Questions": "They used the star method"}, {"date": "19 Feb 2022", "title": "Certified Surgical Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Virginia Mason Franciscan Health (Seattle, WA) in Aug 2020", "Interview Descriptions": "Simple, applied after receiving job opening information from a 3rd party, then received a call from a recruiter the next business day, negotiated pay, was hired. In a matter of days. The process after application was a recorded zoom interview with the recruiter/HR, then a phone interview with the manager.", "Interview Questions": "Describe a conflict in detail and the resolution."}, {"date": "30 Jul 2020", "title": "Registered Nurse Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Virginia Mason Franciscan Health", "Interview Descriptions": "Zoom interview and phone interview. Basic questions about experience and background info as well as decision making. Overall straight forward and direct not much a nurse can complain about. Nurse recruiter is very nice, kind and open. They did not discuss benefits thoroughly at time of interview", "Interview Questions": "What is one time a patient had an unreasonable request?"}, {"date": "14 Jun 2022", "title": "Pharmacy Intern Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Virginia Mason Franciscan Health (Seattle, WA) in Jun 2020", "Interview Descriptions": "Be ready to answer basic interview questions that would be specific to interviewer. VM process focuses on learning more about you and your experiences related not only to health care field but also any job that you were able to learn skills.", "Interview Questions": "How would you adjust to a new team?"}, {"date": "11 Jul 2021", "title": "Certified Medical Assistant (CMA) Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Virginia Mason Franciscan Health (Seattle, WA) in Jun 2020", "Interview Descriptions": "It was virtual (over the phone) due to the pandemic. The person over the phone interviewing me was welcoming and nice, but they are looking for very specific people. I told them about my short term stay in the area (less than a year) and that was the end of the interview. I was a student at the time, so she told my teacher and she did not even tell me through the phone. Overall, great company to start working for based off of my friends so it is worth going through the interview process.", "Interview Questions": "What are your plans for the next couple years?"}, {"date": "12 Aug 2020", "title": "Certified Ophthalmic Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Virginia Mason Franciscan Health (Seattle, WA) in May 2020", "Interview Descriptions": "one phone interview with the HR followed by one on one interview with the manager, it was a pretty smooth process. great people to work with. excellent staff and working environment", "Interview Questions": "what are you looking in this job?"}, {"date": "28 Apr 2020", "title": "New Grad RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 8 weeks. I interviewed at Virginia Mason Franciscan Health in Mar 2020", "Interview Descriptions": "Fairly easy process, took a couple weeks from applying online to doing a phone interview with the nurse recruiter, then next a video review with the hiring unit managers. From there I waited about two weeks until I received an offer for a position that begins in late summer. Overall it was an fairly painless process and my recruiter, Jill, was amazing. She was so kind and answered all of my questions and is part of the reason I took the job. If the other staff are half as nice and guiding to new grads I'm sure I'll love this hospital!", "Interview Questions": "Where do you see yourself in five years?"}, {"date": "31 Jan 2020", "title": "Gift Processing Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Virginia Mason Franciscan Health (Seattle, WA) in Jan 2020", "Interview Descriptions": "Applied online via their website. Had a phone interview with a recruiter. Then had a face to face interview with a manager.  He was very pleasant and knowledge about the organization.", "Interview Questions": "What databases do you know?"}, {"date": "8 Aug 2020", "title": "Patient Service Representative Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Virginia Mason Franciscan Health (Seattle, WA) in Dec 2019", "Interview Descriptions": "For the interview Process, I went in and interviewed with three people. They ask about your life, goals, and job experience. They then ask your typical interview questions. AT the end they test your ability to take down a voice message as a handwritten note for medical staff.", "Interview Questions": "What was a situation in which you were faced with an upset patient, and how did you resolve that situation?"}], [{"date": "9 Dec 2019", "title": "Microbiology Support Technician Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Virginia Mason Franciscan Health in Nov 2019", "Interview Descriptions": "After applying online I received an email to schedule a phone interview, which went on for about 30 minutes. It was definitely one of the more thorough phone interviews I've had. Afterwards I was told that they would get back to me within 3 business days, but received no reply past that. I later emailed for a follow up, but had no response.", "Interview Questions": "What is a conflict you've had with a coworker, and how was it resolved?"}, {"date": "6 Sept 2019", "title": "Management Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at Virginia Mason Franciscan Health", "Interview Descriptions": "Applied online with a resume and letter. \r\nUnable to speak to anyone about process.\r\nWas never even contacted although I had worked there previously for several years.\r\nFor a health care organization, they sure don't seem to care. I wonder what Dr. Kaplan would think about this.", "Interview Questions": "N/A"}, {"date": "26 Jun 2022", "title": "Patient Care Technician Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Virginia Mason Franciscan Health in Feb 2019", "Interview Descriptions": "Interview process was not bad at all. Obviously just prepare and you’ll do fine. I didn’t think the questions were difficult at all, and if you have good experiences to share to explain yourself then it’s better", "Interview Questions": "Why do you want to work here "}, {"date": "9 Jan 2020", "title": "Pct Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Virginia Mason Franciscan Health (Seattle, WA) in Dec 2018", "Interview Descriptions": "Phone interview, then an in person interview shortly after. They ask about your experience before this and why you think you'd be a good fit. They have you come in for a meeting at the corporate office building, get your badge, and they send you to employee health to get your vaccinations verified. Then you can start to work!", "Interview Questions": "Describe a challenging situation and how you handled it."}, {"date": "17 Aug 2018", "title": "Nurse Technician Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Virginia Mason Franciscan Health", "Interview Descriptions": "Submitted a resume and cover letter online and received an email from HR requesting to do a phone interview the next day. They asked a couple basic behavioral questions. After the interview I was told by the HR person that were going pass my resume on to the hiring manager who would make the decision about which candidates would get an in person interview. I received an email 3-4 days later that they were going to consider other candidates with more experience.", "Interview Questions": "Describe a time you went above and beyond for a patient?"}], [{"date": "21 May 2018", "title": "Anonymous Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Virginia Mason Franciscan Health", "Interview Descriptions": "Submitted an application and promptly forgot about it. Around 3 weeks later,  I was contacted by HR to set up a phone screening, then received a call a couple of hours later from the hiring manager to come in for an interview two days later. Met with the manager. The manager rambled on and on about herself for close to 90 minutes. I was asked maybe one or two questions. It was the most bizarre experience. Came away not even entirely sure what the role entailed. I was told that I'd be asked to come in again to meet with the team I'd be working with. Then heard nothing for almost 3 weeks. Finally went in, was rushed through, barely got to ask any questions, and then another month of waiting. I had to ask HR what was up, since I had other job offers on the table. They finally got back to me with an offer.  All told it was about 3 months, app to offer.", "Interview Questions": "N/A"}, {"date": "7 Jul 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Virginia Mason Franciscan Health (Seattle, WA) in May 2018", "Interview Descriptions": "Interview was simple and to the point. No tricky questions, just the usual psychological questions: why you chose VM, describe how you managed a tricky situation at works, etc. Not any different than other interviews.", "Interview Questions": "Why you chose Virginia Mason Franciscan Health "}, {"date": "23 Apr 2018", "title": "Patient Account Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 1 week. I interviewed at Virginia Mason Franciscan Health in Apr 2018", "Interview Descriptions": "The interviewer called me almost 10 minutes later than our appointment.   What followed was a 45 minute interview of mostly standard questions, many behavioral, about what I would do in typical customer service situations.  \r\n\r\nAfter 45 minutes, the interviewer said that due to my resume, I wasn't a candidate that would be considered.  She said this in a very abrupt, blunt, and disrespectful manner.  (This is after she had my resume for review and consideration - prior to the interview - and chose to schedule me for a phone screen).  \r\n\r\n I don't know why she chose to phone screen me, but it was a waste of our time.  Even more confusing, after telling me I wouldn't be considered, she then went over the next steps in the interview process if I was to move forward - a background check and panel interview.\r\n\r\nI had the impression she had not reviewed or even read my resume prior to my interview.   She was unprepared as well as very impolite, and insulting towards me as an interview candidate. \r\n\r\nI asked her multiple questions about typical call volume and the call center culture, as well as average tenure and turn over,  and she told me she could not answer those questions.", "Interview Questions": "What did you do in a past position when you made a mistake?  What did you do to fix it?"}, {"date": "9 Mar 2018", "title": "Diagnostic Medical Sonographer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Virginia Mason Franciscan Health (Seattle, WA)", "Interview Descriptions": "After submitting application, first meet with HR then the ultrasound manager. I was asked to scan a patient (I was already familiar w/ the ultrasound system) and the radiologist who was the head of ultrasound reviewed my images.", "Interview Questions": "What challenges I have faced in the course of this profession. "}, {"date": "8 Mar 2018", "title": "Systems Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Virginia Mason Franciscan Health (Seattle, WA)", "Interview Descriptions": "I was interviewed by the head of Systems Development and Support and a key employee on the team. This was 20 years ago. They were both cordial and focused on my computing experience.", "Interview Questions": "They asked how I had gained my experience with computers."}, {"date": "8 Feb 2018", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Virginia Mason Franciscan Health (Seattle, WA) in Jan 2018", "Interview Descriptions": "Painfully slow! Expect process to at least take a month. Had a phone screening call prior to in person interview. Mostly went over qualifications and job description with a few situational questions. Hiring manager led me on for a second interview then got note from HR with rejection. Not cool.", "Interview Questions": "what would your co workers say about you. "}, {"date": "7 Nov 2017", "title": "Social Worker Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Virginia Mason Franciscan Health", "Interview Descriptions": "I had one phone interview with a recruiter (I live out of state).  Pretty standard interview, like 3 behavioral based questions.  I did not get an offer, but they did a good job of keeping me up to date in the process.", "Interview Questions": "Tell me about a time you made a mistake"}, {"date": "26 Oct 2017", "title": "Medical Receptionist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Virginia Mason Franciscan Health (Bellevue, WA)", "Interview Descriptions": "Quick and Painless, I applied online at the companies website, shortly after I was contacted by the companies HR department where I was then scheduled for an interview. I met with one of the hiring managers. They asked very standard interview questions, after which it was only about a week if that when I received an offer for employment.", "Interview Questions": "For me the most difficult question is \"Where do you see yourself in \"X \" amount of years?\""}], [{"date": "12 Oct 2017", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Virginia Mason Franciscan Health (Seattle, WA)", "Interview Descriptions": "Very informal, interviewed with nurse manager and nurse educator.  It was a very relaxed atmosphere and there weren't too many hypothetical questions.  I can't speak to all departments being like this, but it was what I experienced in the 2 different departments I've worked as an RN with VM.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "7 Jan 2018", "title": "Patient Service Representative Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Virginia Mason Franciscan Health (Seattle, WA) in Oct 2017", "Interview Descriptions": "Brief phone interview.   I was told I would be contacted by HR to proceed, and it took over two weeks.  I called to check in and was told supervisor was not available to interview due to a sudden leave.", "Interview Questions": "How do you like working with diverse population?"}, {"date": "3 Apr 2020", "title": "Certified Ophthalmic Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Virginia Mason Franciscan Health (Seattle, WA) in Sept 2017", "Interview Descriptions": "Set up a meeting to be called by the HR recruiter. Then when I spoke with the HR recruiter on the phone, all she did was set up a different time with me to actually do the screening questions. So talked with the recruiter again on that day. Then when into the clinic and answered interview questions with the manager and had to demonstrate certain skills on one of the other COAs.", "Interview Questions": "Explain a time you had a difficult patient and how did you handle it?"}, {"date": "19 Jul 2017", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Virginia Mason Franciscan Health (Seattle, WA) in Jun 2017", "Interview Descriptions": "Submitted online application on June 6th for RN residency. Received an email to set up a phone interview the next day. Phone interview on the 14th. Panel interview on July 6th. Offered position on July 18th after following up with them on the 17th via phone call. \r\nThe HR phone interviewer was really nice and asked only a couple behavioral questions. The panel interview was done over Skype since I live in Hawaii. That one was a little nerve wrecking since there was 6 people interviewing me. They asked the basic behavioral questions such as 'tell me a time when you had a difficult patient/conflict with your fellow employees' and where do you see yourself in 5 years. Make sure to ask some really good questions at the end when they give you a chance to ask them questions. Be enthusiastic about their hospital and smile into the webcam!", "Interview Questions": "Tell me a time you felt disappointed with your care"}, {"date": "31 May 2017", "title": "Regulatory Program Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Virginia Mason Franciscan Health (Seattle, WA) in May 2017", "Interview Descriptions": "All day interview process broken up into 30 minute to 1 hour segments with different departments. Interviews were held with the different departments that would be interacting with this position on a continual basis. It provided a great prospective on how the team works together and interacts with one another.", "Interview Questions": "Why Virginia Mason?"}, {"date": "12 Apr 2017", "title": "Patient Access Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 3 weeks. I interviewed at Virginia Mason Franciscan Health", "Interview Descriptions": "Initial phone interview, in-person interview with supervisor and manager, authorize background check (they check former employers and actually check the three references you use), call from recruiting to extend offer of employment.", "Interview Questions": "What is your biggest accomplishment to date? \n\nWhat is something a person you worked with was better at than you? \n\nHow did you go above and beyond a customer's expectations?"}, {"date": "25 Apr 2017", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Virginia Mason Franciscan Health (Seattle, WA) in Apr 2017", "Interview Descriptions": "Submitted an application online. Received an email from a recruiter to schedule a screening phone interview. After the interview, I was scheduled for a panel interview via Skype since I was out of town. After the panel interview, I heard back from the recruiter that they decided to extend the offer for the RN Residency position.", "Interview Questions": "Prepare to answer most of the generic nursing interview questions that you can find online. For example, \"What made you want to become a nurse?\", \"Why do you want to work for Virginia Mason?\", etc. Make sure you prepare your answers with your own experience and something that's coming out of your heart. :) "}, {"date": "28 Feb 2018", "title": "Imaging Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Virginia Mason Franciscan Health (Seattle, WA) in Apr 2017", "Interview Descriptions": "Came in, met with the manager and then took a tour of the hospital.  Then met with other staff members.  Then demonstrated my imaging skills.  Then re-met with the manager.", "Interview Questions": "Tell us about a time when you had a difficult co-worker."}, {"date": "28 Apr 2017", "title": "Patient Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Virginia Mason Franciscan Health (Seattle, WA) in Nov 2016", "Interview Descriptions": "It only took a 30 min phone call from Human Resource about basic behavioral questions, and if interview goes well a second in person interview with the department supervisor is scheduled. Takes about 20-30 min, just research Virginia Mason interview questions and those were the questions I was exactly asked.", "Interview Questions": "Tell me about yourself"}, {"date": "19 Sept 2017", "title": "Director Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. I interviewed at Virginia Mason Franciscan Health (Seattle, WA) in Nov 2016", "Interview Descriptions": "The interview process was intense and long, 9 interviews total and to my understanding is there would have been one or two more before the offer. I was a finalist, but no offer.  The interview process was  very professional, the interviewers were well prepared. It was a very pleasant experience.", "Interview Questions": "The questions were all fair and well thought out. I interviewed with several team members and they had all prepared together. So each covered specific topics and areas and each had everything written out so both candidates received similar questions."}], [{"date": "31 May 2018", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Virginia Mason Franciscan Health in Oct 2016", "Interview Descriptions": "I applied online. I first had a phone interview with the talent acquisition rep, and then a panel interview with different nurse managers. The process was a great experience.", "Interview Questions": "describe a difficult patient situation and how you handled it? "}, {"date": "11 Sept 2016", "title": "Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Virginia Mason Franciscan Health (Seattle, WA)", "Interview Descriptions": "The interview was pretty typical, and was more conversational than usual.  Questions were like, why are you interested in VM, what methods have you used to do your job, etc.", "Interview Questions": "The questions were the usual interview questions.  There was nothing unique or creative."}, {"date": "27 Feb 2017", "title": "Patient Access Representative I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Virginia Mason Franciscan Health in Aug 2016", "Interview Descriptions": "Call from recruiter  (phone interview), if you get past them then an interview with your potential supervisors  (I had 3 interviewing me).  Then if you get hired they send you an email for the next steps.", "Interview Questions": "Why do you want to work here?"}, {"date": "5 Sept 2016", "title": "Physician Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Virginia Mason Franciscan Health (Seattle, WA) in Mar 2016", "Interview Descriptions": "All communication and scheduling done through HR. They chose interview date based on several options I gave them.  Traveled from out of town to interview.  The day before I was told by HR that key people I was to meet with were not available and could I stay the weekend and meet with them on Monday.  I received a negative reaction when I told them I could not because it would entail canceling patient appointments on short notice. Eventually had phone interview with head of Medicine. \r\nHR interactions could have been much better organized with regards to interview scheduling to avoid having disadvantage of not having opportunity to meet with key administration personnel in person.\r\nNotification of ultimately not being offered the job was very disorganized. The day after I received email of not being offered the job, I received another email from HR informing me the position was still open and am I still interested in the position (whoops!).  Also cc'd on emails involving personal communication to administration during the process from other employees who were cc'd by mistake.\r\nOverall, as a mid-career physician highly experienced in the field of medicine for which VM was hiring, the process of interviewing for this position was a negative experience compared to other job search experiences I have had in terms of overall level of professionalism in communication.", "Interview Questions": "They ask the usual things such as why VM, why Seattle, your strengths etc.  They use Toyota management system which is discussed;  I was familiar with concept having experience in Sigma 6 process improvement at another large hospital system."}, {"date": "7 Jan 2016", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Virginia Mason Franciscan Health", "Interview Descriptions": "I submitted an application after attending a job fair at VM. Quickly got a phone call requesting an interview from an HR rep. I was out of state, at the time, and had set up a phone interview with the director of the unit, that I have now been working on for years.", "Interview Questions": "Why do you want to work at Virginia Mason?"}, {"date": "5 Jun 2015", "title": "Patient Care Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Virginia Mason Franciscan Health (Seattle, WA) in May 2015", "Interview Descriptions": "Fairly straightforward interview process. 1 phone interview then an in person one the following week. On the phone, I was asked simple background info of how I qualify for the position. We then moved onto a competency test on the phone just to see how will I could understand and follow directions. Pretty simple, but could definitely stump you if you are not a native English speaker. I advise you get out a laptop and take notes from the 5 sentences she will ask--then have her read one more time because she will ask specifics like \"what gender is the patient I was talking about?\" or \"what kind of lab did I ask you to order?\"", "Interview Questions": "Why did you choose Virginia Mason"}, {"date": "9 Apr 2015", "title": "Clinic Service Representative Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Virginia Mason Franciscan Health", "Interview Descriptions": "Phone interview followed by on site interview one week later.  Relatively easy and low pressure.  They actually spend more time telling me about the organization than asking me about myself.", "Interview Questions": "N/A"}, {"date": "23 Apr 2015", "title": "Cerner Systems Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 4 weeks. I interviewed at Virginia Mason Franciscan Health (Seattle, WA) in Apr 2015", "Interview Descriptions": "Was contacted by recruiter through linkedin. I was intrigued and liked what I researched about the organization. \nA week later was scheduled for Phone interview. I was rather disappointed with the questioning and you can pretty much pick up that they had someone else in mind.", "Interview Questions": "they will go over your resume"}, {"date": "15 Apr 2015", "title": "Medical Assistant- Lab Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Virginia Mason Franciscan Health (Lynnwood, WA) in Mar 2015", "Interview Descriptions": "The first interview is a phone interview. The lady was nice and just asked relatively simple questions at first about skill level, experience, etc. However, I would suggest thinking about your last or current jobs. Recall situations where you were in a confrontation of sorts and how you handled it or had to use your communication skills, etc. Knowing how to explain ways in which you handle stressful situations is good too!  Also, I had to give examples of times I went above and beyond at work. They are hard questions if your a modest person. I didn't get the job because a few of these questions caught me off-guard but I do feel better prepared for next time!", "Interview Questions": "Give examples of times I went above and beyond at work..."}], [{"date": "10 Jan 2015", "title": "Pct Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Virginia Mason Franciscan Health", "Interview Descriptions": "Initial interview by phone, in person interview sat up that day for four days later. Heard back about decision to move forward with background/reference checks two days after the in person interview. Background completed within a week with lots of communication from recruiters about the status of the checks. Job offered by phone and offer letters sent out. Best part of the process was the speediness and the communication from recruiters. Entire process from application to start day was about a month. Fastest process I've ever experienced for a patient care position.", "Interview Questions": "Basic interview questions"}, {"date": "8 Aug 2014", "title": "Medical Transcriptionist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 1 day. I interviewed at Virginia Mason Franciscan Health (Seattle, WA)", "Interview Descriptions": "Casual and nonthreatening, very low-key.  I was interviewed by my immediate supervisor onlyi.  She was a marvelous person, had wonderful appreciation for our profession and treated me with respect.  We talked about many aspects of our chosen career pathway.", "Interview Questions": "None--my superior went to great lengths to make me feel comfortable and treated me with great respect and appreciation for my skills."}, {"date": "29 Jul 2014", "title": "Anonymous Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 5 weeks. I interviewed at Virginia Mason Franciscan Health", "Interview Descriptions": "The interview process was very thorough. They conducted an initial phone interview, followed by a one on one interview, then a panel interview. The most challenging part of the process was the panel interview, in which they asked a variety of questions, related more specially to the job itself", "Interview Questions": "The most difficult question was what are your weaknesses. "}, {"date": "8 Jun 2014", "title": "Dietitian Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I applied online. The process took 5 months. I interviewed at Virginia Mason Franciscan Health", "Interview Descriptions": "Was called once by HR and told I would make $23/hr so I said no thanks. Then got called a couple months later asking again if I wanted to interview. I did, and they then offered me $26.70/hr (don't think they knew they had previously called). Got hired, then it took another 6 weeks or so until I could actually start.", "Interview Questions": "typical dietitian interview questions -- \"tell me about a time when such-and-such happened and describe your response.\""}, {"date": "7 Jun 2014", "title": "Health Information Representative Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Virginia Mason Franciscan Health (Seattle, WA) in May 2014", "Interview Descriptions": "Applied online, email communications followed, and then telephone interview three weeks after applying. The telephone interviewer's first question was about salary. Other questions were standard for an interview. I was told I was being recommended to the managers and they would contact me within one week to set up a second in-person interview. I was never contacted regarding a second interview. Three weeks later I was notified by email that I was not selected.", "Interview Questions": "Describe a situation in which your coworkers acted unethically and how you handled that situation."}, {"date": "12 Mar 2014", "title": "Cerner MPage Software Engineer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took a year or more. I interviewed at Virginia Mason Franciscan Health in Mar 2014", "Interview Descriptions": "Recruiter called me based on my experience at lunch.  When I had another lunch to spare I talked to the hiring manager and he described a workplace environment that was part documenting the current software and part new development.  All emails ceased after this initial discussion, and the hiring manager contacted me to let me know there was beuracratic overhead to opening the position and encouraged me again once the new requisition was out there.", "Interview Questions": "Describe your experiences writing CCL and MPages."}, {"date": "30 Apr 2017", "title": "Patient Transporter Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Virginia Mason Franciscan Health (Seattle, WA) in Jan 2014", "Interview Descriptions": "Was referred by an employee. Took awhile to receive notification of hire. The hiring process was easy and straight forward. Interview questions were mostly behavioral. Took a behavioral assessment then had the interview.", "Interview Questions": "What are your future goals."}, {"date": "31 Jul 2013", "title": "Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Virginia Mason Franciscan Health (Seattle, WA)", "Interview Descriptions": "I was contacted via email based on a job I applied for on-line. The interview process was fairly easy in that I quickly progressed from an initial interview to a panel interview and a decision was made shortly afterwards.  The length of time came when it went to HR, and that took another six weeks to get everything squared away before I could begin work.  Too long.", "Interview Questions": "The questions were largely behavioral and scenario based.  Nothing really difficult or tricky, a straight forward group of people."}, {"date": "23 Jun 2013", "title": "Clinical Decision Support Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. The process took 1 week. I interviewed at Virginia Mason Franciscan Health (Seattle, WA)", "Interview Descriptions": "I was first approached by an HR person, as it usually happens. She scheduled and interview for a few days later to \"go over my resume\". 5 minutes into the interview she asked me what my desired salary was. I answer this type of questions with something along the lines of \"at this stage of the process I want to make sure I'm a great fit for the job bla bla bla\". She insisted that there was no point in continuing the interview process if my ask was way out of range. I got a clear feeling that this wasn't going anywhere so I told her my ask. To which she answered \"oh, that is way too much.\". And that was the end of the interview. Not a single question about my resume.", "Interview Questions": "How much are you expecting to make?"}, {"date": "2 May 2013", "title": "Foundation Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Virginia Mason Franciscan Health (Seattle, WA) in Apr 2013", "Interview Descriptions": "The first interview was a phone interview. . I made it to the second round of interviews. It was a panel with 5 people. I do believe that the panels were too long for this type of position.", "Interview Questions": "What makes me a great manager??"}], [{"date": "29 Sept 2012", "title": "Implementation Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 4 weeks. I interviewed at Virginia Mason Franciscan Health (Seattle, WA) in May 2012", "Interview Descriptions": "- Contacted by recruiter about the opportunity\r\n- Initial conversation with recruiter about HR related questions\r\n- Group phone interview with Manager & Business Analyst\r\n- Never heard back", "Interview Questions": "Oracle related questions"}, {"date": "12 Jun 2012", "title": "Human Resources Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Virginia Mason Franciscan Health (Seattle, WA) in Apr 2012", "Interview Descriptions": "The interview consisted of standard questions. No personality from the recruiter and the phone interview was quite awkward.", "Interview Questions": "So you don't have a degree?"}, {"date": "17 Nov 2011", "title": "Clinic Services Representative Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 1+ week. I interviewed at Virginia Mason Franciscan Health (Seattle, WA) in Oct 2011", "Interview Descriptions": "Interview was great, received offer via email (which seemed odd) that was contingent upon background check. Filled out the paper work, and faxed back Friday.I recieved a call from a third party company doing the background check, regarding a phone number that was wrong (it actually wasn't wrong they were looking at the wrong line on the form). Later that day received a call from HR asking if I was still interested because they had not recvd my packet back, after telling her about the other call she said she would look for it some more. Two days later recvd another email saying they went with another canidate. I emailed back to ask if it was something in my background, and she said no the manager just decided to go with someone else. Very frustrating in the end, and a very impersonal process with all the emails.", "Interview Questions": "What is my 5 yr plan?"}, {"date": "11 Oct 2014", "title": "Office Support Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Virginia Mason Franciscan Health in Jan 2011", "Interview Descriptions": "1 Hour 1:1 with HR for a Phone interview was the first step.  After this interview I contacted HR every three days to follow up.  I was contacted about 2 weeks later for a 1:1 with hiring manager.  That interview was very positive.  HM was friendly and open to hear my opinions about the job role.", "Interview Questions": "N/A"}, {"date": "28 Jan 2014", "title": "Physician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied through an employee referral. The process took 3 months. I interviewed at Virginia Mason Franciscan Health (Seattle, WA) in Apr 2010", "Interview Descriptions": "Met with Department Team(physicians and office manager), CEO was busy that day(really?)", "Interview Questions": "Most were straight forward. Nothing out of the norm. Why Seattle? Are you a team player? etc..."}, {"date": "7 Feb 2011", "title": "Social Work Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 1 day. I interviewed at Virginia Mason Franciscan Health (Seattle, WA) in Dec 2009", "Interview Descriptions": "I already worked there and I interveiwed with the head of the department.I was on an RPIW that created this\r\njob. I like the sound of  it.", "Interview Questions": "Do you have an idea what this job will intail."}]]