[[{"date": "14 Dec 2022", "title": "Senior Data Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Greenpeace (London, England) in Oct 2022", "Interview Descriptions": "Comprised of two interviews. 1. Easy Technical exercise. General interview with tech team. 2. Interview with stakeholders/manager. Relatively easy. A few vague questions, which might allow someone less good technically to get the job merely because of how well they can talk.", "Interview Questions": "SQL and google sheet exercises. Tell me about a time when... What is your understanding of this role?"}, {"date": "5 Jul 2022", "title": "Investigator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Greenpeace", "Interview Descriptions": "The interviewers had thoughtful questions and good insights in response to my questions. They provided an interview guide before hand which I thought was very inclusive and made the process more accessible for non-traditional applicants.", "Interview Questions": "What’s your story, how have you got here and what do you do on the weekend?"}, {"date": "1 Jul 2022", "title": "Digital Campaigner Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Greenpeace", "Interview Descriptions": "A written application followed by a one hour interview in the office and 2 hour test. The interview took place in a yurt in their garden in Islington, London. Loved it.", "Interview Questions": "What campaigns have you seen recently that you were impressed by?"}, {"date": "17 May 2022", "title": "Customer Service Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Greenpeace", "Interview Descriptions": "Fair process, they took into account my ideas and view, mainly competancy based yquestions such as what motivates you, what appealed to you about this companty ect. also included a basic role play excercoise", "Interview Questions": "what motivates you in the workplace"}, {"date": "18 Oct 2022", "title": "Fundraiser Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 3 days. I interviewed at Greenpeace (Brighton, England) in Jan 2022", "Interview Descriptions": "I contacted Greenpeace via phone and asked about current vacancies in Brighton. I was told about the fundraiser position - they were very accommodating and said this was possible to do alongside University. I passed the first stage on the phone and was offered an interview the next day.", "Interview Questions": "Questions related to Greenpeace projects and impacts of climate change - e.g. whether this affected everyone equally."}, {"date": "6 Dec 2021", "title": "Communications Director Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Greenpeace", "Interview Descriptions": "Great process from start to finish with clearly communicated timetable, clear objectives and a very human and friendly approach to the interview itself. No issues at all and even though I didn't get the job, I was impressed with the way it was handled.", "Interview Questions": "The extent to which the climate change issue was resolvable"}, {"date": "18 Sept 2021", "title": "Digital Mobilisation and Social Media Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Greenpeace (London, England) in Aug 2021", "Interview Descriptions": "They sent the interview questions a few days in advance, and essentially stuck to them in that same order, with a few probing questions here or there. \n\nThe team was lovely and created a pleasant interviewing environment\n\nHowever, I do agree with one of the other reviews on here, which suggested the company probed them for ideas at the interview, only to reject them. They did ask a fair few questions about the company specifically, what they could improve on, how they could do it, and other companies that I could point to as a reference. While these may have been innocent questions to determine how well I could contribute to the company, they could have made those questions more hypothetical. As they were, it did feel like I spent 20 minutes giving them ideas for free and with no guarantee of a job offer.", "Interview Questions": "What do you like about our social media presence, and what don't you like? Can you provide 2 examples as a reference for any improvements you suggest? (Paraphrasing)"}, {"date": "16 Feb 2021", "title": "Art Related Job Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Greenpeace (London, England) in Feb 2021", "Interview Descriptions": "The HR team (UK) was really great and clear, set everything up very diligently and offered support throughout. Before the interview, I had to do a copywriting task in 30 mins. I also had to prepare a 5-10 min portfolio presentation of my previous work for a panel of three people, which is was followed by general questions about my competency and experience. The people who interviewed me were very kind and welcoming, really trying to make me feel comfortable & confident.", "Interview Questions": "How do you get senior management to trust you?"}, {"date": "6 Sept 2020", "title": "Internship Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Greenpeace", "Interview Descriptions": "Two interviewers - fairly relaxed process where i discussed my experience.   \r\n\r\nI was also required to share a presentation on a few campaigns i had been involved with.  This included some parameters they set.", "Interview Questions": "An example of you contributing toward a campign "}, {"date": "29 Apr 2021", "title": "Campaign Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Greenpeace (London, England) in Jun 2020", "Interview Descriptions": "Friendly, through, professional. I heard back quickly and was interviewed by two team members and someone from hr. They let me know within a day or two and offered feedback.", "Interview Questions": "An example of a campaign you’ve coordinated "}], [{"date": "4 Dec 2021", "title": "Programme Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Greenpeace (London, England) in Feb 2020", "Interview Descriptions": "STAR based questions very much based around the role. They cut me off at one point because I was speaking too much. They were fine with me bringing notes in. Provided detailed feedback when I did not get it.", "Interview Questions": "What strengths do you have that you could bring to the role?"}, {"date": "30 Apr 2018", "title": "Street Fundraiser Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Greenpeace", "Interview Descriptions": "Met in a cafe. Quite informal talking about background and why I wanted the job.  The interviewer was the team leader. She was running behind when I arrived so it was quite awkward waiting until they were finished. No offer of a drink from the cafe either.", "Interview Questions": "Why do you want to work for Greenpeace?"}, {"date": "10 Mar 2019", "title": "Fundraiser Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Greenpeace (London, England) in Jan 2018", "Interview Descriptions": "I applied for the job with my CV online,  i then got a phone call was asked some questions, asked to attend a group interview in a weeks time,  arrived, and were asked a few questions, talked a bit about yourself and why you wanted job/ why would you be good for it, was told o wait for phone call to see if offer was made,  offer made that day", "Interview Questions": "situational questions, why you're interested etc "}, {"date": "5 Oct 2016", "title": "Street Fundraiser Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 1 week. I interviewed at Greenpeace (Brighton, England) in Sept 2016", "Interview Descriptions": "The interview took 4 hours... I applied online and talked to a lovely women. The people at green peace are not so kind as they kept focusing on how much money you will be bringing in this role. After 2 hours I was bored and hungry then we came in for another 2 hours, of questioning it was like a police interrogation . The whole experience has put me off Greenpeace. I recently got another charity job and I mentioned this interview to them and some of the staff at Greenpeace who come to them tell them of the terrible work hours and financial pressure if you don't meet quotas. The worst bit was at the end when they split us up in two groups those who got it and those who didn't, which was really embarrasing and dehumanising for all our wasted effort. The whole experience was unethical and unmoral.", "Interview Questions": "Time you showed resilience? "}, {"date": "19 Jun 2016", "title": "Fundraising Events and Research Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Greenpeace (London, England)", "Interview Descriptions": "Approximately 30 minute interview. Involved a short presentation, followed by about 10 interview questions. The presentation was \"informal\" which i took to mean no powerpoint etc as that is the general definition of an informal presentation if you search online, however it was clear that they had expected a powerpoint presentation. They also specified a different time length for the presentation, than what was mentioned in the invitation email.", "Interview Questions": "What three things make a successful event?"}, {"date": "10 Jul 2016", "title": "Canvasser Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through a staffing agency. The process took 2 weeks. I interviewed at Greenpeace (Norwich, England) in Jun 2016", "Interview Descriptions": "I got the idea from my experience that they weren't too interesting in looking for people that genuinely care about the environment, they are looking solely for people with perfect sales skills regardless of your passion.\r\nThe interview was ok, there were 4 of us and they let us speak separately, there wasn't any pressure to speak first or when called upon which was nice. \r\nIt's really important that you read the document they give you, as they do ask you questions on it and give you little time to prepare for the role-play. You have to nail this. \r\nThey asked competency based questions and look for your confidence. After the questions we had to go away for a couple of hours, come back and then have a practice run of door canvassing, you had to be perfect first time, with no hesitation. The role play and practice are essential to get right.", "Interview Questions": "How have you used your communication skills in the past to diffuse a bad situation?"}, {"date": "23 Apr 2020", "title": "Senior Business Strategist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Greenpeace (Exeter, England) in Feb 2016", "Interview Descriptions": "First a vidoeconference interview, followed by further multiple rounds of videoconference interviews with international team members. Required to complete and present multiple assignments including case studies, followed by an in-person interview.", "Interview Questions": "Provide criticism of a Greenpeace campaign, and how it should have been approached instead."}, {"date": "19 Apr 2016", "title": "Fundraising Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Greenpeace (Edinburgh, Scotland) in Mar 2015", "Interview Descriptions": "Vey quick process. I was in a group interview. I was contacted by a recruitment agency trying to fill the roll. they told me it would be an individual interview but there was 6 other people there. and I was given the wrong time. lucky I was early. the manager interviewing was great. she was really knowledgeable and made me want to work for her just from her passion alone.", "Interview Questions": "Tell me a time you took a risk"}, {"date": "14 Mar 2015", "title": "Data Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Greenpeace (London, England) in Feb 2015", "Interview Descriptions": "The interview was fairly relaxed, and almost exclusively consisted of questions related directly to the job rather than more general questions. The hiring process however was very badly handled. I am writing this 4 weeks after the interview and I still have not had any communication from greenpeace at all since the interview. I was told that they were only interviewing a small number of candidates and that I should hear within a week. After two weeks I emailed to ask if a decision had been made, and after receiving no response to this I followed up again a week later and still did not receive a response. Personally I find this an incredibly rude way to treat a candidate who took the time to come for an interview.", "Interview Questions": "How would you handle a heavy workload and managing conflicting priorities?"}, {"date": "1 Jan 2018", "title": "Individual Fundraising Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Greenpeace (London, England) in Jan 2015", "Interview Descriptions": "Writing task followed by face to face interview. Competency and experience based interview questions with current post holder and post holders line manager. Writing task was to critique an existing Greenpeace DM appeal.", "Interview Questions": "Describe a time an appeal you were part of went wrong - what did you do to get things back on track?"}], [{"date": "4 Aug 2014", "title": "Fundraiser Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Greenpeace", "Interview Descriptions": "Called two times. Telephonic and then if selected through Skype . Cooperative interviewer helped to get through the hurdles of interactions. Smooth but logical. Passionate abt environment can try this. National language or English seems must. Vernacular lang for local positions may help .", "Interview Questions": "Tell me something about urself"}, {"date": "11 Jun 2014", "title": "Web Editor Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Greenpeace", "Interview Descriptions": "Interesting questions - clearly wanted to find out whether I would fit in (values, culture). I didn't hear back after a while so assumed I didn't get the job and accepted an offer elsewhere. They got back to me several weeks later which meant I had to quit the other job that I'd accepted in the meantime.", "Interview Questions": "Would you risk arrest working for us"}]]