[[{"date": "23 May 2023", "title": "Career Advisor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Ivy Tech Community College (Lafayette, IN) in May 2023", "Interview Descriptions": "Three weeks from when I was originally contacted for a Zoom interview. There were 5 people in total interviewing me, they were gracious about technical difficulties, and overall were very kind.", "Interview Questions": "Why do you have an interest in this position? How would you maintain organization when working with a large number of individuals? How do you work to maintain collaborative and professional relationships? How do you encourage a diverse population to be included? How do you work independently vs in a group?"}, {"date": "24 Apr 2023", "title": "Career Coach Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Ivy Tech Community College (Indianapolis, IN) in Mar 2023", "Interview Descriptions": "Three weeks from time of application to video interview via Zoom. The interview consisted of a group panel comprised of 7 members of the Ivy Tech faculty and staff. Each member of the panel asked questions in rotation.", "Interview Questions": "What experience do you have with promoting inclusive student recruitment?"}, {"date": "30 May 2022", "title": "Senior Academic Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Ivy Tech Community College", "Interview Descriptions": "Zoom interview. Standard questions. Everybody listened quietly. It was a very typical interview. I'm just trying to fill the word requirement here. So here's another sentence. And one more sentence. I'm just trying to look up some salary information man.", "Interview Questions": "How are you for the diversity equity and inclusion. They always ask that."}, {"date": "27 May 2022", "title": "College Coach Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Ivy Tech Community College", "Interview Descriptions": "It was one video interview. During the interview, there is a panel of at least 3-4 people, which includes the  hiring manager. There is a PowerPoint, so I would recommend using a laptop to view the questions. People that used their phones would often have trouble answering questions because they could not view the whole question. The questions are very lengthy. Almost all of them are a paragraph long and ask a what, how, and why. The questions aren’t too difficult but their length can intimidate people.", "Interview Questions": "What have you done to promote diversity and inclusion?\nWhat tools do you use to help you with time management?\nHow do you stay organized?"}, {"date": "7 Apr 2022", "title": "Administrative Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Ivy Tech Community College", "Interview Descriptions": "Interview done through zoom. There were 9 people on the interview committee, so that is intimidating. Pretty standard otherwise. They asked maybe 7-10 questions. The questions were multiple parters, so it was difficult with 9 people staring at you to remember all the parts of the questions. They seemed overly complicated.", "Interview Questions": "Describe a time that you had to work with a diverse population? There were more parts to that question, but I don't remember."}, {"date": "4 Nov 2021", "title": "Liaison Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Ivy Tech Community College", "Interview Descriptions": "Panel interview virtual. Questions were as expected, but it seemed they wanted more than what the position was asking. Was turned down for position, that’s fine. But thought  it was not conducive to building future relationships/ networking.", "Interview Questions": "Tell us about yourself and background"}, {"date": "4 Nov 2021", "title": "Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Ivy Tech Community College", "Interview Descriptions": "very friendly and laid back. The interviewer very thoroughly explained the job. He also explained the hiring process and the expectations about my transcripts and the different levels of classes.", "Interview Questions": "What did you do before?"}, {"date": "29 Jun 2021", "title": "Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Ivy Tech Community College in Jun 2021", "Interview Descriptions": "Initial interview was a 30 minute zoom call with the search team. Second interview was an on-campus interview that included a benefits overview and another interview with the search team. I also met with the person who would be my direct supervisor.", "Interview Questions": "Using three words, how would a past team member describe you? "}, {"date": "30 Apr 2021", "title": "Instructor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Ivy Tech Community College", "Interview Descriptions": "First interview with a faculty/staff committee. Did not get beyond that step to the second interview, which would have been with administrators. Only about 10 applicants made it to the first-interview stage.", "Interview Questions": "Demonstrate an in-class lesson with audience involvement."}, {"date": "15 Mar 2021", "title": "Credit Analyst Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Ivy Tech Community College", "Interview Descriptions": "pretty straight forward, two round phone interviews, start remotely with two managers, ask a basic question about myself, past experience. nothing really technical. most behavior questions. like why this job or why this position", "Interview Questions": "why this job\nwhy this position"}], [{"date": "14 Jun 2022", "title": "Academic Dean Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Ivy Tech Community College in Mar 2021", "Interview Descriptions": "2-3 stage Interview.  \r\n1st - 45 minutes, Q&A with search committee\r\n2nd - Full day/ 4 part interview with Exec Leadership, Direct Reports, Faculty, HR.\r\n3rd - Did not reach this stage.", "Interview Questions": "Perspectives on Diversity/Inclusion, Instructional Coaching, Collaboration."}, {"date": "4 Mar 2021", "title": "Student Support Position Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Ivy Tech Community College in Feb 2021", "Interview Descriptions": "I applied online and a few days after I submitted my application I received a call to set up a video interview. There were 6 people interviewing me and they all took turns asking questions. They asked pretty standard interview questions and they spent a lot of time explaining the origin and requirements of the position. \n\nWhile the questions were not difficult to answer, the interview experience left me feeling uneasy. The interview felt very stuffy and not at all personable. There wasn't any polite chit-chat, jokes, smiling, or anything that would help ease my anxiety or make me feel like I was joining a close-knit team. Having worked in higher education for many years now, it stood out to me that there didn't seem to be a strong sense of community or a friendly work culture at all. \n\nThe pay for the position was extremely low and there was no room for negotiation. Based on my research, low pay seems to be an issue across the board at this institution. \n\nShortly after my interview, someone from HR called and offered me the position. I declined the offer.", "Interview Questions": "What do you do to stay organized?"}, {"date": "3 Jan 2021", "title": "Executive Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Ivy Tech Community College", "Interview Descriptions": "Ten people were included in the interview. They each asked pretty generic questions. Even though the interview seemed well, they sent a automated HR message to say they were ovine forward with other candidates, which seemed unprofessional.", "Interview Questions": "What three words describe your leadership style\r\nDescribe a situation in which you dealt with organizational change "}, {"date": "11 Sept 2022", "title": "Assistant Director of Recruiting Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Ivy Tech Community College (Indianapolis, IN) in Jan 2021", "Interview Descriptions": "It was a panel interview with ppl from different departments. They were all laughing and having a good time when I was escorted into the room.\nI got stumped on \"Sell me this pen.\" I think I rebounded later when it was time for me to do my 5-8 minute presentation.  They had sent a template and topic for me to follow, so that was a plus.  The other questions were situatiinal and pretty easy.\nAfterward, I met with payroll and the asst. Chancellor, so that made me feel like maybe I got the job, but l didn't. \nI was at a partner training the following year and saw the director of recruiting at a table by himself, so I went over and told him how l felt I could have improved on my interview. He said he thought I did great, but the team went with another candidate.  He encouraged me to keep applying bc the position is one that is a stepping stone for others who want to work at the collegiate level. He said he didn't get the Director's job the first time he applied either,  so that gave me even more encouragement. \n", "Interview Questions": "If you could do anything and money was not a factor, what would it be?"}, {"date": "13 Jan 2021", "title": "Department Chair Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Ivy Tech Community College (Indianapolis, IN) in May 2020", "Interview Descriptions": "There were three rounds along with a teaching section that lasted 10 minutes.  Many of the questions from round to round were similar.  Questions seemed inorganic as they had a very specific list to work through.", "Interview Questions": "What is your philosophy of education?"}, {"date": "24 Aug 2022", "title": "Faculty Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Ivy Tech Community College (Indianapolis, IN) in Jan 2020", "Interview Descriptions": "The first round was a phone interview, followed by an in-person interview with  a teaching demonstration. It was a pretty standard panel interview with the program chair, HR, and administration.", "Interview Questions": "What is your Teaching philosophy."}, {"date": "21 Dec 2022", "title": "Director, Academic Advising Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Ivy Tech Community College in Nov 2019", "Interview Descriptions": "Reasonable interview process and was compensated for mileage and out of pocket costs associated with travel. Half day interview meeting with a variety of stakeholders. Included campus four by student life staff member. Campus was new.", "Interview Questions": "Presentation on 90 plan in role"}, {"date": "11 Nov 2021", "title": "Program Chair Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Ivy Tech Community College (Indianapolis, IN) in Oct 2019", "Interview Descriptions": "Three separate interviews took place. One over the phone, second in person with a presentation, third on campus. I was asked to prepare a lesson in the subject area that I was applying for.", "Interview Questions": "Explain a time where you taught someone something."}, {"date": "26 Sept 2019", "title": "Assistant Director of Admissions Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Ivy Tech Community College", "Interview Descriptions": "First round was set up by HR department with four IT employees. Second round same set up plus a presentation on why you should choose Ivy Tech for secondary education.", "Interview Questions": "What do you know about Ivy Tech?"}, {"date": "28 Jul 2019", "title": "Full Time Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Ivy Tech Community College", "Interview Descriptions": "The first stage was a phone interview with a 5-8 member hiring committee. This was followed by an in-person interview with the same large hiring committee. The hiring committee was large and diverse with faculty, staff, and administration involved.", "Interview Questions": "Why Ivy Tech?"}], [{"date": "10 Feb 2023", "title": "College and Career Coordinator Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Ivy Tech Community College (Indianapolis, IN) in Jul 2019", "Interview Descriptions": "The first step was a phone interview, and the next was an in-person interview with department staff as well as key program partners. The experience was overall positive. I felt like the questions related to the opportunity got at the essence of who they were looking for and what type of candidate would be a good fit.", "Interview Questions": "How will you support students in meeting their goals while at Ivy Tech?"}, {"date": "18 May 2019", "title": "IT Level II Support Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Ivy Tech Community College (Evansville, IN) in May 2019", "Interview Descriptions": "In both the 1st and 2nd round interviews I felt very comfortable. There was a 5 person group interviewing me.  Overall the questions were pretty standard. Only 1 technical question and a couple hypotheticals.", "Interview Questions": "In what order would you take care of these various situations?"}, {"date": "3 Jul 2019", "title": "Instructional Designer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Ivy Tech Community College in May 2019", "Interview Descriptions": "I was provided access to a LMS and asked to create a course specific to a course objective of my choosing.  This was presented to a panel for review followed by a period of Q&A.", "Interview Questions": "How would you respond to  SME whose desires for a course are contrary to good learning design?"}, {"date": "17 Dec 2018", "title": "Adjunct Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Ivy Tech Community College", "Interview Descriptions": "Very involved, had staff from several departments take turns asking predetermined very general questions, in conference room then once over asked if you had any questions for them. It was a panel of about 6 staff members.", "Interview Questions": "What do you like about our school. "}, {"date": "9 Aug 2019", "title": "Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Ivy Tech Community College (Valparaiso, IN) in Sept 2018", "Interview Descriptions": "The interview process was easy. I interviewed with a total of three people and it lasted about thirty minutes. The questions asked were fairly easy and the staff seemed nice and helpful.", "Interview Questions": "What made you want to work at Ivy Tech?"}, {"date": "31 Jul 2018", "title": "Assistant Director of Admissions Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Ivy Tech Community College", "Interview Descriptions": "The process was initiated about a month after I submitted the application with a 30 minute phone interview. The 2nd interview was in-person and occurred about another month after. I had to give a presentation on why a student would want to attend Ivy Tech, followed by a half hour of questions following my presentation.", "Interview Questions": "What about this position interests you most, having not worked directly in Student Affairs before?"}, {"date": "28 Mar 2018", "title": "Workforce Alignment Program Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I applied online. The process took 8 weeks. I interviewed at Ivy Tech Community College in Feb 2018", "Interview Descriptions": "Phone interview with 5 people on the phone.  Called back for face to face with 7 people in the round table interview.\n\nQuick. To get call back for face to face but 2 months before the offer.", "Interview Questions": "Name a difficult project you worked on."}, {"date": "21 Aug 2021", "title": "Assistant Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Ivy Tech Community College (Fort Wayne, IN) in Jan 2018", "Interview Descriptions": "need to do a teaching session in front of a group of people on the interview team.  a topic will be provided to you.  Try to make it as interactive as possible to show how you would engage your students.", "Interview Questions": "What is your experience working with a diverse group of people."}, {"date": "27 Apr 2018", "title": "Graduation and Career Coach Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Ivy Tech Community College (Bloomington, IN) in Dec 2017", "Interview Descriptions": "The initial interview involved a panel of six different people, all relating to the position. The panel asked about my ability in handling certain situations as well as relevant career experience. The second interview involved a more personal interview with three interviewees.", "Interview Questions": "Why do you think you're the best candidate?"}, {"date": "16 Jan 2021", "title": "Assistant Director of Admissions Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Ivy Tech Community College (Indianapolis, IN) in Nov 2017", "Interview Descriptions": "The interview process did take about 3 weeks to a month which was kind of long, but once it happened the process was pretty smooth. Knowing the history of the college and the enrollment process was pretty important. The questions asked were pretty typical.", "Interview Questions": "1. Tell us about yourself.\n2. What's your experience working with a diverse group of people?\n3. Tell us about a time when you utilized conflict resolution.\n4. How would you explain the college process to a prospective student?"}], [{"date": "18 Jul 2020", "title": "Trip Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Ivy Tech Community College in Jun 2017", "Interview Descriptions": "Interviewed with the supervisor and 2 other employees on a panel style interview. It was comfortable. I was not told this upfront. They were very friendly.  After this, I was called back and offered the position.", "Interview Questions": "Asked how I would handle students. \r\nAsked about teamwork. "}, {"date": "2 Apr 2017", "title": "Adjunct Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Ivy Tech Community College", "Interview Descriptions": "Was asked to give presentation on a topic given by them. The presentation lasted 45 minutes followed by questions asked by the committee. The committee was friendly, easy and made me comfortable.", "Interview Questions": "Why should we hire you?"}, {"date": "12 Mar 2017", "title": "Adjunct Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Ivy Tech Community College (Fort Wayne, IN) in Dec 2016", "Interview Descriptions": "Applied online and was the department chief emailed for an interview. Went for the interview and talked to him for an hour and so and he gave me the class to teach.", "Interview Questions": "Describe my previous teaching experience."}, {"date": "2 Jan 2017", "title": "Instructor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Ivy Tech Community College (Indianapolis, IN) in Nov 2016", "Interview Descriptions": "I submitted a resume, references, teaching philosophy, and college transcripts online. HR called me to invite me to an interview. During the interview itself. I answered questions from the hiring panel for about half an hour. Many of these questions were behavioral. I then had 20 minutes in which to give a simulated teaching demonstration.", "Interview Questions": "Tell me about a time when you had to work with a challenging student."}, {"date": "7 Oct 2016", "title": "Tutor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Ivy Tech Community College (Gary, IN)", "Interview Descriptions": "You submit an application online or in the center, if the tutoring coordinator likes your appication, they will schedule an interview. Generally new hires start at the beginnng of each new semester.", "Interview Questions": "What are your strenghts and weaknesses?"}, {"date": "4 Oct 2016", "title": "Adjunct Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Ivy Tech Community College (Muncie, IN)", "Interview Descriptions": "I prepared thoroughly for the interview. The interview was easy, however. I simply had to show that I was qualified by explaining my experience, credentials, and asking relevant questions. I was hired on the spot.", "Interview Questions": "Why do you want this job?"}, {"date": "27 Aug 2016", "title": "Associate Vice Chancellor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Ivy Tech Community College", "Interview Descriptions": "One phone interview with a panel followed by an in-person interview with the same panel and a campus tour from a student and staff. Interviews involved several staff including colleagues and supervisors consistent with their matrix management system.", "Interview Questions": "Challenging, engaging questions"}, {"date": "6 Feb 2017", "title": "Academic Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Ivy Tech Community College (Indianapolis, IN) in Aug 2016", "Interview Descriptions": "Pretty easy, one person will ask of the wall questions. The process was actually pretty smooth. I enjoyed it very much. If you do not work there or know someone it an be difficult. Just make a good impression and you will be fine. Job security is okay, but some of the people are not that great at making you feel welcome.", "Interview Questions": "Will you stay for a year?"}, {"date": "4 Apr 2018", "title": "Writing Center Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Ivy Tech Community College (Evansville, IN) in Jul 2016", "Interview Descriptions": "We went over my resume and discussed my past experience with working in a writing center. We also discussed my educational background and my experience working in customer service situations.", "Interview Questions": "What was your favorite supervisor like?"}, {"date": "24 May 2016", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Ivy Tech Community College (Lawrence, IN) in Nov 2015", "Interview Descriptions": "It was pretty basic interview questions, the normal run of the mil. They wanted to know if I had experience in customer services background, which is pretty much what they already knew. A further in depths conversation about how my current job at the time expressed the qualities they were looking for.", "Interview Questions": "Describe a difficult scenario at your job and how you handle it?"}], [{"date": "27 Oct 2015", "title": "Network Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Ivy Tech Community College (Indianapolis, IN) in Aug 2015", "Interview Descriptions": "The interview process was rather slow. The HR director was over a couple of regions however I would've thought they could've got back to  me sooner. The group interview was easy and very informative about the position.", "Interview Questions": "Why should they hire you?"}, {"date": "25 May 2016", "title": "Events Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Ivy Tech Community College in Aug 2015", "Interview Descriptions": "Very quick and painless. HR was pretty useless in providing directions/general information about the interview. But after the one in person interview was done, everything else just fell into place.", "Interview Questions": "Why do you want to work for Ivy Tech?"}, {"date": "16 Jul 2015", "title": "IT Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 4 days. I interviewed at Ivy Tech Community College (Valparaiso, IN)", "Interview Descriptions": "in a room with about 12 people all taking turns asking questions , people from all of the departments , even a couple office people, the dean of the college walked in late with a couple questions also", "Interview Questions": "many types of questions from knowledge of IT / Computers / printers and Network. to how would you handle a rude student . or staff member"}, {"date": "20 Jun 2015", "title": "Assistant Professor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Ivy Tech Community College", "Interview Descriptions": "Not sure, only one interview, possibly others were brought back.  Very guarded in feedback--would not provide any, even after candidate was selected.  Finally received a call that someone else was selected, but this was one week after promised, told not to call, that they would.  Traditional qualifications for professorship were seemingly unimportant, possibly already had someone in mind and were just going through the necessary steps.", "Interview Questions": "No unexpected questions, very standard."}, {"date": "18 Jun 2019", "title": "Dean Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 6 weeks. I interviewed at Ivy Tech Community College (Indianapolis, IN) in Mar 2015", "Interview Descriptions": "Screwing interview then a normal interview then a press room open to anyone then interview with the other deans then interview with senior leadership. There was some ability to prepare but some parts they really just wanted to see you reaction to the situation and rapid fire questions.", "Interview Questions": "How will you take this program to the next level within 3 years?"}, {"date": "2 May 2016", "title": "Dean Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. The process took 3 days. I interviewed at Ivy Tech Community College (Valparaiso, IN) in Feb 2015", "Interview Descriptions": "Applied online, then they called for an interview.  Interviewed by a mass of approximately 8 people, and none knew about the job.  Not a very diverse hiring committee, so I knew I didn't stand a chance.", "Interview Questions": "Why do you want this job?"}, {"date": "21 Dec 2014", "title": "Assistant Professor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3+ months. I interviewed at Ivy Tech Community College", "Interview Descriptions": "Considerate questions and insightful explanations of job requirements. Honest assessment of workload. Gave a chance to ask questions. Job not guaranteed for long-term. Showed explanation of job. Eventually, the job may be gone due to fund limitations.", "Interview Questions": "Would you be available at a variety of times? Are you able to do extensive data entry?"}, {"date": "21 Nov 2015", "title": "Program Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Ivy Tech Community College (Indianapolis, IN) in Dec 2014", "Interview Descriptions": "The interview process was great. I had 3 interviews total. Phone, in-person panel (3 people). The 3rd interview was by phone due to a schedule conflict.  I was all but promised the job then nothing. At least, call/notify with a decision when promised.", "Interview Questions": "Name one of your greatest accomplishments."}, {"date": "13 Jul 2015", "title": "Adjunct Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Ivy Tech Community College (Indianapolis, IN) in Oct 2014", "Interview Descriptions": "It is a one on one interview between you and the program chair. First you need to give a 15 min mock teaching session. The syllabus of the course was sent to you before the interview and you choose one of the topics. Then you will answer some questions about your teaching experiences, teaching philosophy, your knowledge of the college, etc. The whole process lasts about 1h.", "Interview Questions": "Tell me about one of your favorite teachers in the past and why you like him/her.\r\nHow do you hear about Ivy tech and what do you know about Ivy Tech?\r\n"}, {"date": "1 Aug 2014", "title": "Financial Aid Counselor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "The process took 6 weeks. I interviewed at Ivy Tech Community College", "Interview Descriptions": "The interview was relaxed. There was a panel of four managers asking questions regarding the position and how my experience related. They let me know what to expect after the interview. Three weeks after the first interview, I was invited to interview with the Chancellor. He made the offer during the second interview.", "Interview Questions": "What is the current student loan interest rate?"}], [{"date": "9 Jan 2015", "title": "Marketing Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Ivy Tech Community College in Aug 2014", "Interview Descriptions": "I was contacted for an interview 1 week after I applied. The first interview was a panel interview consisting of 4 people. They each asked about 2 questions. Luckily, I was very prepared. They asked mostly situational questions. It lasted about half an hour.\r\n\r\nI was called the next day for the second round interview. This interview was with 2 people. They asked more situational questions and questions relating more to the position.", "Interview Questions": "If they made a movie about your life, who would play you and what would the title be?"}, {"date": "14 Jul 2014", "title": "Parttime Employee Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Ivy Tech Community College", "Interview Descriptions": "The interview is good. People were friendly to me. They asked the basic questions. The whole process took four weeks. I emailed the HR three or times to check the process.", "Interview Questions": "personal experience"}, {"date": "27 Jun 2014", "title": "Faculty Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Ivy Tech Community College", "Interview Descriptions": "I emailed the department chair about a year before out of interest in such a position and we kept in contact when the Faculty Fellow position opened up. Then I applied online and received a phone call invitation to interview about 2-3 months later (we exchanged emails several times during this time as well). I was given instructions to prepare a 30-minute teaching lesson over a specific topic in my field (they told me exactly what topic to teach). \r\n\r\nThe atmosphere of the interview was more laid back than expected. 4 people interviewed me, taking turns asking specific questions they had printed in front of them. All were very nice and interactive during this time.  Mostly expected questions: what qualifies you? How does Ivy Tech fit into your goals? Share 3 strengths? What are your personal interests? Give an example of a difficult time teaching, how did you resolve an issue/ change? Have you taught older students before? Are you involved in the community? \r\nI did draw many of my answers from my philosophy of teaching statement and other past teaching experience. Additional information: I brought in student evaluation comments from past teaching experiences & I brought an example of a teaching technique I like to use in the classroom. They seemed excited to have this additional information.\r\n\r\nThen I gave my 30-minute teaching lesson and that was the end.", "Interview Questions": "What is the difference between the role of a community college and a 4-year institution?"}, {"date": "6 Jun 2014", "title": "Full-time Faculty Member Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Ivy Tech Community College", "Interview Descriptions": "HR called to set first interview which was with a committee made up of faculty, staff and administrative.  A teaching presentation is required and the questions are pre-made.  Members go around the table and ask them.  Committee recommends top three candidates for second interviews.   Second interview was with vice chancellor who then makes final decision.", "Interview Questions": "Where do you see yourself in five years?"}, {"date": "14 May 2014", "title": "Human Resources Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Ivy Tech Community College (Indianapolis, IN)", "Interview Descriptions": "Went through phone screening, one on one interview, and two group interviews. Process took approximately one month from start to finish. They were very friendly, but process took a long time and numerous visits to their offices.", "Interview Questions": "Group interviews were confusing, same questions were asked over and over. With the numerous interviews, quality of answers decreased each time a person asked the same question."}, {"date": "11 May 2018", "title": "Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Ivy Tech Community College in Jan 2014", "Interview Descriptions": "A group of everyone who would be involved was in the room.  there were prepared questions and it was a very open interview.  Everyone was friendly and relaxed.  I enjoyed the experience.", "Interview Questions": "Where do you see yourself in the next 5 years?"}, {"date": "21 Apr 2014", "title": "Adjunct Instructor Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Ivy Tech Community College in Aug 2013", "Interview Descriptions": "Went to an Adjunct Job Fair and go an interview.   Asked about my experience  teaching, and ask when would I be available.", "Interview Questions": "The subject did I what to teach."}, {"date": "16 Jan 2014", "title": "Adjunct Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Ivy Tech Community College (Terre Haute, IN) in Aug 2013", "Interview Descriptions": "2 interviews. First was a panel interview, the second was with a Dean.", "Interview Questions": "Do you deserve the job or does the job deserve you?"}, {"date": "24 Jul 2013", "title": "Adjunct Instructor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied in-person. I interviewed at Ivy Tech Community College", "Interview Descriptions": "Went to an Adjunct faculty job fair.  Provided credentials and resume. Made application.", "Interview Questions": "There were very few questions.  They were supposed to get back with candidates but I don't know of any one who has heard any word about whether they will be hired. "}, {"date": "18 Jul 2014", "title": "Adjunct Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at Ivy Tech Community College (South Bend, IN) in Jun 2013", "Interview Descriptions": "Contacted by Dean.  Had a very pleasant interview.  I was asked specific and general questions regarding my work history, skills and qualifications.  The interview was very relaxed and I did not feel pressured at all.", "Interview Questions": "I did not find any of the questions asked of me difficult nor unexpected due to I was/am qualified for the position I was hired for."}], [{"date": "3 Apr 2013", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 10 months. I interviewed at Ivy Tech Community College", "Interview Descriptions": "My experience of the interview and hiring process was extremely casual.  I had applied several months back, and they had a need for the upcoming semester.  I received a call asking if I was interested and we set up the interview for the next day.  I did dress up with a shirt and tie.  It was a relaxed environment and we simply talked about my passions for the subject I would be teaching in.  Once it was done he offered me the position.", "Interview Questions": "I did not have any difficult or unexpected questions."}, {"date": "20 Apr 2015", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Ivy Tech Community College (Indianapolis, IN) in Apr 2013", "Interview Descriptions": "Dr. Cornett enjoyed my enthusiasm and aggressiveness.  He noticed I am smart, intelligent, and have excellent soft skills.  The man gave me some pointers on sharpening my resume which was deeply appreciated.  After two interviews, the director offered me the part time position (started June 2013).", "Interview Questions": "What is your strongest asset for an employer?"}, {"date": "5 Aug 2016", "title": "Adjunct Faculty Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Ivy Tech Community College in Jan 2013", "Interview Descriptions": "Casual, informal. Interviewed with chair of department, attended a session to learn more about being adjunct faculty. Also met with HR just to get forms completed.  The interview process was not very deep, seemed like they would take a warm body to teach.", "Interview Questions": "Discussed experience, not difficult. Don't know if they really cared about qualifications or teaching experience. Although I have teaching experience at the college level, they hired people who clearly did not have experience and it showed."}, {"date": "17 May 2013", "title": "Library Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Ivy Tech Community College (Indianapolis, IN) in Jan 2013", "Interview Descriptions": "The interview was great but I couldn't fit their schedule as I'm a full time student. They asked about my education and what I would like to do in my career. We also talked about how I was going to help the library so they can help people better.", "Interview Questions": "none"}, {"date": "19 Apr 2016", "title": "Program Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at Ivy Tech Community College (Indianapolis, IN) in Jan 2013", "Interview Descriptions": "Five people sitting around a table, each taking turns asking a total of 10 questions. The questions are pretty standard interview questions: \"when did you have to convince someone...\", \"what is your greatest weakness...\". \r\n\r\nThey seemed especially interested in hearing about the topics of \"Diversity\" and \"Working with lower socio-economic group populations\".", "Interview Questions": "What is your greatest weakness?"}, {"date": "9 Oct 2013", "title": "Academic Support Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Ivy Tech Community College (Indianapolis, IN) in Dec 2012", "Interview Descriptions": "I was interviewed at an offsite campus for the position which was available at two campuses. I was interviewed by two managers at the same time. The atmosphere was very welcoming and pertinent to the position. The gentlemen interviewing were very professional and I felt the questions, role play and scenarios all pertained to the job being interviewed for.", "Interview Questions": "What are your strengths and weaknesses?"}, {"date": "12 Jun 2015", "title": "Clerk Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Ivy Tech Community College (Anderson, IN) in Oct 2012", "Interview Descriptions": "Two group interviews. First with a screening committee and then with the campus president, vice chancellor and regional department manager.  Both interviews were fairly painless.  All the players were gracious during the interview and helped put me at ease.", "Interview Questions": "This position sees a great deal of unhappy students.  How do you deal with stress?"}, {"date": "29 Aug 2015", "title": "Adjunct Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 1 day. I interviewed at Ivy Tech Community College (Indianapolis, IN) in May 2012", "Interview Descriptions": "Met with department head and lead instructor.  Very pleasant and informative. They asked me about my teaching experience and other work experience.  We then talked about how the class would work.", "Interview Questions": "Why do you want to teach?"}, {"date": "10 Jun 2013", "title": "Adjunct Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Ivy Tech Community College (Indianapolis, IN) in Mar 2012", "Interview Descriptions": "A friend who works at the college set me up with the head of the department in which I wanted to teach:  I sent my resume and was called in for an interview the following week.  After a one-hour discussion with the department head I was put on the list of potential adjunct faculty.", "Interview Questions": "The most difficult question was regarding my teaching style.  Although I am a subject expert and had done many one-off lectures, I had limited regular teaching experience, so I had not yet developed a \"style\"."}, {"date": "13 Aug 2012", "title": "Adjunct Instructor Public Speaking Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Ivy Tech Community College (Fort Wayne, IN) in Dec 2011", "Interview Descriptions": "Submitted application online and received an email asking if I was interested in teaching in the upcoming semester (which was only a month away).  I said yes and met for an informal interview with the Dept Chair.  She asked about previous experience and availability, not a lot of probing questions or personal information.", "Interview Questions": "Detailed questions about classes that I taught in a different state, what requirements and policies my former employer had.  Noted that Indiana had different slant on the required course and asked if I thought I could teach to their model."}], [{"date": "1 Sept 2015", "title": "Online Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Ivy Tech Community College in Mar 2011", "Interview Descriptions": "I worked at the company so they were very good about setting up my interview so it would be discreet. I was interviewed by five people. I was interviewed a second time by two upper level employees. I was called to another appointment and they made me an offer. I was told that I would be expected to be available at all times, including weekends. I ended up declining the offer.", "Interview Questions": "How many sick days did I use in my current position?"}, {"date": "29 Jul 2014", "title": "Director of Bursar Operations Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Ivy Tech Community College (Indianapolis, IN) in Nov 2010", "Interview Descriptions": "Pretty smooth, group interviews, paperwork was all in place, good directions, buildings are hard to find your way around.  I don't have any more to say.  You are requiring a lot out of a survey.", "Interview Questions": "N/A"}, {"date": "24 Nov 2012", "title": "Adjunct Instructor Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 days. I interviewed at Ivy Tech Community College (Evansville, IN) in Aug 2010", "Interview Descriptions": "Be professional and truthful. Know your topic.", "Interview Questions": "Pretty straight forward process. "}, {"date": "12 Sept 2010", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Ivy Tech Community College (Bloomington, IN) in Jun 2010", "Interview Descriptions": "I went to a job fair for Ivy Tech that was advertised in the local paper. It was an overall positive experience. I interviewed with two different department representatives and dropped off resume etc. packets. I sent follow up emails but didn't hear back for probably about 3 weeks, at which point I made it to \"level two\" and was offered a 1:1 interview with my would-be boss. Everyone I interviewed with was extremely nice and even the one who couldn't offer me a job seemed genuinely apologetic that they didn't have a fit for me. Good stuff!", "Interview Questions": "There weren't any hard questions, per se, but be prepared to get an offer you may not be expecting or wanting, like a couple classes in the middle of the day when you were hoping for full-time or evening courses. Just, in general, go in open-minded."}, {"date": "19 May 2010", "title": "TRiO Educational Talent Search (ETS) Grant Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Ivy Tech Community College (Gary, IN) in Mar 2010", "Interview Descriptions": "I initially found the job posting listed only on Ivy Tech's jobs database (jobs.ivytech.edu). I applied in November 2009 by electronically submitting a resume, a cover letter, professional references, my salary history, and my unofficial transcripts (both BA and MA). I got a phone call in March 2010 from the Valparaiso campus HR office requesting an on-campus interview to take place at the Gary campus HR office. I was interviewed by a panel of six people (deans, HR folks, TRiO associates, etc.), and I was asked a very standard set of predetermined questions. I answered all questions and asked some of my own. The interview ended, and I learned a month later that the position had been filled.", "Interview Questions": "How did you manage any violent verbal or physical outbursts from clients that you may have experienced in past positions?"}, {"date": "21 Apr 2014", "title": "Assistant Director Human Resources Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Ivy Tech Community College (Indianapolis, IN) in Feb 2010", "Interview Descriptions": "one interview, job offer within 3 days", "Interview Questions": "N/A"}, {"date": "17 Mar 2012", "title": "Research Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Ivy Tech Community College (Indianapolis, IN) in Jan 2010", "Interview Descriptions": "It wasn't very long, but there were some specific questions, that I found difficult to answer.", "Interview Questions": "How do you solve a conflict with your coworker?"}, {"date": "29 Mar 2010", "title": "Network Administrator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Ivy Tech Community College (Kokomo, IN) in Sept 2009", "Interview Descriptions": "This position opened up because my coworker left due to health reasons.  For me it was a lateral job change.  I was of many applicants and I was selected from a total interviewed of 5 others.  It was a single interview.  In my old lateral job, I kept my supervisor up to date with the good and bad of any situation.  Supervisors do not want any surprises.  Communication is key.", "Interview Questions": "What makes you feel you the right choice for this position?"}, {"date": "28 May 2013", "title": "Adjunct Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Ivy Tech Community College (Fort Wayne, IN) in Apr 2009", "Interview Descriptions": "Apply Online, Phone Call to set up Interview, Came in for interview, Call for setting up a time for on-boarding.", "Interview Questions": "If I could Change something in my past what would it be and why."}]]