[[{"date": "18 Jul 2023", "title": "Funding Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Wellcome Trust in Jun 2023", "Interview Descriptions": "\"On May 22, 2023, I applied for the Funding Manager Role. Subsequently, I received communication from a Talent Acquisition Specialist to schedule an initial phone call on June 6, 2023. I promptly responded on the same day, providing my availability as requested. On June 7, I received two emails from the Talent Acquisition Specialist, confirming the screening call for June 9 and asking me to arrange the first and final interview with the hiring manager (I was given specific timeslots to choose from). During the initial call on June 9, I specifically enquired about the expected timeframe for receiving feedback, to which I was informed that it would be within 1 week to 10 days. I had the interview on Monday, June 12, after receiving interview details and preparation information on Friday, June 9, at 5:46 PM. As I had not received any communication from the Talent Acquisition Specialist, I sent an enquiry on June 27 to enquire about the outcome of my application and request feedback. I received an automated reply stating that the Talent Acquisition Specialist would be away until July 3. However, the application system still indicates that my application is \"in progress,\" and to this day, I have not received any updates or feedback regarding my application.\" The above text was part of the feedback that I provided to the organisation. I received on the same a missed call and a voice message from Talent Acquisition asking me to inform them of my availability within the next couple of days to have a call to give me feedback on my application. However, after I responded informing them of my availability for the next day, I never heard from them again.", "Interview Questions": "Behavioural and technical questions. The behavioural were the usual questions that you need to respond to using the STAR approach. Examples of these are, tell me about a time that you had a challenging situation with a colleague and tell me about a time that you has an unexpected workload at work. A technical question was to describe how I would check/confirm the budgeting proposed by a grant holder."}, {"date": "27 Apr 2023", "title": "Technology Lead Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Wellcome Trust (London, England)", "Interview Descriptions": "Online Application with Questions relating to researcher experience, personal attributes suitable for the job and specific skills that would complement the role and benefit the wider team. Also required examples of specific initiatives I have led and/or developed that would be relevant.", "Interview Questions": "N/A"}, {"date": "23 Mar 2023", "title": "Graduate Trainee Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Wellcome Trust", "Interview Descriptions": "Remote recorded interview, with a range of standard interview questions, like describing a challenging project and how you overcame difficulties, an example of when you worked in a team, why you want to join the graduate program.", "Interview Questions": "Why Wellcome, why the graduate program, an example of a problem you encountered and how you overcame it, an example of when you went out of your way to achieve your goals."}, {"date": "20 Mar 2023", "title": "Research Manager Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Wellcome Trust", "Interview Descriptions": "The interview that I had consisted of 3 competency based questions, which were based on the requirements outlined in the job description (broadly) and asked for examples. There was also a prepared task. The panel consisted of three interviewers.", "Interview Questions": "There were competency based questions."}, {"date": "5 Mar 2023", "title": "Business Development Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Wellcome Trust", "Interview Descriptions": "Applied online. Got email invitation to interview. Competency based follow by technical questions. The interview took place online. After the interview I was offered feedback however it was several weeks after the interview and I could not recall my answers.", "Interview Questions": "How would you handle racism in the workplace?"}, {"date": "3 Mar 2023", "title": "Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. I interviewed at Wellcome Trust", "Interview Descriptions": "Team meeting with HR member and team specific member Very impersonal As questions were scripted, hard to demonstrate your personal attributes and experiences Felt like type of interview that you could only perform well in if you already had been referred or knew someone in the company", "Interview Questions": "Very technical in terms of macro economics Questions very much scripted, no room to engage in genuine conversation Very impersonal"}, {"date": "26 Feb 2023", "title": "Graduate Scheme Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Wellcome Trust", "Interview Descriptions": "I was asked 5 questions in total. 3 more general question. 1 related to my application. The last one is what question I have for them. Overall, the interview was difficult. The time limit is quite long, so it is difficult to find words to fill the time.", "Interview Questions": "What is something you would like to ask us"}, {"date": "15 Feb 2023", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Wellcome Trust (London, England) in Jan 2023", "Interview Descriptions": "It consisted of a virtual interview, based on 4 questions. You were given 3 minutes to answer each of them. They were based on your motivation to join Wellcome, two competency based questions and present one news of your and Wellcome's interest.", "Interview Questions": "What is your motivation to join Wellcome? Please describe a time in which you had to communicate efficiently/other competency based question on the seven skills About the news you have provided how would you advocate for it within Wellcome?"}, {"date": "24 Feb 2023", "title": "Graduate Scheme Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Wellcome Trust (London, England) in Jan 2023", "Interview Descriptions": "Successful candidates must go through several stages of the application process. After the initial application, you will be invited to a pre-recorded video interview, where you will be given a question, given around one minute to write notes (unrecorded), then three minutes to answer.", "Interview Questions": "You will be asked to talk about your strengths and areas for development and to talk about how a recent news article you have read would be relevant to Wellcome and how you might implement it into your role there."}, {"date": "27 Jan 2023", "title": "Graduate Development Scheme Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Wellcome Trust (London, England) in Jan 2023", "Interview Descriptions": "Video interview consisting of 4 questions: 1) Motivation for wanting to join the graduate scheme 2/3) Competency questions 4) Explain a recent news article that is relevant to the Wellcome Trust", "Interview Questions": "As listed above in descrip above"}], [{"date": "18 Nov 2022", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Wellcome Trust", "Interview Descriptions": "First round was competency based questions, second was the same plus a 10 minute presentation. Lovely people who made me feel relaxed and confident. The recruitment team also provide helpful documents when you’re invited to interview so you can go feeling prepared.", "Interview Questions": "Competency based questions - they provide some example questions when you’re invited to interview and the questions were very similar, the same or a combo of some. Prepare answers for the examples and you’ll be all set."}, {"date": "27 Oct 2022", "title": "Summer Internship Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Wellcome Trust", "Interview Descriptions": "The interview was a virtual interview - a bit like hirevue. They give you around a minute to prepare for the questions and then you have 1.5 minutes to answer. You cannot rerecord your answers.", "Interview Questions": "- Why wellcome trust - what was your greatest challenge and how did you overcome it"}, {"date": "22 Oct 2022", "title": "Pot Washer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Wellcome Trust", "Interview Descriptions": "Easy I just had to wash some pots and pans. The whole process was over very quickly they use fairy liquid enough said. I even washed some dishes too. All good", "Interview Questions": "Are you experienced at washing pots?"}, {"date": "11 Jan 2023", "title": "Finance Business Partner Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Wellcome Trust (London, England) in Oct 2022", "Interview Descriptions": "Teams call with two people, scripted questions, very impersonal, very corporate, poorly lit interviewer so could not see face, did not sell the company culture at all, did not leave me wanting the job, took over an hour and was just uncomfortable", "Interview Questions": "What have you personally done to ensure that your network is diverse and inclusive."}, {"date": "21 Dec 2022", "title": "Enterprise Risk Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Wellcome Trust (London, England) in Sept 2022", "Interview Descriptions": "2 stage interview after a screening call. Some challenging questions technically in the 2nd interview, 1st interview very welcoming. Overall a positive interview experience where I learnt a lot. 4 different senior managers interviewing over 2 separate interviews.", "Interview Questions": "Technical/ competency based. Character questions, how do you deal with difficult characters/ problems at work?"}, {"date": "28 Jul 2022", "title": "Research Leader Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Wellcome Trust (London, England)", "Interview Descriptions": "This is a place for failed scientists. The panel who interviewed me was quite disorganised. They gave me a task to complete which seemed like they were looking to get quite some piece of work done for free!\r\nSuch a shame this organisation is going so low.\r\n65K in London equals to less that 40K in the Midlands, not even matching a Post-doc salary.", "Interview Questions": "Prepare a presentation on a related topic."}, {"date": "4 Jun 2022", "title": "Project Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Wellcome Trust", "Interview Descriptions": "1 human resource  screening call follow by 1 one-hour panel interview with a mix of competency based and situational questions tailored to the role and job description.  The interview lasted for one hour.", "Interview Questions": "Q: Why do you want to work for Wellcome? Tell us about a time where you... "}, {"date": "21 Jul 2022", "title": "Communications Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Wellcome Trust in Jun 2022", "Interview Descriptions": "A rigid competencies based interview conducted online by a panel of three.  This leaves no room for \"chat\" but I guess this makes it a fair process for all applicants.\r\nFor an organisation that trumpets (loudly) diversity, it was remarkable that the panel members were all an identical age, I'd guess 38.  Absolutely zero age diversity but ticking the boxes for a person of colour, a female and a male. \r\nHeard nothing in the two weeks after the interview and then, after sending an email, a person from HR rang immediately (coincidence ?) to tell me I wasn't successful.\r\nSeriously doubt I would ever have heard further had I not chased.\r\nHR person robotically read me three bullets of  feedback but it sounded like it was somebody else's ?", "Interview Questions": "Give me an example of a time you had a challenge in leading somebody, what happened and what was the outcome."}, {"date": "5 Apr 2022", "title": "Personal Assistant Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Wellcome Trust", "Interview Descriptions": "Interviewed for two separate positions.  One of which placed D&I over ability to actually take on role.\r\n\r\nWhilst I understand the importance of D&I in order to ensure the mix to work well together, more emphasis was made on this than pretty much anything else during interview process.", "Interview Questions": "Can you provide us with a detailed example of when you have in a situation that placed you in a position to respond to "}, {"date": "17 Jan 2023", "title": "Summer Internship Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Wellcome Trust (London, England) in Apr 2022", "Interview Descriptions": "First, I had to answer 3 questions on the applied website. Then there was an online recorded interview. It asked quite typical questions such as why Wellcome. Wellcome does not accept resumes which could be good but also bad,", "Interview Questions": "What was a challenge you overcame and how did you overcome it."}], [{"date": "24 Apr 2023", "title": "Insights Lead Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 8 weeks. I interviewed at Wellcome Trust (London, England) in Apr 2022", "Interview Descriptions": "Long, overdrawn - two tasks to do at each stage requiring a significant amount of preparation. Delays in feedback and difficulty with the recruitment team on getting an in-person interview booked in (including a white lie about sending over details for the task).", "Interview Questions": "Competency 1 – Develops Talent : People development can sometimes focus on 'high potentials' and under -performers. In a previous team, what have you put in place to support the development of everyone? Competency 2 – Analytical Thinking: When have you need to make an important and complex decision – complex in the sense that there was no easy/obvious answer? Technical 1 - As a member of the CEDI team, there will be times when the professional and personal become intertwined. Tell us about a time when you have worked on a subject matter at work that is very close to your own lived experience. Technical 2 - Can you describe 2 recent trends in Equity, Diversity & Inclusion and explain how you would apply them in this role?"}, {"date": "28 May 2022", "title": "Head of HR Business Partner Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Wellcome Trust (London, England) in Apr 2022", "Interview Descriptions": "Telephone screen and then a competency based interview with two interviewers.  It would have proceeded to a 3rd stage.\r\n\r\nThe telephone screen was really positive and the interviewer was very friendly whilst maintaining a level of professionalism.  She gave me a good feel for the organisation and I thought it sounded like a good place to work.\r\n\r\nThe 2nd stage competency interview felt like l was interviewing for a completely different company.  There were two interviewers with one whom I found to be particularly abrupt and unfriendly.  Whilst I totally agree with competency interviews I believe these can be run with a level of engagement, friendliness and create an environment where people would like to come and work there.\r\n\r\nI would have left the interview in the first 15 minutes and found myself becoming more disengaged as it went on with the aim to just get through it.  Sadly I definitely did not want to work there at the end of it.\r\n\r\nThe talent team did call after the interview to ask for feedback which I felt was a positive.", "Interview Questions": "Give an example of a difficult case/situation you have managed and your role within this."}, {"date": "11 Feb 2022", "title": "Human Resources Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 months. I interviewed at Wellcome Trust", "Interview Descriptions": "First interview was scheduled and went well, asked a range of questions and felt fairly assessed. \r\n\r\nAfter this didn't hear from them for 2 months, at which point they contacted me to ask if I had attended the first interview. \r\n\r\nHeard nothing since, I'm guessing I was unsuccessful.", "Interview Questions": "CV and experience and how this relates to the role"}, {"date": "22 Mar 2022", "title": "Research Lead Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2+ months. I interviewed at Wellcome Trust (London, England) in Feb 2022", "Interview Descriptions": "Phase one was application with role-specific questions, CV and motivation letter. \nPhase two  1.5 hours interview including presentation on a topic assigned, behaviour-based questions with STAR system answer, some role-specific, some general from your background", "Interview Questions": "How would you deal with two pieces of conflicting information? "}, {"date": "8 Aug 2022", "title": "Project Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Wellcome Trust (London, England) in Nov 2021", "Interview Descriptions": "Filled in a question-based online application form followed by virtual interview with the Lead, the Senior Manager, and an Advisor.  \r\n\r\nCompetency and experiential knowledge questions specific to the role description.", "Interview Questions": "What problems do you think you might face in a role like this? What considerations are required to mitigate those circumstances? "}, {"date": "8 Jun 2022", "title": "Internal Auditor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Wellcome Trust (London, England) in Oct 2021", "Interview Descriptions": "I had an interview with two Internal Audit Managers with competency-based questions. In the second round, I had to solve a case study. My final round was an interview/discussion with the Head of Internal Audit around the expectations both me and the team had towards the role I had applied for.", "Interview Questions": "Tell me an example when you had to deal with a difficult stakeholder."}, {"date": "21 Aug 2021", "title": "Community Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Wellcome Trust", "Interview Descriptions": "Standard interview and task. Nice people put me at ease. Interview task was to plan a campaign - they asked me to present for ten minutes. Offices are very impressive and good place to wokr", "Interview Questions": "Talk about a time where something hasn't gone right and what you did to fix it "}, {"date": "11 Aug 2021", "title": "Project Officer Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Wellcome Trust", "Interview Descriptions": "One round with panel of three people. Prepared written assignment ahead of time. Range of questions about science and prioritisation and decision making. Took one week to get decision. HR was slow to put together contract and not responsive to request for pay increase.", "Interview Questions": "What scientific article have you read recently outside of your area of interest?"}, {"date": "17 Jun 2021", "title": "Research Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Wellcome Trust", "Interview Descriptions": "It was a very nice interview process. Everything was done virtually with a panel of 4 members. They all were friendly and made me comfortable. Each panel members asked me atleast one question with some asking me to elaborate or asking another question.", "Interview Questions": "Describe the process of PCR? \r\nWhat is Lims? "}, {"date": "10 May 2021", "title": "Equality, Diversity and Inclusion Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Wellcome Trust (London, England) in Apr 2021", "Interview Descriptions": "It was a standard phone profiling interview ..one of those where they are somewhat wasting your precious time. Asking what research experience you have for a research role shows lack of understanding from the HR recruiter. You don't ask an IT expert if they can use a keyboard, so don't be asking what experience a researcher has in carrying out interviews or survey methods...it's a given. No challenge whatsoever this form of interviewing from their HR dept as a 1st screen. It also smacks that of them not reading your CV or covering letter as what they asked on the phone was what I had already described in my application. As a highly qualified how do you expect me to reply 'tell me what experience in data analysis do you have?'...probably more experience than the questioner has had in hot dinners! \r\n\r\nThe HR recruiter also asked about salary expectations. They advertised \"circa £xx.000\". So I stated a +10% ....to which the HR interviewer reeled off the benefits package...and was reluctant to offer more than the stated circa salary figure. Shows poor understanding of recruitment as they should advertise 'circa' if their budget doesn't allow for more. I suspect this so the reason I wasn't taken forward to the next round. \r\n\r\nAll in all a complete waste of time...mine and theirs.", "Interview Questions": "Please tell me about your qualitative research skills? \r\n\r\nWhy is equality and diversity important?"}], [{"date": "18 Feb 2021", "title": "Intern Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Wellcome Trust (London, England)", "Interview Descriptions": "The interview experience was positive and friendly. I was given feedback upon request via email. Interviews by 2 interviewers in the office. Was asked general competency based questions and a presentation to prepare beforehand.", "Interview Questions": "What are your strengths and weaknesses?"}, {"date": "2 Oct 2020", "title": "Graduate Development Program Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Wellcome Trust", "Interview Descriptions": "Very positive experience. They were very supportive - making the process as easy, interesting and stress-free as possible. Recommend researching their priority areas and projects that are part of these. Also recommend emphasising your desire to develop your skills and do a range of activities.", "Interview Questions": "Competency based: Examples of the skills they're looking for"}, {"date": "2 Aug 2022", "title": "Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Wellcome Trust (London, England) in Mar 2020", "Interview Descriptions": "a very tedius and intense for over 3 hours. extremely detail oriented make sure to come with an extra copy of resume and references.\nbe polite and tidy, ensure to keep a smile on your face", "Interview Questions": "what inspires you to put in your best in the workplace"}, {"date": "2 Apr 2020", "title": "Graduate Scheme Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Wellcome Trust (London, England) in Jan 2020", "Interview Descriptions": "Assessment centre : \r\n-split into 4 sections :written task , presentation , group task, one on one interview \r\n-The staff were all extremely friendly \r\n- no extra time for dyslexia for the group task in reading and prepping your ideas to others, 5 mins wasn't enough time for me with dyslexia to read instructions and additional material we had to use  and then prep how I was going to pitch to others\r\n-Apart from that all other tasks were well run and considerate of additional requirements", "Interview Questions": "You were interviewed one on one by someone high up in Wellcome.\r\nIt wasn't really an interview as such but more an opportunity to explain your story and why you would be well suited for Wellcome and your motivations"}, {"date": "20 Jan 2020", "title": "Investments Graduate Programmer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Wellcome Trust in Nov 2019", "Interview Descriptions": "Application form including questions regarding the scheme, your skills and topical current affairs / investment Qs. Not too onerous, and somewhat interesting. \r\n\r\nVideo interview - 5 Qs (I think). Didn't go well and I knew I wouldn't be invited to the AC. \r\n\r\nAfter being offered feedback without requesting, I politely accepted the recruiter's offer. The best part of 2 months later, however, I have not received any response. A basic level of respect for candidates who have invested time in the process certainly wouldn't go amiss Wellcome !", "Interview Questions": "How I would value Airbnb, and the risks / opportunities of investing in such sectors. "}, {"date": "6 Oct 2022", "title": "Senior Executive Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 2 months. I interviewed at Wellcome Trust (London, England) in Jun 2019", "Interview Descriptions": "I was approached via a headhunter agency to interview about a role and had a very positive conversation. Then I spoke to another recruitment consultant seconded to Wellcome. Neither knew the first thing about data, or science, or research, or health. They might as well have been recruiting estate agents. The second person I spoke to had a side hustle as a witch doing fortune telling on Instagram. Really.", "Interview Questions": "What are some of the opportunities you could bring?"}, {"date": "21 Apr 2020", "title": "Internal Communications and Engagement Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Wellcome Trust (London, England) in May 2019", "Interview Descriptions": "Telephone interview first, then a timed skills test in which you had to review a piece of comms and provide suggestions for improvement.\r\n\r\nThe face to face part was two back to back 1hr panel interviews with two groups of employees. Questions mostly on competency questions (e.g explain a time you did X to overcome Y).", "Interview Questions": "What was a difficult decision you’ve made that goes against your manager’s wishes?"}, {"date": "28 Mar 2019", "title": "Graduate Scheme Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Wellcome Trust", "Interview Descriptions": "Clear communication, got through first round test and completed video interview. Tests include writing on a cause you would like to work on at wellcome and how wellcome will help, you will be asked to talk in more detail about this at the video interview stage.", "Interview Questions": "In the video interview you will be asked to ask questions"}, {"date": "25 Jul 2019", "title": "Strategic Programmes Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Wellcome Trust (London, England) in Mar 2019", "Interview Descriptions": "A really ill-managed and disappointing interview experience.\r\n\r\nApplied online and was invited to interview with instructions to prepare a presentation around a specific project. Searched everywhere online and found no information for this project so emailed them and asked if it was made up. they replied back just two days before the interview saying \r\n\r\n\"it refers to a project we are scoping so there isn’t detail yet available on the website\"\r\n\r\nI then asked her to send me information on it so I could prepare my presentation, which she did do so without apology or acknowledgement that a task was set for a candidate that would have been impossible without this missing information.  A critical oversight on their part.\r\n\r\nAnother issue was that they removed the job description from their website right after the deadline. This meant that I was forced to prepare based on my memory of what was in it and where  I had, thankfully, copied and pasted some parts on to a document when I was applying.\r\n\r\nThe interview itself was over an hour long. Questions were difficult but more or less what I  expected. After the interview however I heard nothing for two weeks, despite being told that I would be informed of a decision in just a  few days. Sent a follow up email and got no response. Waited for 2 weeks before eventually, without thinking, logging on to my online portal, where I had submitted my application, and it was there I saw that they had rejected me. No opportunity was provided to me to get feedback. This is probably the worst way I've been informed of an interview outcome. \r\n\r\nI'm left with a really bad impression of Wellcome. Though in the media they portray themselves as always looking out for the well being of staff and the general public, they certainly do not adopt best practice when it comes to candidates they interview.", "Interview Questions": "Give an example of a public engagement activity that you really liked?"}, {"date": "2 Mar 2019", "title": "Wellcome Trust Graduate Scheme Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Wellcome Trust", "Interview Descriptions": "In the email they sent describing the interview process, they pretty much sum up the questions they will ask you. Everything is made available to you, so just take advantage of that. Also look out for questions used previously as they tend to arise.", "Interview Questions": "Tell us about the news story you would promote to wellcome and how would you go about engaging the public"}], [{"date": "4 May 2020", "title": "Graduate Trainee Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Wellcome Trust (London, England) in Feb 2019", "Interview Descriptions": "written interview, video interview, assessment centre (interviews, group assessment, presentation, written exercise), final interview. Found out about the offer over the phone a few weeks after final interview. Great communication throughout the process, always felt very comfortable", "Interview Questions": "tell us about a time where you felt out of your depth "}, {"date": "19 May 2019", "title": "Business Management Graduate Scheme Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Wellcome Trust (London, England) in Jan 2019", "Interview Descriptions": "A long but interesting questionnaire to fill and then the video stage with similar questions. Then an assessment center where you have to group exercises. I struggled at the assessment center as I find them a slightly unnatural environment for interviewees.", "Interview Questions": "What have you read recently in the news that interested you and you think the Trust could look into?"}, {"date": "23 Dec 2018", "title": "Graduate Scheme Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Wellcome Trust (London, England)", "Interview Descriptions": "Had to complete an online application with questions and undergo a brief test on competency questions. The application form questions were read in isolation and were only 200 words each. Did not have to attach a CV.", "Interview Questions": "They questioned me on one of the application questions which concerned a recent news article that I had read."}, {"date": "21 Dec 2018", "title": "General Graduate Scheme Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "The process took 5 weeks. I interviewed at Wellcome Trust", "Interview Descriptions": "Initial application form followed by a timed situational judgement test and 4 motivational/ competency questions. These are then reviewed before being invited for a video interview, unfortunately I did not make it to the video interview round.", "Interview Questions": "Why this graduate scheme?"}, {"date": "28 Oct 2020", "title": "Graduate Scheme Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Wellcome Trust in Dec 2018", "Interview Descriptions": "Written application questions + SJT. Shortlist top 10% to video interview with a mix of motivation and competency based questions. 30 seconds to think/jot down notes and 2 minutes to answer questions. Was unsuccessful but on request they provided really helpful, detailed and personally specific feedback which was great to see.", "Interview Questions": "Why do you want to join the Graduate Development Programme?"}, {"date": "20 Nov 2020", "title": "Grants Adviser Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Wellcome Trust in Oct 2018", "Interview Descriptions": "Two interviewers for around 45-60 mins. Very friendly and put me at ease. Quite standard questions Including exploring my specific ability to meet the requirements of the role as per job description.", "Interview Questions": "How I would hi about fitting into a new team"}, {"date": "7 Sept 2018", "title": "Policy Officer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Wellcome Trust (London, England)", "Interview Descriptions": "The interview involved a written task to be sent beforehand,  a short presentation on the day, followed by competency and motivational questions. \r\n\r\nThe interviewers indicated that were second round interviews the following week, and that I would hear within the next few days whether successful or unsuccessful. However, I heard nothing from my HR contact the following week, despite sending a polite follow-up email.  Two weeks after the interview I received an automated rejection email, which indicated I could ask my HR contact for feedback. I emailed HR, and again heard nothing. The whole process was very impersonal, and a disappointing way to treat candidates who have invested a lot of time and travel expenses in preparation and attendance to interview. My experience reflects a lot of the concerns on Glassdoor surrounding the disorganised HR department.", "Interview Questions": "Why would you like to work at Wellcome?"}, {"date": "29 May 2018", "title": "Customer Experience Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Wellcome Trust (London, England) in May 2018", "Interview Descriptions": "Initial 1-1 call with hiring manager. Fairly basic questions around motivation, experience. \r\n\r\nFollowed by 1-2 interview with hiring manager and Head of Service. Started with 2x  15m presentations on KPIs and approach to a new team, organisation etc. followed by questions. \r\n\r\nPhone interviewee was also present at main interview. Good active listening from both and encouragement. Made me feel comfortable and welcome. Gave plenty of time for questions from me. \r\n\r\nDisappointed there was no offer but happy to have had the experience.", "Interview Questions": "Describe a time you had to resolve a conflict. "}, {"date": "29 Jan 2018", "title": "Graduate Development Program Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Wellcome Trust", "Interview Descriptions": "Online questionnaire and then a HireVue interview. Five fairly basic questions, most of which were competency-based (talk about a time when you have overcome a challenge etc.). Strangely given the oppurtunity to 'ask questions' at the end which were obviously never going to be answered...", "Interview Questions": "Asked about a newstory in the written application, the HireVue interview then asked if you were to spread awareness about that topic, how would you do so?"}, {"date": "5 Mar 2018", "title": "Graduate Scheme Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Wellcome Trust in Dec 2017", "Interview Descriptions": "Online application form:\r\n- Why you're interested in the programme vs other programmes\r\n- What rotations are you interested in and why for your future career goals \r\n- Any interests and work experience relevant to the role \r\n- Tell us about a news story that's interested you and why might it be important to Wellcome \r\n\r\nThen a video application. This is kind of weird as they have prerecorded questions and you only have one chance to record your answers (you have a minute or so I think but a 30 second break between their question and the recording). \r\n- Asked more about your news story from your application and how you would deal with it if you worked at welcome \r\n- Other role-relevant questions.", "Interview Questions": "Why is your news story important and how would you approach the problem as Wellcome "}], [{"date": "15 Apr 2017", "title": "Marketing Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Wellcome Trust", "Interview Descriptions": "I applied online and received an email telling me I had an interview a week later. The whole process took just under 2 weeks. The interview consisted of a 45-minute task and then a 40-minute panel interview. The interviewers and everyone I spoke to at Wellcome were very polite and friendly. The task was a little tricky but the interview itself was relatively easy.", "Interview Questions": "Why Wellcome?"}, {"date": "1 Nov 2018", "title": "(Social Science) Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Wellcome Trust (London, England) in Apr 2017", "Interview Descriptions": "Very formal interview - 3 person panel - 2 people on the panel were asking questions, whilst the other was writing answers\r\nSkill-based questions make sure you are familiar with STAR (Situation, task, action, response format", "Interview Questions": "Can you think of any examples of the way social science has been used to improve health?\r\n"}, {"date": "14 May 2016", "title": "ITSystems Development Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Wellcome Trust", "Interview Descriptions": "Applied online with cv and cover letter. There's only one interview, it was approximately 40 minutes long in their London office. Asked me why the wellcome trust. Most enjoyable and least enjoyable part of my course. How I handle conflicts in teams.", "Interview Questions": "Give an example of a time you worked in a group."}, {"date": "16 Mar 2020", "title": "Financial Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Wellcome Trust (London, England) in Mar 2016", "Interview Descriptions": "I interviewed at the Wellcome Trust as a second year doing a placement year and found the interview process great. Nice people, showed an interest, non-threatening. Didn't have any problems with the process", "Interview Questions": "Background\r\nCompetency questions"}, {"date": "22 Mar 2017", "title": "Graduate Programmer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Wellcome Trust (London, England) in Feb 2016", "Interview Descriptions": "Written application form answering four long questions with about a paragraph of text each. This was followed by an offer of a video interview, for which you had to answer questions to a computer which recorded and relayed your response to the organisation. I was then invited to an assessment centre about a month later. There were about 20 people there on the day, but they ran multiple assessment centres. The centre was well-organised and people were friendly, and they provided detailed feedback afterwards.", "Interview Questions": "Why are you interested in the Wellcome Trust?"}, {"date": "18 Jan 2016", "title": "Finance and Investment Graduate Programmer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Wellcome Trust (London, England) in Nov 2015", "Interview Descriptions": "Applied online with questions on why I wanted to join the company and that particular role. If you pass the screening you are invited for psychometric and numerical tests. I thought I'd failed the numerical but ended up being invited for a phone interview. In the phone interview they ask again why the company and the specific role you applied for and then ask 3 or 4 competency questions. The competencies listed on the company's website for the role weren't helpful at all since I ended up being asked about different competencies. I can only remember about creativity and research skills. Don't know how the assessment centre is since I got rejected at this point. Overall great experience and the guy who interviewed me was very friendly and made the interview very pleasant.", "Interview Questions": "Tell me about a time where you had to research a topic and how did you go about it. Tell me about a time you had to change a process."}, {"date": "24 May 2016", "title": "Quantitative Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Wellcome Trust (London, England) in Jul 2015", "Interview Descriptions": "CV and cover letter. Was offered interview within a couple of weeks. Questions were mainly about CV/background and my motivations. The interview was one hour in total and was with both the head of the department and the current Quant. I was expected to ask as many questions, if not more, than they did.", "Interview Questions": "Why do you want to work for the Wellcome Trust?\r\nAre you applying for jobs on the sell-side as well?"}, {"date": "27 Jan 2016", "title": "Graduate Development Programme- Policy and Funding Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Wellcome Trust (London, England) in Jan 2015", "Interview Descriptions": "I submitted a cover letter and CV. I then completed online tests including a verbal reasoning test and a logic test. After this I was given a competency based telephone interview. I was subsequently invited to an assessment day at the Wellcome. The day included an interview by two people, online maths test, individual power point presentation (with 1hr preparation time), writing exercise and a group exercise.", "Interview Questions": "The telephone interview was competency based. I was asked to provide examples of times where I had demonstrated competencies such as learning and researching, analytical thinking and creative or innovative thinking. The face to face interview on the assessment day was also competency based but less rigid in structure. I was given the opportunity to discuss projects at the Wellcome I found exciting."}], [{"date": "20 Jan 2014", "title": "Graduate Development Scheme In Engagement and Communications Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Wellcome Trust (London, England) in Jan 2014", "Interview Descriptions": "After the initial application, online verbal and logical reasoning tests, phone interview consisting of competency questions and assessment centre, it is a fairly lengthy and intensive application process. However all elements have seemed fair and well managed.", "Interview Questions": "The online tests were very hard, I thought I hadn't got any of them right, and I had been practising for a few days. Competency areas were stated in advance and questions were of average difficulty."}, {"date": "20 Jan 2017", "title": "Web Editor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Wellcome Trust (London, England) in Jul 2013", "Interview Descriptions": "Formal interview with 3 members of management, with questions relating directly to the post and evidencing skills. Then followed by a one to one with someone from HR, asking softer questions about teamwork and attitudes to colleagues. Then a second stage which was a chat with someone higher up.", "Interview Questions": "Describe the organisation to someone who's never heard of it."}, {"date": "16 Apr 2013", "title": "Analyst Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied through a recruiter. I interviewed at Wellcome Trust", "Interview Descriptions": "Straightforward - several interviews with management and team", "Interview Questions": "N/A"}, {"date": "28 Dec 2012", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Wellcome Trust (Oxford, England)", "Interview Descriptions": "Standard online application consisting of supporting statement and CV.\r\n\r\n40min panel interview oriented around the nature of the post and my research background. Technical questions were asked based on aspects of the post e.g. knowledge of techniques. Standard common competency questions were additionally asked.", "Interview Questions": "How would other people describe you?"}, {"date": "25 Jan 2013", "title": "Postdoctoral Scientist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Wellcome Trust (Oxford, England) in Feb 2012", "Interview Descriptions": "It was an internal job application (advertised with the University only) and it took only about 2 weeks from the application deadline to the job offer which is very fast for academia.  The interview was only 15 min and very much on the job questions.  Easy in my case because I haev a lot of experience with the techniques that were asked for in the job advert.  However, anybody with less experience would be able to answer the questions with a little bit of preparation before the interview.", "Interview Questions": "nothing unexpected"}, {"date": "2 Oct 2015", "title": "PhD Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Wellcome Trust (London, England) in Jan 2011", "Interview Descriptions": "Application deadline for the NIH/WT PhD programme is November -- and if you're offered the scholarship, you'll start in September of the next year.\r\nThere was a ~10-page long application form to fill. Very thorough.\r\nOnce you apply in November, you hear back in November/December if you've been selected for interviews. \r\nWT headquarters are in London and the interview will be with an intimidating panel (at least 10-15 subject specific experts). Be prepared to answer specific questions.", "Interview Questions": "Tell me about your PhD project"}]]