[[{"date": "5 Apr 2022", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Bakersfield College (Bakersfield, CA) in Mar 2022", "Interview Descriptions": "The interview had 2 parts  I was assigned some exercise like estimate gpa and similar. Then I had a zoom with a committee. They were very serious. Overall a good experience.", "Interview Questions": "How would you support diverse student population?"}, {"date": "6 Jun 2021", "title": "Advisor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Bakersfield College", "Interview Descriptions": "Basic questions on college advising. About 6 person panel. Ask questions regarding information on their college services page. Positive experience. Made it to second round. One on one interview. Was not selected.", "Interview Questions": "Describe how you have worked with students?"}, {"date": "18 Apr 2019", "title": "Research Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Bakersfield College", "Interview Descriptions": "On-site interview included a simple test, committee interview, and presentation. For the presentation, I was given a vague prompt and prepared a 10 minute presentation in advance. There were also two follow up phone/Skype interviews with office leadership.", "Interview Questions": "All BC interviews allow you 5-10 minutes to review the full interview questions before you meet with the hiring committee. These questions were pretty basic for data analyst positions."}, {"date": "16 Jan 2019", "title": "Adjunct Professor Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Bakersfield College", "Interview Descriptions": "Sumbit experience online. Contacted on the phone. Asked to interview on campus in a classroom.  Needed to be prepared with lesson plan and c programming example.  Needed to present college transcripts and publications.", "Interview Questions": "Example of class layout and C programming lesson example"}, {"date": "5 Feb 2020", "title": "Clinical Supervisor Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Bakersfield College (Palmdale, CA) in Jun 2018", "Interview Descriptions": "A group of people interviewed me.  They were very friendly and welcoming. I could have seen myself working with this group of people but I had a scheduling conflict. I was happy for the opportunity to interview with them. I would have accepted the job if it matched my schedule.", "Interview Questions": "What is my Experience in the field?"}, {"date": "12 Nov 2018", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Bakersfield College (Bakersfield, CA) in Jun 2018", "Interview Descriptions": "I was interviewed by both the Dean and the Director of the Science & Engineering Dept. The interview was supposed to last one hour but it three hours. Questions were asked about my 30 years of experience as a research and analytical chemist. Questions about my education, classes I enjoyed most and least. Questions about my research projects during my career as a chemist and why I wanted to be a professor. A presentation was required, but after the interview I was told I did not have to make a presentation since I was ready to teach.", "Interview Questions": "I was asked about the researches I did while in graduate school and about my duties in a laboratory management job I held after graduation. There were no typical job interview questions."}, {"date": "17 Apr 2018", "title": "Teacher Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Bakersfield College", "Interview Descriptions": "They ask you what classes you’ve taken. Once they ask you what classes you have. During the interview you are also asked what classes you taken you are asked if you have portfolio paper to showcase your experience.", "Interview Questions": "My experience "}, {"date": "20 Mar 2017", "title": "Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Bakersfield College (Bakersfield, CA) in Mar 2017", "Interview Descriptions": "I had two interviews.  The first was with a committee of 5 faculty members and consisted of a predetermined set of interview questions and a teaching demonstration.  They emailed me the questions about 15 minutes before the interview.  The second interview was with the college president.  Both interviews were good.  Nothing too difficult.", "Interview Questions": "What are the traits of an ideal college teacher?  How do you put those traits into practice in your classroom?"}, {"date": "6 Mar 2016", "title": "Sports Related Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Bakersfield College", "Interview Descriptions": "Panel style interview. Handed out a typed set of questions. Interview was 30 minutes. Panel was straight forward and dressed quite casually. Four panelists. At the end they ask you if there is anything you would like to add.", "Interview Questions": "What is your philosophy regarding the specific sport."}, {"date": "28 Jan 2018", "title": "Adjunct Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Bakersfield College (Bakersfield, CA) in Jun 2015", "Interview Descriptions": "Checked postings on school HR site and applied.  Online application. You must submit your transcripts.  You don't need to submit your teaching philosophy.  There is a panel and each person takes turns asking you questions.", "Interview Questions": "How do you meet the learning needs of underprepared students?"}], [{"date": "25 Feb 2015", "title": "Admissions Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Bakersfield College", "Interview Descriptions": "Panel interview with five intimidating ladies.   They had a set of questions which they couldn't deviate from.  And they all looked like FBI agents.  I felt like I was sent to the principals office.", "Interview Questions": "Describe your experience with handling confidential materials"}, {"date": "17 Nov 2014", "title": "Professor Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3+ months. I interviewed at Bakersfield College (Bakersfield, CA) in Jan 2014", "Interview Descriptions": "Hiring process was long and slow, very disappointed in the lack of communication...took over 90 days to even hear I was still being considered for the job. It felt a bit awkward contacting their HR department to try and figure out what was going on. Everyone was very friendly but offered very vague information regarding the overall process and what to expect as far as duration of process.", "Interview Questions": "\"Why should we hire you above someone else?\" Very mundane questions...typical of interview"}]]