[[{"Recommended": "Yes", "CEO Approval": "No", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Bilingual customer Representative", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "6 Apr 2018", "job_title": "Customer Service Representative in Toronto, ON", "duration": "N/A", "pros": "Good culture, flexible shift, on'going training, etc", "cons": "None in my opinion"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Good place to work but not for the pay", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "13 Jun 2023", "job_title": "Administration in Toronto, ON", "duration": "N/A", "pros": "- Supportive environment - Supportive Manager - Growth possibility", "cons": "- Salary is one of the lowest"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 0, "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "MedicAlert of Canada - Such a shame!", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "24 Aug 2022", "job_title": "Operational Analyst in Toronto, ON", "duration": "N/A", "pros": "Good work from home policy.\r\nThe social committee tries to create a fun environment during the holidays.", "cons": "-Organization is lacking in strong executive leadership. Statements similar to, \"it is my way or the high way, if you don't like it leave, or, I will never change my style\", are all too common. Sad that MedicAlert will shut down/go out of business due to the lack of self-awareness and delusion of the leadership, and members of the executive team.\r\n\r\n-Deciding on a simple path, and doing that right will help. But the directives are changing multiple times a day as though executive leadership is scrambling.\r\n\r\n-HR is NOT private, the leaders of HR shares details of private conversations constantly, especially with the executive leadership and during 1:1s with the these members they will share details that were only ever shared during an HR 1:1.\r\n\r\n-RUN! I have compassion for this organization because it is being run by delusional-bully.\r\n\r\n-The Board of Directors needs to OPEN THEIR EYES. They are disengaged and is can be seen at all levels.\r\n\r\n-The company has lost 10+ senior leaders due to quitting or design in the last year. That is no by coincidence. Perhaps these leaders could see the forest for the trees."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Wanna work for an inexperienced narcissist? Join MedicAlert Canada!", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "20 Jun 2022", "job_title": "Anonymous Employee in Toronto, ON", "duration": "N/A", "pros": "- There are some wonderful and hardworking staff members", "cons": "- the CEO is truly awful! She is indecisive, confrontational, and gas lights staff every chance she gets. Claims to be an expert in every aspect of the organization, (she isn't) and manages through dictation, fear, scapegoating and back stabbing.\n- charitable programs are not actually charitable as free IDs and service plans are given to anyone who applies, regardless of financial situation/need\n- very toxic corporate culture that discourages thoughtful criticism or questioning of management, and encourages a \"do as I say\" mentality\n- executive management are inexperienced, uneducated and spineless staff who do the bidding of the CEO (who has no idea what she's doing)\n- 2 major corporate restructures in 6 months - several layoffs of staff with less than 12 months tenure\n- regular staff departures without any notice or explanation from upper management and frequent layoffs whenever the CEO doesn't like someone\n- internal promotions that promote underqualified staff to positions well beyond their expertise and experience level (ex. Promotion from manager to VP of a different department with 2 months tenure at the organization)"}], []]