[[{"date": "13 Jun 2023", "title": "Events Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Portland (Portland, OR) in Apr 2023", "Interview Descriptions": "An initial phone call with one person, followed by an online interview with two people. I moved forward to a third in person interview with five people in the department with round-table questions.", "Interview Questions": "What are procedures you have carried out in event coordinating."}, {"date": "30 Jun 2022", "title": "Marketing Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at University of Portland", "Interview Descriptions": "Fine, professional, reasonable, happy, sad, dance for it Fine, professional, reasonable, happy, sad, dance for it\nFine, professional, reasonable, happy, sad, dance for it\nFine, professional, reasonable, happy, sad, dance for it\nFine, professional, reasonable, happy, sad, dance for it", "Interview Questions": "who are you and what do you want?"}, {"date": "1 Jan 2022", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Portland", "Interview Descriptions": "Series of 10 questions about my perception of my personality and situational questions. There was the main interviewer and then another person present to take notes on my responses that had secondary questions.", "Interview Questions": "What are 5 of my personality traits?"}, {"date": "11 Jul 2020", "title": "Admissions Tour Guide/Office Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at University of Portland", "Interview Descriptions": "Interviewed by former tour guide and senior admissions counselor. Both friendly and asked questions that ranged from my own experiences and what I thought about the school as a whole", "Interview Questions": "How would you describe involvement of religion on campus?"}, {"date": "9 Jul 2019", "title": "Office Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Portland (Portland, OR) in Jun 2019", "Interview Descriptions": "Long and tedious spreadsheet work. Then a 2-hour interview process with 6 different people. It seemed like a lot of screening without much information given ahead of time to determine if one actually wanted to wade through the process. It would have been nice to know ahead of time that there this was a dead end job.", "Interview Questions": "Knowing that you have looked at our website and our mission, how would you apply our mission in your work here at U of P."}, {"date": "6 Jun 2019", "title": "Public Safety Officer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at University of Portland (Portland, OR) in May 2019", "Interview Descriptions": "Interesting interviews but lacking in structure... I had two in person interviews with two people at the first interview and three at the second. The interview had a lot of questions regarding students and the care of the students on campus, which of course is a big part of this role. I felt that was a good quality in the interview. I however felt some of the questions were religion related and seemed to lack in finding a qualified person for the position. After two interviews I thought the University of Portland would do the correct thing and contact the candidates about the next steps or the decision to go with another candidate but they did not. I find it interesting the religious tone of the interview but the lack of respect towards a candidate to not even tell them the results of the hiring process.", "Interview Questions": "How would you follow and promote the mission here at the University of Portland?"}, {"date": "23 Oct 2018", "title": "ISS Event Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at University of Portland", "Interview Descriptions": "Awesome experience! Wonderful support! I felt that I learned a lot through this job: how to facilitate, coordinating throughout the whole campus. Over all it is a very meaningful job and experience! Highly recommend for give it a try!", "Interview Questions": "Why you apply this job?"}, {"date": "11 Oct 2018", "title": "Career Services Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at University of Portland", "Interview Descriptions": "At first, I thought this was a very standard interview process. I submitted my application and was invited for a 30-minute phone interview a couple weeks later. The phone interview was with the director and the person leaving the position I was applying for. They asked standard questions, very simple.\r\n\r\nThen I was invited for an on-campus half-day interview. I had a panel interview with the office staff, a panel interview with community partners, and a 1:1 interview with the associate VP. These all went fine, very standard behavioral questions about what I would do in certain situations.\r\n\r\nI was emailed several days after with a final project that candidates \"were recommended but didn't have to\" complete. This consisted of creating infographics and an email based on a dataset I was given. It was a little strange, but easy enough for me so I did it.\r\n\r\nAnother week went by, and I received a very generic voicemail from the director saying they decided to move forward with another candidate. After a couple weeks, I looked on their website to see who they hired for the position, and this is what made me really angry. They decided to promote an internal candidate from their office to the position. Normally, I think this is fantastic, I think we should always promote internally when we can. However, this person was on my interview panel, and a big part of the interview process for me! Something is very wrong and inequitable about this. If you have a strong internal candidate, they absolutely should not be involved with the interviews of other candidates. I'm glad I didn't get the job because I don't want to work for people who promote inequitable practices.", "Interview Questions": "How would I engage community partners?"}, {"date": "4 Oct 2017", "title": "Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Portland (Portland, OR)", "Interview Descriptions": "Catholics need not apply? That's the baffling feeling I took away from this experience.  I was asked, \"Why University of Portland?\" regarding my interest during the interview, I then proceeded to share that as a Catholic I'm drawn to the College's mission. With my response I was told by those interviewing me that they personally were not Catholic and that \"about 50 percent of employees are not Catholic.\" Awkward. Things  felt rushed and uncomfortable after this. The questions were pretty standard interview questions concluding with a quick tour. The process took approximately  25 minutes. Weeks later I received a phone call, leaving a message to call back. I returned the call to be informed I wasn't selected for the position but was told my resume was impressive. Awkward. I had applied for another position there, same department, but HR  rejected me for that with an email with no interview. I don't understand why the experience was so uncomfortable. Needless to say I will never apply for another position there again.", "Interview Questions": "Tell us why you want to work for the University of Portland."}, {"date": "13 Feb 2017", "title": "Circulation Supervisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Portland (Portland, OR)", "Interview Descriptions": "45 min interview with two people. Questions were pretty straight forward about library circ. This was all followeday with a tour of the library and work areas. Nothing too hard at all.", "Interview Questions": "What is your previous experience in a library?"}], [{"date": "1 Oct 2017", "title": "Student Library Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at University of Portland (Portland, OR) in Jan 2016", "Interview Descriptions": "I was contacted and scheduled an interview for the next day. It lasted 30 minutes, and they asked me very generic customer service questions, along with questions about my past experience and how it relates.", "Interview Questions": "Give an example of a time you experienced great customer service."}, {"date": "11 Oct 2011", "title": "Residential Computer Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at University of Portland (Portland, OR) in Feb 2011", "Interview Descriptions": "The interview was a 1:2 panel format for around 45 minutes.  Interviewers were friendly and responsive and took lots of notes during the process.  Most of the questions were focused on how well you as the interviewee would fit into the culture on campus.  Other areas of focus related to team dynamics and leadership experience.", "Interview Questions": "Tell us a bit about yourself.  "}, {"date": "26 Nov 2013", "title": "Adjunct Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 5 days. I interviewed at University of Portland in Jul 2009", "Interview Descriptions": "I met with the chair of the department.", "Interview Questions": "I don't remember. The interview was very casual. The chair was/is a very personable man."}]]