[[{"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Global non-profit in Singapore", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "23 Feb 2023", "job_title": "Fundraising Assistant in Singapore", "duration": "N/A", "pros": "You can make an impact to the environment through your work. Flexibility.", "cons": "Package may not be as competitive as in a for-profit company."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 4, "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Great company.", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "18 Mar 2023", "job_title": "Senior Digital Specialist in Singapore", "duration": "N/A", "pros": "Great team. Flexible working hours.", "cons": "Career progress is difficult for some employees."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great Organization", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "9 May 2022", "job_title": "Video Intern in Singapore", "duration": "N/A", "pros": "Committed and capable staff who all contribute strongly towards the company. Everyone openly shares ideas and discusses them respectfully regardless of status. It's a very open and inclusive work environment.", "cons": "The pay at WWF might be lesser than other commercial industries due to the nature of advocacy work."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Toxic work environment and too hierarchical", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "18 Feb 2021", "job_title": "Anonymous Employee in Queenstown Estate,", "duration": "N/A", "pros": "You will meet some really passionate people who believe in the cause below senior management who are absolutely amazing.", "cons": "The organisation is very top-down, hierarchical. Senior management does not care about their staff, listen to their opinions, trust that they hired them to do their job and treat them without the respect or dignity they deserve. \r\n\r\nThe board and CEO run the whole organisation and lead the charge in an extremely backward view of conservation. Many of the people the hire include CEO and COO or consultants know nothing about conservation or sustainability and yet boss everyone around like they are running a dictatorship. They are losing valuable, amazing and talented people and they don't care as the treat their jobs like it's a retirement job and it's the last leg of their career. Whereas the people who actually care and want to make real change are being dumbed down, pushed aside and expected to do as asked with no ability to think outside the box what so ever. Forget about career progression unless you are senior management, no promotions at all. \r\n\r\nThe extreme micro-management and approval processes makes a non-profit that is supposed to lead the change absolutely redundant and useless. I have completely lost faith in the integrity and responsibility of the organisation to make systemic change and do its job for the right cause."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": 4, "Career Opportunities": 3, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "well... the entire communications team already left", "rating": "1.0", "reviewer_affiliation": "Current Employee", "job_date": "11 Jul 2021", "job_title": "Communications Specialist in Singapore", "duration": "N/A", "pros": "worldwide brand and good to have on your cv", "cons": "The bad reviews here are very true. Well, you can tell because the people quit every week. The marketing team has been down to 4 people and all overworked with no direction in mind and is expected to report to a power hungry past army soldier who moonlights as a registered property agent in Singapore. To all of us the heads n ceo have no heart for conservation and no respect for people. Who can blame them.. it is a cushy job and they have to guard it. This ngo is run by a bunch of fame hungry individuals with delicate egos and guess what.... the management ridicules you publicly in meetings and brown noses the mysterious board. every one here is just biding time and looking to jump ship at the next chance but this is maybe a good resting ground using donor money.. disappointing.. DO. NOT. JOIN."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": 5, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Great culture", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "25 Jan 2022", "job_title": "Fundraiser in Bedok New Town,", "duration": "N/A", "pros": "Enjoyable working environment with great colleagues", "cons": "High turnover of employees and low retention"}, {"Recommended": "N/A", "CEO Approval": "Neutral", "Business Outlook": "N/A", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Hierarchical, toxic, power hungry and government serving agenda", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "21 Mar 2021", "job_title": "Anonymous Employee in Singapore", "duration": "N/A", "pros": "The junior level staff is passionate, dedicated and quite frankly, are much more productive than the senior level management.", "cons": "Senior management has no conservation background. In fact, they barely have any NGO background. The rather mysterious board with connections to the government seems to be running the show to please the government and pat them on their back rather than reflect on the real environmental issues of our time. \r\n\r\nWhat is even worse is that anyone in an implementer position is paid terribly, with little or no chance of career development and growth. In contrast, while nobody really knows where donor money truly goes, senior management get paid expat level salaries and seem to be easily promoted, even though they do no work.\r\n\r\nIf you're looking to join at a junior level because you are passionate about the cause, please look elsewhere. This is a sweatshop that will dry you out to fill senior management pockets with donor money and keep the government happy."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 1, "Diversity and Inclusion": 4, "Career Opportunities": 3, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Nice colleagues, awful employers", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "2 Aug 2021", "job_title": "Anonymous Employee in Singapore", "duration": "N/A", "pros": "- Great work life balance\r\n- Globally respected and renowned organization\r\n- Donor funded", "cons": "- Executive committee distant & not very kind \r\n- They find ways to make your lives a living hell if you even try to raise questions\r\n- Slow pace of work\r\n- No growth opportunity in experience or salary\r\n- Many politics\r\n- Almost every one has left the teams, even HR"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": 0, "Career Opportunities": 0, "Compensation and Benefits": 5, "Senior Management": 0, "review_title": "Neutral", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "31 Dec 2021", "job_title": "Fundraising in Singapore", "duration": "N/A", "pros": "Health benefits,nice colleagues,Nice environment,Dental benefits", "cons": "Upper management,Management,singapore organisation well being"}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "This place never fails to disappoint", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "21 May 2021", "job_title": "Anonymous Employee in Singapore", "duration": "N/A", "pros": "Junior staff can be quite passionate and enthusiastic!", "cons": "- The pay is a joke. You can expect to hear how the management is \"reviewing the salary structure\", it's a lie. I have heard this for over a year and the only salary bumps you will see happening are your friends’ who do not work in WWF. There is literally ZERO adjustment to your salary unless you get promoted, and even then the pay raise is ridiculously low. What this means is that if you factor in inflation, your purchasing power is literally decreasing year by year. Meanwhile, whatever money the organisation does have goes into hiring consultants who are paid to do the jobs of the management themselves. I get that you don’t enter an NGO for money, but at the very least, shouldn’t a company provide fair wages? What makes this fact even harder to swallow is that we actively advocate for businesses to pay their employees fairly as required by sustainable certifications, but we fail to hold ourselves to the same standards. After seeing this happening for so long, I have decided to stop all my donations to this place. I would rather burn this money than continue giving it away to this bunch of self-serving people.\r\n\r\n- Big egos and a complete lack of understanding towards conservation amongst the management. The former could be addressed if the people in question are willing to learn but unfortunately the majority choose to remain wilfully ignorant or outright refuse to bother. The situation is exacerbated when the management attempts to run this organisation like a private business (e.g. a bank) or like an army. Some of the C-suite level/directors are unable to take no for an answer and will retaliate to make your life utterly miserable. The rest are too scared to stand up for what's right and will simply watch as this happens. Pretty ironic considering how this company claims that its values include courage and integrity. The management fails to see that conservation includes more than protection of habitats, it includes educating the public, holding businesses and governments accountable for their actions. Granted that Singapore’s politics are harder to influence; this does not mean impossible. However, since the board and even some members of the management have connections with the politicians, they are leery of anything that could be seen as “criticism”. So if you are looking to change Sg in this manner, look elsewhere. There are local NGOs who do a better job than this place.\r\n\r\n- Lack of communication, transparency and trust. This organisation has a nasty habit of springing bad news and key developments/changes (e.g. the changing of our 13th month pay) last minute, usually in the late evening or at night on a Friday. Announcements are made with no proper brief, no proper FAQs and employees are just supposed to roll with it. If this is a tactic to evade potential backlash and give employees time to adapt during the weekend, I would advise you to fire your HR team or whoever that gave you this bright idea. All this does is ruin your employees’ rest as they unnecessarily panic. We often do not know what goes on amongst the management and what are their plans (to be fair, they probably have no idea what they are doing either) – we are just supposed to execute. Which would be fine, but often times the decisions made are irrational and a waste of donor money. By the way, town halls are not an answer – nobody wants to sit through 3 hours long town halls. \r\n\r\n- Here’s a special shout out to the HR team: Nobody trusts you. Nobody. Let’s not even talk about protecting the staff. Let’s just talk about how you fail even at the core tenets of your jobs. Number 1: hiring the right person for the role. More often than not, scummy people are hired (even to your own team) and they can’t even do their jobs right. At one point, we even had a HR head that does not know or bother to learn our local labour laws. Granted that he is now gone, but the fact that he was ever hired proves how incompetent this team, and by large, the management team, is. Number 2: career progression. The lack of progression amongst the junior staff is extremely concerning. Pair this up with the phenomenon where you see incidences of expats > locals being promoted to senior/managerial positions; you get a ticking time bomb. Why are your employees constantly forced to jump through so many hoops to be promoted? If they are already doing above and beyond what their JD is, shouldn’t this be cause for promotion?? Why the over emphasis on the number of years of work exp/services? Why are you not evaluating based on competency and achievements? 3: Employee retention. In the first quarter of the year, the number of people leaving this organisation is in the double digits and this does not seem like it will end. Isn’t this high time to take a good hard look at yourself and admit where you are screwing up? It’s not hard, you can dig up the recent exit interviews.\r\n\r\n- Double standards. New employees are expected to have the necessary skills/knowledge to do their jobs when they are hired. Afterwards, they have a probation period to evaluate and confirm that they know how to do their jobs. I don’t think this requirement is being imposed on our management. We have seen two CEOs now that do not know or understand conservation work despite the fact that they have been in position for about a YEAR. We have seen directors that frankly speaking, do not know what conservation is as well. While we do not expect them to possess deep technical knowledge, it is disturbing that they don’t even understand the bigger picture or what their team is doing. BY THE WAY, your staff knows when you are fluffing. We say nothing because we don’t want to get fired. Just know that is incredibly frustrating because it makes us wonder – why on earth are you paid at this level when you can’t deliver? Educate yourself and stop wasting our time and the organisation’s money. \r\n\r\nI can go on and on but I am exhausted. We all are, which is why we are all leaving one by one. Good luck to all who enter, I do not wish this place on my worst enemy."}], [{"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Fantastic Organisation to work at!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "20 Aug 2021", "job_title": "Senior Manager%2C Fundraising in Tanglin Hill,", "duration": "N/A", "pros": "Staff centric working environment that does amazing work to save the planet’s environment.", "cons": "I honestly cannot think of any."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 0, "Diversity and Inclusion": 0, "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "Rating", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "20 Sept 2021", "job_title": "Specialist in Singapore", "duration": "N/A", "pros": "Colleagues are nice and friendly", "cons": "Management level is messy.\nSilo structure"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": 3, "Career Opportunities": 3, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Underpaid", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "22 Mar 2021", "job_title": "Director of Operations in Singapore", "duration": "N/A", "pros": "Flexible with global mobility opportunity", "cons": "Long hours and limited career growth"}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Coordinator", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "18 Sept 2019", "job_title": " in Singapore", "duration": "N/A", "pros": "Working with passionate people all over the world\nSome industry experts to learn from\nNGO mindset and environment", "cons": "Everyone is too busy with ones own work, collaboration is challenging \nBureaucratic \nInstability of the work due to lack of funding at times\nSome strong egos around playing turf war and power games"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 1, "Senior Management": 4, "review_title": "Global Payments and Data Strategy – Implementation Lead", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "6 Mar 2015", "job_title": "Global Payments and Data Strategy – Implementation Lead in Singapore", "duration": "N/A", "pros": "Earth Hour. A small dynamic team working on implementation digital solutions across the globe for a complex network of country teams.", "cons": "Low pay and limited responsibility."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Fantastic", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "8 Mar 2020", "job_title": "Finance Operations Manager in Singapore", "duration": "N/A", "pros": "Great cause for the environment and wildlife.", "cons": "Funding restrictions and contant restructuring"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Great", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "14 May 2020", "job_title": "Legal Counsel in Singapore", "duration": "N/A", "pros": "Good work life balance, Good work environment", "cons": "None that I can think of"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "WWF", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "3 Aug 2019", "job_title": "Marketing Communications Manager in Singapore", "duration": "N/A", "pros": "Great culture and for a good cause", "cons": "Nothing specific that needs mentioning"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "None", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "19 Aug 2020", "job_title": "Sustainable finance intern in Singapore", "duration": "N/A", "pros": "Good team and working environment", "cons": "None that i can think of"}]]