[[{"date": "8 Dec 2022", "title": "Relief Counselor Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at ServiceNet (Amherst, MA) in Nov 2022", "Interview Descriptions": "easy, they ask you your previous experience and when you’ve worked with people with mental illness before, asked about how i deal with difficult situations. They didn’t ask many questions they just went over responsibilities", "Interview Questions": "Have you ever worked with people with mental illness before?"}, {"date": "29 Oct 2022", "title": "Occupational Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at ServiceNet", "Interview Descriptions": "My interview was for an early Intervention position. The interview was straight-forward and laid-back. The interviewer was kind and not one trying to \"trick\" or \"stump\" you. Overall, a good experience.", "Interview Questions": "Why would you like to work with young children?"}, {"date": "13 Jan 2022", "title": "Mental Health Residential Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at ServiceNet (Hadley, MA) in Dec 2021", "Interview Descriptions": "It was super quick and simple. It was done over zoom and everyone was pretty friendly. They ask super basic stuff, it’s by no means difficult to get a job there. You can get a great feel for the culture of the work environment by the interview.", "Interview Questions": "Do you have a history of working with individuals with a mental illness?"}, {"date": "27 Jan 2020", "title": "Systems Administrative Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at ServiceNet", "Interview Descriptions": "Applied via Indeed. They asked me to fill out a fairly long survey, maybe 20-25 questions that asked about experience. I took the time to fill this out and didn't have any further communication from the company. Just saw the position was reposted. I would not waste my time with these guys as they don't seem like a serious employer. If I know anything, a crappy HR department usually means a crappy company culture.", "Interview Questions": "N/A"}, {"date": "21 Aug 2019", "title": "Mental Health Clinician Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at ServiceNet in Apr 2019", "Interview Descriptions": "I got a phone call to schedule a a 1:1 interview with the person who would be my direct supervisor, and had a great conversation with her about the job and what work I was interested in doing. I was also able to talk with someone in a similar position at the company.", "Interview Questions": "Tell us about your clinical experience. "}, {"date": "18 Oct 2017", "title": "Counselor Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at ServiceNet (Amherst, MA)", "Interview Descriptions": "Got a response fairly quickly. Was brought to a house where I would be counselor. Talked to the manager in her office for about 15 minutes, it was very casual.  Never met the residents but was given a little info. Was introduced briefly to potential coworkers.", "Interview Questions": "Do you have open availability? "}, {"date": "20 Jul 2017", "title": "Counselor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. I interviewed at ServiceNet (Northampton, MA) in Mar 2017", "Interview Descriptions": "So conversational. Very comfy and low pressure. Just be yourself.  Ask questions, this is a complicated field to work in and many people end up hating it because they don't understand what theyre getting themselves into.", "Interview Questions": "What do boundaries mean to you"}, {"date": "28 Mar 2017", "title": "Case Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at ServiceNet (Chicopee, MA) in Feb 2017", "Interview Descriptions": "Interview started late and about a half hour later, myself and the second interviewer went in to the hiring managers office. We barely got started before being interrupted by both staff and clients. One staffer even decided to join in on the interview.   Interview was very unprofessional and have the interviewee barely any time to respond to the interviewer or ask questions in relation to the position. \n\nAs far as questions go, there were none. Interview was not structured at all. They just told you about the position and all of it was discouraging and negative. They were called and left two separate messages for status of application and no response was given.", "Interview Questions": "No questions asked."}, {"date": "2 Mar 2017", "title": "Residential Counselor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at ServiceNet (Northampton, MA) in Sept 2016", "Interview Descriptions": "I was hired on the spot without any real interview. I applied for the relief position and a few days later I was called in for a meeting. We just discussed pay and what training/orientation would be like. I also had to demonstrate that I knew the English language and could write well. Then I was sent home and waited over a month for the orientation date.", "Interview Questions": "N/A"}, {"date": "8 Oct 2015", "title": "Autism Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at ServiceNet", "Interview Descriptions": "Laid back, fun, conversational. I only had one interview. We talked about my previous experience, the way Reach is structured, and why I wanted to work there. They seemed to know they were interested in hiring me right away, and quickly moved to telling me about the position.", "Interview Questions": "Have you worked with children with autism before?"}], [{"date": "7 Oct 2015", "title": "Case Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 5 days. I interviewed at ServiceNet (Northampton, MA) in Dec 2011", "Interview Descriptions": "Really it felt more like they wanted to ensure I had a pulse and wasn't psycho. Asked about my past, why I wanted to work there and, what qualified me.", "Interview Questions": "Only the standard interview questions, nothing probing."}]]