[[{"date": "28 Mar 2023", "title": "Research Technician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Mount Sinai Medical Center in Mar 2023", "Interview Descriptions": "Super Easy they only asked me basic questions about myself like where I went to school and nothing specific about my resume. It was a very quick interview ending in 5 minutes.", "Interview Questions": "What experience do you have in a lab setting?"}, {"date": "7 Sept 2022", "title": "Grant Manager Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Mount Sinai Medical Center", "Interview Descriptions": "human resource recruiter, meet with hiring manager/department administrator, meet with team/co-workers. it was okay.. can only communicate through the recruiter so if you dont have a good recruiter kind of ruins your chances", "Interview Questions": "why am i job searching"}, {"date": "14 Feb 2023", "title": "Learning And Development Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Mount Sinai Medical Center (Miami Beach, FL) in Sept 2022", "Interview Descriptions": "Had 2 interviews with a presentation in person and then they ghosted me after telling me I did great! So disappointing and very unprofessional. I even sent a follow up email and never heard back. I don’t mind being let down but the worst thing you can do is not say anything.", "Interview Questions": "The typical questions for an interview."}, {"date": "19 Aug 2022", "title": "RN intern  Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Mount Sinai Medical Center", "Interview Descriptions": "Easygoing! They just wanted to learn about me and why MSMC. Process was a Phone interview with the recruiter then a zoom interview with nurse director. I applied for the RN Residency program ", "Interview Questions": "Tell me about why you want to be a nurse? "}, {"date": "5 Jul 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Mount Sinai Medical Center (Miami, FL)", "Interview Descriptions": "My interview was online. Really straight forward. They just want to know about you, your education and how long you’ve been a nurse. They also ask a few clinical related questions.", "Interview Questions": "Priority questions.\nTell me about yourself.\n"}, {"date": "24 Jan 2023", "title": "Occupational Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Mount Sinai Medical Center (Miami, FL) in Oct 2021", "Interview Descriptions": "Normal occupational therapy standard interview questions for hospital setting and general background experience for students and fieldwork experience as well as long term professionals. Inpatient unit experience acute care experience and regulations", "Interview Questions": "What got you into OT"}, {"date": "23 Dec 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at Mount Sinai Medical Center in Aug 2021", "Interview Descriptions": "Very professional, they made me feel comfortable and confident. I had the interview and about a week later they sent me an offer and I accepted. After that it was very easy.", "Interview Questions": "Why I would like to work for this company"}, {"date": "28 Dec 2020", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Mount Sinai Medical Center", "Interview Descriptions": "Interview with the floor director was very straight forward. Asked about typical interview questions such as my strengths and weaknesses. Made me feel very comfortable as if we were having a normal everyday conversation.", "Interview Questions": "What would you consider strengths and weaknesses? \r\nWhy did you choose to become a nurse? \r\n"}, {"date": "22 Oct 2019", "title": "Network Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Mount Sinai Medical Center in May 2019", "Interview Descriptions": "Process was smooth. Had a call with recruiter and then manager.  The interview then was setup on skype. Questions were based on what I have worked till now and network technologies", "Interview Questions": "TCP/IP and UDP"}, {"date": "11 May 2023", "title": "Computer Science Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Mount Sinai Medical Center (Miami, FL) in May 2019", "Interview Descriptions": "After application, they will send email for an interview in person where you will meet the head of departments that you may be working with and do an intruduction of yourself, what you study and why you apply to position", "Interview Questions": "Why did you apply for this position? What previous experience you have? Why pick them over other companies?"}], [{"date": "31 Jan 2019", "title": "Collector Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "The process took 1 week. I interviewed at Mount Sinai Medical Center", "Interview Descriptions": "Long and drawn out. The interview had nothing to do with the job at all\r\nLong and drawn out. The interview had nothing to do with the job at all. The end", "Interview Questions": "N/A"}, {"date": "19 Jun 2018", "title": "IT Associate Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 months. I interviewed at Mount Sinai Medical Center (Miami, FL)", "Interview Descriptions": "I met them at FIU career fair. Then I got invited to an info session, they did a quick interview with everyone after the session. Then I got an email saying I was selected to take the assessment. Then several weeks later I got a call for a final panel interview. The panel interview was pretty easy. After 2+ months I got an email saying I was rejected. Their communication is horrible.", "Interview Questions": "What do you know about mount sinai?"}, {"date": "19 Oct 2017", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Mount Sinai Medical Center (Miami, FL) in Oct 2017", "Interview Descriptions": "HR called me yesterday and a very brief interview done over the phone and she set me up for personal interview the next day. Today i met her@ 8:45am supernice lady👍 and we went over some details on my resume. Took about 10 minutes and referred me to interview with the nursing director. I was interviewed by a nursing director and a team leader. Both of them were very proffessional, kind, and super humble!!!all i can say is everyone there were so friendly so i felt very comfortable🤗. The entire interview process was formal and questions were based on hospital scenes and i took 30 minutes on this process.HR called me same day at 4:30pm telling \" congratulations\"!!! The rest is history💃", "Interview Questions": "-What was the most difficult task you had and how were you able to fix it?\r\n\r\n"}, {"date": "21 Nov 2017", "title": "RN Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Mount Sinai Medical Center (Miami Beach, FL) in Oct 2017", "Interview Descriptions": "Interview with recruiter over the phone then Hr on the phone and in person and then floor with floor manager and charge nurse 2 panel interview. Great atmosphere nothing to be nervous about, they make your feel comfortable", "Interview Questions": "Basic questions some behavioral but not many"}, {"date": "29 May 2017", "title": "Patient Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Mount Sinai Medical Center (Miami, FL) in May 2017", "Interview Descriptions": "I applied directly on their website. Got an interview within a week and hired the following week. First interview with HR, second interview with a panel of managers, third interview with panel at the actual doctor's office all on the same day. Very professional, organized and efficient. Positive and welcoming attitude. No medical background is required. Speaking Spanish is helpful but not required. Be prepared to spend a few hours. Parking is validated.", "Interview Questions": "How would you deal with irate patients?"}, {"date": "19 Aug 2016", "title": "Medical Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Mount Sinai Medical Center (Miami, FL) in Jul 2016", "Interview Descriptions": "The interviewing process was not bad, was surprised I wasn't the one they employed, but the interviewer said I will be contacted if they don't get along with the hired one", "Interview Questions": "If I have transportation to go back and forth?"}, {"date": "25 Aug 2016", "title": "Medical Coder Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Mount Sinai Medical Center (Miami, FL) in Apr 2016", "Interview Descriptions": "I was interviewed for other positions, but since I had a CPC certification, they asked if I would like to take the coder assessment test. I was very excited since I didn't have the experience that was advertised. I came back for assessment and had the opportunity to interview with the hiring manager. It was a great interview, but unfortunately I did not get hired.", "Interview Questions": "Since I had previous managerial experience, would I be happy in a non-managerial position."}, {"date": "1 Jun 2015", "title": "IT Associate Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 3 months. I interviewed at Mount Sinai Medical Center (Miami, FL)", "Interview Descriptions": "I met them at a career fair at FIU. If they like you, they invite you to an information session. Afterwords, if you meet the requirements (and again if they like you), they invite you to an interview with HR and to take an assessment. If you pass the assessment, they invite you to a panel interview. After all of that, I was dropped. It was a very long and tedious process. They barely give you information, no feedback, you're in the dark on this one. During the interview, there was construction, so I was talking/listening over drilling noises. Fun stuff.", "Interview Questions": "What do you know about Mt. Sinai?"}, {"date": "11 Nov 2016", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Mount Sinai Medical Center (Miami, FL) in Jun 2015", "Interview Descriptions": "Interviewed by unit manager and team leader.  Offered position same day.  Informal interview process.  Initiially applied online, was called by recruiter to set up interview.  Interview in total was 1 hour.  Spoke with both mgr and team leader for approx 20 minutes, was then offered the position and given tour.  Called back a few days later and accepted position.", "Interview Questions": "What can you contribute to help improve the unit?"}, {"date": "28 May 2015", "title": "Lawson Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied through a recruiter. The process took 4 days. I interviewed at Mount Sinai Medical Center in Mar 2015", "Interview Descriptions": "Talked to the director and interview went alright but they never called me back. Lack of communication. Recruiter said he is going to follow up but never did. They were interested in local candidates I guess.", "Interview Questions": "Lawson skills"}], [{"date": "24 Feb 2016", "title": "Patient Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Mount Sinai Medical Center (Miami, FL) in Jan 2015", "Interview Descriptions": "Apply online\r\nInterview with recruiter, then interview with administrative managers\r\nIf they like you then you interview with the manager of any particular physician office\r\nDrug/Alcohol Test\r\nGet checked out in Employee Health\r\nOrientation first two days", "Interview Questions": "Why do you want to work for MSMC?"}, {"date": "30 Dec 2014", "title": "ER Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Mount Sinai Medical Center", "Interview Descriptions": "Applied online. Showed up to see if there was more I could do. Got an interview on the spot. Did a second interview. Very straightforward and simple. Nothing really to say. It was a very simple process. This was one of the good things about the company.", "Interview Questions": "No difficult or unexpected questions."}, {"date": "17 Jun 2015", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 5 days. I interviewed at Mount Sinai Medical Center (Miami, FL) in Jun 2014", "Interview Descriptions": "The Nurse Recruiter is a very professional and sweet lady. She understands new nurses. After interviewing with her you will interview with the Department Manager. The Department manager will walk you trough the floor and explain the description of the unit. Then they will ask some questions about employment history, job descriptions and some life situations and encounters with patients during clinicals.", "Interview Questions": "Describe a situation where you had a complicated patient how did you handle it?"}, {"date": "16 Jan 2014", "title": "Healthcare Administrative Intern Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Mount Sinai Medical Center", "Interview Descriptions": "Asked basic personal questions and asked about experience listed on resume. Given info about the internship and asked if interested.", "Interview Questions": "No unexpected questions "}, {"date": "20 Nov 2012", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at Mount Sinai Medical Center (Miami, FL) in Nov 2011", "Interview Descriptions": "Called nurse recruiter->Interview with Nurse recruiter->invited to mass interview(40+ applicants in same room with Nurse managers from each unit interviewing)->called back with an offer from recruiter-> physical, PPD (passed) /Accepted the job -> 3 months training including classes and preseptorship.", "Interview Questions": "All of them were pretty expected and typical. Why nursing? Why the unit in specific? Goals as a nurse? Three words that describe you? "}, {"date": "7 Nov 2012", "title": "Analyst Interview", "results": "Declined Offer", "experience": "N/A", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Mount Sinai Medical Center (Miami Beach, FL) in Aug 2011", "Interview Descriptions": "Four interviews & a long test. The place looks run down & the employees unhappy.", "Interview Questions": "N/A"}, {"date": "15 Jul 2014", "title": "Registered Respiratory Therapist Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1+ week. I interviewed at Mount Sinai Medical Center (Miami Beach, FL) in Jun 2010", "Interview Descriptions": "The interview was fine and I was hired several years ago. It's was the orientation that didn't go well. First of all, the people doing the orientations for new employees were RUDE. I came in with new sneaks pants and a dress shirt. 2 hours later they tell me I don't meet the dressed code Bc I had sneakers. They told me to leave and go to human resource. HOWEVER, I saw new nurses dressed in scrubs, flip flops, Jeans etc. A few weeks later I had to do another orientation.  When I was hired I didn't have an updated ID so from my understanding, she told me to bring it after I finish the second schedule orientation.  This time I came dressed, showed up in pants, dress shirt the works. At 10 am, the same rude lady who pulled me out the last time, did it again and rudely said goto human resource and don't return!!!!!  I'll never forget that!!  I went back and she told me I wasn't hired anymore Bc I didn't bring my ID BEFORE ORIENTATION? Which was weird Bc I thought she told me to bring it the day of orientation? I had it that day and showed her. She looked at me and said sorry they decided to not hire me.  I explained to her she never told me there was a dressed code, I was drressed nicely both times and at both orientations I attended, there were nurses in scrubs , jeans, flip flops etc. Why are nurses getting special treatment? Not too mention I saw new nurses come to the orientation hours late and they were not asked to leave!!! I would never reapply again from that experience. Besides they are paying 1990 wages. Not worth my trouble if I can't be treated with the same respect as nurses.  I learned that from just being humiliated at ORIENTATION. SAD", "Interview Questions": "Do you work well with nurses?"}]]