[[{"date": "8 May 2023", "title": "Biostatistician Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Satellite Healthcare in Apr 2023", "Interview Descriptions": "I did have an interview with HR Director for the Biostatistician position. The interview went well and took about 30 minutes. The interview questions are also simple. After the interview, I had to fill out their application and survey again which took another 30 minutes. I did not hear back since then.", "Interview Questions": "Why do you apply to this role? How much do you know about Satellite Healthcare? What are your strengths and weaknesses?"}, {"date": "6 May 2022", "title": "Patient Care Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Satellite Healthcare", "Interview Descriptions": "It was quick, and the interviewers were very nice. Ten days after my application was submitted, they called me to ask for an interview two days after that. They asked me about my experience in healthcare and they asked what I know about dialysis. After the interview, they offered me to shadow the clinic to have an overview about that position.", "Interview Questions": "3 reasons why we should hire you"}, {"date": "21 Apr 2022", "title": "PCT Patient Care Tech Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Satellite Healthcare", "Interview Descriptions": "Got an interview with recruiter the next day then clinic manager the following day. Quick and precise interview. They are responsive and easy to talk to. Learned a lot about the clinic environment through the clinic manager.", "Interview Questions": "Describe a time you handled a stressful situation."}, {"date": "22 Mar 2022", "title": "Human Resources Position Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Satellite Healthcare", "Interview Descriptions": "I am submitting this as constructive feedback, and not with intention to shame.  The following timeline is simply a matter of fact.\r\n\r\n1.) I received a  general email  from a person within the recruiting department on a Thursday  morning asking me for my availability. \r\n\r\n2.) I responded to that Thursday morning email within one hour, and offered my availability for that same day (Thursday) and the next day (Friday). Additionally, I offered to give more slots for the next week, if he needed time for next week. I did not get a response back. This did not bother me - people get busy.\r\n\r\n3.) The next day, Friday, I got a morning email, letting me know (just in general) that he was planning to call me that day, despite him asking for, and me replying with, actual time slots.  \r\n\r\nOK- so I again shrugged this off, giving the hiring team the benefit of the doubt (again), since I am aware people just get super busy and things happen. \r\n\r\n4.) Thus, I ended up waiting practically the entire day....even going as far as informing people in my meetings that I may need to abruptly get off since \"I could be getting an important call at any time\". I never got a call. Although. I was very bothered by this, I again give the benefit of the doubt. I have recruited people before and I haver forgotten to call people back before. \r\n\r\n5.) On Sunday, March 20, having heard nothing back thus far, I sent another follow up email, offering time slots for both Monday March 21 and Tuesday March 22.\r\n\r\n6.) I received no correspondence Monday March 21. I told myself that I think I needed to submit feedback if I don't hear back by COB March 22.\r\n\r\n7.) It's now March 22 COB and I still have not heard back. True to my word I decided to submit this feedback.\r\n\r\n8.) I only decided to write this review after Step 6. I am really disappointed about the whole situation and hope that they take my feedback and work to improve their hiring process so that other candidates do not have to go through what I went through.", "Interview Questions": "N/A"}, {"date": "8 Jun 2020", "title": "Nephrology Social Worker Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Satellite Healthcare (Los Angeles, CA) in May 2020", "Interview Descriptions": "The interview was brief. The manager seemed uptight and the staff was hard to read. I  followed up once, no response. The whole experience turned me off to the position.", "Interview Questions": "Tell us about your experience working with this population. \r\n\r\n"}, {"date": "29 Mar 2019", "title": "Pct Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1+ week. I interviewed at Satellite Healthcare (San Jose, CA) in Mar 2019", "Interview Descriptions": "The manager asked me about myself.. and that's it. So comfortable talking to him. I feels like i've known him for so long. My interview is on 11am. Tour on the clinic ti'll 12noon. The manager said that i have to wait for 3days for the call if im hired or not.  After 2 hrs.. YES!! 2 hrs the HR called me and gave me the offer. I was on shocked that time.. and YES!! I accept the offer!! April 8 is my orientation and April 15 is the start of my trainning.. im so excited..", "Interview Questions": "what do you love this company?"}, {"date": "16 Feb 2019", "title": "Registered Nurse, BSN Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Satellite Healthcare (San Carlos, CA) in Feb 2019", "Interview Descriptions": "Was not expected at appt. time.  Interviewer very polite seemed bored and unenthused.\r\nDid not suggest I was not a good candidate although I made my lack of ESRD very clear...\r\nBrought me on a tour, and demonstrated an opportunity to train for the right person.", "Interview Questions": "One question:  Why work with ESRD patients/dialysis?"}, {"date": "10 Sept 2018", "title": "Dialysis RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Satellite Healthcare (San Jose, CA) in Aug 2018", "Interview Descriptions": "First interview with clinic manager. Second interview with 7 person team panel. Each person asked me at least one question.  The doctor asked several difficult questions.  Second interview  was one hour.", "Interview Questions": "Did you ever work someone who irritated you.  How did you handle the challenge."}], [{"date": "9 Oct 2018", "title": "Ccht Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Satellite Healthcare (Kyle, TX) in Jan 2018", "Interview Descriptions": "Long. Very unprofessional , ask personal questions, talk bad about another company, they gossip about their own staff, ask you 20 times why are you applying there for, they tried to intimidate you by telling you they will find out about you", "Interview Questions": "What are you coming here for?"}, {"date": "24 Nov 2017", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Satellite Healthcare", "Interview Descriptions": "Panel interview with the VP, Territory Director, and others. Most of the questions came from the VP. It was a tough interview, but focused.  Lasted about 90 minutes. Returned for an interview with another manager and some of the nurses in the clinic.", "Interview Questions": "Many situational question that were designed to show my Managment style"}, {"date": "14 Sept 2016", "title": "Renal Dietitian Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Satellite Healthcare", "Interview Descriptions": "Long process.  Brief introductory interview via phone with Nutrition Manager, followed by 3 additional interviews (1 with a dietitian, 1 with clinic manager, then panel interview with clinic manager and other team members).", "Interview Questions": "What would be your intervention for patient with high phosphorus and blood sugar levels?"}, {"date": "23 Sept 2015", "title": "Medical Social Worker Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. I interviewed at Satellite Healthcare in Jul 2015", "Interview Descriptions": "Phone screening and then was brought in and told what would be expected of me. I met the social worker who supervises all of the social workers, as well as the social worker I am covering for, and the clinical manager.", "Interview Questions": "What was a challenging case you have had?"}, {"date": "26 Jun 2015", "title": "Social Worker Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 2 weeks. I interviewed at Satellite Healthcare (Larkspur, CA)", "Interview Descriptions": "Very vague interview \r\nEveryone was very nice and helpful \r\nThey showed me around \r\nInterview was very informal \r\nThe interviewer had a list of questions, but sort of just more had a conversation with me", "Interview Questions": "Experience in the medical field"}, {"date": "23 May 2015", "title": "Medical Social Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Satellite Healthcare", "Interview Descriptions": "I had a phone interview and was invited in for an interview with managers. General interview questions were asked, and case scenarios were presented. Formal questions were asked but interview felt more informal, conversational. \r\n\r\nBackground check, drug test, and physical exam required. Hiring paperwork was primarily done online. Convenient and easy process.", "Interview Questions": "General interview questions and vignettes"}, {"date": "10 Jul 2017", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Satellite Healthcare (Laredo, TX) in May 2015", "Interview Descriptions": "Interviewed by clinical manager after being called in for interview.  Pleasant environment setting at office for interview.  Made me feel comfortable.  Lasted a few minutes after disusing my work history and salary.", "Interview Questions": "How are you with working with others."}, {"date": "6 Nov 2014", "title": "Renal Dietitian Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Satellite Healthcare (Vallejo, CA) in Oct 2013", "Interview Descriptions": "The hiring manager called to schedule an interview a couple days after I applied. We scheduled the interview for a few days later. The clinic was not open yet so the hiring manager and some clerks were the only people in the building. The interview was very informal she did not ask me any technical renal nutrition questions. She mainly told me what the job would be and kept asking if this is something I thought I could do. Then when she gave me the tour of the facility it was as if she has already hired me. I left feeling very confused since she spoke as if I was hired but didn't ask enough questions of me to know if I was really a good fit. Two days later she called to say I was not chosen but to apply again in the future.", "Interview Questions": "Tell me about yourself."}, {"date": "19 May 2017", "title": "Chief Operating Officer Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. I interviewed at Satellite Healthcare (San Jose, CA) in May 2013", "Interview Descriptions": "Great as long as you know someone and you are white and able to speak English \r\nLastly are you able to pay rent in the Bay Area\r\n\r\nIt's just a freaking joke gosh what happened to Satellite after Dr. Coplon passed away", "Interview Questions": "N/A"}, {"date": "27 Jul 2017", "title": "Certified Clinical Hemodialysis Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Satellite Healthcare (Modesto, CA) in Apr 2013", "Interview Descriptions": "Basically, the interview was very simple. I was asked about my experience, which was easy to verify because I knew the current DoN since the beginning of my career. I was given a color blindness test, and a questionnaire.", "Interview Questions": "Are you CA State and Nationally certified?"}], [{"date": "29 Jul 2015", "title": "Certified Dialysis Technician Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 5 days. I interviewed at Satellite Healthcare (Gilroy, CA) in Sept 2011", "Interview Descriptions": "Very Brief, toured clinic. Its not what you know, but who you know. Don't be afraid to ask questions about dialysis as a practice even if you have no idea what dialysis is.", "Interview Questions": "How are you in dealing with long, stressful workdays?"}, {"date": "11 Jul 2009", "title": "Home Dialysis Training Nurse Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 2 weeks. I interviewed at Satellite Healthcare (Emeryville, CA) in May 2007", "Interview Descriptions": "1:1 interview with clinical manager.", "Interview Questions": "Do not remember"}]]