[[{"date": "18 Jun 2023", "title": "Custodian Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Towson University (Towson, MD)", "Interview Descriptions": "I am writing this job review to share my experience working as a custodian at XYZ Corporation. Having worked in this role for the past year, I can confidently say that being a custodian has been a fulfilling and rewarding experience overall. First and foremost, one of the highlights of this position is the sense of pride that comes from maintaining a clean and safe environment for both employees and visitors. As a custodian, I played a crucial role in ensuring that the premises were clean, well-organized, and free from hazards. It was satisfying to see how my efforts contributed to creating a pleasant atmosphere and enhancing everyone's experience within the company. Moreover, working as a custodian provided me with an excellent opportunity to develop and demonstrate my organizational and time management skills. With multiple tasks to handle, such as cleaning, restocking supplies, and responding to maintenance requests, I had to prioritize effectively to meet deadlines and fulfill the company's expectations. This experience has significantly improved my ability to manage my workload efficiently. Another aspect of being a custodian that I appreciate is the variety in daily tasks. While the core responsibilities revolve around cleaning and maintenance, I often encountered different situations that required problem-solving and adaptability. From handling spills and unexpected messes to adjusting cleaning routines based on events and activities, each day brought a new challenge. This aspect kept the job interesting and prevented monotony from setting in. I must also mention the positive work environment and the supportive team that I had the pleasure of being a part of. The custodial staff at XYZ Corporation was always willing to lend a helping hand and share knowledge and expertise. It created a collaborative atmosphere where I felt comfortable asking for assistance or guidance whenever needed. The camaraderie among the team members made the work more enjoyable and contributed to a positive overall experience. However, like any job, there were a few challenges that came with being a custodian. The physical demands of the role can be strenuous at times, as it involves standing for long periods, lifting heavy objects, and performing repetitive tasks. While this aspect of the job could be tiring, it also provided opportunities for physical exercise and keeping fit. Additionally, the custodial role often required flexibility in working hours, including evening shifts, weekends, and occasionally being on call. While this flexibility might not suit everyone's lifestyle, I found it manageable and appreciated the chance to have a more varied schedule. In conclusion, my experience as a custodian at XYZ Corporation has been highly rewarding. It has allowed me to contribute to the well-being of the company and its employees, develop valuable skills, and work in a supportive team environment. Despite the physical demands and occasional schedule adjustments, I have found this role to be fulfilling and satisfying. I would recommend it to individuals who value cleanliness, organization, and take pride in their work. I hope this job review provides valuable insights into the custodial position at XYZ Corporation. If you have any further questions, please feel free to ask", "Interview Questions": "Q: Why do you want to work here"}, {"date": "13 Apr 2023", "title": "Student Computing Services Student Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Towson University (Towson, MD)", "Interview Descriptions": "Ask questions to test your knowledge of technology and how you would react in certain scenarios. You don't need to know a lot but knowing more will definitely help. Some of the worker don't even have IT backgrounds and still work there so I wouldn't stress too much on knowing everything IT related.", "Interview Questions": "If a client was to get a virus how would you get rid of it?"}, {"date": "15 Mar 2023", "title": "FYE Section Leader Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Towson University", "Interview Descriptions": "So many questions, around 30 minutes. Interviewer was very kind and basically just wanted to get to know me. Also gave me an opportunity to express what I'd like to do on the job.", "Interview Questions": "Q: How would change the training process?"}, {"date": "1 Nov 2022", "title": "Lifeguard Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Towson University", "Interview Descriptions": "First a skills test including 300 m swim, brick test, and two different rescue scenarios. After that there was a group interview where we each had to answer the same questions", "Interview Questions": "If you could be any animal, what would you be and why?"}, {"date": "6 Oct 2022", "title": "CCA Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Towson University", "Interview Descriptions": "it was okay, would recommend for any student looking for a easy job on campus. pays really good and they are super nice. just remember to have your gpa as high as you can", "Interview Questions": "Q: tell me one think about yourself?"}, {"date": "1 Apr 2022", "title": "Student Computing Services Student Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Towson University", "Interview Descriptions": "The questions are basically asked to gauge your knowledge. They don’t expect you know everything but do expect to learn. The interviewer’s were great too, probably the best bosses i’ve had so far. They actually care and are always there to help you.", "Interview Questions": "What would you do if a client had a virus on their computer."}, {"date": "2 Jun 2022", "title": "Career Councilor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Towson University in Mar 2022", "Interview Descriptions": "Interviewer emailed saying they would like to conduct a first-round phone meeting for Thursday the next week. I replied that was fine ask for \"what time?\" While waiting for the reply, I cleared the entire day to be available. Interviewer never replied. Several weeks weeks later another similar request came. Then ghosting. I would not  want to work with an organization that appears so dysfunctional.", "Interview Questions": "N/A"}, {"date": "16 Feb 2022", "title": "Assistant Professor Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Towson University", "Interview Descriptions": "Day-long interview after I passed a prior screening interview on Zoom. Individual meetings with dept. chair and dean. Taught a short class, presented a research talk, and did standard interview questions with a committee of 4 people. Questions were typical.", "Interview Questions": "Tell us about your teaching philosophy"}, {"date": "4 Apr 2022", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Towson University (Towson, MD) in Jan 2022", "Interview Descriptions": "Was contacted to schedule an interview. Went to an interview with three supervisors of the  research group. Once the interview concluded, I was contacted with an expected date for an offer. A few days later I was presented with an offer.", "Interview Questions": "What experience do you have with Python?"}, {"date": "8 Dec 2021", "title": "Marketing Director Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Towson University", "Interview Descriptions": "Several levels of interviews within the department that I was in; Not only for the position, but on an ongoing process I had to participate in as we hired more people.", "Interview Questions": "Questions about work style; knowledge of specific programs. "}], [{"date": "30 Nov 2021", "title": "Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Towson University", "Interview Descriptions": "There was a phone screener, and then an all day in-person panel interview with a variety of stakeholders. It included meeting with a panel of student leaders, future coworkers, and some senior leaders.", "Interview Questions": "How do your goals align with the university’s strategic plan?"}, {"date": "13 Dec 2022", "title": "Facilities Planner Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Towson University (Towson, MD) in Nov 2021", "Interview Descriptions": "Submitted resume online. Was contacted about coming in for an interview. First interview was a panel interview of 5-6 people, then second interview was with director of department. Human Resources check references and then reached out with a phone call to make an offer.", "Interview Questions": "What would your co-workers say about you?"}, {"date": "17 Oct 2021", "title": "Director of Capital Construction Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Towson University", "Interview Descriptions": "I applied online and received an email about 1.5 months later. They offered 4 time slots for an in person interview -leading me to believe there were 3 other candidates.  The interview was a panel of colleagues who I would work with throughout my tenure.", "Interview Questions": "What experience do you have working in university facilities?"}, {"date": "27 Sept 2021", "title": "Communications Strategist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Towson University", "Interview Descriptions": "An in-person interview was set up over the phone. Met with a group of people and they were all perfectly nice, and questions were pretty run of the mill. What was particularly disappointing was that I never heard a single thing back. If you bring someone in for an interview, the least you can do is let them know that the hiring team is going in a different direction.", "Interview Questions": "The questions were what you would expect, including asking how you might come up with a plan to roll out an event."}, {"date": "27 Sept 2021", "title": "Resident Assistant (RA) Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Towson University", "Interview Descriptions": "there was a interest meeting. then you had 3 rounds of individual interviews with different rlcs. then finallya group interview to see how well you work with other people. it was a very long and draining process.", "Interview Questions": "what are the 5 core values?"}, {"date": "22 Jun 2021", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Towson University (Towson, MD)", "Interview Descriptions": "Applied online, then received email invite to interview.\nWas interviewed by a panel of 4 interviewers. When I arrived at the Interview, I was greeted in the waiting area, then brought back to the conference room.", "Interview Questions": "Q: How do you stay organized?"}, {"date": "17 Jan 2021", "title": "Equipment Manager Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Towson University", "Interview Descriptions": "Very straight forward and inviting throughout the entire process. Was interviewed soon after I applied for the job and met with numerous people in the process. All individuals seemed experienced.", "Interview Questions": "Name some of your previous experiences"}, {"date": "8 Dec 2021", "title": "Director of Sales Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Towson University (Towson, MD) in Jan 2021", "Interview Descriptions": "The interview was held on campus and was fairly relaxed and straightforward. I enjoyed the process, though I did not get an offer. Hopefully I have better luck next time.", "Interview Questions": "What's your favorite part about sales?\nWho inspires you?"}, {"date": "1 Nov 2020", "title": "Lifeguard Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Towson University", "Interview Descriptions": "Must complete an in-water skills test of basic lifeguard skills, then will move on to a group interview, followed by an individual interview if you do well in the previous steps", "Interview Questions": "If you could be any animal, what would you be and why?"}, {"date": "23 Oct 2020", "title": "Student Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Towson University", "Interview Descriptions": "Assisting customers at the Registrar's Customer Service Center counter. \r\nResolving general inquiries and routine questions.\r\nProcess enrollment verifications (e.g. health insurance, auto insurance).\r\nSorting and documentation for Records and Registration Office.\r\nWorking with Towson University Online Service to manage responsibilities (PeopleSoft)", "Interview Questions": "what are your weaknesses? and how did you improve it?"}], [{"date": "30 Jul 2020", "title": "Graduate Program Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Towson University", "Interview Descriptions": "Two rounds of interview, first one was on the phone and they would like to meet me in person. Just some general questions, asked me about my past job duties.", "Interview Questions": "I was aksed to give a mock recruiting presentation."}, {"date": "4 May 2020", "title": "Social Media Marketing Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Towson University", "Interview Descriptions": "The interviewing process was quick and painless. I am only a student employee so that could be why, but I applied for this position and received a response the next day. An interview was scheduled for about a week and a half later, and then about two weeks after that, I received a job offer.", "Interview Questions": "What is your biggest weakness?"}, {"date": "6 Mar 2020", "title": "Resident Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Towson University", "Interview Descriptions": "Long process, but do mock interviews at the career center and a  resume review at the writing center and you will be well prepared! you will mos likely  have three rounds of interviews with different sets of people. Just be confident, have a positive attitude, and give detailed examples.", "Interview Questions": "How would you handle a resident who was negatively influencing your floor.  "}, {"date": "21 Feb 2020", "title": "Graduate Student Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 7 weeks. I interviewed at Towson University (Baltimore, MD)", "Interview Descriptions": "Audiology - Applied online through two separate application portals.\r\n\r\nInvited for an interview soon after applying and had a long tour of the facilities (very impressive).  \r\n\r\nInterviewed with 3 different faculty members for 15 minutes - felt very rushed.", "Interview Questions": "Tell me about yourself."}, {"date": "1 Feb 2023", "title": "Assistant Director Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Towson University (Towson, MD) in Feb 2020", "Interview Descriptions": "Overall, the process took about a month. For Admissions Communication, I was asked to prepare a presentation -- my take on a marketing campaign. At the time, it wasn't apparent to me that I would absolutely not being doing anything remotely close to that.", "Interview Questions": "How do you intend to fulfill the requirements of the position?"}, {"date": "1 Feb 2022", "title": "Guest Service Attendant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Towson University (Towson, MD) in Jan 2020", "Interview Descriptions": "Group interview with other potential employees. Quick and standard interview questions. The interview also consisted of a panel with three of the work supervisors. Overall very routine and painless. No other processes are required.", "Interview Questions": "How do you plan on fitting in with our organization?"}, {"date": "24 Aug 2020", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Towson University (Baltimore, MD) in Aug 2019", "Interview Descriptions": "Overall, the process went as expected. The interview was held with the head of the department, who provied plenty of information regarding  the expectations of the position, a review of my qualifications, and a discussion regarding any concerns or questions I had regarding the position. Feedback about the interview and the position was provided promptly.", "Interview Questions": "What motivated you to apply for this position?"}, {"date": "1 Apr 2019", "title": "Administrative Assistant I Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Towson University (Towson, MD) in Mar 2019", "Interview Descriptions": "Interview process was good. Panel interview, everyone made me feel comfortable and welcome. They are still in the interview process so I won't know for a few weeks if I am selected for the position. I very much hope that I am, it seems like a wonderful place to work and the staff were very down to earth and I got the feeling that the team worked well together.", "Interview Questions": "One thing that was ask of me was why I wanted to work there and how past experiences qualified me for the position."}, {"date": "7 Mar 2023", "title": "Marketing Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Towson University in Mar 2019", "Interview Descriptions": "For my department, very long process. day long interviews with different committees. Once hired, you had to participate in committee hiring panels constantly for open positions. it was hard to get work done.", "Interview Questions": "What are your strengths and weaknesses"}, {"date": "4 Oct 2018", "title": "Adjunct Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied in-person. I interviewed at Towson University", "Interview Descriptions": "There is no interview, just submit the resume and apply. The department chair will check your resume and approve you to teach. You must apply in person and do it a few months before the start of the semester.", "Interview Questions": "There is no interview, just submit the resume and apply "}], [{"date": "15 Dec 2022", "title": "EMPLOYER RELATIONS INTERN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Towson University (Towson, MD) in Sept 2018", "Interview Descriptions": "The interview process was seamless. I could see that they cared about my personal career growth and the interviewers were very friendly. Since this job was tailored for students, the questions weren't very hard. They wanted to learn more about my high school jobs.", "Interview Questions": "What my top strengths were"}, {"date": "7 Nov 2020", "title": "Operational Research Fast Stream Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Towson University (Towson, MD) in Apr 2018", "Interview Descriptions": "The employer made me feel comfortable with the questions being asked and the process was fast. I was able to easily communicate with the interviewer and they offered many scenarios of work roles that I can achieve based on what I was interested in.", "Interview Questions": "What is your greatest strengths in the workplace? What is your weaknesses? "}, {"date": "19 Sept 2018", "title": "Contractor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Towson University (New York, NY) in Feb 2018", "Interview Descriptions": "When there are multiple formulas for a calculated item, the default formula that was entered when the item was created has the calculated item name in column B. For additional formulas for a calculated item, column B contains both the calculated item name and the names of intersecting items.\r\n\r\nFor example, you might have a default formula for a calculated item named MyItem, and another formula for this item identified as MyItem January Sales. In the PivotTable, you would find this formula in the Sales cell for the MyItem row and January column.", "Interview Questions": "N/A"}, {"date": "23 Jan 2018", "title": "Assistant Professor of Mathematics Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Towson University", "Interview Descriptions": "Initial interview (can either be face to face, or via skype/phone call), campus visit with teaching/research presentation, meeting with faculty members/dean/HR, offer, and negotiation. All regular process, professional arrangement, fast processed.", "Interview Questions": "How do you handle your class?"}, {"date": "13 Mar 2022", "title": "Assistant Professor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Towson University (Towson, MD) in Jan 2018", "Interview Descriptions": "Interview was fine, however it was grueling. teaching talk, research talk, and one on one with every faculty member. After the interview, I was never informed I didn't get the position.", "Interview Questions": "All the typical questions associated with academic jobs. "}, {"date": "29 Nov 2017", "title": "Support Desk Worker Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Towson University", "Interview Descriptions": "Walk in interview, where the head asked you a couple IT questions, that seem to be random per each interview.  Walk in interview, where the head asked you a couple IT questions, that seem to be random per each interview.", "Interview Questions": "What is safeboot"}, {"date": "27 Sept 2017", "title": "International Admissions Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Towson University (Towson, MD)", "Interview Descriptions": "General interview questions. Supervisor who interviewed me was super nice! She encouraged the interviewer a lot and gave student lots of choices for working hours. She would teach you a lot after you got hired.", "Interview Questions": "Tell me about yourself. "}, {"date": "8 Feb 2019", "title": "Community Center Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Towson University (Towson, MD) in Sept 2017", "Interview Descriptions": "easy and fun. The interview process was not hard and as long as you have the right mindset you will get the job. the hardest part was actually getting the interview. I would say become friends with your RA and get them to recommend you", "Interview Questions": "whats your major "}, {"date": "7 Feb 2018", "title": "Student Philanthropy Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Towson University (Towson, MD) in Jun 2017", "Interview Descriptions": "Seemed okay during the process, but interviewer was a little pretentious and when asking questions VERY specific to this roll would not give any clarification when I didn't fully understand what she was looking for.  This women also looked up to see if I was a donor to my alma mater and when she saw I was not on this donors list decided that I could not do the job because, \"how was I supposed to effectively raise money for the university (from students...which is stupid anyway) when I myself did not contribute to my own as an alumna\".  This is the feeback I got after not recieving an offer.    This women did not give me any opportunity to speak to why I had ZERO extra funds, gave back to my university as volunteer staff of a campus ministry, and just looked this up sneakily and made up her mind.  She was incredibly arrogant.", "Interview Questions": "What is an example of student engagement?"}, {"date": "30 Jun 2021", "title": "Graduate Assistant - GSA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Towson University (Towson, MD) in Apr 2017", "Interview Descriptions": "The interview was smooth, the team is very nice and ready to help you. Many projects are going on that you can help on. There are students from other fields that you will share the tasks with.", "Interview Questions": "Q: Previous experience in the field?\nQ: What are you most excited about studying in Towson University?"}], [{"date": "24 Jul 2020", "title": "Client services operations assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Towson University (Towson, MD) in Mar 2017", "Interview Descriptions": "5 people asking questions rotating each asking something different about different types of customer service situations. They then asked what my experience was to the related field and to see what my availability was like while school was not in session. They said that school came first and were very flexible when it came to that sort of thing.", "Interview Questions": "Could i work summers"}, {"date": "31 May 2019", "title": "Resident Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 3 weeks. I interviewed at Towson University in Mar 2017", "Interview Descriptions": "Three rounds. In-depth questions and creative problem-solving. You have to be prepared to answer a lot of examples based questions. You have to answer scenario questions and try to imagine certain instances", "Interview Questions": "How would you deal with an emotionally unstable resident?"}, {"date": "5 Apr 2017", "title": "Early Childhood Adjunct Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 2 weeks. I interviewed at Towson University (Baltimore, MD) in Jan 2017", "Interview Descriptions": "The interview was very informative.  I was given enough information that when I got the job, I was ready to get started.  I was given a tour and examples of curricula.", "Interview Questions": "About my experience"}, {"date": "27 Sept 2016", "title": "Call Center Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 5 days. I interviewed at Towson University (Towson, MD)", "Interview Descriptions": "It was quick and easy. I got a call from the call center manager to come in for an interview. She asked my questions about my schedule and why I wanted to work for Towson. Ended up getting a call a week later offering me the job.", "Interview Questions": "What is your schedule like? How many hours a week can you work? What leadership positions have you held?"}, {"date": "5 Jun 2018", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Towson University (Towson, MD) in Mar 2016", "Interview Descriptions": "Not much of an interview process for me. I knew the boss, but it was understood my prior experiences would come into my success in the position. Not many people I know have had to interview for this specific position.", "Interview Questions": "Would you want this job?"}, {"date": "21 Mar 2019", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 3 days. I interviewed at Towson University (Baltimore, MD) in Mar 2016", "Interview Descriptions": "It was pretty easy a short phone interview, they were super nice \r\nand after interviewed they have sent me an email to passed the interview and finally, I got hired", "Interview Questions": "Why are you interested in the job?"}, {"date": "19 Jun 2018", "title": "Intern - Hourly Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Towson University (Towson, MD) in Jan 2016", "Interview Descriptions": "It was simple, just go in with a positive attitude looking to learn and they will hire you. They are not looking for people that are experienced, but it does not hurt if you do have some. They will usually give you a tour of the facilities and show you the equipment they use. You may even talk to some of the higher ups if they are there.", "Interview Questions": "Have you used a camera before"}, {"date": "11 Sept 2018", "title": "Instructional Designer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Towson University (Towson, MD) in Jan 2016", "Interview Descriptions": "I had a phone interview first. They just asked me some basic questions about my previous job and then a face-face interview. In face-to face, they asked me about my experience and difficult situations that I have faced.", "Interview Questions": "Work history, Define teaching"}, {"date": "28 Jul 2015", "title": "Assistant Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Towson University (Towson, MD)", "Interview Descriptions": "Standard interview for academia. Applied and sent CV, essays, and letters of recommendations. Got a call from the search committee chair to schedule interview on campus several weeks later. They paid for flight and put me up in a hotel near campus. Had meetings scheduled with committee and larger department. Did job and research talk that was pleasant and well attended. I thought everything went well. No unexpected questions. Got a call several weeks later from the chair offering me the job.", "Interview Questions": "Why so you want to work here relative to a research institution?"}, {"date": "25 Jun 2018", "title": "Help Desk Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Towson University (Towson, MD) in Jul 2015", "Interview Descriptions": "Apply online, phone screen, in person interview. Straight forward, a few technical questions. Whole process takes about 30 minutes. Pretty much everyone can get the interview and pass it.", "Interview Questions": "A client's computer is extremely slow, enough that it's unusable, client wants to backup their files what do you do?"}], [{"date": "21 Sept 2015", "title": "Front Desk Receptionist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Towson University in Jun 2015", "Interview Descriptions": "it was a very simply process. Questions were your average interview questions. It was a one day interview process. You just answered a few questions and had to sign a few paperwork", "Interview Questions": "Describe yourself"}, {"date": "17 Nov 2015", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 1 week. I interviewed at Towson University (Towson, MD) in Mar 2015", "Interview Descriptions": "I found out about the job from a flier seen on campus. I emailed my resume and work samples to the employer. We arranged and in-person interview via email. i had an in-person interview with two supervisors. I received a job offer via email the same day as the interview. I accepted the offer via email. I began working the following week after meeting with HR.", "Interview Questions": "What do you have to offer?"}, {"date": "6 Dec 2015", "title": "Undergraduate Researcher Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 5 days. I interviewed at Towson University (Towson, MD) in Dec 2014", "Interview Descriptions": "I made an appointment through email to meet the lab PI and had to sit down to discuss my interests, goals, and ideas for research projects I would like to do with the lab. I also sat in on meetings with the lab before actually participating in active research to ensure that I would be a good fit for the research interests currently in the lab.", "Interview Questions": "What are my goals for the future?"}, {"date": "2 Nov 2014", "title": "Student Ambassador Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Towson University", "Interview Descriptions": "Receive email for an interview with the program advisor. Once you passed that interview, you would get an email stating whether you got the offer or not. That is all i can think of. It is very simple and straightforward. Questions basically every international student would know.", "Interview Questions": "A program to help international students"}, {"date": "16 Oct 2014", "title": "Resident Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Towson University", "Interview Descriptions": "You have a half-an-hour behavioral interview to figure out if you are open-minded, diversity-appreciating, and have a good moral sense of sticking to student conduct. Then you have the second round group interview in which you are asked to organize an event.", "Interview Questions": "Not really any difficult question. Be yourself. You do not bend who you are to be awarded a position, as it is good to neither you or HRL."}, {"date": "24 Apr 2017", "title": "Front Desk Receptionist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Towson University (Towson, MD) in Sept 2014", "Interview Descriptions": "Very short, less than 10 minutes. The assistant manager interviewed me and it was great and fun. We had a lot of things in common and she had a great vibe.", "Interview Questions": "Talk me through a time where you had to fix an issue in a high stressed situation."}, {"date": "30 May 2018", "title": "Marketing Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Towson University (Baltimore, MD) in Sept 2014", "Interview Descriptions": "The interview was fairly easy. There was a phone interview and then I was called in for a one on one interview. After the interview, I was offered the position in about 48 hours.", "Interview Questions": "Why should we choose you?"}, {"date": "2 May 2017", "title": "Program Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Towson University (Towson, MD) in Aug 2014", "Interview Descriptions": "Phone interview with two supervisors to screen my qualifications, then came to campus to meet entire department. Took part in 3 group interviews: departmental, campus partners, and student leaders. Was taken to lunch on campus and had a tour. The interview process seemed holistic and gave me ample opportunity to learn about the organization.", "Interview Questions": "Why are you interested in working at Towson University over other universities? "}, {"date": "27 Apr 2016", "title": "Learning Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Towson University (Towson, MD) in Jul 2014", "Interview Descriptions": "First there was a phone interview with a panel. It was a little hard to hear everyone, but the interview went well and everyone was pleasant. The campus interview took a few hours and included a campus tour, which the office manager did a very good job on. Included many people, including someone from a satellite tutoring site, so that told me people care about this school and who they hire. A little bumpy here and there with several location changes, but pleasant overall.", "Interview Questions": "What is the hardest part about your current job?"}, {"date": "28 Mar 2016", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Towson University (Towson, MD) in May 2014", "Interview Descriptions": "Professor looks at your transcript and asks you why you want to work using mathematics and what you want to get out of it. They also ask you to brush up on your mathematics skills like calculus and linear algebra.", "Interview Questions": "Why do you want to work here?"}], [{"date": "27 Jul 2016", "title": "Class Monitor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Towson University (Towson, MD) in Feb 2014", "Interview Descriptions": "Well it wasn't an interview at all, he basically told me my job description and I was hired. My friend referred me to this position. I brought my friend along and we were both explain our job responsibilities and we were both given paper work and we were on our way.", "Interview Questions": "He did not ask me any interview specific questions."}, {"date": "6 Oct 2018", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Towson University in Jan 2014", "Interview Descriptions": "You start off with a group panel.\r\nThen you have a month long programming project.\r\nThen a final project review and meeting with the manager.\r\nYou hear back within the next couple of days.", "Interview Questions": "What are your strengths and weaknesses"}, {"date": "16 Oct 2013", "title": "Career Adviser Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Towson University", "Interview Descriptions": "I had a 15 minute phone interview and then a half day interview.  The process went pretty quickly compared to other Higher Education job search processes I have been a part of. During the half day interview I met with the entire Career Center staff,  and some campus partners for a group panel interview.  I also prepared a presentation for that group.  I met with the director for a 1:1 interview.", "Interview Questions": "The very first question during the phone interview was \"What do you know about us\".  I was expecting the first question to be \"Tell us about why you want this position\" so I was thrown for a loop."}, {"date": "29 Aug 2013", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Towson University", "Interview Descriptions": "submitted an application in the office; one casual interview", "Interview Questions": "regular questions"}, {"date": "2 Jul 2013", "title": "Financial Transaction Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Towson University", "Interview Descriptions": "must apply online, sometimes it can be confusing, not sure if your application, resume and cover letter were uploaded", "Interview Questions": "What are your best/worst qualities"}, {"date": "3 Feb 2016", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through other source. The process took 2 weeks. I interviewed at Towson University (Towson, MD) in Jun 2013", "Interview Descriptions": "Traditional application followed by a face to face interview. The hiring manager called spoke to me on the phone about my background and the position. I then came into his office and interviewed with  him. He was very up front about the requirements of the position and made the whole process very positive.", "Interview Questions": "They asked me about my prior experience related to the job and how I would apply it to the position."}, {"date": "6 Jul 2016", "title": "Adjunct Lecturer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Towson University (Towson, MD) in May 2013", "Interview Descriptions": "I submitted CV and portfolio on a flash drive along with samples of former students work and a sample syllabus and references. A few weeks later I was called for an interview with several people over coffee. It was informal but we were there for over an hour. Another month went by and I got an email asking me to teach a class.", "Interview Questions": "About my experience and how I handled different situations. Mostly how I worked with my with students how I ran a class what kind of projects etc... We discussed my thoughts of the field of study. My availability and flexibility."}, {"date": "10 May 2017", "title": "Student Ambassador Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Towson University (Towson, MD) in Apr 2013", "Interview Descriptions": "We met in a room and answer questions on how to handle situation with the prospective families coming to visit the campus. We also talked about my involvement on campus. Whether I had any other jobs or other commitments that wouldn't let me work as a Student Ambassador. Then we just got to know each other pretty well and relaxed to not be so uptight with my boss. Which was nice because this job can get very stressful at times. Either way the hiring/interview process was pretty chill in my opinion.", "Interview Questions": "Are you comfortable with mingling with random families?"}, {"date": "19 Feb 2016", "title": "Phonathon Caller Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Towson University (Towson, MD) in Aug 2012", "Interview Descriptions": "Interview with a supervisor and development associate followed by a mock call. You are provided a script for the call, a time is set up, and you go through it like a normal call.", "Interview Questions": "Why do you want to work for phonathon?"}, {"date": "6 Oct 2015", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Towson University (Towson, MD) in Jan 2012", "Interview Descriptions": "it was Ok. Most of the questions are easy to answer. The interviewer is nice.\r\nNo specific questions. talked about the background and research goals.\r\nThe interview last 1 hour. Got email from him 3 days after.", "Interview Questions": "What is your GPA"}], [{"date": "11 Mar 2013", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 days. I interviewed at Towson University (Towson, MD) in May 2010", "Interview Descriptions": "Meet with several Teachers at Towson about 30min per meeting", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "10 Jan 2013", "title": "Administrative Assistant I Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 8 months. I interviewed at Towson University (Towson, MD) in Dec 2009", "Interview Descriptions": "Application process is tedious.  HR will only respond if you are picked to be interviewed.", "Interview Questions": "All questions were regular interview questions. I was interviewed by a group of 6 people which was unexpected."}, {"date": "8 Jun 2011", "title": "Career Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Towson University (Towson, MD) in Oct 2009", "Interview Descriptions": "Started with a 15 minute phone interview, then invited to come on campus for a full day of interviewing.  Interviewed one-on-one with the director, met with the hiring committee, interviewed (group) by entire staff of center.  Presented a 40 minute presentation on something related to career development.  Followed by a questions and answer period, members from the entire campus were invited to attend presentation.  Went to lunch with the director and then met with the AVP.", "Interview Questions": "If you could invent something to aid in your role (as a Career Counselor) regardless of cost, what would it be?"}]]