[[{"date": "24 Jun 2022", "title": "Developer Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at East Tennessee Children's Hospital", "Interview Descriptions": "The people are friendly and had a more conversational interview style. They wanted to get to know me and my personality to ensure I was a right fit to the team,", "Interview Questions": "Tell us about your previous work experience "}, {"date": "18 Mar 2022", "title": "RN Resident Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at East Tennessee Children's Hospital", "Interview Descriptions": "Open house feel with structured interviews with all nursing units. Very welcoming and created much excitement about working there .  HR staff were great and even had a food spread and gifts", "Interview Questions": "Biggest concern. As new grad "}, {"date": "29 Jun 2020", "title": "Cause Marketing Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at East Tennessee Children's Hospital (Knoxville, TN) in Jun 2020", "Interview Descriptions": "After applying for the job I was very quickly offered an interview. It was with a director and the outgoing person for the position. It was about an hour in length. After about 2 weeks they began to check references and then that week I was offered a second interview. This was with the same people from the interview prior as well as a VP. After 2 weeks they had made a decision.", "Interview Questions": "What are your strengths and weaknesses?"}, {"date": "9 Nov 2017", "title": "Medication Reconciliation Technician Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at East Tennessee Children's Hospital (Knoxville, TN) in Oct 2017", "Interview Descriptions": "I arrived 30 minutes early for my interview. Waited for a while before someone called me to the back. I interviewed with the HR manager. He went over compensation and benefits. I was told that he would email a list of apartments/rental homes near the hospital (I would be moving from another city), but he never did. The pharmacy representative was late to the interview, as noted by the HR manager. I interviewed with 3 pharmacy representatives. Two people did not make it due to inventory/recall issues. I was able to tour the pharmacy and ER. I was on campus from noon until 2:50pm. I emailed over a week later to no avail. I called over a week later and the HR manager  informed me that they were checking another candidate’s references. Three weeks later I received an email stating I did not make the cut. There was no invitation to reapply for future openings like most companies state.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "15 Oct 2017", "title": "Patient Care Assistant Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at East Tennessee Children's Hospital (Knoxville, TN) in Sept 2017", "Interview Descriptions": "The interview was an easy process, discussed benefits with HR, met the hospitals emotional support dog Farley, took a tour. Everyone was very nice and they made sure to answer every question I had to ask. It was very quick and efficient process.", "Interview Questions": "Why should we choose you?"}, {"date": "17 Jul 2016", "title": "Health Unit Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at East Tennessee Children's Hospital", "Interview Descriptions": "Interviewed first with employment specialist who verified dates of previous employment and duties performed. After, waited in HR for second interview with department manager. Both interviews were relatively quick (around 15 minutes) and questions asked were very basic and easy.", "Interview Questions": "Tell me about a time you multi-tasked at work."}, {"date": "26 Apr 2016", "title": "Phlebotomist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 5 days. I interviewed at East Tennessee Children's Hospital (Knoxville, TN)", "Interview Descriptions": "I was called for an interview they went over the benefits package and pay rate .i was hired right away so i went to meet the lab sulervisor and  they showed me around. I went for a drug test and physical and was given the date of orientation and date of hire. It went smooth but that was 19 yrs ago when the hospital was really great!", "Interview Questions": "Tell me why i should hire you and not someone else for the job."}, {"date": "11 Jan 2016", "title": "PBX/Admitting Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at East Tennessee Children's Hospital (Knoxville, TN) in Feb 2015", "Interview Descriptions": "Initially, it took quite some time to hear back from HR despite their need for staff (as I was told). Eventually, I got an interview. It was a one on one, simple questions. I did have to perform a typing test, it is very important that the individual can type more than 40wpm. I was given basic paperwork and a packet explaining benefits and employee review process. I then was interviewed by some PBX/admitting employees. HR seemed pleased with me. I was told I would be called. I did not receive a call from HR, but I was receiving calls from the PBX/admitting department asking why I have not been hired yet. That was frustrating. I emailed and called HR multiple times, only to hear back about 2 weeks later. I did end up being hired. Upon being hired, employees must complete a drug test and pass a background check. There is a mandatory 3 days of orientation, 8 hours each day.", "Interview Questions": "- Why should we hire you?\r\n- Where do you see yourself in 5 years?"}, {"date": "8 Oct 2014", "title": "Inpatient Coder Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at East Tennessee Children's Hospital", "Interview Descriptions": "I interviewed with Human Resources first. These were basic human resource questions (i.e. strengths and weaknesses, a time you had to face conflict at work, etc.). Then, I interviewed with the department manager for medical coders. This was more job specific. I was also required to take a test that showed my skills related to that particular department.", "Interview Questions": "N/A"}, {"date": "26 Sept 2014", "title": "Director of Physician Recruiting Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at East Tennessee Children's Hospital in May 2011", "Interview Descriptions": "The people are very nice but there questions lack originality.  Some of the questions were \"standard\" types of questions that many other people may get in another industry as well.  I felt as if their lack of specific, role related questions did not bode well for my chance of acquiring the job.  I felt as if they were interviewing me as a favor for someone.", "Interview Questions": "Why do you feel that you are qualified to do this job?"}]]