[[{"date": "2 May 2022", "title": "Family Nurse Practitioner Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 3 weeks. I interviewed at LifeLong Medical Care (Berkeley, CA) in Apr 2022", "Interview Descriptions": "Had two formal interviews with chief medical staff (both MDs) . Two kind of “off the books” chats with other providers which I’m not sure the purpose of, no really formal questions just about my experience. No hire, no feedback.", "Interview Questions": "A time when something didn’t go my way with a patient, and how I reacted/saved the situation. "}, {"date": "9 Mar 2022", "title": "ER Medical Scribe Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at LifeLong Medical Care", "Interview Descriptions": "They asked what my aspirations were in terms of medical goals. Made sure that I had worked in intense environments with patients, and also that there is an emphasis in community.", "Interview Questions": "How are you in terms of keeping up communications with your coworkers?"}, {"date": "23 Jul 2021", "title": "HIV PrEP Navigator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 3 weeks. I interviewed at LifeLong Medical Care (Berkeley, CA) in Jun 2021", "Interview Descriptions": "At first, it was a phone interview with the HIV Program Manager. Then, the secondary interview was with the Program Manager, one of the HIV navigators, and the HIV doctor via Zoom. \r\n\r\nThe phone interview had easy questions. The panel interview had some challenging questions, but I answered them to the best of my ability. They said they would get back to me in two weeks, as they were interviewing other people. \r\n\r\nSeveral days later, I was informed that I wasn’t a good fit for the role. I was recommended to interview for another position with lower pay. However, I respectfully declined.", "Interview Questions": "What do you know about Trauma-Informed Care?"}, {"date": "7 May 2021", "title": "Covid-19 Contact Tracer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at LifeLong Medical Care", "Interview Descriptions": "It was very simple and very straight forward. I really felt comfortable with the staff I was going to work with. They asked a lot of questions since it was going to be their first project and they wanted people to be prepared. However, they also had an idea and gave me an overview of how everything was going to be.", "Interview Questions": "What experience do you have with patients?"}, {"date": "13 Jun 2019", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at LifeLong Medical Care (San Pablo, CA) in May 2019", "Interview Descriptions": "You get a over the phone interview the. They ask you to come and and do a 1:1. It’s fairly easy. They do ask a lot of personal questions.", "Interview Questions": "Why did you decide to work in the medical field?"}, {"date": "28 Aug 2017", "title": "HR Generalist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at LifeLong Medical Care", "Interview Descriptions": "Phone and video interview went well with HR generalist, Recruiter and HR Director but never receive any communication regarding the status of my application. They told me I was going to hear something from them via email or phone by the end of the week and never heard anything back.", "Interview Questions": "What do you know about the company?"}, {"date": "16 Sept 2016", "title": "Patient Service Representative Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at LifeLong Medical Care (Berkeley, CA)", "Interview Descriptions": "Recieved a call from a lovely lady. Didnt care for the group interview because people play off your answers. But thats any group interview for the most part. Provided snacks which was a plus. Had us fill out interview questions on paper, no one on one time at all which was different.", "Interview Questions": "What is a fun fact about yourself?"}, {"date": "3 Jul 2015", "title": "Medical Records Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 5 days. I interviewed at LifeLong Medical Care (Berkeley, CA) in Aug 2014", "Interview Descriptions": "Interviewed with 2 higher ups. Behavioral questions. Skills questions especially about electronic medical records and how to use the software. Hypothetical scenario questions. Customer service questions. Overall, it was a good experience.  I knew the interviewers beforehand since I interned there previously, so I had an advantage.", "Interview Questions": "How can you contribute to Medical Records?\r\nDescribe your experience with EHR?\r\nTell me about a challenge and how did you solve it?"}, {"date": "24 Jun 2014", "title": "Data Coordinator Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at LifeLong Medical Care", "Interview Descriptions": "Average interview with middle manager/Director. One on One. Illustrations provided. Manager had a great personality. Comfortable demeanor. In office setting. Took 1 week for interview set-up. about 2 weeks to hire/on boarding.", "Interview Questions": "No difficult questions."}, {"date": "18 Jun 2014", "title": "Administrative Position Interview", "results": "Declined Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at LifeLong Medical Care", "Interview Descriptions": "Submitted resume in a week and was called for a interview a week later. Had an interview with the department which each person asked me questions from a sheet of paper. Very robotic and some of the questions were dated.", "Interview Questions": "I didn't experience a difficult or unexpected question from the panel. The questions were generic. "}], [{"date": "23 Aug 2015", "title": "Compliance Officer Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at LifeLong Medical Care (Berkeley, CA) in Mar 2012", "Interview Descriptions": "it was very long but easy, the people were, the questions were primarily basic .. nothing to brag about.   the interview are really nice and funny. not what i expected ... their was a panel interview where one person was knitting, I found that odd but it said a lot about what I was walking in to but didn't see", "Interview Questions": "Why do you wan to work for the company?"}]]