[[{"date": "16 Jun 2023", "title": "Staff Physical Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Texas Children's Hospital (Houston, TX)", "Interview Descriptions": "Phone interview with recruiter initially. In person interview with manager and Assistant Director of Rehab Dept. Sent follow up emailing regarding position and shadowed another therapist in dept for a week.", "Interview Questions": "Answer multiple questions with STAR formatting. S-situation, T-task, A- action, R- result"}, {"date": "27 May 2023", "title": "Diagnostic Medical Sonographer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Texas Children's Hospital", "Interview Descriptions": "I interviewed at multiple locations and both interviews have multiple people interviewing you . Then after the interview they will make you scan an abdomen complete and explain what you are doing.", "Interview Questions": "1. Tell me a time you were in a stressful situation and how did you handle it ? 2. Why did you pick Texas Childrens ? 3. Why did you chose to go into pediatrics? 4. Where was the hardest clinical site ? 5. What is an accomplishment you are most proud of? 6. Do you feel confident talking to radiologists ?"}, {"date": "31 May 2023", "title": "Nurse Residency Program Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Texas Children's Hospital (Houston, TX)", "Interview Descriptions": "Applied and then they held multiple information sessions virtually to talk about each available unit. Interviews were shortly after. They were held virtually and it was a group interview with managers from a few units covered.", "Interview Questions": "Name a time you advocated for a patient."}, {"date": "22 May 2023", "title": "Senior Epic Application Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Texas Children's Hospital", "Interview Descriptions": "First, it a was minute screening phone call. Then I’m sure if that goes well, they’ll schedule the real interview. I just want to see how the interviews will go and what questions are asked.", "Interview Questions": "N/A"}, {"date": "4 May 2023", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Texas Children's Hospital (Houston, TX)", "Interview Descriptions": "Had zoom meeting with 3 people, overall it was good. They were very straightforward. The questions were mainly about giving scenarios and how you overcome that. I have not yet received an offer interview was last week.", "Interview Questions": "Tell me about a time to faced a challenge at work? Tell me about yourself Tell me about a time you had to work with a difficult coworker"}, {"date": "11 Mar 2023", "title": "Patient Services Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Texas Children's Hospital", "Interview Descriptions": "It went great very relax wasn't nervous felt very comfortable with the person who was doing the interviewing. Felt no pressure we talked about my past work experiences, how long was I at each jobs", "Interview Questions": "Are you a team player?"}, {"date": "10 Mar 2023", "title": "Certified Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at Texas Children's Hospital", "Interview Descriptions": "A recruiter reached out to me, asked me a few questions about my experience, and offered an interview with the manager via Zoom. The interview was very pleasant and the questions weren’t too hard at all. The manager was very kind and she explained the role to me very well. I received a job offer the next morning via email sent by my recruiter.", "Interview Questions": "I was asked about my previous experience as a medical assistant, questions pertaining to the job, strength, weakness, situational questions etc"}, {"date": "10 Mar 2023", "title": "Graduate Nurse Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Texas Children's Hospital in Mar 2023", "Interview Descriptions": "The interview was smooth . Asked me straight forward questions It was a panel interview and each person asked me atleast one question. They were very welcoming . Not intimidating", "Interview Questions": "Why TCH Where do you see yourself in the next 5 years"}, {"date": "25 Feb 2023", "title": "Physician Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Texas Children's Hospital", "Interview Descriptions": "Several zoom meetings prior to a site visit. On site interview with a panel of the team members. Then I stayed on site to see what the job responsibilities were.", "Interview Questions": "Situation with a difficulty when working with others. Situation involving a diffixult superior."}, {"date": "23 Feb 2023", "title": "Clinical Pharmacist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Texas Children's Hospital", "Interview Descriptions": "The day was organized and thought out. They took the time to get to know me. They communicate only through the HR department, so be sure to follow up timely with their team.", "Interview Questions": "Describe a time when you had to change your approach to a problem"}], [{"date": "10 Jan 2023", "title": "Respiratory Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Texas Children's Hospital", "Interview Descriptions": "Everyone was nice and the process was as to be expected. It was not long and drawn out like some can be. They were direct and didn't waste time. Not sure why this needs to be 30 words", "Interview Questions": "What you need for intubation"}, {"date": "2 Dec 2022", "title": "Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Texas Children's Hospital", "Interview Descriptions": "Phone screening with a recruiter to discuss position and initial qualifications followed by a in-depth virtual interview with hiring manager. Third interview was in person with hiring manager, colleagues and additional leadership.", "Interview Questions": "How would your skills translate to this position?"}, {"date": "5 Jan 2023", "title": "Child Life Specialist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Texas Children's Hospital (Houston, TX) in Dec 2022", "Interview Descriptions": "Started with a phone call with a recruiter, then moved onto a phone screen with one of the child life managers. After that, a zoom interview with the same manager and an additional member of the child life team happened. Final meeting was a pseudo-interview/meet and greet with the CCLSs in the specific department", "Interview Questions": "In what ways can you see yourself growing as a member of the team at TCH?"}, {"date": "6 Feb 2023", "title": "Clinical Data Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Texas Children's Hospital (Sugar Land, TX) in Nov 2022", "Interview Descriptions": "Initially a recruiter called me to set up virtual interview with hiring leader. It went great and I was later moved further for the panel interview with the departmental team where I was asked a variety of behavioral questions. That final interview went over an hour and was comprehensive and a great experience.", "Interview Questions": "Tell us about a time you had lead a project"}, {"date": "29 Nov 2022", "title": "Coordinator of Employee Development Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Texas Children's Hospital (Houston, TX) in Nov 2022", "Interview Descriptions": "Applied 10/24/22 was contacted for phone screening 11/3/22. Scheduled video interview for 11/7/22. On the morning of video interview, I was unable to complete due to no contact from recruiter or hiring manager. When I followed up with recruiter the morning of what would have been my interview she informed she was following up with hiring manager and she would give me a call. This went on for three days in which she never called or updated me on what happened. She then ghosted me and I was never able to interview for the role.", "Interview Questions": "Tell me about your experience"}, {"date": "23 Nov 2022", "title": "Claims-Admin Department Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Texas Children's Hospital (Houston, TX) in Oct 2022", "Interview Descriptions": "Applied. Received invite for phone screening 1.5wk later. Phone screen went well. Scheduled video interview following week. Morning of interview no show of hiring manager or recruiter. When I tried to follow up on what happened, was ghosted by recruiter.", "Interview Questions": "Tell me how you'd be a fit for the position."}, {"date": "15 Sept 2022", "title": "Business Development Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Texas Children's Hospital", "Interview Descriptions": "I had two great interviews with the team and was invited back to what I believed was a third and final interview, however I found out that the initial interviewers didn't work there anymore so this was more like another \"first interview\". The interviewer didn't really ask any interview questions. They asked what my thoughts were on another job that I had not applied for, but that they thought I might be well suited for. I ended up receiving a rejection notice for the \"other job\" but never for the one I had actually applied for. I'm still unclear on what happened here.", "Interview Questions": "The first two interviews were pretty standard. I was not asked any interview type questions in the third interview. "}, {"date": "14 Sept 2022", "title": "Senior Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 3 months. I interviewed at Texas Children's Hospital in Sept 2022", "Interview Descriptions": "Initial contact through a recruiter. Had 7 separate interviews with various departmental heads which is pretty standard for a senior level position. Overall was a very thorough in depth interview process. This is a very reputable company and understand the importance of conducting  interviews using  various behavioral or STAR format questions. Make sure to pack your patience, start to finish took around 3 months from initial contact through onboarding process to start date. At the end, I was happy with the outcome and was definitely worth the long wait.", "Interview Questions": "Explain a time when you utilized a MACRO for forecasting?"}, {"date": "15 Aug 2022", "title": "Senior Administrative Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Texas Children's Hospital", "Interview Descriptions": "why post a position if they already know who they are going to give the position too. it almost feels like you have to know someone in order to get a job there.", "Interview Questions": "N/A"}, {"date": "27 Sept 2022", "title": "Registered Nurse, BSN Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Texas Children's Hospital in Aug 2022", "Interview Descriptions": "Started out with them getting to know me and what my experience has been what my current job consists of and then switched to situational scenario based questions. Interview lasted about 20 minutes. ", "Interview Questions": "Name a time you had a conflict with a parent and how did you resolve it? "}], [{"date": "2 Oct 2022", "title": "Scrub Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 1 week. I interviewed at Texas Children's Hospital (Houston, TX) in Aug 2022", "Interview Descriptions": "initially contacted by a recruiter, I wasnt aware that he was a recruiter initially. then i get scheduled for an interview within the same week. phone-video  interviewed with 2 other people", "Interview Questions": "mostly about your easiest and most difficult past work experiences"}, {"date": "15 Jun 2022", "title": "Registered Nurse NICU Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Texas Children's Hospital (Houston, TX) in Jun 2022", "Interview Descriptions": "I got a phone call from HR first and made a appointment for zoom interview.\r\nIn interview, there were 3 nurse managers and they asked behavior questions and answers required following STAR.", "Interview Questions": "How to put priority in a busy situation\r\n"}, {"date": "12 May 2022", "title": "Registered Nurse PICU Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Texas Children's Hospital (Houston, TX) in May 2022", "Interview Descriptions": "I applied online and received a call about a week later. One of the longest interviews I've had. The first hour was with 2 staff nurses, the second hour I shadowed a nurse, and in the third hour I did some more questions with management. Everyone was so friendly and easy to talk to.", "Interview Questions": "Why do you want to work here?\nWhat is your favorite and least favorite thing about your current unit?\n"}, {"date": "7 Apr 2022", "title": "Staff Clinical RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Texas Children's Hospital", "Interview Descriptions": "Interview with management team and peers, situational behavioral questions to determine fit for team. Personable. Able to complete over video call for easy scheduling and availability. Phenomenal recruiting staff that assist with coordinating of interview.", "Interview Questions": "Where do you see yourself in 5 years? "}, {"date": "3 Apr 2022", "title": "Occupational Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Texas Children's Hospital", "Interview Descriptions": "A lot of situation based questions , be prepared with some examples of all different patient situations  (difficult families, conflict in the workplace, a teamwork situation, etc). They also ask about your experience and what kind of workplace you’re hoping to work in", "Interview Questions": "Many situation based questions with a reflection  "}, {"date": "16 Apr 2022", "title": "Patient Tech Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Texas Children's Hospital (Houston, TX) in Apr 2022", "Interview Descriptions": "The process went smoothly, was invited for an interview and I felt I did pretty well. But didn’t get the job.  The pay is good and the experience is even better.", "Interview Questions": "How you work with difficult colleagues "}, {"date": "1 Feb 2022", "title": "Dietitian Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Texas Children's Hospital", "Interview Descriptions": "usually interview with manager and another one with team, star model, lots of questions about situations (situation, task, action, result)\r\nbe prepared to answer to that specifically, lots of online examples", "Interview Questions": "Tell me about a time when you were faced with a challenging situation. ...\r\nDo you usually set goals at work? ...\r\nGive me an example of a time you made a mistake at work.\r\nHave you ever faced conflict with a coworker? ...\r\nTell me about a time when you handled the pressure well."}, {"date": "29 Apr 2022", "title": "Decision Support Analyst Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Texas Children's Hospital in Jan 2022", "Interview Descriptions": "There were three interviews, a screening, a talk with the hiring manager, and a two-panel interview. Each one was fair. The team was really nice. In the panel interview I had to give a presentation on a dataset.  For the most part, a more than fair interview process.", "Interview Questions": "When have you been a self-starter/self-advocate for something?\nWhy should we choose you?"}, {"date": "21 Oct 2021", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Texas Children's Hospital", "Interview Descriptions": "Currently zoom because of covid restrictions. The interview is generally a panel style interview on zoom. This may be one big panel or two separate panels. The recruiter for the organization will set up your interview and then you meet with your specified department heads.", "Interview Questions": "Everything is behavioral based such as tell me about a time when…"}, {"date": "23 Nov 2021", "title": "Certified Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Texas Children's Hospital (Houston, TX) in Oct 2021", "Interview Descriptions": "My interviewer was very transparent about the position and the qualities it takes in order to fulfill that role. Also it was very quick process took about a month. Super efficient and very nice helpful employees.", "Interview Questions": "They interview in star format questions"}], [{"date": "13 Mar 2023", "title": "Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Texas Children's Hospital in Sept 2021", "Interview Descriptions": "Phone screens were virtual. In-person interviews were with several individuals, all asking similar questions. Comprehensive, both from getting to know me and allowing me to understand the culture and structure of the organization.", "Interview Questions": "Questions are experienced-based, and are based in interaction skills mostly."}, {"date": "1 Nov 2022", "title": "Product Marketing Lead Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 6 weeks. I interviewed at Texas Children's Hospital in Sept 2021", "Interview Descriptions": "The interview process can take a significant investment in time and you run the risk of being ghosted by the recruiter. The interview team was personable and friendly. They were transparent about job responsibilities and the work environment.", "Interview Questions": "Was I experienced working with doctors?"}, {"date": "21 Aug 2021", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Texas Children's Hospital", "Interview Descriptions": "Applied through an online application, was connected with a recruiter for certain preferences, and tk schedule an interview with the specific department and hiring manager. The recruiter followed up after the interview with an offer. Very timely process.", "Interview Questions": "Interview questions can depend, and focus on certain topic such as teamwork, care management, etc…"}, {"date": "3 Aug 2021", "title": "OT/PT Technician Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Texas Children's Hospital", "Interview Descriptions": "Took a long time to hear back from them. Applied and did not have a proper phone number to call a specific person or department to follow up with my application.", "Interview Questions": "I did not yet make it to an interview."}, {"date": "3 Aug 2021", "title": "Ambulatory Service Representative Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Texas Children's Hospital", "Interview Descriptions": "It was a typical interview with a clinic nurse and clinic administrator but the nurse seemed more knowledgeable than the administrator. She (the nurse) was able to describe a work day for the position they’re trying to fill.", "Interview Questions": "What are your strengths and weaknesses?"}, {"date": "31 Jul 2021", "title": "CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Texas Children's Hospital", "Interview Descriptions": "It was a little intense. There was multiple people in the interview asking star format questions; so prepare for that and know what you bring to the team. Make sure you practice the most basic interview questions too. Especially tell me about your self.", "Interview Questions": "Star format: tell me about a time where you had conflict with a co worker or tell me about a time you had conflicting priorities."}, {"date": "19 Jul 2021", "title": "Pharmacy Technician Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Texas Children's Hospital", "Interview Descriptions": "An  math test followed by tell me about a time questions. The process was simple the recruiter called over the phone then set me up with an in person interview.", "Interview Questions": "Tell me about a time blah blah blah\r\n\r\n"}, {"date": "4 Jun 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Texas Children's Hospital in Apr 2021", "Interview Descriptions": "Video call from the unit manager along with other nurses. Questions were asked during the video call interview, easy to talk with and very friendly atmosphere that gave me Contact is thru email with the manager and HR.", "Interview Questions": "What is your work experiences"}, {"date": "15 Nov 2021", "title": "Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 4 weeks. I interviewed at Texas Children's Hospital (Houston, TX) in Mar 2021", "Interview Descriptions": "Multiple Panel Interviews provide opportunities to meet more team members.  The process was long, but in team was thorough and I got a good picture of what it would be like to work for them.", "Interview Questions": "Provide examples of accomplishments and results"}, {"date": "16 Aug 2022", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Texas Children's Hospital in Feb 2021", "Interview Descriptions": "2 round interview. Previous experience a plus. Great place to work. Not very competitive with pay. Great workplace culture. Would leave for more pay because raises don’t come around often", "Interview Questions": "Why do you want to work with the nicu population?"}], [{"date": "14 Jan 2021", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Texas Children's Hospital (Houston, TX)", "Interview Descriptions": "Definitely a lot of steps for the interview and on Harding process but totally worth it getting to be with such a great organization. From interview to hired and finishing all on boarding took about 2 weeks?", "Interview Questions": "Preferred income\r\nMost difficult job \r\nTeam work"}, {"date": "13 Jan 2021", "title": "IT Director Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Texas Children's Hospital", "Interview Descriptions": "Multiple meetings with leadership and other directors.  One of the meetings was a larger group meeting to determine fit within the organization.  It took a fairly long time, at least two months from start to finish", "Interview Questions": "Tell me about a time that you had to handle a difficult customer"}, {"date": "14 Jan 2021", "title": "Project Analyst Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Texas Children's Hospital", "Interview Descriptions": "Long and slow process. HR confusing and confused. Would not accept masters degree in lieu of years experience, would not accept a paid internship even though it was full time and I had an I-9 and paid taxes on the internship.", "Interview Questions": "Used questions from interview pamphlet "}, {"date": "15 Feb 2023", "title": "Patient Care Assistant (PCA) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Texas Children's Hospital (Houston, TX) in Jan 2021", "Interview Descriptions": "Interview is virtual, and you will meet with 3/4 people on the Unit that each ask questions about you and how you will benefit the Unit. They are taking notes while you talk but stay focused and only answer the question asked.", "Interview Questions": "Describe yourself Your biggest Weakness and Strength If you didn't get along with a coworker what did you do?"}, {"date": "3 Feb 2021", "title": "Patient Access Representative Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Texas Children's Hospital (Houston, TX) in Jan 2021", "Interview Descriptions": "Interview was short but very informative. Manager made the process easy for me to answer assertively and not get nervous. She went beyond answering every question I had \r\n\r\nInterview was short but very informative. Manager made the process easy for me to answer assertively and not get nervous. She went beyond answering every question I had", "Interview Questions": "Why do you want to work in this department? "}, {"date": "14 Oct 2020", "title": "PICU RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Texas Children's Hospital", "Interview Descriptions": "Quick, easy interview. Part one with management, part two with staff. Basic questions answered in STAR format. Most questions situational and based on personal experience in hospital setting.  Offer extended 1 week after interview.", "Interview Questions": "What’s a time you felt you made most of a difference in the clinical setting? "}, {"date": "1 Sept 2020", "title": "Physician Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Texas Children's Hospital", "Interview Descriptions": "Situational interview questions, come prepared with examples of the qualities you possess.  You will interview with several people usually the head of your team, team members as well as supervising physician.", "Interview Questions": "Tell me about a time when you had a conflict with your supervising physician and how you resolved it. "}, {"date": "28 Feb 2023", "title": "Patients Transporter Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 days. I interviewed at Texas Children's Hospital (Liberia, NC) in Sept 2020", "Interview Descriptions": "The interview is about some questions that will qualify me for the job , such as experience, skills ability, if you qualify to work in the United States, if I ever work for military or if I ever serve as a military spouse.", "Interview Questions": "What is your level in school? How many years experience do you have?"}, {"date": "28 Mar 2020", "title": "Project Management Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Texas Children's Hospital", "Interview Descriptions": "There was a phone interview first with a recruiter with typical screening questions, followed by a case study submitted to the recruiter, and this was followed by an in-person interview.  The whole process didn’t take very long, and was pretty standard.", "Interview Questions": "What has been something you struggled with in your current or previous position? "}, {"date": "23 Jan 2020", "title": "Assistant Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Texas Children's Hospital", "Interview Descriptions": "I completed 2 phone interviews with the recruiter and hiring manager.  They decided to fly me half way across the country to complete an in-person interview for the final round.   I even paid for my family to travel with me since we could potentially be relocating.  I waited 2 weeks after the interview and followed-up several times with both the recruiter and the hiring manager, who gave me her cell phone and e-mail address.  I never received any further communication after the interview from either person.  They couldn't even send me an automated rejection e-mail.   Potential leaders beware.", "Interview Questions": "Standard behavioral interview questions. "}], [{"date": "20 Nov 2019", "title": "Human Resources Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Texas Children's Hospital", "Interview Descriptions": "Applied on-line.  Contacted by third-party recruiting agency.  Phone interview, then in-person interview with panel.  Then radio silence for over a month.  Offer finally made by third-party agency.", "Interview Questions": "Behavioral interview questions "}, {"date": "14 Nov 2019", "title": "Speech Language Pathologist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 months. I interviewed at Texas Children's Hospital", "Interview Descriptions": "I applied for the job online and received a call from Human Resource Department the very next day. I was asked a few questions as to what type of experience I had and my experience with different disorders. The HR was very helpful in suggesting what steps I need to work on and how to prepare for the interview.", "Interview Questions": "- Behavioral questions: Describe a difficult situation with your coworker/ a caregiver"}, {"date": "15 Mar 2020", "title": "Registered Nurse Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Texas Children's Hospital (Houston, TX) in Oct 2019", "Interview Descriptions": "Took about 1 week after call for interview. Interviewed with 3 people. One was mostly on her phone whole time while  the other asked questions and one just listened.", "Interview Questions": "Behavioral questions. How do you deal with difference in cultures. "}, {"date": "2 Feb 2022", "title": "Ambulatory Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Texas Children's Hospital in Oct 2019", "Interview Descriptions": "The process was very average, questions where situation/solution based. However, questions about my personal life were not asked. I did not feel like they wanted to get to know me as a person.", "Interview Questions": "What would you do if a patient/parent yelled at you during check in? "}, {"date": "5 Sept 2019", "title": "Staff Pharmacist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Texas Children's Hospital", "Interview Descriptions": "Had to go through a phone interview which consisted of behavioral questions followed by an in person interview. In person interview also had behavioral style questions.  Was also given a site tour after the interview.", "Interview Questions": "Tell us about a time you had to deal with a difficult patient "}, {"date": "23 Jun 2019", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Texas Children's Hospital", "Interview Descriptions": "Meet with outpatient clinic educator and coordinator to go over resume and talk about the position. After these two meetings went to clinic and talked with the other RN in the clinic", "Interview Questions": "Just went over resume "}, {"date": "29 Aug 2020", "title": "Secruity Guard Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Texas Children's Hospital (Houston, TX) in Jun 2019", "Interview Descriptions": "Applied online, filled out the application. then I received a call back from the HR department. they then had me come in for an interview. They then followed up and made me an offer for the job.", "Interview Questions": "What is a time that you impacted the mission?"}, {"date": "30 May 2019", "title": "Patient Sitter Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Texas Children's Hospital", "Interview Descriptions": "Working with children to maintain their safety. Individuals suffer from dual diagnosis. Some are behavioral and some are just young patients who are alone or tend to pull out IVS.", "Interview Questions": "What is my work experience with behaviors?"}, {"date": "5 Jun 2019", "title": "Staff Property Accountant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Texas Children's Hospital (Houston, TX) in Apr 2019", "Interview Descriptions": "I applied directly for the position on the Career portal of their own website. I submitted my resume on April 5, 2019. Received a callback/phone screen from internal recruiter on April 8.  Received another phone call on April 12 from same recruiter to schedule an onsite interview on April 16. First round with Accounting Manager was very relaxed but all behavioral questions from a stack. You are encouraged to give structured responses using the STAR method. Positive feedback received from Recruiter as well as First manager led to 2nd round with the Asst Director and Director 2 days later, which was longer. Another set of behavioral questions with Asst Director first and a short casual interview with Director.  Followed up via email with all 3 interviewers immediately the day after. Did not receive a response until May 3, 2019. I was told they are still going through interviews at this time and that I was still in good standing as a candidate. I am not too familiar with the recruiting process with hospitals in the TMC but it's now June so it's not likely I'll ever hear back.\r\n\r\nI still enjoyed the process of the whole interview experience. A very firm hiring process is in place at the top with very structured questions. This is good for both sides.", "Interview Questions": "Tell me about a time you had to very strategic in order to meet all your top priorities."}, {"date": "12 Apr 2019", "title": "EMR Trainer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through a staffing agency. The process took 2 weeks. I interviewed at Texas Children's Hospital (Houston, TX) in Mar 2019", "Interview Descriptions": "Hiring manager performed a phone interview with me at 4:00pm. She was 10 minutes late calling me and during the interview she kept reminding me she only has 30 minutes to talk to me. Hiring manager gave me the impression she did not care about my experience or the job requirements. She was hiring based on if she \"liked\" you. So if you care about your Epic career do not work at this company/department.", "Interview Questions": "Tell me about yourself?"}], [{"date": "5 Feb 2019", "title": "Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Texas Children's Hospital", "Interview Descriptions": "Got a phone call from a recruiter. Scheduled a phone interview. But was then told the position was changed to a senior level post, which I wasn't qualified for.", "Interview Questions": "N/A"}, {"date": "24 Feb 2022", "title": "Data Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Texas Children's Hospital in Feb 2019", "Interview Descriptions": "My overall experience with texas children’s was a great experience when interviewed for my current position. They were very interested in my work and me as a person. They helped me calm my nerves during my interview and made the interview process a lot easier.", "Interview Questions": "Tell me about yourself and how you can benefit this companyp"}, {"date": "30 Jan 2019", "title": "Certified Medical Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Texas Children's Hospital (The Woodlands, TX) in Jan 2019", "Interview Descriptions": "First you will receive a phone interview if that goes well then the recruiter will submit your application to the hiring manager.  If the hiring manager is interested the recruiter will reach out to set the interview up. Lastly after your in person interview it takes 1-2 weeks.", "Interview Questions": "Why Texas childrens?"}, {"date": "23 Dec 2022", "title": "Patient Care Assistant (PCA) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Texas Children's Hospital (Conroe, TX) in Jan 2019", "Interview Descriptions": "Interview was overall professional. Felt blindsided a few times when information was not relayed to me properly but a great company to work for. The company also has great benefits if you get to manage them yourself. Be careful about them opening retirement accounts automatically without your consent and then transferring assets between your other workplace account. Very suspicious.", "Interview Questions": "I would rather not disclose this information and allow you to self prepare. Think about the role you have applied for. Earn your job :)"}, {"date": "23 May 2019", "title": "Graduate Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Texas Children's Hospital (Houston, TX) in Jan 2019", "Interview Descriptions": "A little chaotic but informative. The staff were very eager ti discuss my skills and what to expect as a graduate nurse. Spoke about certifications. It was a panel setting with the unit managers and educator.", "Interview Questions": "Name a time you solved a problem "}, {"date": "27 Jan 2023", "title": "Attorney Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Texas Children's Hospital (Houston, TX) in Jan 2019", "Interview Descriptions": "They use the STAR method of interviewing, be prepared with relevant examples that relate to challenges and triumphs you've faced in the workspace, personal organization, ability to prioritize, ability to collaborate to problem solve.", "Interview Questions": "Describe a time when. you thought you had solved a problem at work but it was only indicative of a larger issue."}, {"date": "28 Jan 2019", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Texas Children's Hospital (The Woodlands, TX) in Jan 2019", "Interview Descriptions": "Appointment with telephone recruiter and then panel interview. Job offer by end of same day. Orientation booked 3 weeks in advance to allow for all the background and occupational health stuff.", "Interview Questions": "Type of person you don’t like working with?"}, {"date": "30 Nov 2018", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2+ months. I interviewed at Texas Children's Hospital (Houston, TX)", "Interview Descriptions": "Interview consists of multiple scenario-type questions that involve critical thinking. You have to give examples of past clinical experience to answer the questions or come up with a hypothetical scenario and how you would respond.", "Interview Questions": "Describe a time when you made a mistake. "}, {"date": "10 Nov 2018", "title": "MA Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Texas Children's Hospital (Houston, TX)", "Interview Descriptions": "Long wait. Was hired on the spot but was not told until several weeks later.  They do background check and drug test. It was a one on one interview.", "Interview Questions": "Medical terminology questions. "}, {"date": "25 Oct 2018", "title": "Patient Care Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Texas Children's Hospital", "Interview Descriptions": "It wasn't a bad process. Apply then wait a couple of weeks and they will call and schedule your interview then if hired you would get called back then start your background, drug screening and onboarding process.", "Interview Questions": "Why did you apply for this position "}], [{"date": "20 Sept 2018", "title": "Physician Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Texas Children's Hospital (Houston, TX) in Sept 2018", "Interview Descriptions": "Brief Standard Phone Interview with Recruiter - Not finished with the process but so far a positive experience. The recruiters they use are professional and kind, no strange or unexpected questions early on.", "Interview Questions": "Why do you want to work in Pediatrics?"}, {"date": "5 Sept 2018", "title": "Lead Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Texas Children's Hospital (Houston, TX) in Sept 2018", "Interview Descriptions": "Interviewed by two managers  who alternately asked me a series of questions according to their personal management style. I was then given a chance to ask questions of my own.", "Interview Questions": "How I dealt with conflicting work schedules of other employees as a small building owner "}, {"date": "25 Aug 2018", "title": "Administrative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Texas Children's Hospital", "Interview Descriptions": "Strong ability to work effectively with multiple supervisors.\nCapable and practiced in handling complex and multifaceted tasks.\nExtremely knowledgeable with clerical tasks and time management.Microsoft Office, desktop publishing, and database management.", "Interview Questions": "What are some of your strengths?"}, {"date": "7 Jun 2018", "title": "Patient Access Representative Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Texas Children's Hospital (Houston, TX)", "Interview Descriptions": "STAR response is helpful when answering questions. Just remember Situation, Task, Action, Result. There are plenty of situational questions as well as what ifs. Wasn't that hard however, there are some question that are repeated in another format that can get tricky.", "Interview Questions": "What salary range are you comfortable with?"}, {"date": "23 Aug 2018", "title": "Customer Service Representative Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Texas Children's Hospital (Houston, TX) in Jun 2018", "Interview Descriptions": "There is a phone screening, two panel interviews,  then two more interviews/meetings w/ upper management. The first two panel issues are done first and on the same day,  then they review afterwards and decide whether to move you forward. If you're accepted then you will get a call within a week to schedule part three of the process.", "Interview Questions": "How can I make the company better?"}, {"date": "11 Apr 2018", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at Texas Children's Hospital in Apr 2018", "Interview Descriptions": "Applied for position on website and got an email the same day. Interview offer 2 days later. Very straightforward. Interviewed with Educator and Manager. Polite staff and overall a great experience.", "Interview Questions": "Behavior style"}, {"date": "14 Feb 2018", "title": "Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "The process took 6 weeks. I interviewed at Texas Children's Hospital", "Interview Descriptions": "Behavioral questions \nWhy I wanted to work here \nStrong qualities \nExamples\nTeam\nWork \nStrength \nWeaknesses \nScenarios \nExamples \nDifficult time difficult client how to speak to others how to handle conflicts \nTook an hour \nGot the job", "Interview Questions": "Difficult time , difficult experience, how to handle stress ??"}, {"date": "19 Mar 2021", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Texas Children's Hospital (Houston, TX) in Jan 2018", "Interview Descriptions": "The interview process was very easy and convenient. It was a Panel Interview via ZOOM. They like you to use the STAR Format to answer  Behavioral Questions about real life situations you have experienced.", "Interview Questions": "Tell us about a time you had a difficult patient and how did you handle it."}, {"date": "15 Mar 2018", "title": "Operations Systems Analyst II/the Health Plan Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Texas Children's Hospital (Bellaire, TX) in Jan 2018", "Interview Descriptions": "It was a 3 interview process which I scheduled for all 3 in one day and it lasted around 3 hours. I was asked questions about the previous jobs positions that I held, but mostly about the last position that I held when I worked at Texas Children's Health Plan. They wanted to know what you did in different types of scenarios that occurred in your job duties.", "Interview Questions": "Different scenarios in what I did in different situations for the previous job positions that I held. "}, {"date": "23 Dec 2017", "title": "CVICU RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Texas Children's Hospital (Houston, TX) in Dec 2017", "Interview Descriptions": "After applying I got a call a week later from the recruiter and got an interview would have been following day but had to go out fo town. Interviewed when I got back a week later. The following day I recieved  job offer! Yay!", "Interview Questions": "Mostly all behavioral questions and why did you want to work there."}], [{"date": "18 Oct 2017", "title": "Paralegal Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Texas Children's Hospital (Houston, TX) in Oct 2017", "Interview Descriptions": "Applied early June 2017, got call from recruiter the same day. Heard from recruiter about two weeks later to schedule me from call with hiring attorney. Had call with attorney at the end of June and it went well. Got update from recruiter on July 28 that she should hear from attorney soon on who to bring in for interviews. Got call on August 1 to schedule in-person interview for August 21. Had interview with hiring attorney and another attorney and it went well. They were very nice. Then also met with another attorney and paralegal and it was okay; I did not have good vibes from attorney - she was a bit rude cut me off while I talking. No one offered their business cards and I asked the recruiter for their emails to send thank emails, but I got no response. Received rejection email on October 18.", "Interview Questions": "I don't remember specific questions, but they we're general in nature related to the position. They read questions off a sheet instead of fostering conversation based off my resume."}, {"date": "18 Nov 2017", "title": "O R INSTRUMENT TECH Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Texas Children's Hospital (Houston, TX) in Oct 2017", "Interview Descriptions": "Had an over the phone  interview in early October.  Lasted for about 10 minutes.  A few days later I had interview set up The hiring manager and four other managers at the facility, but I only ended up meeting with one.  Interview went on for about an hour and 45 minutes. I must say it was my best interview ever.", "Interview Questions": "What are my strongest qualities when it comes to Sterile Processing?"}, {"date": "27 Mar 2020", "title": "Scheduler Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through a staffing agency. The process took 3 weeks. I interviewed at Texas Children's Hospital (Houston, TX) in Oct 2017", "Interview Descriptions": "Registered with staffing agency\r\n1. Phone interview(you answer the phone as if you’re a medical scheduler, schedule a mock appointment) \r\n2. Group Interview (looking for unique personality with warm bubbly attitude, also maybe asked little known facts about the Hospital)\r\n3. Panel interview with management (basic behavioral questions)\r\n4. Job offer", "Interview Questions": "1. Tell me a time you had a difficult work situation and how did you handle it."}, {"date": "20 Oct 2017", "title": "Medical Coder Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Texas Children's Hospital (Houston, TX) in Sept 2017", "Interview Descriptions": "After the first contact, I was scheduled for an in-person interview 2 to 3 weeks later. The interview went very well and was quite pleasant. I was very comfortable, and felt well-informed of the position and requirements. \r\nMy only complaint is after the interview, I was welcomed to follow-up, which I did initially 2 weeks after my interview with a vague response. One month after, I followed-up and received no reply...I suppose indicating I was not selected for the role. I was hoping to at least get a \"the position has been filled, will keep you in mind for future roles...\" or something other than silence... I just felt it was rude. \r\nOther than that, I think Texas Children's is an ideal company to work for in my industry, and certainly hope for another opportunity to work for them.", "Interview Questions": "Give an example of when you worked on a team to resolve a problem, and your role in solving the problem.\r\n(In my previous roles, I mostly worked alone...and we didn't have many problems..lol. Of course I thought of 5 or 6 better examples I could've given AFTER my interview..lol)"}, {"date": "19 Oct 2017", "title": "Respiratory Therapist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Texas Children's Hospital (Houston, TX) in Aug 2017", "Interview Descriptions": "Brief interview with HR person over the phone before meeting with clinical coordinator in person. Interview was relaxed with a standard bank of questions that was read from a paper.", "Interview Questions": "How do handle conflicts between professionals?\r\nWhy do you want to work for Texas Children’s?"}, {"date": "17 Mar 2021", "title": "Senior Program Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Texas Children's Hospital (Houston, TX) in Jul 2017", "Interview Descriptions": "Interviewer kept texting on their phone after asking me questions. No eye contact. When I stopped to give her an opportunity to respond on her phone she told me to continue taking. Terrible, uncomfortable interview.", "Interview Questions": "Tell me about a difficult conversation you had with a coworker."}, {"date": "2 Jun 2017", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Texas Children's Hospital", "Interview Descriptions": "I was emailed an opportunity to schedule an interview. when we met up the manager was straight forward and gave me every little detail about the work environment and duties then asked interview questions.", "Interview Questions": "basic interview questions, strengths and weakness, how would you handle a confrontation, what would I do if someone asked me to do something that was not in my job description( i learned that it is best to always ask if they can give you an example to see where this particular interviee's point of view is at.)"}, {"date": "2 Jun 2017", "title": "Patient Care Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at Texas Children's Hospital (Houston, TX) in Jun 2017", "Interview Descriptions": "Overall a three week process, beginning with a phone interview and lastly a panel interview. The questions asked during the interview were Behavioral questions! Very friendly welcoming staff! Easy going process.", "Interview Questions": "All behavioral questions - difficult time? Difficult customer? How you deal with change?"}, {"date": "19 Jul 2017", "title": "RN Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Texas Children's Hospital (Houston, TX) in Jun 2017", "Interview Descriptions": "Easy process. The hiring manager seemed very pleasant and easy going. However, she said she would get back with me  a week later. Two weeks passed by and nothing. I called her back and she emailed me saying that she was still interviewing candidates and that she would get in touch with me later on that week.  Unless their process is EXTREMELY low, I have no hopes because 3 weeks later, I haven't heard back from her. I was well-qualified for the position.", "Interview Questions": "Why did you choose TCH?"}, {"date": "14 Sept 2018", "title": "Payment Operations Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Texas Children's Hospital (Houston, TX) in Apr 2017", "Interview Descriptions": "First interview held  over the phone. Second held In person. Loved my manager she was very personable during the interview ask general work related questions. Mainly spoke about the work culture of the company, benefits, and opportunities for advancement.", "Interview Questions": "Work history "}], [{"date": "5 Apr 2017", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Texas Children's Hospital in Mar 2017", "Interview Descriptions": "Screening interview with recruiter first. A week later, had a phone interview (due to location) with manager and assistant manager. Although they decided to pursue other candidates, the overall experience was very positive and professional.", "Interview Questions": "All behavioral-style questions "}, {"date": "26 Mar 2017", "title": "Customer Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Texas Children's Hospital in Feb 2017", "Interview Descriptions": "Applied online. Got an email from a recruiter within a week. Scheduled phone interview for a couple of days later. Then had an in-person interview two days after phone interview. In-person interview focused on behavior questions. Had an offer extended via email within the week.", "Interview Questions": "Tell me about a time you were in difficult situation and how it was resolved."}, {"date": "16 Jan 2017", "title": "Department Secretary Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Texas Children's Hospital (Houston, TX) in Jan 2017", "Interview Descriptions": "First interview was with the Assist Director at the SW location. I had gone on my day off to be flexible.  The interview was ok. She asked behavioral questions and we talked; which I feel is a better way to get to know someone. The interview was an hour long. 3 weeks later there was a second interview. It was with a panel of 4 people. \r\n\r\nThey were leaders within the clinic. They asked behavioral questions, and they asked me to walk them through my resume. They answered some of my questions at the end but not all. They couldnt tell me when a decision was going to be made. \r\n\r\nThe interview was 1 hour long.", "Interview Questions": "If you manager described you in 3 words what 3 adjectives would she/he give?\r\n\r\nDescribe a time you had to stop your work to help a coworker with their work. How did you handle the situation and what was the outcome?\r\n\r\nWalk us through your resume. \r\n\r\nThey literally flipped through pages of long behavioral questions, reading them off the paper. after a while I started to answer the questions, but would forget the next part of the questions. The questions were in 3 parts. You have to answer the questions on 4 part format(STAR)."}, {"date": "2 Mar 2021", "title": "Donor Engagement Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Texas Children's Hospital (Houston, TX) in Jan 2017", "Interview Descriptions": "The interview process was very standard. The interview included myself and three of their executive development staff. They asked general questions about my development skills and then discussed the hospital's development plans and goals.", "Interview Questions": "What are your career goals for the next 5 years?"}, {"date": "18 Feb 2020", "title": "Physician Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Texas Children's Hospital (The Woodlands, TX) in Jan 2017", "Interview Descriptions": "Met with surgeon and APP for the team I would be working with. Straight forward questions about experience.  Also met with team lead. Had some targeted selection questions", "Interview Questions": "Why do you want to work here?"}, {"date": "15 Dec 2016", "title": "Patient Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Texas Children's Hospital (New York, NY)", "Interview Descriptions": "Very professional interview. They asked mostly behavioral questions. Be prepared and know about the mission of the company! My interview was 2 hours long. Met with a panel along with a manager. Overall, it was professional and the people were very nice.", "Interview Questions": "Describe a time you handled a change "}, {"date": "26 Dec 2016", "title": "Pharmacy Technician Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. I interviewed at Texas Children's Hospital (Houston, TX) in Dec 2016", "Interview Descriptions": "I went online to apply for a Pharmacy Technician and later receive interview questions through an email. I received another email requesting an interview in person that also requires a basic math skills test prior to the interview. Just waiting to see how that goes", "Interview Questions": "N/A"}, {"date": "21 Sept 2016", "title": "Sterile Processing Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Texas Children's Hospital (Houston, TX) in Aug 2016", "Interview Descriptions": "Applied for the OR processing technician  position for the new The Woodlands location. I was interviewed by 3 people. The process went smoothly, they were friendly. I did received an offer 2 weeks after the interview but I declined. For me being a tech III, $14.30 was too low. My current job pays over $2 that amount.", "Interview Questions": "They asked about a time when work was difficult for me and how did I manage it."}, {"date": "25 Jun 2016", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 1 day. I interviewed at Texas Children's Hospital (Houston, TX)", "Interview Descriptions": "Interview with human resources nurse recruiter only over phone, super nice, thorough, helped me to relocate and were super supportive when I arrived. Made me feel very comfortable and was not intimidating at all. Helped me with licencing process in Texas and was available to answer any questions that I had, even months after moving to Houston.", "Interview Questions": "How did i handle a difficult situation with a family member or staff in past."}, {"date": "8 Jun 2016", "title": "Certified Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 2+ months. I interviewed at Texas Children's Hospital", "Interview Descriptions": "Applied, recruiter called within a few days. Didn't hear from anyone for 3+ weeks. Two interviews within the same week. HR called stating they would email some things I needed to fill out (in case I was selected for the position). Received call-back with offer 3-4 days after that. Entire hiring/orientation process was 2 months.", "Interview Questions": "Behavioral/situational questions. Expect the \"what makes you stand out from other candidates with the same qualifications\" questions."}], [{"date": "19 Jul 2016", "title": "Patient Access Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Texas Children's Hospital (Houston, TX) in Jun 2016", "Interview Descriptions": "My interview was interactive and to the point that's what I liked the best. Answered all my question. Very thoroughly in explaining the background of the company and the growth  opportunities. Explained in full detail what the position could and offer now and In the future.", "Interview Questions": "Would I be willing to commute?My interview was interactive and to the point that's what I liked the best. Answered all my question. Very thoroughly in explaining the background of the company and the growth  opportunities. Explained in full detail what the position could and offer now and In the future."}, {"date": "19 May 2016", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Texas Children's Hospital in May 2016", "Interview Descriptions": "Entire process took ~1 month.  Applied online and then received a call from a recruiter a few days later stating that I would be contacted by the hiring manager personally.  After 2 weeks, I was contacted by the hiring manager and offered an interview.  The interview process was quite straightforward.", "Interview Questions": "The interview questions were behavioral."}, {"date": "31 Jul 2016", "title": "LVN Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2+ months. I interviewed at Texas Children's Hospital (Houston, TX) in May 2016", "Interview Descriptions": "Applied through a recruiter. She said I was way qualified for the position so I should hear back from a department manager quickly. I didn't. It took 2 weeks to just get an interview. \r\n\r\nInterview was on 5/12/16 and I thought it was good, I thought I nailed it. My interviewer said I'd hear back from her either way (offer or no offer) within 2 weeks, max. At the 3 week mark I called her asking the status and it hadn't been filled yet but she was still interviewing.\r\n\r\nFast forward to today, 7/30/16, and I still haven't received a courtesy call saying I didn't get the job. Very unprofessional. \r\n\r\nIt was my dream to work for Texas Children's, but not anymore.", "Interview Questions": "Behavioral and situational questions"}, {"date": "24 May 2016", "title": "Medical Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Texas Children's Hospital (Houston, TX) in May 2016", "Interview Descriptions": "First the recruiter called me to express interest. The next few days the hiring manager contacted me for a phone interview and then we scheduled a panel interview. Three professionals were on the panel. One week later, the hiring manager called me for a second interview.", "Interview Questions": "How did I handle an unethical situation with a co-worker, was it resolved?"}, {"date": "21 Apr 2016", "title": "ADM Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Texas Children's Hospital (Houston, TX)", "Interview Descriptions": "I applied online, one week later they phone interviewed me. One week after that, they emailed to see if I could come in for a panel interview.\r\n\r\nInterview was from 12 - 3\r\n\r\nThere was 3 panel interviews \r\n1st interview: 3 people\r\n2nd interview: 2 people\r\n3rd interview: 2 people\r\n\r\nThe entire interview was very intimidating, but they were nice. They didn't validate my parking.", "Interview Questions": "Walk us through your resume\r\nTell me about yourself\r\nHow do you handle stress"}, {"date": "17 May 2016", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Texas Children's Hospital in Apr 2016", "Interview Descriptions": "Was called by hr and scheduled an interview. Actual interview happened on a Tuesday and was offered a position by Friday. Everyone was nice and welcoming. Too many websites to keep up as far as the onboarding process but everyone is nice and gets in contact with you ASAP.", "Interview Questions": "How did you handle a difficult situation with a coworker"}, {"date": "27 Sept 2017", "title": "Nurse Practitioner Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Texas Children's Hospital (Houston, TX) in Apr 2016", "Interview Descriptions": "It was a group interview involving all providers. Questions were asked regarding the position, current experience, reasons for applying. This also provided the opportunity for questions to answered regarding my concerns", "Interview Questions": "Tell me about your background"}, {"date": "16 Mar 2016", "title": "Medical Technologist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Texas Children's Hospital", "Interview Descriptions": "I applied online. The process took 5+ weeks. I got a phone call with the recruiter first. Interviewed two weeks later with two managers and they were very professional, respectful and kind. Questions were straightforward. They asked me questions about my work experience, particularly to describe my reaction to certain situations that occur during the working process.", "Interview Questions": "How have you handled your own mistake?"}, {"date": "26 Jul 2016", "title": "Pediatric Nurse Practitioner Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 1 day. I interviewed at Texas Children's Hospital (Houston, TX) in Mar 2016", "Interview Descriptions": "The interview was really informal.  Was interviewed by another practitioner and the medical director.  Left the interview with mixed feeling.  My time with the practitioner felt more like an interview session, but my time with the director felt more like a chat session.  Maybe he knew from the start that he was not interested", "Interview Questions": "why do you want to work here?"}, {"date": "14 Apr 2017", "title": "RN Staff Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 5 days. I interviewed at Texas Children's Hospital (Katy, TX) in Feb 2016", "Interview Descriptions": "Informal, very pleasant and not challenging. I interviewed with two nurse managers and an educator. I was able to convey my thoughts in a structured manner and give specific examples of using the nursing process to answer their questions.", "Interview Questions": "Situation based question, how would you repond in a specific situation"}], [{"date": "28 Jan 2016", "title": "Staff Accountant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Texas Children's Hospital", "Interview Descriptions": "The interviewer was very friendly. It will take about 30 to 45 minutes for the whole process. I went for the 1St round of interview, heard that there might be 2nd round. \r\nThey do ask many questions in detail about your previous experiences and background. Got to specific and it will be beneficial if you do some research about the company and role.", "Interview Questions": "Share with us on the revenue process you were responsible in your previous job"}, {"date": "8 Feb 2016", "title": "Certified Pharmacy Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Texas Children's Hospital (Houston, TX) in Dec 2015", "Interview Descriptions": "The process was long the interview went well. I was interviewed by the pharmacy director she was professional and the question were specifically  related to the position I applied for. I was given the opportunity to ask questions and explain my previous experience I was given information I needed related to what would take place after the interview and estimated time I would wait for a response.", "Interview Questions": "I was asked about the length of experience and the areas I had most experienced in."}, {"date": "21 Sept 2019", "title": "Pharmacy Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Texas Children's Hospital (Houston, TX) in Sept 2015", "Interview Descriptions": "First, it's a phone interview to ask you to come to the recruitment center and take an assessment test. after that for about 2 weeks. you get to interview the Technician Supervisor and Manager", "Interview Questions": "it pretty much your work experience and scenario questions"}, {"date": "5 May 2015", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Texas Children's Hospital (Houston, TX) in Apr 2015", "Interview Descriptions": "First was a phone screening. Then two team member Interview good cop bad cop tactics behavioral questions great people. Second Interview was with the two original members and two additional interviewees .", "Interview Questions": "What would you do if the physician asked you to do something not in your job description and you are forbidded to do it?"}, {"date": "30 Mar 2015", "title": "Pharmacy Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Texas Children's Hospital", "Interview Descriptions": "Easy questions. Great interview process. Group interview. The questions were very behavioral types of questions. I did well with the examples I had. Everyone was welcoming. Parking was tough so arrive about an hour early. The med center is a pretty busy place so keep that in mind.", "Interview Questions": "why do you want to work here"}, {"date": "7 Jun 2015", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Texas Children's Hospital (Houston, TX) in Apr 2015", "Interview Descriptions": "First interview was With two people and it was good cop bad cop. The interview was said to have one interviewer but two was unexpectedly there. I aced that interview. A few weeks later about 3weeks to be exact I received a meet the team interview and that was with the same two interviewers from the first time plus two more members and one had the same position as me and explained the job the other was an nurse she played the questioner and I blew that right through the roof. I was offered a position two days later, and accepted.", "Interview Questions": "How did you handle conflict at your last place of employment?"}, {"date": "2 Sept 2016", "title": "Graduate Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at Texas Children's Hospital (Houston, TX) in Apr 2015", "Interview Descriptions": "Easy... one interview. I was emailed and signed up on a sign up genius. I found out less than a week later that I had the job. It took about one month to hear that I had an interview because the deadline for submitting applications for the internship was in February, found out that I had an interview in March and interviewed the first week in April. It was expected though because I did not graduate until May.", "Interview Questions": "What is one way that you dealt with an unethical situation?"}, {"date": "4 Mar 2015", "title": "Patient Care Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 3 weeks. I interviewed at Texas Children's Hospital", "Interview Descriptions": "I was interviewed by three different people.  First they called me, then I came in for an interview, then I was tested for certain skills, drug testing, background, then the final offer was made.", "Interview Questions": "How do you handle conflict?"}, {"date": "23 Mar 2017", "title": "Graduate Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Texas Children's Hospital (Houston, TX) in Mar 2015", "Interview Descriptions": "I applied for the graduate nurse internship. A recruiter called me and let me know that I was selected for an interview. She sent me an email to schedule it on signup genius at my convenience.", "Interview Questions": "How did I handle and ethical situation?"}, {"date": "17 Mar 2015", "title": "Unit Secretary Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Texas Children's Hospital (Houston, TX) in Mar 2015", "Interview Descriptions": "I applied and within 2 months I got a call back for interview. But I think I only got a call back because my neighbor talked for me she referred me.", "Interview Questions": "Give me a scenario where you has to handle conflict with patient or employee and how you handled it? What was the out come ?"}], [{"date": "17 Mar 2015", "title": "LVN - Pulm Clinic Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Texas Children's Hospital (Houston, TX) in Mar 2015", "Interview Descriptions": "I was emailed for interview availability. Once I submitted my availability,  I was given an interview for the next day. The information was all delivered to me electronically. I found the shuttle travel directions a little difficult however; I am not a native Houstonian.", "Interview Questions": "Describe a time you were a patient advocate."}, {"date": "12 Feb 2015", "title": "Graduate Nurse Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Texas Children's Hospital", "Interview Descriptions": "The day of the interview, I met with the unit manager. The interview was conducted in her office. For the GN position, there is a packet of standard questions that they ask. All of the questions were situational.", "Interview Questions": "The interview questions were all situational "}, {"date": "7 Mar 2015", "title": "RN Staff Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Texas Children's Hospital (Houston, TX) in Feb 2015", "Interview Descriptions": "Applied on a Friday, received a call from HR the following Tuesday. Had an interview about 2 weeks later with two nursing managers on the unit. Received job offer the next day.", "Interview Questions": "Behavioral Questions"}, {"date": "13 Aug 2014", "title": "Patient Services Coordinator Interview", "results": "No Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Texas Children's Hospital (Houston, TX)", "Interview Descriptions": "I applied at Texas Children's Hospital 05/16/2014 have my 1st interview on 7/18/2014 second interview 7/31/2014 and I am still waiting for a job offer which made me so frustrated.", "Interview Questions": "The interview questions was not difficult but hot to the point."}, {"date": "12 Nov 2015", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Texas Children's Hospital (Houston, TX) in Jul 2014", "Interview Descriptions": "It wasnt bad at all. The managers were nice and asked straight to the point questions. They really wanted to know more about you and how you handle things under pressure", "Interview Questions": "how do i work when i am under stress?\r\n"}, {"date": "27 Nov 2016", "title": "Milk Bank Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Texas Children's Hospital (Houston, TX) in Jun 2014", "Interview Descriptions": "It was a panel interview. I was unaware of this until I arrived to the interview. Each took turns asking resume based questions. They wanted to know about my future goals and how this job would influence my future career.", "Interview Questions": "How my education journey influenced the jobs I accepted."}, {"date": "6 Sept 2017", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through a staffing agency. I interviewed at Texas Children's Hospital (Houston, TX) in May 2014", "Interview Descriptions": "Its a panel interview with leadership and some staff to get a feel for if your personality will go well with the unit culture, if you've never done one before it can be intimidating but remember they want you to do good. They don't want to do any more interviews. They are actually on your side because they are hoping you are the right fit for the job.", "Interview Questions": "Give a specific example in your career when your ethics were challenged. What did you do and what was the outcome?"}, {"date": "26 Apr 2014", "title": "Clinical Dietitian Interview", "results": "Declined Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Texas Children's Hospital (Houston, TX)", "Interview Descriptions": "I was referred to the Assistant Director of Clinical Nutrition Services by my curent manager who knew I was looking for a new job (she was also leaving and didn't want to leave me high and dry). She asked if they were looking to hire a dietitian and in fact they were. I applied online and e-mailed my resume to the asst director. It took about 3-4 weeks before I got a call to schedule an interview. The interview itself was with a pnael of dietitians and the asst director. They were all nice, but it still felt a little intimidating.", "Interview Questions": "Almost all their questions were phrased: Explain a situation where blank happened, what action you took and what was the result."}, {"date": "14 Apr 2014", "title": "Administrative Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 5 days. I interviewed at Texas Children's Hospital", "Interview Descriptions": "Interview with hiring manager.  Brought in employee who referred me.  Had to get a TB test before starting work,", "Interview Questions": "None. resume said it all.  They saw my experience in software and projects I've worked on.  Had spoken on phone before. "}, {"date": "13 Dec 2013", "title": "Technical Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Texas Children's Hospital (Houston, TX)", "Interview Descriptions": "Initial phone interview was with HR then proceeded to the A&I lab manager. After that, a face-to-face meeting was scheduled after they made an initial offer. First stop was at HR with a quick overview of the salary and benefits. Next, a shuttle took me to the A&I lab to meet the lab manager, some of the doctors and the laboratorians.", "Interview Questions": "They asked if I new how to program in VB script specifically for Microsoft Excel spreadsheets. I had regular spreadsheet experience but didn't realize they really wanted a programmer (that was not specified in the job description)."}], [{"date": "21 Jan 2016", "title": "Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1+ week. I interviewed at Texas Children's Hospital (Houston, TX) in Dec 2013", "Interview Descriptions": "Not too bad.  Typical scenario behavior based questions.  Giving examples of accomplishments.  Typical interview questions and answers.  Know how to handle specific scenarios and people.  Demonstrate a connection to the vision.", "Interview Questions": "How do you handle challenging people?"}, {"date": "18 Nov 2015", "title": "Member Services Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Texas Children's Hospital (Houston, TX) in Dec 2013", "Interview Descriptions": "The director and manager will interview at the same time. They just asked some basic and situations questions.\r\n\r\nIt depends on how professional you look these days to give your best shot!\r\n\r\nCustomer Service job is always under paid so it doesn't matter to negotiate...", "Interview Questions": "Do you think customers are always right?"}, {"date": "6 Mar 2014", "title": "Staff Accountant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Texas Children's Hospital (Houston, TX) in Nov 2013", "Interview Descriptions": "Typical interview questions. Helps if you have been in the healthcare industry but they are willing to train newbies", "Interview Questions": "N/A"}, {"date": "23 Mar 2015", "title": "Junior Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Texas Children's Hospital (Houston, TX) in Nov 2013", "Interview Descriptions": "The interview was straight forward. It was completely conversational. I got the position immediately following the interview. I came in with questions regarding the hospital culture, patient contact, and hospital administration. The interview was held in the human resources office at the hospital. The interview was approximately thirty minutes.", "Interview Questions": "Where do you see yourself in 5 years"}, {"date": "8 Sept 2014", "title": "Financial Analyst Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Texas Children's Hospital in Oct 2013", "Interview Descriptions": "The first interview started with 2 managers and the second interview was with the department head. It took about a month to finish up both interviews. There are shuttle buses which took you to the main building, so you don't have to pay for parking.", "Interview Questions": "I was asked for behavior interview. There are lots of behavior questions which related to your previous job. such as: how did you handle stress when you were working on a big project? how did you handle different tasks at the same time."}, {"date": "22 Mar 2015", "title": "Administrative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Texas Children's Hospital (Houston, TX) in Oct 2013", "Interview Descriptions": "All behavioral questions--very structured interview. Mostly positive questions, maybe one negative (e.g., tell me about a time when a project you were leading didn't work out). I interviewed with several different people, and the only variation was in how long they spent on their questions vs. how long they left for my questions. One guy left 45 minutes of the interview for me to ask questions! Overall a great interview experience.", "Interview Questions": "Tell me about a time you worked with people from different backgrounds to achieve a common goal."}, {"date": "11 Sept 2013", "title": "RN Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 1 day. I interviewed at Texas Children's Hospital", "Interview Descriptions": "Not applicable", "Interview Questions": "N/A"}, {"date": "13 Jul 2014", "title": "Network Security Architect Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 2 weeks. I interviewed at Texas Children's Hospital (Houston, TX) in Jul 2013", "Interview Descriptions": "I called the manager of the Infosec group (the old manager) and spoke with her about the position. We then met and discussed the requirements. I also met with another architect and discussed the position. After submitting a drug test and about a two week wait, I was brought on as a contract to hire. After two months, I was offered the full time position. I accepted the position. Due to the laborious hiring process, it was almost six months before I was actually an employee. This was due to a background check service that was unreasonably slow and a largely destaffed HR department (using temp contractors). The old manager was a wonderful ethical woman that made working at TCH a better experience.", "Interview Questions": "Are you able to handle multiple competing project priorities while also performing long hours of troubleshooting / operational work?"}, {"date": "12 Jun 2013", "title": "Patient Accounts Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Texas Children's Hospital", "Interview Descriptions": "Unnecessarily difficult", "Interview Questions": "What you don't like about a job or previous"}, {"date": "2 Jul 2013", "title": "RN Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Texas Children's Hospital (Houston, TX) in Jun 2013", "Interview Descriptions": "I was incredibly unimpressed with the hiring process at this hospital. I interviewed for an RN position. I flew to Houston and had a first round interview, then was selected for a second round interview. During the second round interview I spoke on the phone with several staff nurses who were incredibly rude, even laughing at my responses. I didn't hear from the hospital for over a month, and when I did, it was from a \"no reply\" email and completely generic, not even from the manager who interviewed me. For a top rated hospital, this was entirely unprofessional and awful PR for them as a company.", "Interview Questions": "Behavioral/situational interview, fairly straightforward."}], [{"date": "5 Dec 2013", "title": "Pediatric Nurse Practitioner Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Texas Children's Hospital in Mar 2013", "Interview Descriptions": "Quick interview, very  nice.", "Interview Questions": "Where would I be in 5 years?"}, {"date": "23 Jun 2015", "title": "Project Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Texas Children's Hospital (Houston, TX) in Mar 2012", "Interview Descriptions": "Three set of inteviews. First with Manager. Next with a team of senior managers and with peers. I was really prepared for the interview. I researched on the company and also worked with recruiters. I worked in the environemtal service department and it's not something I will like to do anymore in my career.", "Interview Questions": "How do you manage people?"}, {"date": "26 Jan 2012", "title": "Physician Recruiter Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Texas Children's Hospital (Houston, TX) in Jan 2012", "Interview Descriptions": "Applied for job mid-September, 1st interview was mid-December. Brought back for 2nd interview mid-January. I was told they were looking for the \"perfect candidate.\" I did not receive offer because they \"did not feel a strong connection\" with me. I was also told they did not hire the other candidate who made it to the 2nd interview as well. They will never find the perfect candidate, there are people out there who give 110% and are very dedicated to their job who aren't \"perfect.\"", "Interview Questions": "When there are only 4 physicians in the country with specific training/background, how do you convince them to come to TCH/Houston? "}, {"date": "2 Oct 2015", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 2 days. I interviewed at Texas Children's Hospital (Houston, TX) in Nov 2011", "Interview Descriptions": "like a train wreck, difficult but mind consuming. I do not have thirty words to describe the interview process. You wing it, through intelligence, commitment, and honesty. Thirty words would be excessive at this point and hope it meets the quota. Depending on where in this institution you are to be offered a position, the interview process may differ.", "Interview Questions": "like a train wreck, difficult but mind consuming"}, {"date": "27 Feb 2013", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at Texas Children's Hospital (Houston, TX) in Aug 2011", "Interview Descriptions": "The hiring and interview process is very detailed and depending on your qualifications and the position you are applying for can take weeks to conclude", "Interview Questions": "As always the most difficult question in an interview is, \"What is one of your greatest weaknesses\""}, {"date": "7 Jun 2015", "title": "Patient Care Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Texas Children's Hospital (Houston, TX) in Jun 2011", "Interview Descriptions": "2 people interview plus myself, needed a copy of current resume, asked about my experience, time I wanted to work, asked what I expected, gave me background of tch. One manager offer me the jib because of what I went through to get the interview. I was extremely determined and would not give up.", "Interview Questions": "Whats my experience"}, {"date": "17 Feb 2015", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. The process took 3 days. I interviewed at Texas Children's Hospital (Houston, TX) in May 2011", "Interview Descriptions": "I was greeted by the receptionist whom was nice and offered me a bottled water. You were then called in for your interview to begin. All they did was asked me a few questions about the hospital and basically how I could be helping them. After answering a few questions I saw a video and had to take a 'quiz' that was made to test my ablity of memorization of basic codes that were used in the hospital.", "Interview Questions": "What would your presents here help bring to the hospital? \r\nWhy do you want to volunteer?"}, {"date": "7 Jul 2014", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 3 months. I interviewed at Texas Children's Hospital (Houston, TX) in Feb 2011", "Interview Descriptions": "I applied for the position online and was contacted by a recruiter shortly afterwards. There was one initial phone interview from the recruiter,  a skype interview, and lastly a face to face interview with the employer", "Interview Questions": "No really difficult questions"}]]