[[{"date": "12 Jun 2023", "title": "Investigator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Financial Ombudsman Service (Leeds, England)", "Interview Descriptions": "I applied for the remote investigator role that FOS are currently advertising. The first step was an online situational judgement test, then a few days later I was invited to complete a daily task ordering exercise and a case study in which you have to write a View to either a business or customer. This depends on if you uphold or defend a complaint. I was invited to an interview a few days after this. The email stated they would send over details of what to expect in the interview a few days prior to the date chosen. I called up the resource line as I hadnt received this 2 days before the interview. The chap said he'd send it straight through to me, but he didnt. I received the info around 10am and the interview was a few hours later, so that wasnt great. The email gave 3 competency areas to focus on, and stated they would ask 1 question from each area, which they didnt. The interviewers (Luke and John) started by asking some basic organisational questions, which seemed to go very well. They followed up by going through the task ordering exercise and View that I’d completed previously. The guys seemed more than happy with what Id done, and I felt strongly this was a good sign. They then asked several (more than 3) competency questions that Ive listed below. I used the star technique to answer. They didn’t ask follow up questions or probe any of my answers really, which I new from previous experience is a bad sign that the answers weren’t what they were looking for. Not everyone interviews well under pressure, and competency questions are never robust enough to show off a persons skills. If the Interviewers are not very good at leading someone to give them the information they’re looking for with probing questions, they’re not always going to get them, even when people are perfectly equipped to do the job. That’s why a lot of work places in my experience have so many people get through interviews, but can’t do the job they’ve been hired to do. I felt that this was the case here. I could do the job in my sleep and Id enjoy it, but my first interview in 12 years, and I had no idea the sort of things they were looking for in my competency responses. In my feedback they explained the answers weren’t strong enough, and although my experience was good, I didn’t tick all their boxes with the competencies. Im sorry, I cannot give more help on that, as Im still not sure what they wanted. Just make sure your competencies are strong and robust, and you have a lot of them.", "Interview Questions": "-What do you know about FOS? -Why do you want to work at the FOS? -What does good customer service mean to you? -What do you think would be the most challenging aspect of the job? Competencies -Describe a time you managed multiple deadlines -Describe a time you realised your current actions weren’t working and how you changed your methods -Name a time you dealt with a complex decision -Describe a time you had to drop everything and focus on a new project -Provide a time when you recommended a change -Give an example of working in a team to achieve a goal"}, {"date": "2 May 2023", "title": "Investigator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Financial Ombudsman Service (London, England)", "Interview Descriptions": "Multiple preparation meetings with external recruitment before a part competency part technical interview over teams. You are required to answer multiple technical questions under a time limit, complete an example complaint exercise and then pass the interview.", "Interview Questions": "Multiple technical questions and an example complaint"}, {"date": "9 May 2023", "title": "Investigator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Financial Ombudsman Service (London, England) in Apr 2023", "Interview Descriptions": "3 stages - (1) CV sift, (2) Written task (consisting of an in-tray prioritisation task and writing a view), (3) Interview with a HR rep and an Ombudsman. The written task was fairly straightforward, you are asked to spend no more than 90 mins on it, although you can spend longer/shorter if you like. With regards to the view written task, there is no real right or wrong answer, the idea is for you to be able to explain your rationale based on the circumstances. The interview was conducted remotely and mine was horrendously unprofessional. The HR member was smirking and rolling his eyes at many of my answers, as well as looking away from the screen to laugh/chat to the ombudsman or someone else in the room who I couldn't see. It was so off putting that it made me go off track and feel uncomfortable with my following answers. I was declined (which was expected from their attitude in the interview) and the email specified that I could ask for feedback, which I did. That was ignored, and I still haven't heard anything almost a month after. So much for them living their values and \"Doing what we say we'll do\". I would not apply again ever, let alone after 6 months.", "Interview Questions": "What does good customer service mean to you?"}, {"date": "22 Apr 2023", "title": "Investigator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Financial Ombudsman Service in Feb 2023", "Interview Descriptions": "HR did not provide an honest feedback about the written assignment. I felt like they did not want to spend time with me advising how I should have answer. No guidance and no interest in answer my doubts when I request a call to receive feedback. Not sure if I will apply again after 6 months because of this. The HR person who called me didn’t seem really interested in help me when I have asked her what I did wrong and she excuse herself advising she did not review my application. Overall was a waste of time", "Interview Questions": "N/A"}, {"date": "6 Jan 2023", "title": "Test Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Financial Ombudsman Service", "Interview Descriptions": "It's really well organised and the questions are more regarding testing process and automation. Once done with the first round we have second level of interview to discuss more about the process. Overall a good experience", "Interview Questions": "Technical questions more related to testing"}, {"date": "10 Jan 2023", "title": "Investigator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Financial Ombudsman Service (London, England) in Jan 2023", "Interview Descriptions": "I sent my CV in, received an email a day or so after inviting me to complete a verbal reasoning test, then after that I was invited for a phone interview, after the phone interview I was invited to complete a written assignment. The written assignment is split into two parts the first is prioritising a list of tasks and then the second is a case study you have to reply to as an investigator. I didn’t get though after the written assignment. The whole process was quite quick.", "Interview Questions": "Tell us about a time you managed multiple deadlines? What do you know about FOS? Talk me through your CV What skills can you bring to your new role? Tell us about a time you dealt with a difficult customer?"}, {"date": "8 Nov 2022", "title": "Adjudicator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Financial Ombudsman Service", "Interview Descriptions": "Fairly straight forward. Started written test, if successful then face to face interview. If successful then checks will be carried out. Role is inside IR35 so you would have to choose an umbrella company.", "Interview Questions": "Why have you applied for this role?"}, {"date": "17 Oct 2022", "title": "Data Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Financial Ombudsman Service", "Interview Descriptions": "Had 4 steps to the interview. First was with the recruiter, second with a hiring manager, the third was to prepare a case study/presentation. I mainly dealt with a recruiter. I interviewed in their London - Canary Wharf office and they told me they would inform me of their final decision by the next week. The company and the recruiter didn't provide me with any updates even though I emailed him (Ashdown Agency) and it had been a month with no response. Its highly inconsiderate to interview and take up peoples time and not update them with a decision. There were so many stages and the recruiter dragged the entire process on for 3 months.", "Interview Questions": "Tell us about a time where you had to deal with a difficult stakeholder."}, {"date": "23 Aug 2022", "title": "Customer Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Financial Ombudsman Service", "Interview Descriptions": "Really easy as long as you have a passion for helping people.\r\n\r\nBe positive, organised and honest. It’s mostly scenario based questions so remember to give answers which showcase commitment, resilience and team work.", "Interview Questions": "How would you handle giving out bad news to a customer\r\n\r\nWhat demotivates you"}, {"date": "24 Jun 2022", "title": "Paralegal Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Financial Ombudsman Service in May 2022", "Interview Descriptions": "Very straightforward and clearly structured. The Counsel was very friendly and puts you at ease very quickly. They laid out how the interview would be structured from the onset and the types of questions they would ask.", "Interview Questions": "Your motivation to work for FOS?\r\nHandling areas of knowledge unfamiliar to you."}], [{"date": "2 Jan 2022", "title": "Investigator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Financial Ombudsman Service in Dec 2021", "Interview Descriptions": "Standard Online Application  and CV, Telephone Interview (pre interview) with HR colleague with pre-screening questions, salary expectations, formal Interview on MS Teams with competency questions and technical questions and presentation", "Interview Questions": "Standard civil service competency interview questions "}, {"date": "12 Sept 2021", "title": "Investigator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 4 weeks. I interviewed at Financial Ombudsman Service in Sept 2021", "Interview Descriptions": "Quite a long process - submit CV, telephone interview, verbal reasoning test, deductive reasoning test, 700 word application questions, online case study & prioritisation task and then final interview.\r\n\r\nThe case study required you to make a decision based on information available (no prior knowledge needed) and then write a letter to the party you decided against detailing why. In the interview they ask you to justify your decision.\r\n\r\nFinal interview was with someone from HR & an ombudsman manager. Both very pleasant and encouraging. First part was going through your answer to the case study and second part was competency questions. Make sure you use the STAR technique - they also asked a load of follow up questions based on the examples I was giving", "Interview Questions": "Why do you want to work here?\r\nWhat do you think would be the most challenging aspect of the job?\r\nDescribe a time you managed multiple deadlines\r\nDescribe a time you made a decision where the solution was not immediately obvious\r\nDescribe a time you dealt with a difficult customer"}, {"date": "6 Aug 2021", "title": "Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Financial Ombudsman Service (London, England)", "Interview Descriptions": "Written test and interview. I passed the test and was told that my interview was excellent but they declined to advance me. The HR person was v nice. The employees that I passed all looked stressed out and unhappy.", "Interview Questions": "Very basic STAR type questions."}, {"date": "4 Aug 2021", "title": "Investigator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. I interviewed at Financial Ombudsman Service (London, England) in Aug 2021", "Interview Descriptions": "Long process but it was a good experience. 5 steps overall. I think it’s best to go with a recruitment agency through this process as they do help a lot. They ask mainly competency based questions.", "Interview Questions": "Describe a situation where you had a difficult customer"}, {"date": "6 Aug 2021", "title": "Investigator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Financial Ombudsman Service (London, England) in Aug 2021", "Interview Descriptions": "It was really pleasant- it felt more like a chat than an intimidating question/answer session. It was an online session (due to COVID) and I was interviewed by two people- HR and an Ombudsman Manager.", "Interview Questions": "Why do you want to work at the FOS?\n\nProvide a time when you have worked in a target-based environment\n\nProvide a time you have dealt with an angry/difficult customer.\n\nI was then asked follow-up questions once I gave my answer, so providing solid examples and using the STAR technique really helped provide structure. \n\n"}, {"date": "4 Jul 2021", "title": "Adjudictor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Financial Ombudsman Service", "Interview Descriptions": "Typical CBI interview. If you trawl through the various Govt. websites you'll find all the relevant buzzwords to tick all their boxes. Not a very human experience, but I suppose things have to be standardised across large organisations.", "Interview Questions": "Describe a time when you... and then STAR."}, {"date": "15 Jul 2021", "title": "Investigator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Financial Ombudsman Service (London, England) in Jul 2021", "Interview Descriptions": "Telephone interview > Two competency based questions > Verbal reasoning and Numerical deduction test > Online assessment which is a prioritisation task and case study > Face to face interview (via Microsoft Teams now due to COVID)\r\n\r\nHiring process seemed a little long winded but most companies do this to find the exact skills they're looking for!\r\n\r\nJust be yourself and implement the STAR technique - this keeps you from waffling unnecessarily.", "Interview Questions": "How do you stay up to date with any changes or updates that relate to the work you do?"}, {"date": "18 Jun 2021", "title": "Investigator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Financial Ombudsman Service in Jun 2021", "Interview Descriptions": "I found the application on Indeed and then applied direct through the Ombudsman's website. Provided a CV and Covering letter which set out answers to two competency based questions. Then completed a verbal reasoning test and a telephone interview.\r\n\r\nI did not get passed the interview stage. \r\n\r\nI applied for the role as I was working within a legal background and was knowledgeable about the financial products that the Ombudsman dealt with. (The job application was looking for someone specifically with a legal background and who knew about financial products). \r\n\r\nI was able to answer all questions given to me and provide some really good examples of work I had done that suited me to this role. I had the exact experience the company was after and felt I was quite well suited to the role. \r\n\r\nThe interview did feel very dry however. The interviewer gave off the vibe that she really wasn't interested from the get go, and almost just felt like a robot reading off the screen. (A similar review to someone else on here). I made sure at the end of the interview to ask if there was anything I could expand upon, which I did. The interviewer at the end agreed I had ticked off her boxes. The interviewer said it would be a couple of days before they would come back to me with a decision. \r\n\r\nI received a decision back the same day with a rejection. \r\n\r\nI get the impression that the Ombudsman had already filled all the roles up, and just had to finish off interviews in any event.", "Interview Questions": "- What do you know about the FOS\r\n- Why do you want to work at the FOS\r\n- Name a time you dealt with a complex decision and what did you do\r\n- Name a time you dealt with a challenging customer and what did you do"}, {"date": "18 May 2021", "title": "Investigator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Financial Ombudsman Service in May 2021", "Interview Descriptions": "Very quick process. 5 stages of recruitment: CV/ Cover letter; verbal reasoning tests; telephone interview; case study and finally a face to face interview (remote due to COVID-19).\r\n\r\nI applied online through the FOS website by submitting my CV and a covering letter. The next day I was sent a link to complete 2 verbal reasoning tests. After passing these I was invited to a telephone interview the next week.\r\n\r\nThe telephone interview lasted between 20-30 minutes and the man who interviewed me was very friendly. Here I was asked competency based questions. At the end of the telephone interview I was told that they would be progressing my application to the next stage. I was then asked to complete a case study where I had to make a decision. The case study was fairly simple and gives you an idea of what you would be doing on the job. I was worried about the case study but don't, it just requires common sense. The case study was then marked by an ombudsman manger.\r\n\r\nAfter successfully completing the case study I was offered a remote interview with someone from HR and an ombudsman manager. Both of my interviewers were very friendly and made me feel relaxed during the interview. They asked me questions about the case study and then some competency based questions. The interview was less than an hour long. They said that they would get back to me within 24 hours - which they did!", "Interview Questions": "- Why do you want to work at the FOS?\r\n- What do you know about the FOS and the role?\r\n- Why do you skills and experience help with this role?\r\n- Tell us a time you had to manage a tight deadline.\r\n- Tell us a time you had to solve a problem without help from a manager.\r\n- Provide a time you have dealt with an angry/difficult customer.\r\n- Provide a time when you have worked in a target-based environment.\r\n- Provide an example of a time when you've had to make complex decisions.\r\n- What do you think will be the most challenging part of the job?\r\n\r\nThere were a few more that I cannot remember."}, {"date": "26 Apr 2021", "title": "Adjudicator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. I interviewed at Financial Ombudsman Service", "Interview Descriptions": "Telephone interview with the recruiter, before moving to onsite interview. consists of written and verbal. Depends on how well you perform on the written stage, this will determine your progression to 1;1", "Interview Questions": "How would you deal with a difficult customer"}], [{"date": "9 Apr 2021", "title": "Investigator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 3 weeks. I interviewed at Financial Ombudsman Service (London, England)", "Interview Descriptions": "Felt very relaxed, know how to use the STAR technique and you should be fine. It is important for them to understand how you systematically solve a problem as it is the nature of the job.  Answer your questions in a conversational way, that way, you don't panic and get your delivery all tangled up.", "Interview Questions": "-Tell us a time where you had to deliver a good service\r\n-Tell us a time you had to manage a tight deadline...\r\n-Tell us a time you had to solve a problem...\r\n"}, {"date": "2 Feb 2021", "title": "Adjudicator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Financial Ombudsman Service", "Interview Descriptions": "I had to do a series of tests.", "Interview Questions": "Why are interested in working for the financial ombudsman?"}, {"date": "8 Feb 2021", "title": "Investigator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Financial Ombudsman Service (London, England) in Jan 2021", "Interview Descriptions": "A robot from HR called, asking very simple questions . He was totally unresponsive, cold and simply carrying out an data entry exercise.  He made me feel incredibly awkward, I would be way more comfortable leaving a voicemail as a job application.  The worst of all is, I didn't pass the \"phone interview\" which is very strange given my skillset, experience and the answers I gave.", "Interview Questions": "Same questions that I answered on the initial application plus what does an investigator do, what do you know about FOS...etc. "}, {"date": "23 Dec 2020", "title": "Investigator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Financial Ombudsman Service (London, England) in Dec 2020", "Interview Descriptions": "I was offered a telephone interview following the submission of my CV, a personal statement and a verbal reasoning test. \r\nThe telephone interview itself was fairly standard, although it felt as if the interviewer just wanted to go through the motions as quickly as possible. It felt quite robotic, scripted and impersonal - I didn't get the sense that she knew anything about me at all, besides my name. I have very little customer service experience, as evidenced in my initial application. Nevertheless, I attempted to tailor an answer to the \"dealing with a difficult customer\" question as best as I could, but ultimately I think my answer was pretty poor. My advice to potential applicants or those with a forthcoming interview would be to prepare to answer customer service based questions, regardless of whether you've made your previous experience (or lack thereof) clear. Be confident tailoring your answers, and don't stumble if you're caught off guard. \r\nFinally, the phone connection was pretty terrible. It sounded as if the interviewer was underwater, and I could hear her typing notes on my responses which was quite off putting. \r\nGood luck!", "Interview Questions": "What is your understanding of the role? \r\nHow do your skills and experience fit the role? \r\nProvide an example of a time when you've had to deal with a difficult customer. \r\nProvide an example of a time when a decision you've made has had implications for your team. \r\nProvide an example of a time when you've had to make complex decisions within a limited time frame. "}, {"date": "29 Sept 2020", "title": "Investigator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. I interviewed at Financial Ombudsman Service (London, England) in Sept 2020", "Interview Descriptions": "Phone interview, I then review a document where I had to answer some questions, I will then find out if I made it to the second process. Then an inperson interview was scheduled where we talked more about the service they provide.", "Interview Questions": "They wanted to know if you knew about the role and what an ombudsman does."}, {"date": "20 Aug 2020", "title": "Investigator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Financial Ombudsman Service", "Interview Descriptions": "Difficult and complicated. After going through all stages, I was denied an offer due to 'lack of experience' which they could have just stated at the start as it was seen on my CV. Overall, good communication about the interview process and everything was well timed and spread out.", "Interview Questions": "Why do you want to work at the FOS?"}, {"date": "11 Aug 2020", "title": "Investigator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied through a staffing agency. I interviewed at Financial Ombudsman Service", "Interview Descriptions": "One word to describe the recruitment process at the FOS..... (Pathetic!). Please read this review and previous reviews on interviews and the company itself before applying for this role.  I was contacted by a recruitment agency (You will be approached like this) and the recruiter went through my CV and asked if I am interested in the role. If you say yes, then you will be invited to a phone interview that will last for 30-40 minutes. In order to prepare for this interview, you will need to prepare for the competency questions that will be asked relating to the 'role' (note how I emphasised the word 'role'). If you pass this phone interview,  you will then be invited to a verbal reasoning test. If you pass that, then you will get a written excercise where you will have to write a response to a complaint. Now here's the catch. No matter how clearly you explain the issue on the complaint and reach a valid conclusion if you pass; you will still have to give reasons as to why you reached that response regardless of already giving a detailed reason in the written excercise. After passing the written excericse, you will be invited to a face to face interview. Now this is where it gets interesting. You will be informed beforehand that the interview will be based on first talking about the case study, then just general question regarding FOS and finally competency question on the role (so basically a repeat of the same questions that were asked by the recruiter but by using different examples). Now I would understand how important the star technique is for interviews and I have used this in an effective manner in the past but to be told that you need to add certain things in your answers for these questions to actually answer these questions is ridiculous). How can you brag about promoting diversity if you want a certain type of answer from a applicant. You constantly report promoting diverse working environment and say that this prevents this one size fits all ideal at workplace but are doing the exact opposite on interviews?  I see many negative reviews here regarding the company prior to applying and I thought that these reviews were only written in spite as these individuals did not  get the job but after applying for this role. I was wrong.  And while we are at it, lets address the elephant in the room. For those of you wondering who this recruitment agency is? It goes by the name of Addecco. Good luck, stay blessed and avoid this organisation the best you can!", "Interview Questions": "Why do you want to work for the FOS?"}, {"date": "5 Aug 2020", "title": "Investigator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Financial Ombudsman Service in Aug 2020", "Interview Descriptions": "Quite a long but straightforward process. I had 5 steps in total: initial application, verbal reasoning test, telephone interview, case study and finally the face to face (video) interview.", "Interview Questions": "What do you think will be the most challenging part of the job?\r\n\r\nBasic competencies, I used the STAR technique to answer. Make sure you know the scenarios in depth because they asked follow-up questions after the initial answer. "}, {"date": "11 Aug 2020", "title": "Investigator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Financial Ombudsman Service (Coventry, England) in Jul 2020", "Interview Descriptions": "The interview process was long, which consisted of 5 stages: 1) Online application; 2) Verbal Reasoning Test; 3) Telephone Interview; 4) Online case study; and 5) Online 'face-to-face' Interview. I had to pass each stage to progress towards the next stage. \r\n\r\nI applied online on the FOS website which requires you to submit a CV and covering letter. \r\nAfter succeeding with my initial application, I was sent a link to complete their Verbal Reasoning Test which must be completed within 2 days. This was the SHL Verbal Reasoning test, where I needed to answer 30 questions in 19 minutes. \r\n\r\nAfter passing this, I had to book my 30-minute telephone interview within the next week. I had a lady from HR call me and the interview lasted about 17 minutes. She asked me general interview questions about myself and some competency questions. \r\n\r\nAfter passing this stage, I received an email to complete their online case study within 2 days. I was presented a case study about a customer asking for a refund for tickets from an organisation. The case study was about a page long. I had to then write a letter to the party who I will be deciding against and give reasons for my decision. I had another question, where I had to explain any reasons why I think that party will disagree with my reasoning. I structured my letter in two sections: 1) A brief overview of the complaint; and 2) My Decision, with the reasons why. To help with how to structure my answer, I researched the FOS website and found a page with decisions made by Investigators on various matters, so I tried to follow this structure. It helped me understand common things that Investigators must explain in their decision. \r\n\r\nAfter passing this stage, I was invited to the final interview. Due to Covid-19, it had to be conducted virtually over Webex. I was interviewed by a lady from HR and another Ombudsman Manager. The interview was an hour long and was split in 3 stages: 1) The Ombudsman Manager discussed my answer in the case study and how I came to that decision. He also tried changing little details from the case study to see if my answer will change. He grilled me very specifically about what method I used to reach the decision; 2) The second stage had strengths/ competency questions, and was the longest stage of the interview process. They concentrated on 3 main competencies and asked me questions relating to this. The lady from HR was very positive and friendly but the manager from Ombudsman grilled me intensely about my answers! His next questions would be based on what I said in the previous answer. He tried to grill me about my past job as a Paralegal and tried to challenge the legal knowledge I had explained in the situations for the competency questions, which I thought was highly irrelevant. I wasn't sure if he wanted me to provide answers that he thought were irrevocably right or if he was grilling me on purpose to see how well I handle myself when challenged, but regardless I explained myself well and stuck to my answers confidently. I'm not sure if I got unlucky with the interviewer I had, or if they are all like that, but I would come very prepared. 3) The final stage was where I could ask questions about the job, which I spent about 10 minutes questioning the role. \r\n\r\nI got rejected at the last stage of the application process which was extremely disappointing, especially as I thought the final interview had gone well and I had nailed it, regardless all that intense grilling. I was told that I would hear back within 48 hours and the rejection email was sent the day after my interview. I had wasted a month and a half going through their long recruitment process and was not even provided with feedback in the rejection email. So, I emailed the lady from HR asking for feedback, and I was never received a response even now, which is extremely rude considering the time and effort I put in preparing for this role.", "Interview Questions": "I cannot remember all the questions from the final interview as I was being grilled for most of it, but these are telephone interview questions I got asked: \r\n\r\n1) Why have you left your current role? \r\n2) Why do you want to work for us? \r\n3) What do you know about the role?\r\n4) Example of dealing with a dissatisfied customer.\r\n5) Example of when you had to make a complex decision. \r\n6) What skills/experience do you have? \r\n7) Why will your skills and experience help with this role? \r\n\r\nFrom the final interview, when they asked me, I told them I did not uphold the complaint because it was unreasonable. The manager started asking me what 'reasonable' was. I come from a legal background so I explained I would use the civil standard of reasonable, then he went into detail about to what extent I would think something is reasonable and something is not...so be prepared to be grilled intensely about your answers and provide logical reasons. \r\n\r\nThere was also a competency question about how I would handle an unreasonable customer, how I would handle a complaint and what I think is important to succeed in that role."}, {"date": "21 Nov 2020", "title": "Investigator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 4 months. I interviewed at Financial Ombudsman Service (London, England) in Jul 2020", "Interview Descriptions": "I applied through a recruitment company. The process was ok but had a sense it was disorganised as I interviewed in July and the interview wasn't reviewed until October.", "Interview Questions": "Competency-based questions like \"Tell us about a time you showed initiative\""}], [{"date": "20 Jul 2020", "title": "Caseworker Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Financial Ombudsman Service (London, England) in Jun 2020", "Interview Descriptions": "Long process that involved application, screening phone interview, VR test, case study and video interview. \r\n\r\nQuestions in the video interview were the same as questions in the screening telephone interview but you were expected to come up with additional scenarios.", "Interview Questions": "Please give an example of a time you dealt with a difficult customer"}, {"date": "22 Jun 2020", "title": "Investigator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Financial Ombudsman Service (London, England) in May 2020", "Interview Descriptions": "Long and no respondive took me a lot to get them responding to my email.  Confusion about the number you have to call and kept me speaking with so many different ppl from the company", "Interview Questions": "As usual"}, {"date": "2 Feb 2020", "title": "Adjudicator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at Financial Ombudsman Service", "Interview Descriptions": "After the telephone interview which was just a chat to get to know you better and if you're suitable for the role. The face to face Interview was with two people each asking around six or seven competency based questions in total. The interview was quite informal and pleasant with the opportunity to ask questions.", "Interview Questions": "Working in a team"}, {"date": "5 Jan 2020", "title": "Investigator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Financial Ombudsman Service (London, England)", "Interview Descriptions": "The most long winded and worst interview process I have experienced just for the Investigator role, basically investigating and responding to complaints.\r\n\r\nFirst was a verbal reasoning test, then a telephone Interview, then a cover Letter.\r\nAnd once you've overcome all that then you get invited to the 'interview' where you have to respond to a case study and ONLY if you pass that will you go onto the main interview.\r\n\r\nUpon entrance into the building, the atmosphere was very institutionalised and unfriendly. Eventually you get placed in front of a desk to respond to the case study.\r\n\r\nAfter completing the case study, somoene takes your paper and you are asked to wait for about 20 minutes in that same room.\r\n\r\nAn asian lady appeared eventully and said you were not successful and will not be pproceeding to te next stage. This news was openly spoken with the door wide open with people standing \r\nclose by and next to another applicant with his door wide open and therefore heard what happened.\r\n\r\nI have never experienced such unprofessionalism and embarrasment at a job interview.\r\n\r\nFeedback via the recruiter was later provided, stating that my letter lacked reasoning, the events were reiterated and the writing was generally poor.\r\n\r\nThe manner in which this letter was written is industry standard and whilst I welcome all opnions to improve my letter writing, i have absolutley no idea what clown was marking the paper \r\nand was written as per their requirments. This is not bitterness but the whole process was a JOKE. \r\n\r\nI was told they have rejected many applicants previously and have many vacancies for INVESTIGATOR to feel and now I know why.\r\n\r\nPLEASE ask yourself whether this job is worth it as it would seem its a horrible place to work.", "Interview Questions": "Thank goodness I didnt get that far"}, {"date": "13 Jan 2020", "title": "Investigator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 4 weeks. I interviewed at Financial Ombudsman Service (London, England) in Jan 2020", "Interview Descriptions": "Same as everyone before. CV verbal reasoning test, cover letter and then an interview. \nI was worried about the case study but it was a little bit if common sense just have a good structure. I wrote mine out with dear **** sorry for the delay whilst I dealt with your complaint.... I had three bold headers for each section (complaint overview, my decision and solution) then finally a sign off. \nOnce you pass that you'll have a face to face compatency interview which had around 5 questions my tip would be have an example for all the comps not for a specific questions so you can adapt it to the question asked. The two people who interviewed were really nice and encouraging and we had a couple laughs at the end. \nThe office is similar to my current but everyone who passed me did smile and say hi which in the civil service where I'm coming from is rare.", "Interview Questions": "tell about a time you worked in a team."}, {"date": "19 Dec 2019", "title": "Investigators Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Financial Ombudsman Service (London, England) in Dec 2019", "Interview Descriptions": "4 stages, application stage, online assessment,  phone interview, case study and then face to face interview.  If you pass the first two stages then you have a phone interview, if you pass you get invited to the headquarters for a case study and then if you pass you have a face to face interview the same day.", "Interview Questions": "One time where you have helped a colleague solve a problem ,  one time where you have dealt with a challenging customer , one time where you have solved a problem without any managerial assistance"}, {"date": "9 Nov 2019", "title": "Investigator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Financial Ombudsman Service in Nov 2019", "Interview Descriptions": "You apply on line through Reeds Recruitment, then you will do some on line tests.  After passing the on line test, you will do telephone interview and also write a 700 word covering letter on why you want to work in Financial Ombudsman services,. The covering letter will be considered together with the telephone interview before you are invited to the face to face interview", "Interview Questions": "A case study interview where you have to write a letter to a customer based on the case matter. You then discuss the rationale for the decision reached on the case with the interviewers and you will answer  some competency based questions."}, {"date": "17 Oct 2019", "title": "Investigator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. I interviewed at Financial Ombudsman Service (London, England) in Oct 2019", "Interview Descriptions": "2 stage process. A written exercise and then if you are successful, a follow- up panel interview. I found the written exercise laughable and wasn't that interested in the role given the low pay. However after the written exercise I had to wait 30/45 minutes (as opposed to the 5-10 minutes I had been advised I would have to wait) just for the relevant employees to review my written exercise to let me know if I was going to the second round interview. This further added to the old school, inefficient public service vibe. This plus the Ugg boots on the staff were a bit lacklustre.", "Interview Questions": "The scenario they gave for the written exercise was hilarious and difficult to take seriously. As a while the place seemed to take itself very seriously, particularly in light of the low pay. Employees wear Ugg boots to work, so it doesn't feel very professional either. "}, {"date": "3 Oct 2019", "title": "Investigator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I applied through a staffing agency. I interviewed at Financial Ombudsman Service (London, England) in Oct 2019", "Interview Descriptions": "Approached by a recruiter after finding my  CV online. Online reasoning test followed by personal statement and telephone interview.  \r\nOn site appointment consisting of a case study exercise followed by face to face.", "Interview Questions": "Basic competency"}, {"date": "7 Jul 2019", "title": "Adjudicator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Financial Ombudsman Service", "Interview Descriptions": "A panel of two individuals asking you questions based around their core values. Thats bascially it. About 4 or 5 questions. One person writes whilst the other person asks you the questions.", "Interview Questions": "When were you impartial?"}], [{"date": "19 Oct 2021", "title": "Investigator Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Financial Ombudsman Service (London, England) in Jul 2019", "Interview Descriptions": "Online application and tests, followed by case study and face to face interview with 3 people.\n\nCase study was to review two letters from customers and steps you'd need to take to further assess their complaint.", "Interview Questions": "Difficult customer scenario and how you dealt with them."}, {"date": "21 Jan 2020", "title": "Investigator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Financial Ombudsman Service (London, England) in Jun 2019", "Interview Descriptions": "Applied through a recruiter, there was an online test that I had to pass after this followed by a phone interview. Finally, a face to face 3-panel interview consisted of a test and a competency-based style interview.", "Interview Questions": "How have you dealt with a difficult customer?"}, {"date": "8 Apr 2019", "title": "Ombudsman Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Financial Ombudsman Service (London, England) in Mar 2019", "Interview Descriptions": "An unnecessarily long process including a telephone interview, going in for a scenario test and culminating in a traditional interview on a different day but which included reviewing the scenario test (undertaken a couple of weeks prior) in a rather strangely pedantic way. The panel interview was the final stage of the process and you would logically assume that you had done sufficiently at the previous stages but they were picky and pedantic about the test scenario looking for black and white answers. Halfway through the interview I decided I would not take the job if offered so I was not at all disappointed not to be offered the role. The panel included two Ombudsman Leaders who came across as very old school and suspicious of outsiders. Of course you won't get every job but you still generally corm away with a positive experience but not in this case. I can see why the FOS has such negative reviews from former and even current staff. The overriding impression it has left on me is of an organisation that doesn't understand that it isn't possible to change with the same management attitudes - it needs a new, fresh and different approach as it does seem that all the internal promotion has made it even more regressive and inward looking.", "Interview Questions": "What experience have you had of work cultures?"}, {"date": "18 Mar 2019", "title": "Ombudsman Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Financial Ombudsman Service (London, England) in Feb 2019", "Interview Descriptions": "First stage was a test in their offices. I had to write a decision on a case whereby an adjudicator/investigator had already made a decision.  Also had a short management task. This was followed by a short discussion with a member of the HR team. I was told what to prepare for the following interview should I pass the task. I did pass the task however the following telephone interview was not what I was told to prepare. I  also felt that my current role wasn't fully understood by the interviewer. The questions asked were basic but they did not really go into enough detail in terms of what is expected and how my skills could match. I believe a face to face interview would have been far greater.", "Interview Questions": "Challenges of the FOS"}, {"date": "17 Feb 2019", "title": "Contingent Investigator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 1 day. I interviewed at Financial Ombudsman Service (London, England) in Feb 2019", "Interview Descriptions": "First part - Role Play. Take info from complaining customer on the phone. Remember to use open and closed questions as well as probing ones. Demonstrate empathy and summarise the call. Take as much info as possible because you will write the outcome in the second part. 15 mins\n\nSecond Part - write the outcome letter based on your conversation. 30 mins. You need to write what happened and why you decided the outcome. Again, demonstrate empathy in the letter.\n\nThird part - competency interview. Standard customer service questions. Working in a team, working under pressure, impacts of poor service. \n\nI didn’t get because I did not show empathy.", "Interview Questions": "Why do you want to work here"}, {"date": "15 Jan 2019", "title": "Not Disclosed Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Financial Ombudsman Service (London, England)", "Interview Descriptions": "Applied through an agency, interviewed in their office after a few weeks. I had to do an online data entry and accuracy test. The recruiters seem professional although they have forgotten I had an interview booked. \r\nThey emphasize a lot on following the star technique, but even if you follow it, that might be not enough because you have to remember to say A LOT of details. I mean, it is ridiculous, in a normal conversation people do ask questions if they want to know more about you in details, so why in interviews this is unacceptable?\r\nThe interview itself was rather long (1hour), they grilled me with a lot of questions, asking for very specific details which I have replied thoroughly. \r\nI thought I did very well, my examples were real examples and on point. They've reassured me it wasn't that important if I forgot some details in the STAR  answers and helped me in getting knowledge of what they wanted to know.  I have a lot of experience and am a genuine person who really cares about helping people. I genuinely thought I would be selected. \r\nTheir feedback was that I didn't follow the STAR approach the way they wanted it.\r\n? \r\nI really do not understand how could they put this first in choosing applicants. Certainly having a good, positive approach to people, be genuine and hardworking is not enough for them, even if you consistently deliver evidence through your stories. Maybe you should completely fabricate your experiences so you can make them happy. Ridiculous.", "Interview Questions": "Tell me about a time when, as a team,  you had to deal with a difficult situation at work"}, {"date": "19 Mar 2019", "title": "Investigator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Financial Ombudsman Service (London, England) in Jan 2019", "Interview Descriptions": "I applied for the role online, and got invited to complete an online test following this. Two weeks later I was offered a telephone interview, and a face to face interview on the call having passed this. The first part of the interview was a case study and a series of questions relating to it.  The second part consisted of a face to face interview with a panel of three - one HR and two Ombudsman managers. The questions were competent based, and going through my CV and relevant experience in relation to the role advertised. They also questioned the answers regarding my decision making on the a case study. I urge you to be vigilant and be confident in your reasoning so you can answer all of their questions logically. Don't allow yourself to get flustered or rattled, bare in mind they will be playing devils advocate essentially.", "Interview Questions": "What does diversity in the work place mean to you?"}, {"date": "8 Mar 2019", "title": "Investigator Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Financial Ombudsman Service (London, England) in Jan 2019", "Interview Descriptions": "After initially applying there are a further three stages (verbal reasoning test, telephone interview & in person interview) to complete. Final stage includes a case review and 3 person q&a. \n\nReached final stage however post interview felt FOS were not as impartial as they try to convey and people who file complaints with them are aggressive pests.\n\nOffer declined as felt would be pressured to side with companies in disputes rather than on facts, which is evident by being informed  65-70% of complaints are found in favour of companies.", "Interview Questions": "Example of working within a team."}, {"date": "28 Apr 2019", "title": "Investigator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 7 weeks. I interviewed at Financial Ombudsman Service (London, England) in Jan 2019", "Interview Descriptions": "The interview process is broken down into two parts. The first is a telephone interview with a member of HR.  If that is successful you are then interviews in a three panel interview with two managers and a member of HR.", "Interview Questions": "Why is diversity and inclusion important "}, {"date": "15 Nov 2018", "title": "Investigator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Financial Ombudsman Service (London, England) in Oct 2018", "Interview Descriptions": "Online application, then had to do verbal reasoning test followed by a telephone interview which lasted 30 minutes. I was invited to a face to face interview a week later. I had to first do a case study which was very basic and simple it required me to read the document and come to a decision, i had to write a professional letter explaining my decision. Later had a face to face interview with 2 managers and a HR lady where we discussed the case study in some detail.  They further asked some competency questions. It is important to use the STAR technique. The case study task was 45 minutes and the face to face interview lasted for about 45 minutes too. Make sure you go into the interview prepared with strong examples for the competency questions. Remember to read the job description properly and identify what they are looking for in a person and use this to make your preparations, highlight the key skills and experience they are looking for and remember to mention these throughout your examples.", "Interview Questions": "Why do you want to work for the FOS?"}], [{"date": "31 Oct 2018", "title": "Investigator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Financial Ombudsman Service (London, England) in Oct 2018", "Interview Descriptions": "Relatively straightforward process, I applied online, completed a verbal reasoning test, followed by a telephone interview and then face to face interview. \r\nThe telephone interview consisted of questions around what you know about the company and why you would be good for the role. You are also asked a couple competency questions around change management and dealing with a difficult customer. The face to face interview consisted of a written exercise and then  a mixture of competency and motivation questions from a 3 person panel.\r\nFor the written exercise you are given a case study and then told to answer 3 questions about what you have read and write an email/letter of advice to the customer.\r\nMy only complaint was that I felt more time was needed to complete this section !", "Interview Questions": "Give an example of a time where you have had to take a call from a customer about a sensitive issue."}, {"date": "10 Oct 2022", "title": "Complaint Adjudicator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 5 days. I interviewed at Financial Ombudsman Service (London, England) in Oct 2018", "Interview Descriptions": "Pleasant enough two-stage process. catch up with affable managers who asked relevant questions, and a secondary complaint assessment and writing test.\r\n\r\nThe secondary assessment involved reading over a complaint scenario and writing out a response to the complainant to give them a fair outcome.\r\n\r\nIt should be noted this was for a contractor position.", "Interview Questions": "Do you see FOS as a consumer champion?"}, {"date": "17 Sept 2018", "title": "Adjudicator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through a staffing agency. I interviewed at Financial Ombudsman Service (London, England) in Sept 2018", "Interview Descriptions": "I was recruited by REED and was told there is gonna be a written and a face-to-face part of the interview.\r\nThe whole experience was highly disappointing. These people don't care if you have relevant experience or skills. The only thing they are worried about if you can write a made-up formal letter in 40 minutes without making any grammatical or spelling mistakes. Guess what?! If your letter is not perfect you don't even get to talk to the interviewer, they just send you away, saying you didn't make to the \"next round\". \r\nNo wonder why the reviews of this organisation are so bad.\r\nI am just concerned about the customers they get to work with. I hope I will never have to deal with them again!", "Interview Questions": "N/A"}, {"date": "23 Sept 2018", "title": "Investigator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Financial Ombudsman Service (London, England) in Aug 2018", "Interview Descriptions": "It was really relaxed, I was asked about 5 questions the lady made me feel at ease and probes me to get the answer right. There was a clear vision, on what they wanted and I could see myself working there. I enjoyed the talk.", "Interview Questions": "why change of career path?\r\nHow will you deal with a difficult customer? "}, {"date": "25 Oct 2018", "title": "Mass Claims Consultant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Financial Ombudsman Service (London, England) in Aug 2018", "Interview Descriptions": "Applied online and was given a test to complete after I got shortlisted. Basic test on keyboard speed and accuracy. Came in for a interview a few days later. Interview seemed pretty straight forward, 3 general questions followed by 3 competency questions. Thought it went well but got feedback declining because they had to 'probe' me on one question, so make sure you have a LOT to say, and dont waffle.", "Interview Questions": "What do you know about ppi? \r\nWhy are you interested in this role? \r\nTell us about a time where you had to change your communication when dealing with a customer.\r\nTell us about a time where you worked in a team and faced difficulties. "}, {"date": "26 Aug 2020", "title": "Adjudicator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 1 week. I interviewed at Financial Ombudsman Service (London, England) in Aug 2018", "Interview Descriptions": "I had a face to face with a member of the hiring team. I had to prepare an uphold decision made by the FOS and a non-uphold as I would be questioned on one of them.", "Interview Questions": "Why do you want to work for FOS\r\nExplain an example of the uphold/non-uphold complaint you chose"}, {"date": "15 Jan 2020", "title": "Contractor Complaints Adjudicator Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Financial Ombudsman Service (London, England) in Jul 2018", "Interview Descriptions": "All done through Reed. They missed my application then very apologetically called and booked me for an interview the next day. Everyone had to travel to Canary Wharf. 30 minute practical test to assess writing skill and grammar. Then ten minute conversation with someone I've never met since. Offered the job the next day.", "Interview Questions": "Why I wanted to work at FOS (it was the only thing they directly asked)"}, {"date": "13 May 2018", "title": "Investigator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 2 weeks. I interviewed at Financial Ombudsman Service", "Interview Descriptions": "Very straight forward process. Applied online within two hours sent an assessment. Then had a telephone interview followed by face to face interview and assessment. Make sure u have a decision making example ready for your telephone interview", "Interview Questions": "Tell me a time you have to deal with a difficult customer"}, {"date": "15 Feb 2018", "title": "PPI Case Handler Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Financial Ombudsman Service (London, England)", "Interview Descriptions": "Initial communication was good. 2  telephone interviews with standard questions.\nI was then invited for a more formal interview and assessment.  No feedback at all was provided regarding the assessment.\nThe interview was standard and the majority of staff I encountered polite. Some of the HR staff could do with some training.\nThe main issue I had was the lack of communication and feedback following the interview. I was not offered a role  and was sent a standard we went with other candidates email. I was advised I could have feedback on my interview and assessment. I requested this immediately just so I could understand if there were any areas I need to work on. I still have not had a response.", "Interview Questions": "Hoq would you describe your management style"}, {"date": "27 Jan 2018", "title": "Adjudicator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through a staffing agency. I interviewed at Financial Ombudsman Service (London, England)", "Interview Descriptions": "Done through an agency who was very professional, organised and provided excellent advice. The agency found me as they seek out potential applicants with the relevant knowledge and/experience to do the job so this came as a pleasant surprise. They guided me through everything.", "Interview Questions": "All standardised questions such as ‘describe a time when you’ve had to deal with a difficult customer’"}], [{"date": "4 Dec 2017", "title": "Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "The process took 3 weeks. I interviewed at Financial Ombudsman Service", "Interview Descriptions": "Interview with two members of HR. Questions were poorly-phrased and repetitive. I was promised that the outcome would be email to me within the next three days, but I waited for over two weeks. \n\nI did not receive an offer, so emailed them for feedback. Their response was that ‘I hadn’t answered the questions well enough.’ \nRefused to pay for travel expense, and highly disorganised. \n\nWould not recommend.", "Interview Questions": "Basic competency questions."}, {"date": "1 May 2018", "title": "PPI Case Handler Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through a staffing agency. The process took 1 week. I interviewed at Financial Ombudsman Service (London, England) in Dec 2017", "Interview Descriptions": "okay, have to do an assessment, where you write a letter. The letter cannot have any mistakes grammar, spellings or formatting. if successful you go to the face to face interview stage.", "Interview Questions": "N/A"}, {"date": "24 Oct 2017", "title": "Adjudicator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. I interviewed at Financial Ombudsman Service", "Interview Descriptions": "There was an initial application with the submissions of a CV and cover letter, then a telephone interview and an assessment. Then an interview face-to-face. The interview was with a team manager and HR manager.", "Interview Questions": "Describe how you've been flexible in your approach to work."}, {"date": "25 Sept 2017", "title": "Adjudicator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through a staffing agency. The process took 3 weeks. I interviewed at Financial Ombudsman Service (London, England)", "Interview Descriptions": "The first stage is a CV submitted with covering letter. Telephone interview with recruiter, straightforward with a basic understanding of role required. The motivation behind application also questioned. Successful conversations will lead to an interview at London offices. Prior to the interview, one is subject to a pre-screen test consisting of a grammar test and two accounts of a time when you (enter situational scenarios). If one completes this satisfactorily they attend a face-to-face interview. This begins with a 30-minute task; write a final response letter to a client (Difficult). Grammar, spelling etc are paramount. The second part of the interview process is a 15/20 minute conversation with a FOS manager. Questions entailed CV related queries and motivations for applying (average). Additional technical questioning on a basic understanding of both role and industry are delivered (if prepared then average difficulty). It is then asked of one to present two decisions made by FOS including both uphold and non-uphold (difficult if not fully prepared). These should be pre-prepared and personal comments/opinions on decisions are desired to gauge candidates way of thinking.  Received and accepted an offer the following day.", "Interview Questions": "Why the financial ombudsman?"}, {"date": "15 Oct 2017", "title": "Investigator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Financial Ombudsman Service (London, England) in Sept 2017", "Interview Descriptions": "Wasnt too bad. \r\nWas asked to read a a case study and what decision I would make in the capacity of an investigator. Although being interviewed by 3 people was intimidating.\r\nFollowing this it was competency based questions.", "Interview Questions": "Competency based questions, focused on team work, initiative, working under pressure etc. "}, {"date": "29 Sept 2017", "title": "PPI Consultant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Financial Ombudsman Service in Sept 2017", "Interview Descriptions": "I applied for the role online where I was required to submit a CV and a cover letter. The application process isn't long. Heard from them after a month. Almost thought my application was rejected or simply didn't meet their requirement. Got a call for an interview. On the interview day I had to complete a case study which is really easy. You're given 30 minutes to complete it. Its basically a case study and an application form. You use the information from the case study to fill in the form. If you pass the case study you move onto the interview stage. I passed so I got to the interview stage. The interview was 45 minutes long by two interviewers. They're very friendly and make you settle in. Literally like just having a conversation really but in an interview style. Make sure you read about the role and prepare for the interview.", "Interview Questions": "Competency based questions\r\n1. Was there a time you came by a difficult customer and how did you handle the situation.\r\n\r\n2. How did you manage to meet tight deadlines. "}, {"date": "28 Jan 2019", "title": "Adjudicator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. I interviewed at Financial Ombudsman Service (London, England) in Sept 2017", "Interview Descriptions": "Interview with agency and FOS employee. Test on how you would respond to a typical query including writing a letter to the customer. Letter test takes 30 mins and is judged on how well you respond to the customer staying professional.", "Interview Questions": "general chat about your work history"}, {"date": "27 Sept 2017", "title": "Head of IT Support Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at Financial Ombudsman Service (London, England) in Sept 2017", "Interview Descriptions": "First interview with possible line manger was great, My second interview had HR asking most of the questions and I felt HR ran 2nd interview more like a quiz than an interview.", "Interview Questions": "Team management, technical and process"}, {"date": "5 May 2019", "title": "Mass Claims Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Financial Ombudsman Service (London, England) in Sept 2017", "Interview Descriptions": "the interview was fairly easy, they asked standard competency based questions that mostly based on customer service and communication skills. The interview lasted around 20 minutes and was fair straight forward.", "Interview Questions": "customer service based questions- going above and beyond for a customer"}, {"date": "28 Jul 2017", "title": "Ombudsman Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Financial Ombudsman Service", "Interview Descriptions": "First stage interview - competency questions, HR case study (dealing with poor performance from a team member) and a decision making exercise (assessing a complaint). \r\n\r\nSecond stage interview - a presentation on the challenges faced by the ombudsman. Also quizzed on the responses I had given to the written test, challenged on my thinking and reasoning. \r\n\r\nWas unsuccessful. The feedback I received was not constructive. I was told that my decision making was good, I defended my position well and they could understand my thinking. They said I came across well and I communicated clearly. The reason they gave for not offering the job was that I hadn't demonstrated decision making skills in the presentation. The presentation was on the challenges faced by the ombudsman so I hadn't used it as an opportunity to showcase my decision making skills, as it wasn't obvious that's what they were looking for. And, the case study was there to test my decision making. Given that they couldn't provide a good reason for not offering me the role I concluded that my face just didn't fit for whatever reason. \r\n\r\nAs a side note, whilst I was waiting for my interview in reception, a lady came in to ask if she could collect her stuff. She was explaining to the receptionist that she had left the organisation and hadn't had time to collect her belongings. Assuming she may have been one of the very unhappy members of staff who left without notice. Anyways, reception refused her entry to the building...", "Interview Questions": "Various challenges on the written case study - these will be specific to the answer you have given."}], [{"date": "2 Sept 2017", "title": "Adjudicator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Financial Ombudsman Service (London, England) in Aug 2017", "Interview Descriptions": "The process was not as expected as interview felt rushed. The competency questions were  standard but they could have been engaging and welcoming. It was hostile but having heard a few asian members of staff say racial epithets towards a black person, I am not surprised that some of the staff seem miserable.", "Interview Questions": "Give me an example when you dealt with a difficult customer?"}, {"date": "31 Aug 2017", "title": "Ombudsman Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Financial Ombudsman Service (London, England) in Aug 2017", "Interview Descriptions": "Terrible process.\r\n\r\nPhone interviewer didn't know anything about me and didn't appear to have read my CV prior.\r\n\r\nVarious faceless members of the HR contacted me with different information throughout the interview stage.\r\n\r\nAssessment was irrelevant and the feed back was a shambles.\r\n\r\nMy advice to anybody thinking of applying for the Ombudsman Manager role would be to avoid like the plague, not worth the £55k on offer.", "Interview Questions": "Biggest challenge the Ombudsman faces?"}, {"date": "8 Sept 2017", "title": "Ombudsman Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2+ months. I interviewed at Financial Ombudsman Service (Ware, England) in Aug 2017", "Interview Descriptions": "I'm an internal candidate and unfortunately my experience was just as poor as the external reviews posted on this site. \n\nQuestions pitched at totally the wrong level and some that were so long-winded they were barely understandable. \n\nFeedback following the interview again, echoes the other reviews. The feedback was generic and unhelpful, regurgitated straight from some kind of textbook. \n\nThe Ombudsman Leader that interviewed me was arrogant and incompetent. Unprepared to deliver the feedback (despite it being over a month after the interview) and totally unable to respond to challenge or probing questions about what the generic feedback actually meant. \n\nCemented my view that I should never have applied for the job. It's not worth the money - and would mean working for an incompetent \"leader\" with nothing to really show for it.", "Interview Questions": "What are the biggest challenges facing investigations at the moment?"}, {"date": "4 Sept 2017", "title": "Ombudsman Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Financial Ombudsman Service (London, England) in Aug 2017", "Interview Descriptions": "Online application which required supporting letter and 300 word statement as to why I thought I was suitable. Then telephone screening call lasting about 20 minutes. Emailed a couple of days later to say that they wouldn't be taking the application further, but that I could re-apply in 3 months time. Unfortunately when approached for feedback from the telephone screening I was told that they were not in a position to provide feedback to candidates.", "Interview Questions": "What interests you about working for the FOS."}, {"date": "20 Sept 2017", "title": "Ombudsman Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. I interviewed at Financial Ombudsman Service in Aug 2017", "Interview Descriptions": "Dis-jointed, no sense of urgency, lots of people busy being busy. No consistency in the person dealing with. Looked like a great work setting, in relation to chill out areas, facilities etc", "Interview Questions": "How did you decide what payment amount to make"}, {"date": "7 Jul 2017", "title": "Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Financial Ombudsman Service (London, England) in Jul 2017", "Interview Descriptions": "CV and cover letter with application form followed by telephone interview where I was asked  my reasons for wanting the role and to describe myself in 3 words.  First stage was a 2 hour long competency interview with 3-5 competency questions per area such as team work, making a difficult decision, making an unpopular decision etc. \r\nFollowed by time case study on a problem with staff where he was exceeding targets but he had a service complaint and his quality was poor. I was asked to draft how I would resolve the complaint and given 15 minutes to do so. I was also given 30 minutes to draft a final decision on a made up scenario of a restaurant  complaining about a defamatory article that had been published in a newspaper. \r\n\r\nAfter an intense day of these 3 aspects, I had to wait over 2 weeks for the final stage which was an interview to discuss my answers to the case studies and a 10 minute presentation on the challenges the fos is facing and how I would tackle them as an OM. \r\n\r\nThe 3 interviewers were all males and of English origin which I felt lacked complete diversity as a young Asian female. One of the interviewers sipped his ice cream drink as the other made up questions on the spot. They were extremely critical of my case study answers even though I had obviously done a great job as hardly anyone was called back apparently for the final stage. I thought this was a good cop, bad cop exercise so maintained my professionalism. \r\n\r\nFeedback I received was very generic and I was simply advised I didn't make the cut despite a 2 month process time. They tried to brush off the negative glassdoor reviews by claiming they were fake! My most worrying moment was when I arrived to my first stage interview and the receptionists were talking about how adjudicators were crying about the targets they could not meet. \r\n\r\nA complete waste of my time. Thankfully I applied elsewhere and have been offered a role. £55K really doesn't seem worth it, now I have experienced their total unprofessionalism.", "Interview Questions": "Case study on a member of staff exceeding targets but failing to call customers back. \r\nCompetency based 2 hour interview where I had to give over 15/20 examples in a star technique. \r\nTelephone interview. \r\n10 min presentation on the challenges and opportunities facing the service and how I would tackle them. \r\nDraft a final decision on the restaurant that lost business after the newspaper incorrectly published an article stating the restaurant had failed its hygiene test. "}, {"date": "5 Aug 2017", "title": "Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Financial Ombudsman Service (London, England) in Jun 2017", "Interview Descriptions": "Very poor standard of interview. Those that did the interviewing I'd love to see them doing their job. They clearly think they are perfect.  There was nothing in the process to discuss what experience you have and why you'd be good at the role. Based on previous experience and bringing that experience to the role isn't something they explored. Trouble is if you have experience I don't think they care - not interested and that's why they never asked. I think they're looking to see if you're under 29 and excited about everything from buying lollipops to turning up for work.  I would say too that the panel were not the slightest bit organised", "Interview Questions": "Various questions but none specific to me. They clearly hadn't read anything about me at all - they asked questions that you'd only know the answer to if you worked there. Too geared for that specific business. "}, {"date": "5 Jul 2017", "title": "Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Financial Ombudsman Service (London, England) in Jun 2017", "Interview Descriptions": "An online application form - covering letter and CV. Then a phone screening interview (this was billed as something I didn't need to prepare for). The person who interviewed me didn't seem to be aware of my CV and kept asking for recent examples of things I wasn't doing currently. They also told me at the end that I would need to be better at competency based interview questions (I hadn't prepared with those sorts of examples as I was told it was initial screening). I got through to the next stage - assessment centre, a one hour complaint case study and a 30 minute performance management case study. Then an hour's interview - mainly competency based, but also about motivations for applying etc. Got through to the final stage - a panel interview with an HR rep and 2 Ombudsman leaders. They asked questions in depth about the case studies and I then had to give a presentation - which also led to follow up questions on the presentation. They also blended in a couple of competency questions. I did not get a job offer - disappointingly, I didn't get a phone call or email to tell me this, but when the deadline they had given me  for hearing the result had passed I logged into the online system and found the result - but nothing beyond a statement saying 'unsuccessful'.", "Interview Questions": "The competency questions in the final panel interview were about leading a team in challenging circumstances and about applying analysis to reach a decision. I think the earlier interview covered: dealing with challenging staff attitudes, problem solving, workload management (and a couple of others I've forgotten)."}, {"date": "9 Jul 2019", "title": "Advisor Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Financial Ombudsman Service (London, England) in Jun 2017", "Interview Descriptions": "standard, 1 hr interview, good cop, bad cop and HR, it was all pretty straight forward. Noting was out of the ordinary. not good or bad. cant say much more about it tbh", "Interview Questions": "talk about Brexit and fos"}, {"date": "25 May 2017", "title": "Ombudsman Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Financial Ombudsman Service (London, England) in May 2017", "Interview Descriptions": "Make you jump through hoops and long winded process. They take their time in coming back to you and when they do they do not provide feedback when you fail to meet their criteria. They apologise that they are not taking your application forward this time what makes them think you would put yourself through the whole procedure again and apply  for a role again with this organisation.  If you didn't meet the criteria first time round what's gonna change a second time round.", "Interview Questions": "there is a case study to consider.  You are advised there is no right or wrong answer.  That would appear not to be the case."}], [{"date": "1 Sept 2017", "title": "Ombudsman Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Financial Ombudsman Service (London, England) in Apr 2017", "Interview Descriptions": "It was an awful process and really highlights the reasons for all the negative reviews on here, disengaged managers and incompetent HR reps working the process. Sent my cv and covering letter in, was contacted a few days later to arrange a \"chat\" with someone from HR about the role and if I was fully interested.  This \"chat\" turned out to be a full formal telephone interview.  The HR rep was taking notes as a was speaking and shouted \"STOP\" down the phone at me several times because she couldnt keep up-very off putting.  How I managed to get through to the next round I do not know .\r\n\r\nStage 2 was slightly better.  2 written exercises-1 on performance management and 1 on writing a decision, then a 1 on 1 interview.  It was done well, with a HR person asking competency based questions. I asked loads of questions on the role which the HR person either said she didnt know or gave me wrong information  Didn't go too bad and got through to the last round.  This was the icing on the cake. 2 Ombudsman leaders and someone from HR interviewed me.  They advised there were no set questions and boy they wearnt wrong.  They plucked questions out of the air at random which didnt make sense.  It was questions that you would only know the answer too if you worked their.  I tried to ask a few questions about the role and one of them laughed in my face and said shouldnt an applicant already know this (I did try but the HR rep didnt know so how the heck should I)-I also asked about the reviews on here and again they laughed in my face and said they were all fake. It was like a bullying session in a pub rather than an interview. Rather than leaving there inspired hoping to get a new job, I left thinking how can these clowns be dealing with such important decisions.  \r\n\r\nI didnt get the job and when asked for feedback it was terrible, some standardised response of there were better applicants and didnt meet the marks.  My presentation wasnt up to scratch (they actually used that phrase) but they asked a vague question and gave 10 minutes to present on it.  All in all an awful interview process and the reviews on here make me belief there would be more to come if I was successful.", "Interview Questions": "How do you react if someone doesnt like you?\r\nHow do you deal with conflicting situations?\r\nWhat are the FOS' aims and values?"}, {"date": "21 Nov 2016", "title": "Investigator Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Financial Ombudsman Service (London, England) in Sept 2016", "Interview Descriptions": "Fair and thorough process with good candidate management. Large internal campaign not everyone on board as you'd expect in a large scale change environment but interviewers made it as painless as possible", "Interview Questions": "Competency and customer focused questions"}, {"date": "19 Aug 2016", "title": "Ombudsman Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3+ months. I interviewed at Financial Ombudsman Service (London, England)", "Interview Descriptions": "There were four stages to the process with the initial application was by CV and covering letter. Following this I was invited to take an online timed psychometric style test which was HARD!!! I thought I failed here and called them approximately a week afterwards for 'confirmation' of not getting through, only to be surprised by being told I'd scored a very high percentile - candidates had to score within the top 50 percentile and I was told I was in the 80s. \r\n\r\nThe next stage was a one-to-one interview at their offices where I completed a case study and was then asked a series of comptency based questions to be responded to in the STAR format. The interviewer stifled yawns throughout and was losing a battle with his eyelids that wanteed very much to remain closed in sleep. Honestly, I wasn't boring, I'd foolishly chosen the 2:00pm interview slot and he'd possibly had a very heavy coma-inducing lunch prior!\r\n\r\nI then had to chase them for a follow up to eventually be told that I was not going to be put through to the next and final stage. I had to chase again for almost two weeks to get feedback which was beyond weak. The interviewer said he'd spoken to the senior HR manager for clarification before issuing the feedback to me - I am not sure what clarification was required as it was just he and I in the room [well he was physically there even if not awake throughout]. The feedback was that I had answered a competency question operationally. End of feedback. Told you it was weak. They apparently do not take into consideration the case study unless you are going throough to the final stage which is a panel interview at which you will need to give a presentation. \r\n\r\nThe whole process from initial application to feedback following the third stage of the process took about 12-14 weeks which I thought was very long. I did a lot of the chasing, even when I had been successful in going through to the next stage, which I thought was a little slack.", "Interview Questions": "Questions were competency based and I was asked to respond using the STAR format."}, {"date": "13 Feb 2017", "title": "GRADUATE POSITION Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 days. I interviewed at Financial Ombudsman Service (London, England) in Mar 2016", "Interview Descriptions": "Pretty wary of interviewing here after reading reviews on glassdoor but decided worth taking a look.\r\n\r\nSadly my experience was pretty negative, really simple questions about how would you react in certain situations, what's our motto etc. Never discussed the actual job despite having a few rounds and people there would come into the room and ask the same questions their colleagues had just asked.\r\n\r\nCompared to other interview processes I was in there was also a real difference in the seniority of people you would meet - all the Ombudsman managers seemed very young/recent graduates.", "Interview Questions": "What is our motto?"}, {"date": "18 Feb 2017", "title": "IT Service Desk Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 8 weeks. I interviewed at Financial Ombudsman Service (London, England) in Feb 2016", "Interview Descriptions": "The job was initially applied for online. Fairly quick process. You can upload your CV and answer a few quick questions. You then get contacted by a HR representative who will ask a little bit about your current situation; why you are looking for a job, if you have any other interviews coming up then tells you a bit about the company and the job you will be doing. If you pass the phone interview you will be asked to come in for a face to face interview in the main office. Prior to you coming in you will be sent a guide about how to prepare yourself for the interview. It will even tell you what questions you should be prepared to answer. Once at the interview you will face your would be line manager and a HR representative. One will quiz you on your experience and ability to do the job, the other will focus more on your behaviours and values respectively. If you're successful you will be offered a job via a phone call from the HR representative pending you pass the screening process which is a very long indeed.", "Interview Questions": "The questions will be sent to you in the guide prior to the interview, you should have no problems answering them if you come prepared."}, {"date": "14 Dec 2015", "title": "Financial Adjudicator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Financial Ombudsman Service", "Interview Descriptions": "I applied online with my CV and covering letter. I was contacted approximately three weeks later for a 15-20 minute telephone interview which focused on competencies and why I was applying for the role. I was also asked to describe situations where I had shown leadership and demonstrate my knowledge of FOS.", "Interview Questions": "Where did you hear about this job?\r\nWhat would you find the hardest part of the role?"}, {"date": "6 Nov 2015", "title": "Adjudicator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Financial Ombudsman Service", "Interview Descriptions": "I did an online application with my cover letter and CV. After two weeks I had telephone interview with the HR, the interview lasted 20 minutes. Why are you interested in FOS, position, what do you know about FOS", "Interview Questions": "A time where you deliver good customer services"}, {"date": "6 Nov 2015", "title": "Financial Adjudicator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Financial Ombudsman Service", "Interview Descriptions": "Initially got a telephone interview within 3 days of applying. It required talking the interviewer through my CV and how I related to the job description (pretty much the same questions as asked in the written application). Was asked two technical questions:\n- How is FOS funded \n- Maximum time for business to reply to a query\n\nWas sent a case study to complete after passing that stage. Was told within a day that I had passed.\n\nInvited to an interview scheduled 3 weeks later which made this about a month's process in total. Two interviewers who asked pretty standard questions about my CV, etc, pretty much the same as the telephone interview. Was asked to discuss the case study. 4 additional behavioural questions, mostly based on their values. \n\nLovely people from reception to interview room. Very impressed by the diverse office community. Very equal balance between genders, ages, etc. I've not witnessed that in any other places I've interviewed at.", "Interview Questions": "Tell us of a time when you had to deal with a difficult customer?"}, {"date": "21 Oct 2015", "title": "Adjudicator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2+ months. I interviewed at Financial Ombudsman Service (London, England)", "Interview Descriptions": "Applied for the role online by writing a cover letter and uploading my CV. Waited several days until I received an email confirmation about a phone interview. After phone interview I had to complete a case study which had to be recalled during the face to face interview. Had to wait 4 weeks for interview, however received a phone call few days before interview to say it had to be re-arranged and the next one available was another 3 week wait. This process was disappointing and gave a disorganised impression of the company. However face to face interview was very well set up and professional. Phone interview was mainly about my motivation for applying for this role, providing examples of great customer service and how I managed my time. During the face to face interview was asked a set of 7 behavioural competency questions consisting of the following themes: Handling a customer problems, Knowledge sharing and asking others for help within a team, learning from mistakes and question about which value I believed was most important. \r\nTIPS: Memorise the case study briefly however it more important that you are able to evaluate it. Be relaxed and confident when speaking and think your examples through thoroughly it is ok to take a few seconds to think of a good example (even better if you prepare some examples before hand) but always evaluate the motives behind your examples-after explaining the what and how make sure you say the why, use the STAR technique.", "Interview Questions": "Working in a team requires you to share knowledge and learn from each other from time to time, can you tell me a time when you have shared knowledge? (question sounded something like that)"}, {"date": "4 Nov 2015", "title": "Adjudicator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Financial Ombudsman Service (London, England) in Oct 2015", "Interview Descriptions": "Application, telephone interview, online assessment then face to face interview.\r\nVery stilted interview with the interviewer very detached & uninterested.\r\nAlso he turned up 10 minutes late, he wasn't very interested before the interview had started.", "Interview Questions": "8 interview questions, including 'a time when you dealt with a sensitive customer issue'. A time when you've made a mistake & fixed it, a time when you've dealt with a difficult  customer."}], [{"date": "29 Sept 2015", "title": "Financial Adjudicator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 3 weeks. I interviewed at Financial Ombudsman Service (London, England) in Sept 2015", "Interview Descriptions": "There were three stages;\r\n\r\nThe first was a telephone interview that lasts about 20-30 minutes. The questions were behavioural and competency based, and the setting was quite relaxed. I got confirmation at the end of the interview that I have got to the next stage.\r\n\r\nThe second stage is a case study. I think I was given 45 minutes to complete the case emailed to me, but the questions are simple and the answers are very straightforward after reading the documents given to you. I was asked to come to a face to face interview at the London office approximately 4 days after submission of the case study. \r\n\r\nThe final stage was the face to face Interview, with one person from HR and the other was the team manager. The questions are on the case study, to make sure you were the one who answered it, and also more competency/behavioural questions.\r\n\r\nI was contacted within 24 hours with a job offer.", "Interview Questions": " Tell us about a time you made a mistake and how you fixed it?"}, {"date": "1 Oct 2015", "title": "Adjudicator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Financial Ombudsman Service (London, England) in Sept 2015", "Interview Descriptions": "CV, Cover letter followed by a telephone interview. If successful you must complete a Case Study after which you may be invited for final interview. The process also involved a lengthy and comprehensive background check which must be completed before the interview stage. \r\n\r\nThe face to face interview was quite long and mainly just involved behavioural questions which seemed fairly unnatural and overly structured. Better if they were to screen you on these before the final interview.", "Interview Questions": "Which of the values do you think are most important?"}, {"date": "28 Aug 2015", "title": "Adjudicator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 1+ week. I interviewed at Financial Ombudsman Service", "Interview Descriptions": "Quite cliche and wanted you answer in a strict framework. Very unnatural and difficult to show your skills and ability to do the job. HR girl wasn't very engaging and almost seemed disinterested. Probably all the boring questions she asked.", "Interview Questions": "Tell me when you've gone above and beyond"}, {"date": "12 Aug 2015", "title": "Adjudicator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Financial Ombudsman Service", "Interview Descriptions": "The interview surrounded competency questions.  Word of advice: Read the email offer of the interview, which says that you have to go over the case study from the previous stage.  I didn't, and so the first part was a flop.", "Interview Questions": "Name a time when you had to give difficult news?"}, {"date": "1 Sept 2015", "title": "Adjudicator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Financial Ombudsman Service (London, England) in Aug 2015", "Interview Descriptions": "After completing a pretty laid back telephone interview and online case study I was invited to attend a formal interview. The interviewers made me feel welcome and after a brief introduction they asked me a series of STAR-technique questions. The interview itself was not very pressuring at all and they just want to evaluate you as a person so see if your values match the companies and to gain a grasp on weather you have relevant problem solving skills.", "Interview Questions": "Tell me about a time when you've had to do something that was unpopular with other people?"}, {"date": "15 Sept 2015", "title": "Adjudicator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 2 weeks. I interviewed at Financial Ombudsman Service (London, England) in Aug 2015", "Interview Descriptions": "Process took about 3 weeks from online application to telephone interview and written assessment. It was very stylised and exactly as their interviews tips suggested so worth following word. I did not memorise their 'values' so could not really answer that properly and the STAR questions were based directly on the values.", "Interview Questions": "Which of our values do you consider most important"}, {"date": "19 Jun 2019", "title": "Customer Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied through a staffing agency. I interviewed at Financial Ombudsman Service in Jul 2015", "Interview Descriptions": "A 2 stage interview with a telephone interview and then a panel interview. Competency based questions which you’re expected to answer using the STAR technique. It helps to know the company values and the role you’re applying for as you will be asked these and how you can display the skills needed.", "Interview Questions": "Give an example of a time when you had to do something difficult"}, {"date": "12 Sept 2017", "title": "PPI Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Financial Ombudsman Service (London, England) in Jun 2015", "Interview Descriptions": "Interview was Normal... They help you through the interview and were generally after work experience from resume.\r\n\r\nBasic questions like Name a time where you've provided excellent customer service?\r\nName a time you've taken responsibility at work?", "Interview Questions": "Name a time where you've provided excellent customer service?\r\nName a time you've taken responsibility at work?\r\n"}, {"date": "4 Jun 2015", "title": "Ajudicator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Financial Ombudsman Service in Jun 2015", "Interview Descriptions": "When asked to choose a date for a phone interview, I could not select the date as they had not created appointments for that date but would send me an email saying that I need to create appointment, then when I had phone interview, the person was nice and friendly, although I had this feeling that they were talking from a script which made it feel awkward for me, then when I was asked to complete a case study about ppi in two days, bearing in mind I have never had any experience in ppi, i did complete within short amount of time. I then had a response,", "Interview Questions": "Give me an example of when you have delivered great customer service"}, {"date": "20 May 2015", "title": "Ombudsman Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2+ months. I interviewed at Financial Ombudsman Service (London, England) in May 2015", "Interview Descriptions": "Initial application by CV and covering letter; invited to complete online critical thinking test; invited to FOS offices to complete case study and attend interview with a member of HR.  Time between initial application and case study/interview was around 11 weeks.  The final stage (which I did not reach) would have been a second interview, including discussion of the case study and delivery of a presentation.", "Interview Questions": "Mixture of general questions (e.g. about career to date and understanding of role applied for) and competency-based questions focusing on the skills required for the role."}], [{"date": "26 Jul 2015", "title": "Adjudicator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1+ week. I interviewed at Financial Ombudsman Service (London, England) in May 2015", "Interview Descriptions": "I had to fill an online application form,  then i did two online test, had a telephone interview and then a face to face where i was tested on math and reasoning skills", "Interview Questions": "I was asked abour 6 competency questions such as give an example of a time you provided exceptional customer service using the STAR technique in the telephone interview and had to attend a testing center"}, {"date": "21 Jul 2015", "title": "Adjudicator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Financial Ombudsman Service (London, England) in May 2015", "Interview Descriptions": "Online application form, online tests, telephone interview, case study task, then in-person interview. Around 1 hour long interview in the lovely offices, very friendly and welcoming interviewers. 1 from HR and 1 team leader. Took turns asking questions, firstly about the case study done previously, then competency related qu's and qu's about me, my CV, interests etc.", "Interview Questions": "What is your favourite one of our values and why?"}, {"date": "15 Apr 2015", "title": "Adjudicator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. I interviewed at Financial Ombudsman Service (London, England) in Apr 2015", "Interview Descriptions": "It was lengthy and not worthy at all for the salary.I was old to do a case study in 60 minutes deadline however that case study result was never shown to me or any feedback was given", "Interview Questions": "they want you to know everything about how you will work??\r\nbefore even getting the job"}, {"date": "18 Oct 2016", "title": "Adjudicator Grade I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Financial Ombudsman Service (London, England) in Jan 2015", "Interview Descriptions": "online cv and cover letter, competency online test, telephone interview where I was asked about the organisation and why I wanted to work there etc, test centre with 1-2-1 interview - with a panel of two people and case study about PPI which was timed and we had to write a mock email to a colleague, after this i was to find out if you got the job", "Interview Questions": "describe a time you had conflicting deadlines"}, {"date": "21 Sept 2016", "title": "Ombudsman Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 2 months. I interviewed at Financial Ombudsman Service (London, England) in Mar 2014", "Interview Descriptions": "Letter and cv to FOS followed by electronic tests and an interview with recruiter and case study before the final stage of interview by a managing ombudsman and senior ombudsman. Outcome given before I'd arrived back to central London on the DLR - successful. The FOS website's published decisions was very helpful in preparing for the interview.", "Interview Questions": "We have found that being a lawyer can be a disadvantage here. How do you think you, as a lawyer, will cope?"}, {"date": "5 Dec 2017", "title": "Adjudicator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Financial Ombudsman Service (London, England) in Jun 2013", "Interview Descriptions": "Very generic HR interview. Just read website and you'll be fine. I had to mention our organisation's \"values\" a lot but that was 5 years ago. Nowadays they probably don't give a damn and just want to squeeze water out of the rock until it's dust (you).", "Interview Questions": "They ask you standard HR questions requiring SMART answers - usually around giving an example about when you worked with a team, something about having to decide between doing something moral and something that would benefit your company, etc."}, {"date": "26 Aug 2015", "title": "Team Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 2 weeks. I interviewed at Financial Ombudsman Service (London, England) in Jun 2013", "Interview Descriptions": "Initial interview with HR.  Came back for role play then decision on the day to continue with second interview.  People friendly and helpful.  Role plays had a number of people involved with one observer (would have liked to have been asked first)", "Interview Questions": "how do you motivate people?"}, {"date": "15 Dec 2017", "title": "Adjudicator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Financial Ombudsman Service (London, England) in May 2013", "Interview Descriptions": "Not bad competency based interview plus assessment centre. Largely common sense with a bit of maths and English. Helps a bit to have some customer service experience and financial literacy. Fairly relaxed and friendly. Two managers were present. This may be out of date though as my interview was a few years ago.", "Interview Questions": "Please tell us about when you provided good customer service."}, {"date": "30 Sept 2016", "title": "Operations Support Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 5 days. I interviewed at Financial Ombudsman Service (London, England) in Apr 2013", "Interview Descriptions": "I got a call from  recruitment agency and was interviewed on the phone, I was later invited for an assessment the next day after which I met with 3 HR as if i was interviewing for a CEO job however I got the job.", "Interview Questions": "why did you apply for this role?"}, {"date": "22 Apr 2013", "title": "Senior Software Developer Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied through a recruiter. The process took 3 weeks. I interviewed at Financial Ombudsman Service in Mar 2013", "Interview Descriptions": "It was total wasting time with this “employer”.\r\nFOS asked me to do coding assessment. I had to write a program that filters words. They firmly rejected by any minor, funny reasons like – ‘it does not meet the expected standards for code clarity, so showing poor knowledge in creating structured code’, … and so similar rubbish.", "Interview Questions": "There were not difficult or unexpected questions "}], [{"date": "10 Mar 2017", "title": "Adjudicator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Financial Ombudsman Service (London, England) in Jan 2013", "Interview Descriptions": "two really simple and straight forward case studies and then a one to one interview with a team manager and someone from HR. They are the standard competency questions. Please give us an example of a time... \"you worked with someone you didn't like\"", "Interview Questions": "Give a time where you have had a difficult customer"}, {"date": "13 Dec 2017", "title": "Administrative Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I applied in-person. I interviewed at Financial Ombudsman Service (London, England) in Jan 2013", "Interview Descriptions": "not much to say on this, but the interview went very well.  I was made welcomed to the team. Other staff members were there to show you the ropes.", "Interview Questions": "How can you manage your workload?"}, {"date": "16 Jun 2016", "title": "Adjudicator Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. I interviewed at Financial Ombudsman Service (London, England) in Nov 2012", "Interview Descriptions": "Now it is much more difficult than it used to be. Very bureaucratic and not really an understanding of what the job entails so those doing the interview are not the best people to do the interview.", "Interview Questions": "What can you bring to the role.  What is your 5 year plan."}, {"date": "5 Mar 2015", "title": "Ombudsman Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Financial Ombudsman Service (London, England) in Oct 2012", "Interview Descriptions": "Initial internet based testing followed by interview with recruiters then written test and two interviews in-house with a presentation. The recruitment company were extremely helpful in preparation of competency based questions for the interview. I found that the organisation and the recruitment company were very accommodating and supportive to make the process as smooth as possible.", "Interview Questions": "Why do you want to work here?\r\nQuestions around PPI and its impact on the business.\r\nDescribe a time when you have had to make an unpopular decision."}, {"date": "29 Sept 2015", "title": "Adjudicator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Financial Ombudsman Service (London, England) in Sept 2012", "Interview Descriptions": "Competency based questions and a test, based on linguistic and mathematical review. Interviewers not doing the day job (HR). Was focussed on the STARR technique, which the recruiter at the time (Randstad) ran me through.", "Interview Questions": "Give us a time when you have worked in a team."}, {"date": "6 Dec 2012", "title": "Case Assessor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 4 weeks. I interviewed at Financial Ombudsman Service (London, England) in Jun 2012", "Interview Descriptions": "Given the massive recruitment drive at the moment, you will start the process with a recruiter - ranstad most likely. The consultants at ranstad are very helpful in highlighting what the skills the organisation is looking for and how best you can demonstrate these.\r\n\r\nYou will receive detailed guidance notes on the competency based interviews - both telephone and face to face- and the consultant may even run through your responses with you.\r\n\r\nThe interviewers themselves were very friendly and put me to ease immediately.", "Interview Questions": "As the interviews are competency based, do not worry too much. However, do read up on the organisation as I have been told they may ask questions to test your research about them e.g. their recent work, source of funding, etc."}, {"date": "13 Aug 2015", "title": "Adjudicator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at Financial Ombudsman Service (London, England) in Oct 2011", "Interview Descriptions": "In three parts, phone interview, case study, face-to-face interview. People were friendly, interviewers helped to make it feel more relaxed. The whole process was quite smooth, and only took a few weeks from start to finish.", "Interview Questions": "What made you apply for this job?"}, {"date": "13 Dec 2015", "title": "Adjudicator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 4 weeks. I interviewed at Financial Ombudsman Service (London, England) in Sept 2011", "Interview Descriptions": "I was a two stage telephone interview - once the CV was shortlisted and the initial telephone interview was conducted by the recruiter and I was selected, the following day, I was contacted by the manager at the FOS. I was asked four technical based questions. These were relatively easy and straight forward. I answered these to my best knowledge.", "Interview Questions": "technical knowledge about the financial products and certifications."}]]