[[{"date": "N/A", "title": "Patient Care Assistant (PCA) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Beacon Health System", "Interview Descriptions": "Submit application. Online Zoom interview with a supervisor. Very simple, no separate stages. There is a preliminary personality test to complete and a drug test.\nSubmit application. Online Zoom interview with a supervisor. Very simple, no separate stages. There is a preliminary personality test to complete and a drug test.", "Interview Questions": "How do you work in a team?"}, {"date": "23 Apr 2023", "title": "Psychiatric Technician Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Beacon Health System (Grand Rapids, MI) in Jan 2023", "Interview Descriptions": "Questions mostly pertained to availability and educational background and relevant work experiences. The interviewer asked a maximum of 5-6 questions and allowed time for the interviewee to ask questions in return.", "Interview Questions": "Are you comfortable working with mental patients?"}, {"date": "8 Dec 2022", "title": "Admin Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Beacon Health System in Dec 2022", "Interview Descriptions": "Horrible interview. The interviewer is rude and demanding. The whole interview was through a message chat, not a video call. This person should have just sent me an email with the questions she wants to ask. What a waste of time, this is the worse way to interview a candidate.", "Interview Questions": "Describe yourself in three words. Are you presently employed?"}, {"date": "21 Dec 2022", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Beacon Health System (South Bend, IN) in Dec 2022", "Interview Descriptions": "Interview was very comfortable and easy going. Felt like a conversation and was very enjoyable, even if it was virtual. It was with four people other than me, which was nerve wracking at first.", "Interview Questions": "They tailored the questions based off of my resume ."}, {"date": "12 Jan 2023", "title": "Coder II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Beacon Health System in Sept 2022", "Interview Descriptions": "HR recruiter was very professional yet friendly. All questions were answered clearly. Fast and efficient process. Interview was with the coding manager which was straight to the point and professional.", "Interview Questions": "Describe your coding background. What systems have you worked with before etc"}, {"date": "18 Jun 2021", "title": "Administrative Assistant/Office Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Beacon Health System", "Interview Descriptions": "Blind sided and the job description was misleading job duties. Was rude when asked when I could meet in person because I couldn't come up with a time off the top of my head.", "Interview Questions": "Why did I apply to this position "}, {"date": "20 Jan 2021", "title": "Administrative Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Beacon Health System (South Bend, IN) in Jan 2021", "Interview Descriptions": "Zoom and on site .  Recruiting emails, Zoom interview and then on site with multiple staff. Communication was good and time was appropriate for the process.  Overall good experience.", "Interview Questions": "Basics and in-depth "}, {"date": "30 Sept 2019", "title": "Care Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Beacon Health System (New York, NY) in Aug 2019", "Interview Descriptions": "Started with a screening Phone interview  to determine if you go to the next step. The interviewer asked questions about experience and skills.  Be ready to discuss your strengths and weakness ,", "Interview Questions": "What professional development courses have you taken?"}, {"date": "14 Mar 2019", "title": "RN Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Beacon Health System (South Bend, IN) in Mar 2019", "Interview Descriptions": "Human resources scheduled my interview with the post partum director then emailed me to change times so the OB educator could also attend. I waited for half an hour and no one showed up. I called HR and the post partum director and couldn't get a hold of either. After I left the post partum director called me and said HR never told her about the appointment and she gave me her cell phone number to contact. HR then rescheduled the interview, I texted the director the details to make sure she got the message. This time I waited 45 minutes and no one showed up or answered my call. I texted the post partum director and told her I was withdrawing my application then she responded and said the position was filled. Very unprofessional and disappointing. I always thought highly of the organization but not any more.", "Interview Questions": "They only asked me to meet. I never got a chance to interview."}, {"date": "7 Nov 2017", "title": "Correctional Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Beacon Health System in Nov 2017", "Interview Descriptions": "Met with Beacon hiring manger first then nursing director second. Very professional and over all both were nice. Standard interview questions. Hiring process was explaned what the job intailed etc.  Was excellent in keep me informed after interview of the next steps in the hiring process.", "Interview Questions": "How I handled difficult clients in the past."}], [{"date": "30 May 2017", "title": "Nurse Extern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Beacon Health System", "Interview Descriptions": "I applied online and was called within a few days for an interview. During the interview I was asked to set up a job shadow to see if I thought it was a good fit for me and to see if the coworkers felt I was a good fit I think. I received an offer the next day and accepted.", "Interview Questions": "What made you want to become a nurse?"}, {"date": "28 Mar 2017", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Beacon Health System (Elkhart, IN) in Mar 2017", "Interview Descriptions": "It was a standard interview. I went in and met with the department manager and we talked for about 35-45 minutes and then she gave me a tour of the unit. The whole thing took about an hour. I did have to do a job shadow, but I got the feeling that was more to see if I wanted the job, not to see if they wanted to hire me. After I told the manager I liked the unit she told me that she would have the recruiter offer me a job. The whole process took about 2-3 weeks from when I applied to when I was offered the job. I interviewed and was offered the job before I even finished nursing school.", "Interview Questions": "Tell me about yourself."}, {"date": "29 Mar 2016", "title": "Transcriptionist and Customer Service Representative Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Beacon Health System", "Interview Descriptions": "Filled out several different applications and finally got a call about a different job. They asked if I would still be interested. I told them I was and we set up the interview. I went in and was interviewed by two women. One was very nice and looked at me when I talked to her, the other barely bothered to look at me. Took a typing test after they went through a list of questions. Received an email 2 WEEKS later saying they found a better fit.\nA few weeks later I received an email asking for an interview for a customer service representative position. I was asked to fill out a background check and an online personality test before the interview. Went in to the interview and the woman was very nice. She told me what I would be doing and how my degree would work well for the job and there was room for advancement. She talked as though I had the job. I sent a thank you email and she told me it would be a couple weeks before they decided. It has been a MONTH and still no word. No thanks Beacon...", "Interview Questions": "Tell me about a time you made a mistake at work and how you corrected it"}, {"date": "14 Mar 2015", "title": "Lab Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Beacon Health System (South Bend, IN) in Mar 2011", "Interview Descriptions": "Online application, followed by an online personality test, followed by preliminary interview with HR and skills aptitude tests, followed by a full interview and introduction to department staff with the manager of the department I had applied to", "Interview Questions": "5 year plan"}]]