[[{"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 0, "Senior Management": 5, "review_title": "The best of the higher ed and corporate worlds.", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "20 Mar 2010", "job_title": " in Philadelphia, PA", "duration": "N/A", "pros": "Drexel e-Learning (aka Drexel University Online) is a for profit subsidiary of Drexel University that markets Drexel's online degree programs to adult part-time students. Drexel e-Learning offers better pay, more interesting work that regular university staff positions.", "cons": "Small organizations provide limited growth potential."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 5, "Culture & Values": 3, "Diversity and Inclusion": 3, "Career Opportunities": 5, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Department Dependent", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "8 Jun 2022", "job_title": "Assistant Clinical Professor in Philadelphia, PA", "duration": "N/A", "pros": "Excellent colleagues, room for growth", "cons": "Low pay, long length of service before qualifying for tuition benefits, short contracts"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": 4, "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Great if you love education", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "23 Mar 2021", "job_title": "Director in Philadelphia, PA", "duration": "N/A", "pros": "Flexibily\r\nGreat benefits\r\nFriendly enviornment\r\nNice Campus\r\nLots of lunch options", "cons": "Parking lots are tight\r\nExpensive if you drive\r\nExpensive to eat out for lunch\r\nManagement sometimes unorganized\r\nCould always use more pay"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "Things seem to consistently get worse", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "21 Jan 2013", "job_title": "Enrollment Services Department in Philadelphia, PA", "duration": "N/A", "pros": "The pay is a little above average and the pro fit sharing is nice, but after working there for a couple of years, it does not go up as much.\r\n\r\nThe healthcare plan is very good. It might be better than the actual university's plan.\r\n\r\nThe employees (non-management) are good people.", "cons": "The only way to move up in the company or to gain respect of upper management is to play the game...and to play the game at DeL, you have to be a \"loyal lap dog\". Depending on what department you work in, there is a lot of workload expected of employees, and the employees see little compensation. It seems like the 99% of the company work their tails off to expand the pockets of upper management (the 1%).\r\n\r\nFavoritism is used with most of management. Upper management will encourage employees for feedback, but will only listen to feedback that feeds upper management's egos. Management does not want to be questioned when it comes to their decisions. \r\n\r\nIn recent years, the turnover ratio is very high."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "A top-heavy, gossip laden community where the worker bees are overworked to feed the multiple queens.", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "15 Jan 2013", "job_title": "Anonymous Employee in Philadelphia, PA", "duration": "N/A", "pros": "Benefits are good, if you can get them. Also, the emails with multiple misspellings and wrong use of cliche phrases from management provide great amusement. Most of the lower level staff are nice people who are just trying to put their time in.", "cons": "The only way to get anything from management is to be a giant brown noser, as their egos are all so huge they don't realize employees are using this as a tactic and not the truth. Favoritism runs amok that it's often hard to remember to not hate the player, but hate the game (and the company environment). Gossip and HR violations are rampant, but employees don't feel comfortable coming forward because management finds out the whistle blowers and finds ways to make their lives miserable. Management is inflexible and only ask for opinions to make employees feel that changes might be coming soon. Everyone is so bitter that it is impossible to maintain a positive work environment."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Glorified call center, dead end job", "rating": "2.0", "reviewer_affiliation": "Current Employee", "job_date": "24 Jun 2016", "job_title": "Enrollment Counselor in Philadelphia, PA", "duration": "N/A", "pros": "The people in the department are fantastic. \r\nSalary is decent for what the position is. \r\nHealth benefits.", "cons": "With recent changes, there is a lot of micro-managing, and miscommunication. \r\nUpper management was so eager to implement new ideas without thinking anything all the way through, consulting the team on their thoughts or input, or how this would affect staff morale. \r\nNothing in this office is thought through. \r\nManagers do not involve staff in decisions whatsoever\r\nPTO could be a lot better\r\nOnly paid once a month\r\nHave to work two late nights a week, this is non-negotiable and more senior members get to choose which days they work and are not typically open to switching nights.\r\n\r\n\r\nI would recommend staying away"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Horrible culture", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "25 Jan 2018", "job_title": "Anonymous Employee in Philadelphia, PA", "duration": "N/A", "pros": "Near public transit and there are many dining options to choose from", "cons": "Drexel University Online (DUO) is surviving off of Drexel's reputation. Many people are attracted to DUO because of its name association with Drexel. Working for DUO is like working in an alternate universe. I was naive to think many of the negative reviews about DUO were from disgruntled employees. The reviews are spot on.  \r\n\r\nCons: \r\nHigh turnover \r\nMoral from coworkers is extremely bad\r\nManagement lacks vision and integrity \r\nNo opportunities for growth for most positions \r\nArchaic policies\r\nEmployees work in silos\r\nLacks a sincere commitment to employing a diverse workforce \r\nPoor work culture \r\nNot eligible for Drexel benefits  such as tuition remission and home ownership assistance."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 4, "Senior Management": 0, "review_title": "What should have been a foot in the door ended up being a dead end", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "22 Feb 2018", "job_title": "Enrollment Counselor in Philadelphia, PA", "duration": "N/A", "pros": "Easy commute via public transport\r\nFor an urban-campus it is very nice\r\nMost co-workers  were nice and just as equally frustrated!\r\nVery generous with how much time off you accumulate  and you don't have to use vacation time during winter break (although \"volunteers\" are required to come in each day)\r\nMy manger was low key and approachable \r\nYou will never have to take work home with you", "cons": "As many others have revealed, this position functions more so like a call center than a higher education institution, as you are mainly cold calling prospective students.  Under the current protocol, expect to have to call inquires four times... while on occasion you do connect with really eager students, often times it voicemail after voicemail after voicemail. Also, calling applicants over and over to check in on their the status of their documents becomes tedious for both you and the student. \r\n\r\nWhile many students may prefer to communicate via email, this role does not take this into account Your performance and success will be based off of how many calls you make, how long you are on the phone, and what percent of inbound calls you answer (so if you go to the bathroom or get water and miss a call it's counted AGAINST you).  \r\n\r\nIf you don't meet the standards set by a management (which most of us don't), it doesn't matter; you will not lose your job. It's a way for management to appear they are helping us \"grow\" and \"develop\"... instead of really helping us pursue what true passion we may have in higher education. \r\n\r\nThe fact of the matter is, these numbers are arbitrary and we instead should be focused on meeting enrollment numbers and connecting with on-campus resources to ensure we are all on the same page. This department is completely separate to on-campus, hence very little opportunity to connect with other staff for networking. \r\n\r\nInternally, you will not have the opportunity to do anything else besides make calls, then make more calls. How this role has been structured is a waste of time and resources and I do not see that changing any time soon. \r\n\r\nTake this job if you are desperate for one, but do not expect to get much out of it. Based on my disappointing experience, I would not recommend Drexel as a place to work or a place to study."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "No Heavy Responsibility, No Advancement", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "4 Aug 2018", "job_title": "Enrollment Counselor in Philadelphia, PA", "duration": "N/A", "pros": "Educational benefits are great ($12,000 each year). This is a very \"cushy\" position. If you are looking for a position with close to no responsibility and no advancement--this could work for you.", "cons": "Leadership will barely interact or speak to you. We are a small group at DUO, yet leadership could pass you in the hallway and they wouldn't know you worked for DUO. As an enrollment counselor, you work first hand with students, so you are able to recognize when a system works and when it doesn't..regardless, your concerns are never taken seriously by the leadership you work under. You are not viewed as valuable employees by the rest of the university and will be often be referred to as the \"call center.\" Director tends to be very inpersonable and doesn't interact with staff much. Most of the leadership that has been there many years doesn't like to hear suggestions or new ideas. They prefer you stay in your lane, regardless of you expertise. Two days a week, you work 11am-8pm, which is a waste of time and upon being hired I was told these were \"flexible\"--they are not. You will be required to work these hours. Underpaid, being asked to \"volunteer\" for extra duties. In 2 years, we've never had a raise, not even for cost of living. You may be lucky enough to land a job on campus, but most people find it to be a dead end job and they leave the DUO."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 5, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "Too many changes!", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 8 years", "job_date": "3 Nov 2015", "job_title": "Anonymous Employee in Philadelphia, PA", "duration": "N/A", "pros": "Good benefits, profit sharing (when it was a thing) was great, friendly people, fun staff events.", "cons": "Profit sharing made up a sizable portion of your income, so take home pay is much less than industry averages. Upper level management was constantly changing. Very difficult for change to take effect and little room for advancement."}], [{"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "If someone shows who you are believe them!", "rating": "2.0", "reviewer_affiliation": "Former Employee", "job_date": "20 Jan 2017", "job_title": "Enrollment Counselor in Phila, PA", "duration": "N/A", "pros": "Coworkers are like family...they will make you feel right at home.", "cons": "Administration will lie to use you until they find something better. If you don't plan on hiring someone you should be honest about it.  I know that getting your quota is very important however you were a human before anything else so where's the humanity?"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Soul Sucking Nightmare", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "24 Apr 2015", "job_title": "Enrollment Counselor in Philadelphia, PA", "duration": "N/A", "pros": "Keurig Machine-Convenient Location-great spots to cry once you're told you're not doing your job right despite exceeding numbers.  Most of the lower people are pretty great and you bond over how draining this experience is.", "cons": "Upper management treats employees like garbage, almost constantly threatening people to do more or get fired...yet they don't lead by example.  Enrollment services director and supervisors are back stabbers, so be careful when you're around then...it could be dangerous..."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Still pretty bad with poor leadership", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "11 Mar 2015", "job_title": "Anonymous Employee in Philadelphia, PA", "duration": "N/A", "pros": "The benefits package is pretty great and probably better than the industry standard. They also have tuition reimbursement options for online programs.", "cons": "I was here for about a year and experienced the old and new leadership. Other reviewers were right on target about previous leadership being the death of this company. They had huge egos and only cared about each other. There were a lot of HR violations swept under the rug and it was a pretty terrible time at the company. New President Dr. Susan Aldridge hired new leadership and I was anxiously waiting to see what would happen. Minus the HR violations the new leadership team is a lot like the old one. \r\n\r\nNot much has really changed. Almost every day you’re told how you aren’t doing your job properly but are given no clear direction on what the goals are or how to achieve them. Our ideas aren’t taken seriously and leadership provides no solutions. Leadership likes to talk…a lot…and it’s clear they have no idea what they are talking about. And the proverbial grape vine is at an all time high. A lot of the rumors are pretty vicious and childish.\r\n \r\nWe’re constantly hearing about the merger and budget cuts and it seems like doomsday is approaching. When I started two rounds of layoffs happened. By the time I left two more happened. Yet we are constantly told we are “growing”. People who had been at the company for years have left. That’s a sign right there to stay away. They also eliminated profit share (aka bonus) and professional development reimbursement. And our annual raise in December didn’t happen. Throughout the past year things kept getting worse, even with the new changes, so it was time for me to go.\r\n\r\nOh…people who are still there told me the Keurig options have been drastically reduced! We used to have a ton of options but they got rid of a lot of it. There is zero motivation to work here."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 4, "Senior Management": 0, "review_title": "This job is soul sucking", "rating": "2.0", "reviewer_affiliation": "Former Employee", "job_date": "26 Mar 2015", "job_title": "Enrollment Counselor in Philadelphia, PA", "duration": "N/A", "pros": "Benefits, casual Fridays, great location for public transportation", "cons": "No tuition remission, late nights, upper management, lack of career opportunities, general dysfunction and lack of trust, managers have their favorites"}, {"Recommended": "N/A", "CEO Approval": "Neutral", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "A start", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "10 May 2017", "job_title": "Enrollment Counselor in Philadelphia, PA", "duration": "N/A", "pros": "Easy Job, reaching out to prospect students and working among awesome people.  Not a lot of pressure on calls although they are measured. Great location", "cons": "Drexel makes a process for a process and complicates things. Some management are unprofressional"}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "Nice place to work with lovely colleagues", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "8 Oct 2020", "job_title": "Anonymous Employee in Philadelphia, PA", "duration": "N/A", "pros": "Pros include amazing colleagues, a collaborative environment, and interesting projects to work on. Very fast moving and quickly growing online learning environment.", "cons": "There are limited opportunities for advancement."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Bad", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Changing", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "28 Aug 2020", "job_title": "Assistant Director in Philadelphia, PA", "duration": "N/A", "pros": "Great team very dedicated to success", "cons": "Migration to Drexel University was very choppy and Online lacked information and direction."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "Interesting place to work", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "31 Oct 2019", "job_title": "Tech in Philadelphia, PA", "duration": "N/A", "pros": "Great benefits, wonderful working people", "cons": "management can do a lot better"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Great staff", "rating": "3.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "26 Feb 2019", "job_title": "Instructional Designer in Phila, PA", "duration": "N/A", "pros": "Salary, benefits, communication, team environment", "cons": "Not much room for advancement, unclear policies"}]]