[[{"date": "14 Jan 2023", "title": "Senior Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at FIRST", "Interview Descriptions": "Many panel interviews. Met a lot of potential colleagues through the process. Answered the same questions several times. The questions were standard interview questions, so no surprises. I hope they landed the right person. This seems like a good place to work if you want to make a difference.", "Interview Questions": "How does my experience make me a strong applicant"}, {"date": "18 Aug 2022", "title": "Logistics Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at FIRST in Jul 2022", "Interview Descriptions": "The discovery call I had went very smoothly. Questions were thoughtful. They were very upfront with me regarding the role and the pay. The benefits look excellent and the organization appears to be wonderful.", "Interview Questions": "What would your ideal role be?"}, {"date": "24 Apr 2019", "title": "Technical Lead Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at FIRST (New York, NY) in Apr 2019", "Interview Descriptions": "Very disconcerting, interviewer was on speaker phone so hard to hear and understand questions, was reluctant to say anything for fear of breaking the flow of the process, interviewer should be mindful of candidates comfort", "Interview Questions": "About my background"}, {"date": "27 Mar 2018", "title": "Revenue Cycle Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at FIRST (Springfield, MO) in Mar 2018", "Interview Descriptions": "Great description about the position applying for.  And reasonable questions about previous work history and what you can being to their team. Had a 2nd interview,  went great,  very down to earth supervisor.  Anticipating a call back with a job offer.", "Interview Questions": "What can you bring to the table of hired"}, {"date": "18 Jan 2018", "title": "Operations Coordinator Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 7 weeks. I interviewed at FIRST (Manchester, NH) in Dec 2017", "Interview Descriptions": "Applied online, attempted to follow-up directly with human resources but they had not heard of me - found out recruitment was contracted to third party, which I found strange for such a small company.  Interviewed twice and was offered position but they offered salary much lower than what I had indicated as required per their application process. It was a real waste of time for both them and me, and could have been avoided if they had read my application or were up-front about the difference.", "Interview Questions": "How do you deal with team conflict in a group of women?"}, {"date": "17 Nov 2017", "title": "Logistics Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at FIRST (Manchester, NH)", "Interview Descriptions": "I have met with 3 people - 2 of them were pleasant. Each person spends about 30 min. They go over your resume and answer your questions. \r\nI had a feeling that is not my place from the beginning. It's not welcoming... Kind of intuition told me it's not for you. I am glad that I was not hired. We never talked about salary. I think they are looking for a person who is excited mostly about the company rather than salary. I feel that nowadays people are more money driven.", "Interview Questions": "What would you bring to the company if we hire you?"}, {"date": "5 Jan 2014", "title": "Volunteer Resource Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at FIRST (Manchester, NH)", "Interview Descriptions": "The process started with a simple, no surprises phone interview. I was then scheduled for an interview with 3 department managers. The interview as about an hour and none of the questions were pretty standard. They could have been better prepared with questions and in reviewing my resume. I was contacted by HR quite quickly and asked about how flexible I would be on salary (the salaries at first are extremely low). Initially I had asked about the salary range but was told by HR that they did not know. This could have saved all of us some time because it was well below what one would expect considering the experience and qualifications they desire. I did let her know that while I was interested in the actual position, I was unable to consider the salary they were discussing.  I was then told by the HR person that there was another position that would soon be posted and it was more in the range I was looking for and encouraged me to apply for it. She requested that I submit another cover letter and resume for that position and would let me know when it posted. The position did post a month later and I applied. I was then informed that they pulled the position to change the requirements of the job and it would be reposted. I was then asked to submit ANOTHER cover letter, this time with salary requirements. I did so and never received the courtesy of any response back.  They are very disorganized overall- posting positions they never actually fill, interviewing and then months later reposting the same position.  Definitely not impressed with the process or professionalism.", "Interview Questions": "Tell me a time when you were working with a group of people and everyone wanted to do something differently than you did. "}, {"date": "8 Nov 2013", "title": "Development Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 3 months. I interviewed at FIRST (Manchester, NH)", "Interview Descriptions": "Went though multiple interviews from HR to finally meeting the hiring VP.  Based on the web site it seemed like a nice place to work.\r\n\r\nOffices were a bunch of cubicles with the executives having walled offices with glass over looking the cube workers.  The salary range was so low I couldn't believe it and had to ask about it again.", "Interview Questions": "FIRST does not have a endowment and the donations start over every year. How would you change the revenue side from a typical non profit to a commercial organization?\r\n"}, {"date": "16 Sept 2015", "title": "Special Event Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at FIRST (Minneapolis, MN) in Nov 2013", "Interview Descriptions": "very simple and easy going. Everyone was very friendly and easy to have a conversation with. Got to talk to the entire staff (4 people at this location) and all were very welcoming.", "Interview Questions": "Why do you want this job? How will you be an asset to the team? What do you already know about our business"}, {"date": "16 May 2013", "title": "Corporate and Foundation Relations Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at FIRST (Manchester, NH) in May 2013", "Interview Descriptions": "I was initially contacted by someone from HR for a phone interview. The questions were standard fare, e.g. \"What was your biggest accomplishment?\" and \"What would you say is your biggest weakness?\" Nothing was out of the ordinary. They then asked me to have a minimum of 5 references submitted to a website. Several of my references commented on how onerous this process was. Personally, I think it was somewhat premature since I had only one conversation with FIRST.\r\n\r\nFIRST then asked me to write a detailed letter on how I would contribute to the company and succeed in the Corporate and Foundation Relations Manager role. I sent that and a week and a half later was asked to have yet another phone conversation with someone else in the organization. There was no further communication until I received a terse email from HR stating that they were going to look for other candidates.\r\n\r\nThe process wasn't difficult (except for the HR manager's lack of personality) but it was frustrating due to the lack of communication. I expected more out of a foundation started by Dean Kamen. I've admired him for years and consider him a true visionary so it was disappointing to learn his organization was so backward-thinking.", "Interview Questions": "Why do you want to work at a non-profit?"}]]