[[{"date": "31 May 2023", "title": "Gender Equality and Inclusion Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at International Olympic Committee (Geneva)", "Interview Descriptions": "Received an email with instructions for a video interview - you receive a question, have a few minutes to prepare and then your answer is recorded. Completed about 10 interview questions with time at the end to address anything additional.", "Interview Questions": "Why this role? What are the greatest DEI challenges at IOC?"}, {"date": "29 Mar 2023", "title": "Assistant Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at International Olympic Committee (Lausanne) in Feb 2023", "Interview Descriptions": "Was invited to the digital interview process by email. Did the interview online. I got the reply in 3 weeks. I didnt make it to the next round but I enjoyed the experience.", "Interview Questions": "Basic introductions, skills, experiences and motivations"}, {"date": "31 Mar 2023", "title": "Senior Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at International Olympic Committee (Lausanne) in Jan 2023", "Interview Descriptions": "unclear process, many additional interviews and \"virtual coffees\" with team members - unclear what the aim is - no clarity on next steps and scope of the job. involve interview with HR", "Interview Questions": "written test, personnality test, technical questions"}, {"date": "22 Jan 2023", "title": "Senior Legal Counsel Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at International Olympic Committee (Lausanne) in Jun 2022", "Interview Descriptions": "Case study to assess drafting abilities (1 hour), meeting with two direct superiors to discuss work experience and expected responsibilities (1,5 hour1), meeting with future colleagues to discuss the team atmosphere (30 minutes)", "Interview Questions": "What would you change about the legal department?"}, {"date": "27 Apr 2022", "title": "Education Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at International Olympic Committee", "Interview Descriptions": "Video interview, then 2 references requested - this made me uncomfortable as I wasn't even sure whether I was a good match for the job as I hadn't spoken to anyone in person. The face to face online interview was with the manager and a recruiter, they were professional. I was rejected with an automatic email - just a terrible way to treat a candidate after all the effort they requested.", "Interview Questions": "Why did you apply for this role?"}, {"date": "12 Nov 2021", "title": "Senior Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at International Olympic Committee (Lausanne)", "Interview Descriptions": "The interview was divided in 3 stages. The first stage was a virtual interview with the head of the team and an HR manager. The 2nd/3rd stages were face to face with a couple of team members and a case presentation incl. a 1on1 with an HR manager to discuss details of employment, personal questions, etc. The third stage was with the director of the department and meeting other team members.\r\n\r\nThe head of the team as well as all other team members were competent and very keen on being transparent.\r\n\r\nThe HR team was unprofessional at best, seemingly having almost nothing under control and making mistakes wherever they can. They might be a great reason why an otherwise great candidate would not want to work for this organization.", "Interview Questions": "Typical personal fit questions"}, {"date": "4 Jan 2021", "title": "Human Resources Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at International Olympic Committee (Lausanne)", "Interview Descriptions": "We had a cover letter and resume to send, then calculation and leadership fun tests, then a video interview, then a Excel test and a small case study and then two interviews. \n\nThe process was with a lot of step but lasted only 3 weeks. The recruitment process was very professional and rewarding. I got feedbacks, and it made me want to join IOC even more.", "Interview Questions": "Questions about you: your greatest failure, success, tell me about yourself etc..."}, {"date": "8 Dec 2020", "title": "Stagiaire événementiel Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at International Olympic Committee (Lausanne) in Oct 2020", "Interview Descriptions": "Envoi d'un dossier complet via la plateforme du CIO (incluant CV et lettre de motivation). Ensuite, réalisation de tests de logique en ligne sur Hirevue. Finalement, réalisation d'un entretien vidéo préenregistré.", "Interview Questions": "Pouvez-vous décrire une expérience en lien avec les tâches du poste à pourvoir?"}, {"date": "7 May 2022", "title": "Education Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at International Olympic Committee (Lausanne) in Oct 2020", "Interview Descriptions": "Recorded answers are set as the very first step in the process. Not the best format and unable to re-record any answers submitted. The timer wasn't an issue, but the overall experience felt very impersonal.", "Interview Questions": "Questions about my experience and how I could contribute to the role."}, {"date": "6 Nov 2019", "title": "Communications Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at International Olympic Committee (Lausanne) in Jun 2019", "Interview Descriptions": "smooth and professional. The hiring manager and hr manager were very professional, with the sense of humour and provided fast feedback. The interview was performed on french and english languages.", "Interview Questions": "Experience, expectations "}], [{"date": "23 Nov 2020", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at International Olympic Committee (Lausanne) in Feb 2019", "Interview Descriptions": "First Interview was over the phone with HR and Hiring manager for about 30 minutes.  Second round of interview was in-person and have 3 sections. HR & Hiring manager for about an hour, another interview with head of for 20 min and an interview with the Associate Director  for about 20 min as well.", "Interview Questions": "What do you know about the IOC ?    "}, {"date": "20 Sept 2018", "title": "IT Consultant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. The process took 3 months. I interviewed at International Olympic Committee (Lausanne)", "Interview Descriptions": "Completely erratic recruiting process which lasted more than 3 months, with inconsistent and communication:\n• Approached by a recruiting agency for a 2 years external contract - after 2 interviews they zealously called up on two of my references explaining that was the condition of IOC \n• After 2 rounds of interviews (face to face and skype) with recruiting manager and team member, was informed by the agency that the recruiting manager had changed her mind and would ask for the position to be converted into a permanent full-time which required an internal hiring process. \n• Was called for a third round of interview with both the recruiting manager and team member, to give a presentation on topics already discussed in previous rounds \n• Kept in touch with recruiting manager to know whether the position had been approved internally. She finally sent me the link to submit my application to through the internal channel \n• Received a rejection auto-reply after one month. \n• During follow-up call with recruiting manager she stated she had never been interested in my candidacy…  \nOverall, the recruiting manager seemed to lack experience in sourcing strategy, 3rd party communication, in addition to being completely careless about her organisation’s reputation. Leaft impression that other projects within organisation are handled with same  low level of professionalism", "Interview Questions": "Why do you apply to IOC\nWhat matches in your experience with our requirements\nStandard interview questions"}, {"date": "19 Sept 2019", "title": "Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at International Olympic Committee (Lausanne) in Jul 2015", "Interview Descriptions": "- One phone interview\r\n- Three assignments related to the job\r\n- Four in person interviews with approx. 6 people who would work in some proximity to the role\r\n- Personality test\r\n- Last in-person interview with HR and hiring manager", "Interview Questions": "They asked very specific questions about the job that I really needed to have done research on or previous experience in the industry to know. "}, {"date": "29 Jan 2018", "title": "Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at International Olympic Committee (Lausanne) in May 2014", "Interview Descriptions": "Two stage interview: first by Skype, then in person in Lausanne. Both times meeting with the manager and HR manager lasting somewhere between 30 minutes and 1 hour. Questions were both generic and job-specific. Language (French and English) knowledge was tested.", "Interview Questions": "Stress resilience, past ecxperience"}]]