[[{"date": "20 Apr 2023", "title": "Youth Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Life Without Barriers (Sydney) in Apr 2023", "Interview Descriptions": "The interview process was very easy. I received an invitation to interview the same day I applied. The panel asked me some questions about my experience in terms of working with children. I was asked about how I can handle working with children and youth in difficult circumstances.", "Interview Questions": "Tell us about your background?"}, {"date": "4 Jul 2022", "title": "Manager - Projects Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Life Without Barriers", "Interview Descriptions": "Well sequenced, generous time allocated and additional comments by interviewers made it more conversational which really assisted in being able to show case my skills.  The process was very structured, in that intial recruitment  communication contained great instructions and the follow up (post interview) communication was also clear and very user friendly.", "Interview Questions": "Why work for Life Without Barriers "}, {"date": "4 May 2022", "title": "Data Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Life Without Barriers", "Interview Descriptions": "First stage interview was a one-way video interview (through Sonru). Asked 5x questions, mostly soft questions, one a general question about approach to data management. Each question had a time limit of about 1-2mins, with 30 secs to prep before the recording started. The next stage was a panel interview via MS Teams, with the direct manager, their  manager and a team member. This had a mix of soft and technical questions.", "Interview Questions": "What are the 5 core LWB values and which do you relate to the most?"}, {"date": "9 Nov 2020", "title": "Intensive Case Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Life Without Barriers (Melbourne) in Jun 2020", "Interview Descriptions": "The interview went longer than expected. The interviewer introduced you to other team members. The interviewer provided you with a lot of details about the company or open position. The interviewer talked a lot about future opportunities.", "Interview Questions": "As a clinical case manager, what is your management style?\r\n"}, {"date": "1 Nov 2019", "title": "Residential Support Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Life Without Barriers (Darwin) in Nov 2019", "Interview Descriptions": "Applied online, had a group interview with 20 other applicants two weeks after applying. Had 1:1 interview 2 days after group interview.\r\n\r\nGroup training involved scenarios, introducing yourself and background to the whole group, doing smaller teamwork activities and then presenting these to the whole group. There were four assessors walking around and listening to each group's contributions - you are being watched from the moment you step into the room! It was quite a fun experience and a lot more relaxed than anticipated.\r\n\r\nThe 1:1 interview was a bit more formal and conducted by a panel of two upper management personnel. They didn't really ask about relevant experience/qualifications which was surprising. Instead they asked about my idea of the organisation, the job role etc. There were also about 3-4 scenario based questions. If you have worked with children before, answers are quite common knowledge.", "Interview Questions": "Name a time that you had to respond to a child's challenging behaviour, and how did you act?"}, {"date": "29 Aug 2019", "title": "RN Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Life Without Barriers (Sydney) in Jul 2019", "Interview Descriptions": "long , with second interview a week later\r\n2 Managers meet with me , asked some scenario questions , it was very clinical, not easy to engage with them, not too friendly, but I guess they wanted the right person.", "Interview Questions": "Why do you want to work for us?"}, {"date": "19 Jun 2021", "title": "Supporter of Carer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Life Without Barriers (Ipswich) in Feb 2019", "Interview Descriptions": "Submitted a resume and cover letter and this via an email process.  I also contacted a current worker for current vacancies that were congruent with my current skills, qualifications and experience.  This was an email to the manager with my attached resume and cover letter applying for the role.  I also was invited for an interview probably a week after submitting this information.", "Interview Questions": "What is the role of the Supporter of Carer?"}, {"date": "19 Jun 2018", "title": "Team Leader Disability Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Life Without Barriers (Sydney) in Feb 2018", "Interview Descriptions": "The interview was in person, with two members of the staff team with which I'd be working, including my would-be manager. Was given a chance to talk about my career and was asked some standard interview questions as well as a scenario.\r\n\r\nPros: Fairly friendly interviewers, fair questions. Interview was conducted on time. \r\n\r\nCons: I had read about some contentious practices at LWB, and read a few negative reviews on Glassdoor from employees, particularly around a lack of professionalism, and poor management. I wanted to form my own opinion by observing when I was there, and didn't get a great impression. \r\n\r\nThere was a lot of loud banter/swearing and laughter coming from the office when I arrived (may have been a staff party/event), which was a bit odd for a Tuesday mid-afternoon. Also, didn't get a glass of water when I arrived, so had a mouth like Ghandi's sandals by the end of the interview (I know it's a little thing but it's a common courtesy and the least you can do for someone who could potentially be feeling nervous). The two blokes who interviewed me seemed pretty aloof and when asked about the challenges of the role/how it was to work in it, they confirmed that it was a lot of extra work/picking up after team mistakes/absences etc. including potentially having to complete the work of other roles on my team as required. I'm all for collaboration, and I think they were just being honest, but I took it as 'mate probably don't work here unless you want a chaotic work environment', which was a bit of a turn off.\r\n\r\nI ended up getting a call back from them saying that they wanted to offer a different role for me, to which I declined, as I had made the decision I wouldn't want to work there, and had been offered and taken another role elsewhere. Stupidly, I didn't ask them what that role was, but I would imagine it would've been as a team member, not a leader.", "Interview Questions": "They asked me typical interview questions, but did throw a curveball by giving me a scenario. It was something to do with being at work, having a client in an emergency situation, a super important meeting, and a staff issue all at the same time, and they asked how I would prioritise."}, {"date": "17 Dec 2019", "title": "RFO Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Life Without Barriers (Brisbane) in Jan 2016", "Interview Descriptions": "Very straight forward.I got a call and was invited for the interview..I was interviewed by 3 individuals one being my direct boss..The interview was average, just the usual interview questions nothing complex.The staff waa very friendly.", "Interview Questions": "The values of the company."}, {"date": "8 Jul 2017", "title": "Accountant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Life Without Barriers (Sydney) in Oct 2014", "Interview Descriptions": "Mix of  interviewers from Finance and Operational functions.  Questions are vary. informative and detailed. Interview was around 30 minutes very specific questions. \r\nGenerally friendly environment but formal", "Interview Questions": "1. tell me about yourself \r\n2. Work experience relates to the JD \r\n3 Scenarios \r\n"}], [{"date": "26 Feb 2016", "title": "Support Worker Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 2 days. I interviewed at Life Without Barriers in Aug 2014", "Interview Descriptions": "Saw a job in the newspaper, sent in application. Called me the next morning and asked about my work history, told them i had just come from a similar industry. Started my first shift two days later. After a week they asked for my background checks and was on my own with no support after my third shift.", "Interview Questions": "When can you start"}]]