[[{"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "Calm but unstructured", "rating": "2.0", "reviewer_affiliation": "Former Employee", "job_date": "21 Feb 2019", "job_title": "Anonymous Employee in Kuala Lumpur", "duration": "N/A", "pros": "Good flexible working environment (upon approval by manager); manageable workload but lack of opportunity to grow", "cons": "Working environment is not so friendly, especially the admin staff, however such behaviour is tolerated by higher management and no actions are taken to mitigate such issues. Leadership is an issue too, without clear instructions and sometimes indecisive management."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "a good place for tax professionals?", "rating": "2.0", "reviewer_affiliation": "Former Employee", "job_date": "13 Dec 2014", "job_title": " in Kuala Lumpur", "duration": "N/A", "pros": "IBFD is good place to learn international taxation if you want to get an expertise in taxation, there is 24 day annual leave, the remuneration, along with benefits, are not bad, the pressure for working is less than any consulting company, the work schedule is more or less flexible while there is abundant internal resources for research etc from database, library or any online resources.", "cons": "The work atmosphere of the office is not conducive at all since some people are allowed to behave negatively and there was no action from the local office management and seems not to be able to deal with harassment report, HR department is far away in Amsterdam. The office culture is way different, in a negative way, than the headquarter in Amsterdam. \r\nThis small office could be \"dangerous\" for employee's peace of mind and not for anyone who look for friendly and nice work environment.  It happens since some people, including admin staff,  treat other people negatively which eventually create bad office culture and negative values of the office."}]]