[[{"date": "5 Apr 2023", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Penn Medicine Princeton Health", "Interview Descriptions": "Human Resources will reach out and do a telephone interview and then you will do a face to face interview with the manager of the unit . The entire process was very pleasant, warm, and welcoming. I could tell that HR and management want to get to know you.", "Interview Questions": "What are your greatest strengths and weaknesses? How do you handle a difficult situation?"}, {"date": "27 Jan 2023", "title": "Primary Therapist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Penn Medicine Princeton Health in Jan 2023", "Interview Descriptions": "Interview process was thorough and very organized. They made me feel at ease. They were very understanding and insightful. Overall, I thought it went very well. They were very helpful.", "Interview Questions": "Give some examples of my current and past experiences in certain situations."}, {"date": "25 Oct 2022", "title": "CCU RN Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Penn Medicine Princeton Health", "Interview Descriptions": "The interview was very formal. However, one of the interviewers was checked out and not interested in getting to know me. It felt rushed like they didn’t have time to do it. It was very impersonal and the management team wasn’t warm and inviting.", "Interview Questions": "Why do you want to work for critical care. What’s something you need to continuously work on. Why Penn medicine?"}, {"date": "8 Apr 2022", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Penn Medicine Princeton Health in Mar 2022", "Interview Descriptions": "The interview was done online, and the person interviewing me was really nice. She asked many questions so be prepared to answer with your experience and why you want to volunteer.", "Interview Questions": "Q: Why do you want to volunteer here"}, {"date": "21 Jan 2022", "title": "Medical Receptionist Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 4 weeks. I interviewed at Penn Medicine Princeton Health", "Interview Descriptions": "I got a phone call to interview for the medical receptionist position from one of the recruiters. She was rude and even had the audacity to ask me what I could do with my degree in healthcare administration because she has never hired anyone with that degree in THE HOSPITAL? Uhhhh..red flag", "Interview Questions": "What are your weakness and strengths?"}, {"date": "17 Jan 2022", "title": "Certified Nursing Assistant CNA Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Penn Medicine Princeton Health (Princeton, NJ) in Dec 2021", "Interview Descriptions": "I applied on a holiday and literally the following day I got an email requesting I complete an employment personality survey (answering multiple-choice questions regarding certain scenarios/priorities/likes and dislikes) and an on-demand recorded interview (5 regular interview questions that you record yourself answering).  Took me about a week to do as I was having technical difficulties, (they even reminded me to complete it), but right after I submitted, I got an email scheduling a phone interview the day later, took maybe 15 mins, where we discussed departments, scheduling, hospital life, and pay, etc. I then scheduled an interview with the nursing manager (over zoom) for the unit that I would be employed in so she could give me the run down, etc.;however, I learned that I would be paid $18.00 an hour and that wasn't enough, but I know is competitive for this position. The recruiter kept acting like I was entry level and never worked before when I have years of experience, which was a little unfortunate. Seeing as Princeton Medical Center isn't as close as I'd like, I chose to go forward with my application at another hospital instead. I was told that Penn Medicine recruits pretty much at the end of every single year for positions that start in January and they usually are looking for people who can do a year-long commitment. Good luck to whoever applies. The whole process for me took almost a month. A lot of positions open at the end of the year for the start of the next year so if you're applying mid-year, it's probably more competitive as they have a lot of apps for fewer spots. At least Princeton Medical Center has parking!", "Interview Questions": "tell me about yourself (etc)"}, {"date": "20 Feb 2021", "title": "RPH Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Penn Medicine Princeton Health", "Interview Descriptions": "It was punctual, structured, planned and good use of time; apt questions relevant to job. Had chance to ask questions and understand role in detail. Got a tour of facility and meet some members of the staff.", "Interview Questions": "Give an example of multitasking"}, {"date": "9 Feb 2021", "title": "MHA Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Penn Medicine Princeton Health", "Interview Descriptions": "Met with two nursing managers. They asked specific questions to things that were on my resume. They also asked how comfortable I was working with patients who may be violent. Overall, it was a really easy interview and seemed as if i had the job already and they were just doing it as a formality. They are very desperate for staff.", "Interview Questions": "are you comfortable working with patients who may be violent?"}, {"date": "30 Jan 2021", "title": "Mental Health Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Penn Medicine Princeton Health", "Interview Descriptions": "Video Interview. Was asked four questions about my experience and why I would make a good mental health associate. I was able to re-record any answers I did not like.", "Interview Questions": "Describe a situation where you had to take a different approach than what you were taking"}, {"date": "15 Jan 2021", "title": "Nurse Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Penn Medicine Princeton Health", "Interview Descriptions": "first, video recording then later arranged for a telephone interview.  for the video record, a question is given and you can rerecord as you go. phone interview took about 20 min and a similar question was asked as a video interview.", "Interview Questions": "did you learn from your mistake?"}], [{"date": "2 Feb 2021", "title": "Nursing Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Penn Medicine Princeton Health (Princeton, NJ) in Jan 2021", "Interview Descriptions": "Applied December 22,2020. Received an email from a recruiter to complete montage video interview maybe 2 weeks later. Takes 20 min max and you can re-record. Only 4 questions. 2 weeks went by, emailed recruiter. A couple days maybe a week later a call Fromm the recruiter. A small phone screening was conducted. Asked when I can do a virtual interview through teams. Had interview that Friday. Lasted 20 min. Asked to do reference check that Monday.  If everything is clear I will be given an offer.", "Interview Questions": "Describe a time you had a difficult situation with a patient and what did you do to overcome it."}, {"date": "17 Nov 2020", "title": "Nurse Residency Program Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Penn Medicine Princeton Health (Plainsboro, NJ)", "Interview Descriptions": "It was unique due to the fact I had to upload a video montage of myself answering a few questions and then did a virtual interview. It was not intimidating at all. The interviewers made it chill and easy going.", "Interview Questions": "Where do you see yourself in 5-10 years?"}, {"date": "7 Oct 2020", "title": "Student Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Penn Medicine Princeton Health", "Interview Descriptions": "The interviewer asked me why I wanted to intern with Princeton House, talked about requirements, previous experience and education relevant to the job title.  Interviewer also discussed time requirements, supervision requirements, and other onboarding requirements needed for the position.  Interviewer also discussed what I knew about the program, and answered any questions I had.", "Interview Questions": "What makes you want to intern at princeton house?"}, {"date": "16 Feb 2021", "title": "Patient Services Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Penn Medicine Princeton Health (Princeton, NJ) in Sept 2020", "Interview Descriptions": "Prepare for a lengthy process. It took me about 3 months to get hired, accept the position, and begin training. It was slightly difficult because they are 1000 percent looking for the best and are definitely choosy. I believe I went through 3 rounds of interviews via Microsoft Teams with different people until I was offered the position via email.", "Interview Questions": "Q: “Why choose Penn Medicine?” \r\n"}, {"date": "18 Jul 2020", "title": "Liaison Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Penn Medicine Princeton Health", "Interview Descriptions": "It took a few months to hear back after I submitted the application. Once I was contacted, everything flowed easily. They would set up a date and emailed you a reminder. I had 2 interviews. 1 was through a phone and the next was in person with the managers.", "Interview Questions": "Name a time you dealth with a challenging situation and how did you handle it?"}, {"date": "16 Jun 2020", "title": "Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Penn Medicine Princeton Health", "Interview Descriptions": "Meet with a few clinicians/potential supervisors. They ask you about your history, your resume, what population you'd like to work with. Then you ask questions as well. Very nice group of clinicians. I wish I would've accepted the offer", "Interview Questions": "What's your framework?"}, {"date": "20 Feb 2020", "title": "Supply Chain Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "The process took 2 weeks. I interviewed at Penn Medicine Princeton Health", "Interview Descriptions": "A little misleading. Fast. Somewhat informative. I was interviewed by the manage and another employee. They were very friendly and anxious for me to start. They explained what my job would entail but failed to mention other things", "Interview Questions": "If I’m computer literate."}, {"date": "21 Aug 2019", "title": "Mental Health Asdociate Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Penn Medicine Princeton Health (Plainsboro, NJ) in Aug 2019", "Interview Descriptions": "Sat down and was asked a bunch of situational questions I’m regards to aggressive patients. \r\nAsk me for a background of myself. Asked about my experience relating to the job.", "Interview Questions": "What would you do if the patient starts to show signs of aggressive behavior?"}, {"date": "25 Jan 2021", "title": "Health Information Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Penn Medicine Princeton Health (Hamilton, NJ) in Jun 2019", "Interview Descriptions": "Standard Interview process. I interviewed with the departments directors and one other manager. The interview felt like an organic conversation, discussing what the role and the company expectations. Once all the details were discussed they allowed time for me to answer any outstanding question.", "Interview Questions": "What are some of the expectation would I require to accept the role? "}, {"date": "29 Jun 2021", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Penn Medicine Princeton Health (New Brunswick, NJ) in May 2019", "Interview Descriptions": "The interview process was welcoming and comfortable.  The staff interviewing me for friendly and easy to talk to. I was interviewed by about 4 staff members, all of which were very nice. The interview lasted about 15-20 minutes.", "Interview Questions": "How are you in high stress situations?"}], [{"date": "21 Feb 2019", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Penn Medicine Princeton Health", "Interview Descriptions": "I applied through a search engine. The first step was being contacted for a phone interview. The lady that did my phone interview was nice and it was more of an informal conversation. I was than called back for a second in person interview. This was a panel interview of about 6 different people. It lasted about 20 mins for me. The questions weren't very hard or to specific and the members on the panel seemed very friendly.", "Interview Questions": "Why should they choose you over the other candidates?"}, {"date": "16 Feb 2019", "title": "Mental Health Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Penn Medicine Princeton Health", "Interview Descriptions": "Wasn't bad. Relaxing talk with supervisor. Goes over basic expected duties. Describes layout of the hospital and where I will work. Takes us for a tour around hospital and introduces us to staff. It was nice.", "Interview Questions": "Why do you want to work here?"}, {"date": "16 Aug 2018", "title": "Data Entry Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Penn Medicine Princeton Health", "Interview Descriptions": "Had a good phone interview. I went in for the live interview on a weak day and it was ok. Job description on the website was totally different from what the supervisor describe. The supervisor had a tough time comprehending what the role entails but I listened. Recruiter even gave me a day she would contact me with any updates and its be silence for almost a month. A email would have been sufficient actually but nothing. These recruiters should learn common courtesy. I won't be applying to this hospital again.", "Interview Questions": "Nothing substantive. Why did you leave previous employers"}, {"date": "7 Feb 2018", "title": "Medical Technologist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Penn Medicine Princeton Health (Princeton, NJ) in Dec 2017", "Interview Descriptions": "HR  phone Interview for approximately 20 mins, covered job description and salary.  HR was very laid back and was easy to have a conversation with her. Asked approximately 5-6 questions and gave an overview of the lab and what they are looking for.", "Interview Questions": "They asked basic questions about Why would you like to work for PCHS? What did you enjoy the most about your past job? Why do you want to leave your current job? How do you maintain a positive environment at work place? "}, {"date": "13 Oct 2017", "title": "Homecare Infusion Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 4 days. I interviewed at Penn Medicine Princeton Health (Allentown, NJ) in Oct 2017", "Interview Descriptions": "I received an email for a hiring event at Princeton healthcare system. I registered for the event and applied to positions I was interested working. I received a phone call the following day from a recruitment specialist, who advised me to schedule a phone interview. I scheduled an interview for two days in advance in order to prepare responses to interview questions, noted in reviews from other applicants. I received the phone call interview for a duration of 30 minutes. The interviewer began the process by describing the future aspirations of the company and asked what I was looking for in an employer. She was scattered in her questioning and ‘referred to her notes’ as she  admitted to throughout the interview. I heard a dog barking in the background, and she excused herself to put the call on hold for approximately a minute and a half. When the interview continued, she discussed salary with me. Finally, she reviewed my resume and asked interview questions. The interview went well except, she questioned a time gap in my employment. I had no excuse, so I had to admit I omitted a job. She concluded the interview by telling me that she would submit my information to another recruitment specialist and will be in contact whether I will be considered for an in-person interview. I received an email two days after, which declined an offer for employment.", "Interview Questions": "1) am I looking for in an employer? \n2)What interests me about the position I am applying? 3)Describe how you enter a patient’s room.4) Describe how to deescalate a hysterical patient who is concerned for the well-being of a loved one."}, {"date": "1 May 2017", "title": "Phlebotomist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 2 weeks. I interviewed at Penn Medicine Princeton Health in Apr 2017", "Interview Descriptions": "Apply online, get the phone interview a week after, after another week got onsite interview and after 4 days got phone call for the job offer and I accept it.", "Interview Questions": "What do you want to leave your current job?"}, {"date": "31 Mar 2017", "title": "Certified Nursing Assistant Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Penn Medicine Princeton Health (Princeton, NJ) in Mar 2017", "Interview Descriptions": "I received an email about scheduling the interview online. The phone interview was 30 min and the interviewer went over my resume. She did not give any indication on how the interview went. About a week later i received a call to schedule the in person interview. I declined the offer due to the low salary.", "Interview Questions": "My experience in the field."}, {"date": "28 Jun 2016", "title": "Pt Aide Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Penn Medicine Princeton Health", "Interview Descriptions": "Phone interview. It lasted about 10-15 minutes. Went through my resume and asked questions on my experiences at the certain places I worked at. Then went through some interview questions followed by a period of me asking questions. Overall it was a good experience.", "Interview Questions": "Name a time in which you had a difficult patient and how did you respond?"}, {"date": "16 Feb 2016", "title": "Mental Health Associate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Penn Medicine Princeton Health", "Interview Descriptions": "I got a link to set up a phone interview with a recruiter. She had no idea what a January College graduate was and kept stressing that the position requires a bachelors degree.", "Interview Questions": "How did you hear about the position"}, {"date": "24 Feb 2016", "title": "Mental Health Therapist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Penn Medicine Princeton Health (Princeton, NJ) in Jan 2016", "Interview Descriptions": "Sent my resume to PH online recruiting. Received a phone call from recruiter who was working on numerous jobs who said that my background would be a good fit for. She was so enthusiastic and I had to pick which job I was interested in. I had a great IV with a Director and her staff. This is the second time I have interviewed with PH. A few days later the recruiter called to tell me an internal candidate was picked. I feel that PH posts job, gets a mandatory external candidate in and then hired internally anyway. It felt like my time was wasted.", "Interview Questions": "Have you ever worked with this population? How do you handle stress and multitasking."}], [{"date": "26 Dec 2015", "title": "Registeted Nurse- Surgical Unit Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at Penn Medicine Princeton Health (Woodbridge, NJ) in Dec 2015", "Interview Descriptions": "-applied online and was called back by an HR associate out of state. She is very pleasant, informative, and thorough with information. \n- scheduled for an interview about 2 weeks after the initial phone call. My experience was different than some of the peoples' as it definitely was not typical. The manager spent A TON of time with me. She gave me history on the hospital, a full tour of everything, she interviewed me and had peers interview me. It was about a 2.5-3 hour process but was fun.\n- the most impressive thing  was that after the interview they kept me in the loop which most companies do not do. Typically you are sitting around waiting for some kind of call but they kept me informed was very professional. \n- they offered me the job and i accepted, they then sent me a series of emails for references, background checks and all of this paperwork to sign on the internet. It was a bit intimidating but it also showed that the people around you are well qualified. \n- my employee health/hr employment went seamlessly. The doctor who saw me and the nurse were both extremely friendly as was the HR representative. \nI had an extremely positive experience with the hiring process which makes me excited to begin working there.", "Interview Questions": "These questions were typical. Conflict resolution, prioritizing. They were very much into my background and goals. We spoke mostly about these things; i got the sense they want nurses who are aspiring to do more eventually."}, {"date": "17 Dec 2015", "title": "Office Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Penn Medicine Princeton Health (Cherry Hill, NJ) in Dec 2015", "Interview Descriptions": "Typical. Telephone screening then a scheduled face to face with site manager and regional. Next day I received an email asking how the interview was and if I would be interested in moving forward. The panel interview was scheduled for the following week. The panel was attended by three managers.", "Interview Questions": "Describe your management style.\r\nHow would you handle a disagreement between 2 employees?\r\nWhat is your best trait, worst trait?"}, {"date": "20 Nov 2015", "title": "Unit Secretary Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Penn Medicine Princeton Health", "Interview Descriptions": "The interview actually was great... They lead me to believe this would be a great place to work. The lady from the recruitment center was great & so was the DON when I met him.", "Interview Questions": "What was a time you when above & beyond?"}, {"date": "18 Nov 2015", "title": "Liaison Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Penn Medicine Princeton Health (Plainsboro, NJ)", "Interview Descriptions": "The interview process was in depth. You have to meet with the department manager, the team you will be working with, the VP of sales who is one of the head executives of the hospital.", "Interview Questions": "Situational questions, leadership questions, experience and how you can be an asset "}, {"date": "30 May 2017", "title": "Primary Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Penn Medicine Princeton Health (Princeton, NJ) in Oct 2015", "Interview Descriptions": "There was a phone interview first. It was very easy, and the interviewer was personable. I had two in-person interviews after that, the second being a panel interview with the immediate supervisor and department head, as well as another therapist.", "Interview Questions": "Discuss a challenging client and how you dealt with them."}, {"date": "2 Jun 2015", "title": "Admissions Liaison Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Penn Medicine Princeton Health (Hamilton Sq, NJ) in Apr 2015", "Interview Descriptions": "I applied for the position after viewing it on Indeed.com. About two to three weeks later I received an email asking me to schedule an over the phone interview. I scheduled my call within the week and spoke with someone from HR. The phone call went well and I was told I would be hearing back in regards to the next step. A few days later the same HR rep called me and invited me to an on site interview with the hiring manager. I ended up going on that interview as well as an additional panel style interview. I ultimately was not chosen but through the interview process made a great impression on the HM and am currently being considered for another opportunity.", "Interview Questions": "What did I feel like I could bring to the position?"}, {"date": "7 Mar 2015", "title": "Admissions Liaison/Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Penn Medicine Princeton Health", "Interview Descriptions": "I applied online and received an email about 1-2 weeks later asking to schedule a phone interview. I had to pick a time one day during the following week. So, finally 3-4 weeks after applying, I have my phone interview. The questions asked were pretty basic, and overall, the interview went well - the woman on the phone basically even said so herself. She then said I should get a call from the hiring manager to come in for an in-person interview within 1 to 2 weeks, tops. She also said that I would receive a call or email if the position were to become filled. \r\nAbout 2-3 weeks after my phone interview, I called to check the status of the position. I was told it still was not filled. This was now about 2 months after initially applying. \r\nUltimately, it has been 3 months now, and I never heard anything from them.\r\nSo basically, the whole process was absolutely pointless. Even if I wasn't chosen, or the position was no longer needed...whatever the case may have been, they could have at least let me know. \r\nI expected a better experience from Princeton.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "19 Feb 2015", "title": "Senior Primary Therapist - Child/Adolescent IOP/Partial Program Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 1 day. I interviewed at Penn Medicine Princeton Health (North Brunswick, NJ) in Feb 2015", "Interview Descriptions": "During the interview, I first met with the Clinical Coordinator for the program, who was quite pleasant and was well organized, focused, and professional. She asked standard interview questions, inquired what I knew of the organization itself, why I was interested in the position, and how I might be a good fit, etc. She was polite, took notes about things that I was mentioning, and I could tell that overall she was hearing most of what I was saying.\r\n\r\nAfter meeting with her, she took me to be interviewed by 2 other employees but did not tell me what to do after that. I met with these other 2 ladies, probably younger than myself, who were not so polite. Not even sure that they were as qualified to do this job as I am to be honest. They had my resume, as I could blatantly see it in their hands. They sat, both staring at me, and asked me questions interrogation style. As I was answering, I could see them making faces at one another, somewhat smirking, or smiling. They were probably the rudest people I have ever been \"interviewed\" by in my entire life. It was as if I was on the set of \"Mean Girls\". It was so uncomfortable and unprofessional, and I could not get out of there fast enough. I have never been so embarrassed in any interview - I am generally very comfortable, well-spoken, and usually always know what to say in interviews, but with these two girls I was tongue tied..... would never want to be in that situation again! Will never apply to a job at this place EVER EVER AGAIN!", "Interview Questions": "She asked what I knew about the company, why I was interested in the position, how I might be a good fit, what my qualifications were, what my strengths and weaknesses were, where did I see myself in 3 years, what were some difficult situations that I had been faced with in the past, and what were some things in my past careers that were difficult at the time that I am now proud of."}, {"date": "5 Jan 2015", "title": "Mental Health Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Penn Medicine Princeton Health", "Interview Descriptions": "I applied online, got an email about 2 weeks later asking to set up a phone interview, was asked to come in to meet the Director of Nursing, was hired.", "Interview Questions": "Nothing in particular that I can remember."}, {"date": "16 Dec 2014", "title": "Unit Secretary Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 months. I interviewed at Penn Medicine Princeton Health", "Interview Descriptions": "Phone Interview then In-person Interview. Questions aren't too difficult to answer. I was called in for a 1:1 interview with the manager 5 months after the phone interview. Manger ask simple questions for example: why i wanted the position? After the interview, manager gave me a tour of the hospital. I was hired a 3 weeks after the interview.", "Interview Questions": "N/A"}], [{"date": "20 Apr 2014", "title": "Unit Secretary/Scheduler Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Penn Medicine Princeton Health", "Interview Descriptions": "An interview with the recruiter and Manager", "Interview Questions": "N/A"}, {"date": "11 Feb 2014", "title": "Nursing Assistant Interview", "results": "No Offer", "experience": "N/A", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Penn Medicine Princeton Health (Princeton, NJ) in Jan 2014", "Interview Descriptions": "I applied to a job and didn't get a response until months later.  By then I had applied to many other jobs within the system.  The HR manager who conducted the phone interview was nice and didn't ask me too many things that threw me off, but it was my first interview so it was hard.  I'm guessing that more experienced candidates would have no difficulty.  I received a prompt reply about my phone interview results, which was much appreciated.", "Interview Questions": "I can see that you applied to many positions.  Why are you interested in this one? "}, {"date": "11 Aug 2016", "title": "Admissions Clinician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Penn Medicine Princeton Health (Hamilton, NJ) in May 2013", "Interview Descriptions": "I applied online and then received an e-mail from the HR recruiter to set up a phone interview. After the phone interview, I received a call from the manager of the Admissions department to set up the in-person interview. The manager was very pleasant. The question were typical behavioral and experience questions that you can easily find online. What threw me off if that just when I thought the interview was over (I had asked all of my questions, learned about the rest of the process, etc) the manager very unexpectedly asked \"Why should we hire you?\" I answered the question, but it definitely had me off guard, as I already relaxed and was sure I didn't need to answer anything else. I got the offer 8 business days later.", "Interview Questions": "What are your strengths and weaknesses?"}]]