[[{"date": "7 May 2022", "title": "Assistant Director of Donor Relations Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Trinity College (Connecticut) (West Hartford, CT)", "Interview Descriptions": "Contacted over a month after submission of job application. Once contacted for an interview, I was asked to participate in two 45-minute interviews, one after another, to be scheduled in less than a week. Staff was wonderful to speak with, and I felt it could be a great fit. Unfortunately after these interviews, I didn't hear back for 3-4 weeks, despite sending follow up emails. With this lack of response and the extended timeline, I chose to accept another job offer and withdraw from the interview process. I received a response (after I had already accepted this other offer) expressing I had been a strong candidate and there was intention to move me forward in the process. Seems like a great team, but interview timeline and lack of responsiveness was too large of a negative in today's current job market.", "Interview Questions": "Share past donor relations project experiences"}, {"date": "9 Sept 2020", "title": "Student Admissions Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Trinity College (Connecticut)", "Interview Descriptions": "Initial application phase, to one-on-one interview, and then candidate selection. The process was simple and sweet, and the selection took only a couple of days to get back to me.", "Interview Questions": "What is the quirkiest thing about you?"}, {"date": "20 Oct 2020", "title": "Assistant Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Trinity College (Connecticut) in Sept 2020", "Interview Descriptions": "The interview process was pretty  quick. The interviewers in the committee were all very kind and asked great questions. Seems like a great place to work. I am looking forward to learning more about the school.", "Interview Questions": "They asked about my experience "}, {"date": "2 Dec 2019", "title": "Assistant Professor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Trinity College (Connecticut)", "Interview Descriptions": "I was interviewed for a humanities discipline. The committee was comprised of six people. Warm atmosphere, very professional. They will send you instructions before your skype interview. Standard questions. You would be fully prepared if you follow their instructions carefully.", "Interview Questions": "contribution of your research "}, {"date": "9 Aug 2020", "title": "Associate Director Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Trinity College (Connecticut) (Hartford, CT) in Nov 2019", "Interview Descriptions": "Long process but gives you a chance to meet with all staff and get a feel for the atomsphere of the office. Very nice people, moved pretty quickly. Questions were straight and to the point. \r\nInterview from start to finish took about 2 hours.  After hearing more about the position, it was clear that it was not for me.", "Interview Questions": "Genereal questions related to the position"}, {"date": "29 Mar 2023", "title": "Undergraduate Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Trinity College (Connecticut) (Hartford, CT) in Nov 2019", "Interview Descriptions": "Admissions interview, met with a student and faculty member. They just asked me about myself and asked about certain things on my application. They were both very friendly and I got into the school so I assume it worked out.", "Interview Questions": "What I wanted to major in"}, {"date": "2 Jul 2019", "title": "IT Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Trinity College (Connecticut)", "Interview Descriptions": "Quick and relaxed interview with a focus on problem solving skills within the college's IT systems. Interviewers were looking for creative solutions to fix problems. Employer also more likely to hire underclassmen such that they can learn and work throughout their college career.", "Interview Questions": "How would you deal with a uncooperative client on the phone?"}, {"date": "28 Jan 2017", "title": "Assistant Director Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Trinity College (Connecticut) (Hartford, CT)", "Interview Descriptions": "Conducted one phone screening, then two separate interviews in person. Met independently with all members of office. In retrospect, office culture was unanimously described as friendly, fun, collaborative, when in actuality, it is toxic, cliquey, volatile, mismanaged, bullying, lacking in resources, sufficient staff, effective communication, support for staff, nurturing for and utilization of staff talent, a mission/philosophy, opportunity for professional development and promotion, and adequate salaries for overworked employees.", "Interview Questions": "Name a stereotype about millennials that is accurate and one that is a misconception."}, {"date": "30 Apr 2017", "title": "Assistant Director of Security Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Trinity College (Connecticut) (Hartford, CT) in Aug 2016", "Interview Descriptions": "Initial Interview was a round-table type of interview with at least 6 people present from different articles.  Each interviewer had the opportunity to ask at least one question and then get an answer for the candidate.  There was no formal format to who asked the next questions, but they did give the candidate an fair amount of time to answer the questions.  After it was over candidate was advised that they would hear from the board, if they were going to proceed further.  Never heard from the board and it was at least 4-5 months before receiving an email that would not be proceeding further in the process.", "Interview Questions": "As assistant director of security what do you see as the most pressing needs and concerns for Trinity students"}, {"date": "29 Oct 2015", "title": "Student Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Trinity College (Connecticut) (Hartford, CT) in Apr 2015", "Interview Descriptions": "Students were nominated for this position, and then applied. Every student was interviewed, and the management selected workers after the process. I heard about 2 weeks after I interviewed that I'd gotten the job.", "Interview Questions": "How do you see diversity on campus?"}], [{"date": "5 Feb 2018", "title": "Program Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Trinity College (Connecticut) (Hartford, CT) in Apr 2015", "Interview Descriptions": "I filled out the job application online and was contacted a week later.  They scheduled and interview and I met with the director and the person holding the position I was applying for.  At first two people in the interview seemed intimidating but once the interview started I realized how friendly they were.", "Interview Questions": "what are your strengths and weaknesses? and what experience do you have as a leader/manager?"}, {"date": "12 Mar 2015", "title": "Annual Fund Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Trinity College (Connecticut) (Hartford, CT)", "Interview Descriptions": "easy, standard interview process ask about a lot of different background experience that may be helpful to the job. Asked if any outside commitments that would make you not available to work. Asked if could work events. Gave hypothetical situations and asked you what you would do in them to figure out if good fit.", "Interview Questions": "What makes you a good fit for this position"}, {"date": "18 Aug 2010", "title": "Research Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Trinity College (Connecticut) (Hartford, CT) in Jul 2010", "Interview Descriptions": "Met with 5 people in the department for 1 on 1 interviews.", "Interview Questions": "List 3 positive and negative attributes about yourself."}]]