[[{"date": "22 Apr 2023", "title": "Communications Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at 100 Resilient Cities", "Interview Descriptions": "It was quite simple. I had two conversations with the hiring manager (and executive director for the second). Had to do a short writing assignment as part of the process", "Interview Questions": "Asked to provide writing samples"}, {"date": "10 May 2022", "title": "Program Manager Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at 100 Resilient Cities", "Interview Descriptions": "The interview was very standard and the questions were fairly straightforward. Interviewer gave me time to ask my own questions. I heard back a few days after the interview. I had 3 interviews in total", "Interview Questions": "Why do you want to work here?"}, {"date": "19 Apr 2019", "title": "Associate Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at 100 Resilient Cities (New York, NY) in Jan 2016", "Interview Descriptions": "It took about 4-5 weeks for the entire hiring process and it involved multiple phone and in-person interviews. After the team had screened the initial applications, they shortlisted 3-5 applicants. Then phone interviews were held via skype. The interview team included colleagues doing similar work, team leaders and the senior leadership. All interviews allowed some time for the interviewees to ask questions about the organization and the culture. It was a great way for the selected candidates to also learn about the organization, the team they were likely to join and get a sense of the colleagues they would be interacting with.", "Interview Questions": "Have you worked on urban resilience issues before, if yes please describe your specific experience? "}], []]