[[{"date": "N/A", "title": "Adjunct Faculty Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at South College (Dallas, TX) in Feb 2023", "Interview Descriptions": "The interview process for adjunct faculty was very smooth and well organized. I completed a video interview and then the same day was asked to schedule a Zoom interview. I was interviewed by the Associate Dean a few days after that and the process was well planned and organized. During the Zoom interview the Associate Dean asked interview questions and we talked about the job, company, and expectations of the position, I was done in about 45 minutes. She let me know what to expect after the interview and the time frame to hear back from her. This was by far one of the best planned interview processes, and I was offered an adjunct position in about 2 weeks. I am super excited to be joining South College!", "Interview Questions": "How many years teaching experience do you have? Have you taught adult learners? What is your teaching style?"}, {"date": "27 Jun 2023", "title": "Adjunct Clinical Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at South College", "Interview Descriptions": "The interview process was welcoming and the interviewers were clear about expectations and answered all my questions. The questions were typical interview questions with the goal of getting to know your personality and how you will interact with students and represent the college.", "Interview Questions": "How would you relate to difficult students in the clinical setting?"}, {"date": "9 May 2023", "title": "Admissions Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at South College (Cranberry, PA) in May 2023", "Interview Descriptions": "The interview process was very quick and thorough. It all was within a 3 day process. Started with a recruiter reaching out via email, setting up a day to connect via zoom for about 15min, setting up a day to then connect with a director for a final/formal interview in person and then after that the director was contacting you within a short amount of time to let you know you were either offered the job or not. I’ve had a very smooth process and I am very excited to join this personal and successful team at South College!", "Interview Questions": "What made you interested in applying to South College?"}, {"date": "12 May 2023", "title": "Full Time Faculty Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at South College (Nashville, TN) in Apr 2023", "Interview Descriptions": "Initial interview was ok. Expect a lot of emphasis on student success and engagement. Not a college interested in research. Interview lasted approximately one and half hours. Faculty teach one online course.", "Interview Questions": "Do you have 18 graduate credit hours of subject matter?"}, {"date": "28 Mar 2023", "title": "Admissions Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at South College", "Interview Descriptions": "Will meet with Director of Admissions to discuss your background, interest in the role, and a tour of the campus. The tour of the campus was with another Admissions Officer, so there's an opportunity to ask about a true \"day in the life\".", "Interview Questions": "Why are you interested in this opportunity?"}, {"date": "3 Apr 2023", "title": "Admissions Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at South College (Atlanta, GA) in Mar 2023", "Interview Descriptions": "South College provided a very professional, highly energetic, and engaging interview. The entire team was cheerful and welcoming. The questions asked were appropriate and to the point. Following the interview, they gave me a tour, including a meeting with an administrator. I was very impressed.", "Interview Questions": "They delved into my experience and my ability to address issues that I would face in the position."}, {"date": "2 Mar 2023", "title": "Adjunct Clinical Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 3 days. I interviewed at South College (Nashville, TN) in Feb 2023", "Interview Descriptions": "The interview was very collaborative and I was kept up to date throughout the whole process. Everything was explained well to me and all questions were answered in a timely manner. It was a great experience.", "Interview Questions": "What interests you about being and instructor?"}, {"date": "3 Mar 2023", "title": "Admissions Officer - Online Campus Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at South College (Cranberry, PA) in Feb 2023", "Interview Descriptions": "The interview process was efficient. They provided a very quick turnaround time for a decision as well. Not only did they provide a chance to meet some of the potential coworkers, but they also gave a tour of the campus.", "Interview Questions": "What do you believe your biggest obstacle will be with this position?"}, {"date": "13 Feb 2023", "title": "Admissions Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at South College (Atlanta, GA) in Feb 2023", "Interview Descriptions": "Two part interview. Salary range was given. The first zoom call covered the expectations of the role, working schedule, and other policies. The second meeting was in person with the director. Toured the campus and met the president. Answered some interview questions.", "Interview Questions": "How would you describe your level of confidence and your ability to work in a fast paced environment?"}, {"date": "26 Jan 2023", "title": "Clinical Administrative Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at South College (Knoxville, TN) in Jan 2023", "Interview Descriptions": "The entire process was very smooth. They were attentive to my emails and phone calls, continued communication with me through the process, and made sure I knew what to expect. Even though I was interviewed by a panel of 6 people, I felt comfortable during the interview, and not intimidated.", "Interview Questions": "They discussed my resume with me and reviewed my skills. They were also very good about letting me know what would be expected of me in the position for which I was interviewing. They gave me time for questions and were thorough in their answers."}], [{"date": "25 Jan 2023", "title": "Financial Services Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at South College (Cranberry Twp, PA) in Jan 2023", "Interview Descriptions": "The interview process was very welcoming and easy. Everyone seems very nice and helpful. During the interview, I was shown around the building and different departments as well as introduced to a couple people.", "Interview Questions": "Why do you think you wold be a good fit?"}, {"date": "29 Jan 2023", "title": "Adjunct Professor of Computer Science Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at South College (Atlanta, GA) in Jan 2023", "Interview Descriptions": "Very formal with a great interviewer. She asked questions, and I answered them. Took about 10-15 minutes. The process is getting to understand the candidates and make sure they are a good fit for the position.", "Interview Questions": "I was asked about my degrees. The highest one."}, {"date": "21 Jan 2023", "title": "Financial Aid Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at South College (Cranberry Township, PA) in Jan 2023", "Interview Descriptions": "Excellent collaborative, professional interview with relevant questions, clarity, and courteous atmosphere. Informative description of job tasks and explanation of expectations, benefits, and compensation. Respected and efficient usage of time. Absolutely perfect~", "Interview Questions": "Please describe how our would address and resolve a difficult conversation with clients."}, {"date": "5 Aug 2022", "title": "Admissions Representative Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at South College (Knoxville, TN) in Jul 2022", "Interview Descriptions": "did 1 video interview and followed up with 1 in person interview that was about 30 minutes and tour of the building. Was told would have a decision back in about a week or 2 but never got any response back after in person interview", "Interview Questions": "-Tell me about yourself\n-Do you have sales experience\n-Do you know about the history of the school\n-what are your strengths and weakness\n-how do you handle set backs/ rejections/ over come obstacles\n\n"}, {"date": "12 Jul 2022", "title": "Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at South College (Knoxville, TN) in Mar 2022", "Interview Descriptions": "10minute presentation on topic of choice. Interviews with 2 people up front and then second interview with 2more people. Very comfortable setting. Questions were not too in depth. Entire process the first go around was approximately one hour. The second interview was about 30 minutes.", "Interview Questions": "What if I had a student who shared their mental illness journey in the class."}, {"date": "12 Oct 2021", "title": "Adjunct Professor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at South College (Brodheadsville, PA) in Oct 2021", "Interview Descriptions": "Very casual and comfortable. The interviewer allows for the interviewee to explain themselves and their background without need to be cut off. The interviewer was also very upfront and honest about the position and what to look forward to.", "Interview Questions": "What experience to do you have teaching? "}, {"date": "22 Mar 2021", "title": "Admissions Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at South College", "Interview Descriptions": "Very good  it was a 3 part process.  Went very smooth and pleasant. People are so nice and helpful and tell you everything you need to know about job and description of it.", "Interview Questions": "Experience how many years do you have"}, {"date": "8 Sept 2020", "title": "Adjunct Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at South College", "Interview Descriptions": "Simple, straightforward— predictable, but comfortable  An initial pre qualifying interview was conducted over the phone before the in person interview.  Be prepared but relaxed. They want to get to know you as a person as well.", "Interview Questions": "Why do you want to work at South College?"}, {"date": "2 Sept 2020", "title": "Full Time Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at South College in Aug 2020", "Interview Descriptions": "I have a casual phone interview with the Dean/faculty member. We set up an   \r\nIn-person interview with a teaching demonstration With 2 of the faculty members in another week.", "Interview Questions": "Why do you want to teach in a classroom? "}, {"date": "10 Jun 2019", "title": "Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 2 weeks. I interviewed at South College", "Interview Descriptions": "Two step process of interview and twenty minute teaching simulation in focus area with faculty of different programs and dean of college. Interview questions were fairly typical in  nature.", "Interview Questions": "Previous instructor experience"}], [{"date": "11 Sept 2017", "title": "Physician Assistant Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at South College (Knoxville, TN)", "Interview Descriptions": "The school hosts an entire day of interviewing with approximately 50 candidates at each interview. The day begins with a tour around the school and various activities. The most important part of the process is the group interview where you and two other students are asked a variety of questions in front of a faculty panel of 3-4 staff members. Students also complete a medical terminology quiz and write 2 essays. Following this, lunch is provided and then students are informed of the school's decision to accept, waitlist, or deny the student.", "Interview Questions": "Outside of medicine, what do you enjoy doing?"}, {"date": "17 Apr 2021", "title": "Human Relations Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at South College (Rincon, GA) in Feb 2017", "Interview Descriptions": "Great interview, great intev, good interview, it was an okay interview, not a bad interview, it seemed like a good interview, not sure how the interview went, not sure if I will get the job but the interview seemed like it was a good interview", "Interview Questions": "Hobbies, home life, off hours partying"}, {"date": "30 Sept 2015", "title": "Student Services Position Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at South College (Asheville, NC) in Oct 2014", "Interview Descriptions": "I had an initial interview but was never notified that the position had been filled. It was very disheartening to find out through other people that I worked with that I had not been considered for the job", "Interview Questions": "How I would handle dissent among staff members talking behind administration staff?"}, {"date": "6 Jan 2016", "title": "Director Information Technology Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at South College (Knoxville, TN) in Dec 2012", "Interview Descriptions": "Was asked to take a myersbriggs type test to view your brain functionality and possible performance. Met with the VP IT which described the working environment. Was asked technical questions to determine my depth which far exceeded the VP.", "Interview Questions": "What systems have you worked on and supported. "}, {"date": "21 Feb 2013", "title": "Student Accounts Clerk Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at South College (Knoxville, TN) in Feb 2011", "Interview Descriptions": "I was in a group interview with CFO, my direct supervisor along with the person that was leaving the position.  Interview was well organized by the management.", "Interview Questions": "Why I came back to Tennessee"}]]