[[{"date": "17 Jul 2023", "title": "Shop Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Cancer Research UK (Manchester, England)", "Interview Descriptions": "One stage meet up in person. Standard interview questions for retail. Was a nice experience, got to meet all the staff on the first visit, and then was contacted not long after regarding the outcome of the interview.", "Interview Questions": "What is good customer service"}, {"date": "4 Jul 2023", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Cancer Research UK (Walsall, England)", "Interview Descriptions": "quite easy in all regards. No questions asked were of extreme difficulty but they were quite rigorous. Proper preparation is key. Best to go over some questions and come prepared", "Interview Questions": "Why do you want to work specifically at this charity shop"}, {"date": "14 Jun 2023", "title": "Sales Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Cancer Research UK", "Interview Descriptions": "It was very calm and the questions were some I’d come across in my research. They would tell you about the job and ask why you want to work for them and a little about yourself and then get into more questions", "Interview Questions": "What would you do if a volunteer didn’t feel like doing that task that you set out for them"}, {"date": "11 May 2023", "title": "Online Marketing Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Cancer Research UK (Harold Wood, England) in May 2023", "Interview Descriptions": "Group interview process - okay if you're a salesperson - they who talk loudest and all that. Not so relevant if all you're doing is unpacking, photographing and listing online.", "Interview Questions": "Do you have a problem with working for a company that experiments on animals."}, {"date": "1 May 2023", "title": "Brand Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Cancer Research UK (London, England)", "Interview Descriptions": "quick and efficient although not made clear that it was first and final. that information would have been helpful upfront. good communication outside of that, prompt responses and very friendly people", "Interview Questions": "Give examples of when you've had to manage key stakeholders and what you did"}, {"date": "19 Apr 2023", "title": "Laboratory Team Leader Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Cancer Research UK (London, England)", "Interview Descriptions": "I did the online application with many questions and then got an invite for an online interview. I never got a respond (negative or positive) even though I sent an email after the date they told me they were going to let me know.", "Interview Questions": "Describe a time I was a team leader before"}, {"date": "9 Apr 2023", "title": "Assistant Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Cancer Research UK (Exeter, England)", "Interview Descriptions": "Questions ran off list one after the other, but didn't appear as though the answers were actually LISTENED to, or heard. Felt like they were getting set number of questions asked within set time to complete interview, and that was their main aim. Did not put interviewees at ease. Video interview with two Managers, however, name of third person kept coming up on screen as though they were also listening in (with the shutter over the camera lens). Quite off-putting.", "Interview Questions": "Why do you think you would be suitable for this job? Do you think customer service is important? What would you do to abide by Health and Safety regs? Give an example of good customer service offered in a previous role."}, {"date": "12 Jun 2023", "title": "Marketing Executive Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Cancer Research UK in Apr 2023", "Interview Descriptions": "Sent list of some questions and a task to prepare for before the interview, questions were mostly focused around experience and skills rather than competency style questions, friendly interviewers and heard back within 2 days which was appreciated, they were happy to go through feedback in more detail with me", "Interview Questions": "Discuss a communications/marketing campaign you've worked on - what was your role, any challenges and how you approached it etc."}, {"date": "13 Apr 2023", "title": "Graduate Scheme Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Cancer Research UK (London, England) in Apr 2023", "Interview Descriptions": "1.Online application 2.Situational Judgement Test on Prioritization 3.Audio submission - three motivation questions 4.Assessment centre - three parts including one presentation and one behavioral interview The interviewers were nice and friendly", "Interview Questions": "Tell me about a scenario to demonstrate your teamwork skills"}, {"date": "10 Mar 2023", "title": "Retail/Store Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Cancer Research UK in Mar 2023", "Interview Descriptions": "The whole interview was online, the sound on the computer icon wouldn't come off, I could hear on the interviewers side, but she was unable to hear me, she terminated my interview and went to the next, why can we not do the interview in person it felt impersonal.", "Interview Questions": "N/A"}], [{"date": "6 May 2023", "title": "Science Communication Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Cancer Research UK (Stratford, London, England) in Mar 2023", "Interview Descriptions": "Online application. I was invited to do a pre-interview task which consisted of preparing for a pitch. A bit excessive for the job title and pay. Interview - included standard interview questions. For the work we have to put in before, you'd think more work should be put on the interviewers side. Next had to present the pitch. This was followed by a writing test on the interview day", "Interview Questions": "Why do you want to work at Cancer Research? Why this role? What can you bring to the role?"}, {"date": "24 Jan 2023", "title": "Research Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Cancer Research UK", "Interview Descriptions": "It was Straightforward and not too lengthy. Met with the hiring manager then peers and then 60 minute competency assessment with a presentation. Heard back on decision relatively quickly. Would recommend.", "Interview Questions": "How to handle difficult situations"}, {"date": "10 Jan 2023", "title": "Agile Transformation Coach Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Cancer Research UK (London, England) in Jan 2023", "Interview Descriptions": "A panel interview with 3 Agile Delivery Managers. The questions were poor and there was little overall understanding of Agile on display from them. The process is longwinded and there is a 2nd interview if successful with the first. They would then want you to 'present' something.", "Interview Questions": "How would you 'manage' conflict between 2 people if you weren't present during the inciting incident."}, {"date": "22 Dec 2022", "title": "Account Manager Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Cancer Research UK in Dec 2022", "Interview Descriptions": "Asked present 5 min presentation, then 5 mins of questions (although got none). Then serious of examples from your background and the challenges you faced along the way. But the HR recruitment team post the interview and offer were extremely rude and aggressive, really offputting with the threats if I didn't accept the role they'd pass it to someone else and being told - when asking questions - that they \"didn't have time for me\".", "Interview Questions": "How you influenced a bad situation into a good one"}, {"date": "26 Sept 2022", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Cancer Research UK (Motherwell, Scotland)", "Interview Descriptions": "You will get a phone call to come in and you get introduced to everyone that works there and shown around the shop, like the fire exits, office, toilets, kitchen etc", "Interview Questions": "What days can you work? "}, {"date": "9 Sept 2022", "title": "Research Intern Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Cancer Research UK", "Interview Descriptions": "Very long application process consisting of application questions, CV, situational judgment test, audio submission and lastly a 45 minute interview. The interviewers were quite unfriendly and intense from the get go. Lots of questions around interest in CRUK, research and my own experiences. When asked for clarification on a specific question about workload, I got a very vague response and was expected to answer without knowing the context.", "Interview Questions": "If a colleague from another team asked you to do a task when you currently have substantial workload, how would you respond?\r\nWhat keeps you motivated to do work?\r\n"}, {"date": "12 Jul 2022", "title": "Philanthropy Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Cancer Research UK", "Interview Descriptions": "Organised and considerate interviewers - no questions caught me off guard. The process had two stages and I felt able to prepare and at ease for both. I didn’t get the job but got very clear written feedback, which I appreciated", "Interview Questions": "I can’t remember - it was a while ago! "}, {"date": "18 Jun 2022", "title": "Assistant Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Cancer Research UK (East Grinstead, England) in Jun 2022", "Interview Descriptions": "I had an interview in person the manager of the store interviewed me, they have set questions to ask and she was absolutely lovely. A very nice interview process, I haven’t heard anything back yet but only interviewed earlier this week.", "Interview Questions": "What are the latest fashion trends? "}, {"date": "20 May 2022", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Cancer Research UK (Cambridge, England) in May 2022", "Interview Descriptions": "Interview with all group members 1v1 (more like a chat with all the lab members) + 15mins presentation of previous projects to the whole group and 15 mins for questions....", "Interview Questions": "why this position\r\nwhy this lab\r\nand questions specific to your project"}, {"date": "19 Apr 2022", "title": "Public Affairs Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Cancer Research UK in Apr 2022", "Interview Descriptions": "Fairly intense interview (which started a few minutes late, not my fault) with three on the panel. Each asked 3-4 competency based questions which were relevant to the job. However if they didn't like the answer they would push further. One interviewer was fairly unprofessional and began cutting her fingernails on camera during the interview. When it came to me asking questions at the end, much of the information was withheld and would be given if I was successful. Interview lasted 1 hour.", "Interview Questions": "Name a time when you didn't gain the outcome you wished for and had to show resilience. \r\n\r\nIs there a type of work you find tedious and how do you motivate yourself to do this work. "}], [{"date": "22 Apr 2022", "title": "Operations Support Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Cancer Research UK (London, England) in Apr 2022", "Interview Descriptions": "Online application via the company website detailing previous work experience and answering questions on experience for the position.\r\nThe job page also tracks the progress of your application.\r\nTeams Interview with hiring manager and employee who was leaving the position", "Interview Questions": "Was questioned on the key attributes of the position."}, {"date": "31 Jul 2022", "title": "Retail Store Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Cancer Research UK (Nottingham, England) in Apr 2022", "Interview Descriptions": "Very easy questions, first they ask you to talk about your previous experience. They also asked about an experience with a difficult customer and about your availability. They asked how much i would charge for different clothing items and what i would value different clothing brands.", "Interview Questions": "Describe an experience with a difficult customer"}, {"date": "11 Aug 2022", "title": "Business Development Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Cancer Research UK in Apr 2022", "Interview Descriptions": "2 interviews held on line , the first a screening interview with the hiring manager and the second with a panel consisting of 2 addition people. Plus a further interview with the human resources department", "Interview Questions": "- Present your background and achievements to date. \r\n- How are you going to leverage funding in the current environment where revenue through fund raising has been limited?"}, {"date": "14 Jan 2023", "title": "Science Writer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Cancer Research UK (London, England) in Feb 2022", "Interview Descriptions": "Interviewer ignored request for extra time on a timed test due to disability. Interview prep time was very time consuming on account of the test. The interview commenced immediately afterwards and required detailed knowledge of the content published on CRUK website. I heard nothing afterward. Considering the time invested to attend interview the least CRUK could do would be to respond and offer some feedback.", "Interview Questions": "How to start a news article"}, {"date": "23 Jan 2022", "title": "Product Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at Cancer Research UK", "Interview Descriptions": "Intense questions with two panellists, but in a pleasant and easy-going atmosphere. Despite not making it through, I really enjoyed my first round interview as the questions were intelligent and for someone equipped with plenty of examples, it would have been an easy ride. I also wanted to compliment the product team on their offer of a 15 mins feedback call. I thought it was incredibly generous.", "Interview Questions": "A standard set of questions - stakeholder management, product decisions. "}, {"date": "3 Jan 2022", "title": "SO2 Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Cancer Research UK", "Interview Descriptions": "This was quite relaxed, couple of questions surrounding the job spec and also included questions about the experimental technique and experience you would bring. to the role. The interviewers were quite welcome and nice", "Interview Questions": "1. What is your knowledge of GCP"}, {"date": "1 Jan 2022", "title": "Retail Sales Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Cancer Research UK", "Interview Descriptions": "Questions on current trends in fashion.\nWhat team work experience do you have \nWhat retail experience do you have?\nCan you give an example of when you provided good customer service.\nInterviewed by two people.\nBoth women.", "Interview Questions": "What customer service experience do you have?"}, {"date": "6 Dec 2021", "title": "Product Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Cancer Research UK", "Interview Descriptions": "It was am l\nit was an online interview that asking behavioural type interview questions. The interview was conducted by 2 senior members of the product management team and lasted just less than an hour.", "Interview Questions": "Describe a time you made a mistake and what you learnt from it."}, {"date": "7 Jan 2022", "title": "Strategy Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Cancer Research UK (London, England) in Nov 2021", "Interview Descriptions": "Multiple rounds of interviews virtually via MS Teams. Very friendly interviewers. Some normal interview style questions, others linked to a case study where information was shared in live time for you to respond to.", "Interview Questions": "What skills do you think are needed to succeed in the role?"}, {"date": "9 May 2023", "title": "Human Resources Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 3 weeks. I interviewed at Cancer Research UK (London, England) in Oct 2021", "Interview Descriptions": "Competency based questions drawn from role profile and key skills needed. Second round included presentation based on a key element of the role you would be responsible for - based on things you would have professional knowledge of", "Interview Questions": "Stakeholder management, people management, professional knowledge"}], [{"date": "2 Sept 2021", "title": "Finance Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Cancer Research UK", "Interview Descriptions": "This was a two stage interview process followed by a short case study assessment to reflect an everyday task.  Initial stage interview is with HR rep and hiring manager.  Second stage is with team leader and a manager from another area.  There is also a short case study to review which you are then question on afterwards by two managers.", "Interview Questions": "How would you respond to a director/head asking for an urgent update if you needed more time to find a solution? "}, {"date": "5 Mar 2022", "title": "Sales Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Cancer Research UK (Belfast, Northern Ireland) in Sept 2021", "Interview Descriptions": "Applied online and was offered an interview after about 2 weeks. This took place in person and lasted an hour or so. It was a solo interview with two interviewers, one asked questions while the other took notes.", "Interview Questions": "Give me an example of a time you gave good customer experience"}, {"date": "31 Dec 2021", "title": "Postdoctoral Fellow Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Cancer Research UK (Manchester, England) in Sept 2021", "Interview Descriptions": "Sent a paper to me to review it and prepare a 10 minutes presentation summarizing it and I did a scientific critical evaluation and presenented it but they did not like that I criticized the work", "Interview Questions": "My opinion in a specific research paper "}, {"date": "3 Jul 2021", "title": "Digital Producer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Cancer Research UK", "Interview Descriptions": "I applied online, however I did not hear anything for about 6 weeks. Then I was invited for the interview, which went well as I was interviewed by two members of the company. But I was told I'd hear for the next stage in a week's time, however I did not even get any feedback which did not help after sending them a follow-up email.", "Interview Questions": "Could you give an example when you had to overcome a challenge?"}, {"date": "29 Jul 2022", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Cancer Research UK (London, England) in Jul 2021", "Interview Descriptions": "Really friendly interview by two staff members, a mixture of technical and competency based questions - lasted around 30 minutes. Was required to carry out some calculations and more technical science based questions alongside more general ones", "Interview Questions": "A time you’ve faced an issue in a team\r\nWhy cancer research uk\r\nWhat skills would you like to gain\r\nCalculation of concentrations\r\n"}, {"date": "7 Jun 2021", "title": "Retail Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Cancer Research UK", "Interview Descriptions": "I was contacted for an interview a week or two after applying.\r\nThere were questions about what fashion companies of different price ranges, examples of previous management situations that you've been in because on Sundays this job would become a manager position, they stressed the importance of being able to manage the entire store and volunteers. It was quite long with some repeats of questions.", "Interview Questions": "5 cheap, 5 middle and 5 expensive fashion brands"}, {"date": "4 Jun 2021", "title": "Account Executive Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Cancer Research UK", "Interview Descriptions": "Applied via LinkedIn, invited for interview swiftly. Interview was conducted online with 2 interviewees, and lasted approximately 45 minutes. I was informed of the result a couple of weeks later. The CRUK team were friendly and professional.", "Interview Questions": "Why are you applying for this role?"}, {"date": "17 Jun 2021", "title": "Supporter Services Inbound Advisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Cancer Research UK in Jun 2021", "Interview Descriptions": "I applied through the company website, within a few days I had received an email asking me my availability for a video interview - which I confirmed.\r\n\r\nI was then sent an email confirmation for our interview which was through MS Teams. A task had also been attached to complete prior to the interview.\r\n\r\nThe date for the video interview came and I attended it. I was also asked to do a short roleplay within the interview of which they said I had done great at.\r\n\r\nAt the end of the interview they told me I'd hear back from them by the 9th of June.\r\n\r\nIt's now the 17th of June and I have heard absolutely nothing back.\r\n\r\nI was initially really excited to be part of working at Cancer Research UK - but after being ghosted by senior members the organisation despite spending hours of time I'll never get back completing tasks, doing roleplays and attending video interviews...I really would much prefer to stay far away.\r\n\r\nIf the hiring managers don't even have the human decency to get back to somebody, or honour their promises at the interview stage, I can only imagine how else I might have been disrespected if I had joined the role. Surely it isn't that difficult to send someone an email or give them a call with an update on the outcome of their interview?\r\n\r\nGoing forward I will not ever be applying to any roles Cancer Research UK advertise as I will not be giving them a second chance to disrespect me, my experience or my time again.", "Interview Questions": "What's one thing we wouldn't know about you from your CV/Application? + competency based questions."}, {"date": "23 Jul 2021", "title": "volunteer cashier Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Cancer Research UK (London, England) in Jun 2021", "Interview Descriptions": "Very friendly and provided lots of information about the company and the type of work that I would be doing. The lady who spoke with me was very positive and helpful.", "Interview Questions": "My availability and people skills"}, {"date": "6 May 2021", "title": "Scientist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Cancer Research UK", "Interview Descriptions": "Very friendly and smooth. Goes in 2 stages first with a phone interview and then with a longer one with a panel where you are asked more details about your skills and how would you fit to the role", "Interview Questions": "What is something you feel really proud about_"}], [{"date": "18 May 2022", "title": "Programme Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Cancer Research UK (London, England) in May 2021", "Interview Descriptions": "two-stage. quick telephone interview, and then if shortlisted - longer (virtual) interview.\r\n\r\nFeedback given was fairly generic and unhelpful. Felt like they were looking for a very specific person with a certain background and weren't open to other experiences and backgrounds.", "Interview Questions": "About CRUK and their strategy.\r\nWhat would you do ... example.\r\nInternational landscape?"}, {"date": "26 Apr 2021", "title": "Health Community Engagement Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Cancer Research UK", "Interview Descriptions": "The interview process was straightforward with clear communication from the organisation. I was interviewed by two members of the team via zoom for roughly one hour. Questions mainly consisted of competency with some strength-based questions also asked.", "Interview Questions": "What would you say is your biggest weakness?"}, {"date": "27 Apr 2021", "title": "Shop Assistant Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Cancer Research UK (London, England) in Apr 2021", "Interview Descriptions": "The job role was a shop assistant role for just once a week, yet they asked so many questions. I've never had an interview where they asked this many questions before, it was quite ridiculous for a once-a-week job role that anyone could do. I worked in a charity shop before doing the exact same job and was not asked even half the questions asked. By the end of the interview, I was so done with organisation I no longer want anything to do with them. The interviewer said 'lastly' so many times I lost count, they asked over 30 questions which I did not think was possible. The interview was supposed to be 20mins but lasted over 40mins.", "Interview Questions": "How would you deal with an emotional/sensitive customer who has come to the store to donate money? (The customer has lost a loved one but does not want to speak about and is crying)"}, {"date": "6 Apr 2021", "title": "Office Administrator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Cancer Research UK", "Interview Descriptions": "two people interviewing for the position, conversational and friendly style. the interview was between 45 minutes to an hour and they asked for examples of working in similar office environments", "Interview Questions": "we had a task to pretend to do a phone call with a customer"}, {"date": "5 May 2021", "title": "Marketing Executive Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Cancer Research UK (London, England) in Apr 2021", "Interview Descriptions": "Professional hiring managers who put you at ease and ask a series of competency based questions. They were friendly and gave information about the role and where it would sit. Gave the opportunity to ask questions at the end of the interview.", "Interview Questions": "Why did you apply for a role at Cancer Research UK?"}, {"date": "17 Mar 2021", "title": "Data and Research Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Cancer Research UK (London, England)", "Interview Descriptions": "I was invited for a short test (about 45 minutes) and an interview. The interviewers were very friendly, and made me feel at ease. I was interviewed by a panel of 2, and the interview felt very relevant to the role. Overall a positive experience.", "Interview Questions": "How would you react if a colleague made a mistake?"}, {"date": "11 Feb 2021", "title": "Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Cancer Research UK", "Interview Descriptions": "It was a straightforward process. My application was followed by an initial informal phone interview  a week later. After a successful phone interview, I then had a thorough panel interview with structured interview sections containing questions and scenarios the following week.", "Interview Questions": "Why do you want to work at CRUK?"}, {"date": "23 Feb 2021", "title": "Creative Operations Executive Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Cancer Research UK (London, England) in Feb 2021", "Interview Descriptions": "The interview process was relatively quick. It was one interview with sheduled with a panel of two, one of whom was the hiring manager. Each took turns to ask the questions. The questions were mostly behavioural questions. The overall experience was very professional and gave valuable feedback after the interview.", "Interview Questions": "Can you tell us about an experience working in a complex environment?"}, {"date": "11 Feb 2021", "title": "Public Affairs Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Cancer Research UK (London, England) in Jan 2021", "Interview Descriptions": "I applied in January 2021 and received an offer to interview a week later. I was interviewed by two panellists from the team, who were very friendly. The interview lasted just over an hour and comprised of a 30-minute task and interview.  The 30-minute task was a presentation of a campaign plan based on a brief provided in advance. I had 30 minutes to study the brief and was questioned on my presentation. The remainder of the interview was mostly competency-based questions. I received an offer within a week.", "Interview Questions": "Questions relating to the presentation."}, {"date": "22 Dec 2020", "title": "Communications Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Cancer Research UK", "Interview Descriptions": "Two rounds of interview. First was pretty informal, whereas the second required a presentation. The interview panel were friendly and professional throughout. The interview appeared to go well and I was informed that I would hear back within a week.\r\n A month later I had heard nothing back, despite sending an email requesting whether a decision had been made. It was very disappointing and surprising that the organisation did not have the courtesy to let me know that I had not got the position.", "Interview Questions": "Why do you want to work for CRUK?"}], [{"date": "19 Dec 2020", "title": "Head of Creative Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Cancer Research UK", "Interview Descriptions": "First a 15 minute screening telephone interview with an HR partner. Then three weeks later a one hour competency-based interview with a panel of two directors and presentation of a 10 minute deck on the question “How to build a creative culture and how to raise creative standards”. Overall very experienced interviewers who put me at ease (despite it being over video) and gave immediate feedback after each question. A very positive experience and reflects very well on the organisation.", "Interview Questions": "Tell us how you ensured brand consistency; (part two;) what would you have done differently?"}, {"date": "4 Apr 2021", "title": "Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Cancer Research UK (London, England) in Dec 2020", "Interview Descriptions": "It was a video call with 2 people interviewing. It was a competency based assessment asking questions relating to knowledge and experience based around the job description. Was offered the role within that week and accepted.", "Interview Questions": "Can we give us an example of your project management skills?"}, {"date": "27 Jan 2022", "title": "Evidence Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Cancer Research UK (London, England) in Dec 2020", "Interview Descriptions": "1 hour written test (briefing to policymakers and stakeholders and a written blog post for a general non-expert audience - both on the same scientific paper) followed by competency based interview questions", "Interview Questions": "Tell me about a time you had to explain a complex subject to a new audience"}, {"date": "10 Nov 2021", "title": "Evidence Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Cancer Research UK (London, England) in Dec 2020", "Interview Descriptions": "2 stage with a hour long written test immediately prior to the interview. This consisted of competency based questions and reflections on the written test. The whole interview took about 2 hours, but I received prompt and specific feedback afterwards which was good to see.", "Interview Questions": "Give an example of a time where you managed a project. "}, {"date": "11 Nov 2020", "title": "Relationship Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Cancer Research UK", "Interview Descriptions": "Straight forward and friendly interviewers.  Did ask any questions to catch applicants out. The interviews made an effort to try make applicants feel comfortable. There was a delay in hearing back due to other interviews which slowed the process down. Overall my experience was positive.", "Interview Questions": "Competency based questions - specific to competencies of the role applying for."}, {"date": "26 Jan 2021", "title": "Project Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Cancer Research UK (London, England) in Nov 2020", "Interview Descriptions": "Application: including CV and Cover letter\r\nPhone call from the future manager (informal)\r\nInterview with a panel of 5 senior managers (via Teams) including a short talk followed by questions from the panel and a writing task after the interview.", "Interview Questions": "Why you? Why applying to this position?, Why CRUK?"}, {"date": "20 Sept 2020", "title": "Digital Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Cancer Research UK", "Interview Descriptions": "Pretty straight forward - face to face followed by two assessments.\r\n\r\nBasic mathematical and platform tools. Very friendly people. \r\n\r\nI think personality is important too as they want to work with someone they get along with.", "Interview Questions": "Why do you want to work for CRUK?"}, {"date": "15 Sept 2020", "title": "Pharmacovigilance Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Cancer Research UK", "Interview Descriptions": "The interview was Quick and simple. First there was a phone screen which lasted around half an hour then the next stage was a panel interview of three. Overall it was a pleasant experience.", "Interview Questions": "Why I wanted to join."}, {"date": "2 Sept 2020", "title": "Assistant Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Cancer Research UK in Sept 2020", "Interview Descriptions": "Applied online then was given a date for an interview 2 to 1 interview with the manager and area manager.. Given a task of changing the window display within a time limit. Have your interview with them standard questions plus will ask you questions on what you would do in a event of no volunteer, stock issues..\r\n\r\nIf you pass that you go in for a trail day in your shop to see how you are around not only the manager but the volunteers \r\n\r\nThen you will find out a day or so later if you got the job. \r\n\r\nThe first time I didn't get it but the area manager kept my records and number and advise when another job came up 6 months later and got it the second time round", "Interview Questions": "Why cancer research? \r\nWhat do you know about the company? \r\nWhat would you do to create more revenue into your shop? \r\nWhat would you do if you was working on your own and it was a busy day in the shop? \r\nHave you worked in a target based environment? \r\nWhat issues could you see arising in the shop? \r\n"}, {"date": "5 Aug 2020", "title": "Store Manager Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Cancer Research UK (London, England) in Jul 2020", "Interview Descriptions": "Informal but intimidating. Left feeling like applicants are ten a penny and it wouldn’t matter if you had issues as there’s always someone else.\r\nEnded up declined the job offer. A very confusing and unsettling experience", "Interview Questions": "What is your family situation, are there young children?"}], [{"date": "2 Jun 2020", "title": "Cancer Information Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Cancer Research UK", "Interview Descriptions": "Friendly interview -  it required a short presentation on a topic of my choice followed by 5 or 6 questions covering key competencies relating to the role to assess my suitability.", "Interview Questions": "How would you describe a statistical concept clearly to someone without a statistical background?"}, {"date": "27 Feb 2020", "title": "Events Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Cancer Research UK in Feb 2020", "Interview Descriptions": "Really nice team. The process involved an online application. The actual interview day involved a practical task and communication task, then an interview with a panel of two.", "Interview Questions": "What motivated you to apply for this role?"}, {"date": "12 Dec 2019", "title": "SCIENTIFIC OFFICER Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Cancer Research UK (London, England) in Nov 2019", "Interview Descriptions": "They invited me for face to face interview with a panel of 3 experts. \r\nThe interview went very well\r\n You need to read about different research groups who work in that institute regardless of the position you are applying for.", "Interview Questions": "Mostly based on my presentation and some personality questions"}, {"date": "26 Sept 2019", "title": "Research Executive Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Cancer Research UK (London, England)", "Interview Descriptions": "The interviewers were really friendly, I thought I got on with them quite well. They made me really comfortable and relaxed. In terms of questions, there were no trick questions. I felt they asked really good questions that I was able to answer even if I did not prepare for it.", "Interview Questions": "Why do you want to work for Cancer Research UK?"}, {"date": "2 Sept 2019", "title": "Communications Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Cancer Research UK", "Interview Descriptions": "The interview process was really relaxed. They allowed me time to collect my thoughts and were really focused on making me feel comfortable, unlike some places where they try to trip you up with the questions.", "Interview Questions": "A scenario based question in which I had to arrange tasks based on importance."}, {"date": "10 Aug 2020", "title": "Events Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 7 weeks. I interviewed at Cancer Research UK (London, England) in Sept 2019", "Interview Descriptions": "Online application with CV and separate questions and experience and skillset.  Followed by telephone interview.   It took a little while before I heard anything about the second stage, so I called to follow up.", "Interview Questions": "Negotiation skills and experience of price negotiation specifically."}, {"date": "3 Oct 2019", "title": "Lead Software Developer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 4 weeks. I interviewed at Cancer Research UK (London, England) in Sept 2019", "Interview Descriptions": "Was introduced via a recruitment firm, after a few emails back and forth, I had a call with another Lead Developer, followed by a video call with another Lead Developer and the Director of Engineering, followed by an onside meeting with a number of team members.\r\n\r\nIt was a great amount of fun.", "Interview Questions": "Questions about experiences, from my profile/CV."}, {"date": "26 Jul 2019", "title": "Retail Store Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Cancer Research UK", "Interview Descriptions": "1 area manager and 1 senior manager and you have a private interview, before placement you'll be given a tester day to see the reality of charity retail.  Sorting stock, meeting volunteers and serving customers at the checkout.", "Interview Questions": "Speak to your experience, understand the vision of CRUK and a knowledge of fashion trends."}, {"date": "28 Jan 2023", "title": "Postdoctoral Research Associate Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 1 day. I interviewed at Cancer Research UK (Manchester, England) in Jul 2019", "Interview Descriptions": "It was okay . Kind of difficult to comprehend the language of the boss. Colleagues were also introduced during the interview. Multicultural environment so should be able to handle inter cultural groups", "Interview Questions": "Future prospects . Expectations, more so about my contribution their support"}], [{"date": "20 Jun 2019", "title": "Major Giving Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Cancer Research UK", "Interview Descriptions": "Really productive, enjoyable experience with engaged and knowlegdeable leadership carrying out the interviews. It was a two stage process with communication throughout and the role was offered and gratefully accepted.", "Interview Questions": "Strengths and weaknesses"}, {"date": "18 Jul 2019", "title": "Project Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Cancer Research UK (Islington, England) in Jun 2019", "Interview Descriptions": "The interviewer was very nice and re-scheduled the interview upon request. The interview itself lasted an hour and involved answering competency based questions. Overall I felt the interview was more a conversation and I felt confident and comfortable answering all their questions. \r\nWhen the interview finished, the interviewer said I will hear back from them the following week on Monday (the interview took place on Friday). I heard nothing from them despite requesting feedback. I was frustrated to see that a week later, I received a rejection and no feedback even after I requested it. Extremely unprofessional.", "Interview Questions": "If I were to give you a project, describe how you would manage it? "}, {"date": "12 Nov 2019", "title": "Strategy Summer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Cancer Research UK (London, England) in May 2019", "Interview Descriptions": "Sent off CV and answered 3 questions (not timed); the two I remember were tell us something your proud of and why are you suited to the role. Then invited to interview in the London office.  They sent you a prioritisation task (a list of jobs in your day, what would you do first?) to do prior to the interview. They said you’d discuss it as part of the interview but this didn’t happen which was a bit annoying seeing as I had spent time preparing.", "Interview Questions": "Tell us about a time where you had to overcome a problem/failure."}, {"date": "28 Aug 2019", "title": "PhD Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Cancer Research UK (Cambridge, England) in May 2019", "Interview Descriptions": "Long day filled with meetings with group members and PI's. Includes short talk about previous research, journal club discussing previous publications, and designing a thesis topic. Candidates should have been narrowed down on first day to allow more time to interact with group members.", "Interview Questions": "Name a challenge you've overcome"}, {"date": "13 Apr 2019", "title": "Intellectual Property Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Cancer Research UK", "Interview Descriptions": "Submitted an online application, heard back around 2 weeks later that I was invited to interview in their London offices. Was sent an intellectual property prioritisation task, to be completed at home and discussed at interview.Interview was with someone from HR and member of HR team. Talked through my rationale for prioritisation task. Then moved onto a series of competency questions, followed by questions about IP", "Interview Questions": "What is your understanding of Intellectual Property law?"}, {"date": "4 Feb 2023", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Cancer Research UK in Apr 2019", "Interview Descriptions": "An informal chat about your skills, and what can you bring to the role. Have you ever worked on a till before? They will ask you if you would like to work in the stock room or if would you like to do a bit of shop floor work", "Interview Questions": "Have you volunteered in a charity shop before"}, {"date": "24 Jan 2023", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Cancer Research UK (Basildon, South East England, England) in Mar 2019", "Interview Descriptions": "Application Form handed in, then a general basic interview arranged over the phone. Interviewed in store, Manager explained the role. Shown around the shop and out the back of the shop.", "Interview Questions": "N/A"}, {"date": "1 Apr 2019", "title": "Executive Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Cancer Research UK (London, England) in Mar 2019", "Interview Descriptions": "Interview process started with a prioritising diary exercise that you had to talk through at the start of the interview  and your rationale behind the choices.  So far so good - or so I thought - as they seemed like my answers.  They were really friendly and made you feel at ease.\r\n\r\nCompetence based interview questions, which was fine and got to end of interview which seemed to go really quickly.  \r\n\r\nWas told that I was the last interviewee and that they'd make a decision by the end of the week and let me know.  That was over 2 weeks ago (on the 13th March) and I've heard nothing; therefore assuming I haven't got the job.\r\n\r\nHowever, I even emailed the HR department to follow up and so far they haven't bothered to reply which is incredibly bad recruitment practice - if you invite someone to interview take the time to let them know they've been unsuccessful!!", "Interview Questions": "Tell us something about yourself that we can't tell from your application/CV?"}, {"date": "6 Jul 2019", "title": "Senior Research Support Advisor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Cancer Research UK (Cambridge, England) in Mar 2019", "Interview Descriptions": "45 min test and 45min interview.  There were 3 people in the panel. They were all very nice and make you feel comfortable. I have enjoyed my interview. I was nervous in the exam part.", "Interview Questions": "How can I measure your performance in the first 3 months to see that you are the right person for this job. "}, {"date": "2 Jan 2019", "title": "Intern Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Cancer Research UK (London, England)", "Interview Descriptions": "I applied online. Filled up answers to some questions. They held a webinar where there shared about what they were looking for and explained the interview format. Was given a prioritisation task to complete before the interview. I interviewed at Cancer Research UK (London) in February 2018.", "Interview Questions": "Why are you excited to work for CRUK?"}], [{"date": "18 May 2022", "title": "Ops Manager Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Cancer Research UK (London, England) in Jan 2019", "Interview Descriptions": "Invitation to interview via email, telephone interview (pre-screening), followed by two rounds of interviews on teams. Each had different panel members.  The process lasted 3 weeks from their initial contact with me to the end of the process", "Interview Questions": "What would I do in the first 3 months of the role?"}, {"date": "13 Jan 2019", "title": "Marketing Graduate Scheme Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Cancer Research UK in Jan 2019", "Interview Descriptions": "Short 10-minute phone interview with a friendly employee. Applied online and received an invitation for phone interview shortly. This process was smooth and easy. I believe preparation is key in succeeding in the application process. It is also highly competitive.", "Interview Questions": "Why are you applying?"}, {"date": "23 Dec 2018", "title": "Insight & Analysis Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Cancer Research UK", "Interview Descriptions": "I applied online for the Insight and Analysis internship stream and gave a secondary stream preference. I was later invited to interview for two different insight and analysis positions, so was interviewed by the team leader for each position (they alternated questions in the interview).", "Interview Questions": "Tell us about how you have approached a previous research task "}, {"date": "20 Dec 2018", "title": "Regulatory Affairs Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Cancer Research UK", "Interview Descriptions": "online job application, followed by a face to face interview and a specific skills test related to the job role. The face to face interview was quite technical but also included competency based questions.", "Interview Questions": "Technical role based questions and basic competency based questions. \r\n\r\n"}, {"date": "17 Apr 2019", "title": "Industrial Placement Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Cancer Research UK (London, England) in Dec 2018", "Interview Descriptions": "An assessment centre lasting a few hours consisting of an introduction to the company, a tour of the building, a small assessment and an interview. There were 2 interviewers during the interview and this lasted for around 30 mins.", "Interview Questions": "Tell me about yourself "}, {"date": "6 May 2019", "title": "Policy Development Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. I interviewed at Cancer Research UK (Islington, England) in Nov 2018", "Interview Descriptions": "Online application and interview\r\n\r\nPros :\r\n Friendly atmosphere. \r\nThey make you feel comfortable\r\nwell structured \r\n\r\nCons: \r\ncombination of strength and competency based question\r\nGave extremely vague interview feedback even when requested for detail", "Interview Questions": "Tell us a time you had to do something you have not done before"}, {"date": "30 Oct 2018", "title": "Data Compliance Executive Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at Cancer Research UK", "Interview Descriptions": "Online application, followed by an on-site interview in the office in Angel, London, with two members of staff. The interview was fine, mainly competency based questions and about my knowledge of the role. Altogether a pleasant interview, both staff members were very nice and the interview had a fairly informal feel.\r\n\r\nWhat is extremely disappointing, however, is that after a final stage interview I was told I was unsuccessful with an automated email, and my requests for feedback have been ignored. Considering they were only interviewing 7 or so people for the role, it cannot be that hard to give some feedback, and requires considerably less effort than the candidate has put in to research the company and the role and then travel in for the interview.", "Interview Questions": "Name an occasion where you have implemented change in the workplace."}, {"date": "18 Aug 2019", "title": "User Experience Designer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Cancer Research UK (London, England) in Oct 2018", "Interview Descriptions": "Apply online with a portfolio and cv and cover letter. Asked for an interview with two panel members which lasted one hour. Asked some competency questions and asked to do a short task at the end.", "Interview Questions": "Why UX at CRUK"}, {"date": "28 Nov 2018", "title": "Research Executive Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Cancer Research UK (London, England) in Oct 2018", "Interview Descriptions": "Interviewed with 2 members of the team who were both very friendly. Started with discussing the role and the company, followed by a short 10 minute research task which I had to present/discuss afterwards.   After the test there were a series of competency based questions relating to the role. The whole interview last about an hour.", "Interview Questions": "Why CRUK?"}, {"date": "21 Sept 2018", "title": "Insight and Reporting Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Cancer Research UK (Islington, England) in Sept 2018", "Interview Descriptions": "Prior to the interview I was emailed to tell me that the interview would comprise of competency based questions and a short excel task. The short excel task at the end was fine, basic pivot tables, vlookup, sumifs etc. The questions were not competency based questions. There were A LOT of questions asking specific things about the job itself e.g. what will your day look like. Not a question you'd expect, considering you have not done the job before. There were also questions like what's your favourite film - I think they really wanted to find someone that fit in well with the team.  However, I was so flustered from the difficult previous questions that I did not react well to these. \r\nI was unsuccessful with getting the job, however what I think is totally disrespectful and arrogant is that I wasn't phoned to find this out, I wasn't even emailed by the interviewees. I was sent a generic automated email rejection. Something that I don't think is deserved of a person who prepped every day for a week for the interview, took a day out for the interview, and paid for the train fare. \r\nCRUK is such a big organisation, I think it may have forgotten that the people coming for interview ARE people, and deserve respect.", "Interview Questions": "How would your friends describe you"}], [{"date": "20 Aug 2018", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Cancer Research UK", "Interview Descriptions": "After one-month, I received the interview invitation. It consists of a group task and individual interviews afterwards. The group task was to plan an event as a group and the individual interview was centred with your past experience.", "Interview Questions": "What kind of skill can you bring to the role?"}, {"date": "3 Aug 2018", "title": "Volunteer Customer Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Cancer Research UK (London, England)", "Interview Descriptions": "Applied online at vinspired and got an email from the manager few days later telling me I can choose from the two days given. Went in, got shown around shop, taught how to do things such as tagging, steaming etc and started volunteering that day.", "Interview Questions": "Why did you choose Cancer Research? "}, {"date": "30 Jul 2018", "title": "Senior Clinical Informatician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Cancer Research UK (Manchester, England)", "Interview Descriptions": "The time taken between applying and getting notification about an interview was quite long (about 6 weeks).  It then involved a short 1-2 hour interview with 3 members of CRUK on the panel.  I did a short presentation with a title they provided prior to the interview.", "Interview Questions": "Some of the more challenging questions were around a different area of bioinformatics that I am less familiar with."}, {"date": "22 Jul 2018", "title": "HR Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Cancer Research UK", "Interview Descriptions": "CRUK for me has been the epitome of rubbish candidate experience. I applied for a role and then didn’t hear anything for a month and a half. Then, all of a sudden, out of the blue I get a message from  their internal recruiter very late at night asking to have a phone interview “initial chat” tomorrow (the day after). Obviously this left me no time to prepare for this, or take time off work, but I managed to get some time off to make this happen. \r\n\r\nThe recruiter then called me (late) and kicked off the interview. Turns out this is not an “initial chat” but an actual full phone interview with no time to prepare. The recruiter was asking me very intrusive questions such as my exact current salary, but when asked didn’t give me any indication of what pay was on offer. She then made a \"hmmmm\" noise and said well to be honest this is not within our range” which made it sound like I earn too little/much for this job (again, no idea how much that was meant to be - it was the same job title as I have now). \r\n\r\nFor the rest of the interview the recruiter was very snobbish and condescending, saying how “we get a lot of people applying from smaller organisations like you, but because we are the largest org in UK they just don’t cut it for us”. A bit of a pointless comment then, since you are the largest, obviously everyone else is smaller? Why invite me for an interview? Then she tried to bring me down every way possible saying “all OUR HR staff are very STRATEGIC, they do a lot of STRATEGY”. She didn’t seem to be able to explain what that meant, so my guess is that she had no understanding of the role whatsoever and was just hung up on repeating the word “strategy”. I told her of my experience doing strategic projects and managing teams but it didn’t seem to matter too much. \r\n\r\nShe then said “well I will be having words with hiring manager but either way we will get in touch with the outcome in a few weeks”. Needless to say this was months ago and I never heard back! Giving feedback and letting people know is essentially this woman’s job - the ONE job she is specifically hired to do. But no.\r\n\r\nThen, funnily enough, I got approached with this same role but not directly - by an agency, who marketed it as “junior” role and mentioned the salary - and there was nothing overly “strategic” about it, although in the interview this was sold to me as a “senior strategic role” basically out of my reach because I am doing the same job but at a smaller place. Genius. \r\n\r\nI believe this organisation thinks it can afford to have rubbish candidate experiences, take months to make decisions, not keep candidates updated, talk down to them etc and still get the best talent - I don’t think so. And please cut down on the snobbism - largest does not necessarily mean the best.", "Interview Questions": "What is your current salary?"}, {"date": "8 Aug 2018", "title": "Assistant Financial Accountant Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Cancer Research UK (London, England) in Jul 2018", "Interview Descriptions": "Had to fill out an online application with CV. I then received an email from the finance manager to arrange for a 10-15 minute telephone interview. After which you get invited for a face to face interview. I personally didn't go further despite being invited for a F2F interview. Manager sounded disinterested and hesitated to answer basic questions like \"What is the culture like at Cancer Research?\" or \"What made this position available?\" Didn't get good vibes so withdrew from the process (plus I received an offer from another company).", "Interview Questions": "Why Cancer Research? Why you? What you're looking to achieve? What's an accrual? "}, {"date": "8 Sept 2019", "title": "Assistant Financial Accountant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Cancer Research UK (London, England) in Jul 2018", "Interview Descriptions": "I had three interviews in stages over three weeks in total. The process is fairly straight forward. I was asked a lot about my qualifications and IT skills relevant to the job. I have been given a professional level job where experience was highly desirable. Although I did not have that much commercial experience but my academic commitment and results were taken into consideration. I was asked a lot of question about my excel skills. This is a skill to have for an accountancy role and must be developed if interested to have a career into Accountancy and Finanace.", "Interview Questions": "About my qualifications "}, {"date": "7 Jun 2018", "title": "Business Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 4 weeks. I interviewed at Cancer Research UK", "Interview Descriptions": "Applied online and had to answer a number of questions. Had a couple of telephone interviews before being invited to a face to face interview where I had to answer competency questions and present back a scenario I had to prepare for ahead of the interview.", "Interview Questions": "Tell me about a time you had to deal with a difficult person / team member."}, {"date": "25 Apr 2020", "title": "Community Engagement Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Cancer Research UK (London, England) in Jun 2018", "Interview Descriptions": "I submitted an application online after finding out about the internship through the Cancer Research UK website. A couple of weeks later I was emailed to be notified that I had been shortlisted for an interview at the Angel office. It was a standard interview, lasting for approximately 20-30 minutes and was with 2 staff members from the team that I had applied to.", "Interview Questions": "Tell us about a difficult situation that you found yourself in when working in a team, and what did you do to overcome this?"}, {"date": "12 Jul 2018", "title": "Social Media Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Cancer Research UK (Islington, England) in Jun 2018", "Interview Descriptions": "An email was sent a week before the interview date.  Overall good process, most of the time the interview was geared towards competency based questions. The only downside was that I had to wait over a fortnight to hear the outcome.", "Interview Questions": "Tell me about a time where you have dealt with a social media strategy"}, {"date": "10 Sept 2019", "title": "Area S Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Cancer Research UK (London, England) in Jun 2018", "Interview Descriptions": "Interviewed by two people.   \r\nCompetency based questions. It usually takes an hour. They are looking for someone who is very hands on and passionate about the company.", "Interview Questions": "How can you increase the sales ? "}], [{"date": "4 Nov 2018", "title": "Project Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Cancer Research UK (London, England) in May 2018", "Interview Descriptions": "A presentation to panel of 6 - asked to analyse project report provided in advance and to recommend what would do and why.  Followed by questions. then more in depth personal interview with 2 of panel", "Interview Questions": "what do you bring to CRUK"}, {"date": "1 Mar 2022", "title": "Support Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Cancer Research UK (London, England) in May 2018", "Interview Descriptions": "- Very professional and friendly\r\n- Made me feel relaxed\r\n- Mix of competency and technical questions\r\n- Nice open discussions \r\n- Great appreciation of my previous experience \r\n- Provided in depth explanation of the role\r\n- Described their own experience of working there", "Interview Questions": "Reason for wanting to join"}, {"date": "16 Mar 2018", "title": "Marketing and Fundraising Graduate Scheme Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Cancer Research UK", "Interview Descriptions": "Applied in November\r\nInterviewed end of January \r\nOnline competency questions and application form \r\nTelephone Interview with two employees \r\nNext stage would have been face to face interviews in their offices", "Interview Questions": "Tell us why you want to work for CRUK "}, {"date": "8 Mar 2018", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Cancer Research UK (Islington, England) in Feb 2018", "Interview Descriptions": "Online application,  I received an email with the interview offer a week after the closing date, the interview was one week late.   The interview was mainly based around competencies & experience.  Very pleasant for an interview.  I heard back about the interview just under two weeks later.", "Interview Questions": "Asked about workload management."}, {"date": "13 Mar 2018", "title": "Policy, Information and Communications Grad Scheme Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Cancer Research UK (London, England) in Feb 2018", "Interview Descriptions": "Rounds of online tests, followed by telephone interview. Then assessment day. Had the candidate been successful at the assessment  day, there would have been a final interview stage also.", "Interview Questions": "The interview was a small part of the assessment day. It was competency focussed. E.g. Can you describe a time when you demonstrated out of the box thinking and innovativeness?"}, {"date": "27 Jul 2022", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 days. I interviewed at Cancer Research UK (London, England) in Feb 2018", "Interview Descriptions": "Very easy to interview. They want people to volunteer, so I went into the store and asked them about it, and they accepted me as a volunteer. I would not worry about getting the position.", "Interview Questions": "Why do you want to volunteer here?"}, {"date": "21 Mar 2019", "title": "Clinical Study Coordinator Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Cancer Research UK (London, England) in Feb 2018", "Interview Descriptions": "Friendly and welcoming, relatively easy interview. Was welcomed by Manager, gave 2 interview assessments and then a face to face interview. The Manager then briefly showed the department.", "Interview Questions": "TMF experience"}, {"date": "5 May 2018", "title": "QA Automation Engineer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Cancer Research UK (London, England) in Feb 2018", "Interview Descriptions": "I applied via LinkedIn and their HR department contacted me and arranged a Face to Face interview. The interview was with an engineering manager and a Senior Automation Engineer.", "Interview Questions": "How would you go about testing an eCommerce website?"}, {"date": "10 Jan 2018", "title": "Graduate Research Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Cancer Research UK", "Interview Descriptions": "Online application, aptitude test, numerical test, assessment day. Consisted of group exercises, reading tasks and then one on one meetings. Also a panel presentation and questions. Concluded with a tour of the building.", "Interview Questions": "What are you bad at?"}, {"date": "2 Mar 2018", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Cancer Research UK (Chelsea, England) in Jan 2018", "Interview Descriptions": "Very welcoming and short, just asking how many hours I can work and showing me around the store. Going through Health and Safety procedures and how the store is run. Quite easy as it's for a volunteering job so don't expect anything hard.", "Interview Questions": "Why do you want to volunteer for Cancer Research UK?"}], [{"date": "5 Apr 2018", "title": "Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Cancer Research UK (London, England) in Jan 2018", "Interview Descriptions": "Applied online, received an invitation for an online test a couple of days later, the topics given were much more difficult than the job requirements, but I still made it passed and received an on-site interview invitation. The on-site experience was not so good. I just found the people I met were not passionate about their work at all. I could felt the interviewers were quite fake when giving their answers. I didn't think they were willing to work at cancer research.", "Interview Questions": "Competitive Questions."}, {"date": "30 Nov 2017", "title": "Internship Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Cancer Research UK", "Interview Descriptions": "The interviewers  first described the internship a bit to me and then asked questions. At the end I was able to ask a few questions. They were very nice and made sure to make me feel as comfortable as possible.", "Interview Questions": "Why Cancer Research?"}, {"date": "25 Feb 2018", "title": "Portfolio Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Cancer Research UK (London, England) in Dec 2017", "Interview Descriptions": "An assessment day, from 9-4 with a tour, time to meet current placement students, an individual competency based interview around questions on application form, individual exercise specific to your role and group work while having lunch followed by a presentation.", "Interview Questions": "Name an approved drug developed by CRUK?"}, {"date": "20 Dec 2017", "title": "Events and Ops Team Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Cancer Research UK (London, England) in Dec 2017", "Interview Descriptions": "Applied with cv and cover letter\nVery accomodating when arranging interview\nInterviewers were two members of the team\nAsked basic interview questions and two scenario questions at the end. Overall took around 30 minutes. Found out result the next day and they offered feedback", "Interview Questions": "tell us about your recent experience"}, {"date": "27 Oct 2017", "title": "Shop Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Cancer Research UK in Oct 2017", "Interview Descriptions": "Application process was simple and easy. Took around 1 month which was standard but kept up to date through emails and through the site which was good. The interview which was a competency based was very intense meaning experience was key in answering the questions. Even though it was intense both interviewers were fantastic and I was made to feel completely at ease, prompted as to when I should elaborate further on the questions I was answering. As I have had many interviews before I can easily say that this is one of the best interviews I have had.", "Interview Questions": "How would you maximise sales and profits when working at Cancer Research? "}, {"date": "2 Oct 2020", "title": "Policy Intern Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Cancer Research UK (London, England) in Oct 2017", "Interview Descriptions": "One interviewer was friendly, other quite intimidating. Overall experience was neutral. Quite a long interview for an hour. Took 3 weeks to reply after first application, and then offered an online or in person interview. Did not progress further.", "Interview Questions": "Q: Describe yourself in three words "}, {"date": "13 Nov 2017", "title": "Data Strategy Consultant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Cancer Research UK (London, England) in Oct 2017", "Interview Descriptions": "I applied directly through the CRUK website. I received very helpful, friendly automated email response.  I was subsequently contacted by the hiring manager by email to arrange an interview date and time.", "Interview Questions": "I was asked about my experience developing and implementing Data Strategies in other organisations"}, {"date": "27 Dec 2017", "title": "Innovation Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Cancer Research UK (London, England) in Oct 2017", "Interview Descriptions": "Well prepared interviewers in both interviews I had. Very relaxed, friendly and conversational. Mix of pre-prepared 10min answer to an industry relevant topic and competence/behavioural questions. Questions were closely aligned with the needs of the role so think about and research the organisation and the role.", "Interview Questions": "Several questions about your management philosophy/style. Examples of management challenges, what do you expect your biggest challenges to be in this role  etc."}, {"date": "6 Dec 2017", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Cancer Research UK (Islington, England) in Aug 2017", "Interview Descriptions": "Online application followed by an email invitation to an interview at Angel Building in Islington. I was interviewed by three people and it lasted approximately 40 minutes. They asked me competency based questions and I was informed 2 weeks afterwards.", "Interview Questions": "Why have you applied for an internship at CRUK and what skills and experience do you hope to gain during the placement"}, {"date": "4 Dec 2017", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Cancer Research UK (London, England) in Aug 2017", "Interview Descriptions": "I completed an online application form, that mainly asked about my work experience and the skills necessary for the role. About a month later, I was called in for an interview, which mainly comprised of competency based questions.", "Interview Questions": "Why did you apply for this internship? "}], [{"date": "25 Mar 2018", "title": "Fundraising Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Cancer Research UK (London, England) in Aug 2017", "Interview Descriptions": "I applied for the fundraising stream of internships and invited for an interview. Before the interview I was sent an overview of the 5 different fundraising roles but on the day I was told that I was only being interviewed for 1 specific role which meant I hadn't prepared as much as I would of liked. The 2 women that interviewed me were really friendly and put me at ease. The interview lasted about 30 mins.", "Interview Questions": "Name a time you have influenced someone to make a positive change"}, {"date": "4 Dec 2017", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Cancer Research UK (London, England) in Aug 2017", "Interview Descriptions": "Interview process took about 1 month from submitting online application to receiving the offer. It was a relatively easy process with a competency based online application form and interview.", "Interview Questions": "Why CRUK? "}, {"date": "6 Jul 2017", "title": "Fundraising and Marketing Graduate Scheme Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Cancer Research UK", "Interview Descriptions": "After the application I was invited to an assessment day at the London office which comprised of a tour, group task and individual interview. After this I was invited to a second interview which involved an individual presentation and interview. All employees involved in the interview process were very friendly and welcoming.", "Interview Questions": "Tell me about the biggest risk you have taken."}, {"date": "2 Jul 2017", "title": "Human Resources Graduate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Cancer Research UK (London, England)", "Interview Descriptions": "First stage group task then a interview when asked about key competencies.  The second stage involved a presentation that was prepared prior to interview then a interview with head of HR and another person. This was quite informal.", "Interview Questions": "Whats the role of HR in a business ?"}, {"date": "28 Jun 2017", "title": "Busineess Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Cancer Research UK in Jun 2017", "Interview Descriptions": "Applied directly on website sending in my CV. Got an invite for a telephone screening within a few days. The HR person was very polite and got things sorted swiftly, apart from the feedback request which I am still waiting for", "Interview Questions": "My experience and work history. Also wanted to know if I appreciated the differences between agile and waterfall. Nothing too worrying and the questions were easy in my opinion"}, {"date": "11 May 2017", "title": "Promotional Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Cancer Research UK", "Interview Descriptions": "The application process was straightforward, I had to submit a CV and answer some questions relating to the job. I received an invitation to a recruitment day within 2 weeks of submitting the application. The day started with an introduction about CRUK and information about the job. This was then followed by some group activities and a break before a competency based interview.", "Interview Questions": "Why did you apply for this job?"}, {"date": "9 May 2017", "title": "Research and Data Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Cancer Research UK (London, England) in Apr 2017", "Interview Descriptions": "There was a one hour interview with two panel members followed by a test sent through by email later in the week. The women that interviewed me clearly had little to no experience interviewing, as they were both very quiet and seemed extremely nervous themselves. They hardly engaged with me and made me feel considerably more nervous than I would have been. Both seemed young and inexperienced. \r\n\r\nThere was a lot of questions, a little too many in my opinion, it was unnecessary. Also, I believe interviewers are supposed to prompt you a little if they require more information, but this did not happen. \r\n\r\nAlso, I was surprised to find they didn't ask me why I wanted to work for CRUK? They asked what made me want to apply for the role. But not a single question about the company. Which was annoying, as the bulk of my research on CRUK was based on them as a company. I had to find a way to work, what I had learnt, in the questions at the end.", "Interview Questions": "What software have you used at University?"}, {"date": "22 Nov 2017", "title": "Business Development Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Cancer Research UK (London, England) in Apr 2017", "Interview Descriptions": "First round interview with two business development managers. Several questions regarding CV and related work experience, combined with questions regarding in depth IP knowledge and Drug discovery process. Other questions include recent news interest in the sector and challenges faced in the position", "Interview Questions": "Please tell me about recent developments in the sector that has interested you "}, {"date": "2 Mar 2018", "title": "Events Marketing Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Cancer Research UK (Canterbury, England) in Apr 2017", "Interview Descriptions": "After getting through the online application process, I completed a telephone interview with the Area Marketing Manager of the region I would be interning in. Questions were fairly standard, asking about things like relevant skills, availability, why Cancer Research UK, etc. Found the interview very manageable, but waited for over a month to hear back, when I was told I would be contacted the next day.", "Interview Questions": "Why do you want to intern for Cancer Research UK?"}, {"date": "26 Feb 2017", "title": "Fundraising Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Cancer Research UK (London, England)", "Interview Descriptions": "Interview consisted of a 15 minute task at a computer, answering mock emails to several types of people that you are likely to come across on a daily bases, followed by a competency based questions by a panel of two members of the department.", "Interview Questions": "Tell us  about a time you overcame a problem."}], [{"date": "9 Mar 2017", "title": "Project Manager / Senior Administrative Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 6 weeks. I interviewed at Cancer Research UK in Feb 2017", "Interview Descriptions": "Applied online then received an email inviting me for an interview. The interview was over 55 miles away but I was very keen to attend. Arrived slightly early so asked to use the toilet, I was told I would have to go to the mc Donald's round the corner as interview was taking place. Finally got to start interview 30 minutes late as interviews were running late.  Was told nothing about the role at all including salary area or what was expected etc. Was asked a lot of stupid questions which test how quickly you can make up a story to impress them. I was also asked about an old colleague of mine who has recently joined CRUK who I didn't particularly like because they were lazy and took the credit for everyone else's work. I thought this was totally unprofessional. I didn't get the job and it's taken the best part of a month to get the feedback I requested. I really had a lucky escape. Worst interview I have ever had and I think they had decided on me before I arrived", "Interview Questions": "Not one that had anything to do with me as a person, avoid like the plague"}, {"date": "16 Oct 2017", "title": "Digital Innovation Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Cancer Research UK (London, England) in Jan 2017", "Interview Descriptions": "I filled out a competency based online application and was then invited to interview at the head office. I was given the name of my interviewers prior to the start.", "Interview Questions": "Talk about a time when you have shown resilience. "}, {"date": "22 Oct 2020", "title": "Sales Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 days. I interviewed at Cancer Research UK (London, England) in Jan 2017", "Interview Descriptions": "Interview process was quick and easy, discussed the role over the phone and arranged to meet the next day, interviewers were helpful. I was allowed to work the day after the interview.", "Interview Questions": "They asked me about the hours I would be able to work. "}, {"date": "15 Jun 2019", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Cancer Research UK (Belfast, Northern Ireland) in Jan 2017", "Interview Descriptions": "I walked in store and applied via and application form that had to be filled in. After having a chat with the Manager, they were able to start me the next week.", "Interview Questions": "Q: Have you had any previous experience?"}, {"date": "5 Oct 2016", "title": "Shop Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Cancer Research UK (Broadstairs, Kent, South East England, England) in May 2016", "Interview Descriptions": "Very easy made to feel comfortable. Explained what was expected from me and what to expect. Was not too formal. Very warm and friendly with a healthy bit of competition between other shops within the region. Everyone has a skill in different areas, which is great as everyone has something to offer", "Interview Questions": "What I thought about animal testing"}, {"date": "8 Oct 2016", "title": "Corporate Partnerships Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Cancer Research UK (London, England) in May 2016", "Interview Descriptions": "Online application followed by interview (30 mins approx) with 2 team members. Interview constisted of mostly competency based questions - e.g. how have you dealt with a time when someone has not co-operated? Give me an example of when you have taken initiative / dealt with a problem / you have multi-tasked? \r\n\r\nVery friendly interview and people. Make sure you do your research into the charity - it looks good to know about recent events etc.", "Interview Questions": "- Why do you want to intern at CRUK? \r\n- Give me an example of a corporate partnership."}], [{"date": "20 Apr 2016", "title": "Fundraising and Marketing Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Cancer Research UK (London, England) in Sept 2015", "Interview Descriptions": "An application form and then a face to face interview which lasted around 50 minuttes. It involved a 1 to 2 chat and a short writing exercise. Expenses are paid to the interview with a cap.. General questions about your motivation and situational questions.", "Interview Questions": "Who is someone you have been inspired by?\r\nWhy do you want to work for CRUK?"}, {"date": "24 Jan 2016", "title": "Sales Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Cancer Research UK (Coventry, England) in Sept 2015", "Interview Descriptions": "Quick, made feel at ease, typical of the industry. The interviewer was well organised and a store manager, easy to talk to if you share a passion for the charity.", "Interview Questions": "Why CRUK?"}, {"date": "12 Sept 2015", "title": "Research Engagament Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Cancer Research UK (Southampton, England) in Aug 2015", "Interview Descriptions": "At the local offices, very friendly but formal. Good procedures, clear process and each stage was well communicated to me. Expectations of each interview were emailed - length of time, directions, tasks and style of interview - in plenty of time. I reached the second interview and following that one I received a phone call. They also offered very constructive and informative feedback despite the fact that I was not offered the position.", "Interview Questions": "Can you describe how you can demonstrate different communications to different audiences and give us two examples of when you have done this successfully."}, {"date": "26 Nov 2015", "title": "Direct Marketing and Event Planning Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Cancer Research UK (Islington, England) in Aug 2015", "Interview Descriptions": "I got an interview invitation after 1-2 weeks after my application. Then I had about 2 weeks to get prepared for the interview. I was interviewed by two persons.The office looks quite nice and the interviewers were polite and friendly. They asked some basic questions such as why CIUK and why this role. They totally asked me about 10 questions. Some questions were based on my answer to the previous question. Such as \"Tell me an example that you solved a problem using your own initiative?\" and the following question was \"How did you come up with that idea?\"", "Interview Questions": "example of teamwork, what are you passionate about?"}], [{"date": "1 Dec 2015", "title": "Retail Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at Cancer Research UK (London, England) in May 2015", "Interview Descriptions": "Competency and behavioural questions.  The usual stuff really.  Quite informal, but the questions were as tricky as with other employers, just said in a nicer way.  Be genuine; they look for people aligned with the current workforce.", "Interview Questions": "Why CRUK"}, {"date": "25 Jan 2016", "title": "Senior Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Cancer Research UK (London, England) in Apr 2015", "Interview Descriptions": "Two rounds, competency based followed by interesting testing method in second round. My interview was interrupted a few times, which was poor but overall an interesting, informative and quite enjoyable process", "Interview Questions": "How would you raise £5m "}, {"date": "14 Apr 2019", "title": "Sales Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Cancer Research UK (London, England) in Apr 2015", "Interview Descriptions": "Simple conversation about motivations; they're basically gauging if they can put you infant of a customer. Nothing to worry about, if you're not rude or obnoxious you will most likely get the role. Good luck", "Interview Questions": "Why cancer research uk? What are your interests? Have you got any previous experience. its not a problem if you don't? What hours would you be looking to work?"}, {"date": "2 Nov 2017", "title": "Sales Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Cancer Research UK (London, England) in Feb 2015", "Interview Descriptions": "Very quick and formal and easy. Was shown around after and told the health and safety regulations and generally what's expected from this role and being a part of this group.", "Interview Questions": "Tell us about yourself"}, {"date": "16 Sept 2017", "title": "Data Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Cancer Research UK (London, England) in Feb 2015", "Interview Descriptions": "Interview lasted 3 hours. Broken down into, CV chat, specific questions/problems solving and then practical test. Was interviewed by two people, in a small meeting room on the fourth floor. Was given a cup of tea which was nice. Good feedback, after the process.", "Interview Questions": "Explain a cancer drug development process."}, {"date": "10 Dec 2015", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Cancer Research UK (London, England) in Dec 2014", "Interview Descriptions": "No phone interview. Invited straight to the office. There did a short and simple case study with two members of the team (Not HR). Received a job offer within a week. Overall, quite nice and relaxed atmosphere.", "Interview Questions": "-Analyse Airbnb and explain there business model"}, {"date": "3 Oct 2014", "title": "Corporate Partnerships Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Cancer Research UK (London, England)", "Interview Descriptions": "The was a simple online application which asked all of the usual questions (e.g. why Cancer Research UK, why this role etc). I was then invited to an interview at their office in London. I was interviewed by two people from the department who were very friendly and it was quite informal questioning and a relaxed atmosphere. They asked me about the challenges that Cancer Research UK face, as well as my motivation for applying and other similar questions that focused on the role. I prepared by researching them online on their website and checking for any new developments in the news and that seemed to be enough. Later, when I joined, they said they look for friendly people that have potential and seem enthusiastic about the cause. They understood that not everyone would have a lot of experience.", "Interview Questions": "Some other interns got asked questions like 'If you were part of a salad what part would you be?' and 'what is your favourite holiday?'. These are just to make sure you have a bit of personality."}, {"date": "14 Aug 2018", "title": "Human Resources Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Cancer Research UK (London, England) in Oct 2014", "Interview Descriptions": "Two interviews in total first with an HR contact and then with a business stakeholder. The interview was a standard competency interview and each lasted approximately 1 hour. I was contacted the day after the second interview which was great in terms of timing.", "Interview Questions": "How would you describe your influencing style?"}, {"date": "13 Mar 2018", "title": "Internship Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Cancer Research UK (London, England) in May 2014", "Interview Descriptions": "Interviewed by two young employees who had never interviewed anyone before. Despite this, they were very professional and easy to talk to. I was also provided feedback about why I didn't get the role- didn't have as much experience as another candidate. However, I  was offered a place in a clearing pool to be contacted by other departments.", "Interview Questions": "They ask you to talk about the things you've written on your CV and application so be prepared to elaborate."}, {"date": "13 Mar 2014", "title": "Human Resource Project Manager Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Cancer Research UK", "Interview Descriptions": "Great, very well organised and made me feel comfortable", "Interview Questions": "When have you had to have a difficult conversation, how did you approach it?"}], [{"date": "7 Mar 2017", "title": "Innovation Delivery Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Cancer Research UK (London, England) in Dec 2013", "Interview Descriptions": "Two interviews. First competence based and second a presentation to show my project management skills. I've used powerpoint to present it. The interviewers were quite nice and made me feel comfortable as opposed to challenged.", "Interview Questions": "Tell me an example of when things went wrong in a project you were managing and what did you do."}, {"date": "22 Oct 2016", "title": "Supplier Relationship Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Cancer Research UK in Dec 2013", "Interview Descriptions": "The process to set up the interview was easy & flexible. Met with two lovely senior managers, very relaxed atmosphere. They explained a little about the role, briefly went through my CV & then read from a list of set questions.", "Interview Questions": "Pre-set. They worked from a printed sheet of paper. Lots of \" please give me an example of when you...\"."}, {"date": "12 Sept 2017", "title": "PhD Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Cancer Research UK in Feb 2013", "Interview Descriptions": "Had to fill in an online form with relevant research experience and academic records. No cover letter was needed. Two referees required. Was invited for face-to-face interview where I had to present a publication in the form of a PowerPoint presentation and then had one-on-one time with PI. Small interview with educational committee at the end of the day, but very friendly and straightforward questions.", "Interview Questions": "How would you deal with the frustration of research?"}, {"date": "11 Feb 2013", "title": "Service Delivery Manager IT Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through other source. I interviewed at Cancer Research UK (London, England) in Jan 2013", "Interview Descriptions": "Applied via Jobserve/agency  then receive more details of role. Clearly state that  Cancer Reasearch does not discriminate on grounds of race age etc. CV submitted along with  5 others by agent - mine just got lost - I am over 50 with a lot of experience working in large organisations and have been very successful and more than meet their job spec requirements. This is not the first time this has occurred - Ageism rules in this organisation!", "Interview Questions": "Why did we dump your CV?"}, {"date": "30 May 2014", "title": "Sales Associate Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 days. I interviewed at Cancer Research UK (London, England) in Mar 2012", "Interview Descriptions": "An easy and voluntary process! No actual hard questions asked, a good way to get your foot in the door of retail. You went to the store and asked about a job. It was useful to know someone in the store but not necessarily vital.", "Interview Questions": "They asked about previous work experience"}, {"date": "2 Jun 2014", "title": "Shop Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Cancer Research UK (Dumfries, Scotland) in Aug 2011", "Interview Descriptions": "I was a volunteer initially and saw the vacancy in the internal vacancies list.  I applied and heard nothing for almost 2 months, before being called for interview.  I got the impression at the time that they just wanted someone to keep the doors open during Christmas and I had the ability to do that.  Two weeks later I was offered the job and immediately sent for training.", "Interview Questions": "Nothing really out of the ordinary."}, {"date": "31 Jul 2012", "title": "Corporate Partnerships Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Cancer Research UK (London, England) in Jun 2011", "Interview Descriptions": "Relaxed and friendly interview at Cancer Research UK's HQ in Angel, London. Had two separate interviews with two colleagues at each for different departments. More competency -based questions and as to reasons why I applied and would be able to contribute to the charity.", "Interview Questions": "Why Cancer Research? "}]]