[[{"date": "1 Jun 2023", "title": "Administrative Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at University of Minnesota (Minneapolis, MN)", "Interview Descriptions": "After receiving the initial email expressing interest, I had a one-way video interview, followed by an in-person interview on campus. Both were pleasant. the first was maybe 30 minutes, the second an hour. I would share a piece of advice I heard once I got the job: when submitting a cover letter and resume, make sure you touch on EACH bullet point in the job description at least once. Most large higher ed institutions' application review processes are very literal. Good luck!", "Interview Questions": "Describe a time you dealt with a difficult external customer or stakeholder. How did you work through the situation? What did you learn from the experience?"}, {"date": "28 Jun 2023", "title": "Academic Advisor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Minnesota (Minneapolis, MN) in Jun 2023", "Interview Descriptions": "By this time, I've had 7 interviews for 5 different positions (including Academic Advisor, Student Services Coordinator, and Office Administrator), with each position being in a different school/college/department at the U of M. All 7 interviews have been professional and even somewhat enjoyable. So far, I haven't experienced any red flags during the interview process. A couple of notes: - One second-round interview was difficult in that part of the 3-hour agenda was me giving a 10-minute presentation that they had me prepare beforehand. I don't typically like \"working for free,\" but I thought the problem they had me tackle was an interesting one. - One first-round interview was a one-way video interview, which I've never done before. However, I think it must've gone pretty okay because they contacted me for a second-round in a couple of weeks. I haven't been offered any positions from U of M yet, but I'm optimistic that I'll land one soon!", "Interview Questions": "Share a situation where you tailored your message to a specific audience. How did you know what adjustments to make? How was it received by that audience?"}, {"date": "26 May 2023", "title": "Chief of Staff Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Minnesota (Minneapolis, MN) in May 2023", "Interview Descriptions": "Screening interview was a 25 minute panel interview with 3 panel members via Zoom. When interview was scheduled, there was no indication that it would be a panel. The interviewers were friendly and asked a standardized set of questions.", "Interview Questions": "Tell us what experience you have in fulfilling HR duties."}, {"date": "24 Apr 2023", "title": "Structural Engineer Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of Minnesota", "Interview Descriptions": "Casual. They were very easy going and seemed like a good group to work with. The interview process was not stressful and their questions were not too abstract. Really enjoyed the group.", "Interview Questions": "Describe how you approach a challenging problem."}, {"date": "6 Apr 2023", "title": "Community Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of Minnesota", "Interview Descriptions": "It was down to earth, a panel discussion and to the point. They made sure to ask questions that pertain to skills that they needed and it wasn't too long, but was important.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "23 Mar 2023", "title": "Student IT Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at University of Minnesota", "Interview Descriptions": "The interview process was straightforward. They just want to know you are a good worker and can follow directions. They asked questions about your education and a few job related questions that were pretty easy", "Interview Questions": "What is your education background and how is it related to the position"}, {"date": "10 Mar 2023", "title": "Data Analyst Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at University of Minnesota", "Interview Descriptions": "There were two rounds of (virtual) interviews: first an interview with a committee and then a second interview with the direct supervisor. They asked typical non-technical interview questions. They did not provide contact information for thank yous or follow-ups.", "Interview Questions": "What is your experience with liberal arts education and what do you think of its value?"}, {"date": "27 Feb 2023", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of Minnesota", "Interview Descriptions": "Very good. I was very impressed by the level of professionalism and poise by my interviewers. I felt confident in my answers and questions. I ended up getting the job.", "Interview Questions": "What would make you a good employee"}, {"date": "5 Apr 2023", "title": "Certified Personal Trainer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at University of Minnesota (Minneapolis, MN) in Feb 2023", "Interview Descriptions": "Basic interview questions asked by the manager. Questions consists of what are your strengths, and what do the words \"health\" and \"fitness\" mean to you. After the questions, a maximum of a week is waited before you are contacted about the position.", "Interview Questions": "What are some of your strengths/ tell me about yourself"}, {"date": "27 Jan 2023", "title": "Data Curator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of Minnesota", "Interview Descriptions": "Interviewed online where they talked about the program that we will be working with and the data server that we will be collecting the data from. It was overall very chill.", "Interview Questions": "What's you background? Why did you apply for this job?"}], [{"date": "19 Dec 2022", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of Minnesota", "Interview Descriptions": "Asked basic questions about the background areas of research, and teaching experience. Moreover, I was required to demonstrate my English proficiency, which went smooth. During the test, i was asked to teach on a given topic and have to speak 5 minutes non-stop.", "Interview Questions": "1) What is your area of research? 2) Have you ever taught before? 3) Do you have any special preferences on subjects"}, {"date": "11 Dec 2022", "title": "Assistant Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of Minnesota", "Interview Descriptions": "It was good to me. It is a multi stop process. I think it is best to be prepared and to do your best. I think the interview process was not the hardest situation that I ever had.", "Interview Questions": "How many years of experience?"}, {"date": "16 Nov 2022", "title": "Graduate Student Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at University of Minnesota", "Interview Descriptions": "A transition-based named entity recognition component. The entity recognizer identifies non-overlapping labelled spans of tokens. The transition-based algorithm used encodes certain assumptions that are effective for “traditional” named entity recognition tasks, but may not be a good fit for every span identification problem. Specifically, the loss function optimizes for whole entity accuracy,", "Interview Questions": "A transition-based named entity recognition component. The entity recognizer identifies non-overlapping labelled spans of tokens. The transition-based algorithm used encodes certain assumptions that are effective for “traditional” named entity recognition tasks, but may not be a good fit for every span identification problem. Specifically, the loss function optimizes for whole entity accuracy,"}, {"date": "10 Nov 2022", "title": "Project Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at University of Minnesota in Oct 2022", "Interview Descriptions": "I was invited to participate in a one-way interview where I could record responses to several questions. Next, I did a virtual interview with one department member, who passed me along to two additional interviews with three other members of the hiring committee.", "Interview Questions": "Why are you interested in this role?"}, {"date": "15 Nov 2022", "title": "Security Risk Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of Minnesota in Sept 2022", "Interview Descriptions": "Two sets of interviews. The first one was meeting the team and round robin asking of behavioral questions. The second one was more of how you addressed problems in your previous workplace, results of previous projects, and included upper management and the CISO. They were both conducted over Zoom.", "Interview Questions": "How do you plan on supporting equity and inclusion?"}, {"date": "12 May 2023", "title": "Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of Minnesota (Minneapolis, MN) in Aug 2022", "Interview Descriptions": "It was fast and easy. Not too difficult, and responded in a timely manner. Part of the process includes taking a video responding to questions, and then the video going to the employer", "Interview Questions": "Why are you interested in this position"}, {"date": "24 Jul 2022", "title": "Program Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of Minnesota", "Interview Descriptions": "The interview process as a whole was very professional and friendly from everyone who participated. Good questions and engagement and not too long.  I was able to ask questions that were answered.", "Interview Questions": "Interest in the position offered"}, {"date": "29 Aug 2022", "title": "Human Resources Generalist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Minnesota in Jul 2022", "Interview Descriptions": "After the application the recruiting lead asked me to respond to a few initial questions. A few days after I submitted my responses via email they responded saying that they would like to set up an interview, this took place over zoom with about 5 total people.", "Interview Questions": "Give us an example of something you accomplished at your last position that you were proud of"}, {"date": "11 Aug 2022", "title": "Grad Student Coordinator Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of Minnesota in Jul 2022", "Interview Descriptions": "I had an interview with the department with a few of their staff. It was an easy conversation and flowed well. However, they were very cagey about compensation and refused to give me a number. By the time they gave it to me, I realized it was less than I was currently making and had to pull my application. It was a waste of all of our times, I wish they had just told me up front or when asked.", "Interview Questions": "How do you stay organized?"}, {"date": "3 Jul 2022", "title": "Senior Biostatistician Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at University of Minnesota in Jun 2022", "Interview Descriptions": "First round of interviews was with two MS Statisticians in the working group and one faculty for about an hour. They asked standard behavioral questions and some light technical background questions (e.g. What pieces of information would be important to know to do a power analysis?). Got an offer three days later with no second interview needed.", "Interview Questions": "What pieces of information would be important to know to do a power analysis?"}], [{"date": "23 May 2022", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at University of Minnesota", "Interview Descriptions": "Overall, the people were very kind and polite. We had a lot of genuine conversations about my past experiences and how I could leverage those into the new role as a research assistant. The people were very easygoing and overall I had a very positive experience.", "Interview Questions": "What were some obstacles I encountered in previous employment opportunities and how did I work to overcome them?"}, {"date": "12 May 2022", "title": "Clinical Research Coordinator Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Minnesota", "Interview Descriptions": "4 round of interview. First preliminary casual convo with hiring manager, then a formal interview with hiring manager, followed by meeting team members and finally meeting faculty members in the department.", "Interview Questions": "Q: tell me about your background etc\r\nQ: how will you be an expert and an asset to the faculty physicians. "}, {"date": "11 May 2022", "title": "Intern Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of Minnesota", "Interview Descriptions": "Many  people on the interview for a less than minimum wage interview. Asked irrelevant questions. Did not specify details when I asked questions. Very chaotic experience. Took 2 weeks to get back to me and I had to follow up first to get a response.", "Interview Questions": "Asked how I stay organized "}, {"date": "19 Sept 2022", "title": "Employer Relations Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at University of Minnesota (Minneapolis, MN) in May 2022", "Interview Descriptions": "The interview process was two interviews. Both took about 30 minutes - 1 hour to complete. They were virtual interviews and took place over the course of approximately 3 weeks.  ", "Interview Questions": "Tell us about your proudest achievement?"}, {"date": "22 Apr 2022", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of Minnesota", "Interview Descriptions": "There was an initial interview with the director and a few other researchers. They respond very quickly. The second interview was a week after the first interview. However, they are only 40. minutes which made me feel rushed", "Interview Questions": "Tell me about your qualitative research experience. Tell me about your quantitative research experience. What is your ideal relationship with your supervisor? Tell me about a research project where you took the lead? Tell me about a research project that was difficult to work withz"}, {"date": "27 Mar 2022", "title": "IT Student Worker Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at University of Minnesota", "Interview Descriptions": "It was a two interview process with a student lead and then an IT manager. Each lasted around 15 to 30 minutes with questions asking about experience and such. They also will tell you more about the position and what the role entails.", "Interview Questions": "What relevant experience do you have that pertains to this job?"}, {"date": "10 Mar 2022", "title": "Graduate Program Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at University of Minnesota", "Interview Descriptions": "First round interview with hiring committee that included hiring manager, departmental HR person, and a future colleague. The meeting lasted about 45-50 minutes and consisted of fairly standard behavioral interview questions. The second round was 30 minutes with the directors of grad studies I would be working with and was less formal, more of a conversation.", "Interview Questions": "Tell us about a time you resolved a conflict at work."}, {"date": "9 Mar 2022", "title": "Adjunct Faculty Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at University of Minnesota", "Interview Descriptions": "Quick process and easy access for the next week or two months of work and your schedule has changed in my order and will not make you wanna tuitions but you type it", "Interview Questions": "I don’t think I need that much time for "}, {"date": "18 Mar 2022", "title": "Accountant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at University of Minnesota in Mar 2022", "Interview Descriptions": "Online interview. You need to answer the interview question online and record a video. It has about 6 questions. You have two-time chances to answer the questions. Then you submitted the video.", "Interview Questions": "Tell about a process improvement you developed and implemented"}, {"date": "15 Oct 2022", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at University of Minnesota in Mar 2022", "Interview Descriptions": "I got an interview with a professor at UMN with a CV hands-on. He asked me several questions about my future career path and the project I would like to choose", "Interview Questions": "What do you want to do in future 10 years?"}], [{"date": "21 Feb 2022", "title": "Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at University of Minnesota", "Interview Descriptions": "It was good. Interviewed with two people, both of with were directors of the organization. They asked questions about my background, why I was interested, pretty typical things. Was not difficult.", "Interview Questions": "N/A"}, {"date": "8 Feb 2022", "title": "Data Breach Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Minnesota", "Interview Descriptions": "There is at least three rounds of interview which varies in length. The process was straight  forward and and relatively easy. The third round is kind a meeting  with top officers to check compatibility and how the candidate is suitable to the role.", "Interview Questions": "Tell me about a time when you have to create a new process or improve one in order to solve a problem?"}, {"date": "7 Feb 2022", "title": "Student Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of Minnesota", "Interview Descriptions": "I was sent an email inviting me to interview and then I interviewed through zoom. The interview process was pretty straightforward. They asked me about my experience and also why I was interested in the position.", "Interview Questions": "What is your past experience with administrative duties?"}, {"date": "8 Mar 2022", "title": "Systems Administrator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at University of Minnesota in Feb 2022", "Interview Descriptions": "Phone screen with hiring manager followed by 1 hour zoom video interview with the entire team.\r\nSome technical questions and some behavioral questions.\r\nMainly technical questions about sys admin type stuff.\r\n\r\nSeems like they don't want to hire anyone that's qualified.  They want to hire someone that will conform to being vaccinated and following diversity initiatives.", "Interview Questions": "How do you embrace diversity and inclusion?"}, {"date": "2 Mar 2022", "title": "Service Desk Consultant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at University of Minnesota (Minneapolis, MN) in Jan 2022", "Interview Descriptions": "The first stage was a one-way video interview powered by Sparkhire where I had an unlimited amount of think time, three minutes to answer, and two takes for each question.", "Interview Questions": "When working with customers, what actions do you take to gain their confidence and trust?"}, {"date": "3 Nov 2022", "title": "District Administrative Manager Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at University of Minnesota (Minneapolis, MN) in Jan 2022", "Interview Descriptions": "The interviewers were very thorough and very friendly. They explained questions I didn’t understand. Gave me time to answer the questions without feeling rushed or overwhelmed. Comfortable setting but was a little lengthy.", "Interview Questions": "Describing various scenarios on how you would handle different situations…"}, {"date": "19 Jan 2022", "title": "Executive Office & Administrative Specialist Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Minnesota (Saint Paul, MN) in Dec 2021", "Interview Descriptions": "Lengthy. One way video interview and at least two rounds of video interviews with the department staff. The process to apply and interview for one job took almost two months.", "Interview Questions": "They asked the usual interview questions, primarily on previous experience and what skills would be brought to the current position. "}, {"date": "22 Nov 2021", "title": "Resident Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at University of Minnesota", "Interview Descriptions": "They were really nice people. Interview environment was relax and comfortable but the tension was high. They ask really specific questions about my medical training and my reason to become resident at USA", "Interview Questions": "why are you choosing this program? "}, {"date": "1 Nov 2021", "title": "Computer Science TA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Minnesota", "Interview Descriptions": "One behavioral round lasted for 30 minutes.  Asked about challenges faced and how to help students when they ask for help. Asked about I would deal with students at a disadvantage and how I would eliminate any implicit bias.", "Interview Questions": "Asked about how I would treat everyone fairly."}, {"date": "19 Oct 2021", "title": "Computer Lab Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at University of Minnesota", "Interview Descriptions": "Pretty much easy going, regular interview. Basically went through the overview of the position and asked me general questions that are not that much challenging. There was only one interview I had to do and got an offer pretty much right after the interview via email.", "Interview Questions": "Why are you interested in this position?"}], [{"date": "19 Oct 2021", "title": "UGTA Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at University of Minnesota", "Interview Descriptions": "It was a zoom interview, meeting with several employee leaders and they asked logical and behavioral questions. The questions were standard; they asked about my resume as well. I elaborated on my experiences.", "Interview Questions": "N/A"}, {"date": "7 Oct 2021", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at University of Minnesota", "Interview Descriptions": "Very good. The interview was straightforward and very easy. Just a couple of questions they asked me easy to answer. It was virtual so not in person, It was still good though even though it was virtual", "Interview Questions": "Time you worked in a team"}, {"date": "22 Nov 2022", "title": "Clinical Research Coordinator Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Minnesota in Oct 2021", "Interview Descriptions": "It was easy. The process was not very lengthy. Questions were mostly behavioral. They responded very quickly. Had 2 rounds and they arranged both the meetings very timely and gave quick result.", "Interview Questions": "What are your three strengths?"}, {"date": "23 Sept 2021", "title": "Clinical Trail Monitor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of Minnesota", "Interview Descriptions": "First interview with hiring manager and next a second interview with the clinical team and other clinical trial monitors. After successfully going through both interviews, I never was contacted about my standing.", "Interview Questions": "Quick presentation of your resume and qualifications. What attracted you to apply for this position?\nHow do you work in a fast paced enviroment? "}, {"date": "13 Sept 2021", "title": "Academic Advisor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of Minnesota", "Interview Descriptions": "Had a 30-minute interview with 4 members of the department. I was told that the would be moving on to next steps in the following week or two, but I never heard back from anyone at the University regarding the job (it has been almost 2 months).", "Interview Questions": "They asked typical first interview questions."}, {"date": "17 Nov 2021", "title": "Public Relations Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at University of Minnesota (Morris, MN) in Sept 2021", "Interview Descriptions": "I had a Zoom interview with the Morris campus graphic designer and senior director of institutional effectiveness \nand  the director of marketing and public relations from the Duluth campus. It was relatively uneventful and they were all professional and friendly.\n\nI was a little put off that they strung me along for months after the interview without the courtesy of even sending an email. I emailed them three different times asking for word on the selection process, and only received an answer on my last email, more than a month and a half after the interview. THAT was not particularly professional.", "Interview Questions": "Very common PR questions. Nothing memorable. The usual \"Why do you want to work at UMN Morris?\" kind of thing."}, {"date": "2 Apr 2022", "title": "Building Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at University of Minnesota (Minneapolis, MN) in Sept 2021", "Interview Descriptions": "The interview process was very standard. They asked some behavioral questions but overall wanted to make sure you would be a reliable and good worker. The questions were not too hard and they only asked a few, then they asked about your work experience.", "Interview Questions": "What would you do if there was a conflict in the building, how would you handle it"}, {"date": "24 Oct 2022", "title": "Student IT Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at University of Minnesota in Sept 2021", "Interview Descriptions": "It was a very laid back interview. Asked about my interests and how i would handle different situations. the interview was only 20 mins. They offered me the position at the end.", "Interview Questions": "How would you ensure privacy when working remotely."}, {"date": "3 Aug 2021", "title": "Clinical Research Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of Minnesota", "Interview Descriptions": "it was simple. No complexities at all. Interviews were well scheduled and got timely response. Although lots of interviews were done but finally they decided on an university internal employee.", "Interview Questions": "What is your biggest strength and weakness?"}, {"date": "28 Jul 2021", "title": "Digital Marketing Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of Minnesota", "Interview Descriptions": "I was interviewed by a group of 8 people who asked me questions and reviewed my portfolio. The questions ranged from serious to funny.  They also asked me to talk about the projects that I've worked on in the past.", "Interview Questions": "If you were a superhero, which one would you be?"}], [{"date": "3 Jul 2021", "title": "HR Generalist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at University of Minnesota", "Interview Descriptions": "All communication before and after the interview was timely and professional. I do wish they would have told me what stage of interview we were in, as they didn't do a prescreen. I also wish they would have told me the interview attendees.", "Interview Questions": "What is your experience with DEI?"}, {"date": "6 May 2022", "title": "Accounting Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 7 months. I interviewed at University of Minnesota (Minneapolis, MN) in Jul 2021", "Interview Descriptions": "The manager emailed me to schedule a 1 on 1 interview and it was a very relaxing interview process, and asked some experience-related and behavioral questions. They emailed me after four days that you are hired.", "Interview Questions": "Tell me a time that you overcome from the conflict and how do you feel?"}, {"date": "25 Jun 2021", "title": "Executive and Office Administrative Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at University of Minnesota", "Interview Descriptions": "It was the traditional process of a phone interview followed by a video(Zoom) interview. Additional references were requested, and then a position was offered. In total, the process took 2-3 weeks.", "Interview Questions": "How do you prioritize tasks? "}, {"date": "25 Mar 2022", "title": "CSCI Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at University of Minnesota (Minneapolis, MN) in Jun 2021", "Interview Descriptions": "No technical questions. No need to practice leet code for such an interview. Just explain why you would be a good TA and answer some questions about inclusion and diversity.", "Interview Questions": "Why do you think you would be a good TA?"}, {"date": "7 May 2021", "title": "Data Entry Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at University of Minnesota", "Interview Descriptions": "Easy interview with minimal questions. The job didn't require much experience for the position so the questions were about general work ethic. It was only a 20 minute phone call interview.", "Interview Questions": "What is your experience with data entry?"}, {"date": "20 Jun 2023", "title": "Software Developer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Minnesota (Minneapolis, MN) in May 2021", "Interview Descriptions": "The process was a bit informal. No coding interview. Questions were behavioral and more high-level discussions about technology, the development process, and work styles. They also discussed some of the challenges the school was facing and how they planned to address it technologically.", "Interview Questions": "What are the benefits of using containers? How would you explain it to me if I were 5 years old?"}, {"date": "30 May 2021", "title": "Senior Program Associate Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of Minnesota in Apr 2021", "Interview Descriptions": "Disorganized, they clearly have no idea what they are looking for. Too many people involved, panel clearly unqualified and uninformed about role. Job is very poorly paid, as are most UofM jobs, but they are looking for an extraordinarily experienced and skilled candidate.", "Interview Questions": "Please Tell us about yourself"}, {"date": "25 Mar 2021", "title": "Front End Developer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at University of Minnesota (Minneapolis, MN)", "Interview Descriptions": "First interview: phone screening with lead developer\n\nSecond interview: met with various directors and was given a problem to solve before the interview.  During the interview they asked how I would solve the problem and was asked to walk them through my thought process. I was given no immediate feedback on my answer.", "Interview Questions": "They asked about relevant experience, asked some behavioral questions, and also asked specifically how I would solve the example problem "}, {"date": "25 Mar 2021", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of Minnesota", "Interview Descriptions": "Applied using guidelines on website. Important to indicate professors and areas that match your research interests and explain why you want to join grad school. References from other professors are also important", "Interview Questions": "Why do you want to be there? What your career goals?"}, {"date": "22 Mar 2021", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at University of Minnesota", "Interview Descriptions": "The interview process went very well, thank you very much for asking me. I enjoyed it and think that they asked easy questions that I could find answers to with ease.", "Interview Questions": "What is you greatest strength?"}], [{"date": "25 Jan 2021", "title": "Multimedia Designer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of Minnesota", "Interview Descriptions": "Lack of communication. I went through 2 rounds of interviews, one in person and one remotely. I followed up was finally told that I didn’t get the position. The staff seemed nice, but the follow up was disheartening. I get the feeling that your interview experience depends on the department that you are interviewing with.", "Interview Questions": "How do you incorporate diversity and inclusion in your process?"}, {"date": "19 Jan 2021", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at University of Minnesota", "Interview Descriptions": "Good. Just talk with the professor and everything is fine. It depends on how well you are familiar with your professor and your field. Just keep me normal and stay professional.", "Interview Questions": "Do you think you can handle the work?"}, {"date": "26 Jun 2023", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at University of Minnesota (Minneapolis, MN) in Jan 2021", "Interview Descriptions": "Just sit down. That’s it. Just talked with professor about the class I’d be helping with and how I was supposed to grade and run it. Overall pretty chill. Just make sure you talk about liking teaching.", "Interview Questions": "What is your favorite part of the body?"}, {"date": "4 Jan 2021", "title": "Clinical Research Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at University of Minnesota (Minneapolis, MN) in Dec 2020", "Interview Descriptions": "They asked a question as to how I deal with a difficult supervisor. They wanted to find out my through process. They wanted to know the days I would be available to work. It seemed that they had predetermined days and not open to flexibility.", "Interview Questions": "Talk about difficult patient or supervisor"}, {"date": "16 Nov 2020", "title": "Grants Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Minnesota", "Interview Descriptions": "two  interviews took place. the first interview was a bit easier and shorter, more of a screening. the second interview was longer and had more challenging behavioral/experience-related questions. the process took one week", "Interview Questions": "how do you handle challenges or difficulty in your current job?"}, {"date": "28 Oct 2020", "title": "Dental School Communication Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Minnesota (Minneapolis, MN) in Oct 2020", "Interview Descriptions": "initial phone interview 5 minutes: why do you want to work for us and what is your salary?\r\n\r\nAfter receiving a second interview (via Zoom) which lasted for one hour I was never contacted. I had to reach out to them after two weeks and their response was that there must have been a \"hiccup\" with getting back to me. I prepared for hours for this interview and was shocked by their lack of empathy, kindness, and mismanagement. \r\n\r\nHiring supervisor appeared very young and perhaps in over her head. She asked how I would \"manage up\" which after reviewing with associates later I understood to be how do you manage your manager. I do my job and I expect them to do theirs.\r\n\r\nPerhaps not getting this job was a blessing.", "Interview Questions": "How do you manage up?\r\n\r\nTell me about a time when you didn't succeed at work?\r\n\r\nWhat do you do when you make a mistake?\r\n\r\nWhat is the difference between identity and brand?"}, {"date": "24 Sept 2020", "title": "Tech Support Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of Minnesota", "Interview Descriptions": "Showed up and asked me questions about whether or not I would be able to do the job. Was able to accurately answer with a definitive yes or no to each question", "Interview Questions": "Can you map a network drive"}, {"date": "31 Aug 2020", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Minnesota", "Interview Descriptions": "I submitted the application and got reply in a week. The interview is conducted by the professor and it's straightforward, just some mostly asked questions. They will also inform you the details about the position. Don't hesitate to ask questions.", "Interview Questions": "Tell me about yourself. / Why are you interested in the position? "}, {"date": "5 Aug 2020", "title": "Student Building Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of Minnesota", "Interview Descriptions": "Simple and easy, very laid back, always looking for the right people who are looking to get some job experience with an on campus position. Typically get back to you within a day or two of the interview depending on whether they would like to offer you the position.", "Interview Questions": "Q: Tell me about a time you had to resolve an issue with a co-worker or team member."}, {"date": "5 Sept 2021", "title": "Student Custodian Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of Minnesota (Minneapolis, MN) in May 2020", "Interview Descriptions": "One question: when can you start. Super easy but probably also depends on who is conducting the interview. No need to get super dressed up before or prepare. Should go pretty smoothly for anyone", "Interview Questions": "What days are you able to work?"}], [{"date": "11 May 2022", "title": "Full Time Faculty Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Minnesota in Mar 2020", "Interview Descriptions": "The interview process starts with an exploratory phone interview with the hiring committee.  Multiple interviews with administration, other faculty, and students.  Required to give a teaching presentation to the university community to based on a topic of your choice.", "Interview Questions": "What is your teaching style?"}, {"date": "23 Mar 2020", "title": "Internship Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at University of Minnesota (Minneapolis, MN) in Mar 2020", "Interview Descriptions": "Phone interview, given Covid-19. Very short, pleasant. I asked if I had any questions that led into more discussion about the position. Seemed very flexible for another summer internship I had.", "Interview Questions": "What is your experience with social media and stats"}, {"date": "16 Jan 2020", "title": "Finance Professional Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at University of Minnesota", "Interview Descriptions": "Formal interview with 19 questions that checks your experience level. Some of them had sub questions.  The questions were basic . Compliance monitoring  and enforcement . obtaining info  from a contact when they dont respond in a timely fashion", "Interview Questions": "How do you promote diversity and inclusion"}, {"date": "9 Jan 2020", "title": "Graduate Student Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at University of Minnesota", "Interview Descriptions": "They accept you before the interview, so the interview process is more a benefit for you to choose a team to join. This is not a stressful interview, they put you at a hotel and take you to a chain brewery.", "Interview Questions": "What drives you?"}, {"date": "23 Feb 2022", "title": "Student Lab Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at University of Minnesota (Minneapolis, MN) in Jan 2020", "Interview Descriptions": "Just sat down with them and talked. We discussed what they do and how the job is done. We then went on to discuss why my skills work well in this work environment.", "Interview Questions": "How do you feel qualified for this job"}, {"date": "4 Feb 2021", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at University of Minnesota (Minneapolis, MN) in Jan 2020", "Interview Descriptions": "Job posting - Apply - Wait for a week - Interview - Accepted - Approval - Paper work\nThis is almost all of the explanation about my job processing. It was not too hard to get a job here as a student intern.", "Interview Questions": "What is your strengths working as Intern?"}, {"date": "16 Dec 2019", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at University of Minnesota", "Interview Descriptions": "There was an online application. Then if you were qualified you were asked back for an interview. The interview took place in-person, with just one person. The person was who your future supervisor will be. Really relaxed and stress-free environment. Fairly easy interview questions. I was offered the position within a week.", "Interview Questions": "Weaknesses"}, {"date": "5 Dec 2019", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at University of Minnesota", "Interview Descriptions": "Very quick. Couple of phone calls and an in person interview. Was quite informal for most of it. Mainly went based off of your application. Hiring depends upon the funding that they have available, so you may be a great candidate but they just don't have the funding right then.", "Interview Questions": "If I was interested in doing a PhD."}, {"date": "2 Dec 2020", "title": "Student Development Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at University of Minnesota in Sept 2019", "Interview Descriptions": "I met the recruiter at a school career fair, after talking to her and submit an application I got contacted for an interview. It was a one-round interview with about 8 questions", "Interview Questions": "Tell me about a time you took initiative"}, {"date": "14 Aug 2019", "title": "Systems Administrator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at University of Minnesota (Minneapolis, MN) in Aug 2019", "Interview Descriptions": "Could not even find the building cause of the 9 different constructions going on and I had arrived almost 40 minutes early.  If the whole front of your building is being replaced you might want to give the person interviewing a heads up so they are aware.  The HR dept would not let me reschedule.  Totally ridiculous and HR won't even communicate with you, sending you scripted responses.  Don't you dare think for a second you were going to get inside the impenetrable fortress that is the U of MN!", "Interview Questions": "Where is the building I am supposed to interview in??!?!!?"}], [{"date": "4 May 2019", "title": "Assistant Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at University of Minnesota", "Interview Descriptions": "Standard process for academic interviews. It takes 2 days. One presentation, 10 - 15 one on one meetings. The good thing is that people are really nice in the whole interview process", "Interview Questions": "Questions are about your research. "}, {"date": "19 Oct 2021", "title": "Researcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Minnesota in May 2019", "Interview Descriptions": "Received an interview invite after submitting the job application.\nThe interview was straight-forward. Explained the research project I was working on and gave some examples as to how I can apply my current skillsets in the job I'm applying.", "Interview Questions": "What was the role of DTI (Diffusion tensor imaging) in the biophysical modeling of deep brain stimulation that I was building?"}, {"date": "24 Apr 2019", "title": "Postdoctoral Fellow Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at University of Minnesota", "Interview Descriptions": "a phone interview. You presented your works. They asked questions in your presentation.\r\nThen they told you what they were doing. The main questions are about your research and related projects. Not so difficult because they did not ask detailed questions but the big picture.", "Interview Questions": "some questions related to your slides"}, {"date": "2 Apr 2019", "title": "Scientist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at University of Minnesota (Minneapolis, MN)", "Interview Descriptions": "Excellent interview process. Great team. Very personable. I was able to meet the team and everyone I would work with. Quick from interview to hire.  Turned out to be everything I expected it to be.  Great manager, staff team.", "Interview Questions": "Plan for next 5 years"}, {"date": "21 Mar 2019", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at University of Minnesota", "Interview Descriptions": "There were basic behavioral questions. It lasted about 30 minutes. It can go for longer if you wanted your answers to be more detailed, but concise answers are probably better.", "Interview Questions": "If the phone rang, a patron requesting to check out books, and another patron wanting to print but printer is jammed, in what order would you complete first and why?"}, {"date": "20 Mar 2019", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at University of Minnesota", "Interview Descriptions": "Very good, a lot of questions, very energetic, great environment, difficult to no to offers, a very good place to in the city, friendly people, very helpful, need to work hard though", "Interview Questions": "General question with some specific ones related to the previous work"}, {"date": "5 Aug 2022", "title": "Classroom Monitor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at University of Minnesota (Minneapolis, MN) in Feb 2019", "Interview Descriptions": "really quick and easy, they asked a lot of questions about my experiece and stuff ive done with classroom equipment in the past. overall it was very easy and id highly recommend working here", "Interview Questions": "What is some of your past work experience?"}, {"date": "22 Nov 2022", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at University of Minnesota in Feb 2019", "Interview Descriptions": "Very quick interview process from start to finish. Applied on line and had the interview over the phone a few days later. Was able to start two weeks after phone interview.", "Interview Questions": "How do you handle conflict?"}, {"date": "29 Jan 2019", "title": "Assistant Coach Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Minnesota", "Interview Descriptions": "Was a multi-step process. I lived out of state so it began with a skype interview and then narrowed down candidates. I was then called for an on campus interview. This part was extensive. I met with the head coach, senior administrators, the athletic director, the vice chancellor of student affairs, as well as athletes.  Important to note this was at the Morris campus.", "Interview Questions": "Describe your experience with coaching"}, {"date": "12 Mar 2023", "title": "PhD Graduate Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at University of Minnesota in Jan 2019", "Interview Descriptions": "They'll have you come for interview with the faculty and to meet some of the students. Important to ask the students about their experiences in the labs, and to ask the faculty about their research", "Interview Questions": "Talk about your research experience?"}], [{"date": "10 Dec 2018", "title": "Student Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at University of Minnesota", "Interview Descriptions": "The interview process was pretty straightforward and standard for an interview process. Did not take long and was very normal. Other than that, that is about it in regards to the interview.", "Interview Questions": "How do you define success"}, {"date": "4 Mar 2021", "title": "Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at University of Minnesota (Minneapolis, MN) in Dec 2018", "Interview Descriptions": "only behavioral Qs, not too complex, since you must show professionalism, and persistence to learning new skills, they will be motivated to have you. Also, very friendly environment and a good induction process.", "Interview Questions": "What 5 words your friends will define on you?"}, {"date": "19 Oct 2018", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of Minnesota", "Interview Descriptions": "Was asked to come in the lab and interview it was easy for the most part work had to do with big data and data mining in some cases take home projects are given to assess your candidacy", "Interview Questions": "How do you run market basket on an unsupervised model "}, {"date": "12 Sept 2018", "title": "Senior Academic Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at University of Minnesota (Minneapolis, MN) in Sept 2018", "Interview Descriptions": "Phone Interview, then a first round interview with a panel. Second Round interview was with the dean and the second half was with a panel of current academic advisors.", "Interview Questions": "My experiences and what I can bring to the department. A lot of typical academic advising questions. "}, {"date": "23 Mar 2022", "title": "Financial Professional Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Minnesota (Minneapolis, MN) in Jun 2018", "Interview Descriptions": "Generally, most departments will have a three step process. First, an hour interview by a committee with a set of questions asked to all applicants. Second, a follow-up interview for only the best applicants. Questions will be more specific and candidates who try to bluff their way through will be discovered. The third will be a final interview with the hiring authority who may make an offer. Realize that the Search Committee will have talked extensively with the hiring authority. References will be contacted between the first and second interviews in many searches. If the candidate is a current or former U employee, personnel records will be checked. There is a free flow of information within the University. A former supervisor is free to divulge literally anything about the applicant.", "Interview Questions": "The University is in the top ten of research institutions receiving federal grants. Most interviews will bring up the applicant’s knowledge and experience of Federal rules and how they are applied."}, {"date": "8 Dec 2020", "title": "Visit Relations Representative-Campus Tour Guide Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at University of Minnesota (Minneapolis, MN) in May 2018", "Interview Descriptions": "The interview was pretty informal and personal. It was relaxed while still professional. They are trying to get a feel of your personality and involvements on campus. It also helps if you’re a good story teller and can elaborate on personal experiences.", "Interview Questions": "What are you involved in on campus?"}, {"date": "9 Sept 2019", "title": "Student Programmer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at University of Minnesota (Minneapolis, MN) in May 2018", "Interview Descriptions": "Interview process is very informal. Not many technical questions, only questions about experiences and interests in order to find a project you will enjoy. However, you must be sure that the project you are assigned to is one that you will enjoy because I spent the whole summer working on only one project.", "Interview Questions": "What area of Computer Science are you interested in?"}, {"date": "11 Jul 2019", "title": "Postdoctoral Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at University of Minnesota (Minneapolis, MN) in Apr 2018", "Interview Descriptions": "The interview was held at PI's office. It was a relaxing and inspiring process, in which I was given enough time to explain my desires and needs. All the discussion and negotiation process went smooth and straightforward. Both of us feel efficient during the interview process.", "Interview Questions": "What is your career goal? "}, {"date": "6 Mar 2021", "title": "Researcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of Minnesota (Minneapolis, MN) in Feb 2018", "Interview Descriptions": "The interview was really easy. It was mostly about the background knowledge and past jobs. Ver easygoing people and flexible with time. They usually get back to you within a week. It is good to be able to relate to the job you are applying for and talk about what makes you a good candidate.", "Interview Questions": "Tell me about your previous job"}, {"date": "11 Jan 2018", "title": "Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Minnesota", "Interview Descriptions": "phone interview first, followed by 2 in-person interviews on separate days with various members of the team/management going over job description and skills assessment. followed by offer letter presented through the HR department", "Interview Questions": "availability"}], [{"date": "23 Oct 2018", "title": "Admissions Counselor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "The process took 4 weeks. I interviewed at University of Minnesota in Jan 2018", "Interview Descriptions": "I had a phone interview which went well, then an in-person interview with two managers who were in town. Considering I drove an hour to meet them, spent 4 hours putting together a presentation, and paid $20 to park for this interview, I would have appreciated some follow up, even if it was just to tell me I didn’t get the job. There was no communication after that point.", "Interview Questions": "How would you recruit students from a warm weather climate to a school like Minnesota?"}, {"date": "20 Sept 2018", "title": "Study Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at University of Minnesota (Minneapolis, MN) in Dec 2017", "Interview Descriptions": "Two in-person interviews. The first interview was with my direct supervisor and the second was with her direct supervisor. They both lasted approximately 30 minutes. I offered to drive to Minneapolis for both interviews. The interview process was pleasant.", "Interview Questions": "Are you more of an independent worker or do you like to work with a team?"}, {"date": "15 Oct 2017", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at University of Minnesota", "Interview Descriptions": "Very informal, just wanted to get to know who I was. Asked basic behavioral questions but did not seem to worried about my ability to complete the job. I was referred, this may be why they seemed extra lenient. Overall, very good experience.", "Interview Questions": "How do you deal with stressful situations?"}, {"date": "4 Jan 2021", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Minnesota (Minneapolis, MN) in Oct 2017", "Interview Descriptions": "The Interview was straightforward and track-record oriented. I had to demonstrate skills on site, took a test, had one on one interview, an audition. A very  comprehensive experience. I also had the opportunity to meet the peers that are already working there.", "Interview Questions": "Q: What is a strength of yours?"}, {"date": "25 Sept 2017", "title": "Business Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of Minnesota", "Interview Descriptions": "applied online ..... they took long time to get back to me for the interview. the interview took hours overall. they are not organized asking same questions. I don't know what is the point of meeting such a big group for a small position.", "Interview Questions": "- your strengths\r\n- your weaknesses\r\n- how do you manage projects\r\n"}, {"date": "16 Sept 2017", "title": "Intern Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of Minnesota", "Interview Descriptions": "basic questions. between 3 to 5 people interviewing you and through out the whole time they were trying to make me feel comfortable and  keep the interview going. nice environment", "Interview Questions": "like where do you see yourself in 5 years"}, {"date": "15 Aug 2018", "title": "Student Office Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Minnesota in Sept 2017", "Interview Descriptions": "Applied online and heard back directly from the hiring manager within 2 weeks for an interview. The interview was standard for a student position focused on your academic interests, future career goals, skills you are looking to gain, etc.", "Interview Questions": "What is your major and what do you intend to do with your degree?"}, {"date": "6 Jul 2021", "title": "Student Library Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at University of Minnesota (Minneapolis, MN) in Aug 2017", "Interview Descriptions": "They are relaxed and easy going. Asked very general interview questions. They are very responsive and look to connect with you. Be prepared to have general answers during the interview process.", "Interview Questions": "How well do you work independently ? "}, {"date": "20 Oct 2018", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at University of Minnesota (Minneapolis, MN) in Jun 2017", "Interview Descriptions": "Pretty formal. Wear business casual. Smile and appear interested in the position. The hiring manager might have one other person in the room with you. You can expect basic interview questions.", "Interview Questions": "What is one of your weakness?"}, {"date": "21 Jan 2020", "title": "Postdoctoral Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at University of Minnesota (Minneapolis, MN) in May 2017", "Interview Descriptions": "One day interview process including meeting with faculty/grad students and postdocs, within and outside the department. You are expected to give a one hour seminar on your PhD work. Meetings involve your expectations about the job and what you can deliver.  They are also interested in long term plans.", "Interview Questions": "What are my long term plans?"}], [{"date": "25 May 2017", "title": "Security Analyst Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Minnesota (Minneapolis, MN) in May 2017", "Interview Descriptions": "In-person, group interview. I was provided with a couple of technical questions that lacked context. The team seemed incredibly paranoid about discussing their environment. I don't know anyone that would take a job without knowing what the environment is like beforehand. Eventually I was able to figure out the job was just looking at logs all day, rather than developing and testing security solutions as claimed by the job description.\r\n\r\nAlmost all of their questions were stereotypical of an interview: \"How do you work with others?\", \"How do you deal with conflict?\", \"Give me an example of a time when you X or Y.\" It reminded me of the interviews I would have back in high-school when working as a cashier, retail associate, etc.", "Interview Questions": "<given a sheet of paper with some context-less data>\r\n \"Tell me from a security perspective what is wrong with this?\""}, {"date": "20 Apr 2017", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of Minnesota", "Interview Descriptions": "The interview was simple just like any student worker interview would be. Especially for a position as easy and common sense full as this one. the manager was interested in learning about me as a person and not just as an employee", "Interview Questions": "what my goals were as a studen"}, {"date": "10 Apr 2017", "title": "OpenVMS Systems Admn Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at University of Minnesota (Minneapolis, MN)", "Interview Descriptions": "The interview I had was an ambush.  A room full of interviewers and me.  I would have handled the interview better from my perspective by informing my host that it would not be my way of inviting a guest into my \"home\".", "Interview Questions": "It was the questions that did NOT pertain to the job discription that were \"out of taste\"."}, {"date": "20 Jun 2017", "title": "Communications Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Minnesota (Minneapolis, MN) in Mar 2017", "Interview Descriptions": "It was very hectic and was late to start. I felt like I did less talking than the interviewer and as it was only scheduled for a half hour, I left feeling like I knew very little about the position. I was disappointed that the hiring person never followed up as to the job progress even after I emailed more than once. I'm not even sure the position was ever filled.", "Interview Questions": "Why do you want to work here?"}, {"date": "18 Mar 2018", "title": "Software Engineer(Internship) Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at University of Minnesota (Minneapolis, MN) in Mar 2017", "Interview Descriptions": "I applied online, then I got an email to schedule an interview. I met with the  two managers, and we went through my resume and talked about if my experience fits the job. It was about half an hour.", "Interview Questions": "how to manage time when you have conflict tasks"}, {"date": "31 Aug 2018", "title": "Academic Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Minnesota (Minneapolis, MN) in Feb 2017", "Interview Descriptions": "I submitted my resume and cover letter directly to the hiring manager after being informed they were looking for additional tutors in my field of study. I was contacted by the hiring manager and asked to come in for an interview. I interviewed in person with only the hiring manager. It was professional yet relaxed, and we had a good conversation. He offered me the position by the end of the interview, which lasted approximately 30 minutes.", "Interview Questions": "Explain to me, who knows nothing about engineering, the basic concepts of statics, as if I were a student taking the course and needing help."}, {"date": "27 Dec 2018", "title": "Student Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at University of Minnesota (Minneapolis, MN) in Feb 2017", "Interview Descriptions": "The interview process was very relaxed. It comprised of a few competency questions that involved dealing with upset customers and your reactions. It was easy-going and the response time was quick.", "Interview Questions": "Name a time that you had to deal with an upset customer and how did you deal with it?"}, {"date": "27 Dec 2017", "title": "Administrative Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at University of Minnesota (Phila, PA) in Feb 2017", "Interview Descriptions": "Lengthly, took several steps to get to meet the hiring manager. Phone screening was pretty tough. Overall it was pretty interesting to go through the process I had to. I would reccomend trying the process for experience in doing such", "Interview Questions": "What is your weakness"}, {"date": "28 Jan 2017", "title": "4-H Program Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at University of Minnesota (Rochester, MN)", "Interview Descriptions": "Initial interview with Youth Development Office on campus. Then with the county needed the position presented a 15 min PP on how to grow progam. Finally answered 12 questions from a panel of community and staff involved with local 4-H", "Interview Questions": "What would you do if a child was going into the show ring not standing next to an adult handler as required?"}, {"date": "13 Feb 2017", "title": "Business Systems Analyst Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Minnesota (Minneapolis, MN) in Jan 2017", "Interview Descriptions": "Phone interview was conducted by a person with terrible accent. Could not understand the questions he asked. I had to ask him to repeat the questions 4 times, then I just started guessing.  Requested another phone interview. The group panel was OK. The questions asked could be found online.", "Interview Questions": "Describe how you work on a project"}], [{"date": "13 Jun 2017", "title": "Assistant Accountant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of Minnesota (Minneapolis, MN) in Dec 2016", "Interview Descriptions": "Very casual. I was brought to the office of my soon to be manager where her and another of my bosses asked me questions. I then was given a workplace tour and got to talk to different employees. They then brought me back to the office and basically said they would hire me and told me what paperwork I needed to fill out.", "Interview Questions": "What else are you involved in on campus?"}, {"date": "20 Jul 2018", "title": "IT Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at University of Minnesota in Dec 2016", "Interview Descriptions": "Phone interview was given by the student first then in person interview was given by the manager.\r\nThe phone interview was more about information.\r\nThe inperson one is some how tricky. They asked me what if customer found that they cant open facebook page. Or what if they found their chrome frozen", "Interview Questions": "if you have a baby elephant how will you decorate it during the Halloween\r\n\r\n"}, {"date": "8 Dec 2016", "title": "Assistant Professor of History Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at University of Minnesota (Minneapolis, MN) in Dec 2016", "Interview Descriptions": "I had a campus interview that was preceded by an interview via Skype. In both I had to account for my current and future research interests, broader trends in the field in which I was situated, as well as classes I would teach at the undergraduate and graduate level.", "Interview Questions": "What kind of classes could you envision teaching in the History department?"}, {"date": "15 Mar 2018", "title": "Graduate Studies Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at University of Minnesota (Minneapolis, MN) in Dec 2016", "Interview Descriptions": "It was very informal, really it had more to do with the professors you knew and the courses you were taking. The job was created as a way to give experience to current students, not necessarily to overload them with menial tasks.", "Interview Questions": "How would this position help further your knowledge of your studies or your success as a student?"}, {"date": "8 Nov 2016", "title": "Desktop Support Professional - OIT Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Minnesota", "Interview Descriptions": "The hiring process was very slow.  It took them over two months to respond to my application. You need to look perfect on paper for them to even consider you.  I thought my interview went very well, but wasn't offered the position.", "Interview Questions": "What is your biggest weakness?"}, {"date": "18 Oct 2016", "title": "Office Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at University of Minnesota (New York, NY)", "Interview Descriptions": "In person interview that was very basic.  Asked questions that are easily found off the internet about different behavioral situations.  Answer in STAR form.  Lasted around 45 minutes at the most.", "Interview Questions": "Tell me about your strengths and weaknesses?"}, {"date": "26 Sept 2016", "title": "Academic Technology Support Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Minnesota (Minneapolis, MN)", "Interview Descriptions": "The HR recruiter arranged a panel interview with about 8 people who worked in the technology department. The recruiter was personable and helpful, but the team manger was a condescending a-hole during the interview who cut me off mid-sentence repeatedly to challenge my credentials. It was so bad I withdrew my application after it was over. I had a much more welcoming interview with another department at the university.", "Interview Questions": "Give an example of a conflict you've had at work and how you resolved it."}, {"date": "13 Aug 2018", "title": "Communications Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at University of Minnesota (Minneapolis, MN) in Sept 2016", "Interview Descriptions": "I applied online and got a response within a day or two to come in for an in-person interview. The interview was with two people from the team. It lasted about 30 minutes. I got an offer two days later.", "Interview Questions": "Tell us a little bit about yourself."}, {"date": "24 Oct 2017", "title": "Parking Lot Attendant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at University of Minnesota (Minneapolis, MN) in Sept 2016", "Interview Descriptions": "Was contacted by the staff and had a quick interview a few days later. Lasted about 10 minutes, asked 3 standard interview questions and then was told we'd be in contact.", "Interview Questions": "Standard interview questions - Imagine a time when you were stressed at work, how did you handle it"}, {"date": "17 Jan 2020", "title": "Office Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at University of Minnesota in Sept 2016", "Interview Descriptions": "The interview was really laid back and conversational. It was mostly a matter of finding someone to fill a certain time spot so it only took one interview and then filling out some paperwork to complete the process. It's a really great job by the way.", "Interview Questions": "Q: Are you available to work the morning shift?"}], [{"date": "4 Aug 2017", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at University of Minnesota (Minn City, MN) in Sept 2016", "Interview Descriptions": "Had a phone interview initially lasting for 15 minutes. Then was called in for an in-person interview which lasted for 30 minutes. Took about 2 weeks to hear back from them with a job offer.", "Interview Questions": "Tell me about your experience with research?"}, {"date": "21 Feb 2017", "title": "Student Athlete Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at University of Minnesota (Minneapolis, MN) in Aug 2016", "Interview Descriptions": "Applied, got an interview within a few days, if you can show you are responsible, respectful and knowledgeable of college level academic topics you should get a call back.  Although when I applied they had specifically sent out emails saying they needed tutors.", "Interview Questions": "Asked me to explain a fake homework question as if the interviewer was a student."}, {"date": "15 Jul 2016", "title": "Postdoctoral Research Associate Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of Minnesota", "Interview Descriptions": "The interview process was a series of Skype interviews as a was in a different country and the PI did not want to pay for travel. Presentations were of work/previous projects - the usual. \r\nThen what the project could look like in this position.", "Interview Questions": "The usual questions of project details"}, {"date": "5 Jul 2016", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at University of Minnesota", "Interview Descriptions": "They were very accommodating. The questions were thorough but fair. It was the longest interview I have had to do, but it helped me get a feel for the kind of work I would be doing in that position.", "Interview Questions": "Name two strengths you wish you had."}, {"date": "15 Aug 2016", "title": "Accounting III Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at University of Minnesota (Saint Paul, MN) in Jul 2016", "Interview Descriptions": "A panel interview with four people.  They all very nice and making the interview process goes very smooth.   They explain about the role and expectation of this job.  They also take me for a tour of the department.  Everyone there seems very nice.", "Interview Questions": "What you like and dislike about your current job?\r\nWhat is your long-term goal?\r\nDo you have experience in grant accounting experience; excel spreadsheet, other computer programs?\r\nExplain your biggest accomplishment?\r\nExplain a time when you handle stress? \r\n"}, {"date": "30 Aug 2016", "title": "Computer Support Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at University of Minnesota (Minneapolis, MN) in Jul 2016", "Interview Descriptions": "2 interviews, initial interview was pleasant and the interviewers were friendly and easy to get along with. \r\n2nd interview introduced the hiring manager. He was not as friendly - made me very uncomfortable, did not laugh or smile, and presented as very condescending and unpleasant. \r\nFirst interview were very general questions about your personality and work experience. Second interview, they had a computer that they wanted you to set up and trouble shoot. The issue ended up being that one of the sticks of RAM were bad, however the computer gave no beep codes when starting up that would indicate this. \r\nThe computer was also a new design which I had not seen before - was very difficult to take apart and then put back together with everyone watching you.  Definitely the worst interview experience of my life, and I left feeling badly and pretty humiliated - the hiring manager's attitude towards me did not help at all. After that, I would not have wanted to work there even if the job was offered to me. \r\nI was sent a letter via snail mail stating that they were not offering me the position.", "Interview Questions": "Describe a time you experienced positive and negative customer service\r\nSituational questions ie. You have to deal with a crisis but are stopped by a coworker who needs help - what do you do?\r\nWhat experience do you have with Mac computers\r\nHow would you stop a program from launching on start up?"}, {"date": "23 Mar 2017", "title": "IT Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at University of Minnesota (Minneapolis, MN) in Jun 2016", "Interview Descriptions": "Very long at least 3 months with 3 phases ( 1 survey, 2 face to face) and another face to face with the VP of IT. applied for the job then got a competency survey and after was called for 1 round of interview and 2nd round and then after meeting with the IT VP", "Interview Questions": "Tell us about a time you have to convey technical information to a non-technical audience"}, {"date": "26 Aug 2016", "title": "Graduate Student Researcher Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at University of Minnesota (Minneapolis, MN) in Jun 2016", "Interview Descriptions": "The hiring process was quick and professional. I met the senior researcher, PI and human resources person for the onsite interview. The interview last about an hour. However, this depend on your lab, PI and department.", "Interview Questions": "They asked about my background, research interest. It is mainly to see if you are a good fit for the position"}, {"date": "15 Dec 2017", "title": "Finance Professional II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at University of Minnesota in Jun 2016", "Interview Descriptions": "2 interviews. First one more general, second interview deals with problem solving and listing of professional accomplishments. Interview process was very organized and the hiring manager was helpful in communicating needs of the role", "Interview Questions": "How do you deal with working in a diverse environment?"}, {"date": "17 May 2016", "title": "IT Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Minnesota (Minneapolis, MN)", "Interview Descriptions": "After completing a questionnaire I was asked to come in for an interview.  The first qualification should be your requested salary before they send you their questionnaire. This would be more practical and could potentially save the candidate and the interviewers time if salary didn't fit within the budget.  I was interviewed by two managers and an office manager. The interview process was polite and their were no technical questions asked. They stressed diversity in the questionnaire as well as the interview.", "Interview Questions": "Diversity is very important here at the U, how would you continue to foster diversity..."}], [{"date": "10 Jan 2017", "title": "Student Graphic Designer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at University of Minnesota (Minneapolis, MN) in May 2016", "Interview Descriptions": "Interviewed by Alumni Relations Director and Marketing Director, they are super fun, nice and casual about it. They know you are a student so they aren't too harsh on you but you should be prepared to answer questions relating to why the rec is important to you and what kind of message you want to get out on campus.", "Interview Questions": "Why do you want to work at the Rec"}, {"date": "31 Aug 2017", "title": "Office Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of Minnesota (Minneapolis, MN) in May 2016", "Interview Descriptions": "Extremely easy to set up and meet with the interviewer. Just had to apply online. No back channels or anything. Told me what was expected of me at the interview. Initial phone interview and then an in person interview. They ask about your personality and work style.", "Interview Questions": "How do I work in a team environment."}, {"date": "12 Oct 2016", "title": "Project Manager Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at University of Minnesota (Minneapolis, MN) in Apr 2016", "Interview Descriptions": "The person who called me for the interview did not state the job title. This was confusing for me because I had applied for several positions. When I called back to ask, she gave a job title for a position I had never applied to. It was difficult for me to prepare for the interview without seeing a job description.", "Interview Questions": "How would your current experience help you succeed in this role?"}, {"date": "1 Apr 2016", "title": "Postdoctoral Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at University of Minnesota", "Interview Descriptions": "In the interview, you need to give (1) a presentation of the previous work and then have (2) discussions about the research projects you need to participate. They will introduce the background knowledge of the projects, and ask some technical questions related to the projects.", "Interview Questions": "the questions focused on the research projects I have conducted."}, {"date": "28 Mar 2016", "title": "Postdoctoral Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 1 day. I interviewed at University of Minnesota (Minneapolis, MN)", "Interview Descriptions": "One hour departmental seminar, describing my current research and outlining my interest in the department (45 minutes talk plus 15 minutes for questions). The seminar was followed by the full day conversations with senior lab members and principal investigator, typically between 30-45 minutes per person. Contacted the PI a fortnight after the interview, and got the offer soon afterwards.", "Interview Questions": "Specifics relating to my research"}, {"date": "2 Mar 2016", "title": "Senior Office and Administrative Specialist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Minnesota (Minneapolis, MN)", "Interview Descriptions": "The first step is a brief phone interview to confirm availability and interest in the position after a brief discussion of job duties and pay range. Next, a 1:1 interview with the hiring authority is completed where more information about the position is provided along with information about the culture and day-to-day business. Finalists are invited back for group interviews with 3-5 people from the unit. My group interview included key stakeholders who would interact frequently with the position. I found that only one of the four people in my interview was adequately prepared. The most senior member in the interview hadn't looked at my application materials and asked me irrelevant questions like why I had left my previous positions in less than one year. It was documented that all of my positions save one had been held for 2-3 years and only terminated because of relocation. The most recent position had been a temporary contract position that I held for the six months leading up to my application to the University.", "Interview Questions": "Describe your process for dealing with a difficult client or dissatisfied customer."}, {"date": "18 Feb 2016", "title": "Graduate Student Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at University of Minnesota", "Interview Descriptions": "I was admitted as a graduate student. I did not undergo an interview per se. This review is not applicable to my situation. Staff matched me to research assistant and teaching assistant positions every semester and there was no interview. I have nothing I can put in this space. I can see how this form would give valuable insight into most employment situations, but not this one.", "Interview Questions": "N/A"}, {"date": "18 Apr 2016", "title": "Research Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Minnesota (Minneapolis, MN) in Feb 2016", "Interview Descriptions": "I got a call to schedule an interview from the lab PI about two months after I applied for the job, and interviewed the next week. Then I was asked to supply my references and once those got to the PI he offered me the job the next day.", "Interview Questions": "What did you do when you were in a situation where you hated the person you had to do work with?"}, {"date": "8 Feb 2016", "title": "Postdoctoral Position Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at University of Minnesota (Austin, MN) in Feb 2016", "Interview Descriptions": "3 PIs and 1 HR officer conducted the interview. Got asked about my technical skills, academic performance, possible start dates and relationships with lab members.\r\nSince I did my PhD in developmental biology lab and the job was in a cancer research lab, I got asked why do I want to make the switch. Further to this the PI asked if I had read his publications.", "Interview Questions": "Do you get along with your lab member?"}, {"date": "25 Jan 2016", "title": "Payroll Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at University of Minnesota (Minneapolis, MN)", "Interview Descriptions": "Sit down in the office and answer formal questions. It was a very relaxed feel and I felt comfortable in their office. They closed doors, so that it wasn't in a cube setting. The questions were written down on a sheet of paper and she didn't write down any answers. There was no desk between us.", "Interview Questions": "What are your strengths?"}], [{"date": "1 Apr 2016", "title": "Business Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 months. I interviewed at University of Minnesota (Minneapolis, MN) in Jan 2016", "Interview Descriptions": "It took several weeks to hear regarding this position (as with many of the roles at the University of Minnesota).  After hearing from the group, it took a couple of weeks to set up an interview for the position, but for this role there was only 1 interview - a group panel.", "Interview Questions": "Tell us about how you approached a project and your results"}, {"date": "23 Oct 2016", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Minnesota (Minneapolis, MN) in Jan 2016", "Interview Descriptions": "Pretty easy process, there was a panel that interviewed me and then on to the Faculty advisor.  They let me know pretty quickly if I got the job, and I got a sense in the room that it was going well.", "Interview Questions": "Why do you want to work here"}, {"date": "13 Jan 2016", "title": "Human Resource Generalist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at University of Minnesota (Minneapolis, MN) in Dec 2015", "Interview Descriptions": "A pool of over 50 applicants. I was an internal candidate, considered valuable to my department. Almost 6 months after position was posted, got phone interview. Many, many weeks later, panel interview with 6 people with 3 missing so I'd have to interview with them separately. Next day job was re-posted (for better pool). Learned in passing that in less than 3 weeks, they hired someone.", "Interview Questions": "N/A"}, {"date": "3 Jan 2016", "title": "Medical Writer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at University of Minnesota (Minn City, MN) in Dec 2015", "Interview Descriptions": "General Interview with question related to job, The overall interview was good however not a very good fit. I would look to see if there were other opportunities as well that better fit my experience.", "Interview Questions": "Why do want to work for UM?"}, {"date": "28 Oct 2016", "title": "PhD Graduate Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 1 day. I interviewed at University of Minnesota (Minneapolis, MN) in Dec 2015", "Interview Descriptions": "It was October 2015, I was applying for PhD Graduate Schools. I emailed a Computer Science research lab that I was interested in and asked the PI if it's possible to schedule a meeting with him. The PI replied me quickly and we scheduled a meeting the following week. He was very satisfied with my resume. I expressed my interest working for the lab the following spring semester and my interest in becoming a PhD student in the lab.\r\nHe told me he would keep an eye for my application when it came in but that he can't promise anything at that time. However, around December he told me there shouldn't be any problem letting me in!", "Interview Questions": "Whtat's my past research experience"}, {"date": "20 Nov 2015", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 2 weeks. I interviewed at University of Minnesota (Minneapolis, MN)", "Interview Descriptions": "Easy process. Open communication. Felt comfortable at the end of the interview whether I had the job or not. Emails with questions were returned more slowly than I would have wished by the recruiter after an offer was made.", "Interview Questions": "Tell me about your experience and why you feel you are qualified for this position."}, {"date": "27 Jul 2016", "title": "Communications Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at University of Minnesota (Minneapolis, MN) in Nov 2015", "Interview Descriptions": "It was a first interview with four people from several departments that interact with the position. They asked two questions each. They were good, thoughtful questions. They told me they would let me know either way about a second interview but they never did. I emailed a month later and was told the position had been filled.", "Interview Questions": "How do you get along with editors?"}, {"date": "6 Nov 2016", "title": "Case Management Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at University of Minnesota (Minneapolis, MN) in Nov 2015", "Interview Descriptions": "I applied online and about a week later I received an email asking to set up an interview. Interview took place over the phone since I lived abroad. Needed to complete a second interview so another person could ask me questions. But on the first interview, they asked what they needed to do to get me there.", "Interview Questions": "Why do you want to work here?"}, {"date": "19 Dec 2017", "title": "Researcher I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. I interviewed at University of Minnesota (Saint Paul, MN) in Nov 2015", "Interview Descriptions": "They were very flexible (I was briefly living out of state when I interviewed for this position). It was fairly informal with the faculty I would be working with and with the head of the experiment station I'd be located. I had an on campus interview and one at the experiment station.", "Interview Questions": "How long are you wanting to stay in your next position?"}, {"date": "25 Nov 2018", "title": "Community Advisor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 3 weeks. I interviewed at University of Minnesota (Minneapolis, MN) in Nov 2015", "Interview Descriptions": "After the workshop, you may or may not be asked for an interview.  They ask mostly about how you would handle certain situations or what you have done in the past.", "Interview Questions": "What was a time you disagreed with someone of superior position and what did you do?"}], [{"date": "7 Oct 2015", "title": "PhD Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at University of Minnesota (Minneapolis, MN)", "Interview Descriptions": "Interview weekend involved meeting with three faculty members of your choice along with social events with the current graduate students. We were given a tour of the facilities at the campus and a seminar by the faculty describing their key research areas.", "Interview Questions": "Why are you interested in joining UMN? Which particular faculty's work interests you? Describe your previous work experience?"}, {"date": "23 Feb 2018", "title": "Program Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at University of Minnesota (Saint Paul, MN) in Oct 2015", "Interview Descriptions": "First interview was at the main campus, second interview at county office.  Group interview for both interviews.  Had to do a presentation to the interviewing panel.", "Interview Questions": "There was a presentation you had to present to 3-10 people."}, {"date": "1 Oct 2016", "title": "Software Developer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 1 day. I interviewed at University of Minnesota (Minneapolis, MN) in Sept 2015", "Interview Descriptions": "Unprofessional, Didn't seem to care. Went on for a while but was just them trying to fill up space in the interview. Just like I am for this review no one cares about.", "Interview Questions": "Why do you want to work at the University of Minnesota."}, {"date": "20 Apr 2016", "title": "Junior Scientist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of Minnesota (Minneapolis, MN) in Sept 2015", "Interview Descriptions": "Applied for the job online, was emailed a pre-interview questionnaire with technical questions about the job. Based on my answers, I was invited for an interview. Interview was a panel with 3 people who asked questions from a list and wrote my answers. The interview took about an hour. Following the interview, I received an email that said \" Your interview went well and we are considering hiring you for one of our two position. We would now like to ask you for references.\". My references let me know that they were indeed contacted and gave good reviews. 10 days after the reference request, I got an email from the director apologizing for the delay and telling me (\"Dear Interviewee\") that the department had received another grant and that dealing with it was causing some delay in hiring for this position, but soon they would be able to refocus on hiring and he would keep me posted. Never heard from these people again after that email. No rejection, no response either way. I felt like this was a huge waste of my time and I wish they didn't bother my references if they weren't serious about hiring me. I would be wary of ever interviewing with this organization again.", "Interview Questions": "Describe your previous experience using MRI machines."}, {"date": "11 Aug 2015", "title": "Research Fellow Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at University of Minnesota (Minneapolis, MN)", "Interview Descriptions": "Interview with principal investigator and professors funding the research. Typical interview, lasted one hour. Offer was made on the spot. I had to deliver two research presentations. One presentation was made to a group of professors and lab principal investigators. The second presentation was made to a group of graduate school students.", "Interview Questions": "Questions were about my previously published work."}, {"date": "31 Jul 2015", "title": "Administrator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at University of Minnesota (Minneapolis, MN) in Jul 2015", "Interview Descriptions": "This was for the position to be the division administrator for Gastroenterology, Hepatology and Nutrition. Applied online and got an interview. It was a panel interview with HR, current GI physician, two different administrators and the interview only lasted about an hour or so. I was told there are three rounds total. Second round is with more people and final round is with the department head. I didn't get invited to move forward. My experience is only with first round of interviews. The questions were all situation based. More on team building and very high emphasis on problem solving. All types of problems: people, technology, grant etc. be prepare to come in with examples of how you solve problems.", "Interview Questions": "Tell me about your grant experience"}, {"date": "29 Jul 2015", "title": "Principal Accounts Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at University of Minnesota (Minneapolis, MN) in Jul 2015", "Interview Descriptions": "The interview process was about 45 minutes long in a conference room.  This was a one on one interview and a fairly casual and laid back event.  The interviewer was very kind and conversational.  They ended up hiring another candidate but I appreciated that they got back to me (other people might disagree).  I thought I was in the running for the position and I know they called one of my references.", "Interview Questions": "How would you handle a difficult co-worker?"}, {"date": "12 Dec 2016", "title": "Brand Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of Minnesota (Minneapolis, MN) in Jun 2015", "Interview Descriptions": "I was asked to give a presentation on my experience within my field, and then was asked a series of follow up questions regarding my experience and ideas I had for the position's strategy.", "Interview Questions": "Who do you think our most important audiences are?"}, {"date": "19 Oct 2015", "title": "Info Tech Professional Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at University of Minnesota (Minneapolis, MN) in Jun 2015", "Interview Descriptions": "they had a group to see if I would fit the feel of the group, then group for technical knowledge with a white board demo of past work that I had done", "Interview Questions": "Show samples of work"}, {"date": "14 Nov 2016", "title": "Business Systems Analyst Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at University of Minnesota in May 2015", "Interview Descriptions": "LONG. THe interview process, like most processes at the university, is incredibly slow. Expect it to take at least a month from being offered an interview to being offered a job.", "Interview Questions": "What is your biggest weakness?"}], [{"date": "27 Jun 2016", "title": "Programmer Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at University of Minnesota (Minneapolis, MN) in May 2015", "Interview Descriptions": "Nightmarish website. The usual nonsense of having to answer endless questions already answered in your resume. Terrible web interface. Best advice - copy and paste the requirements into the job answers so that all the keywords are picked up by the computer, otherwise it will throw away your application unread. How I got through the preliminary process to get an interview I'll never know.", "Interview Questions": "Name a problem you had on the job and how you addressed it."}, {"date": "3 Apr 2015", "title": "Student Residence Hall Director Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of Minnesota (Morris, MN)", "Interview Descriptions": "You must be working for the residential life already as a Community Advisor.  You get offered the chance to apply during the latter half of the fall semester. You need to fill out the online application.  Once filled out, you will be prompted to sign up online for an interview time during winter training for current community advisors.  You are given around 45 minutes for an interview.  It is possible to finish the interview in 20 minutes.  Expand on your answers using past experiences working in residential life.  Once the interview is complete, you will be asked if you have any questions about the role.", "Interview Questions": "How would you identify a communication breakdown on your staff and how would you rectify it?"}, {"date": "3 Aug 2016", "title": "Communications Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 5 days. I interviewed at University of Minnesota (Minneapolis, MN) in Apr 2015", "Interview Descriptions": "A full time position was created for me because I showed that I was invaluable as a student intern. I still had to submit my resume, cover letter, and work samples and proceeded with an interview with my supervisor. The entire process took about a week until I received a phone call with a job offer.", "Interview Questions": "Define diversity and explain ways in which you design and communicate to a diverse audience. "}, {"date": "16 May 2019", "title": "Campus Tour Guide Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 3 weeks. I interviewed at University of Minnesota in Apr 2015", "Interview Descriptions": "I went to a walk in interview for the position after submitting a resume. The interview was a combination of a one on one and a group (2 or 3 interviewers).  I was then notified by email and phone call that I had received the position.", "Interview Questions": "Describe a time you had to calm down someone who was upset and angry. "}, {"date": "20 Jul 2015", "title": "Usability Lab Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at University of Minnesota (Minneapolis, MN) in Mar 2015", "Interview Descriptions": "The interview process was pretty simple. The questions didn't seem difficult and were only asked to assess schedule and interest fit. As a student interested in pursuing the field of technical communications and usability, it seemed as if they were inclined to give me the job based on my appreciation for the position.", "Interview Questions": "What do you hope to get out of this position?"}, {"date": "19 Oct 2015", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at University of Minnesota in Mar 2015", "Interview Descriptions": "By far the most difficult and intimidating interview I have ever had. Panel of other office employees and hiring representative asked several very challenging questions without revealing much about the position. Very organized and very to the point. Committee also did not give away if the answers given were to their liking or not. Interview process with more than one interview.", "Interview Questions": "What types of managers do you not work well with? When has your confidentiality been tested?"}, {"date": "12 Feb 2018", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Minnesota in Feb 2015", "Interview Descriptions": "I talked to my advisor, Dr. Bin He. He asked for my resume, and we talked about my past research experience. After the conversation, he asked me to give a short presentation during a lab meeting", "Interview Questions": "How does your experience translate to this position?"}, {"date": "5 Sept 2018", "title": "Bookstore Clerk Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at University of Minnesota (Minneapolis, MN) in Jan 2015", "Interview Descriptions": "Very easy, basic questions. Got the interview because I knew a girl who works there and she recommended me. Asks about prior experience in retail, your availability and other things along that line.", "Interview Questions": "Describe your previous retail experience"}, {"date": "19 Oct 2016", "title": "Smart Learning Tutor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at University of Minnesota (Minneapolis, MN) in Jan 2015", "Interview Descriptions": "Took me to a room and asking several behavior questions, especially on the past experience related to tutoring. She also asked me how this position can help me achieve my career goal. What are the classes you have taken. Do you have any questions?", "Interview Questions": "How much do you know about smart learning?"}, {"date": "16 May 2019", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Minnesota (Minneapolis, MN) in Jan 2015", "Interview Descriptions": "I had a phone interview followed by an in person interview with the PI two days after submitting my application. The interview process was standard, with the PI asking about my previous experience, my research interests, and my experiences with software/analysis.", "Interview Questions": "What software packages have you used for statistical analysis?"}], [{"date": "8 Nov 2016", "title": "Customer Service Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at University of Minnesota (Minneapolis, MN) in Dec 2014", "Interview Descriptions": "Very quick and easy. Very nice manager who asked personal life questions basically to see if you fit in with the other staff and students who work there.  Took maybe 10 minutes and you'll start training as soon as you are available for it.", "Interview Questions": "Asked about retail experience."}, {"date": "29 Oct 2014", "title": "Community Program Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at University of Minnesota", "Interview Descriptions": "The process took about 5 weeks. I applied online and got a call about two weeks after. Went through two in-person interviews. The first one was with three supervisors, who I would be working under if I was to get the position. The second interview was with a PI and one of the supervisors from the first interview.", "Interview Questions": "N/A"}, {"date": "7 Oct 2014", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at University of Minnesota", "Interview Descriptions": "Was lucky to have a connection for the position. I submitted by application and interviewed within the next 2 weeks and was notified of my hire within the next week. Quick turn-around.", "Interview Questions": "How would you use what you've learned and apply it to this position?"}, {"date": "11 Jan 2017", "title": "Extension Educator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at University of Minnesota (West Saint Paul, MN) in Oct 2014", "Interview Descriptions": "Recieved a phone call for a time to interview. Interviewed in front of 7 people and had to do a 10 minute presentation. There were University of MN staff and local county commissioners.", "Interview Questions": "What populations are high needs for financial education?"}, {"date": "3 May 2016", "title": "Systems Administrator Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at University of Minnesota (Minneapolis, MN) in Sept 2014", "Interview Descriptions": "Two interviews; one with a cross-team panel and one with management. The cross-team panel included engineers, designers and project managers, and seemed more like a screening for vetos. \r\n\r\nThe management interview more like an in-depth \"here's what we're doing here - are you interested?\" conversation, with a look to the future, which was great.\r\n\r\nOne weird thing was that the hiring manager, who was part of the cross-team interview, seemed to have almost nothing to do with the actual work. That might be part of the management structure at the U, but it caught me off-guard.", "Interview Questions": "Why are you looking to move to a more technical position?"}, {"date": "24 Feb 2016", "title": "IT Professional Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Minnesota (Minneapolis, MN) in Sept 2014", "Interview Descriptions": "The application and phone interview process was normal. The interview itself went well and I received several compliments. It appears they were unprepared and did not read all of my resume. They were just going through the whole file as they interview progressed. As soon as the noticed I was veteran they came very distant, curt, and wrapped up the interview.", "Interview Questions": "The standard HR and IT questions. "}, {"date": "22 Mar 2016", "title": "Honors Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at University of Minnesota (Minneapolis, MN) in Sept 2014", "Interview Descriptions": "Students are initially recruited through emails from administrative staff. Generally, sophomore, junior, and senior honors students are recruited for research. Moreover, a list of projects, the professors involved, and a description of each project are provided to all applicants. All participants needed to do was write a statement indicating your interest in different research projects, and attach one's resume.", "Interview Questions": "Why are you interested in the projects you chose?"}, {"date": "11 Aug 2015", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1+ week. I interviewed at University of Minnesota (Minneapolis, MN) in Aug 2014", "Interview Descriptions": "45-Minute phone interview. The supervisor was very particular about what the job entailed and made it clear the kind of person she need; someone hardworking and with a good attitude. It was very important to her that the peoples hired where not in it only for the money.", "Interview Questions": "Why do you think you would be a good fit for this position?"}, {"date": "14 Jul 2014", "title": "Postdoctoral Research Associate Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 months. I interviewed at University of Minnesota", "Interview Descriptions": "Few letters of recommendations from former mentors qualified me for this position as they were acquaintances with the PI. It took 2 weeks after initial contacts to receive an offer and paperwork from the HR.", "Interview Questions": "N/A"}, {"date": "7 Aug 2015", "title": "Junior Scientist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at University of Minnesota (Saint Paul, MN) in Jul 2014", "Interview Descriptions": "Very simple interview with the lab section head. The questions were very basic personality questions, and was followed by a tour of the lab. I was called within 3 days to inform me that I would be receiving an offer.", "Interview Questions": "What are some qualities that make a good manager."}], [{"date": "29 Jul 2016", "title": "Postdoctoral Associate Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at University of Minnesota (Minneapolis, MN) in Jun 2014", "Interview Descriptions": "The hiring interview consisted only on exchanging emails with potential PI. I think this would be different for each post doctoral positions, and sometimes it required to bring in some funding.", "Interview Questions": "Specific questions about the research project I worked on during my Ph.D."}, {"date": "31 Aug 2016", "title": "IT Professional Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at University of Minnesota (Minneapolis, MN) in Jun 2014", "Interview Descriptions": "Submitted my application through the school's career page and got an invite to an interview a few days later. Interviewed directly with my supervisor where he asked mostly behavioral and \"what would you do in this situation\" type of questions. No technical questions at all.", "Interview Questions": "What would you do if there was an IT problem during one of your classes and no one was around?"}, {"date": "29 May 2014", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. The process took 4 months. I interviewed at University of Minnesota", "Interview Descriptions": "Applied online through official website, talked to future advisor through Skype before coming. My advisor is quite easy-going and didn't have too many questions since I don't speak English as first language. I received offer within 3 months", "Interview Questions": "To what extent do you understand my research area"}, {"date": "26 May 2014", "title": "Graduate Research Assistant PhD Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of Minnesota", "Interview Descriptions": "telephone interview. two professors vs me. questioned about previous research experiences, research interests, how did I know about UofM, long term career goal. very relaxed atmosphere, lasted about 20~30 minutes. get offer letter the next day of the interview.", "Interview Questions": "N/A"}, {"date": "17 May 2014", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of Minnesota", "Interview Descriptions": "Applied through online system. Got an phone interview in 1 month. the phone talk is within 10 mins. Mainly about my previous research experience. The interviewer is pretty nice, no tricky questions, pretty informal talk. I think that the phone interview is mainly about testing my communication skills.", "Interview Questions": "nothing special, previous reseach experience"}, {"date": "9 Nov 2016", "title": "IT Support Staff Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. The process took 1 day. I interviewed at University of Minnesota (Minneapolis, MN) in May 2014", "Interview Descriptions": "Tl;dr: Interview was straightforward, well rounded, and makes you think a little bit before answering. \r\n\r\nAfter getting a call off a resume & cover letter, the interview was scheduled with the department director and another staff member. They were appreciative of me including examples in my application of what I've done in the past for development projects and other initiatives.", "Interview Questions": "What do you think an information technology department should do?"}, {"date": "27 Apr 2014", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at University of Minnesota", "Interview Descriptions": "I was a Masters student when I was asked to apply for an adjunct assistant professor position.  I think I was in the right place at the right time because someone else had just given their notice.  I was offered the position before it was posted online.  It was opened, I applied and the posting was closed.", "Interview Questions": "N/A"}, {"date": "9 Apr 2014", "title": "Radiologic Technologist Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at University of Minnesota", "Interview Descriptions": "Hiring process was quick and easy. Be sure to show up on time, but not too early (10 minutes prior). Be prepared for any question asked, and in return be ready to ask a few of your own questions. Be engaged in the interview, show your interest in the company. Most importantly be yourself!", "Interview Questions": "Explain a time when you and a co-worker had a disagreement. How did it end?"}, {"date": "7 Apr 2014", "title": "Community Program Specialist/Clinical Research Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Minnesota", "Interview Descriptions": "It was a quick and easy interview. Met with my direct supervisor/boss and it was a great way to get to know/feel what to expect from the company.", "Interview Questions": "How comfortable are you using interpreters to obtain research data from patients/subjecst?"}, {"date": "5 Aug 2017", "title": "Customer Relations Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at University of Minnesota (Minneapolis, MN) in Apr 2014", "Interview Descriptions": "Interviews were very straightforward and dealt with working style and general behavioral questions. I met with two of the shift managers  who had very similar questions.  The process took around 5 days for the managers to make their decisions where they chose 10 candidates of a pool of 30.", "Interview Questions": "Describe a time that you had to deal with someone who was frustrated with you regardless of whether or not it was within your control."}], [{"date": "31 May 2015", "title": "Executive Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 3 days. I interviewed at University of Minnesota (Minneapolis, MN) in Apr 2014", "Interview Descriptions": "Series of interviews: phone, first and second interviews. Was contacted unsolicited through Indeed.com and cleared schedule on short notice for on-campus interviews, which took nearly 4 hours total plus a 30-minute phone interview. Brought writing and presentation samples. Studied website for a minimum of 2 hours. The process is lengthy and sometimes you're simply being interviewed for EOE purposes because they already have someone in mind.", "Interview Questions": "Tell us about yourself and why you are interested in the position"}, {"date": "29 Oct 2015", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. The process took 3 weeks. I interviewed at University of Minnesota (Minneapolis, MN) in Apr 2014", "Interview Descriptions": "The job interview process can be lengthy. Being interviewed once and getting a job offer is typically a thing of the past. Today, many companies have an involved interview process starting with screening interviews, followed by in-person interviews, second interviews and even third interviews. The job interview process can be lengthy. Being interviewed once and getting a job offer is typically a thing of the past. Today, many companies have an involved interview process starting with screening interviews, followed by in-person interviews, second interviews and even third interviews.", "Interview Questions": "Tell me about yourself"}, {"date": "6 Oct 2015", "title": "Gopher Chauffeur Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 3 days. I interviewed at University of Minnesota (Minneapolis, MN) in Apr 2014", "Interview Descriptions": "Was referred through a friend who already worked there. The supervisor contacted me to come in for a one on one interview at Boynton Health Services. It was mostly questions behavioral questions and hypothetical scenarios.", "Interview Questions": "How would you handle a situation where you felt a rider was too intoxicated?"}, {"date": "9 Apr 2017", "title": "Instructional Designer Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at University of Minnesota (Minneapolis, MN) in Apr 2014", "Interview Descriptions": "Inperson interview with manager,who was very curt and demanding. They wanted to know if I could stand up to opposition or admonishment, and hold my ground against people who wanted to eliminate my position.", "Interview Questions": "Can you handle angry superiors?"}, {"date": "26 Mar 2014", "title": "Instructor, College of Science and Engineering Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at University of Minnesota (Duluth, MN)", "Interview Descriptions": "I was already familiar with the faculty and was offered the job without an official interview.", "Interview Questions": "None."}, {"date": "20 Nov 2015", "title": "Personal Trainer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 3 weeks. I interviewed at University of Minnesota (Minneapolis, MN) in Mar 2014", "Interview Descriptions": "It was pretty straightforward. I trained through the University of Minnesota the year prior to working at the Recreation & Wellness Center so I knew a lot of the staff already. The interview in-person was a group interview with three people being interviewed as well as three current senior trainers doing the interviews. It was a pretty straightforward interview with questions you could come to expect at any interview.", "Interview Questions": "What are some personal strengths?"}, {"date": "7 Dec 2015", "title": "Undergraduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of Minnesota (Saint Paul, MN) in Mar 2014", "Interview Descriptions": "Filled out an online application and was invited in for an interview within 2 weeks.  Was notified that I received the job within 2 weeks of the interview.  Had to return one more time for lab orientation and training, all paid.  Overall a very easy process.", "Interview Questions": "Do you like bugs?"}, {"date": "17 Nov 2015", "title": "Subject Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at University of Minnesota (Minneapolis, MN) in Feb 2014", "Interview Descriptions": "It was casual and got an offer immediately after the interview. The interviewer took me into his office and we chatted for about 20 minutes. He asked 4 questions regarding the job.", "Interview Questions": "How would you deal with a frustrated student?"}, {"date": "4 Jan 2016", "title": "Editor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at University of Minnesota (Minneapolis, MN) in Feb 2014", "Interview Descriptions": "I met with the direct supervisor, a faculty member, and was offered the job almost immediately. We mostly discussed the job itself, to make sure I knew what was expected.", "Interview Questions": "To their credit, the interviewer was very interested in my long-term goals, asking what I hoped too get out of the job. I always see this as a good sign."}, {"date": "30 Jan 2014", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. The process took 3 months. I interviewed at University of Minnesota", "Interview Descriptions": "Applied to program and selected based on undergraduate academic record", "Interview Questions": "All written questions, no in person interview"}], [{"date": "27 Jan 2014", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. The process took 2 months. I interviewed at University of Minnesota (Minneapolis, MN)", "Interview Descriptions": "Met with the Graduate Program Director. Asked questions on motivation behind pursuing graduate studies.", "Interview Questions": "Nothing too difficult or unexpected"}, {"date": "22 Jun 2017", "title": "Pathology Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at University of Minnesota (Minneapolis, MN) in Jan 2014", "Interview Descriptions": "The interview was very standard, a lot of the process was understanding the position and touring the facilities. My interview was awhile ago, but the person directing the interview found out about me after I missed out on a different position. I thanked the previous interviewer in a follow-up email. A few days later I received an email from my future supervisor, asking to interview in person. We met at the office I would be doing the majority of work at. He explained his position, the duties that had fallen on him after his predecessor left on short notice with very little training, and did a lot of explaining of my duties. He was interested in my career goals, academic schedule, and intellect.", "Interview Questions": "Do you have any questions for me?"}, {"date": "4 Apr 2014", "title": "Administrative Professional Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 months. I interviewed at University of Minnesota (Minneapolis, MN) in Dec 2013", "Interview Descriptions": "I submitted an application in November and didn't hear back until December. The interview process took 2 weeks, but once you hear back, it moves quickly. There are a lot of busy schedule to coordinate. So timing can be difficult. I applied online, did research, reached out via LinkedIn", "Interview Questions": "It takes time to learn and get acclimated to the University. What are you plans here with the university? (i.e. will you stay for the long haul) "}, {"date": "17 Aug 2015", "title": "Parking Attendant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 days. I interviewed at University of Minnesota (Minneapolis, MN) in Dec 2013", "Interview Descriptions": "It took a couple weeks to hear from the hiring manager after I applied online. I was part of a group interview with 3-4 other students. Interview was very relaxed and easy. Stereotypical interview questions. The interview only involved around 5-7 questions since each person had to answer individually.", "Interview Questions": "What is your greatest strength and weakness?"}, {"date": "3 Jan 2014", "title": "Info Tech Professional Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at University of Minnesota (Minneapolis, MN) in Dec 2013", "Interview Descriptions": "There was only one interview. It was with a full professor and two other post-doc graduate students. The interview was very friendly and lasted a little over an hour. Most of the questions were aimed at inquiring about where I see myself being the most effective. A lot of time was spent explaining the nature of the work I would be involved with. They gave no indication at the end about if they were leaning toward hiring me or not.", "Interview Questions": "I found the most difficult question was simply: \"What are your constraints?\" It was harder to think about and answer that than a straight question about greatest weakness or shortcoming."}, {"date": "15 Nov 2013", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at University of Minnesota", "Interview Descriptions": "First an application comparable to other graduate engineering programs. No further feedback until acceptance. Then prospective weekend (fun, boozy).", "Interview Questions": "Resume-based questions from a few profs when most were courting you."}, {"date": "9 Nov 2013", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at University of Minnesota", "Interview Descriptions": "Simply fill out a form of your preference for application. Soon or later when positions are available, you will be contacted and asked if you are still interested in being a TA. The position of which course is highly based on your course grade.", "Interview Questions": "What is a transistor and how it works? (for semiconductor course)"}, {"date": "6 Oct 2015", "title": "Student Accounting Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at University of Minnesota (Minneapolis, MN) in Oct 2013", "Interview Descriptions": "The interview was rather relaxed. My current supervisor had two general sections of the interview, the first related to logistical aspects the second related to fit in the department and how my interests and ambitions align with the role at hand. The interviewer was specifically looking for someone who had a balance of academic ambition and also the desire to experience some of the extracurricular activities the University has to offer.", "Interview Questions": "What activities do you participate in outside of academic work?"}, {"date": "14 Feb 2015", "title": "Department Administrator (Assistant to) Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at University of Minnesota (Minneapolis, MN) in Oct 2013", "Interview Descriptions": "Sent resume and cover letter directly to the department head late in the process. Was asked to a panel interview of 6 people--department head was not one of them. Learned from the HR person that it was more or less a courtesy interview because one of the people on the panel knew me and vouched for me. It was a regretful performance on my part.", "Interview Questions": "Behavioral, panel interview."}, {"date": "27 Oct 2014", "title": "Adjunct Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at University of Minnesota (Crookston, MN) in Sept 2013", "Interview Descriptions": "Fill out online applications and cover letter. The department head called me and we chatted over the phone. He already knew me, but we made an appointment to visit in person anyway at which point he offered me the appointment.", "Interview Questions": "N/A"}], [{"date": "31 May 2016", "title": "Security Monitor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at University of Minnesota (Minneapolis, MN) in Sept 2013", "Interview Descriptions": "I applied for the job online through the school website and got invited to the interview. Then I had a face to face interview with the manager. It was quick and easy for anybody. It was even my first interview for a job and I am not even a native English speaker.", "Interview Questions": "What would you do if you see somebody gets robbed or gets bullied by a bunch of bad guys while you are patrolling on you work shift?"}, {"date": "16 Jun 2017", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of Minnesota (Minneapolis, MN) in Aug 2013", "Interview Descriptions": "Resume screening, personal statements, GPA, English test scores are necessary and evaluated. Took several weeks for them to decide. I took the offer after it arrives immediately. The department head reached out via email as well.", "Interview Questions": "What is your undergraduate GPA?"}, {"date": "2 Feb 2016", "title": "Assistant Scientist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 5 days. I interviewed at University of Minnesota (Saint Paul, MN) in Jun 2013", "Interview Descriptions": "Over the phone interview and in person interview. Toured the facilities and the work environment as well as the plot spaces. This involved many miles across the state of Minnesota.", "Interview Questions": "Ability to travel"}, {"date": "29 Nov 2015", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at University of Minnesota (Minneapolis, MN) in Jun 2013", "Interview Descriptions": "The entire process was very straightforward. After I submitted my application through the University of Minnesota's online job search, I was called within a week to set up an interview, which took place a few days later. They offered me the job within a day after that. They needed someone to start right away, which may have helped the process go faster, but I needed to give a 2 week notice at my previous job, so they were able to be flexible and work around that.", "Interview Questions": "Name a time you experienced an upset customer or client, and how did you handle it?"}, {"date": "20 May 2016", "title": "Associate Professor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. The process took 2 days. I interviewed at University of Minnesota (Urbana, IL) in Jun 2013", "Interview Descriptions": "Required to give a presentation and meeting the faculty. Meeting with the administrative unit for one day. The presentation included one hour talk and the questions by the attendees. The goal is to discuss what the person will do is offered the job.", "Interview Questions": "what I plan to teach? What research topic I will be working on?"}, {"date": "4 May 2013", "title": "Marketing Intern Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at University of Minnesota", "Interview Descriptions": "Online application, followed by in-person interview", "Interview Questions": "N/A"}, {"date": "16 Sept 2013", "title": "Accounts Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 3 days. I interviewed at University of Minnesota (Minneapolis, MN) in May 2013", "Interview Descriptions": "The job interview process is very smooth. This job involved interview process starting with screening interviews, followed by in-person interviews.They emailed me to have an interview with the manager. I did, and they told me result the next day.", "Interview Questions": "tell me about yourself"}, {"date": "22 Jun 2017", "title": "Building and Grounds Worker Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of Minnesota (Minneapolis, MN) in May 2013", "Interview Descriptions": "After applying on the University's employment site, I received a phone call to schedule an interview.  The interview was with the shift supervisor and the assistant supervisor.  It was extremely casual in dress (jeans & T-shirt would be fine), manner, and content.  I think the interview was just a formality because neither of the 2 interviewers seemed prepared or that interested in doing it.  At the end of a brief interview, I was offered the job on the spot.", "Interview Questions": "Any custodial experience?"}, {"date": "10 Aug 2015", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 2 weeks. I interviewed at University of Minnesota (Detroit, MI) in May 2013", "Interview Descriptions": "Thorough, thoughtful, respectful, friendly and to the point. I interviewed with my direct supervisor initially, and then with two other program directors to determine if we were a good fit.", "Interview Questions": "What are my strengths and weaknesses."}, {"date": "5 Dec 2013", "title": "Visitor Relations Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 5 weeks. I interviewed at University of Minnesota (Minneapolis, MN) in Apr 2013", "Interview Descriptions": "Online or in-person application, on-site interview.", "Interview Questions": "None out of the ordinary."}], [{"date": "11 Jul 2016", "title": "Student Library Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at University of Minnesota (Saint Paul, MN) in Apr 2013", "Interview Descriptions": "I went to one of the branch libraries and met with two librarians. They asked me about my studies and the track(s) I was interested in. The interview was very informal and they really just took time to get to know you as a person. I applied back in April, but technically did not get the job until the following September.", "Interview Questions": "What is your major?"}, {"date": "4 Mar 2014", "title": "Assistant Scientist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2+ months. I interviewed at University of Minnesota (Minneapolis, MN) in Apr 2013", "Interview Descriptions": "I applied for the job online after seeing a paper posting in my research area. I talked with one of the interviewers prior to the actual interview in regards to what the job entailed and what their perspective of the job, the boss and the university was. I was notified that I was going to go through a personal interview about 6 weeks after applying for the job and received an offer about 4 weeks after that. The interview was a two person panel and they asked me questions about what I wanted out of this job and what I could provide for this research unit. There was nothing really difficult or unexpected about the questioning.", "Interview Questions": "The questions were all pretty straightforward in regards to the job expectations on my end and the employer's end, as well as what I wanted out of this job."}, {"date": "13 Mar 2013", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Minnesota", "Interview Descriptions": "Saw the posting online, applied through umn portal. Emailed the prof mentioned in umn portal. Got a reply within a week, then a phone call was set up. The next week a meeting was set up and withing 4 days, they gave me the offer.", "Interview Questions": "N/A"}, {"date": "1 Mar 2013", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at University of Minnesota (Saint Paul, MN)", "Interview Descriptions": "The only way to submit your resume is on-line.  However, it helps to have knowledge from the various departments one is interested in working in.  I volunteered for many years in various capacities in order to be known before I interviewed for my position.  It's a fast process once you are accepted.  Renewal contract every year can be stressful.", "Interview Questions": "Are you interested in the pursuit of your doctorate degree?"}, {"date": "26 Feb 2013", "title": "Scientist Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied through a staffing agency. The process took 2 weeks. I interviewed at University of Minnesota", "Interview Descriptions": "Long interview to meet the members of the lab and tour the facility lasting around 2 hours.  Able to see many hands on activities to gauge reaction and interest.  Important to work well with the team and ask questions.", "Interview Questions": "Where do you see yourself in the next 5 years?"}, {"date": "18 Mar 2013", "title": "Principal Secretary and Office Specialist Interview", "results": "No Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at University of Minnesota (Minneapolis, MN) in Feb 2013", "Interview Descriptions": "After applying on -line, I was contacted approximately 2 weeks later to schedule an interview .  At my interview (friday). I was told that I would hear the following Mon/Tuesday if I would be called back for a second interview with director. Denial email sent 1.5 weeks later.", "Interview Questions": "Typical questions... how do you resolve conflict, how do you prioritize work with upcoming deadlines... what would you do if you had 2 people come to you needing their work done at the same time...."}, {"date": "30 Jul 2015", "title": "Technical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Minnesota (Minneapolis, MN) in Jan 2013", "Interview Descriptions": "Brought directly in for an interview. Two interviewers. Just talked about myself and team situations. Asked about times I had to communicate effectively. I was also asked about how I deal with spare time when I would be on the job. It was very straight forward. No complicated questions were asked.", "Interview Questions": "Tell me a time you had to work on a team."}, {"date": "11 Jan 2017", "title": "Web Developer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at University of Minnesota (Minneapolis, MN) in Jan 2013", "Interview Descriptions": "I participated in a series of interviews. First with the manager, then with the team, and finally with the director. The team was interview had seven participating -- five were from the team I would be working with and there were two people from outside departments in related fields. That interview was structured into four sections with time for questions at the end.", "Interview Questions": "There was a particularly thorny problem the team was facing in advance of a large scale migration of websites to a new CMS. The manager asked me about what I saw as the options."}, {"date": "3 Nov 2015", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at University of Minnesota (Minneapolis, MN) in Jan 2013", "Interview Descriptions": "Super easy, came in and had a quick and simple interview, heard back immediately. The staff was entirely professional. They made sure I had everything I needed before heading into the interview. 100% would recommend their interview process to anyone.", "Interview Questions": "Why are you interested in this position?"}, {"date": "5 Dec 2012", "title": "Development Officer Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. I interviewed at University of Minnesota (Minneapolis, MN)", "Interview Descriptions": "The interview process went well overall.  Please be prepared for both a behavioral and technical interview with specific questions on trends, university objectives, systems and previous expertise and knowledge. Know the organizational objectives, key players, structure and ask good questions. They have great opportunities across the organization.", "Interview Questions": "I cannot think of any unexpected questions during this interview."}], [{"date": "19 Apr 2015", "title": "Consultant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at University of Minnesota (Minneapolis, MN) in Dec 2012", "Interview Descriptions": "Surprisingly quick, but the hiring manager had reached out to me as a contact since we were acquainted with each other professionally. That greatly expedited the process but I still had to speak with the hiring manager, her executive director, and had a group interview with the team before an offer was presented", "Interview Questions": "Why was I leaving my current employer"}, {"date": "1 Nov 2012", "title": "Executive Office & Administrative Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at University of Minnesota (Minneapolis, MN) in Sept 2012", "Interview Descriptions": "I was initially contacted by one of the Program Managers to set up an interview date and time via email.  My first interview was on a Monday with the Executive Director.  My second interview was scheduled for Friday of the same week with his executive staff - one Project Manager, one Program Manager, and one Manager of Technology Services.  My third and final interview was scheduled for the following Tuesday with the Executive Director again.  \r\n\r\nAll four individuals were extremely professional, pleasant, and direct.  Their various personalities were genuinely expressed throughout the interview process, and after working with them for a month, I know that they were being authentic during the interviews.  Their primary interests during the interviews were to be certain that (a) I could not only do the job well, but also be a good fit for their team - my hobbies, interests, and life outlook were important to all of them; and (b) I could interact well with people of diverse cultures and ethnicities across various situations.", "Interview Questions": "How much experience do you have in dealing/interacting with people of color, minorities, and/or various cultures?"}, {"date": "17 Nov 2014", "title": "Lead Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 2 days. I interviewed at University of Minnesota (Minneapolis, MN) in Sept 2012", "Interview Descriptions": "Multiple interviews, leaders seem not to know direction they are going.  Lots of middle management, without the right skills.  Interview questions very standard.  Some of them were in left field, could tell they were trying to deal with employee issues and wanted me to solve them.", "Interview Questions": "none, really easy, typical questions asked."}, {"date": "9 Sept 2013", "title": "Cashier Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at University of Minnesota (Minneapolis, MN) in Sept 2012", "Interview Descriptions": "The interview process for the cashier position at the University of Minnesota- University Dining Services is fair and easy. To get the job, you have to be a student of the University, either part time of full time and then have good communications skills. Basic math skills are required too , for some positions.", "Interview Questions": "background check "}, {"date": "19 Jan 2016", "title": "Security Monitor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at University of Minnesota (Minneapolis, MN) in Sept 2012", "Interview Descriptions": "The interview was very straight forward and easy and required little to no preparation at all. The interview questions consisted mostly of behavioral/situational questions. I was interviewed by one of the Security Monitor Program Managers who became my direct boss upon employment, so I got to know my employer before even starting.", "Interview Questions": "What would you do if you encounter two co-workers in conflict?"}, {"date": "27 Aug 2012", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at University of Minnesota (Minneapolis, MN)", "Interview Descriptions": "Spoke to many research professors until one hired me.", "Interview Questions": "None."}, {"date": "10 Jan 2014", "title": "Senior Analyst Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of Minnesota (Minneapolis, MN) in Aug 2012", "Interview Descriptions": "Two interviews, with two different sets of people -- 2nd interview followed a couple weeks after 1st interview.  Questions were pretty common, no surprises.  Couldn't get any clarity from the HR group as to who I would be interviewing with -- even on the day-of.  That was frustrating.  Decision time: took about a week for them to contact me.", "Interview Questions": "N/A"}, {"date": "24 Sept 2015", "title": "Main Office Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of Minnesota (Minneapolis, MN) in Jul 2012", "Interview Descriptions": "Was easy, basic questions from the interviewer. This was for a job right out of high school so there's not a lot you can talk about. Now interviewing people for the same job I can tell you that they hire on personality and work ethic.", "Interview Questions": "What are your strengths?"}, {"date": "11 Feb 2014", "title": "Postdoctoral Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of Minnesota (Minneapolis, MN) in May 2012", "Interview Descriptions": "I responded to an online job advertisement, which asked for a cover letter, CV, and three references. I was then asked to have an interview over skype since I was on a different continent. I had the interview and several weeks later was offered the job via email.", "Interview Questions": "None really, the interview was very straightforward."}, {"date": "22 Feb 2016", "title": "Staff Scientist Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at University of Minnesota (Minneapolis, MN) in Mar 2012", "Interview Descriptions": "spoke directly with department I was being hired for.  Didn't have to go through a number of separate interviews.  Interviewer was calm and easy going.  Seemed like the group was excited to have me working for them.", "Interview Questions": "Relate education and experience to the position being applied for."}], [{"date": "1 Sept 2014", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at University of Minnesota (Minneapolis, MN) in Mar 2012", "Interview Descriptions": "I applied online and got a phone interview about a week later. There was nothing unexpected in the phone interview - they just clarified my skills and made sure that I was a good fit. I asked a lot of questions regarding what they expected of me and more specifics about the job. Soon after I learned that I'd gotten the position! Overall an easy process!", "Interview Questions": "There was nothing unexpected. They just wanted to clarify my skills and make sure I was a good fit."}, {"date": "2 Dec 2015", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at University of Minnesota (Minneapolis, MN) in Mar 2012", "Interview Descriptions": "No such interview process in general. Applied to the university for various positions available and was able to work with a faculty who offered a Research position. The interview was 1 on 1 and the professor asked questions about your previous experience and background.", "Interview Questions": "How do you think you can contribute to the research that we are doing?"}, {"date": "4 May 2013", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 5 weeks. I interviewed at University of Minnesota in Jan 2012", "Interview Descriptions": "There was one interview. Behavioral and resume review. Got back within 3 business days with an offer for the Project Management Assistant with Office of Information Technology", "Interview Questions": "Do you use MS Word frequently?"}, {"date": "25 May 2013", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at University of Minnesota (Minneapolis, MN) in Dec 2011", "Interview Descriptions": "I initially applied through the UMN employment site, which allows you to directly upload all your documents (CV, cover letter, etc.). Within several days I was emailed to set up an interview time. Several days later I had my interview on site and was then given a tour of our building. Within a week I was called with notification that I was given the position! Email communication was always very prompt.", "Interview Questions": "As I was working in a department within the medical school, many questions involved patient privacy within clinical trials, familiarities with HIPPA guidelines, etc."}, {"date": "7 Dec 2011", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of Minnesota (Morris, MN) in Nov 2011", "Interview Descriptions": "At first it was with a phone interview. Then there was a 2 hour meeting in person broken up into 4 15 minute sessions with breaks in between. One meeting was one-on-one. One was with a small group, then a larger group, and a larger group. They showed me around and were very friendly. This was a different interview than I expected, but it was a very positive experience.", "Interview Questions": "They described a typical situation that comes up for the administrative position and asked how I would handle it."}, {"date": "3 Oct 2013", "title": "Student Development Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 6 days. I interviewed at University of Minnesota (Minneapolis, MN) in Nov 2011", "Interview Descriptions": "Was incredibly easy. Basically if they ask you to come in for a second interview after the phone interview you have the job.", "Interview Questions": "Do you like telemarketers?"}, {"date": "18 Oct 2012", "title": "Undergraduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 5 days. I interviewed at University of Minnesota (Minneapolis, MN) in Sept 2011", "Interview Descriptions": "I emailed professors about possible open positions in their lab, and communicated via email to organize an interview. A single one on one interview followed, both times a job offer was made on the spot. One position was unpaid initially, with pay starting later on, and the other job was a work study position at the University.", "Interview Questions": "What do you want to gain from this job?"}, {"date": "24 Sept 2015", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 months. I interviewed at University of Minnesota (Minneapolis, MN) in Sept 2011", "Interview Descriptions": "Meet and talk with the Professor and the group members. Waited for 2 months for the response. I was able to join because one of the group members decided to leave. The wait is usually not this long, though. Usually people get hired early in the semester (September).", "Interview Questions": "Describe your previous research"}, {"date": "3 Sept 2015", "title": "Office Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at University of Minnesota (Minneapolis, MN) in Sept 2011", "Interview Descriptions": "Just a typical interview. You meet with the Business Operations Supervisor of the building you are applying for and they ask you a series of questions (about 12 questions). It's a one-on-one interview and it typically lasts about 30 min. Once you finish they give you an estimate of when they'll get back to you (typically it's a week or 2 depending on when you apply and how many people applied).", "Interview Questions": "-Tell me about a time when you provided excellent customer service?\r\n-Tell me about a time when you disagreed with someone and how you dealt with the situation?"}, {"date": "5 Jul 2015", "title": "Junior Scientist Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at University of Minnesota (Minneapolis, MN) in Sept 2011", "Interview Descriptions": "no interview, informal referral and subsequent job offer received. The university is built almost entirely on referrals. If you know someone, this is by far the easiest way to get a job there.", "Interview Questions": "How long would you like to stay at the University"}], [{"date": "21 Oct 2012", "title": "Undergraduate Programs Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 3 months. I interviewed at University of Minnesota (Minneapolis, MN) in Sept 2011", "Interview Descriptions": "I submitted my resume and a cover letter for the vacancy when it was announced via the department's list serve. I got a call back to set up a face to face interview. I didn't receive a job offer initially but the following semester I was offered the position and I accepted.", "Interview Questions": "I think the most difficult question was how would I apply student development theory to my everyday work with undergraduate students.  There isn't a real right or wrong answer but I think the interviewer was looking to see if you were aware of  applicable theories that might help guide you in working with a diverse student population"}, {"date": "11 Jun 2012", "title": "IST Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at University of Minnesota (Minneapolis, MN) in Jul 2011", "Interview Descriptions": "One on on interview.", "Interview Questions": "If I could work over the Summer?"}, {"date": "27 Jan 2015", "title": "Junior Scientist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at University of Minnesota in Jul 2011", "Interview Descriptions": "I sent email cover letters with attached CV to Professors looking for scientists in labs at the UMN.\r\nI received an email within a week that he was interested.  He asked me if he could call me for a quick interview.  He called a few days later and discussed passed experience in prior lab.  I was from another country so we spoke also about what was required to get me working there.  I told him I needed a detailed offer letter with job description, salary and length of employment for my work visa.  The conversation lasted about 45 min.  He told me he would be in touch.  He emailed me an offer letter within a week. I accepted within a week and we got the process going.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "16 Mar 2012", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at University of Minnesota (Minneapolis, MN) in May 2011", "Interview Descriptions": "one officer from UROP and one professor asked my background and specialties. Start from my courses and then the research that I had done before. They prefer programming on Labview, Arduino and Matlab to do signal processing and autoprocessing programming. Also they asked your work experience.", "Interview Questions": "Do you use Matlab and Labview before"}, {"date": "6 Mar 2015", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at University of Minnesota (Saint Paul, MN) in Apr 2011", "Interview Descriptions": "Casual, roundtable, me and three professors. They asked me what I was interested in and left it very open for me to talk about my interests. I went to talk to different labs and professors. They reviewed my GRE scores and college transcript. Because I took 2 years off between undergraduate school and graduate school we talked about this gap as well.", "Interview Questions": "What are you interested in studying?"}, {"date": "28 Oct 2015", "title": "Graduate Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at University of Minnesota (Minneapolis, MN) in Mar 2011", "Interview Descriptions": "You apply with a formal application. The most important aspects are your GPA, undergraduate institution, and letters of recommendation. Prior research experience and publications are a definite advantage. If accepted, you can visit and meet the students/professors.", "Interview Questions": "Are you looking for experimental or computational work?"}, {"date": "22 Feb 2011", "title": "Peer Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at University of Minnesota (Minneapolis, MN) in Feb 2011", "Interview Descriptions": "Submit application, interview with assistant director", "Interview Questions": "What kind of resources have you used on campus?"}, {"date": "30 Sept 2015", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at University of Minnesota (Saint Paul, MN) in Jan 2011", "Interview Descriptions": "Very comfortable and useful. Coordinate provide us lots of information and simple course introduction. All of us enjoyed it and the whole process is short and arrange well. After we get to college, all of them exactly same as they introduced In the interview", "Interview Questions": "How do you know our program"}, {"date": "25 Aug 2015", "title": "IT Professional Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at University of Minnesota (Minneapolis, MN) in Jan 2011", "Interview Descriptions": "First Interview\r\nThe first in-person job interview is typically a one-on-one interview between the applicant and a hiring manager. The interviewer will ask questions about the applicant's experience and skills, work history, availability, and the qualifications the company is seeking in the optimal candidate for the job. More »\r\n\r\nSecond Interview\r\nA second interview can be a more in-depth one-on-one interview with the person you originally interviewed with or it can be a day-long interview that includes meetings with company staff. You may meet with management, staff members, executives, and other company employees. More »", "Interview Questions": "Why?"}, {"date": "25 Aug 2015", "title": "TA - Urban Studies Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at University of Minnesota (Minneapolis, MN) in Jan 2011", "Interview Descriptions": "There wasn't really an interview process - they were just looking for a qualified candidate who had taken the class before.  You fill out an application and as long as you have a good relationship with the Department and/or the teacher in question, you stand a pretty good chance of getting the position.  Talk about no stress.", "Interview Questions": "Have you taken the class previously?  What was your final grade?"}], [{"date": "23 Jul 2015", "title": "Cashier Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at University of Minnesota (Minneapolis, MN) in Jan 2011", "Interview Descriptions": "The interview process consisted of a brief phone interview where credentials and scheduling options were addressed. The next step was an in-person interview in the bookstore facilities with a higher level manager than the floor staff manager. The interviewer was a full time employee. The managers are very understanding of student life.", "Interview Questions": "Describe how you would deal with an upset customer?"}, {"date": "15 Apr 2014", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at University of Minnesota in Nov 2010", "Interview Descriptions": "I was contacted by them via e-mail asking to apply, I did so and was accepted.", "Interview Questions": "None, no interview. "}, {"date": "11 Jan 2014", "title": "Recruiting Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at University of Minnesota (Minneapolis, MN) in Nov 2010", "Interview Descriptions": "Knew an internal employee. They contacted me and asked me to apply and interview. The department flew me up for an interview. I interviewed with the entire department. Really standard questions. They made an offer about a week later. I was waiting on another offer but eventually took the position.", "Interview Questions": "How do you handle co-workers gossip?"}, {"date": "11 Dec 2013", "title": "Program Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at University of Minnesota (Minneapolis, MN) in Sept 2010", "Interview Descriptions": "After applying through the University's HR website, I was invited to interview before a 4-person selection committee, 3 members were from the office that was hiring with the 4th from a related office.  They were obviously asking the same questions of each interviewee but the questions were applicable to the specific position that I was interviewing for.  Because of the standardization, they didn't ask follow-up questions or give much feedback, and it was a challenge to show personality and make connections with each person but possible with conscious effort.\r\n\r\nThe second interview was much more informal and was basically a chat in a coffee shop to make sure I was a good fit for the office culture.  I toured the office and was introduced to the full team.  I believe they did this with one other final candidate.", "Interview Questions": "Always ALWAYS have a specific answer to why you want to work at the U of M, school/department, and office.  "}, {"date": "5 Feb 2011", "title": "Classroom Support Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at University of Minnesota (Minneapolis, MN) in Aug 2010", "Interview Descriptions": "Simple interview for a work study based position.", "Interview Questions": "Why should we hire you?"}, {"date": "17 Jul 2014", "title": "Coordinator (Professional & Administrative - P&A Level) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at University of Minnesota in Jul 2010", "Interview Descriptions": "Separate on-site interviews with different faculty members on site, also met or interviewed with other staff that I would be working with if I was given the job.  Other interactions by phone and email during the consideration process.", "Interview Questions": "N/A"}, {"date": "17 Feb 2014", "title": "Undergraduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at University of Minnesota (Saint Paul, MN) in Jun 2010", "Interview Descriptions": "Spoke with a professor whom had interesting research and became employed in their lab after asking", "Interview Questions": "Does not really apply, I had no formal interview."}, {"date": "20 May 2014", "title": "Junior Scientist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at University of Minnesota (Minneapolis, MN) in Apr 2010", "Interview Descriptions": "My initial communication began by emailing a research professor who emailed me back three weeks later telling me the email mysteriously took three weeks for her to receive.  Although I saw this was a red flag, I was desperate for a job.", "Interview Questions": "What kind of research did you do before?"}, {"date": "10 Mar 2011", "title": "IT Helpdesk Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at University of Minnesota (Minneapolis, MN) in Apr 2010", "Interview Descriptions": "The interview was fairly easy.  There were some situational questions and some technical questions about computers.  It was very easy going, as one would expect from a student job.  It was a very enjoyable experience.  If you know how to troubleshoot computers on a basic level, you should have no problem.", "Interview Questions": "How would you troubleshoot a printer problem?"}, {"date": "27 Jun 2010", "title": "LEED Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at University of Minnesota (Minneapolis, MN) in Mar 2010", "Interview Descriptions": "I found the interview to be straightforward. A duo of supervisors read through a list of standard questions recommended by the University. It was a wide-ranging discussion with plenty of give and take. By the end I felt like I had a good understanding of what they were looking for and my expectations were met.", "Interview Questions": "What would you say defines sustainable neighborhoods?"}], [{"date": "20 Mar 2014", "title": "Community Advisor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at University of Minnesota (Minneapolis, MN) in Mar 2010", "Interview Descriptions": "Asks a lot of questions about diversity and acceptance.  Also asks about times when you've worked through difficult situations and your method for building community.", "Interview Questions": "The most difficult was talking about how diversity impacts the community and how you would handle a situation where students weren't open to accepting others."}, {"date": "8 Jul 2010", "title": "Human Resources Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at University of Minnesota (Minneapolis, MN) in Feb 2010", "Interview Descriptions": "It was just an average interview. I think there were a lot of applicants.", "Interview Questions": "Do you have any questions for us."}, {"date": "26 Dec 2013", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 3 months. I interviewed at University of Minnesota (Minneapolis, MN) in Dec 2009", "Interview Descriptions": "I applied for the position through the graduate school and my specific department in late December and was contacted about acceptance in March, fairly early for a graduate school. The application included a personal statement and a statement of diversity (i.e. how I would contribute to the University's diversity). I got a competitive offer, visited the school in person (visit was paid for by the school) and decided to accept the offer. I started graduate school the following August.", "Interview Questions": "I wasn't sure how to answer the diversity question because I am not a minority in most situations. I acknowledged that in the statement and discussed how my educational experience would give me unique insights, another type of 'diversity.'"}, {"date": "23 Sept 2013", "title": "Software Developer Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at University of Minnesota in Aug 2009", "Interview Descriptions": "We applied ath University's website, wait a couple months, got called for interview, waited 2 weeks, offer was made.", "Interview Questions": "N/A"}, {"date": "21 Oct 2009", "title": "Executive Assistant Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at University of Minnesota in Aug 2009", "Interview Descriptions": "Interview process was okay... the actual hiring manager seeming like a wonderful person, but was very busy.  I was only able to speak with him for 15 minutes.  Spoke to HR and one other person.  \r\nI still left optimistic... but somewhat concerned about potential conflict with another admin that was already there and not performing well.  They planned to hire me and keep her.  Follow-up was slow; I left messages for HR that took over a week to be returned.", "Interview Questions": "N/A"}, {"date": "30 Nov 2011", "title": "Executive Assistant Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at University of Minnesota (Minneapolis, MN) in Jun 2009", "Interview Descriptions": "The University only allows online submissions though its HR portal, so this was how I applied. From knowing people who work at the University, I must say that this process is ridiculous. If you miss mentioning one single task that is required for the position (like not putting down that you know how to answer a phone, even though you've been a secretary for ten years), your application is rejected. \r\n\r\nI was called for an interview for a union-represented executive assistant position in the Office of the Vice President for Research, so the interview had to go completely according to the union mandates. There were three people present during the interview and the questions were stock questions that asked about my general skills. After the interview, I was offered the position but was appalled at the amount of pay they offered. They said that the union stipulated what pay could be earned, but I did some investigating on pay, which is made public, and found that the union excuse was a load of bull. I've since learned from employees that low-balling in the pay negotiation phase is rampant and that its not unheard of at all to find out that a gullible supervisor with 10 years experience isn't earning as much as a new hire working for them. It's all a lot of lies apparently.", "Interview Questions": "What was the worst thing about your last job?"}, {"date": "30 Jul 2013", "title": "Usher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 5 days. I interviewed at University of Minnesota (Minneapolis, MN) in Mar 2009", "Interview Descriptions": "My initial communication with the supervisors at Ted Mann Concert Hall was via email, and soon after I was invited to take a tour and have an informal interview.  The House Managers were courteous and well-spoken, and were very direct.  The interview was short, and I didn't have a clear idea of how they felt about me.", "Interview Questions": "What do you feel has best prepared you to work here?"}, {"date": "7 Nov 2011", "title": "Computer Support Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at University of Minnesota (Minneapolis, MN) in Jan 2009", "Interview Descriptions": "I was asked general work related questions about my resume and technical questions related to the job.", "Interview Questions": "Describe an unsuccessful hardware repair."}, {"date": "30 Apr 2013", "title": "Postdoctoral Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at University of Minnesota (Minneapolis, MN) in Jan 2009", "Interview Descriptions": "Submit your application, wait for an email invitation from the head of the clinic. They will ask you to fly in for a full day interview, where you will interview with almost every one of the full-time faculty. If you've made it to this point, they are mostly just looking at if they can get along with you and if you have a sincere interest in working for the clinic.", "Interview Questions": "What is your theoretical orientation?"}, {"date": "26 May 2010", "title": "Program Project Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at University of Minnesota (Minneapolis, MN) in Jul 2008", "Interview Descriptions": "It was a very good experience. I went in and they asked me questions about my experience and I had the job by 11am that morning.", "Interview Questions": "What was your previous experience like? "}], [{"date": "18 May 2009", "title": "Info Tech Advanced Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at University of Minnesota in May 2008", "Interview Descriptions": "Started off by coming in to the office to talk about the job.  This first meeting wasn't an interview, it was more of a pre-interview get to know everyone kind of thing.  Then the actual interview happened about a week later.  I was interviewed by the IT supervisor and was asked the typical interview questions (i.e. where do you see yourself in 5-10 year).  Was offered a job on the spot as I was a good friend of the previous employee who was leaving.", "Interview Questions": "Where do you see yourself in 5-10 years?"}, {"date": "10 May 2010", "title": "Promotions Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 2 days. I interviewed at University of Minnesota (Minneapolis, MN) in May 2008", "Interview Descriptions": "The interview process was quite simple.  It involved walking the panel of three interviewers through your resume.  After that, they each had about three to four behavioral-based questions for you to answer.  The atmosphere was quite casual and took place in their conference room.  I still advise that you dress business professional and to not be afraid to show some personality", "Interview Questions": "Tell us your biggest weakness as an employee."}, {"date": "14 Jul 2010", "title": "Postdoctoral Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at University of Minnesota (Minneapolis, MN) in Apr 2008", "Interview Descriptions": "I submitted my resume and research summary to the contact info by email and since my qualifications are very closely matched to the job qualifications, I got an email from the professor asking some questions about my time line, general questions about my previous experiences, etc and what would be a good time for me to visit the campus and interview.\r\n\r\nThey asked me to buy the plane ticket and I got instructions on accommodations and the schedule for the day of the interview.\r\n\r\nThe day before the interview, the professor came to the hotel and took me to dinner. We chatted mostly about the potential project and about the city.\r\n\r\nThe day of the interview, I presented my work in front of the research group. They asked questions related to the talk. Then it was one-on-one talk with the Prof followed by lunch. Then I got a tour of the facilities by the staff and a tour of the lab by the students. It takes awhile to go from building to building since the U is big. At the end of the day, I met the Prof again in her office, and basically was told that I will be offered the job, but no specifics. A week later, I got the offer and since I like the research facilities, I took the job.", "Interview Questions": "A grad student asked me for some suggestions for her current project."}, {"date": "7 Sept 2012", "title": "Analyst Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. The process took 1+ week. I interviewed at University of Minnesota (Minneapolis, MN) in Feb 2008", "Interview Descriptions": "Very fair and honest, well thought out hiring process and plan. The search team was well organized, prompt, and professional. There were several interviews, on the phone, and two on campus interviews with constituents and the workgroup. They were honest about what they wanted, skill sets, personalities, etc.", "Interview Questions": "The most difficult question was not technical, but rather how to handle situations in which the outcomes were out of your control. Not a trick question, but surprising. It took a while to formulate a decent answer."}]]