[[{"date": "N/A", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at BJC HealthCare", "Interview Descriptions": "The questions are relevant and the overall interview process is very easy to navigate. Highly recommend working for bjc! Usually there is a phone interview and then an in person interview, following that.", "Interview Questions": "Why do you want to work here?"}, {"date": "12 May 2023", "title": "Practice Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at BJC HealthCare", "Interview Descriptions": "I had an interaction with a recruiter who appeared disinterested, solely requesting a resume walkthrough without further dialogue or questioning. Later, in response to my thank-you email, the recruiter made an erroneous statement claiming that I lacked experience in a particular area, when in fact, that area is one of my strongest strengths. My attempt to clarify the situation was ignored. Since then, all applications I have submitted have been rejected, indicating that the recruiter's inaccurate assessment has significantly impacted my career prospects with BJC.", "Interview Questions": "Walk me through your resume"}, {"date": "12 May 2023", "title": "Senior Accountant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at BJC HealthCare", "Interview Descriptions": "Just initial interview with HR recruiter. Just wanted to post how laughable their comp was! 65k for this position…. Companies like these need to recognize the FMV of their employees and future employees", "Interview Questions": "What are next steps in interview process"}, {"date": "10 Apr 2023", "title": "Business Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at BJC HealthCare", "Interview Descriptions": "Set up with several of the leaders connected to position. Each style was different to interview. One was conversational based without tough questions, and others were very structured standard interview questions.", "Interview Questions": "Why do you specifically want this position"}, {"date": "28 Feb 2023", "title": "Pharmacist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at BJC HealthCare", "Interview Descriptions": "it was a typical interview process and they were really nice. Just be yourself and remember you're interviewing them as well. Take a deep breath and don't be nervous. What is meant for you will happen.", "Interview Questions": "They asked me about my gap year."}, {"date": "6 Feb 2023", "title": "Marketing Intern Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at BJC HealthCare", "Interview Descriptions": "I had a phone interview. It was for a hybrid position, and was pretty competitive. This interview was decently easy. It was your typical questions and was short. It took them about two weeks after the phone interview before I heard anything back.", "Interview Questions": "Why do you want this internship?"}, {"date": "19 Jan 2023", "title": "Resource Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 4 weeks. I interviewed at BJC HealthCare (Kirkwood, MO)", "Interview Descriptions": "The hiring process was long. I was immediately scheduled to speak with a recruiter who shortly followed up with another follow up interview with the manager. I didn’t hear back for about 2 months and eventually got into a second interview. Although it took months for me to get an offer, I’m so happy that I waited to hear back. My onboarding coordinator was very caring, checked with me throughout the process and occupational health staff were so friendly! I was sick prior to my appointments for occupational health and a quick 1:1 to touch base about the role and everyone was extremely accommodating to me. Everyone worked well to make sure all the boxes for onboarding was checked!", "Interview Questions": "Describe your strengths and weaknesses"}, {"date": "2 Jan 2023", "title": "Specialist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at BJC HealthCare", "Interview Descriptions": "It was truly, just solely an interesting interview. I don’t remember much detail bending it because it was so long ago and I’m only filling this out because I need to.", "Interview Questions": "I really can’t remember what they asked."}, {"date": "15 Dec 2022", "title": "Account Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at BJC HealthCare (Clayton, MO) in Dec 2022", "Interview Descriptions": "The interview process consisted of an initial phone screening, going over job history abc reasoning for leaving last job. After the interview, I was told my application would be submitted to hiring managers for the departments but as soon as I hung up, my status changed to “Interviewed; Not selected”", "Interview Questions": "Q: Tell me a little bit more about your last role"}, {"date": "9 Dec 2022", "title": "Patient Care Technician Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at BJC HealthCare (Saint Louis, MO) in Nov 2022", "Interview Descriptions": "The nursing managers conducting the interview were a prime example of nurses who \"eat their young.\" They were extremely rude and I had absolutely no interest in working in that type of environment.", "Interview Questions": "Describe a time you overcame an obstacle when providing care for a patient."}], [{"date": "5 Nov 2022", "title": "Medical Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at BJC HealthCare (Saint Louis, MO) in Oct 2022", "Interview Descriptions": "It was a average interview and I assume I interviewed with the lead MA as well. The recruiter did not answer me back very promptly after the interview and when following up also did not reply. I did not receive a email notification about not getting offered the position; however, I assume I didn't since is around the date that they were supposed to hire a MA and the position is no longer on the website. Usually there is automatic email when they closed a position, but I did not get one.", "Interview Questions": "Tell me about a time you went above and beyond in your position."}, {"date": "19 Oct 2022", "title": "Cardiac Procedure Technician Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at BJC HealthCare (Saint Louis, MO) in Oct 2022", "Interview Descriptions": "Phone interview was quick with the typical pre-interview questions. After the phone interview I was scheduled for an in person interview. My in person interview is set for today. My gut feeling is that it will go well. They are in great need of CNAs.", "Interview Questions": "Why did you leave the company?"}, {"date": "25 Oct 2022", "title": "Product Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at BJC HealthCare (Saint Louis, MO) in Aug 2022", "Interview Descriptions": "An external interviewer initiated the process. I had a conversation with her, the hiring manager, two potential colleagues and then an exercise to present - after which I was ghosted. The first two conversations were OK (very generic), for the third only one person showed. For the exercise, they made a thing of someone joining from vacation (as if that's a good thing) and gave some feedback at the end that suggested they were expecting something very different from the brief supplied. After investing time in the exercise, it was very disappointing to be ghosted - however it probably indicates what sort of culture and people you would be working with", "Interview Questions": "Very generic product related questions"}, {"date": "26 Jul 2022", "title": "QMHP Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at BJC HealthCare", "Interview Descriptions": "Easy  just regular interview questions remote interview remote work easy process no need to worry nice people nice coworkers great management you will like it good luck various shifts some opportunities to pick up extra Mostly 12 and 8 hr shifts", "Interview Questions": "Tell us about you? Team work? "}, {"date": "13 Jul 2022", "title": "Patient Access Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at BJC HealthCare", "Interview Descriptions": "Meet with two managers                                                                            for answering the phone, scheduling appointments, billing, and submitting insurance claims for answering the phone, scheduling appointments, billing, and submitting insurance claims for answering the phone, scheduling appointments, billing, and submitting insurance claims", "Interview Questions": "What is customer service to you? "}, {"date": "9 Jul 2022", "title": "Medical Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at BJC HealthCare", "Interview Descriptions": "Took about a week to review my application. I had one phone interview with HR and one zoom interview with the supervisor. Hourly pay quoted to me was low in comparison to others with similar experience.", "Interview Questions": "1. Why are you leaving your current job?\r\n"}, {"date": "2 Jul 2022", "title": "Intake Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at BJC HealthCare", "Interview Descriptions": "The interview process was pretty disorganized. I would get emails regarding upcoming interview from multiple HR people and it was difficulty to know who my point of contact was. The HR person also didn't seem to know much AT ALL about the job I was applying for. She couldn't even give me a firm answer on what location I'd be working at and originally told me the wrong one.\n\nOnce speaking with the hiring manager, she was friendly and upbeat about the experience of working a BJC. She also was careful to put on her \"politician face\" to evade directly answering questions related to how fast paced the environment was and what the workload would be like. She said she'd call me the following week to tell me if I had the job.\n\nThen I get another email from IT who says that the hiring manager AND her supervisor wanted to interview me together now. So what was the point of the first one?\n\nThe hiring manager's demeanor changed with her supervisor there and she let him do most of the talking. The supervisor wanted to know about my experience with triaging client, performing intake assessment, approaching sensitive topics with clients, etc. \n\nOverall, the two of them were fairly pleasant. But it was clear that even they didn't have a clear answer to what location I'd work at...", "Interview Questions": "Do you have any experience with triaging clients to decide who has the most urgent needs and needs to be seen first?"}, {"date": "18 Jul 2022", "title": "Lab Associate I Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at BJC HealthCare (Creve Coeur, MO) in Jul 2022", "Interview Descriptions": "Step 1: Applied online.\r\nStep 2: Via website, select a convenient time to interview with Human Resources over the phone for a Phone Screening.\r\nStep 3: Virtual Interview with Hiring Manager & Supervisor.\r\nStep 4: On-site Job Shadowing with the team.", "Interview Questions": "Q: Why are you interested in this position?"}, {"date": "4 May 2023", "title": "Communications Specialist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at BJC HealthCare (Saint Louis, MO) in Jun 2022", "Interview Descriptions": "I had a great interview experience with BJC! I first spoke to a recruiter from a LinkedIn listing, then did a phone interview followed up by a Zoom interview with the manager and a coworker from the team I'd be working on. Very friendly, realistic questions related to the job, and an honest overview of what the work environment and tasks would look like.", "Interview Questions": "The job I applied for was listed as fully remote, but ended up being a role that they were wanting to turn hybrid in the future. Otherwise I would have accepted the role. Very transparent on benefits and pay range and would have been a great fit otherwise!"}], [{"date": "22 Apr 2023", "title": "Financial Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at BJC HealthCare (Saint Louis, MO) in Apr 2022", "Interview Descriptions": "The first round is phone screening with a recruiter to discuss the role and its daily responsibility. I didn't pass the phone screening, so there were no more interview experiences with the company.", "Interview Questions": "Why BJC? Why financia analyst?"}, {"date": "26 Oct 2022", "title": "Java Developer Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at BJC HealthCare (Saint Louis, MO) in Mar 2022", "Interview Descriptions": "One phone screening and one technical/behavioral interview with a solutions architect and manager. Thoroughly went over every aspect of my resume, general knowledge questions, required familiarity with specific Java frameworks.", "Interview Questions": "Tell me about yourself. Why BJC Healthcare?"}, {"date": "30 Nov 2022", "title": "Project Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at BJC HealthCare (Saint Louis, MO) in Jan 2022", "Interview Descriptions": "Interview process is straight forward. Your talk with a TA, then manager and sometimes a staff interview. Can be a lengthy turn around time. Communication varies through email, phone and zoom. Haven’t done an in person interview in the past two roles I had.", "Interview Questions": "Bjc is big on behavior questions so be prepared to give at least three examples of a time that……."}, {"date": "10 Apr 2023", "title": "Lab Technician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at BJC HealthCare in Jan 2022", "Interview Descriptions": "Applied online, got an email from recruiters, did an over the phone interview, asked about current job duties, asked if I could provide references,few days later got an email they filled the position.", "Interview Questions": "Asked about current job, current responsibilities."}], [{"date": "17 Feb 2022", "title": "Graduate Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at BJC HealthCare in Dec 2021", "Interview Descriptions": "The overall interview process went well. The recruiter was very nice and answered any question I had; The floor mangers were also very nice. The process took a little while though due to COVID.", "Interview Questions": "Describe a time you had to work with a patient from a different culture."}, {"date": "15 Feb 2022", "title": "Patient Care Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at BJC HealthCare (Saint Louis, MO) in Nov 2021", "Interview Descriptions": "The interview process consisted of 2 interviews. Both were fairly easy and the questions that were asked were very relevant to the job description.  In both interviews, it was explained very clearly what my position consist of.", "Interview Questions": "Name a time when you had to go above and beyond for a patient."}], [{"date": "22 Jun 2021", "title": "HR Business Partner Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at BJC HealthCare", "Interview Descriptions": "I have had my eye on BJC as a potential employer for quite some time. I am extremely disappointed with their hiring process and no longer view them as a place where I want to work. The Talent Advisor for this position was very unprofessional and not friendly at all throughout the process. She was not helpful in any way and made me feel as if she didn't care for those in the hiring process. BJC really let me down this time....", "Interview Questions": "Walk me through your experience. "}, {"date": "17 Jun 2021", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at BJC HealthCare", "Interview Descriptions": "Wonderful, transparent process. Everything was exactly as I expected and was told would occur!  The individuals I spoke with during the process were passionate about the organization and eager to answer any questions I had!", "Interview Questions": "Why do you want to work for BJC? "}, {"date": "11 May 2021", "title": "Senior Accountant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at BJC HealthCare", "Interview Descriptions": "Easy formal interview, they ask about background, skills, and just normal experience throughout career. It does take a long time to get all the necessary tests done a competed before starting", "Interview Questions": "What is your greatest weakness?"}, {"date": "28 Apr 2021", "title": "NICU RN Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at BJC HealthCare", "Interview Descriptions": "Attend a virtual hiring event and ask have your cover letter submitted directly to the hiring manager of the position that you are interested in- I was contacted next day for an interview!", "Interview Questions": "A time you used safety"}], [{"date": "24 Feb 2021", "title": "Executive Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at BJC HealthCare", "Interview Descriptions": "The process was quick with no long waiting period for reply.  You do get a message if they choose another direction so you are not waiting to hear back. They have a lot of available jobs so you just need to continue applying.", "Interview Questions": "Questions were about experience mostly. "}, {"date": "9 Jan 2023", "title": "Registered Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at BJC HealthCare (Alton, IL) in Feb 2021", "Interview Descriptions": "Phone interview first, then move forward with virtual interview with practice manager- if potential pick then you receive email for second interview that may be in person or virtual depends because mine was during height of covid19, roughly 5 days later received the offer.", "Interview Questions": "What would you say your strengths are? Weaknesses? Amount of experience?"}, {"date": "1 Apr 2021", "title": "RN, CTOR Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. I interviewed at BJC HealthCare (Saint Louis, MO) in Feb 2021", "Interview Descriptions": "Initial phone interview with HR very informal. Second phone interview discussing specific positions with HR in specialty. Interview scheduled with unit management, which was rescheduled. Video conference interview with team members, manager, and unit educator.  Was told I’d hear back in 3-5 days. HR contacted me to see if I’d like to interview with other hospitals in system 3 weeks later and said the specific facility was still doing the interviewing process. I declined any further interviews within the system and told them I was no longer interested in the position I had interviewed for.  Still very disorganized, and decided to seek employment elsewhere during the waiting with higher pay.", "Interview Questions": "Standard- tell us about a time when you and a coworker or supervisor had a disagreement and how was it resolved."}, {"date": "3 Dec 2020", "title": "Student Nurse Tech Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at BJC HealthCare", "Interview Descriptions": "I went in having no CNA/tech experience and was looking for an opportunity to gain more experience. Couldn’t answer with examples from my experience due to lack of which put me behind.", "Interview Questions": "Describe a time you violated and health and safety code"}, {"date": "15 Oct 2020", "title": "Data Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at BJC HealthCare in Oct 2020", "Interview Descriptions": "The replied quickly to my application! I received an email scheduling a phone call just a couple days after sending in my resume. This was for both jobs i applied for at barnes.", "Interview Questions": "Why  did you decide to transition into data analytics?"}], [{"date": "30 Oct 2020", "title": "PCT Patient Care Tech Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at BJC HealthCare in Oct 2020", "Interview Descriptions": "this was a virtual interview. you record yourself and answer the questions provided and then someone will reach out too you. they start off by a series of questions in a text \"yes, or no, 1 or 2\" type of questions.", "Interview Questions": "what is your interest in working at bjc"}, {"date": "18 Sept 2020", "title": "Physical Therapist Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at BJC HealthCare", "Interview Descriptions": "HR contacts first, then Modern Hire interview with rehab director and lead PT, next then they provide offer.  Back ground check required and references utilized. I enjoyed the process and it was all smooth.", "Interview Questions": "If you could describe yourself in three different words, what would they be? "}, {"date": "11 Sept 2020", "title": "Pct Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at BJC HealthCare", "Interview Descriptions": "online, video camera, super easy and self-paced. You record yourself and you can re-record if you would like. It is super easy because you can watch yourself speak. I was then asked to schedule a phone interview", "Interview Questions": "Asked questions about previous job and about yourself"}, {"date": "2 Sept 2020", "title": "Social Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at BJC HealthCare", "Interview Descriptions": "There was a three  interview  process step for me. Phone interview, face to face, and then a peer interview. Took a long time to hear back from Human Resources .", "Interview Questions": "Why were you interested in the position? "}, {"date": "18 Sept 2020", "title": "Patient Service Representative Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at BJC HealthCare (Farmington, MO) in Sept 2020", "Interview Descriptions": "After filling out the application and submitting my resume online through the website, I was contacted by the BJC Talent Dept.  We set up a time for a phone interview.  During the phone interview, I was then given a date and time for a second interview a few days later.  Whole process from application to second interview was roughly two weeks.", "Interview Questions": "Tell me a little about yourself"}, {"date": "28 Sept 2020", "title": "Research Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at BJC HealthCare (Saint Louis, MO) in Aug 2020", "Interview Descriptions": "HR contacted me within a few days of submitting my application. Interview was very straight forward with common behavioral questions and inquiry about my skill set and proficiency in Microsoft applications.", "Interview Questions": "Tell us about a time you had to work with a difficult team member?"}, {"date": "7 Aug 2020", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied through a recruiter. The process took 3 weeks. I interviewed at BJC HealthCare (Saint Louis, MO) in Jul 2020", "Interview Descriptions": "Found them at a virtual job fair. The recruiter was excellent and I loved the floor. I got an appointment for an interview with two floors and both the interview went similarly well! Very difficult questions but overall to rest your critical thinking and past experience. After the interview, they offered me the job on the spot! They gave me a tour of the unit and it was so fun to meet everyone. I wish I could have jotted down the names!", "Interview Questions": "What is a time you worked in a cultural diverse environment?"}, {"date": "23 Apr 2020", "title": "Registered Nurse Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at BJC HealthCare", "Interview Descriptions": "HR call, HR interview, Director interview, peer interview. all asked similar questions. each was a little harder than the one before, only because of example questions, wanting exact examples. as a new grad, you need clinical examples ready", "Interview Questions": "3 strengths 3 weaknesses"}, {"date": "14 Mar 2020", "title": "Staff Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at BJC HealthCare", "Interview Descriptions": "Apply online. First interview is a series of questions that you type out answers to/record yourself answering on video. Second interview is in person with a few hours of time to shadow on your specific unit.", "Interview Questions": "What does integrity mean to you?\r\n"}, {"date": "13 Feb 2020", "title": "Outpatient Coder Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at BJC HealthCare", "Interview Descriptions": "Very Short. Contacted by recruiter as soon as I applied. Then went for in person interview. The in person interview consisted of a skills test. I was offered the position the same day. I then went for background check and drug testing the following day.", "Interview Questions": "Experience"}], [{"date": "28 Feb 2020", "title": "Call Center Representative Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at BJC HealthCare (Saint Louis, MO) in Feb 2020", "Interview Descriptions": "I was contacted by a recruiter who asked my some questions via email then I was offered an interview that week this upcoming Friday. I'm not sure how it will go and if they will administer the nicotine test right then and there.", "Interview Questions": "N/A"}, {"date": "15 May 2022", "title": "Senior Buyer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at BJC HealthCare (Saint Louis, MO) in Feb 2020", "Interview Descriptions": "It was a good process. The hiring manager was nice and shared a lot about the company. She was laid back and made me feel at ease. Afterwards, she walked me outside and was really personable.", "Interview Questions": "How have you handled conflict while working on a team? "}, {"date": "24 Jan 2020", "title": "Retail Sales Associate Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 months. I interviewed at BJC HealthCare (Saint Louis, MO) in Jan 2020", "Interview Descriptions": "Sought candidate which took several weekdays some were not qualified.  Connected with one and roof there more weeks to get on board.  Follow up will be necessary to assure the person will be in the position.", "Interview Questions": "Experience and connection to the pisution."}, {"date": "3 Dec 2019", "title": "HR Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at BJC HealthCare (Saint Louis, MO)", "Interview Descriptions": "About 1.5 months after applying online, I received a message from a recruiter to schedule a phone interview. After the 30 minute phone interview, I was asked to come in the following week for a 1-hour in-person interview with a panel of interviewers. 2 days later, I received a job offer. From initial phone screen to offer, the process took 1.5 weeks. Everyone I talked to was friendly, welcoming, and helpful. Overall it was a great experience!", "Interview Questions": "Describe your work history."}, {"date": "24 Jun 2020", "title": "Student Nurse Technician Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at BJC HealthCare (Saint Louis, MO) in Dec 2019", "Interview Descriptions": "Several steps to even get a phone interview.  They take a while to call you back, then you have to go through a video interview, phone interview, and a 1:1 interview in person. Even if you get to the 1:1, definitely no guarantee for getting the job.", "Interview Questions": "Describe an experience when you worked with someone of a different background from yourself."}, {"date": "26 Nov 2019", "title": "Talent Acquisition Sourcing Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at BJC HealthCare (Saint Louis, MO) in Aug 2019", "Interview Descriptions": "I applied directly on the website. Within a day, I was contacted for my first phone interview. By the end of the week, I had my second phone interview with the Hiring Manager. Both interviews went over the basics about the requirements for the positions and I got great insight into the culture. Communication was easy as well - I received emails to reiterate next steps and with some helpful links to the Total rewards page (benefits) that helped me stay informed. After the second phone interview, I was scheduled for a panel interview with members of the team - it was awesome to get to meet my future teammates AND it was great to see that everyone's opinion mattered.", "Interview Questions": "What is your greatest achievement?"}, {"date": "11 Jul 2019", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at BJC HealthCare", "Interview Descriptions": "It was fast. I was able to shadow on the floor following around a staff nurse for a couple hours. I was able to meet some of the staff and see how their days went. I then interviewed with manager and assistant nurse manager.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "14 Apr 2019", "title": "Radiologic Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at BJC HealthCare", "Interview Descriptions": "The interview process was relatively quick. It started with a phone interview with HR then a face to face interview with the department supervisors. Overall it was an average interview. Everyone i spoke to was very nice.", "Interview Questions": "Where do you see yourself in 5 years? "}, {"date": "19 Apr 2019", "title": "Customer Service Representative (Call Center) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at BJC HealthCare (Saint Louis, MO) in Apr 2019", "Interview Descriptions": "Two phone interviews and one face-to-face interview. Interviewers want to know why you want to work for BJC Healthcare.  After the face-to-face interview, I was given the option to listen to the types of calls a customer service representative receives on a typical day. The process was very professional. Allow extra time to arrive for your face-to-face interview because parking is an issue.  In addition, I recommend wearing comfortable shoes. You will most likely be walking a couple of blocks to get to the interview. Be prepared to take an online typing test before you get an invitation for a face-to-face interview.", "Interview Questions": "Describe a time that was very stressful at one of your previous positions and how did you handle it? What are your career goals? When you have an irate caller, what steps would you take to de-escalate the situation?"}], [{"date": "9 Jul 2020", "title": "Public Safety Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at BJC HealthCare (Saint Louis, MO) in Apr 2019", "Interview Descriptions": "You will be contacted by an HR specialist to discuss the position then your information will be forwarded to the appropriate section/department. The section/department lead/supervisor/head will conduct an initial interview. The next stage will be a panel interview. If selected to continue there will be an assessment. If you pass the assessment you will receive a conditional offer of employment.", "Interview Questions": "Why do you want to join Barnes out of all the other potential companies?"}, {"date": "9 Mar 2019", "title": "Communications Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at BJC HealthCare", "Interview Descriptions": "Not too bad.  Interviewer was friendly and personable.  Seemed like general questions for this particular interview but I'm sure they're all different.  Overall, the experience was pretty pain free for me.", "Interview Questions": "Tell us about a time you had an interpersonal conflict with someone and how did it get resolved?"}, {"date": "26 Mar 2019", "title": "Pct Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at BJC HealthCare in Mar 2019", "Interview Descriptions": "I received an email for a phone interview offer, I had to select a date and time frame that worked best for me. When the day approached I received the phone call, the interview lasted approximately 35 mins. After my phone interview I was later asked to come in for a face to face interview, which lasted 1 hour. After that i received a call back from hr to schedule a job shadow with another tech for 3 hours. After my job shadow, I was offered a position.", "Interview Questions": "Why do you think you’ll be a great fit for this company? "}, {"date": "5 Mar 2019", "title": "Communications Specialist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 months. I interviewed at BJC HealthCare in Mar 2019", "Interview Descriptions": "Long process.  3.5 months from first interview to start date.  Applied online.  Phone interview with HR 2 weeks later.  Phone interview with hiring manager following week.  1.5 months later, panel interview with 5.  2 weeks later, communications writing assignment (weekend to complete).  1.5 weeks later, interview with director.  Offer extended following week with start date a month out.", "Interview Questions": "Behavioral Questions\nTell me about yourself..."}, {"date": "24 Apr 2019", "title": "Talent Acquisition Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at BJC HealthCare (Saint Louis, MO) in Mar 2019", "Interview Descriptions": "Screening phone very good.  Meeting with Director more interested in asking question from list vs. getting to know individual.  Time was not allowed for applicant to ask questions.   Not a good candidate experience.  Cold and unfriendly environment.", "Interview Questions": "Tell me about a time when?"}, {"date": "14 May 2019", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at BJC HealthCare (Saint Louis, MO) in Mar 2019", "Interview Descriptions": "15 minute phone interview followed by a 1-hour in-person interview. Phone screening was basically just learning about the job. For the in person interview, the interviewer had a packet that they read from.", "Interview Questions": "Tell me about a time you took a risk at work. "}, {"date": "5 Dec 2019", "title": "Analyst Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at BJC HealthCare in Mar 2019", "Interview Descriptions": "This was the worst interview experience I have ever had. I was up for two different positions at Barnes and got offered a final round interview for both. The recruiter that I was working with asked my minimum salary requirement, which I told her. She responded by saying that position A won’t be able to meet that requirement, and that position B would be a better fit for that reason. \n\nWith that knowledge from the recruiter, I dropped out of interviews for position A and went to the last round interview with position B. They told me during the interview that they would like to verbally offer me the job, and to look out for a formal offer. The formal offer took 9 weeks to arrive. I went multiple weeks at a time without hearing an update from anyone about where in the process the offer was. \n\nThe worst part, though, was that when I got the offer, the recruiter called me to tell me that the salary they were offering was significantly lower ( by 10k+) than the minimum salary I told them (a minimum that she said was within range for that position when she encouraged me to move forward with this interview over the other position I was interviewing for).  She was very condescending and kept saying things like “I know you gave us your minimum salary requirement but what’s your REAL minimum?” Another disappointing thing was that the salary they offered was less than the salary range listed for position A (which is the one she told me could never meet my minimum). \n\nI probably would’ve considered accepting this offer (even with the salary below my minimum) if I had gotten it under better circumstances. But I just felt manipulated by the time this whole ordeal was over, and I was angry about several other opportunities with other companies that I had turned down after I had gotten my verbal offer from BJC, since the process had taken 9 weeks. BJC should really work on making sure their recruiters are relating accurate information to their interviewees. It was disappointing to waste so much time and give up another opportunity at BJC, and others outside BJC, based on false information from HR.", "Interview Questions": "Typical interview questions with a presentation portion"}, {"date": "5 Feb 2019", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at BJC HealthCare", "Interview Descriptions": "Very good interview, regular questions and they made me feel very comfortable. Sadly floor did not have any positions but it really does seem like an awesome place to work.", "Interview Questions": "Name a time you had a confrontation with a coworker and how did you handle it "}, {"date": "7 May 2019", "title": "PSR Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1+ week. I interviewed at BJC HealthCare (Saint Louis, MO) in Jan 2019", "Interview Descriptions": "The hiring process was simple. I interviewed with a couple different hospitals and got a phone call with an offer in the next couple days. I was hired on and orrientation was the next week.", "Interview Questions": "Past experience in the medical field."}, {"date": "11 Dec 2018", "title": "Quality Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at BJC HealthCare (Saint Louis, MO)", "Interview Descriptions": "Brief phone screen interview with HR recruiter and a back to back group panel interview with team followed by one on one interview with hiring manager. The group panel interview was more technical in nature and asked a few behavioral questions to determine fit with team.", "Interview Questions": "What experiences do you have with report building using electronic health record data?"}], [{"date": "30 Nov 2018", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 1 week. I interviewed at BJC HealthCare", "Interview Descriptions": "The first part of the interview was a one on one with the manager, afterwards I interviewed with my peers. Simple questions about why I wanted to work there and experiences I've had as a nurse in the past. I was not tested on specific situations in that environment.", "Interview Questions": "Why do you want to work here?"}, {"date": "1 Dec 2018", "title": "MRI Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at BJC HealthCare", "Interview Descriptions": "Was contacted by HR for telephone interview. I was then contacted by the manager of the department for an in person interview. THe interview was conducted with the supervisor, and manager separately but on the same day which was very helpful.", "Interview Questions": "Tell me a time you made a mistake and how you handled it"}, {"date": "13 Nov 2018", "title": "Finance Project Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at BJC HealthCare", "Interview Descriptions": "Preliminary phone interview with HR and follow up with hiring managers.  Interviews are at various locations based on the job description and where the hiring managers may be residing. Phone interview was about thirty minutes and the follow up interviews are about an hour.", "Interview Questions": "Past experience"}, {"date": "13 Dec 2018", "title": "RN Staff Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at BJC HealthCare (Saint Louis, MO) in Nov 2018", "Interview Descriptions": "I was given clear instructions on how to get into the hospital complex, where to park, and where to pick up my visitors pass. SLCH has a very strict visiting policy, you will not be allowed to navigate the hospital without first checking in. They ask, who are you? Where are you going? and who are you here to see? I had a panel interview and it went pretty well. The team from this department was pretty down to earth, and seemed genuinely interested in getting someone who would be a good fit of the position. I was asked backs PALS questions- getting the questions wrong were not punitive, more so show the educator where I was and how she could help me during orientation. After the interview, they were timely with regards to giving me answers where they were in the hiring process, and if I was still being considered for the position. This is very nice since some places don't even bother to tell you you are no longer in the running.", "Interview Questions": "Why did you choose to apply at SLCH?"}, {"date": "28 Feb 2019", "title": "Internship Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at BJC HealthCare (Saint Louis, MO) in Nov 2018", "Interview Descriptions": "3 interviews, 1 phone interview, submit a resume and cover letter. for the last 1 interview it took them almost one month to give a final answer. the process overall was smooth and they had very transparent deadlines.  Can't really complain about it", "Interview Questions": "how do I describe my leadership style ?"}, {"date": "10 Oct 2018", "title": "Patient Care Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at BJC HealthCare", "Interview Descriptions": "Started with a self-paced online interview that required recording a self-introduction video and then answering 8 questions such as previous work experience and job duties, and why you believe you fit with BJC.", "Interview Questions": "Why are you interested in working for BJC"}, {"date": "28 Sept 2018", "title": "Patient Access Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. I interviewed at BJC HealthCare", "Interview Descriptions": "Easy:\r\nWent to a career and became acquainted with an HR rep, was then set up with a recruiter that asked if I was interested in the role. Took about 3 weeks to get an offer.", "Interview Questions": "typical behavioral questions"}, {"date": "31 Jul 2018", "title": "Strategic Sourcing Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at BJC HealthCare", "Interview Descriptions": "Normal interview process, start with HR business partner to verify experience and expectations, then to hiring manager, then came in for a panel interview with 4 directors (1 position above the position applied for), verbal offer took about 2 weeks, written offer took about a month.", "Interview Questions": "What is your experience working with varying and challenging business needs requesting new suppliers and contracts, and how did you handle that?"}, {"date": "30 Jun 2018", "title": "Development Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at BJC HealthCare", "Interview Descriptions": "I had a scheduled phone interview with Human Resources.  The representative I spoke to was personable and easy to talk to over the phone.  Called in a timely manner and about thirty minute interview.", "Interview Questions": "Experience"}, {"date": "10 Jun 2018", "title": "Graduate Nurse Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 4 weeks. I interviewed at BJC HealthCare", "Interview Descriptions": "This experience consisted of shadowing for 3 hours and an interview afterward. I shadowed on a general medicine floor and followed a nurse. I'm glad I did this because I realized within 30 minutes I did not want to work there. My nurse was responsible for 5-6 patients (some were 100% dependent for ADLs) with no techs on the floor. The supply room was missing essential items the nurses needed and multiple nurses stated this was the norm. Also, some were discussing the need to see an eye doctor and the soonest appointment being 4 months away with employee health (benefits are an important consideration for a position). After shadowing, the interview is conducted panel style. They read questions off of a sheet, none of which seemed personal. The interviewers did not say anything about themselves (schools, experience, etc) until after the interview questions had been answered. Usually this is done as an introduction to make the interviewee feel comfortable. I did clinicals at this hospital and did not have this negative experience, so maybe it was department specific. To be transparent, I did not get the job offer but after that experience I would not have taken the position anyway.", "Interview Questions": "All 6  questions were from a formalized sheet which required an answer in a specific 3 part format. The answer format was similar to problem, solution, outcome. They were all supposed to be answered with what you have done during your nursing experience."}], [{"date": "23 May 2018", "title": "Registered Nurse Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at BJC HealthCare (Saint Louis, MO) in Apr 2018", "Interview Descriptions": "BJC conducted a phone interview first which was then filtered down to floor nurse managers. I then met with the floor managers one on one to discuss the role of the RN and how the floors were managed.", "Interview Questions": "How would you respond? They asked me several hypothetical situations. Focusing on prioritization and critical thinking. They also wanted to know how my nursing background would help their demographic. I let them know my thoughts and how I would implement them. "}, {"date": "14 Mar 2018", "title": "New Grad RN Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at BJC HealthCare (Saint Louis, MO) in Mar 2018", "Interview Descriptions": "It was causal. I shadowed for 2 hours and interview for 15 minutes. Manager made me feel very comfortable while interviewing. I haven't heard back from them yet and hoping to hear back soon.", "Interview Questions": "Tell me about yourself?"}, {"date": "4 Dec 2020", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at BJC HealthCare (Saint Louis, MO) in Feb 2018", "Interview Descriptions": "Phone interview is first but they don’t ask difficult questions. Then there is an in person interview with the manager. Then I was offered the job a few hours later by phone call", "Interview Questions": "Describe a time where you had conflict with a co-worker and how you resolved it"}, {"date": "10 Jan 2018", "title": "Patient Care Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 days. I interviewed at BJC HealthCare (Saint Louis, MO) in Jan 2018", "Interview Descriptions": "Received a call for an over the phone interview which lasted about 20 minutes and ended in setting up an in person interview the following day. I arrived at the hospital to take a PCT assessment prior to the interview and was interviewed by the assistant manager and manager of the floor. They took turns asking behavior based questions and allowed two employees from the floor to come in and peer interview me shortly after. I was called back about 3 hours later with an offer.", "Interview Questions": "Name a time when you had to encounter a team member who was the opposite of you and how did you work with them"}, {"date": "21 Dec 2017", "title": "Construction Engineer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at BJC HealthCare (New York, NY)", "Interview Descriptions": "I told the VP i would be a hard worker.  He said, \" No, i want you to work smart.\"\n\nI had 3 interviews maybe 4.\n\nPeople were not very good at interviewing people.", "Interview Questions": "typical questions if my memory is correct."}, {"date": "14 Dec 2017", "title": "Senior Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. I interviewed at BJC HealthCare", "Interview Descriptions": "HR called with the usual questions and setup a face to face with my manager\r\nPreviously I have several face to face interviews and a panel interview.  It seems to be up the manager and the speed to which they need the position filled.", "Interview Questions": "Tell me about a conflict you've had with someone at work and how you resolved it?"}, {"date": "14 May 2018", "title": "Anesthesia Tech Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at BJC HealthCare (Saint Louis, MO) in Nov 2017", "Interview Descriptions": "I applied for the job on recommendation from a current employee. The process took about 2 months for them to contact me and set up an interview. The interview seemed standard why should they choose me, what can I contribute that others cannot.", "Interview Questions": "What was one time I helped when it wasn't required of me?"}, {"date": "25 Dec 2017", "title": "Patient Access Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at BJC HealthCare (Saint Louis, MO) in Nov 2017", "Interview Descriptions": "The interview process was very easy. After the interview was over they called me 30 minuets later to tell me I got the job. Just be yourself in the interview.", "Interview Questions": "Why do you want to work here? \r\nWhat makes you a great fit? \r\nWhat would you do if you were stuck in a situation and could not figure out how to fix it. "}, {"date": "9 Oct 2017", "title": "Center for Clinical Excellence Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. The process took 2+ months. I interviewed at BJC HealthCare (Saint Louis, MO)", "Interview Descriptions": "Phone interview, followed by an in person interview, which had 2 rounds each with multiple interviews. Behavioral questions only, no case questions. Most questions were focused on working with others/in a group.\r\n\r\nAfter the in person interview, they took much longer than expected to follow up with me, and they told me multiple times that it would be a few more weeks.", "Interview Questions": "Tell me about a time you worked in a group"}, {"date": "8 Sept 2017", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at BJC HealthCare", "Interview Descriptions": "I shadowed and then interviewed with 3 staff members, including the nurse manager.  I spent about 2 hours total on the unit. Everyone from the nurse I shadowed to the interviewers were incredibly kind, professional, and eager to help me find the right fit and unit within BJH.", "Interview Questions": "We treat a diverse patient population. Talk about a time you dealt with someone (customer, patient, family member, etc.) from a different culture. How did you approach the situation, and what did you learn? "}], [{"date": "27 Sept 2017", "title": "Medical Laboratory Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at BJC HealthCare (East Saint Louis, IL) in Sept 2017", "Interview Descriptions": "Very Friendly and informative. Easy to talk to. The person I spoke with was from the Hr department, explained to me that she was only the initial screening and would after the interview send my resume to all the branches or laboratories affiliated with BJC. Next would come the face to face interview with which ever lab was most interested or in need of me as an employee.", "Interview Questions": "What is your greatest weakness."}, {"date": "28 Oct 2017", "title": "Clerical Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at BJC HealthCare in Sept 2017", "Interview Descriptions": "Interview went smooth and was comfortable. Basic qualification questions and about me questions asked. Also asked positive contribution i would bring to this position. Met a few office staff.  All was very pleasant and professional. Even though I wasn't offered this position, look forward to a posible positive future with this company", "Interview Questions": "Tell me about yourself?"}, {"date": "7 Sept 2017", "title": "Data Analyst Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. I interviewed at BJC HealthCare (Saint Louis, MO) in Aug 2017", "Interview Descriptions": "It was very casual, they were looking for someone to fit into their team vs. someone fitting into the role. Lots of personal questions, some professional, I felt very at ease made the interview process very comfortable.", "Interview Questions": "How do you work under pressure when working on a project?"}, {"date": "25 Jan 2018", "title": "Clinical Information Systems Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at BJC HealthCare (Saint Louis, MO) in Jul 2017", "Interview Descriptions": "Resume was given to HR, bypassed online application. First phone interview with HR. Then in-person for interview with Department Manager and PM, then second interview with peers.  HR was only interview asked real questions.  The other two were just casual to see if they like you.", "Interview Questions": "Questions about teamwork and customer service "}, {"date": "13 Jul 2017", "title": "Catering Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at BJC HealthCare in Jun 2017", "Interview Descriptions": "I had two interviews with them. The frist one was a 30 min phone interview. I got an email on my phone saying they wanted to have a phone interview with me. You click yes and pick the date and time you like to have, then they call you and make sure your phone is right by you at that time because if you miss it you might not get another chance.  They ask you question like why would you like to work for bjc or they will ask if  the hours work good for you just like a regular interview.Then if that person likes you and you pass they will give you a time and date to go meet the hiring manger.  You will walk around the 1st hour of the interview  on the floor and observing  to see if you like it enough and then have the interview afterwards. Its like 2- 3 hours of your time. You see how to take orders and assemble the food.  Then go and talk to hiring manger and thats it. My advice come perpared. Have you resume and have a pen and write down questions to ask them.", "Interview Questions": "how do you help with production cost?"}, {"date": "19 Jul 2017", "title": "Pct Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at BJC HealthCare (Belleville, IL) in Jun 2017", "Interview Descriptions": "They messed up the interview day and didn't call me until I was already finished looking like a fool because I showed up for the interview. The hiring manager never sent over my application or resume. They never called or emailed back after numerous attempts. Very unprofessional if you ask me.", "Interview Questions": "What was one mistake you've made in your field?"}, {"date": "20 Sept 2019", "title": "RN Supervisor Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at BJC HealthCare (Farmington, MO) in Jun 2017", "Interview Descriptions": "Online app, followed by phone screen and then a call for face to face interview. Very friendly people and easy and they kept me informed every step. They were very clear on what they were looking for.", "Interview Questions": "What’s your strengths and weaknesses?"}, {"date": "2 Dec 2020", "title": "Patient Access Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at BJC HealthCare (Saint Louis, MO) in May 2017", "Interview Descriptions": "The interview process was very drawn out, I had a total of 3 interviews. 2 phone interviews and 1 in person interview with a department head. The questions asked were fairly simple and almost identical across all 3 interviews which gave me a chance to tweak my answers if I didnt have a good answer the first time.", "Interview Questions": "Name a time where you went above and beyond to help someone else."}, {"date": "25 Apr 2017", "title": "Improvement Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at BJC HealthCare (Saint Louis, MO)", "Interview Descriptions": "25 minute phone screening interview.  Forward answers to questions to the hiring manager.  Would set up an in person interview .  Followed by team meeting.", "Interview Questions": "Walk me through one of your projects"}, {"date": "24 Apr 2017", "title": "Office Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at BJC HealthCare", "Interview Descriptions": "I started on a temp to full time contract and became a full time employee following the completion of my 6 month contract so there was no interview process for me.", "Interview Questions": "N/A"}], [{"date": "4 May 2017", "title": "Desktop Support Technician Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at BJC HealthCare (Saint Louis, MO) in Apr 2017", "Interview Descriptions": "Team was friendly and personable, I just don't think I was the best fit for them. The first question was are you nervous, to which I answered \"no\".  I'm not sure that went over to well, but I didn't want to give the impression that I was intimidated. At any rate, I was grateful for the opportunity.", "Interview Questions": "Why the move to technology"}, {"date": "20 Apr 2017", "title": "Registered Respiratory Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. I interviewed at BJC HealthCare (Saint Louis, MO) in Apr 2017", "Interview Descriptions": "Simple enough process, however, they do panel interviews with 3 or 4 people. All take turns asking you questions where you provide examples for answers based on previous experience. I had questions that I had not expected or ever had before.", "Interview Questions": "Tell about a time where you made a decision you regretted and how you handled it. "}, {"date": "31 Mar 2017", "title": "Practice Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at BJC HealthCare in Mar 2017", "Interview Descriptions": "Interview process very through by phone then 2 in person interviews went well.Everyone from talent acquisition team to the direct reports were very professional and helpful in understanding the importance of communication to the perspective employee.", "Interview Questions": "Most questions were situational type questions."}, {"date": "22 Feb 2017", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at BJC HealthCare", "Interview Descriptions": "Phone interview then floor shadow and interview with manager. Interviews last about 30 mins.  Will ask about willingness to work weekends and holidays. Personality quiz and drug test needed.", "Interview Questions": "What does excellent care mean to you"}, {"date": "13 Feb 2017", "title": "Administrative Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 6 weeks. I interviewed at BJC HealthCare (Saint Louis, MO)", "Interview Descriptions": "The recruiter was very nice and keep me up to the moment I was offer a position with the hospital. The background requirements did take some time but I can understand why.", "Interview Questions": "Tell me the time you work on multiple projects?"}, {"date": "23 Jun 2017", "title": "Senior Project Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. I interviewed at BJC HealthCare (Saint Louis, MO) in Feb 2017", "Interview Descriptions": "Group interview with initial discussion about the position.  This was followed with questions around matrixed/crossfunctional teams.  Multiple diverse questions from all 4 interviewers to determine my experience with past projects, most difficult to most successful.", "Interview Questions": "Most successful projects and why?"}, {"date": "13 Nov 2019", "title": "Intern Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at BJC HealthCare (New York, NY) in Feb 2017", "Interview Descriptions": "Easy and friendly, they contacted me and asked me questions about my life, and what I would like to do. they also asked me what experience I had in the past, and what I would like to learn", "Interview Questions": "Asked about me"}, {"date": "2 May 2017", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at BJC HealthCare (Saint Louis, MO) in Jan 2017", "Interview Descriptions": "Simplistic, direct questions that inquired about my work history, work personality and its relation to my experience to customer service.  Experience in office roles was also a question asked.", "Interview Questions": "Describe yourself/experience for this role and in relation to customer service"}, {"date": "15 Apr 2021", "title": "Maintenance Technician Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at BJC HealthCare (Saint Louis, MO) in Jan 2017", "Interview Descriptions": "the interview process was terrible. the individual on the phone must have been slow because he could hardly speak. in person interview was also terrible. very un proffesionan . never apply again", "Interview Questions": "how old are you tosy"}, {"date": "22 Jun 2017", "title": "IS Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at BJC HealthCare (Saint Louis, MO) in Dec 2016", "Interview Descriptions": "Pretty easy. Phone interview then met with 4 people. General questions. They pretty much just gave me a call for a phone interview which was basically just making sure you aren't crazy. Group interview after where they ask pretty regular things about why you want to work there etc", "Interview Questions": "\"What would you do if you have an issue with a coworker?\"\r\n"}], [{"date": "11 Nov 2016", "title": "Registrar Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at BJC HealthCare", "Interview Descriptions": "Plan for parking, and get there early to prepare for the interview. It's a very large facility, if it's your first time being in the place.\nResearch the company.\nBe on time.", "Interview Questions": "Customer service\nDiversity"}, {"date": "27 Oct 2016", "title": "RN Case Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at BJC HealthCare (New York, NY)", "Interview Descriptions": "Phone interview. Face to Face interview. Shadowing.The person I shadowed with said I would be an asset to the team. I thought it was a real possibility I would be offered a position. They are consistently seeking people for this position.", "Interview Questions": "Where do you expect to be in 5 years? "}, {"date": "18 Oct 2016", "title": "Patient Care Technician Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at BJC HealthCare (Saint Peters, MO)", "Interview Descriptions": "I applied through an employee referral. The HR coordinator was given my name and phone number but couldn't find my application and I had to reapply. After I reapplied I was told to call the HR coord directly, which I did. She set up a phone interview, and called me 45 mins after the scheduled time. I completed the phone interview and she set up an in person interview before hanging up. The in person interview uses the STAR method and was with a higher level HR person, possibly a manager. They read questions from a book and then she typed my responses up on the computer. You needed to answer using the STAR method or she would ask the question again. Then I was taken into the actual hospital and interview with the ANM, I was asked some of the same questions and some different, again using the STAR method.", "Interview Questions": "Mostly questions about customer service and dealing with difficult people. "}, {"date": "25 Oct 2016", "title": "Senior Recruiter Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at BJC HealthCare (Saint Louis, MO) in Oct 2016", "Interview Descriptions": "The position was that of Sourcer, and I was interviewed by the competition, a Sourcer.  I was told, the position was open because the predecessor \"went to another department\" (hum!).  I NEVER received feedback regarding the phone interview; and I assume, the Sourcer would not want to recommend competition that has better recruitment and sourcing skills than himself!  Overall, it was a poor experience and waste of time!", "Interview Questions": "The questions were basic and fundamental."}, {"date": "1 Jun 2017", "title": "Marketing Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. I interviewed at BJC HealthCare (Saint Louis, MO) in Oct 2016", "Interview Descriptions": "Two marketing managers spoke with me in a conference room. It was very laid back and lasted about 20 minutes. They asked me questions about my past work and background. They called me 30 minutes after the interview telling me I had the job.", "Interview Questions": "How would you apply your past experience to this job?"}, {"date": "5 Oct 2016", "title": "RN Staff Nurse Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at BJC HealthCare (Saint Louis, MO) in Sept 2016", "Interview Descriptions": "Recruiter called me and we set up a phone interview. 40 minute phone interview went very well, I was very prepared and thorough and lady was nice. She ended with stating that she would email me information regarding my unit interview later in the day. (She even gave me directions and went through salary in detail) I patiently awaited an email that never came. I called after 2 days to leave a voicemail respectfully asking to please advise if position was still available as I had not received said email. Never heard back...until 2 weeks later the same recruiter called AND emailed wanting to know if I wanted to interview for the same position (the one I had already interviewed with her for!) While it really annoyed me that she had clearly forgotten that we had already spoken, I responded with both phone call and email and again, never heard back. Uh, what?! have no respect for a company who doesn't have the decency to respond and actually goes out of the way to deliberately ignore candidates. How unprofessional and disappointing.", "Interview Questions": "N/A"}, {"date": "29 Aug 2016", "title": "Patient Access Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at BJC HealthCare", "Interview Descriptions": "I completed an online application through the BJC website and I completed their online assessment. I was then scheduled for a telephone Interview with an HR rep. Then I had panel Interview with three managers. They asked almost all situational based questions. I also had to complete a typing test.", "Interview Questions": "Describe a time you went above and beyond to provide excellent customer service"}, {"date": "27 Apr 2017", "title": "Patient Care Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at BJC HealthCare (Saint Louis, MO) in Sept 2016", "Interview Descriptions": "First you have a phone interview then you interview with all the managers and assistant managers last but not least its your peer interview. They will ask have you done this before ask you questions all at one time to see if you can keep up l.", "Interview Questions": "Do you know what ekg is.\r\nDo you know how to use the computer.\r\nCan you multi-task.\r\nMemory\r\n"}, {"date": "1 Nov 2016", "title": "Staff Nurse Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at BJC HealthCare (Saint Louis, MO) in Sept 2016", "Interview Descriptions": "Applied online and was called for a phone interview less than a week later. I was then told to come in a few days later for a face to face. I met 2 supervisors and was shown around on the floor. A few days later i recieved a call to have a peer interview that lasted 20-30 mins.", "Interview Questions": "What have you done that you regretted?"}, {"date": "14 Dec 2016", "title": "Patient Care Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at BJC HealthCare (Saint Louis, MO) in Sept 2016", "Interview Descriptions": "The process took about two weeks.  I first completed a phone screening.  A few days later, I met with human resources to complete testing and did a brief interview with a talent acquisition specialist.  The next week I met with a floor supervisor and nurse manager for the face to face interview.  The interview lasted about 30 minutes.  I heard back about a week later, but was not offered the position.  Great experience, though.", "Interview Questions": "Why should we hire you for this position?"}], [{"date": "30 Aug 2016", "title": "RN Staff Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. I interviewed at BJC HealthCare", "Interview Descriptions": "Telephone interview after being recruited on LinkedIn.v. Initial recruiter reached out on linked in. When I responded, forwarded to the local recruiter. Had a few phone convesations prior to actual interview. Awaiting second interview, with unit manager. Recruiter was very flexible with timing and with required submissions. Very pleasant interview.", "Interview Questions": "A time you made a clinical error, and what you did about it."}, {"date": "8 Aug 2016", "title": "PI Engineer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at BJC HealthCare", "Interview Descriptions": "It was a panel interview that consisted of about 7-8 employees. They asked mostly scenario based questions... Tell me about a time when.... Although there were many people in the interview room, it was not very intimidating.", "Interview Questions": "Tell me about a time when you had to overcome a barrier?"}, {"date": "6 Sept 2016", "title": "Medica Office Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at BJC HealthCare (Saint Louis, MO) in Aug 2016", "Interview Descriptions": "first there was a phone screen thats lasted about 15 minutes. then the recruiter felt like i was a good match so she set up a face to face interview with her, & lastly a interview with the department manager who stated she liked me & showed me around the office.", "Interview Questions": "how do you handle upset people?"}, {"date": "13 Jul 2016", "title": "Staff Nurse Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at BJC HealthCare", "Interview Descriptions": "Applied online through BJC website. Received phone call from HR recruiter a few days later. Did a phone screen with HR in which they asked basic behavioral type questions and things such as why our hospital? why the particular unit? etc. Had an informal phone interview with the floor manager a couple days later and was asked to come in for a half day shadow the next week. The shadowing day allowed a great opportunity to get a feeling for the unit.", "Interview Questions": "Describe a situation in which you took care of patient that was diverse from you. "}, {"date": "26 Apr 2017", "title": "Student Nurse Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at BJC HealthCare (Saint Louis, MO) in Jul 2016", "Interview Descriptions": "The interview was pretty relaxed. I was able to shadow the unit for a couple hours and then I interviewed with the Assistant Nurse Manager. It was maybe 5-6 questions", "Interview Questions": "Tell me about a time you provided exceptional care to a patient"}, {"date": "16 Jan 2020", "title": "IT Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at BJC HealthCare (Lake St Louis, MO) in Jul 2016", "Interview Descriptions": "Technical questions, HR type questions\r\nWhat is IP config, name a time you overcame an obstacle to get to a solution\r\nThe questions are easy to answer, and the process was easy.", "Interview Questions": "What is the difference between RAM and ROM"}, {"date": "13 Jul 2016", "title": "Patient Care Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at BJC HealthCare (Saint Louis, MO) in Jul 2016", "Interview Descriptions": "PCT test and initial interview was what you would expect. Study your practice test and make sure you are comfortable with fractions. The test and initial interview was with an HR representative. I will have a second interview with the department manager in a week.", "Interview Questions": "Tell me a time when you went above and beyond in a position."}, {"date": "8 Sept 2016", "title": "BMET Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at BJC HealthCare (Phoenix, AZ) in Jul 2016", "Interview Descriptions": "Reviewed my resume online, I was told I was the perfect candidate for the job. Proceeded to then conduct an over the phone interview. Once that was complete a day later conducted an internet webcam interview. After the internet interview was completed I was told that HR would contact me with an offer letter to electronically sign and date along with other documentation that proves I was eligible to work.", "Interview Questions": "Are you comfortable with travel if the job requires you to?"}, {"date": "14 Jul 2016", "title": "RN Staff Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at BJC HealthCare (Saint Louis, MO) in Jul 2016", "Interview Descriptions": "HR interviewed me shortly on the phone and scheduled me an interview and shadow for the next week. The overall experience was easy and it was a regular interview. They got back to me about the offer in less than 24 hours.", "Interview Questions": "Why Barnes?"}, {"date": "30 Mar 2017", "title": "Lab Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at BJC HealthCare (Saint Louis, MO) in Jul 2016", "Interview Descriptions": "It was quick and effective, a phone interview lead to an in person interview they were fiendly and prompt. A job shadow and a peer interview followed which led to an offer. there was a total of three interviews.", "Interview Questions": "Give us an example of a time you faced a coworker who didn't appreciate you as their coworker. "}], [{"date": "7 Feb 2017", "title": "Student Nurse Tech Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at BJC HealthCare (Saint Louis, MO) in Jun 2016", "Interview Descriptions": "Quick, easy  - was exactly as expected or anything that you can probably search for online to be prepared.  Recruiter talked pretty fast and was hard to understand part of the time, but was always okay with repeating.", "Interview Questions": "Difficult situation and how it was handled"}, {"date": "1 Jun 2016", "title": "Laboratory Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 1 day. I interviewed at BJC HealthCare (Saint Louis, MO)", "Interview Descriptions": "Phone interview about prior work experience, future plans, certifications, and education. Explanation of requirements and base pay. Training requires early morning shifts and ability to drive to work. They will say it will be a few weeks before you know if you have the job, but it only took 2 days for a offer", "Interview Questions": "What particular situation caused harm or death to a patient? What would you have done differently?"}, {"date": "1 Aug 2016", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at BJC HealthCare (Saint Louis, MO) in May 2016", "Interview Descriptions": "HR was quick in returning the call after applying online. Very simple, basic questions. Short and to the point. Interviewed with the manager, she was very nice, very understanding; explained what was expected of me right away; interview was followed by shadowing on the floor.", "Interview Questions": "Tell about a time when you went above and beyond"}, {"date": "18 Jan 2018", "title": "Social Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at BJC HealthCare (Saint Louis, MO) in May 2016", "Interview Descriptions": "I was initially called by HR, which asked me why I was interested in the position. I then received another call shortly after from HR asking if I'd be interested in interviewing. The interview is set into 3 parts:  The day of the interview, I shadowed a social worker in their position first for an hour, then interviewed with a group panel of current social workers at the hospital. Afterwards, I then had a final interview with my direct supervisor and the director of Social Work.", "Interview Questions": "Why should we hire you? What skills and strengths can you bring to this position? We see you have ___ experience, how would you translate this into this position. What might be some positives and negatives about this? "}, {"date": "6 Aug 2017", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. I interviewed at BJC HealthCare (Saint Louis, MO) in May 2016", "Interview Descriptions": "They will contact you asking if you still are looking for a job. Will then have you apply privately to the position they are offering. They will then call you and interview you on the phone if the position needs to be filled asap.", "Interview Questions": "What made you pick the major you are studying?"}, {"date": "24 Apr 2016", "title": "Case Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at BJC HealthCare (Saint Louis, MO)", "Interview Descriptions": "Initial phone interview by HR recruiter, then in person interview with hiring manager, then called to meet with the team of case managers.  The team of case managers appear to work harder and not smarter!. Consistently made discouraging statements about the position during the interview, so I asked myself, why would I want to work with an unhappy group of individuals?  Answer:  I don't, no offer was made and accepted a different position elsewhere!", "Interview Questions": "I was asked various questions about how my skills will transfer to case management.  I am a case manager and aware of the role!  Why do you want to be a case manager?. Asked the same question several times by different case managers.  Felt like the Twilight Zone!"}, {"date": "7 Aug 2016", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 3 months. I interviewed at BJC HealthCare (Saint Louis, MO) in Apr 2016", "Interview Descriptions": "the online application process was pretty straightforward however, it took a long time to get into the site which may indicate the sheer volume of people applying. It did take a while after I applied before someone from HR contacted me.  me. I enjoyed that all the interviews were one-on-one and there were no panel interviews.", "Interview Questions": "how do you have a balance of life/work"}, {"date": "2 Mar 2016", "title": "Patient Services Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at BJC HealthCare", "Interview Descriptions": "Very easy, Laid-back Interviewers but this definitely could be based on the position. First they will call you and set up a phone interview. The phone interview lasts about 15minutes, they ask around 5 questions as well as the simple ones such as Do you smoke? What is your compensation goal. \r\nOnce this is completed, I received an in-person interview with the office manager where I accepted the position.", "Interview Questions": "Tell me a time you made a mistake?\r\nWhen have you experienced diversity in your life or past job positions.\r\nWhen did you go above and beyond your job title?"}, {"date": "24 Mar 2016", "title": "Patient Account Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at BJC HealthCare (Saint Louis, MO) in Mar 2016", "Interview Descriptions": "I have three interviews; supervisors, peers, manager. The entire process from start to finish took a week. I went through a recruiter who was very helpful through the process and gave me a lot of insight on the job.", "Interview Questions": "What is your greatest strength/weakness?"}, {"date": "15 Feb 2016", "title": "Unit Secretary Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at BJC HealthCare (Saint Louis, MO) in Feb 2016", "Interview Descriptions": "They were very thorough, and very nice.  The job expectations were made very clear.  I interviewed with Human Resources,and then had a group interview in the department.  They offered to let me come back another day to shadow for a couple of hours to see what the job would be like.  I decided that the job was not what I was looking for, and did not pursue it further.", "Interview Questions": "Tell about a time you failed at something on the job."}], [{"date": "17 Jul 2016", "title": "Technical Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at BJC HealthCare (Washington, DC) in Feb 2016", "Interview Descriptions": "Was flawless and it was like any other IT interview. It is comprised of technical and theoretical questions. You have to be more specific while explaining the questions. I have been contacted three days ago and it was kind of promising. I have been scheduled for another face to face interview as well", "Interview Questions": "past history"}, {"date": "28 Jan 2016", "title": "Staff RN Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at BJC HealthCare", "Interview Descriptions": "You shadow a nurse, then you interview with the unit manager, and lastly, you interview with someone at the HR. Pretty backwards but that is how they do it.", "Interview Questions": "Something like: Tell me a time when you were in a \"x\" situation and how was it resolve."}, {"date": "20 Dec 2015", "title": "Medical Exchange Customer Service Representative Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at BJC HealthCare (Saint Louis, MO) in Dec 2015", "Interview Descriptions": "A recruiter was used, who screened references with 30 question surveys, then I was interviewed over the phone for 20 minutes. A few days later I interviewed with the manager, and 2 days after that I was interviewed by team members", "Interview Questions": "Tell me about a time you were able to improve procedures at a job without being asked to do so?"}, {"date": "24 Sept 2016", "title": "Quality Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at BJC HealthCare (Saint Louis, MO) in Dec 2015", "Interview Descriptions": "Applied online after a conversation with the hiring manager. Within a week, HR contacted me asking for references. In-person interview at BJC campus a couple days later with a hiring panel of 3 people, immediately followed by a 1-on-1 conversation with HR. An official offer was extended just under a week later.", "Interview Questions": "Explain a situation where it was difficult to get team buy-in."}, {"date": "28 Nov 2015", "title": "Patient Care Technician Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at BJC HealthCare", "Interview Descriptions": "I filled out an application online. A few days later I was asked to fill out references and take a test. The test was basically like situational. I was asked to come in to shadow a tech for a hour and a half and then a face to face interview with the hiring manager and with other techs (peer interview).", "Interview Questions": "Name a time when you gave excellent care"}, {"date": "24 Nov 2015", "title": "Patient Access Representative Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at BJC HealthCare (Saint Louis, MO) in Nov 2015", "Interview Descriptions": "There were 2 ladies who interviewed me.  They were very nice and down to earth.  They made me feel very comfortable.  It was more of a conversation than feeling like I was put on the spot.", "Interview Questions": "Where do I see myself in 2-3 years."}, {"date": "23 Jan 2016", "title": "Trainer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at BJC HealthCare (Saint Louis, MO) in Nov 2015", "Interview Descriptions": "This was an In person interview, followed by a test on Epic, EPIC 2 hour test,multiple phone calls with HR folks that called repeatedly. \r\nThis was an In person interview, followed by a test on Epic, EPIC 2 hour test,multiple phone calls with HR folks that called repeatedly.", "Interview Questions": "Had to do presentations for interview group."}, {"date": "8 Feb 2017", "title": "Social Work Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at BJC HealthCare (Saint Louis, MO) in Nov 2015", "Interview Descriptions": "This is an interview for practicum students. The interview is easy. My two supervisors interviewed me and they asked some normal and easy questions. The important thing is that you need to make the interview as a conversation and let your employer know your passion and strengths.", "Interview Questions": "what do you want to learn from the internship, what is your previous experiences, do you like documentation because we need to do a lot of documentations, what are your weakness and strengths"}, {"date": "28 Sept 2015", "title": "Case Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at BJC HealthCare (Saint Louis, MO)", "Interview Descriptions": "Questions were not too hard.  Interview was professional, but laid-back.  I met one-on-one with the lady from HR and she was very nice. I then had a second round of interviewing with the supervisor of the position.  After the interview, I didn't hear anything, but followed up with HR every week for any progress.  After 1 month, they told me I had not been chosen, but she recommended me for another position.  After another week I got a second interview for a different position and was offered the job within the next week.", "Interview Questions": "What is your best quality?"}, {"date": "8 Sept 2015", "title": "RCM Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at BJC HealthCare", "Interview Descriptions": "Lenghthy process. Job descriptions are generic and do not match the position being interviewed for. Pay is not listed like other organization (WASHU). It would be nice to know if you are applying for a position within you range however, this information is not available. This potientially wastes the candidate's and HR's times. Not clear about the lenght of the process.", "Interview Questions": "Why are you interested in this position?"}], [{"date": "30 Mar 2019", "title": "Radiologic Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at BJC HealthCare (Saint Louis, MO) in Sept 2015", "Interview Descriptions": "1:1 or 1:2 face to face interview with a couple of supervisors managing each department. Briefly go over the job duties and ask questions about exposure and experiences in the field. weigh highly on trauma and OR experiences.", "Interview Questions": "Are you comfortable running C-arms?"}, {"date": "12 Sept 2015", "title": "Patient Account Representative Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at BJC HealthCare (Saint Louis, MO) in Sept 2015", "Interview Descriptions": "The interview process was done by a very professional but yet down to earth individual. The process began with an online application, then skill testing, then online reference check, HR interview then hiring manager interview.", "Interview Questions": "Why do you want to work for this company?"}, {"date": "17 Aug 2015", "title": "Program Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at BJC HealthCare", "Interview Descriptions": "Initially they were very prompt and forth-coming about how the interview process would work. First round was a phone interview with a Recruiter, followed by a phone interview by the Hiring Manager. Both were fairly easy interviews. Then there was a writing exercise followed by an in-person interview with the Hiring Manager which was basically a repeat of the phone interview. I was told that fit would be the most important part of this interview process.\r\n\r\nShortly afterwards a panel interview was scheduled with 5 people from the team. The interview process was 5 behavioral questions (one question asked by each team member) and was quite short. I was prepared for the behavioral questions and used the STAR technique to answer each other. I was unable to answer the final question that was asked which I think was a mistake since they were rating each of my answers and comparing to the other candidates.\r\n\r\nWhen I followed up 2 weeks later, I was told that a decision would be made in a couple of weeks. Another month went by and I got an email asking for my references. They requested 5 references including 2 managers for an on-line reference system (SkillSurvey) and when my references didn't answer quickly enough, the Recruiter followed-up with me. I didn't hear anything for several more weeks when I received a phone call from the Recruiter letting me know that the Hiring Manager had moved on with other candidates.\r\n\r\nOverall, this was a very time-consuming interview process that was unnecessarily long. The whole process was very impersonal and formal.", "Interview Questions": "Tell me about a time when you have used collaboration skills."}, {"date": "20 Oct 2015", "title": "Cashier Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at BJC HealthCare (Saint Louis, MO) in Aug 2015", "Interview Descriptions": "It was short and to the point. The mangers were very nice and respectful, they made me feel like part of the team already. I met with two mangers and got the Job the next day.", "Interview Questions": "why do you want to work for us?"}, {"date": "16 Jan 2016", "title": "Sonographer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1+ week. I interviewed at BJC HealthCare (Saint Louis, MO) in Aug 2015", "Interview Descriptions": "I was asked to come in for an interview very shortly after expressing interest. I didn't have the typical application process as I was a transfer. The interview was more productive and in depth than any other I've had. The department supervisors who interviewed me asked relevant questions and also took their time answering all of mine. For something that is most often somewhat stressful, I actually enjoyed this one. I was introduced to the staff and given a tour afterwards.", "Interview Questions": "Why I would fit in to the culture."}, {"date": "19 Dec 2015", "title": "Business Analyst Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at BJC HealthCare (Saint Louis, MO) in Aug 2015", "Interview Descriptions": "Interview with recruiter\r\nA bit of a long process with less an ideal communication stream\r\nFollowed with interview with hiring manager that was very conversational. \r\nInterview covered a lot, felt like a blur. Left feeling unsure of my performance. 2 weeks later I was contacted by the recruiter, they asked again why I was looking for a new position and my current salary. I answered then they said they would call back after meeting with the manager. The recruiter called back 20 minutes later and offered me the job.", "Interview Questions": "How do report and solve problems?"}, {"date": "15 Jul 2015", "title": "Performance Improvement Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at BJC HealthCare", "Interview Descriptions": "Step 1: Phone interview with Recruiter - Formal interview questions \"tell me about a time when...\"\r\n\r\nStep 2: Face to Face interview with hiring manager and one team member - Very relaxed conversation, \"walk me through your resume\".\r\n\r\nStep 3: Face to Face interview with Peer team and 2 interviews with Vice Presidents - Peer team had typical interview questions: \"how do you prioritize work\", \"how do you influence others\", etc... VP interview was just a relaxed conversation.", "Interview Questions": "What is the most difficult problem you've ever worked on? How did you "}, {"date": "14 Jul 2016", "title": "Senior Financial Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at BJC HealthCare (Saint Louis, MO) in Jul 2015", "Interview Descriptions": "I came in for two interviews and was told that I would hear from them in 3 weeks. They called back in less than 48 hours.  They must have really wanted me to fill the position.", "Interview Questions": "They asked how I led groups or took initiative on previous projects."}, {"date": "20 Jul 2015", "title": "Staff RN Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at BJC HealthCare (Saint Louis, MO) in Jul 2015", "Interview Descriptions": "The interview process at Children's is different depending on which department you are applying. I applied for 2 ICU's and both of them went differently. \r\n\r\nIn one, I met with the management team including Nurse Manager, Lead Charge Nurse (they call it something different though), and Nurse Educator. \r\n\r\nIn the other, I met with the Nurse Manager and an HR person.", "Interview Questions": "Describe a time when you made a mistake. What did you do after the mistake was made?"}, {"date": "3 Dec 2015", "title": "Supervisor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at BJC HealthCare (Saint Louis, MO) in Jun 2015", "Interview Descriptions": "First a phone interview and then an in-person interview with the hiring manager, the director over the manager, the medical director and then three staff members.  The phone interview was a 10 minute call arranged ahead of time.  Standard HR interview questions from someone who knew really nothing about the position.  The in-person interview wasn't much better.  A director that was full of himself.  A manager that didn't know how to interview.  A physician who already knew who he wanted.  Three staff members just happy to get away from their chores for a while.", "Interview Questions": "Why I would be perfect for the job."}], [{"date": "20 Jan 2016", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 1 week. I interviewed at BJC HealthCare (Saint Louis, MO) in May 2015", "Interview Descriptions": "Applied online after speaking to nurse manager of department.  Talent aquistion called and scheduled phone screening completed.  I had interview with manager and charge nurses.  When I came  for interview,  which I confirmed day prior, all had forgotten.  They discussed the problems of the unit of which I felt I could assist with change.  Offered position when I got home by recruiter.  It was not the full time position I was told.  They said I would make more but since I said yes, they never inquired to increase it.  Started orientation 3 days later.  Very rushed orientation and I feel it was just to get a warm, experienced body to work.", "Interview Questions": "What are your plans for furthering your education"}, {"date": "10 Apr 2018", "title": "Social Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 3+ months. I interviewed at BJC HealthCare (Saint Louis, MO) in May 2015", "Interview Descriptions": "I was contacted by HR to conduct a preliminary phone interview. I was shortly called within a couple days to come in for a day long interview process. It consisted of shadowing a social worker, interviewing with a panel of current social work employees, and finally interviewing with the social work supervisor and manager.", "Interview Questions": "Why do you want to work at Barnes-Jewish Hospital?"}, {"date": "16 Jun 2015", "title": "EVS Manager - PM Shift Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at BJC HealthCare (Saint Louis, MO) in May 2015", "Interview Descriptions": "Interviewed with group of other Managers, but was discounted as not qualified immediately due to lack of experience with Barnes-Jewish, despite 20 plus years experience in the field.  I did not feel appreciated for the work I had done thus far at Barnes-Jewish.  The interview was only a courtesy and they had no intention of giving me a shot at the position.", "Interview Questions": "My understanding of the culture of the organization on the South campus."}, {"date": "14 Jan 2016", "title": "Registered Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at BJC HealthCare (Saint Peters, MO) in May 2015", "Interview Descriptions": "I first received an email asking me to set up a phone interview with the recruiter. After my phone interview I met with the area manager who supervises the medical offices on the BJSPH campus. Once I interviewed with her she then set up an interview for me to meet with the physician and his office manager. By the time I got home I had received a call offering me the position. Total time was about 2-2.5 weeks.", "Interview Questions": "Why do you want to work here?"}, {"date": "7 May 2015", "title": "Implementation Coordinator (EPIC) Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at BJC HealthCare (Saint Louis, MO) in Apr 2015", "Interview Descriptions": "Applied internally through myBJC job portal. The job description matched my skill set, so I sent in my application. I heard back about 2 weeks later asking to schedule an interview. I then received several emails cancelling and rescheduling my interview only to have it end up being back at the original time. When I arrived at the interview, I was asked about my experience. I explained my various jobs and accomplishments as they related to the job description I had read. That turned out to be my biggest mistake. The job description could not have been more inaccurate for the position. I was asked about experience that never showed up on the job description, but was apparently required. Since I did not have this experience, I was essentially told that I was not the right person for the job. The candor of the interviewers was nice in that it did not leave me wondering, but the process on the whole was extremely frustrating. I had essentially prepped for the wrong interview, as the job description posted by HR had nothing to do with what the hiring manager was looking for.", "Interview Questions": "Tell us about yourself.\r\n"}, {"date": "7 Jul 2015", "title": "IT Project Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at BJC HealthCare (Saint Louis, MO) in Apr 2015", "Interview Descriptions": "Interviewer was ill prepared and unaware that interview was a one on one. Questions were more geared to me providing possible solutions to existing project decisions to be made rather than behavioral or technical questions.", "Interview Questions": "Given the scope of the program, how would you manage the overall budget as well as the individual project budgets?"}, {"date": "13 Nov 2015", "title": "RMA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at BJC HealthCare (Saint Louis, MO) in Mar 2015", "Interview Descriptions": "First round was an email to schedule for a phone interview. I want into the office for a second interview with the assistant manager. Thirdly I met the Lead Manager and was hired a couple of days later via call.", "Interview Questions": "Name a time where you had a difficult pt/client?"}, {"date": "13 Jun 2015", "title": "Medical Technologist I Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 3 months. I interviewed at BJC HealthCare (Saint Louis, MO) in Mar 2015", "Interview Descriptions": "Initial communication was consistent and reliable; First interview- talent acquisition specialist; Second interview- lab managers; offer made within two weeks; the talent acquisition specialist was extremely personable and made great efforts to keep me informed throughout the entire process.", "Interview Questions": "What is/are your weakness(es)?"}, {"date": "12 Jan 2018", "title": "Mlt Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at BJC HealthCare (Saint Louis, MO) in Mar 2015", "Interview Descriptions": "They are precise and to the point. I thought i would be there for a long time but that was not the case . It is not easy to get into the BJC network, but once in the opportunities for growth are numerous.", "Interview Questions": "Why Barnes Jewish Hospital of all places?"}, {"date": "31 Mar 2017", "title": "Plant Operations Technician Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at BJC HealthCare (Columbia, MO) in Mar 2015", "Interview Descriptions": "Two interviews with HR  the first as a sceening to determine my qualifications abd the second to determine if I would be willing to accept an offer if it was presented to me,  A third Interview was with a group of 6 co staff and manaqgers,", "Interview Questions": "The specifics of wiring a 3-phase motor"}], [{"date": "3 Apr 2015", "title": "Patient Accounts Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at BJC HealthCare (Saint Louis, MO) in Mar 2015", "Interview Descriptions": "I did a phone interview first. I was asked if I was tobacco/nicotine free (including e-cigarettes) since they are a smoke free company. This was verified during the drug screening. My phone interview took about 15-20 minutes then we scheduled the in person interview at the end of the call. I met with the department manager a few days later. Her interview was very laid back and easy going. It was more like just having a conversation compared to being in an uncomfortable interview. I was offered the position the following morning.", "Interview Questions": "How do you handle conflict? "}, {"date": "22 Jun 2015", "title": "Human Resource Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at BJC HealthCare (Saint Louis, MO) in Feb 2015", "Interview Descriptions": "Typical phone screen that lasts about 10-15 minutes. From there, you will schedule an in-person interview with the recruiter as well as hiring manager. This is usually a few days after the phone screen. The interview may last about an hour or so. Business casual or professional is expected. Interview consists of questions about past experience, why BJC, and company culture.", "Interview Questions": "What do you know about BJC HealthCare?"}, {"date": "11 Feb 2015", "title": "A Salaried Role Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at BJC HealthCare", "Interview Descriptions": "Phone interview - confirming eligibility to work in US.  Questions around customers, difficult situations and projects worked on.  Scenarios with management, situations where influence was needed.  favorite tasks and least favorite parts of the job.", "Interview Questions": "Basic skill questions"}, {"date": "2 Feb 2015", "title": "Patient Account Representative Interview", "results": "No Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at BJC HealthCare", "Interview Descriptions": "Initially the recruiter was very timely and informative. She even went as far as to reschedule my interview when I could not make the first one. After I did go to the interview I heard nothing back.They were aware that I was already employed just looking for a new line of work, the interview ended up being a hour which only consisted of company history and previous job experience. It caused me to be late to my current job, but they never even called me to tell me whether I had it or not. I had even reached out but received no response.", "Interview Questions": "I would say it was just the typical interview questions, it was obvious they were looking for something in particular but Im unsure what it was. "}, {"date": "11 Jan 2015", "title": "RN Interview", "results": "Declined Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at BJC HealthCare", "Interview Descriptions": "Very slow on follow up. It takes HR forever to make a decision. The process leaves a lot to be desired on the communication front. Poor negotiating skills. Salaries do not follow the going market rate.", "Interview Questions": "Standard questions."}, {"date": "16 Feb 2018", "title": "OR Support Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at BJC HealthCare (Saint Louis, MO) in Jan 2015", "Interview Descriptions": "Initially, I received a phone interview. I was asked to interview with HR and then the manager of the department and a peer interview last. Questions were based on professionalism, personality traits, and scenarios.", "Interview Questions": " Describe a time you had with a difficult coworker. How did you handle it? "}, {"date": "19 Oct 2015", "title": "TA Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at BJC HealthCare (Saint Louis, MO) in Jan 2015", "Interview Descriptions": "it was a very long process. I didn't' think that I got the job and then they called me with an offer. it is a great company to work for if you can handle how busy it is.", "Interview Questions": "Tell me about your employment history."}, {"date": "21 Dec 2014", "title": "Patient Care Technician Interview", "results": "No Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I interviewed at BJC HealthCare", "Interview Descriptions": "Process involved a few question quiz on basic vitals and med terms followed by the actual interview. The interview was all situational based and they then told basics about what the job would be expected out of you if you get the position.  Following the interview you went up to meet the lead nurse who would show you around and ask you if you have any questions.", "Interview Questions": "If you have never looked up PCA situation questions Id suggest you do so"}, {"date": "26 Nov 2014", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at BJC HealthCare in Nov 2014", "Interview Descriptions": "Received a call from HR day after I applied to set up first interview. First interview was 2 days later. Received a call the same day after interviewing with HR to set up interview with floor manager. Interview with floor manager was 3 days later. I received an offer 3 days after my second interview.", "Interview Questions": "No difficult questions. The interview was almost too easy. So easy I thought there was no way I would receive an offer due to lack of interest from floor manager. "}, {"date": "14 May 2016", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at BJC HealthCare (Saint Louis, MO) in Oct 2014", "Interview Descriptions": "Very informal; quick and to the point; Process I felt was quick and easy. I was referred by a current employee so that might have sped up the interview process but I was contacted by HR and then directly by the manager. During my interview, the manager informed me I could be expecting my offer letter by the end of next week.", "Interview Questions": "Name a time in which you had encountered a difficult surgeon"}], [{"date": "6 Sept 2014", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at BJC HealthCare (Saint Louis, MO)", "Interview Descriptions": "HR sets up a phone I interview followed by face to face with Nurse Manager. The process took about 1-2 weeks. It does help if you are referred by someone from the inside.", "Interview Questions": "What are your strengths and weaknesses?"}, {"date": "5 Feb 2016", "title": "Patient Access Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 2 months. I interviewed at BJC HealthCare (Alton, IL) in Sept 2014", "Interview Descriptions": "Phone and group and peer interview. It was very unprofessional. The manager was typing on her computer the whole time I was being interviewed by two other ladies. she was very in personable.", "Interview Questions": "Tell us why we should hire you?"}, {"date": "13 Oct 2015", "title": "Health Informatics Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at BJC HealthCare (Saint Louis, MO) in Sept 2014", "Interview Descriptions": "Generic phone interview with simple questions.  Then brought on site for an in person interview.  There were a total of three managers that interviewed me, each for 30 minutes, and also an additional 30 minutes to speak with current interns in the division to which I applied.", "Interview Questions": "Explain start to finish how you would approach a new project/analysis."}, {"date": "18 Aug 2014", "title": "Patient Care Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at BJC HealthCare", "Interview Descriptions": "Interviewed with someone in HR before choosing a specific floor or unit to interview.  Once I passed the interview in HR, my information was passed onto the unit I was interested in and an interview time was set up.  The floor interview was quite easy as the Nurse Manager was off and the charge nurse conducted a 1:1 interview.  Since that time, they incorporated group interviews into the process.", "Interview Questions": "Don't remember.  Many questions come from a list generated by HR."}, {"date": "7 Nov 2017", "title": "CSPD Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 months. I interviewed at BJC HealthCare (Saint Louis, MO) in Aug 2014", "Interview Descriptions": "Hr phone call for a phone screening and then came in person for an in person meeting and then with the manager. Overall the general questions and process was not difficult.", "Interview Questions": "What is your weakness/strengths?"}, {"date": "23 Jun 2014", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 4 days. I interviewed at BJC HealthCare", "Interview Descriptions": "The overall process began with a telephone screen, followed by several group, panel, and individual interviews.  The interviews were both straightforward and relaxed, and I was met with a sense of dignity and respect.  Very thorough and fair process, which I believe gave me significant insight into the culture of the organization. This is a a very high performing organization, and truly talented managers are critical.", "Interview Questions": "Why do you want to work in Academic Medicine?"}, {"date": "27 Sept 2015", "title": "Staff Nurse Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at BJC HealthCare (Saint Louis, MO) in Jun 2014", "Interview Descriptions": "I had a phone interview initially. Round two consisted of unit shadowing that lasted about three hours. The shadowing was followed by a question and answer process with the unit manager and lead charge nurse.", "Interview Questions": "How do you know/think you could handle a high stress environment with a high patient load?"}, {"date": "10 Sept 2016", "title": "Financial Analyst Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 6 weeks. I interviewed at BJC HealthCare (Saint Louis, MO) in May 2014", "Interview Descriptions": "Hiring manager was very distant. Did not write down answers or make much eye contact. All she did was rattle off questions. The questions were standard behavioral interview questions. It was a slightly confusing interview. Typically I can tell how it went but honestly she seemed to not care at all. I was shocked to hear back and truthfully she hasn't seemed to care much at all since I started working.", "Interview Questions": "Do not remember the questions?"}, {"date": "12 Aug 2014", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at BJC HealthCare in Apr 2014", "Interview Descriptions": "6 people interviewed me. Ask questions about my background of previous position. Ask some random questions about my experience in different places and describe yourself as they read my resume. They were very nice. Just be cool, and you can survive.", "Interview Questions": "Use three words to describe yourself. This is challenging one. Try to use stories to support the three words instead of only three words."}, {"date": "21 Mar 2014", "title": "Office Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I applied in-person. I interviewed at BJC HealthCare", "Interview Descriptions": "They asked me 0 questions and asked me instead what questions I had.  I had researched the position in advance so was ready.", "Interview Questions": "N/A"}], [{"date": "6 Mar 2014", "title": "Pharmacy Technician II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at BJC HealthCare", "Interview Descriptions": "The HR lady was very rude. But the people in the department was fair and to the point. You have to certified to get into this position. The interview did not take long at all. Interviewed with two people. They didn't start me off with the right pay it was less than what I was entitled to.", "Interview Questions": "N/A"}, {"date": "20 Jul 2016", "title": "Patient Account Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at BJC HealthCare (Saint Louis, MO) in Mar 2014", "Interview Descriptions": "Long interview process. Interview with a panel of supervisors and HR reps.  Initially did an over the phone interview, then was scheduled for an interview with the HR rep.  Then HR rep left and 3 supervisors/managers came in and interviewed me as well.", "Interview Questions": "Why you want to work for BJC?"}, {"date": "29 Apr 2016", "title": "FMLA Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at BJC HealthCare in Mar 2014", "Interview Descriptions": "One on one then panel interview. Turn around time to hear from a recruiter took about two months. Manger is very pleasent and professional as well as the team. I could definitely tell they stand behind their mission.", "Interview Questions": "Do you have peoplesoft experience"}, {"date": "10 Jun 2014", "title": "Pct Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at BJC HealthCare in Mar 2014", "Interview Descriptions": "It was a nice experience they were really interested in what I wanted to do with my future. They were concerned about all of the experience I've had in the past and why I left my last position. I actually recieved a call back the next day after my interview.", "Interview Questions": "What are you expecting to get paid."}, {"date": "10 Jul 2018", "title": "Medical Staff Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at BJC HealthCare (Saint Louis, MO) in Feb 2014", "Interview Descriptions": "I was initially contacted by a recruiter to schedule the interview.  The manager interviewed me and then I met with the other staff members.  Very easy going interview. Questions comprised of the basics as well as behavioral type questions.", "Interview Questions": "Tell me about yourself."}, {"date": "17 Sept 2015", "title": "Patient Care Technician Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at BJC HealthCare (Saint Louis, MO) in Feb 2014", "Interview Descriptions": "The interview was read word for word from a book. The human resource person would read a question and I was to interpret and answer to the best of my ability. The human resource person was not allowed to explain the questions or use any other words than what had been written in the book; all that they were allowed to do was repeat the question. My responses were then recorded as I spoke them. If I found a question particularly troubling I was allowed to skip it; but, it was bookmarked and revisited at the end. However, \"I don't know\" did prove to be a viable answer.", "Interview Questions": "The questions were like those of many online pre-employment tests that ask the same question in several different was to check you moral compass and determine if you would be a good fit for their organization. There were also the standard, \"Tell me something about yourself\" type of questions."}, {"date": "8 Oct 2017", "title": "Patient Account Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at BJC HealthCare (Saint Louis, MO) in Feb 2014", "Interview Descriptions": "There was phone interview. Then a panel interview. With hr, manager, supervisor. My interview was an hour. The group was nice and I didn't feel nervous. I felt confident when I left.", "Interview Questions": "If you had to choose in a group which one would you be? A leader, supporter, analyzer?"}, {"date": "25 Jan 2014", "title": "Research Associate Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied through an employee referral. I interviewed at BJC HealthCare", "Interview Descriptions": "Emailed resume and coverletter, took a few weeks to hear for interview invitation, 3 panels in the interview group, went for an hour, took a couple months to hear the result", "Interview Questions": "Describe your three achievements in your life "}, {"date": "25 May 2015", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at BJC HealthCare (Saint Louis, MO) in Jan 2014", "Interview Descriptions": "Interviewed by an HR representative and then interviewed by floor manager, 2 Lead Charge Nurses. I received a phone call with a job offer as I was driving away in the car. This is not always the case though, as I interviewed for another floor a year later and it took them 2 weeks to call me and offer me the job.", "Interview Questions": "What's the thing you love most about your current job?"}, {"date": "20 Feb 2014", "title": "Full Time CNA Day Shift - Progress West Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at BJC HealthCare (O Fallon, MO) in Jan 2014", "Interview Descriptions": "The women in HR were very unorganized and poor communication with each other. They took a long time to return any of my calls. I wouldn't apply for another position or would ever want to work there.", "Interview Questions": "Would you accept night shift?"}], [{"date": "21 Apr 2015", "title": "Mental Health Social Worker (Unlicensed) Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at BJC HealthCare (Saint Louis, MO) in Jan 2014", "Interview Descriptions": "Meet with HR then direct supervisor. HR asked more general questions as supervisor was more job specific. Was tested on skills of Microsoft. Passed test, meet with supervisor and was told I got the job 1 hour after the interview.", "Interview Questions": "What is your greatest weakness?"}, {"date": "29 Oct 2018", "title": "Business Process Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 3 months. I interviewed at BJC HealthCare (Saint Louis, MO) in Jan 2014", "Interview Descriptions": "multiple inteviews with department leaders to gage abilities related to solving business process issues (patient management) vs hard core engineering problem solving (my background) in a non technical environment (hospital)", "Interview Questions": "process mapping experience"}, {"date": "17 Dec 2013", "title": "Clinical Engineer Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at BJC HealthCare", "Interview Descriptions": "Most new hires go through an internship process. It is a very informative period where the intern learns a great deal about a wide variety of equipment.", "Interview Questions": "There were no difficult questions for me"}, {"date": "5 Nov 2013", "title": "Program Manager Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at BJC HealthCare", "Interview Descriptions": "Phone interview with HR was initial step and followed by panel interview with potential team members.  Final interview was with director.", "Interview Questions": "Questions were standard behavioral based related to projects."}, {"date": "5 Sept 2013", "title": "Performance Improvement Consultant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 3 weeks. I interviewed at BJC HealthCare", "Interview Descriptions": "There was a several week delay between my first contact and a call to schedule the face to face interview.  Once the interview finally happened it was a panel of about 10 people asking me questions from a list.  Normally it would have been intimidating but everyone was very laid back and friendly.  I was asked back the next day for a second face to face interview with the departments Sr. Management.  These were just a formality and one last chance to make sure I was not a jerk.  The offer came within the week.", "Interview Questions": "Not any one question comes to mind.  Be prepared to discuss in detail  your experience with Lean and Six Sigma."}, {"date": "12 Aug 2013", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at BJC HealthCare", "Interview Descriptions": "Get through interview with HR then they will send you to the office for an interview with the Office manager.  If the office manager likes you then you can meet the Doctors and they choose after that", "Interview Questions": "How do you see yourself helping our practice?"}, {"date": "1 Sept 2015", "title": "Unit Secretary Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at BJC HealthCare (Saint Louis, MO) in Aug 2013", "Interview Descriptions": "Applied online then a few weeks later I received a call from HR and they did a phone interview. Very nice people in HR. She set me up with the nursing manager of the orthopedics unit where I would be working. I went to the orthopedics floor and took a tour of the facility, then went back for my interview. She was very nice and knew I was a nursing student so she said I would be able to go to conferences for free while I worked here, which was a nice benefit! Then after the interview I was able to shadow one of the secretaries on duty and she told me I got the job! I started a few weeks later.", "Interview Questions": "What I wanted out of working at BJH."}, {"date": "17 May 2013", "title": "Group Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 12 months. I interviewed at BJC HealthCare (Saint Louis, MO)", "Interview Descriptions": "The interview process took nearly 2 years.  It was a new/specialized position in an innovative area charged with standardizing systems and processes across hospitals that had previously been autonomously organized.  I talked with people representing business, information technology, methodology and management over about 15 meetings.\r\nThis was an exciting opportunity to establish new project delivery practices in a fast-paced, highly charged, highly visible, and highly valuable work environment.\r\n<Note that this page does not allow interview processes to take ove 365 days.  This one was non-standard and took nearly 2 years.>", "Interview Questions": "What area do you want to focus on?  Process improvement, quality management, project management?"}, {"date": "29 Oct 2015", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at BJC HealthCare (Saint Louis, MO) in Apr 2013", "Interview Descriptions": "It was a really nice experience. I have worked at BJC for 7 years. Both interviews went really well for me that I had there. First as a pct than an a RN. The hiring process after the interview was quick and painless. They do seem to want an individual who is very much a team player and that has a lot of initiative. Of course that is important, especially for a nurse.", "Interview Questions": "What would you do if you and a coworker had a dispute?"}, {"date": "24 Mar 2013", "title": "Technical Specialist Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 1 day. I interviewed at BJC HealthCare", "Interview Descriptions": "The interview was impersonal and unprofessional. The HR recruiter was late and she was very blunt. The first question asked was what it would take for me to convert from a contractor to and FTE. I wrote down a number and was told it will never happen.", "Interview Questions": "What would it take for you to convert to FTE."}], [{"date": "11 Mar 2013", "title": "Senior Recruiter Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through a staffing agency. The process took 4 days. I interviewed at BJC HealthCare", "Interview Descriptions": "After an initial phone screen, I met with the hiring manager and another recruiter who I would be assisting.  They took turns asking me behavioral-based questions about my work history to have me demonstrate how my skills and values fit in with the culture of BJC.  There wasn't a lot of time spent on my ability to do the job (they trusted the staffing agency to establish that).", "Interview Questions": "BJC utilizes behavioral-based interviewing.  Be prepared to answer their questions with specific scenarios from your work history (i.e. discussing conflicts with employees, demonstrating decision-making skills, etc.)"}, {"date": "10 Feb 2013", "title": "Senior IT Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. I interviewed at BJC HealthCare (Saint Louis, MO)", "Interview Descriptions": "Interviewed originally for consulting position.", "Interview Questions": "Do not remember.  Interview was pleasant and not difficult."}, {"date": "31 Oct 2016", "title": "Gift Shop Clerk Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at BJC HealthCare (Saint Louis, MO) in Feb 2013", "Interview Descriptions": "Total of 3 interviews.  Had a phone interview. Then an interview with HR. Then an interview with two hiring managers. Very long process. Very strict on references. Drug test required. If you smoke you may not get hired. Must pass TB test and have flu shot. Took 2 weeks to get a response.", "Interview Questions": "What are your weaknesses?"}, {"date": "29 Jun 2017", "title": "IS Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at BJC HealthCare (Brentwood, MO) in Jan 2013", "Interview Descriptions": "It was one phone interview with six questions. This was for an entry level job requiring very little experience. The offer was sent by email and nobody told me I got an offer. While I was working here they looked at ways to improve the interview process.", "Interview Questions": "Describe a time you went out of your way to help a customer."}, {"date": "10 Feb 2013", "title": "C++/Perl Developer Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 3 days. I interviewed at BJC HealthCare (Saint Louis, MO) in Oct 2012", "Interview Descriptions": "1 on 1 interview with two project managers. Both wanted me hired, so all that was left was the HR side of the hiring process.", "Interview Questions": "Nothing difficult at all. Both PM's just wanted to see how you think and problem solve"}, {"date": "11 Sept 2012", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 3 weeks. I interviewed at BJC HealthCare (Saint Louis, MO)", "Interview Descriptions": "Applied on several occasions, without contact.  Ended up getting solicited by a recruitment firm who got me in front of the hiring managers.  The process just took a few weeks.", "Interview Questions": "Most of the questions were around my area of expertise."}, {"date": "20 Sept 2014", "title": "Patient Care Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at BJC HealthCare in Sept 2012", "Interview Descriptions": "Pretty simple. Applied online, HR phone call, interview with hiring manager, group inteview. \r\n Applied online then HR contacted me by phone two weeks later asking if I was still interestered. Scheduled an in person interview for a few days later. First interview was with hiring manager (nursing manager of the unit). This interview was super laid back, we talked casually for a few minutes then she asked me about my self and then asked for an example of why I decided to work in health care. She then showed me around the unit and met potential coworkers. Hiring manager explained that they were conducting a few more interviews and she would contact me and let me know about the next phase of the process which is a group interview. 4 days later I was contacted for the group interview. Again, group very friendly and asked scripted behavior based questions and wrote down what I said. Manager said they would be in contact if they wished to proceed. Week later HR called with offer. Then didnt hear from them for 2 weeks. Had to call twice in order to schedule background and drug screen and new employee cultural orientation.", "Interview Questions": "Give an example of a time you encountered an unexpected obstacle outwork, how did you handle it, what was the outcome? "}, {"date": "30 Dec 2015", "title": "Unit Secretary Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at BJC HealthCare (Saint Louis, MO) in Aug 2012", "Interview Descriptions": "first phone interview, then interview with HR which was very friendly and laid back, this is when they asked all the question for example.. describe a time when..., then interview with department manager, she basically desribed the position more in detail, all the responsibilites, schedule, ect. then scheduled a time to come in and shadow for the position which i applied for. after that entire process HR will call you with the job offer.", "Interview Questions": "describe a time when you experienced diversity"}, {"date": "3 Oct 2014", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at BJC HealthCare in Apr 2012", "Interview Descriptions": "I met with a manager and director from the department. I received a series of behavioral interview questions. The tone was conversational. They seemed to assess fit as much or more than prior experience. I had time for questions.", "Interview Questions": "Nothing that caught me off guard."}, {"date": "12 Jan 2016", "title": "Patient Access Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at BJC HealthCare (Saint Louis, MO) in Apr 2012", "Interview Descriptions": "I was called to do an over the phone interview and tow day later I was given a face to face interview. two weeks later I was offered the job.", "Interview Questions": "why are you leaving your current job?"}], [{"date": "3 Jan 2014", "title": "Patient Care Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at BJC HealthCare (Town and Country, MO) in Mar 2012", "Interview Descriptions": "Thorough interview with HR, followed by secondary interview with unit manager.", "Interview Questions": "I honestly cannot remember the most difficult question.  I think I tend to struggle with the \"give an example of a time you had a conflict\" questions.  This is mostly because I don't like confrontation, nor do I encounter many conflicts."}, {"date": "25 Mar 2012", "title": "Lead Charge Nurse1 Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at BJC HealthCare (Saint Louis, MO) in Mar 2012", "Interview Descriptions": "The  charge nurse interview was in two parts. I interviewed with one of the nursing directors as well as a second panel type interview with the nursing manager as well as about 4 other charge nurses and managers from the hospital. I was also able to shadow a nurse on the floor to help me see what the environment is like. Interview questions were open ended and experience related. I felt that the staff on the floor was very open and friendly. They told me what was good and bad about the floor. Teamwork seemed to be above average but employee satisfaction seemed average.", "Interview Questions": "None of the questions were really unexpected. Expect questions about how you would handle different situations, or how would you expect to handle coming into a floor from an outside hospital."}, {"date": "13 Jan 2016", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 1 day. I interviewed at BJC HealthCare (Saint Louis, MO) in Feb 2012", "Interview Descriptions": "Met with Nurse Manager to review my application and perform questionaire. This was a face to face with 3 different managers. A tour of the office as well as introduction to other team members", "Interview Questions": "how do i respond to different culture\r\n\r\nwhat are my goals within the job"}, {"date": "8 Mar 2016", "title": "Unit Secretary Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at BJC HealthCare (Alton, IL) in Feb 2012", "Interview Descriptions": "Went in front of a hiring panel, everyone made me feel confortable, asked questions, and was very nice. That made me want to work there, very organized, very good management. I was very pleased.", "Interview Questions": "Why did I want to work there?"}, {"date": "21 Dec 2013", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at BJC HealthCare (Saint Louis, MO) in Nov 2011", "Interview Descriptions": "helped to know somebody.", "Interview Questions": "Cant really recall"}, {"date": "25 Apr 2012", "title": "Nursing Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 1+ week. I interviewed at BJC HealthCare (Creve Coeur, MO) in Oct 2011", "Interview Descriptions": "It was a great experience. Very friendly staff and HR was wonderful!", "Interview Questions": "Change you have made in someone's life"}, {"date": "17 Feb 2012", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 1 week. I interviewed at BJC HealthCare (Saint Louis, MO) in Jun 2011", "Interview Descriptions": "Different facilities have different processes. There is always a phone interview from corporate HR, then local HR, then 1 on 1 HR with a personalty test. Then there is an interview with the Manager of the department. Then some facilities will have a group interview with different members of the department all represented.", "Interview Questions": "Give an example of a time when you could have given better care.  Why did it happen, and what will you do to avoid this in the future. "}, {"date": "30 Jun 2012", "title": "Staff Nurse Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at BJC HealthCare (Saint Louis, MO) in Mar 2011", "Interview Descriptions": "I applied online and received a call from a recruiter.  I had a phone interview, then was invited to come in for a face to face interview.  From there, I had an interview with the Lead Charge Nurse of th unit.  She offered me a position and I accepted.  They still had to do a background check and a company physical with drug test.  Since I was on a medication that would show up on a drug test, I brought a note from my physician, the prescription bottle, and receipt from the pharmacy.  After \"failing\" the drug test, I was told that everything would be put on hold while my drug test would be verified by gas chromatography to make sure that was really the medicine I was taking.  This took 2 weeks.  After the results came back and they proved I was taking my prescribed medication, I had to have the pharmacy receipt faxed to the occupational health doctor.  This was the same receipt I brought with me whem I took the drug test and the occupational health nurse refused to take.  After this, I signed my papers and started orientation within the next week or so.", "Interview Questions": "What are your strengths and weaknesses?"}, {"date": "19 Feb 2011", "title": "Project Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 1 day. I interviewed at BJC HealthCare (Saint Louis, MO) in Feb 2011", "Interview Descriptions": "The arrangements for the interview were very concise and clear.  Very nice office environment.  Met with HR first and found the rep to be very personal and friendly.  General questions regarding my current situation were asked and followed by a couple of questions like \"give me an example of when you had a situation that turned out poorly and tell me what you learned from it.\" \r\n\r\nThe next group had an HR Rep and an employee.  They asked several questions like \"tell me when you had this experience\" with regard to systems, groups worked with, scope of your job, etc.  The questions were meant to get an idea of how many people you managed, how large groups were that you worked with and other metrics in your past experience. \r\n\r\nThe last group consisted of managers.  It was the end of the day, the interview schedule had gone past the scheduled time and they appeared tired.  They asked similar behavioral questions, similar to the previous group,.  They also asked \"how\" you completed tasks, interacted with people, how you determined priorities.  It seemed like they were waiting for a pre-determined answer and I could tell that my responses did not hit the keywords they were searching for.  \r\n\r\nThe interview exceeded the time allowed, so I did not get to ask the questions that I had planned to ask.  Each group had a long list of questions and it was evident that they did not allow enough time to get through the list, nor did they allow enough time to probe deeper into some of the questions.  \r\n\r\nThe groups did not describe the position well nor did they describe what they needed in the position; this made it difficult to accurately target responses to show how my experiences would meet their needs.  They preferred to ask all of the questions without giving much guidance, waiting for the candidate to say the magic words.", "Interview Questions": "What is the largest group that you have worked with?"}, {"date": "14 Dec 2015", "title": "Internal Audit Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at BJC HealthCare (Farmington, MO) in Feb 2011", "Interview Descriptions": "Standard HR interview with usual questions regarding education and previous employment. Met with HR to review resume and qualifications. After HR interview another interview was scheduled by phone with the department managers of several hospital departments due to multiple openings. The second interview day was spent touring the facility and meeting/interviewing with departmental managers. The final interview was a peer interview with several nurses and a unit secretary from the preferred unit. All of the meetings consisted of basic questions reviewing work ethic, personality, handling of difficult situations, and examples of such from professional experience.", "Interview Questions": "Why should we not hire you?"}], [{"date": "6 Nov 2015", "title": "Staff Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at BJC HealthCare (Alton, IL) in Jan 2011", "Interview Descriptions": "Phone interview with HR\r\nInterview with branch manager\r\nPrompt response from HR to online application process.  Used Taleo at the time.  Phone screen went well and on-site interview set up.  Branch manager held interview.  Polite and professional.  Good interview technique.  After interview, an offer came within a couple of days.", "Interview Questions": "How would you handle a situation with an unhappy family member or patient?  Situational questions..."}, {"date": "15 May 2014", "title": "Resident Physician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 1 day. I interviewed at BJC HealthCare (Saint Louis, MO) in Nov 2010", "Interview Descriptions": "Match system.  Interviews for internal medicine were extremely low pressure.  If they invite you to interview, it's because of your test scores, alma mater, and/or research.  Ranked this residency program #1 and matched.", "Interview Questions": "N/A"}, {"date": "11 May 2014", "title": "Department Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at BJC HealthCare (Saint Louis, MO) in Aug 2010", "Interview Descriptions": "Apply online and submit resume, 1st HR interview, then CNE, then panel of peers; went in for full day of testing including personality type, IQ and behavior. Met with president and medical director prior to offer.", "Interview Questions": "Nothing unexpected- behavior based, scenarios"}, {"date": "16 Jan 2014", "title": "RN Case Manager/Supervisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at BJC HealthCare (Saint Louis, MO) in May 2010", "Interview Descriptions": "Interviewing process was with the Management team (Manager and Director of the CM Department). Interviews were focused on professional approach to job responsibilities and job integrity; able to answer appropriately and given my response with conducting myself according to the policies and proceedures of the organization. Hiring process handled through HR.", "Interview Questions": "How would I handle a difficult employee?"}, {"date": "17 Feb 2014", "title": "Senior Systems Analyst Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 4 weeks. I interviewed at BJC HealthCare (Saint Louis, MO) in Mar 2010", "Interview Descriptions": "It was a traditional panel interview with the hiring manager and a panel of peers.", "Interview Questions": "How do you troubleshoot a WINS problem."}, {"date": "9 Feb 2010", "title": "SQL Server Report Writer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 1 day. I interviewed at BJC HealthCare (Saint Louis, MO) in Jan 2010", "Interview Descriptions": "I spent the first hour with two very nice women answering personality and team cooperation questions - how would I handle an uncooperative co-worker, how would I handle a situation where I knew the boss was wrong, etc. etc.  Most of the questions were fairly standard, but I got the impression that they must have had problems in the past with computer people with poor social skills.  \r\n\r\nThe second hour I spent discussing technical questions with two of my potential teammates.  They were standard questions and dealt primarily with the skills required by the job.  Only a couple of them were of the \"obscure detail\" variety - the questions interviewers ask, not so much to see if you know the answer, but more to see how much you will try to BS your way out of admitting not knowing the answer.", "Interview Questions": "What experience do you have with SQL Server Reporting Services?"}, {"date": "28 Jun 2010", "title": "Senior IT Business Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 3 days. I interviewed at BJC HealthCare (Saint Louis, MO) in Oct 2009", "Interview Descriptions": "Very cordial and friendly", "Interview Questions": "Don't remember"}, {"date": "31 Oct 2012", "title": "Staff Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at BJC HealthCare (Saint Louis, MO) in Sept 2009", "Interview Descriptions": "Human Resources arranged an interview with their department after I posted a resume. When that went well I was emailed about setting up interviews with members of management in the department I desired to work in.  I was given a tour of the facility and introduced to other staff members.", "Interview Questions": "If you had a problem with an specific employee how would you handle the situation?"}, {"date": "1 Dec 2009", "title": "Performance Improvement Engineer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at BJC HealthCare (Saint Louis, MO) in Sept 2009", "Interview Descriptions": "Had a phone interview with the hiring manager and HR person listening to the call.  Spent about 45 minutes answring the questions.  Did not hear from them at all.  Repeaed calls to HR not returned.  I am assuming they are not interested.  How about having taking the time to send email or letter?", "Interview Questions": "What are the differences you would expect from a hospital enviroment?"}, {"date": "6 Apr 2013", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at BJC HealthCare (Saint Louis, MO) in Jun 2009", "Interview Descriptions": "casual. interviewers were ok.", "Interview Questions": "nothing unexpected or difficult"}], [{"date": "14 Sept 2013", "title": "Private Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 4 months. I interviewed at BJC HealthCare (Saint Louis, MO) in Feb 2009", "Interview Descriptions": "interviewed after internship  was told I got the job - offer then retracted when an insiders friend wanted it.  Was hired about 6 months after that when new opening", "Interview Questions": "N/A"}, {"date": "10 Sept 2010", "title": "Performance Improvement Consultant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at BJC HealthCare (Saint Louis, MO) in Dec 2008", "Interview Descriptions": "Phone interview was straight forward.  In person interview was with a panel.  The lead of the panel referred me to the director.  I asked lots of questions in the interview with the director.", "Interview Questions": "Tell me about a time when.........."}, {"date": "12 Jul 2010", "title": "Senior Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. The process took 1+ week. I interviewed at BJC HealthCare (Saint Louis, MO) in Jan 2008", "Interview Descriptions": "I got a call from the recruiter from the staffing agency.  The recruiter met me in person and talked about the position.  The recruiter spoke with the company and set up an interview.  The interview consisted of an interview with the managers of the position and then a group interview with the team.", "Interview Questions": "Open ended interviews, \"tell us about your past\", etc... no questions with concrete answers."}]]