[[{"date": "17 Mar 2023", "title": "Office Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Apicha in Jan 2023", "Interview Descriptions": "I applied to work at Apicha because I have worked with them on a freelance project before and liked the work they do. Being a queer POC means it's been hard for me to find sustainable work in a workplace that is supportive and affirming to my identities, so I was super excited when Apicha contacted me for an interview. I spoke to one of the employees and we had a nice chat about what the position entails, what I was looking for and my skills etc. I sent a thank you note after our interview and she responded asking me for my references and told me she would reach out to them. I thought this was a great sign and made sure to contact my references and let them know she was reaching out. They informed me that they had completed the reference sheet she had sent, so I know for a fact she got that information. Then....I never heard back from them, completely ghosted me! I emailed the same woman I spoke with multiple times to see if there was any updates. Even receiving a rejection would have been better than absolutely no response. I think it's highly unprofessional and makes your workplace seem disorganized that you can't even send out an automated email just to let people know they haven't been selected. The job market is incredibly difficult right now and even more so for someone at the intersection of my identities. As an organization that is supposed to support people like me I found this incredible disappointing. Don't even bother wasting your time on this place.", "Interview Questions": "What interests you about this position? Strengths and weaknesses. Managing conflict."}, {"date": "17 Dec 2022", "title": "Digital Marketing Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Apicha", "Interview Descriptions": "The interview process was great. I had a total of three interviews. The first was a phone interview, and the last two were on Zoom. I met more of the team at each interview session and got to know them.", "Interview Questions": "Two things that they asked me were about my education and previous experience qualifications."}, {"date": "25 Feb 2021", "title": "Patient Navigator Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Apicha in Feb 2021", "Interview Descriptions": "An entirely unprofessional and disrespectful interview.\r\n\r\nMy interview was conducted by two employees.\r\n\r\nAt the start of the interview I was asked to describe myself. I was also asked if I have had any conflicts with supervisors in the past, how I would handle any conflicts with a supervisor if I worked at Apicha, and how I would respond in a situation with a naked, potentially violent client.\r\n\r\nToward the end of the interview I was asked if I would be willing to change my appearance. I was told that my hair was unprofessional, that I did not align with Apicha's image, and that I needed to present myself in a way that I could be seen as a face of the company.\r\n\r\nThe second interviewer attempted to correct their colleague's statements by explaining that I would actually be required to change my appearance for my own protection and safety. They stated that my hair color could be a trigger for certain clients who may react violently and want to rip my hair out.\r\n\r\nIt should be noted that the position I interviewed for is currently 100% remote. \r\n\r\nAll in all, the interview was difficult to schedule, did not include a standard line of questioning, and ended with antiquated and discriminatory comments about my appearance and professionalism. \r\n\r\nAs an organization that serves and employs members of the LGBTQ community, it is deeply saddening that the diversity in appearance of Apicha's employees would not be reflective of the diversity within the queer community.\r\n\r\nI can only hope that this post serves a purpose and that no applicant, employee, or client will have to endure similar treatment in the future.", "Interview Questions": "Tell us a little bit about yourself.  How would you handle a conflict with a supervisor if you were hired at Apicha? How would you respond in a situation with a naked, potentially violent client?"}, {"date": "29 Apr 2020", "title": "Case Manager Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Apicha", "Interview Descriptions": "We sat down in the office and I interviewed with the managers. They were very friendly and the interview lasted about 30 minutes and I heard back a few days later.", "Interview Questions": "What would you do if there's a disagreement between you and your supervisor? "}, {"date": "22 May 2021", "title": "Care Coordinator Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Apicha (New York, NY) in Jul 2019", "Interview Descriptions": "I was interviewed by two people, one of whom would be the direct supervisor for the position (and a team of others). They were both friendly. One person took more notes while the supervisor asked more of the questions. They challenged me in their questions which I felt was good. I initially applied for a different position than the one they interviewed me for, but they interviewed me for a job that was more challenging and interesting and ultimately a step up from where I was at the time (and what I applied to), but not what I was looking for. There was a writing portion that involved problem solving in different scenarios which was challenging, but I felt prepared for (having worked in a similar position but on a smaller scale) that the interviewers weren't in the room for. There was plenty of room for asking questions. The biggest impression that I got was that they wanted to make sure that I was dedicated to the work, that I could handle challenging situations and problem-solve in the moment, and that they wanted retention (AT LEAST more than a year). They also wanted to make sure that I could grow into the job, even if I hadn't worked at that scale before. The main challenge was that I applied for a certain position and they considered me only for a different one.", "Interview Questions": "They asked how they could trust that I would stay at the organization for a year or more and not just leave, since I was leaving my other job. They also asked how the position fit into my future career goals in the medical field. They asked what I would do under distressing circumstances with patients who might be suffering from mental health breakdowns or other challenges."}, {"date": "9 Jan 2017", "title": "Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at Apicha (New York, NY) in Sept 2016", "Interview Descriptions": "The interview process was good and timely between 1st and 2nd interviews. First interview was a one on one then the second interview was a panel of interviewers.  I was notified over the phone and via email regarding the status of my application.", "Interview Questions": "What I know about the organization."}, {"date": "17 Dec 2016", "title": "Care Navigator Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 days. I interviewed at Apicha (New York, NY) in May 2015", "Interview Descriptions": "Awful, confusing, miscommunication, delay in getting return calls, asked rhetorical questions, difficulty understanding role of position, condescending attitude, unapproachable, standoffish, meditated, unorganized, catty, insensitive, lack of empathy, rude, seemed bored, repetitive questions", "Interview Questions": "Why are you interested in healthcare?"}, {"date": "19 Apr 2015", "title": "Care Manager Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Apicha (New York, NY) in Feb 2015", "Interview Descriptions": "One of the worst, unproductive and awkward interviews I've ever had in my 10 years working in case management. If you are looking to feel judged as a person instead of a potential employee, asked more about how or what you would do in cases when given \"directives\" (which I'm assuming is, if asked to do something related to your job and not as if you are some sort of CIA operative), then this is the place to look for your next job. Also, be ready to feel (regardless your work experience whether it be fresh out of school or after having 10 years of REAL experience) like you are inadequate & incapable.", "Interview Questions": "If you were given a directive by your supervisor, what would you do?"}, {"date": "3 Nov 2017", "title": "Customer Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Apicha (New York, NY) in Jan 2015", "Interview Descriptions": "Easy, interviewer will ask common questions. Three representatives of the company will interview. If they like you they will hire you in two weeks. Company is funded, no negotiation regarding salary.", "Interview Questions": "Tell us something about yourself."}, {"date": "13 Oct 2014", "title": "Program Manager Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Apicha", "Interview Descriptions": "Awful, confusing, miscommunication, delay in getting return calls, asked rhetorical questions, difficulty understanding role of position, condescending attitude, unapproachable, standoffish, meditated, unorganized, catty, insensitive, lack of empathy, rude, seemed bored, repetitive questions", "Interview Questions": "If you were given a directive, would you follow through?"}], [{"date": "18 Nov 2015", "title": "Patient Care Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 8 weeks. I interviewed at Apicha (New York, NY) in Jun 2013", "Interview Descriptions": "I submitted an application online via a website like Indeed. I heard back within three weeks and was asked to go in for an in-person interview with the office manager. The interview was very straightforward and pleasant. Standard questions about my resume, background, education, and experience in healthcare and my work with low-income communities. No 'gotcha' questions. I heard back within about two weeks, and started three weeks later. The whole interview took approximately thirty minutes. The interview was 1 on 1. Interview was very clear about what my duties would be if I were accepted.", "Interview Questions": "Why are you interested in healthcare?"}]]