[[{"date": "20 Mar 2023", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Valley Children's Healthcare", "Interview Descriptions": "Pretty straight forward. Interviewed with charge, educator and manager. Interview seemed pretty informal, more like a conversation. I made sure to ask questions at the end for each individual interviewer.", "Interview Questions": "Why valley childrens? Strengths and weaknesses"}, {"date": "16 Dec 2022", "title": "RN I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Valley Children's Healthcare (Remote) in Dec 2022", "Interview Descriptions": "Super straightforward. Had one interview with a recruiter and another with the unit manager. The unit manager was very nice and personable. Was offered the job 4 days later. Also had to have 4 references available", "Interview Questions": "Why are you interested in pediatrics?"}, {"date": "15 Mar 2022", "title": "Patient Care Technician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Valley Children's Healthcare", "Interview Descriptions": "Welcoming they did basically asked all the interviews questions that you get at any job but obviously related to what you applied for. Unfortunately I couldn’t do a face interview due to the lack of internet quality and covid but make sure you have good internet and a quiet place.", "Interview Questions": "Experience and scenario is what they look for "}, {"date": "8 Aug 2022", "title": "Project Manager Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Valley Children's Healthcare (Madera, CA) in Mar 2022", "Interview Descriptions": "Schedule all of the interviews with recruiter.  Can receive by email but usually you are called. Pretty flexible and able to accommodate current working hours. Most are during the day.", "Interview Questions": "Normal types of questions for a project manager position. Focused on team work."}, {"date": "13 Dec 2021", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Valley Children's Healthcare", "Interview Descriptions": "I interviewed with the manager and educator. It was a relaxing environment with some scenario questions and general interview questions. Interview last about 30 mins. It was in a small office with two chairs.", "Interview Questions": "Tell us about yourself \r\nWhy do you want to work here \r\nIf a colleague was taking a longer break then 30 mins what do you do\r\nWhat do you do if you have a bad interaction with a colleague \r\nWhat’s one weakness and one strength \r\n"}, {"date": "7 Oct 2021", "title": "Neonatal Feeding Prep Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Valley Children's Healthcare", "Interview Descriptions": "Scheduled a single interview that was reviewed by two individuals (manager and milk tech). They asked a series of questions pertaining to strengths, weaknesses, and experiences that could possibly translate into the position.", "Interview Questions": "What challenges might you encounter when working as a milk technician? "}, {"date": "21 May 2021", "title": "Family Nurse Practitioner Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Valley Children's Healthcare", "Interview Descriptions": "Wonderful three step process: on the phone, in person at HR with hospital tour, and with future co-workers. Really well coordinated by the hiring manager, communicated regularly to work out any issues.", "Interview Questions": "Why do you think you’d be a good fit here?"}, {"date": "24 Jan 2021", "title": "Medical Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Valley Children's Healthcare (Fresno, CA) in Nov 2020", "Interview Descriptions": "There were two interviews during the process. It was over the course of a few weeks.  Initially, applying was easy and submitted my resume. I really wanted to work there, but the pay was not worth me leaving my current job.", "Interview Questions": "How is your work ethic?"}, {"date": "14 Dec 2021", "title": "Pediatric Care Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Valley Children's Healthcare (Madera, CA) in May 2020", "Interview Descriptions": "My first interview was over the phone.  It was pretty relaxed. I was just asked basic interview questions and questions about the company specifically. My next interview was over FaceTime and was basically just a meet and greet with the manager of the unit.", "Interview Questions": "What does integrity mean to you?\r\n"}, {"date": "3 May 2022", "title": "RN I Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Valley Children's Healthcare (Madera, CA) in Dec 2019", "Interview Descriptions": "I received an email to schedule an in person interview. The interview was a panel interview with three members of the team including the charge RN, clinical educuator, and RN on the unit.", "Interview Questions": "Describe a time when you made a mistake and what did you do about it?"}], [{"date": "18 Mar 2019", "title": "Planning and Data Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Valley Children's Healthcare in Mar 2019", "Interview Descriptions": "I applied online and got an email from the recruiter for an interview. The interview went pretty well and lasted for 30mins\r\nThe final question he had asked was Sponsorship and then I saw the sudden drop in the interest level.\r\nDo not waste your time if you are an international resident. Clarify that before you move ahead with the interview.", "Interview Questions": "1. Mainly questions where from my resume - mainly experience.\r\n2. What technologies I can work on\r\n"}, {"date": "14 Dec 2018", "title": "Accountant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Valley Children's Healthcare (Madera, CA) in Dec 2018", "Interview Descriptions": "Applied online, got a call the next day for an interview the day after. There were two interviews back to back, one with the director and one with the managers. Each lasted about an hour. They were all very nice and made me feel at ease", "Interview Questions": "Tell us about yourself "}, {"date": "9 Mar 2017", "title": "Leadership Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Valley Children's Healthcare (Madera, CA)", "Interview Descriptions": "The interview process started out okay. However, once I was asked to fly in for an in-person interview that is when it got crazy. I met with close to 25 people in 6 hours. I had a lunch interview and then towards the end of the day was asked to dinner for more discussions. Because of obligation, I felt I had to go. It was incredibly long day. After being hired, I realized the interview process was so long because there is a fear of selecting the wrong candidate and then being accountable for such a decision. It is overkill.", "Interview Questions": "Share with my how you collaborate?"}, {"date": "27 Jan 2017", "title": "Medication Safety Officer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I applied through a recruiter. The process took 1 day. I interviewed at Valley Children's Healthcare (San Diego, CA) in Nov 2016", "Interview Descriptions": "Post initial screening by recruitment company a phone interview was arranged with director of pharmacy. \r\n\r\nNice opening open ended questions about professional experiences and performance at last job.\r\n\r\nGetting along with others and ability to handle difficult counseling situations.\r\n\r\nHow the director - also new and got promotion recently to do job after few months of joining in institution.\r\n\r\nA second interview was in pipeline but asked for references (5) via some external source.", "Interview Questions": "Maximal stress I could feel from the interview was on ability to counsel questions"}, {"date": "5 Nov 2015", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Valley Children's Healthcare (Madera, CA) in Dec 2013", "Interview Descriptions": "Easy, no pressure.  Everyone was nice.  There were no surprises.  The panel was attentive and asked good follow up questions.  Overall, it was a good panel.", "Interview Questions": "Typical ones, like strengths & weaknesses, etc."}, {"date": "23 Jul 2017", "title": "Business Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Valley Children's Healthcare (Madera, CA) in Apr 2013", "Interview Descriptions": "The interview process was brief and was only one interview. I met with all division leaders and director simultaneously. Director asked most of the questions and was mostly interested in fit and approach to problem solving. Despite not having any technical questions for me the group was interested to hear technical explanations of some of my past work. The interview itself lasted around 1 hour. I wore business casual attire, all leaders wore business casual attire as well except for the director who wore business attire.", "Interview Questions": "What would your current manager say about you if I called and asked?"}]]