[[{"date": "1 Jun 2023", "title": "Ops Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at TechSoup (San Francisco, CA)", "Interview Descriptions": "a=A little bit long, I had 5 interviews, with my direct manager , HR, the team members and with the director of my team, it took about 4 months, the background check took a lot of time,", "Interview Questions": "I had to translate a response for a ticket in 3 languages."}, {"date": "12 Dec 2022", "title": "Account Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at TechSoup (Toronto, ON)", "Interview Descriptions": "A good mix of behavioural and role play based questions. Meeting the managers and the team, and some insight into the day to day of the role. In some cases, there's a group interview session to kick-off.", "Interview Questions": "What makes you weird? *Culture focused question"}, {"date": "9 Nov 2022", "title": "Project Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 4 weeks. I interviewed at TechSoup", "Interview Descriptions": "The interview process was very fast. There was the initial phone screening with the recruiter then three panel interviews and one final chat with direct supervisor. Overall, the team was very communicative.", "Interview Questions": "Why do you want to work for this organization?"}, {"date": "26 Apr 2022", "title": "Internship Data Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at TechSoup", "Interview Descriptions": "Project driven talk, multiple days. It was a good experience to test skills on the field.\r\nZoom talks, a mini test case to discuss to then an automation as a todo for the next talk", "Interview Questions": "A task was given to me to automate an ETL project"}, {"date": "29 Jan 2022", "title": "Accounts Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at TechSoup (Toronto, ON)", "Interview Descriptions": "Invited to a group Interview, not so much independently asked questions but observing how well you work in a group setting and collaborating with others.\r\nWritten submission (Paragraph)\r\nMinimum 1 hour in person interview", "Interview Questions": "How may technology impact the nonprofit sector?"}, {"date": "25 Jan 2022", "title": "Editor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at TechSoup", "Interview Descriptions": "My interviewer was welcoming and kind. She asked really great, pertinent questions without being intimidating. I was impressed by her expertise, intelligence, and approach. She also did an excellent job of explaining the mission of the organization in a way that was inviting and appealing.", "Interview Questions": "What makes you a good editor?"}, {"date": "9 Nov 2021", "title": "Strategic Partnerships Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at TechSoup (San Francisco, CA)", "Interview Descriptions": "1. Initial phone screen with recruiter - recruiter was professional and shared helpful information about the role. After this, recruiter emailed me to schedule a follow-up interview with the hiring manager, but that is not what followed - instead, I received an additional email from somebody who claimed to not be the hiring manager but so sat on the same team to schedule additional time to chat. It was clear that the recruiter and this person were not aligned as they were trying to schedule me for 2 different times and follow-up interviews. \n2. Follow-up interview with person on the same team - I scheduled a time to meet with this person and the “interview” overall was extremely unprofessional and a waste of my time. They had absolutely no questions for me, except to ask how I was being paid in my current role. They spent the entire hour sharing irrelevant details about their own work but nothing of value about the role I was applying for or about the interview process. \n\nOverall the follow-up “interview” left a very bad impression on me regarding their processes, the team, and the org. I emailed to inform them I was no longer interested in the role.", "Interview Questions": "How much do I make in my current role and is it base or with commission?"}, {"date": "6 Nov 2021", "title": "Senior Software Engineer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at TechSoup", "Interview Descriptions": "Discussions with multiple staff members. Talked about company culture, what the job entailed. I was asked about my various technical qualifications, languages that I could program in, and how I could impact the business. Discussed why I wanted to move from the corporate to the nonprofit sector", "Interview Questions": "I don't recall the specific questions, it was a while ago!"}, {"date": "21 Sept 2021", "title": "Consultant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at TechSoup", "Interview Descriptions": "It was fairly easy and straight forward the response came within a week.  First was a phone call with couple basic questions followed by an interview with one of the lead consultant and HR.", "Interview Questions": "If I have any problems working for a non profit organization?"}, {"date": "9 Sept 2021", "title": "Internship Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at TechSoup", "Interview Descriptions": "It was a zoom interview which took around 45 minutes. It was my first interview and I totally botched it but they were patient with me. Don’t get intimidated—fail (or succeed!) as hard as you want, then learn from it.", "Interview Questions": "What’s your plan after graduation?"}], [{"date": "4 May 2023", "title": "Legal Counsel Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at TechSoup (San Francisco, CA) in Aug 2021", "Interview Descriptions": "The interview process was excellent. They started with a brief phone interview that gave me a taste of the work culture and what my job would be. Next were two rounds of interviews for a legal position - the person who would be my supervisor and her boss, then the General Counsel and another senior attorney. The really cool thing is they asked if there was anyone else I wanted to speak with. As a potential in-house attorney, I wanted to make sure I would have good rapport with my main internal clients, so I asked for that. I was able to meet with two people who I would work with closely, and it was really nice to have that in advance and not find out later that I loved my job, but didn't gel with my clients.", "Interview Questions": "My experience with drafting and negotiating contracts and preparing templates."}, {"date": "26 Jul 2021", "title": "Legal Counsel Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at TechSoup in Jul 2021", "Interview Descriptions": "I interviewed via phone for 30 minutes with an HR rep; was told I'd hear back about next steps within 48 hours. I didn't. I reached out a week later and was ghosted. Finally, I received a form rejection letter.", "Interview Questions": "Why are you interested in working with TechSoup?\n"}, {"date": "13 Jul 2021", "title": "Marketplace Researcher Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at TechSoup (San Francisco, CA) in Jul 2021", "Interview Descriptions": "Interviewed with HR and CEO via zoom. Very kind, personable interviewers. The company has a great mission and are looking for someone with qualitative analysis skills to help further their cause. Waiting to hear back with an offer.", "Interview Questions": "What can you bring to the company? What programs do you use for qualitative analysis?"}, {"date": "30 Apr 2021", "title": "Legal Counsel Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at TechSoup", "Interview Descriptions": "The first interview was with HR which was pretty much just a screening interview so no big deal. The next interview was with senior counsel via zoom where you learn a lot more about the company. You learn that NGOsource is a company within Tech Soup. A fairly good interview where you get to know more about the company culture and they get to know more about you. The next interview is then with Special Counsel for Tech Soup. Special Counsel was out for my interview so I skipped a step in the process to interview with a member of counsel for NGOsource and a Manager via zoom. This was a fair interview it could have been better. I believe the last interview is an assortment of members of NGOsource. There really isn't a clear timeline for when they want to hire. One interview says before the summer because they are looking to hire during the summer. Others say they are not looking to move quickly. They ask pretty standard behavioral questions for the interview.", "Interview Questions": "Describe a time you had to deal with conflict in the workplace?"}, {"date": "29 Apr 2021", "title": "Intern Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at TechSoup", "Interview Descriptions": "The first interview was a phone screen with a HR employee. The second interview was then a video interview with the direct supervisor/ manager for the position. The questions were mostly behavioral.", "Interview Questions": "Mostly behavioral (i.e. describe relevant experience)"}, {"date": "30 Apr 2021", "title": "Communications Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at TechSoup (Warsaw, Masovia) in Sept 2020", "Interview Descriptions": "The interview was generally good and the company representatives were professional. We had a nice conversation and a lovely interview for two stages. I was sure that they would take me. I don't know why I was not called for the last stage.", "Interview Questions": "work experience; why do I want this job; what do I think about the company."}, {"date": "18 Nov 2019", "title": "Program Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at TechSoup", "Interview Descriptions": "This organization engages in the disgraceful practice of GHOSTING candidates. I had three interviews with three separate individuals then not a word. Seems like at least one of these people could have sent a simple email explaining why they are not interested.", "Interview Questions": "Explain your process for working with clients"}, {"date": "4 Nov 2019", "title": "Data Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at TechSoup (San Francisco, CA) in Sept 2019", "Interview Descriptions": "I got introduced by an internal contact that I met at a networking event run by my school. From there I met several members of the company team and finally the team I would eventually work with. I met them for a coffee and lunch and from there I joined the team. This is for an unpaid internship so it wasn't as difficult as applying for a full-time paid job.", "Interview Questions": "What is my background?"}, {"date": "3 Aug 2019", "title": "Writer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at TechSoup", "Interview Descriptions": "It was professional, efficient, thoughtful, and comprehensive. Great people all around and I felt a genuine interest from the interviewers about who I was. It occurred over a period of 3 days including the phone interview.", "Interview Questions": "What is your background in writing for the web?"}, {"date": "31 May 2019", "title": "Project Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at TechSoup (San Francisco, CA)", "Interview Descriptions": "1. Applied to unclear JD. \r\n2.  HR phone screen (they were shady re: salary ?)\r\n3. Phone screen followed by not one, but THREE Zoom video interviews. Interviews were with male/female duos who seemed chosen at random. Overall, teams appear to lack cohesion and passion. Also, sensed a weird, ageist attitude (toward those who are younger) from each team. \r\n4. Waited a week after last interview & Emailed asking status. After spending so much with them, I was  GHOSTED, and by a non-profit no less. DISRESPECTFUL and unprofessional.", "Interview Questions": "How would a previous manager describe you? Provide five qualities or characteristics."}], [{"date": "1 Apr 2018", "title": "Program Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied through an employee referral. I interviewed at TechSoup", "Interview Descriptions": "I was interviewed last year following an internal referral. I received a phone screen interview with what turned out to be the most unprepared and unprofessional screening I have ever gone through.  Instead of exploring the relevance of my background, the screener investigated the referral (which came from a senior leader in the organization, alumna of my alma mater).  Based on the questions she asked, she came across as totally unprepared and not having reviewed my resume at all.  For an organization that attracts talent for their belief in the mission of the organization, rather than remuneration, they would benefit from a more humble and professional recruitment process.", "Interview Questions": "What do you do now? "}, {"date": "10 Nov 2017", "title": "Marketing Communications Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at TechSoup (San Francisco, CA)", "Interview Descriptions": "The interview process consisted of multiple steps - email exchange with some salary discussion to ensure their range fit what I was looking for, since they don't include the salary range in their job announcements. Followed by a phone interview with HR. Upon arriving for the first face-to-face interview, I was scheduled to meet with the head of the team, who gave me a schedule of various people I would be interviewing with that day. In all, I was interviewed by 8 different staff, in small groups of 2-3, plus an additional phone interview after. I was also given a written \"test\" to conduct on-site, as well as \"homework\" to send back to them as a writing assignment within a couple of days. Following that, there were a couple of phone calls to clarify anf answer questions and negotiate an offer.", "Interview Questions": "How have you successfully worked to serve multiple stakeholders in a project, even if they sometimes have different and even conflicting goals? "}, {"date": "31 May 2019", "title": "Assistant Project Manager Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at TechSoup (San Francisco, CA) in Apr 2017", "Interview Descriptions": "4 TERRIBLE ZOOM MEETINGS WERE A DUO OF INTERVIEWEES INTERVIEW.\r\n\r\nSame interview over and over people never come having even understood the role I was applying to...One lady, over 50, because she told me she was 56, said she just spends all day signing up to do interviews and laughed uncontrollably after saying that's her job. she's in project manage.ent", "Interview Questions": "What job are you applying to?"}, {"date": "8 Jul 2017", "title": "Validation Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. I interviewed at TechSoup (San Francisco, CA) in Mar 2017", "Interview Descriptions": "Had a phone interview first. They asked basic questions on what kind of person I am, how well did I work in a team, etc. Within two days I had an in person interview. Nice people, easy to talk to.", "Interview Questions": "Have you ever had a situation where you had an issue with a unruly teammate "}, {"date": "26 Feb 2017", "title": "Senior Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at TechSoup (San Francisco, CA) in Feb 2017", "Interview Descriptions": "Had a 1 hour phone interview with the VP of HR.  Went in to meet with the team I would be managing, and an in-person interview with the VP of HR.  The next week I was invited back to meet with a team of senior leaders of the organization - 2 interviewers were on the phone.  The next week I was called and asked to come back in the next day to meet with the COO and CEO.  Altogether spent 7.5 hours interviewing and never heard a word after that. \r\n\r\nVery poor candidate treatment.", "Interview Questions": "How do you work with a CEO who feels they know how to do most of the roles?"}, {"date": "9 Aug 2016", "title": "Product Marketing Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at TechSoup (San Francisco, CA)", "Interview Descriptions": "I had a phone screen with a recruiter. She probed my resume and then I was scheduled for face to face interviews. I met with the hiring manager, one of his peers, and an individual contributor.  The process was fairly easy and the people I met with were friendly. The interview felt like they were looking for some new ideas.", "Interview Questions": "Can you tell me about your marketing experience"}, {"date": "10 May 2016", "title": "Communications Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 3 weeks. I interviewed at TechSoup (San Francisco, CA)", "Interview Descriptions": "Met with lots of different potential colleagues. Pretty straightforward questions across the board, but because I had a number of different people to meet with, it ended up being a fairly grueling day. Still, it was a great way to get a full picture of the types of staffers on the team.", "Interview Questions": "Why are you leaving your current position? "}, {"date": "13 Jul 2014", "title": "Deputy Director Interview", "results": "Declined Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at TechSoup", "Interview Descriptions": "Really extensive interview process, somewhat disorganized. Expect no breaks, even if you're meeting straight through lunch. Manager was unable to describe the team that I would supervise. Seemed to be a lot in flux.", "Interview Questions": "N/A"}, {"date": "13 Feb 2015", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at TechSoup (Toronto, ON) in Mar 2014", "Interview Descriptions": "Group interview of 11 people followed by a one-on-one. The group interview was long but fun. The one-on-one required extensive questions, speaking French, correcting a print-out of HTML, doing Excel work in the room while being watched, and writing a brief essay. Overkill for a job that was basically doing grunt work other positions didn't want to do-- it seemed like it must be a pretty serious job from the interview but it was a bit misleading.", "Interview Questions": "How would you do a bunch of different things with data in Excel?"}], [{"date": "28 Nov 2017", "title": "Account Management Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 2 days. I interviewed at TechSoup (San Francisco, CA) in Jan 2014", "Interview Descriptions": "Great process!  Met interesting people and learned about the organization! Was able to walk around the building with the people I interviewed with.  Everyone was kind and willing to answer my questions.", "Interview Questions": "Are you looking to work within the nonprofit sector and if so, why?"}, {"date": "6 Jun 2014", "title": "Interim Community Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 days. I interviewed at TechSoup (San Francisco, CA) in Oct 2013", "Interview Descriptions": "One phone interview, one hiring team interview, one superior interview with a VP. Applied for FT job, was offered instead 3-month contract because after my interview they realized that they weren't sure what they wanted out of the position - a leader or a doer.", "Interview Questions": "How would I handle a situation where there was conflict over a media-related decision"}, {"date": "3 Jul 2013", "title": "Engineer Interview", "results": "Declined Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at TechSoup", "Interview Descriptions": "Simple and efficient process of being called in and then proceeding through the interviews with managers and staff.  All prepared and ready with questions and discussion no waiting around or unprepared people.", "Interview Questions": "Complex engineering questions regarding power systems."}, {"date": "17 Jul 2012", "title": "Senior Partnerships Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I applied online. The process took 3 months. I interviewed at TechSoup (San Francisco, CA) in Apr 2012", "Interview Descriptions": "Process was incredibly long in terms of the # of conversations--8 phone calls on different days  w/ different team members, 1 in person in my city,  (these consisted of 1 HR screen + 1 interview via Skype with Hiring manager + 6 separate 1-hour calls w/ other teammates (some by Skype some by phone))  and then came to SF for in-person interviews. Did 1 day of 4 1:1 interviews and they asked me to come in the next day for 3 more 1:1 interviews. Then 1 more meeting with hiring manager ...  Then I was asked to do one more interview a week later by phone. Was told my references would be contacted, so I alerted them (they weren't.) Next interview by phone fell through... \r\n\r\nHope it goes better for you!!", "Interview Questions": "N/A"}, {"date": "14 Apr 2015", "title": "Account Management Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 3 months. I interviewed at TechSoup (San Francisco, CA) in Feb 2011", "Interview Descriptions": "TechSoup interviews people by asking them open ended questions which you are expected to answer by describing your personal experiences. Basically they want you to paint a picture of what your processes are and how you handle things. There are no wrong answers. Just stay calm and focused.", "Interview Questions": "Describe one time you were failed and how did you recover."}, {"date": "6 Oct 2015", "title": "Customer Service Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at TechSoup (San Francisco, CA) in Feb 2011", "Interview Descriptions": "I was screened on the phone, met with 4 people in total and was tested for basic computer skills.  They asked pretty standard questions but were very focused on my interest in their mission.  They said that they had an immediate need to fill a position yet it took about a month to get an offer.", "Interview Questions": "What do you know about our mission?"}]]