[[{"date": "18 Dec 2020", "title": "Residential Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at St. Coletta of Wisconsin", "Interview Descriptions": "The interview process is pretty straightforward. First they screen you with a phone interview to make sure you meet all the requirements. Then if you do, they invite you for an in person interview (maybe different due to Covid). The director will be there along with at least one other residential manager. If they like you they may offer then or they may ask you to come back and interview with the Director and all of the Residential Managers. HR will more than likely send you an assessment before the process, to see where you are. If they offer you will more than like get a tour of the place you are interviewing at.", "Interview Questions": "What motivates you to work with the DD population?"}, {"date": "8 Feb 2023", "title": "Direct Support Professional (DSP) Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at St. Coletta of Wisconsin in Apr 2020", "Interview Descriptions": "Everything went super quick. I know others have had issues with STC calling during scheduled interviews. Have initial phone call with HR, then had a Zoom interview with a house manager.", "Interview Questions": "Give an example of a time where you were in a situation where you needed to multitask"}, {"date": "11 Mar 2020", "title": "DSP Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at St. Coletta of Wisconsin in Nov 2019", "Interview Descriptions": "Started with a brief phone screening, then quick 15 minute interviews with very basic questions. Wish there was an option to do these interviews remotely because it seemed like a wasted of time. Waited weeks before an employment offer was presented.", "Interview Questions": "Very basic"}, {"date": "6 Jan 2020", "title": "Life Skills Instructor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at St. Coletta of Wisconsin (Brookfield, WI) in Nov 2019", "Interview Descriptions": "Brief phone interview that described the position in few details. Followed by a 25 minute person to person interview and tour of the facility. Followed by another quick person to person interview", "Interview Questions": "Describe your classroom leadership skills"}, {"date": "12 Feb 2016", "title": "DSP Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at St. Coletta of Wisconsin (Rolling Meadows, IL)", "Interview Descriptions": "1. Application submission. \r\n2. Call and pre-screen from HR: gave general overview of company\r\n3. Interview and pre-employment testing (reading comprehension) \r\n4. On site tour/interview with supervisor \r\n5. Phone offer: detailed overview of training process and requirements.", "Interview Questions": "Examples of strengths and growth opportunities. \r\nSpecific situation that was difficult and how you resolved.  \r\nCrisis example was given and resolution was asked. \r\nExperience with DD population."}, {"date": "25 Jul 2017", "title": "DSP Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at St. Coletta of Wisconsin (Rolling Meadows, IL) in Feb 2016", "Interview Descriptions": "After submitting an application I was briefly screened and interviewed via phone (my skills, work experience were reviewed and availability confirmed).    The second interview was scheduled for another day and was in the office, it was quick 45 minutes total and I had to take a quick reading comprehension test- 20 minutes, and lastly the onsite tour of the house and meet some clients and staff.  I was called and offered a position within the week.", "Interview Questions": "A time face with difficult decision... Prioritizing the order you address concerns when being demanded at the same time.  "}, {"date": "28 Mar 2019", "title": "Executive Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at St. Coletta of Wisconsin (Jefferson, WI) in Dec 2015", "Interview Descriptions": "meet with interviewer and had a phone interview with HR.  It was pretty much a standard interview process.  Phone interview with Human Resources, then a meeting with the CEO for about one hour, background check and drug test at a local hospital.  Hired right before Christmas but didn't start until January.", "Interview Questions": "About my experience"}, {"date": "12 Feb 2016", "title": "Direct Support Professional Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at St. Coletta of Wisconsin (Jefferson, WI) in Oct 2013", "Interview Descriptions": "You apply online They call you to set up an in person interview and let you know about the jobs they have available. Then come in for a face to face interview. Next came a tour of where you would be working. Then they called to say you got the job and go over the details.", "Interview Questions": "What do you have to offer to the company?"}, {"date": "28 Apr 2016", "title": "DSP Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at St. Coletta of Wisconsin (Jefferson, WI) in May 2012", "Interview Descriptions": "They asked just basic questions. It was very easy and comfortable. They were quick to reply with a job offer. The offer was fair and higher then other companies in the business. The accepted the trainings from other companies. Their values as a company are their main priority. Very comfortable.", "Interview Questions": "What would you do in a situation if a client was attacking you?"}, {"date": "14 Oct 2014", "title": "Direct Support Professional Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at St. Coletta of Wisconsin (Rolling Meadows, IL) in Apr 2012", "Interview Descriptions": "HR called to screen me, and offered me to interview. I met with the Residential Coordinator, and the interview took over an hour. It was very friendly, and I did not feel intimidated or like I was being judged. Another \"interview\" took place at the site I would be working, and was asked if there was something I was interested in pursuing. I can't remember if I was offered the job on the spot, or HR called me later to offer me the job.", "Interview Questions": "Specific questions regarding times you've had to solve this or that problem, or when you had to use a particular skill. Come prepared with examples."}]]