[[{"date": "1 Apr 2023", "title": "Coordinator III Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of New Orleans in Mar 2023", "Interview Descriptions": "It started off great with constant communication with the hiring manager who throughly explained the steps of the interview process in which a project had to be completed. The interview consisted of a panel of three people including the hiring manager; and it was recorded. I was assigned a task of putting together a training layout for a position that reports to the applied position, but was never compensated for my time. I also had to submit my project which I should’ve locked and watermarked. The interview with the panel went great, and the other two people were extremely nice and responsive, but after a week and a half after the interview I hadn’t heard from the hiring manager. I sent an e-mail and never heard a response until exactly two weeks later when received an e-mail saying I wasn’t selected, but I could apply for the Coordinator 1 position which reports to Coordinator 3 position I interviewed for previously. I was appalled and disgusted. The hard work I put into that project that I was not paid for worth nothing.", "Interview Questions": "What would you do if you have a new tire who does not have training experience?"}, {"date": "4 Jun 2022", "title": "Director Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of New Orleans (New Orleans, LA) in Oct 2021", "Interview Descriptions": "Round 1: Phone Interview with Hiring Manager and a small committee \n\nRound 2: All day series of Zoom meetings with different departments and relevant leaders\n\nEveryone was polite and asked good questions, however I had some internet problems and I wonder if that may have affected the quality of the interview.", "Interview Questions": "The one thing that stands out is that I was asked if I had ever had to terminate someone."}, {"date": "4 May 2022", "title": "Desktop Support Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 4 days. I interviewed at University of New Orleans (New Orleans, LA) in May 2019", "Interview Descriptions": "The interview is conducted by the Desktop Support Manager in person. You have to bring your paperwork such as your Social Security info, Identification card and so on. You have to read and sign paperwork that went over everything the job would entail.", "Interview Questions": "Q: What is your previous experience?"}, {"date": "7 Oct 2019", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of New Orleans (New Orleans, LA) in Oct 2018", "Interview Descriptions": "One interview. two interviewers. I mailed them with my resume. They called me for an interview in the office in person. I went there on due date and time.", "Interview Questions": "Do you have any web development experiences?"}, {"date": "22 Feb 2021", "title": "Informational Technology Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at University of New Orleans (New Orleans, LA) in Mar 2018", "Interview Descriptions": "Very straight forward in my experience. You sit in front of your future manager as you discuss your paperwork. You fill in your paperwork and wait for it to get processed.", "Interview Questions": "Q: What are your strengths? "}, {"date": "23 Dec 2016", "title": "Operations Manager Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at University of New Orleans (New York, NY) in Dec 2016", "Interview Descriptions": "Late start to the video interview with no apology. Overview of past work experiences, followed by situational questions specific to the position I was applying for. Interviewer did not seem excited about having to interview me.", "Interview Questions": "What is it like to work with you?"}, {"date": "22 Jun 2016", "title": "Accounting Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 2 weeks. I interviewed at University of New Orleans", "Interview Descriptions": "The overall experience was very positive. I received an email from the interviewer telling me that my resume was received. I later received a second email requesting an interview. The interviewer was very professional and asked standard interview questions. The Accounting department seemed very lean and there were a bunch of desks in a big room. I didn't see cubicles and the only office appeared to belong to the interviewer. I was really excited about the position and the interviewer did a good job of explaining the responsibilities and duties it entailed.", "Interview Questions": "What is a weakness? What is a strength? Why should I hire you? What did you do at your last/current position?"}, {"date": "2 Jul 2016", "title": "Assistant Professor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at University of New Orleans in Mar 2016", "Interview Descriptions": "The panel of interviewers consisted of three professors and four graduate students. Each introduced him/herself and their research interests.  The interview was conducted in a friendly and courteous manner and took place more like a discussion than the administering of a test, as some interviews can be. The questions aligned with what the panel explained were their goals for the candidate they were seeking. As the person being interviewed I found the process to be fair, interesting, and appropriate.", "Interview Questions": "Why UNO? What interests you about this position?"}, {"date": "16 Aug 2018", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at University of New Orleans (New Orleans, LA) in Feb 2016", "Interview Descriptions": "Interview Process involved asking programming related questions and past projects. The professors conduct interview and look at your grades. If you have done well in CS class it is very likely.", "Interview Questions": "Experience with OOP. Show the past projects, some questions on networking etc."}, {"date": "1 Feb 2018", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at University of New Orleans in Feb 2016", "Interview Descriptions": "One hour of Skype interview. My Professor offered me a RA position. I applied to the school, which was fairly simple with the basic requirements of GRE (300+) and TOEFL.  Once I got admission I got the I-20 with a salary of 15k annual.", "Interview Questions": "Why do you wan to do a PhD? Why USA? Have you reviewed my work? "}], [{"date": "17 Jul 2019", "title": "Assistant Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at University of New Orleans (New Orleans, LA) in Dec 2015", "Interview Descriptions": "They initially conducted a phone interview. Then in a couple of weeks, they asked for a campus visit. It was a full day schedule with meetings with high-level university officers and administrators as well as department faculty, leadership, and students. The environment was cordial yet focused toward the mission. Overall, the interview process was fairly standard.", "Interview Questions": "How can you contribute to the department's teaching and research mission?"}, {"date": "15 Jun 2016", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 days. I interviewed at University of New Orleans (New Orleans, LA) in Dec 2014", "Interview Descriptions": "Overall it was a good experience. It was an easy interview just to get to know me better and make sure I was a good fit for the position.", "Interview Questions": "Common questions: Tell me about yourself? What are your biggest strenghts, etc."}, {"date": "20 Apr 2017", "title": "Student Woker Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at University of New Orleans (New Orleans, LA) in Aug 2014", "Interview Descriptions": "Very laid back. Not really an interview, just want to know what you are comfortable with and what your class schedule is. Really it was kinda dumb. Wish i wasn't working here but I have no other option.", "Interview Questions": "What is your class schedule?"}, {"date": "8 Nov 2015", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1+ week. I interviewed at University of New Orleans (New Orleans, LA) in Aug 2014", "Interview Descriptions": "It was pretty simple, It lasted for half an hour. They asked about my previous work experience. They mentioned about the process and how the work timings will be there. Overall the flexibility in work timing is the best that i could figure out.", "Interview Questions": "Have you worked with server management?"}, {"date": "1 Jul 2015", "title": "Assistant Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at University of New Orleans (New Orleans, LA) in Feb 2014", "Interview Descriptions": "I had several mini-interviews with individual faculty.  Then I interviewed with a few administrative employees.  Each of those interviews was relatively easy.  No one gave me a hard time.  Then I presented a piece of original research to the faculty.  They asked questions and made suggestions.  This was a helpful exercise.", "Interview Questions": "In the interviews with the individual faculty, I was asked about my teaching and research interests.  In the interviews with the department head, we discussed salary and teaching preferences."}, {"date": "31 May 2017", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at University of New Orleans (New Orleans, LA) in Jul 2013", "Interview Descriptions": "The interview process was very formal. It included meeting with the Director of Admissions as well as the Associate Director of New Student Orientation. The interview process took about two weeks and after that they came back to me with the offer.", "Interview Questions": "Why do you believe you are a good fit for the position?"}, {"date": "10 Apr 2013", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at University of New Orleans", "Interview Descriptions": "GRE score should be good", "Interview Questions": "passing the cumulative exams can be challenging for some"}, {"date": "6 Mar 2014", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1+ week. I interviewed at University of New Orleans (New Orleans, LA) in Jul 2012", "Interview Descriptions": "To be considered you must have a good GPA and good GRE results", "Interview Questions": "Nothing too difficult"}, {"date": "12 Mar 2016", "title": "IT Coordinator I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of New Orleans (Baton Rouge, LA) in Mar 2012", "Interview Descriptions": "The interview was incredibly formal for a state position.  Interviewers expected a suit, and I later learned they rarely hire people that didn't wear a suit unless they were extremely good candidates. Group of three sat me down and asked me questions about my education and experience, called me back for a second interview with one extra person, had an offer a couple days later.  Compared to other interviews I had at the time, this one wasn't especially hard.", "Interview Questions": "\"How would you setup a computer to connect to a network without a DHCP server present?\""}, {"date": "20 Jun 2016", "title": "Assistant Professor-computer Science Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at University of New Orleans (New Orleans, LA) in Feb 2012", "Interview Descriptions": "rigorous. I have to spend whole day on-campus and meet many people in management and faculty to complete the process. You meet chair of the department, dean, HR, and faculty, and then you have to present in front of students and faculty members. The seminar usually lasts for one hour.", "Interview Questions": "Why do you want to move to New Orleans?"}], [{"date": "20 Sept 2011", "title": "IT Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at University of New Orleans (New Orleans, LA) in Jul 2010", "Interview Descriptions": "Quick phone interview with department heads. Then drive to Baton Rouge for an in person interview. 2 Hours of questions asking for experience, background, hopes, and expectations. Days later I get a call asking if I'd like to accept. And if so I must drive to Baton rouge quickly to sign the offer before employment freeze is enacted.", "Interview Questions": "What do you see yourself doing in 5 years?"}]]