[[{"date": "29 May 2023", "title": "Adjunct Professor Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Rhode Island School of Design (Providence, RI)", "Interview Descriptions": "they look at the syllabus I had written up and then had given me an estimate of the salary and then took the offer back one thousand dollars less. My then co-teacher for this class was offered a thousand more because they valuated his accomplishments higher, even if I had a graduate degree. I attribute this to my being a woman of color.", "Interview Questions": "can you bring us to milan? can this project give us prestige?"}, {"date": "12 Oct 2022", "title": "Assistant Director Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Rhode Island School of Design", "Interview Descriptions": "Long process... I interviewed with several departments, students, administrators, and alumni. Seemed like overkill. People were friendly but I'm not sure they enjoyed their work. I also am not sure the pay was fair given the cost of living.", "Interview Questions": "What innovative practices have you recently employed?"}, {"date": "16 Apr 2022", "title": "Assistant Professor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Rhode Island School of Design", "Interview Descriptions": "Questions were not well thought out. Had multiple parts and really just didn't make much sense. Sometimes I feel like they themselves didn't know what they were asking. I also feel like having four people interviewing you over zoom is excessive and you don't really get to access the personality of the people you will be working with if you got offered that job.", "Interview Questions": "N/A"}, {"date": "3 Mar 2022", "title": "Admissions Officer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Rhode Island School of Design (Providence, RI)", "Interview Descriptions": "Overall, fairly easy. One interview was with HR. The second interview was with Admissions team. Then there kinda was a third interview with the director of admission added or attached to your interview with the admissions team.", "Interview Questions": "What do you bring in regards to social equity and inclusion? "}, {"date": "12 Dec 2022", "title": "Video/Photo Editor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Rhode Island School of Design (Providence, RI) in Aug 2021", "Interview Descriptions": "Interview process was pretty lengthy for my position (I had 5 interviews), but questions were well thought out and relevant to the position I was applying for. Everyone was very welcoming and I felt super comfortable. No red flaggy questions.", "Interview Questions": "N/A"}, {"date": "30 Jan 2021", "title": "Development Data Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Rhode Island School of Design (Providence, RI) in Jan 2021", "Interview Descriptions": "Zoom interview with person in the same department. Conversational back and forth about reporting lines, job requirements, and employment history.  Interviewer was professional and cordial. I got a sense I was really being heard.", "Interview Questions": "Could you please tell me a little bit about yourself and how you came to apply for this job?"}, {"date": "30 Nov 2020", "title": "Associate Professor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Rhode Island School of Design in Mar 2020", "Interview Descriptions": "The interview process was fine.\r\nI think the disappointment  came about during the Salary negotiation process. The employer decided to exclusively communicate to my male partner who I’m co-teaching the class and not me — I’m female and a woman of color. This is really sad in light of recent events.", "Interview Questions": "How would you teach the class?"}, {"date": "16 Feb 2018", "title": "Associate Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Rhode Island School of Design in Jan 2018", "Interview Descriptions": "After an initial phone interview, I was invited for a daylong in-person interview several weeks later, which required travel on my part. The interview sessions went well, and I was told they hoped to make a decision within a few weeks. After later following up, I was put off twice saying they hoped to get back to me by the end of the week, which of course they did not.\r\n\r\nUpon following up again, I received a form HR rejection within 10 minutes. Clearly there was no intention of letting me know I had not been selected, despite two interviews and travel that I had to pay for. There is no reason I shouldn't have received a personalized note letting me know I had not been selected for the position.\r\n\r\n What was initially a very organized and promising process turned evasive and unprofessional.", "Interview Questions": "Questions were all expected for the position."}, {"date": "31 Aug 2020", "title": "Technical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Rhode Island School of Design (Providence, RI) in Jan 2018", "Interview Descriptions": "It is part of the student fellowship, you just go to the technician and ask him whether you can be his assistant or not. The overall process is quick and simple. The interviewer was nice.", "Interview Questions": "What's your skill.\nWhat would you like to learn?"}, {"date": "21 Nov 2019", "title": "Community Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Rhode Island School of Design (Providence, RI) in Aug 2017", "Interview Descriptions": "First an interview with the assistant manger. The interview is basically asking questions about yourself and why you applied for this job, what can you bring to the work place etc", "Interview Questions": "Why did you want to do work study ?"}], [{"date": "1 Mar 2017", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Rhode Island School of Design", "Interview Descriptions": "There was no interview. I submitted the application online and then was paired with one class to be the TA. It was very quick. It's not really position that would require interview.", "Interview Questions": "There was no real interview, so it is not difficult."}, {"date": "3 Mar 2020", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Rhode Island School of Design (Providence, RI) in Mar 2017", "Interview Descriptions": "During my time at Rhode Island School of Design, I gained an abundance of knowledge from the faculty around me. They pushed me and were a huge help in capturing and honing my skills. Class are small, no more than 15 on mine.\r\nStudents were nice, full of potential and worked hard.\r\nTeachers have full control of the content of the class and schedule, syllabus.", "Interview Questions": "How would your performance make visitors want to apply to RISD?"}, {"date": "30 May 2019", "title": "Graduate Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Rhode Island School of Design in Mar 2017", "Interview Descriptions": "I Skyped in from my home country. It was very friendly and casual, with some specific questions to better get to know my personality and culture fit. It lasted about 20 minutes.", "Interview Questions": "They asked about recent projects and portfolio volume."}, {"date": "27 May 2017", "title": "Monitor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Rhode Island School of Design (Providence, RI) in Sept 2015", "Interview Descriptions": "none there was no interview questions, you get to be a monitor after your sophomore year of RISD and you all have a group meeting and an info session and from there you lean what you need to do while you monitor.", "Interview Questions": "N/A"}, {"date": "14 Oct 2014", "title": "Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Rhode Island School of Design", "Interview Descriptions": "HR representative called me for the initial phone interview.  After the morning phone interview, I was contacted in the afternoon to make arrangements to come to campus the next week.  I rearranged my schedule to be available for three days to fly out there, interview for a full day, and fly home.\r\n\r\nI had eight short sessions during my interviews.  That was fine.  They filled up any downtime by showing me around campus, which usually would be fine but it was a very hot and humid day and of course I was in full suit, so I was very uncomfortable.\r\n\r\nThey told me their timeline was two - three weeks to make a decision.  I didn't receive a response to my follow-ups and haven't heard from them since.\r\n\r\nMaybe they decided I was a bad fit, but I do expect to be communicated with even if I'm being turned down for a position.", "Interview Questions": "An interviewer asked how I would take over projects from someone who was unwilling to hand them over, and was pretty obvious she was talking about someone I had interviewed with earlier.  It was a very odd moment."}, {"date": "7 May 2013", "title": "Office Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Rhode Island School of Design (Providence, RI) in Oct 2010", "Interview Descriptions": "I heard of openings and met with the person hiring at the admissions office. She was able to work out a schedule with me immediately, there was no formal interview.", "Interview Questions": "N/A"}, {"date": "21 Mar 2014", "title": "CSI Employee Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Rhode Island School of Design (Providence, RI) in Aug 2010", "Interview Descriptions": "Very basic interview process.", "Interview Questions": "N/A"}]]