[[{"date": "20 Oct 2022", "title": "Graduate Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at UNC Wilmington", "Interview Descriptions": "It was a blast and I felt like I had a very nice interviewer. I was very comfortable in the process and never felt overwhelmed. I had a lot of fun touring the school as well", "Interview Questions": "Why did you choose UNCW"}, {"date": "29 Jun 2023", "title": "Information Security Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UNC Wilmington in Jun 2022", "Interview Descriptions": "Long & drawn out. 3 interviews with one of them being in person. Had a final interview with the CIO but never heard back by either email or phone. Ended up finding out after I logged into their job portal to see the position had been filled.", "Interview Questions": "They had a technical test that asked questions similar to the Security + exam."}, {"date": "1 Mar 2022", "title": "Assistant Web Developer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at UNC Wilmington", "Interview Descriptions": "Interview process was pleasant. Only one formal interview took place where you are asked general questions about yourself as well as questions about your familiarity/experience with web development. After the interview, you will come in and take a basic HTML/CSS and JavaScript test provided by W3 schools.", "Interview Questions": "Q: How do you debug your code?\r\n\r\n"}, {"date": "13 Feb 2022", "title": "Business Service Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at UNC Wilmington", "Interview Descriptions": "Expect several rounds of interviews with various faculty/staff.  Can be lengthy process from application to receiving a final determination.  Some interviews can be 3-4 hours in length. Some also required a test such as excel or writing.", "Interview Questions": "What is your experience directly related to the job you are applying for?"}, {"date": "11 Mar 2022", "title": "Lifeguard Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at UNC Wilmington (Wilmington, NC) in Jan 2022", "Interview Descriptions": "more in depth then expected, many questions that would be asked in a more formal interview, hard to answer, questions you should prepare for, cant really make up on the spot.", "Interview Questions": "How would you help to spread the campus recreation motto"}, {"date": "20 Apr 2021", "title": "Graduate Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at UNC Wilmington", "Interview Descriptions": "Placed in research positions based on personal interest areas. They offer a lot of room to explore areas your interested in to help you get a leg up in your field of choice.", "Interview Questions": "Why are you interested in this program?"}, {"date": "25 Feb 2021", "title": "Health Promotion Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at UNC Wilmington", "Interview Descriptions": "Multiple steps - three interviews in total. Starts off with a social, then a formal interview with head staff followed by presenting a presentation on a topic of your choice to a room full of all of the peer educators", "Interview Questions": "What is in your personal opinion the definition of health? "}, {"date": "7 Oct 2020", "title": "Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at UNC Wilmington", "Interview Descriptions": "Phone Interview then two day Interview in person including presentation to a group, several group interviews, and several individual interviews. There were many groups that interviewed me from the department and division. Meals were provided and served as interviews during the process. It was a taxing two days.", "Interview Questions": "Can you tell us more about your past experience?"}, {"date": "17 Mar 2020", "title": "Building Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at UNC Wilmington", "Interview Descriptions": "Application is submitting online followed by a callback for a meeting with both the facility manager and two student managers at the Campus Life suite with a 4-7 day wait on final decision.", "Interview Questions": "What are your strengths?"}, {"date": "27 Jan 2021", "title": "Assistant Director Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UNC Wilmington in Oct 2019", "Interview Descriptions": "Tedious, long process but that's how higher education is. Everyone was extremely courteous and kind. I didn't get an offer even though they flew me out. I was bummed, they were all so helpful during the process. I have several interviews in a day and one interview was with over 20 people.", "Interview Questions": "Why do you want to work here?"}], [{"date": "13 Aug 2020", "title": "Assistant Director Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 months. I interviewed at UNC Wilmington (Wilmington, NC) in Nov 2018", "Interview Descriptions": "Zoom interview, then in-person interview. I had several interviews with different departments and in total I interviewed with maybe a little over 30 people in one day. I thought it went well. I didn't hear from them for two months and the Director reached out and told me that she wanted to let me know that I didn't get the position. I was shocked. Just two weeks prior they conducted a background search. I realized they hired internally. They even paid for my flight. I was disappointed, but was grateful for the opportunity since I really truly respect UNCW and I had a strong passion for the role of which I applied to.", "Interview Questions": "Speak on a time that you and your teammate clashed? What was the issue and how did you resolve it?"}, {"date": "6 Aug 2018", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at UNC Wilmington (Wilmington, NC)", "Interview Descriptions": "Painless, I applied online.   It took less than a day to reach back out and set up an time to interview/discuss the role.   Met with the guy I would be working for and answered a couple questions.", "Interview Questions": "Very easy, only really asked what hours I would like to work, little bit about my background. Overall it was painless and more of a formality/ensuring I wasn't a complete idiot. "}, {"date": "23 Mar 2022", "title": "IT Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UNC Wilmington (Wilmington, NC) in Jul 2018", "Interview Descriptions": "Interview process was honestly pretty easy for me, I had one interview with people from the department and we went over basic interview questions talking about past experiences and how I work with people and how I handle specific situations", "Interview Questions": "How do you work with other people?"}, {"date": "7 Apr 2021", "title": "Peer Writing Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at UNC Wilmington (Wilmington, NC) in Apr 2018", "Interview Descriptions": "One-on-one interview with the Director. You must provide a printed writing sample and bring it to the interview to discuss with the director. The interview asked questions about your own writing process.", "Interview Questions": "What would you change about the sample you've provided?"}, {"date": "10 Mar 2018", "title": "Position In International Programs Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at UNC Wilmington (Wilmington, NC)", "Interview Descriptions": "I am actually quite surprised at the level of unprofessionalism I experienced while interviewing with the Office of International Programs. I interviewed for a position from out of state and was invited to an on campus interview. I took a very last minute vacation day from my job to fly down for the interview. The hotel they lodged me at had cockroaches (one crawled out of my bag in the morning!), were dressed very casual, and started late. I ended up not getting an offer, and I learned in a very short, one liner email, no opening, closing. When I emailed to ask for feedback to improve future interviewing, I got ZERO response. OIP needs to remember that people take time off work, go through crazy travel schedules to get to Wilmington, and go through a hassle and it is extremely rude and unprofessional to not have a shred of decency or professionalism to respond to someone who went out of their way to come visit your office and university.", "Interview Questions": "Why are you interested in this position"}, {"date": "23 Aug 2019", "title": "Front Desk Receptionist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at UNC Wilmington in Mar 2018", "Interview Descriptions": "Two people asking you interview questions in a room with several other people interviewing at the same time. All the questions were emailed to you beforehand so you had plenty of time to prep for it.", "Interview Questions": "Why do you want to work for Housing?"}, {"date": "28 Dec 2019", "title": "Writing Center Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at UNC Wilmington (Wilmington, NC) in Jan 2018", "Interview Descriptions": "You meet one on one with the supervisor. You are required to bring a piece of writing that you are proud of and discuss its strengths and weaknesses with the supervisor. You are then required to answer questions about your own writing process and discuss prior experience with tutoring or other related fields. You discuss your major and career aspirations as well.", "Interview Questions": "What does your writing process look like?"}, {"date": "26 May 2017", "title": "Front Desk Liaison Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at UNC Wilmington", "Interview Descriptions": "I applied via the Workstudy program. It was a short process that only took a couple of weeks. The interview was done over the phone and it was pretty informal. I described my goals and why I would be a good fit. I was offered the position later on that day.", "Interview Questions": "How will your customer service experience help you in this position? "}, {"date": "26 Sept 2017", "title": "PR/Marketing Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at UNC Wilmington (Wilmington, NC) in Apr 2017", "Interview Descriptions": "UNCW has a very slow hiring process. I interviewed in April 2017 and they did not make a decision until July!  Keep this in mind when you apply. Stay proactive and apply to other positions. Don't stop your job search after you land an interview.", "Interview Questions": "Where do you see yourself in 2 years? Why did you apply for this position? How would you increase student engagement?"}, {"date": "20 Mar 2017", "title": "Assistant Professor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at UNC Wilmington (Wilmington, NC) in Feb 2017", "Interview Descriptions": "Overall, everyone on the faculty was incredibly warm and welcoming. I was invited for an on-campus visit which included a job talk and teaching demo. But, unfortunately, I could tell almost immediately that I was not a serious candidate for them. Our first meal outing after my arrival, an individual on the committee kept commenting on how young my age is, and how little teaching experience I had. I could tell right away that I was only invited so this tenure searching committee could meet their invite quota. Truly disheartening (and inappropriate) as I had spent months prepping for my visit. The dean was about 15 minutes late to our 30-minute meeting. I quickly was able to see that all I was to them was a fresh MFA grad student who they wanted details from because they are looking to start their own MFA program in the same field. I feel used. Disappointing from what looked to be a lovely university and program.", "Interview Questions": "With being so young and with little teaching experience how do you believe you can help our program?"}], [{"date": "27 Mar 2017", "title": "Graduate Research Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at UNC Wilmington (Wilmington, NC) in Jan 2017", "Interview Descriptions": "A thirty minute interview/ conversation. We discussed what the job would entail as well as personal details of our lives that had led us to become passionate about entrepreneurship. I was the youngest of over 20 candidates, and while I did not get the offer it was still a very positive experience.", "Interview Questions": "Why I wanted to work for them"}, {"date": "27 Dec 2016", "title": "Lecturer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UNC Wilmington", "Interview Descriptions": "I received a phone call about a month after submitting my application.  The first phase of the interview process was a phone interview with a small group of employees who I would interact with regularly in the position.  After the phone interview, then next interview phase was a full day on-site interview, which included small group interviews, one-on-one interviews with leadership, presentations, and Q&A times.", "Interview Questions": "How did you find UNCW?"}, {"date": "27 Mar 2017", "title": "Adjunct Professor Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at UNC Wilmington (Dallas, TX) in Dec 2016", "Interview Descriptions": "Had to interview with a small group and make a presentation on a specified topic.   Logistical information sent via email was incorrect and caused problems finding the location.   I arrived 5 min early and sat for 25 min waiting for the people to even acknowledge my presence.    NOT IMPRESSED.", "Interview Questions": "Why do you want to teach here?"}, {"date": "28 Oct 2016", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at UNC Wilmington (Wilmington, NC) in Feb 2016", "Interview Descriptions": "The interview process was fairly simple. I met with the director of my area and some current employees within the area as well. It lasted approximately 30 minutes and the conversation was easy.", "Interview Questions": "What do you expect from your supervisor?"}, {"date": "13 Sept 2017", "title": "Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at UNC Wilmington (Wilmington, NC) in Jul 2015", "Interview Descriptions": "Easy, fast, basic questions. They did not ask anything out of the ordinary and pretty much asked me more questions about what I had on my resume. The interview only lasted 15 minutes and I got a call a couple hours later that I received the job.", "Interview Questions": "Tell me your strengths and weaknesses"}, {"date": "28 May 2015", "title": "Program Administrator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. I interviewed at UNC Wilmington (Wilmington, NC)", "Interview Descriptions": "Best interview I have ever had! Great questions, broad spectrum of individuals from different departments. I felt they were all prepared and asked very pertinent questions. It was an engaging conversation.", "Interview Questions": "Why do you want to work here?"}, {"date": "5 Nov 2014", "title": "IT Analyst Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at UNC Wilmington", "Interview Descriptions": "Normally they start with a phone interview which is more of a meet and greet with some technical questions.  Then they bring you in for a face to face in front of a committee for an in person interview.  Sometimes, depending on the level of the position, you may have to meet with a larger audience in an open forum, but for your average employee this is not the case.", "Interview Questions": "Not 1 in particular, but some of the IT interviews can get quite technical.  Some questions are meant to be difficult to see how a person responds when they don't know the answer."}, {"date": "16 Aug 2014", "title": "Peer Educator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at UNC Wilmington", "Interview Descriptions": "Apply online and received a response via email almost immediately. Only a handful of people who submit a resume will receive an interview. \r\n\r\nInterview is super easy and consists of 3 of the current peer educators or 2 peer educators and the assistant direct. Questions are the normal \"tell me about a time when...\" or \"Tell us about how you would...\"", "Interview Questions": "Why do you want to be a peer educator"}, {"date": "14 Jul 2014", "title": "Lobby Desk Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 3 days. I interviewed at UNC Wilmington", "Interview Descriptions": "Must attend a hiring session in order to get an application. If selected you will go on to two Rounds of Interview, starting with a student interview and then an interview with professional staff after an open house. It's recommended that you fill out the application in pen and submit a resume and a cover letter.", "Interview Questions": "How would you deal with a situation where a co-worker was breaking a policy?"}, {"date": "28 Sept 2015", "title": "Business Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at UNC Wilmington (Wilmington, NC) in May 2014", "Interview Descriptions": "I went into my future manager's office and she asked me standard interview questions. Was helpful and did not try to \"trick\" me in any way. She showed me around the office to meet others too. I was thinking she must (hopefully) be picking me if I'm meeting others. Turns out she does that with everyone but thankfully I got the job.", "Interview Questions": "How organized are you?\r\nWhat is your worst work feature?"}], [{"date": "4 Jun 2014", "title": "Executive Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at UNC Wilmington in Mar 2014", "Interview Descriptions": "I applied in Feb and was called for an interview one month later in March.  The interview panel was nice enough but unprepared. I quickly got the impression this was an obligatory process and they already had a candidate in mind.", "Interview Questions": "None, as if they Googled top ten interview questions ten minutes before the interview."}, {"date": "5 Dec 2016", "title": "Resident Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 months. I interviewed at UNC Wilmington (Wilmington, NC) in Jan 2014", "Interview Descriptions": "Long, with lots of interviews. One group, one individual. The group interview is fun and interactive - there are several rooms and you will be asked to do different things in each room. The one on one interview isn't bad either, the HRL staff is just trying to get to know you as a person, so just be yourself!", "Interview Questions": "why do you want to be an RA?"}, {"date": "4 Nov 2015", "title": "Building Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at UNC Wilmington (Wilmington, NC) in Sept 2013", "Interview Descriptions": "Led by directors of Recreation Center and also student employees. The group interviews were great and the in-person interviews were even greater. I knew exactly what to expect going into the group interviews and it was helpful getting to know existing student employees before getting involved.", "Interview Questions": "Tell us about other experience you have"}, {"date": "3 Mar 2016", "title": "Campus Recreation Employee Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at UNC Wilmington (Wilmington, NC) in Jan 2013", "Interview Descriptions": "3 interviews, relatively easy but being outgoing!!! the staff at campus rec maintains a positive attitude throughout shift, so it is important to come to work with a smile. campus rec is the hardest place on campus to obtain a position, and at some semesters only hire 8-12 students.", "Interview Questions": "things like:\r\nwhat is a situation, that, looking back on now, you wish you had handled differently?"}, {"date": "16 Mar 2016", "title": "Office Assistant Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at UNC Wilmington in Oct 2012", "Interview Descriptions": "2-part interview, phone call (~20-30 min) and if selected, on campus interview (~3-6 hrs).  Pretty standard script of questions based on position.  On campus interview often involves one-on-one sessions as well as group sessions with staff the position is likely to work with.  Hiring process is time consuming as even though depts may receive permission to interview, they then have to confirm permission to hire, time from application to hire can be 2-3 months depending on position.", "Interview Questions": "Why do you want to work at a University?"}, {"date": "20 Jun 2013", "title": "IT Analyst Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 8 months. I interviewed at UNC Wilmington in Mar 2009", "Interview Descriptions": "Government process is long.  About 6 months between applying and getting phone interview. Afterwards got in person interview with a panel of three and then a computer hardware test.  Waited another 2 months or so before hearing back.", "Interview Questions": "How would you find a needle in a haystack?\r\n"}]][[{"date": "20 Oct 2022", "title": "Graduate Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at UNC Wilmington", "Interview Descriptions": "It was a blast and I felt like I had a very nice interviewer. I was very comfortable in the process and never felt overwhelmed. I had a lot of fun touring the school as well", "Interview Questions": "Why did you choose UNCW"}, {"date": "29 Jun 2023", "title": "Information Security Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UNC Wilmington in Jun 2022", "Interview Descriptions": "Long & drawn out. 3 interviews with one of them being in person. Had a final interview with the CIO but never heard back by either email or phone. Ended up finding out after I logged into their job portal to see the position had been filled.", "Interview Questions": "They had a technical test that asked questions similar to the Security + exam."}, {"date": "1 Mar 2022", "title": "Assistant Web Developer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at UNC Wilmington", "Interview Descriptions": "Interview process was pleasant. Only one formal interview took place where you are asked general questions about yourself as well as questions about your familiarity/experience with web development. After the interview, you will come in and take a basic HTML/CSS and JavaScript test provided by W3 schools.", "Interview Questions": "Q: How do you debug your code?\r\n\r\n"}, {"date": "13 Feb 2022", "title": "Business Service Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at UNC Wilmington", "Interview Descriptions": "Expect several rounds of interviews with various faculty/staff.  Can be lengthy process from application to receiving a final determination.  Some interviews can be 3-4 hours in length. Some also required a test such as excel or writing.", "Interview Questions": "What is your experience directly related to the job you are applying for?"}, {"date": "11 Mar 2022", "title": "Lifeguard Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at UNC Wilmington (Wilmington, NC) in Jan 2022", "Interview Descriptions": "more in depth then expected, many questions that would be asked in a more formal interview, hard to answer, questions you should prepare for, cant really make up on the spot.", "Interview Questions": "How would you help to spread the campus recreation motto"}, {"date": "20 Apr 2021", "title": "Graduate Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at UNC Wilmington", "Interview Descriptions": "Placed in research positions based on personal interest areas. They offer a lot of room to explore areas your interested in to help you get a leg up in your field of choice.", "Interview Questions": "Why are you interested in this program?"}, {"date": "25 Feb 2021", "title": "Health Promotion Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at UNC Wilmington", "Interview Descriptions": "Multiple steps - three interviews in total. Starts off with a social, then a formal interview with head staff followed by presenting a presentation on a topic of your choice to a room full of all of the peer educators", "Interview Questions": "What is in your personal opinion the definition of health? "}, {"date": "7 Oct 2020", "title": "Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at UNC Wilmington", "Interview Descriptions": "Phone Interview then two day Interview in person including presentation to a group, several group interviews, and several individual interviews. There were many groups that interviewed me from the department and division. Meals were provided and served as interviews during the process. It was a taxing two days.", "Interview Questions": "Can you tell us more about your past experience?"}, {"date": "17 Mar 2020", "title": "Building Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at UNC Wilmington", "Interview Descriptions": "Application is submitting online followed by a callback for a meeting with both the facility manager and two student managers at the Campus Life suite with a 4-7 day wait on final decision.", "Interview Questions": "What are your strengths?"}, {"date": "27 Jan 2021", "title": "Assistant Director Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UNC Wilmington in Oct 2019", "Interview Descriptions": "Tedious, long process but that's how higher education is. Everyone was extremely courteous and kind. I didn't get an offer even though they flew me out. I was bummed, they were all so helpful during the process. I have several interviews in a day and one interview was with over 20 people.", "Interview Questions": "Why do you want to work here?"}], [{"date": "13 Aug 2020", "title": "Assistant Director Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 months. I interviewed at UNC Wilmington (Wilmington, NC) in Nov 2018", "Interview Descriptions": "Zoom interview, then in-person interview. I had several interviews with different departments and in total I interviewed with maybe a little over 30 people in one day. I thought it went well. I didn't hear from them for two months and the Director reached out and told me that she wanted to let me know that I didn't get the position. I was shocked. Just two weeks prior they conducted a background search. I realized they hired internally. They even paid for my flight. I was disappointed, but was grateful for the opportunity since I really truly respect UNCW and I had a strong passion for the role of which I applied to.", "Interview Questions": "Speak on a time that you and your teammate clashed? What was the issue and how did you resolve it?"}, {"date": "6 Aug 2018", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at UNC Wilmington (Wilmington, NC)", "Interview Descriptions": "Painless, I applied online.   It took less than a day to reach back out and set up an time to interview/discuss the role.   Met with the guy I would be working for and answered a couple questions.", "Interview Questions": "Very easy, only really asked what hours I would like to work, little bit about my background. Overall it was painless and more of a formality/ensuring I wasn't a complete idiot. "}, {"date": "23 Mar 2022", "title": "IT Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UNC Wilmington (Wilmington, NC) in Jul 2018", "Interview Descriptions": "Interview process was honestly pretty easy for me, I had one interview with people from the department and we went over basic interview questions talking about past experiences and how I work with people and how I handle specific situations", "Interview Questions": "How do you work with other people?"}, {"date": "7 Apr 2021", "title": "Peer Writing Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at UNC Wilmington (Wilmington, NC) in Apr 2018", "Interview Descriptions": "One-on-one interview with the Director. You must provide a printed writing sample and bring it to the interview to discuss with the director. The interview asked questions about your own writing process.", "Interview Questions": "What would you change about the sample you've provided?"}, {"date": "10 Mar 2018", "title": "Position In International Programs Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at UNC Wilmington (Wilmington, NC)", "Interview Descriptions": "I am actually quite surprised at the level of unprofessionalism I experienced while interviewing with the Office of International Programs. I interviewed for a position from out of state and was invited to an on campus interview. I took a very last minute vacation day from my job to fly down for the interview. The hotel they lodged me at had cockroaches (one crawled out of my bag in the morning!), were dressed very casual, and started late. I ended up not getting an offer, and I learned in a very short, one liner email, no opening, closing. When I emailed to ask for feedback to improve future interviewing, I got ZERO response. OIP needs to remember that people take time off work, go through crazy travel schedules to get to Wilmington, and go through a hassle and it is extremely rude and unprofessional to not have a shred of decency or professionalism to respond to someone who went out of their way to come visit your office and university.", "Interview Questions": "Why are you interested in this position"}, {"date": "23 Aug 2019", "title": "Front Desk Receptionist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at UNC Wilmington in Mar 2018", "Interview Descriptions": "Two people asking you interview questions in a room with several other people interviewing at the same time. All the questions were emailed to you beforehand so you had plenty of time to prep for it.", "Interview Questions": "Why do you want to work for Housing?"}, {"date": "28 Dec 2019", "title": "Writing Center Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at UNC Wilmington (Wilmington, NC) in Jan 2018", "Interview Descriptions": "You meet one on one with the supervisor. You are required to bring a piece of writing that you are proud of and discuss its strengths and weaknesses with the supervisor. You are then required to answer questions about your own writing process and discuss prior experience with tutoring or other related fields. You discuss your major and career aspirations as well.", "Interview Questions": "What does your writing process look like?"}, {"date": "26 May 2017", "title": "Front Desk Liaison Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at UNC Wilmington", "Interview Descriptions": "I applied via the Workstudy program. It was a short process that only took a couple of weeks. The interview was done over the phone and it was pretty informal. I described my goals and why I would be a good fit. I was offered the position later on that day.", "Interview Questions": "How will your customer service experience help you in this position? "}, {"date": "26 Sept 2017", "title": "PR/Marketing Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at UNC Wilmington (Wilmington, NC) in Apr 2017", "Interview Descriptions": "UNCW has a very slow hiring process. I interviewed in April 2017 and they did not make a decision until July!  Keep this in mind when you apply. Stay proactive and apply to other positions. Don't stop your job search after you land an interview.", "Interview Questions": "Where do you see yourself in 2 years? Why did you apply for this position? How would you increase student engagement?"}, {"date": "20 Mar 2017", "title": "Assistant Professor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at UNC Wilmington (Wilmington, NC) in Feb 2017", "Interview Descriptions": "Overall, everyone on the faculty was incredibly warm and welcoming. I was invited for an on-campus visit which included a job talk and teaching demo. But, unfortunately, I could tell almost immediately that I was not a serious candidate for them. Our first meal outing after my arrival, an individual on the committee kept commenting on how young my age is, and how little teaching experience I had. I could tell right away that I was only invited so this tenure searching committee could meet their invite quota. Truly disheartening (and inappropriate) as I had spent months prepping for my visit. The dean was about 15 minutes late to our 30-minute meeting. I quickly was able to see that all I was to them was a fresh MFA grad student who they wanted details from because they are looking to start their own MFA program in the same field. I feel used. Disappointing from what looked to be a lovely university and program.", "Interview Questions": "With being so young and with little teaching experience how do you believe you can help our program?"}], [{"date": "27 Mar 2017", "title": "Graduate Research Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at UNC Wilmington (Wilmington, NC) in Jan 2017", "Interview Descriptions": "A thirty minute interview/ conversation. We discussed what the job would entail as well as personal details of our lives that had led us to become passionate about entrepreneurship. I was the youngest of over 20 candidates, and while I did not get the offer it was still a very positive experience.", "Interview Questions": "Why I wanted to work for them"}, {"date": "27 Dec 2016", "title": "Lecturer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UNC Wilmington", "Interview Descriptions": "I received a phone call about a month after submitting my application.  The first phase of the interview process was a phone interview with a small group of employees who I would interact with regularly in the position.  After the phone interview, then next interview phase was a full day on-site interview, which included small group interviews, one-on-one interviews with leadership, presentations, and Q&A times.", "Interview Questions": "How did you find UNCW?"}, {"date": "27 Mar 2017", "title": "Adjunct Professor Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at UNC Wilmington (Dallas, TX) in Dec 2016", "Interview Descriptions": "Had to interview with a small group and make a presentation on a specified topic.   Logistical information sent via email was incorrect and caused problems finding the location.   I arrived 5 min early and sat for 25 min waiting for the people to even acknowledge my presence.    NOT IMPRESSED.", "Interview Questions": "Why do you want to teach here?"}, {"date": "28 Oct 2016", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at UNC Wilmington (Wilmington, NC) in Feb 2016", "Interview Descriptions": "The interview process was fairly simple. I met with the director of my area and some current employees within the area as well. It lasted approximately 30 minutes and the conversation was easy.", "Interview Questions": "What do you expect from your supervisor?"}, {"date": "13 Sept 2017", "title": "Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at UNC Wilmington (Wilmington, NC) in Jul 2015", "Interview Descriptions": "Easy, fast, basic questions. They did not ask anything out of the ordinary and pretty much asked me more questions about what I had on my resume. The interview only lasted 15 minutes and I got a call a couple hours later that I received the job.", "Interview Questions": "Tell me your strengths and weaknesses"}, {"date": "28 May 2015", "title": "Program Administrator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. I interviewed at UNC Wilmington (Wilmington, NC)", "Interview Descriptions": "Best interview I have ever had! Great questions, broad spectrum of individuals from different departments. I felt they were all prepared and asked very pertinent questions. It was an engaging conversation.", "Interview Questions": "Why do you want to work here?"}, {"date": "5 Nov 2014", "title": "IT Analyst Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at UNC Wilmington", "Interview Descriptions": "Normally they start with a phone interview which is more of a meet and greet with some technical questions.  Then they bring you in for a face to face in front of a committee for an in person interview.  Sometimes, depending on the level of the position, you may have to meet with a larger audience in an open forum, but for your average employee this is not the case.", "Interview Questions": "Not 1 in particular, but some of the IT interviews can get quite technical.  Some questions are meant to be difficult to see how a person responds when they don't know the answer."}, {"date": "16 Aug 2014", "title": "Peer Educator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at UNC Wilmington", "Interview Descriptions": "Apply online and received a response via email almost immediately. Only a handful of people who submit a resume will receive an interview. \r\n\r\nInterview is super easy and consists of 3 of the current peer educators or 2 peer educators and the assistant direct. Questions are the normal \"tell me about a time when...\" or \"Tell us about how you would...\"", "Interview Questions": "Why do you want to be a peer educator"}, {"date": "14 Jul 2014", "title": "Lobby Desk Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 3 days. I interviewed at UNC Wilmington", "Interview Descriptions": "Must attend a hiring session in order to get an application. If selected you will go on to two Rounds of Interview, starting with a student interview and then an interview with professional staff after an open house. It's recommended that you fill out the application in pen and submit a resume and a cover letter.", "Interview Questions": "How would you deal with a situation where a co-worker was breaking a policy?"}, {"date": "28 Sept 2015", "title": "Business Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at UNC Wilmington (Wilmington, NC) in May 2014", "Interview Descriptions": "I went into my future manager's office and she asked me standard interview questions. Was helpful and did not try to \"trick\" me in any way. She showed me around the office to meet others too. I was thinking she must (hopefully) be picking me if I'm meeting others. Turns out she does that with everyone but thankfully I got the job.", "Interview Questions": "How organized are you?\r\nWhat is your worst work feature?"}], [{"date": "4 Jun 2014", "title": "Executive Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at UNC Wilmington in Mar 2014", "Interview Descriptions": "I applied in Feb and was called for an interview one month later in March.  The interview panel was nice enough but unprepared. I quickly got the impression this was an obligatory process and they already had a candidate in mind.", "Interview Questions": "None, as if they Googled top ten interview questions ten minutes before the interview."}, {"date": "5 Dec 2016", "title": "Resident Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 months. I interviewed at UNC Wilmington (Wilmington, NC) in Jan 2014", "Interview Descriptions": "Long, with lots of interviews. One group, one individual. The group interview is fun and interactive - there are several rooms and you will be asked to do different things in each room. The one on one interview isn't bad either, the HRL staff is just trying to get to know you as a person, so just be yourself!", "Interview Questions": "why do you want to be an RA?"}, {"date": "4 Nov 2015", "title": "Building Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at UNC Wilmington (Wilmington, NC) in Sept 2013", "Interview Descriptions": "Led by directors of Recreation Center and also student employees. The group interviews were great and the in-person interviews were even greater. I knew exactly what to expect going into the group interviews and it was helpful getting to know existing student employees before getting involved.", "Interview Questions": "Tell us about other experience you have"}, {"date": "3 Mar 2016", "title": "Campus Recreation Employee Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at UNC Wilmington (Wilmington, NC) in Jan 2013", "Interview Descriptions": "3 interviews, relatively easy but being outgoing!!! the staff at campus rec maintains a positive attitude throughout shift, so it is important to come to work with a smile. campus rec is the hardest place on campus to obtain a position, and at some semesters only hire 8-12 students.", "Interview Questions": "things like:\r\nwhat is a situation, that, looking back on now, you wish you had handled differently?"}, {"date": "16 Mar 2016", "title": "Office Assistant Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at UNC Wilmington in Oct 2012", "Interview Descriptions": "2-part interview, phone call (~20-30 min) and if selected, on campus interview (~3-6 hrs).  Pretty standard script of questions based on position.  On campus interview often involves one-on-one sessions as well as group sessions with staff the position is likely to work with.  Hiring process is time consuming as even though depts may receive permission to interview, they then have to confirm permission to hire, time from application to hire can be 2-3 months depending on position.", "Interview Questions": "Why do you want to work at a University?"}, {"date": "20 Jun 2013", "title": "IT Analyst Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 8 months. I interviewed at UNC Wilmington in Mar 2009", "Interview Descriptions": "Government process is long.  About 6 months between applying and getting phone interview. Afterwards got in person interview with a panel of three and then a computer hardware test.  Waited another 2 months or so before hearing back.", "Interview Questions": "How would you find a needle in a haystack?\r\n"}]]