[[{"date": "20 Jun 2023", "title": "Financial Aid Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Miami Dade College", "Interview Descriptions": "Interview process was great, the interviewers were very friendly and got back to me in a timely manner. There were two interviews conducted for this particular position, I cannot speak for other positions in the institution.", "Interview Questions": "Explain how your background/skills can benefit our organization."}, {"date": "14 Mar 2023", "title": "Assessment Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Miami Dade College", "Interview Descriptions": "1st interview phase was a panel interview with 4 people and it lasted about 30 minutes. Second interview Interview was at the assessment center. Simple and straightforward not too challenging. Good work environment everyone was respectful and professional.", "Interview Questions": "Develop questions for a test in 15 minutes and in-basket exercises"}, {"date": "31 May 2023", "title": "Director of Advising Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Miami Dade College (Homestead, FL) in Mar 2023", "Interview Descriptions": "The interview was very disorganized. They were running about 40 minutes late. The receptionist didn't know where the interview was. She told me to knock on a door. I heard another interview been held in the room and refrained to knock. I was interviewed by three panelists, very casual setting. One was recording my answers.", "Interview Questions": "Why should we hire you?"}, {"date": "6 Feb 2023", "title": "Program Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Miami Dade College", "Interview Descriptions": "Super easy interview and it was very quick. They had asked me about two questions each since it was a panel of 3 people interviewing me. One question they asked was about mdc policy", "Interview Questions": "Why do you want to become an advisor"}, {"date": "2 Feb 2023", "title": "Senior Network Engineer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. The process took 4 weeks. I interviewed at Miami Dade College (Miami, FL) in Feb 2023", "Interview Descriptions": "I had an online video screen with only one of interviewers. Come on people if you make us bare all on line you could at least show your face. Then to the on-site interview. I was assured that it was a meet and greet. They opened a screen on a wall monitor an F5 menu screen and asked me if I knew about profile? Then they showed me the drop down on how to create a pool. I am like sure. I can do this in my sleep. But at no time did they ask any question about it. I am like this is really easy. Then they come back to the recruiter and say I don't have technical knowledge. This for a job that I was really to drop my rate, work on-site 5 days a week. I think it was they didn't know how to use the programs. I am 63 and I am a woman and I am disabled and I am not Cuban. Hey you guys you even discriminate against other. Man.", "Interview Questions": "What was network access control?"}, {"date": "23 Jan 2023", "title": "Academic Advisor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Miami Dade College", "Interview Descriptions": "There is 3 interviews for Full Time Usually they already have someone for the role They will still interview you just to meet quotas It is all about your connections", "Interview Questions": "depends on the position you apply for"}, {"date": "12 Nov 2022", "title": "Program Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Miami Dade College (Miami, FL) in Oct 2022", "Interview Descriptions": "The interviewers were friendly, asked thoughtful questions, gave plenty of information about the job, and took the time to answer my questions. They were respectful and interested in my answers.", "Interview Questions": "How I respond to pressure"}, {"date": "24 Jul 2022", "title": "Admin Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Miami Dade College", "Interview Descriptions": "Great, very friend and detailed. Provided a lot of useful information. Explained all my questions. Felt it was a very professional setting. They followed through  even when I didn’t get the position", "Interview Questions": "What are your strengths and weaknesses"}, {"date": "10 Jan 2023", "title": "Part Time Testing Proctor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Miami Dade College (Miami, FL) in May 2022", "Interview Descriptions": "called and email asking about interview times. easy going interview, couple questions about why you want to work in the position, your availability, goals, and some example scenarios. two people were interviewing, and after the first interview, you would speak to the director of the department.", "Interview Questions": "\"what is your availability?\" \"why do you want to work in this department?\" \"where do you see yourself in 5 years?\" \"if a student were to do this, how would you handle the problem?\" \"if you had a situation with your coworker while working here, how would you handle the issue?\" \"do you speak spanish?\" \"are you a current or a former student in miami dade college?\""}, {"date": "16 Aug 2022", "title": "PT Clerk Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Miami Dade College in Nov 2021", "Interview Descriptions": "You sit with a panel of about 3-4 people. They ask you a few questions about yourself and some situational questions as well. It was a very comfortable and welcoming energy.", "Interview Questions": "You have an irate parent and student in front of you. The phone rings and it's your coworker who is trying to call out sick. How do you handle this situation?"}], [{"date": "16 Sept 2021", "title": "Adjunct Faculty Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Miami Dade College in Sept 2021", "Interview Descriptions": "Interviewer never showed up, and did not answer follow up emails. It seems unprofessional to me to make someone wait and wait, and to promise a \"Great job\" when they themselves lack the patience and time management to get anything done. This place is a mess.", "Interview Questions": "No interview and no questions"}, {"date": "25 Jun 2021", "title": "Assistant Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Miami Dade College", "Interview Descriptions": "Took about five interviews before I was hired.  It was a long process that took a couple of months but I was hired eventually. Met with several deans along the way including a couple campus presidents.", "Interview Questions": "Background in education including degrees,."}, {"date": "4 Oct 2021", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Miami Dade College (Miami, FL) in Mar 2021", "Interview Descriptions": "Very smooth, standard interview questions.\r\nStrength and weaknesses. \r\nStraight forward hiring process, background check, provide two reference from prior employees. If not, they also accept reference from former professors if you have attended the college or University.", "Interview Questions": "What are your strengths and experience"}, {"date": "15 Feb 2021", "title": "Publication Event Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Miami Dade College", "Interview Descriptions": "Two panel interviews, the first was very egalitarian.  The second interview was more antagonistic.  The woman was abrasive and seemed determined to insult.  I definitely dodged a bullet on this one.", "Interview Questions": "\"This isn't a job for someone to stay for a few years, then leverage connections for a better job in the publishing industry.  Is that why you're here?\""}, {"date": "15 Nov 2021", "title": "Public Safety Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Miami Dade College (Miami, FL) in Jan 2021", "Interview Descriptions": "great. easy to do and accomplish. was very successful with results. big focus on customer service and student community. customer service is key so be sure to practice very much", "Interview Questions": "What is customer service to you?"}, {"date": "18 Dec 2020", "title": "Training Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Miami Dade College", "Interview Descriptions": "Short and sweet. Spoke to the recruiter first asked me about my background. Asked some behavioral questions. Then informed me of the next steps. That they will be in touch within a week. And followed up within in a week to inform me the status.", "Interview Questions": "Tell me how you engage your audience when training?"}, {"date": "15 Nov 2020", "title": "Adult Education Teacher Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Miami Dade College (Miami, FL) in Nov 2020", "Interview Descriptions": "They called me about 2 weeks after I applied online.  I had  an online interview  because of covid with 3 people. They asked pretty difficult questions. I'm assuming they want someone with more experience or maybe a degree that's more advanced than mine.", "Interview Questions": "What grant operations have you worked with in the past?"}, {"date": "23 Sept 2020", "title": "Chemistry Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Miami Dade College (Miami, FL) in Jul 2020", "Interview Descriptions": "The interview was natural. The interviewer made sure I was comfortable and gave me a thorough understanding of the job expectations. I was allowed to ask any questions or concerns after and during the interview to make sure this position was the best fit for me.", "Interview Questions": "What previous experiences have you had that make you a good candidate? Are you a student? What coursework have you completed? How are you able to address a student's questions, if the individual is having difficulty understanding after 30 minutes of explaining?"}, {"date": "5 Aug 2019", "title": "OFFICE SPECIALIST Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Miami Dade College (Miami, FL) in Jul 2019", "Interview Descriptions": "I was greeted by two people in a big office space. They were cordial and straight forward to the interview. We had a good chat about my time as a student at Miami Dade College.", "Interview Questions": "How would I handle a difficult situation with a student who needs help with something beyond my actions. "}, {"date": "17 Apr 2019", "title": "Account Supervisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Miami Dade College (Hialeah, FL) in Apr 2019", "Interview Descriptions": "I interviewed at the Hialeah campus. I was interviewed by a panel. ALL of panel read questions from a paper, which were generic. If you seek for a dynamic answer, don't ask dull questions from an online source!! This panel did not showcase the position nor the college.  They don't encourage staff to seeking further education. On top of that, the lady couldn't speak proper English. I really struggled to connect what she was trying to convey.", "Interview Questions": "Questions from an online source. "}], [{"date": "9 Mar 2019", "title": "Resource Development Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Miami Dade College (Miami, FL)", "Interview Descriptions": "Direct to thorough and friendly panel from application online. No phone screen. Final Interview  conducted by department director. Panel of 3 members of senior departmental staff asking various questions about level of experience. Interview questions ranged from asking for detail about past experience and standard culture questions like: Why Miami Dade College?", "Interview Questions": "Describe a specific process from inception to completion in your project management experience. "}, {"date": "1 Nov 2021", "title": "Social Media Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Miami Dade College in Feb 2019", "Interview Descriptions": "Easy process and they were nice. I met with the cfo of the Campus after a call and application as well and background and drug test. I was provided uniform shirts to wear.", "Interview Questions": "Skills and past work, and portfolio "}, {"date": "20 Aug 2018", "title": "Instructor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Miami Dade College (Miami, FL) in Jul 2018", "Interview Descriptions": "There are many steps: 1st telephone; then meet with committee to do presentation, more questions and then writing sample; meet with chair person; if success- then meeting is with president of the college", "Interview Questions": "What is trending?"}, {"date": "19 Jul 2022", "title": "Social Media Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Miami Dade College (Miami, FL) in Jul 2018", "Interview Descriptions": "I applied through the student portal for a student aid position. I was then reached out to and asked to come in. Interview was very fluid.   Was one of the best places I have ever worked.", "Interview Questions": "What is one your best strengths? "}, {"date": "18 Feb 2022", "title": "Bim Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Miami Dade College (Miami, FL) in Mar 2018", "Interview Descriptions": "The interview process was organized and detailed. The hiring committee was inviting and also well prepared. The questions were all straight to the point and easy to answer. Overall it was shorter than expected.", "Interview Questions": "What would your first month of work look like?"}, {"date": "25 Jun 2018", "title": "Financial Aid Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 7 months. I interviewed at Miami Dade College (Miami, FL) in Feb 2018", "Interview Descriptions": "The interview process was long and intense. My first interview was a panel interview that consisted of 5 people following another panel interview of people. All other interviews were 1 on 1 with the deans and president. During the final interview stage you learn a lot about the company and its culture.", "Interview Questions": "Name a time you dealt with an upset customer?\r\n"}, {"date": "4 Dec 2017", "title": "Business School Advisor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Miami Dade College (Miami, FL)", "Interview Descriptions": "Applied online. Called for an interview 3 months after I applied. Interview was with Department Head (DH), her secretary, and another advisor. Later on the day, I received a call from DH telling me that she wanted to go ahead with an offer and that her assistant would be following up with me about the next steps for me to get hired. Spoke to assistant the following day and submitted documentation requested. Followed up via email and got no response so I called to speak with her. She informed me that I would have to resubmit application via the job site. I explained that the system wasn't allowing me to edit or even resubmit my application. Their system does not allow that after the job deadline has passed. She informed me she would contact HR and would call me back. She didn't. I followed up, but she was never in her office when I called. I had a great interview experience, but everything that came after was really poorly handled by their staff. To this day, I never got a response. Absolutely, no follow up whatsoever either through email or a phone call.", "Interview Questions": "Walk me through your resume."}, {"date": "27 Nov 2017", "title": "Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Miami Dade College", "Interview Descriptions": "I was asked to give a PowerPoint presentation in front of a panel. For the second round, I had an interview with the hiring manager. She told me she would call me the next day and to make sure I was available for her call. She never called. I followed up via email and phone, but never heard back from her. \r\n\r\nHaving invested so much time and effort in the interview process, I feel I at least deserved a call or email saying I was not selected. Being that MDC is a well-respected institution, I expected to be treated with more tact and professionalism.", "Interview Questions": "Name three reasons why you would be the right fit for this position. "}, {"date": "9 Dec 2017", "title": "Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Miami Dade College (Miami, FL) in Nov 2017", "Interview Descriptions": "Very lengthy process. There were four rounds of interviews. The first round was with a panel and included a powerpoint presentation. They gave me only a day and a half notice before the interview to get off work that day and prepare the presentation. The next rounds were more professional with higher level administrators.", "Interview Questions": "How do you manage difficult staff?"}, {"date": "21 Jul 2017", "title": "Dean Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at Miami Dade College (Miami, FL)", "Interview Descriptions": "Very un personable!  I was interviewed by 5 people from their committee. I was asked some questions none had to do with my CV I don't even think they had it in front of them. It was one of those interviews where they hired one of their own and just interviewing for show. My interview was a total of 4mins long! Horrible", "Interview Questions": "Strengths and weaknesses"}], [{"date": "18 Jul 2017", "title": "Business School Advisement Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Miami Dade College (Miami, FL) in Apr 2017", "Interview Descriptions": "I found the interview process to be very short, and the process very unorganized and not professional.  The personnel that I met with for the first interview were very pleasant but the second  day, which was suppose to be the chair of the department was incredibly rude, dry, didn't ask any relevant questions, and rolled her eyes at the applicant which was me!  I felt very insulted and I shouldn't have had such an experience.", "Interview Questions": "What can you bring to enhance the student's experience."}, {"date": "2 Dec 2017", "title": "Business Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 3 weeks. I interviewed at Miami Dade College (Miami, FL) in Mar 2017", "Interview Descriptions": "The hiring process was very easy, they just asked me basic behavioral questions. As well some basic situational questions. Such as if a student asked you they didn't understand a problem you explained what would you do?", "Interview Questions": "Tell me about yourself, what your are strengths, and weaknesses, etc."}, {"date": "3 Apr 2018", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Miami Dade College (Miami, FL) in Dec 2016", "Interview Descriptions": "The interview process was done in a friendly atmosphere. I was given a choice of topics to choose from to prepare a mock class. I studied the course book before the interview and asked employees about the process and those interviewing. I researched the college's mission and school demographics.", "Interview Questions": "Why do you want to teach at Miami-Dade College? Which courses are you interested in?"}, {"date": "8 Dec 2016", "title": "Chemistry Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Miami Dade College (New York, NY) in Dec 2016", "Interview Descriptions": "Three skype interviews:\r\nthe first interviews has three parts: questions, teaching demo, and writing test\r\nthe second interviews meets with dean  and chairman of chemistry department\r\nthe third interview met with president", "Interview Questions": "how to deal with \"unprepared\" students"}, {"date": "20 Jun 2017", "title": "Senior Academic Advisor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Miami Dade College (Miami, FL) in Nov 2016", "Interview Descriptions": "Long and tedious. Always changing. Usually 3-4 levels of interviews in total. Depending who's on the panel will depend on the requests being made. I've written a report that was never read, and I made a presentation.", "Interview Questions": "What do you feel makes you qualified for this position? "}, {"date": "8 Oct 2016", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Miami Dade College", "Interview Descriptions": "Pretty straightforward. It was a student position for the college IT department. They are always hiring students from the college so they are fairly friendly and eager to work with you", "Interview Questions": "Technology related questions"}, {"date": "22 Feb 2020", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Miami Dade College (Miami, FL) in Aug 2016", "Interview Descriptions": "The interview process was quick and to the point. It was about my experience, what was I looking to get out of the internship and why I thought I would be a good fit for the college.", "Interview Questions": "Why do you think you will be a good fit for our culture?"}, {"date": "20 Feb 2020", "title": "Department Chair Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Miami Dade College (Miami, FL) in Jul 2016", "Interview Descriptions": "Meet with panel then on another day meet with dean and other chairpersons then campus president.  Present a topic and discuss administrative style,  position expectations, and benefits including sick time, leave,  and orientation.", "Interview Questions": "Teaching experience"}, {"date": "29 Sept 2016", "title": "Office Clerk Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Miami Dade College (Miami, FL) in Jun 2016", "Interview Descriptions": "Three members in the conference room, very welcoming and professional individuals. They stated their questions clearly and were very knowledgeable. I first had a phone interview, then was asked to come in.", "Interview Questions": "Why should we hire you?"}, {"date": "20 Dec 2016", "title": "Secretary Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "The process took 5 weeks. I interviewed at Miami Dade College (Miami, FL) in May 2016", "Interview Descriptions": "I'm an Outside, never worked for MDC. First interview was about 10-15 min. Then I was called to for a second interview with the Dept director. After that second interview, I was asked to write a memo style letter to faculty & staff. I was also asked to leave reference contact info preferably from my current supervisor. End result: I had to mention to my current manager that I had applied to another job, since I provided them with contact info and I found out that the job was given to a current part timer from another campus, a directors wife, what a coincidence. Why make me go through the hassle when you know you prefer insiders??? I missed so many hours of work for these interviews. Only to find out that due to college policies, they have to interview outsiders in order to consider insiders. What a waste of time!! It's all About who you know and who knows you! Don't waste your time!", "Interview Questions": "Explain how you prioritize your tasks."}], [{"date": "3 May 2016", "title": "IT Consultant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Miami Dade College (Miami, FL) in May 2016", "Interview Descriptions": "Arrived early and interviewer was expecting me. Super easy to talk to and I was asked very detailed questions regarding networks. The person who interviewed me was a gentleman with an electronics engineering background and I thought it was strange they were having this person interview me. I asked about their network admin and said they were not available.", "Interview Questions": "What kind of raid array is needed to run a network with 100 computers?"}, {"date": "31 Jul 2017", "title": "Assistant Professor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Miami Dade College (Miami, FL) in Jan 2016", "Interview Descriptions": "They sit you down and ask questions, you then answers the questions as you deem fit. They can be described as typical interviewing questions. This word count is ridiculous, I can not believe I have not reached it yet.", "Interview Questions": "What is your favorite color?"}, {"date": "25 Jan 2016", "title": "Secretary Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Miami Dade College (Miami, FL) in Jan 2016", "Interview Descriptions": "Three members in the conference room, very welcoming and professional individuals. They stated their questions clearly and were very knowledgeable. I first had a phone interview, then was asked to come in. I am currently awaiting to hear back from them n hopes I will make it the third stage of the hiring process.", "Interview Questions": "Provide examples of complex tasks you have completed in previous jobs."}, {"date": "5 Jan 2018", "title": "Student Assistant Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 3 weeks. I interviewed at Miami Dade College (Miami, FL) in Jan 2016", "Interview Descriptions": "Met in person, interview lasted about an hour. Asked general questions about my resume and major. I had to also submit references, and a sample of written work. \r\n\r\nMet in person, interview lasted about an hour. Asked general questions about my resume and major. I had to also submit references, and a sample of written work.", "Interview Questions": "Name a time you did not follow instructions?"}, {"date": "24 Jan 2017", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Miami Dade College (Miami, FL) in Jan 2016", "Interview Descriptions": "very nice! The selection time was very welcoming and explained the job description and hiring process. It has a great work environment and everyone seemed friendly. There were several interviews but I believe its part of the hiring process. Overall, seems like a great atmosphere within the department and excellent professionalism", "Interview Questions": "What makes me right for the position"}, {"date": "5 Jan 2016", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Miami Dade College (Miami, FL) in Nov 2015", "Interview Descriptions": "Got a call requesting that I come in for an interview 2 days later with a very tight window for available times. If you couldn't make these times, you were out of luck. Was led into a large conference room where I met with head of department and 2 senior professors. Introductions were made, I was asked to talk about myself and then I was asked to give the 5 minute presentation I'd been asked to come prepared with. Then some questions were asked. Entire process took abot 15 minutes.", "Interview Questions": "Tell me about yourself "}, {"date": "11 Oct 2015", "title": "Programmer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Miami Dade College", "Interview Descriptions": "The hiring process involved a panel of interviewers from different areas of the business units (ex. Registration and Finance). They all had questions and seemed fair and overall a friendly experience.", "Interview Questions": "How do you perform an analysis?"}, {"date": "22 Sept 2015", "title": "Part Time Clerk Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Miami Dade College", "Interview Descriptions": "Applied online, got a call a few days later to come in for the interview...Attended the interview, got a call back the same day. I got interviewed by two people and the overall experience wasn't bad at all", "Interview Questions": "Why would you be a good candidate for this position?"}, {"date": "16 Aug 2015", "title": "Senior Database Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at Miami Dade College (Miami, FL) in Aug 2015", "Interview Descriptions": "First interview was technical. Three interviewers. Alternate process and technical questions. Questions not so hard. Very professional. Called about a month after resume submitted. Interview was short. To be followed be interview with hiring manager.", "Interview Questions": "Best way to concat string under ASP.Net"}, {"date": "2 Jul 2015", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Miami Dade College (Miami, FL) in Jun 2015", "Interview Descriptions": "I applied online and was called in for an interview within a week. The interview process did not take very long. It was basically a conversation with the chair of the department. At the end of the interview, I was offered the position.", "Interview Questions": "How would you work in a culturally rich environment?"}], [{"date": "11 Jan 2016", "title": "Information Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Miami Dade College (Miami, FL) in Jun 2015", "Interview Descriptions": "Apply though the website. Then get called by the person doing the interviews. You will also need to get a background check that costs 50 dollars on your part. After that you just have to wait until you are called back by the interviewer.", "Interview Questions": "Standard questions. \r\nExpectations, experience, education."}, {"date": "17 May 2017", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Miami Dade College (Miami, FL) in May 2015", "Interview Descriptions": "Quick and straightforward interview. You walk in, talk to an advisor that is in charge of handling the interviews, and then speak to the supervisor in charge of the department. Not a lot of questions asked apart from availability, and general knowledge of the position and department.", "Interview Questions": "Can you write about your experience in another country?"}, {"date": "9 Mar 2015", "title": "Accounts Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Miami Dade College", "Interview Descriptions": "It was a panel interview. There were mostly friendly questions, not intimidating at all, asked about 15 questions or so. First was a phone interview, then got a call back for a second in person interview. Both were conducted by two people.", "Interview Questions": "Tell us about your employment history?"}, {"date": "11 Jan 2018", "title": "Librarian Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Miami Dade College (Miami, FL) in Feb 2015", "Interview Descriptions": "Easy, two interviews and role playing exercise. It was a group of people form the Learning Resources Department and maybe other specialized departments that come into contact with a librarian regularly.", "Interview Questions": "All reasonable questions about ability, education, and work scenarios."}, {"date": "2 Aug 2018", "title": "Clerk Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Miami Dade College (Miami, FL) in Feb 2015", "Interview Descriptions": "The interviewing process was very tedious and extensive. Managers used the typical behavioral interviewing method questions. They were pretty direct about what they were looking for and expecting from qualified candidates.", "Interview Questions": "What do you know about the company"}, {"date": "28 Sept 2015", "title": "Part Time Clerk Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Miami Dade College (Miami, FL) in Feb 2015", "Interview Descriptions": "Interviewed twice within two weeks. Wasn't hard, just required some information on the school and the mission. It was a panel interview, which was daunting, but otherwise they were very quick. Required a writing sample as well.Some of the more positive aspects came from the fact that they would call back quickly. Their panels and 1:1 was very professional.", "Interview Questions": "Why do you think you&amp;#039;re the right fit for this position?"}, {"date": "1 Sept 2015", "title": "Mathematics Learning Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Miami Dade College in Oct 2014", "Interview Descriptions": "Brief in person interview with two people with basic questions about teaching and mathematics background, followed by a math assessment test that was wide ranging but relatively simple. The interview was very friendly and as casual as an interview can be.", "Interview Questions": "What is your background in teaching? Why this job over your private tutoring?"}, {"date": "29 Sept 2016", "title": "Payroll Specialist Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Miami Dade College (Miami, FL) in Sept 2014", "Interview Descriptions": "They start with a 10 minute phone interview, and if you are selected, you travel to their location for a meeting with your direct supervisors and the department head. An evaluation is given after the interview.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "12 Dec 2018", "title": "IT Support Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Miami Dade College (Miami, FL) in Jan 2014", "Interview Descriptions": "Took a day and very easy. They started asking with behavior questions and then about skills. Then, questions about why working in IT education and how you will be working in team to solve problems.", "Interview Questions": "behavioral questions and talk about previous jobs."}, {"date": "25 Oct 2013", "title": "Part Time Clerk Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Miami Dade College", "Interview Descriptions": "Not hard interview. Just sit with the director of the department. They give you cases on what you will do. A simple interview", "Interview Questions": "Where do you see yourself in 10 years"}], [{"date": "23 Jun 2015", "title": "Customer Service Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Miami Dade College (Miami, FL) in Oct 2013", "Interview Descriptions": "It took an average amount of time. first you applied. than they would contact you by phone and do a mini interview. Than you would go ahead and set up a meating for the interview which was on average difficulty. it was in a format of a panel which you would answer a couple simple questions.", "Interview Questions": "typical questions that an employer would ask. how did you cope with an difficult experience? how do you handle team work?"}, {"date": "22 Aug 2013", "title": "EAP Lab Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Miami Dade College (Miami, FL)", "Interview Descriptions": "Several persons ask pertinent questions to the job duties of a lab instructor. Experience teaching ESL and or foreign languages. Ask if you are familiar with the software they currently use in the labs. Availability and expected hourly wage.", "Interview Questions": "About the software they use in the lab as well as their management platform: webct/ Angel/ blackboard/ etc."}, {"date": "30 Apr 2017", "title": "Registation Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Miami Dade College (Miami, FL) in Aug 2013", "Interview Descriptions": "Interviewed with the head of registration and a panel.  I was asked about dealing with difficult people.  Also asked about ability to use a computer.  They asked my typing accuracy and wpm.  The next phase was to wait for background check.  I then had to have drug test.", "Interview Questions": "How are you with dealing with difficult people?"}, {"date": "11 Jul 2013", "title": "Administrative Supervisor Interview", "results": "No Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Miami Dade College", "Interview Descriptions": "Round table with four panelists asking preapproved questions.", "Interview Questions": "Write a response to an angry students email"}, {"date": "23 Sept 2017", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Miami Dade College (Miami, FL) in Jun 2013", "Interview Descriptions": "Interview was performed by both admissions supervisors. They asked basic questions about education, work experience, computer proficiency and language skills. After a brief 5 minute interview, they hired me and explained the rather simple hiring process.", "Interview Questions": "Why do you want to work at Miami Dade College?"}, {"date": "2 Dec 2015", "title": "Public Safety Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Miami Dade College (Miami, FL) in Mar 2013", "Interview Descriptions": "For full time officer you have to do a interview with 4 different panels then with the President of the campus......................................................................................ooooo oooo ooooo  oooo ooooooo  ooooo  ooo  ooo", "Interview Questions": "Why would you like to work for MDC"}, {"date": "9 Mar 2015", "title": "Chairperson Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 5 days. I interviewed at Miami Dade College (Miami, FL) in Jul 2012", "Interview Descriptions": "1st interview was group panel to include presentation. I was doing the position for 5 years and not getting the title nor salary. I was not chosen for a 2nd interview because a couple of the committee members did not like my leadership skills and could not see me as their supervisor.", "Interview Questions": "tell us about your experience."}, {"date": "26 Nov 2016", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Miami Dade College (Miami, FL) in Jun 2012", "Interview Descriptions": "they are always hiring in most areas. the first round is with 3 people at least, the second round is with a  chair person, and the third is with the dean. In case there's a chair person stepping down, you have no chance getting the position, even if you are being interviewed. chairs get teaching positions automatically.  the jobs site lists current openings and in some areas they put up positions that may open up soon.", "Interview Questions": "questions are typical: tell us about yourself, what can you give to MDC, give us a specific example that was difficult in your former job and how did you solve it"}, {"date": "24 Apr 2016", "title": "Adjunct Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Miami Dade College (Miami, FL) in May 2012", "Interview Descriptions": "Pleasant. Requested college transcripts and resume. Interview with faculty. The Department director asked about the years of experience and to explain why I was interested in teaching. I presented all my licenses and certifications. They requested all immunizations including flu vaccination.", "Interview Questions": "How would you handle a disruptive student in the classroom?"}, {"date": "6 Oct 2015", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Miami Dade College in May 2012", "Interview Descriptions": "Almost none. Emailed the department i was interested and they gave me an application. Was hired almost immediately. There was a quick group interview which i was really nervous in but they didn't seem to mind, it was more of a formality and they immediately gave me my hiring papers to sign.", "Interview Questions": "Can you teach"}], [{"date": "18 Sept 2015", "title": "Program Leader Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Miami Dade College (Miami, FL) in Mar 2012", "Interview Descriptions": "Easy. It was over the phone. Questions were standard. Walking out of the interview I actually thought it was too easy and for a second questioned the professionalism of the organization. There was no follow-up interview. I was called soon after and told I had the position.", "Interview Questions": "What makes you think you are the right person to be an AmeriCorps VISTA?"}, {"date": "2 Mar 2016", "title": "Manager of Math Lab Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Miami Dade College (Miami, FL) in Jan 2012", "Interview Descriptions": "First apply online. Then, some will call you for an interview. If you are selected, the interview will be with the hiring manager and with the Director of the Department. Then, you will working in 3 weeks.\r\nMaybe the duration of this process is 3 month. This depend of the job positions and date periods to submit the application. Do not call, they will call you. It is difficult you contact the hiring manager.", "Interview Questions": "What are your goals in 5 and 10 years?\r\nWhat are you applying to this position?\r\nTell me more about you?\r\nWhat skills do you have for this job?"}, {"date": "14 Nov 2011", "title": "Management Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Miami Dade College (Miami, FL) in Nov 2011", "Interview Descriptions": "The company contacted me via phone and e-mail to set up the interview. The interview took place via phone with a panel. They offered me a second in-person interview but it was out of state, so I declined, since it was out-of-pocket costs.", "Interview Questions": "What interests you about the job?"}, {"date": "26 Jul 2015", "title": "Adjunct Professor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Miami Dade College (Miami, FL) in Apr 2011", "Interview Descriptions": "Varies. Sometimes required to write a piece, teach a mini-sample class section, answer questions from a committee. I came into the committee interview with a presentation that drew the committee's great pleasure evidenced by commendations and one faculty asking for a copy of PowerPoint Presentation. I did the dance, wowed them, gave them copies of my outstanding student evaluation surveys, copies of \"Rate My Professor\" average of 4.9 and higher... and still got turned down. When I saw who they hired (persons with less experience, less personality, and consistently only women), I could only conclude that they had this person already in line and chosen. The interviews were simply a fulfillment of law, procedure, and an illusion. To get a full-time position, a faculty member has to die or retire. 2/3 of faculty at Miami Dade is adjunct. The school makes a lot of money off the backs of cheap labor from professors who make less than their full-time faculty and they receive no benefits whatsoever. Many adjuncts are on food stamps. They are at the whim of a chairperson who may or may not give them classes if the Chairperson likes or dislikes the faculty. I've seen Chairpersons dislike a faculty for idiotic idiosyncrasies and deliberately refuse to give them classes, despite those faculty members having consistently great reviews from the students. Chairpersons are never evaluated by adjunct faculty though there can be many abuses. Deans of schools seem to turn a blind eye.", "Interview Questions": "Do you use technology in your teaching?"}, {"date": "21 May 2011", "title": "Lab Assistance Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Miami Dade College (Miami, FL) in Sept 2009", "Interview Descriptions": "i applied online , the next week thet call me for an interview", "Interview Questions": "how did you heard about us?"}, {"date": "10 Mar 2013", "title": "Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Miami Dade College (Kendall, FL) in Jun 2009", "Interview Descriptions": "Began with a quick phone interview followed by an on-campus interview with 5 other professors. The 3rd interview was with the department chair. The final interview was with upper management. Expect to give a brief presentation on something related to your expertise.", "Interview Questions": "N/A"}]]