[[{"date": "4 May 2023", "title": "Program Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Open Society Foundations", "Interview Descriptions": "It was just one interview. the process was clear. I got a rejection, but I appreciated the respect and support. The questions were clear however, I did not feel that they respond to my questions or provided me with a sense of what they are looking for.", "Interview Questions": "- Tell me about an instance where you dealt with a difficult situation"}, {"date": "28 Feb 2023", "title": "Program Operations Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Open Society Foundations (London, England) in Dec 2022", "Interview Descriptions": "Overall pleasant and professional interview, and they put in effort to help me feel at ease. \r\nSummary: 1 hr. interview; 10 - 12 questions approx. (skipped a few questions because my answer to prior question satisfied the next question); 3 interviewers from OSAP team: Head, Manager, and Officer Interview:  Each took turns to ask questions; no pattern in terms of who asked what kinds of questions. Two main types of questions: Behavioral, motivation, and competency. For my interview, at least 70% of the question was on competency and motivation. Given 7-10 minutes to ask interviewers questions.", "Interview Questions": "1. Why do you want to work with OSF? 2. What is your career aspiration/motivation? 3. What issues in Asian Pacific region are to familiar with (e.g. geopolitical, social, economical, etc.) 4. What is your working style, How would you work with our team across different time zones? *as much as I can remember"}, {"date": "27 Jan 2022", "title": "Associate Legal Officer Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Open Society Foundations (New York, NY)", "Interview Descriptions": "The process took several months, and included a very pleasant team of people. I was asked questions about my experience solving a difficult legal issue. Although I received an offer and would have accepted, the pay offered was simply too low for the market (NYC), because the particular position I interviewed for was not unionized, unlike other positions. To give some context, the position required about 4 years of experience as an attorney, yet was paying an entry-level salary. Great team, though, and great mission.", "Interview Questions": "Describe a difficult legal task and how you went about solving it. "}, {"date": "29 Nov 2022", "title": "Program Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Open Society Foundations (New York, NY) in Nov 2021", "Interview Descriptions": "I had a first contact by the HR, with a written test. Then I had an interview which was half in English and half in Spanish. And I did not get an offer after, but they were kind enough to provide me with constructive feedback.", "Interview Questions": "Present yourself And then a lot of political context questions."}, {"date": "26 Oct 2021", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Open Society Foundations (New York, NY) in Oct 2021", "Interview Descriptions": "this interview process was very thoughtful and respectful and I would most definitely recommend applying for a job here. it took them a while to get back to me, but overall a good experience.", "Interview Questions": "What would be most challenging coming into the role?"}, {"date": "10 Jun 2021", "title": "Communications Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at Open Society Foundations", "Interview Descriptions": "My application process for the role (Berlin office) started in January 2021. At first I had a very good impression. I had two interviews, which were both very nice, especially the very first one with one of the recruiters. The recruiter I was in touch with via mail was also very friendly. I also took part in a bunch of assessment tasks, in which I - according to the last interview with the team – did very well. After the interview, which took place end of April, I never heard back from them. They just ghosted me. No answer to my email. No answer to my message on LinkedIn. While they are already busy promoting the job again on hiring platforms... Today, I finally got an automated and anonymous message in which the HR team canceled me for the job. No explanation. This is really disappointing and just sad. I feel not valued as a person and potential employee. There should be the same commitment on both sides in a recruiting process, especially if it is so intense like this one. But you won't get it with Open Society. Really a shame..", "Interview Questions": "List five environmental/climate savvy journalists and their contacts (for us to copy into our address book)"}, {"date": "23 May 2021", "title": "Team Leader/Senior Policy Advisor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Open Society Foundations", "Interview Descriptions": "Interview process:\r\nFour rounds in total. from HR , written test, panel interview and last panel interview.\r\nvery responsive, efficient and provided feedbacks on your interviews.\r\ngood process so far. people are nice and helpful.", "Interview Questions": "- motivation\r\n- thoughts on grant management, impact investment and advocacy\r\n- linkage between democracy and human rights"}, {"date": "15 Jun 2021", "title": "Communications Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 5 months. I interviewed at Open Society Foundations (Berlin) in Apr 2021", "Interview Descriptions": "At the beginning of the application process I had a good impression of the overall process and thought it was quite professional. The people interviewing were nice and professional.\r\n\r\nI went through three rounds of interviews, where the last round and interview was the most difficult to complete. As part of the second round I also completed tasks at home over the weekend and handed them in. After the last round  I never heard back from OSF. After having waited for 4-6 weeks, I sent an email, I called several times - and saw that the exact same job was posted again on LinkedIn, which added up to my confusion. No reply, they ghosted me.\r\n\r\nA few days ago, I got an anonymous e-mail from the HR Team cancelling me for the job. This whole experience was quite disappointing. After investing quite some time in the application process  I expect the other party to at least answer to an e-mail or call back. And not to ghost applicants for several weeks.", "Interview Questions": "How do you manage difficult situations at work?"}, {"date": "10 Mar 2021", "title": "Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Open Society Foundations", "Interview Descriptions": "It's a pretty rigorous process involving several rounds of testing -- including a technical round, behavioural round, team dynamics round, and problem solving round. The interviewers who typically tend to be team members rotating are looking to gauge learning potential and an overall holistic approach to the kind of role they're applying for. Thematic understanding and clarity in terms of concepts is absolutely vital. The interviewee needs to be able to tie their professional experiences to the individual components of the thematic area they're applying for a job in.", "Interview Questions": "Why were you drawn to this particular thematic area?\nHow do you feel about being a generalist and a specialist?\nWhat are some of the factors you would like to consider when you're looking at a grantee/non-profit?"}, {"date": "18 Feb 2021", "title": "Administrative Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Open Society Foundations", "Interview Descriptions": "Long and thorough, but HR reps were very communicative during the process. Consisted of initial phone call, a timed practical test, an interview with potential peers, and an interview with department managers.", "Interview Questions": "How would you deal with a difficult request?"}], [{"date": "30 Jan 2021", "title": "Senior Executive Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Open Society Foundations", "Interview Descriptions": "4 Rounds of interviews. First is a general with HR, then with someone from the department. After that is a skills test and finally an interview with the person I would've been assisting.", "Interview Questions": "Why OSF and this position. What is your experience managing up. Can you talk about your adaptability"}, {"date": "6 May 2021", "title": "Program Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Open Society Foundations (New York, NY) in Nov 2020", "Interview Descriptions": "I had a 30 screen cal with HR. And then I had a 60 minute videoconference with the team I was supposed to work with. The process was pretty fast.", "Interview Questions": "What are your perspectives when working with social justice?"}, {"date": "23 Dec 2020", "title": "HR Project officer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Open Society Foundations in Oct 2020", "Interview Descriptions": "More than a month after sending my application, I got an email from their recruitment coordinator asking for a last-minute interview the next day or the day after. I agreed to talk to the recruiter the next day. The recruiter was 15 minutes late to the call and only called me after I emailed the coordinator and asked what is going on. The interview went well, the recruiter told me that I'm through to the next round which would be a panel interview in about 2 weeks and that she will schedule it soon. About a month after that first call, I reached out to ask whether the process is still happening since nothing got scheduled and nobody contacted me. I haven't heard from anyone from OSF since that original first interview almost 3 months ago, despite being told that I'm through to the next round. What a waste of my time!", "Interview Questions": "Tell me about your experience relevant to the job"}, {"date": "21 Oct 2020", "title": "Team Leader Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Open Society Foundations in Jul 2020", "Interview Descriptions": "I received an email after 8 pm at night asking if I had any availability the following morning. Of course, I said yes. I had a 30-minute interview during which the interviewer said twice that I more than met the criteria of the position. When I told her I had interviewed with OSF five times over the past few years, she said it's hard to get in. She told me HR would be in touch with me shortly. I never heard from them about this job again. I'm not applying there anymore. I don't have a strong connection to OSF to get me through the door.", "Interview Questions": "Tell me how you think theory of change works. "}, {"date": "17 Jun 2020", "title": "Program Officer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Open Society Foundations", "Interview Descriptions": "The interview process took eight months during which time I was interviewed three times by multiple staff, invited to meet senior staff then disinvited a day later, and the job was re-advertised. After it was re-advertised, I was re-interviewed in person, met six senior staff, was told in writing in ane email I was going to get an offer - then silence for a least a week, then told they had changed their mind. It was a deeply unpleasant, unprofessional process.", "Interview Questions": "How do you see systemic change?"}, {"date": "8 Apr 2020", "title": "Administrative Program Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Open Society Foundations (New York, NY)", "Interview Descriptions": "I received an e-mail from the hiring coordinator from their London Office to schedule a phone interview. The recruiter was very unprofessional, I waited about 10 minutes until she finally called me.  We begin the phone interview and I could tell she was rude and didn't really care for what I had to say. She basically told me that I was over qualified for the job and that they wanted someone to be in this position for a very long time, almost forever. She cut the interview and said we shouldn't proceed. I have never experienced anything like this during an interview.", "Interview Questions": "Why do you want to work in an administrative position? \r\n"}, {"date": "30 Jul 2020", "title": "Program Officer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Open Society Foundations in Mar 2020", "Interview Descriptions": "About a month after I applied I received an email from someone in HR to take an assessment. I was traveling quite a bit at the time and only had one day at home in NYC between traveling from  South America to Europe. They offered zero flexibility for the timed assessment so spent 6-hours on it on my one day home. Heard back via email from a different HR person (at this stage I still haven't actually spoke to anyone or had the opportunity to ask questions) that I would be moving on to the next stage of recruitment with a video panel interview. The interview lasted over an hour with two individuals. After that, they fell off the face of the earth. I followed up with HR 2-weeks later and nothing. I invested a lot of time in the process and just never heard back at all. Probably better off as I take this as a proxy for how the organization is run.", "Interview Questions": "How do you define Justice? "}, {"date": "3 May 2022", "title": "Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Open Society Foundations (New York, NY) in Mar 2020", "Interview Descriptions": "3 rounds; 1 assessment after 2nd round. \r\n\r\nThere was no salary negotiation phase although it could have likely been with HR after the 3rd round. Was subject based questions relevant to my role.", "Interview Questions": "What policies have you helped create in your previous role?"}, {"date": "9 Jun 2020", "title": "Program Officer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Open Society Foundations (New York, NY) in Feb 2020", "Interview Descriptions": "I received an invite for the phone interview one night before the interview date at 10.41  pm, . It seems that I was invited in a hurry and it was just a formality to reflect diversity in their process. The  HR person was few minutes late in calling. Despite having over 15 yrs of work experience in global health, I was not selected for the next round of interview. My interview had gone well and I see no reason for not being selected.  They need to select people from different backgrounds and race particularly Asians and Indians. They need to practice diversity and fairness in the selection process and not give preference to few races and candidates who have internal references.", "Interview Questions": "Tell us about yourself"}, {"date": "27 Sept 2022", "title": "Legal Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Open Society Foundations (New York, NY) in Dec 2019", "Interview Descriptions": "There were three interviews before offer. First two were over zoom. First with hiring team representative. Second with one member of future team. Third in person with team members. This might be different now due to the pandemic.", "Interview Questions": "Background about yourself\nStandard behavioral questions"}], [{"date": "17 Feb 2020", "title": "Associate Legal Officer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Open Society Foundations in Nov 2019", "Interview Descriptions": "HR reached out to me, informed me I had been selected for a pre-screening interview. Was asked to complete a written test (three different writing tasks, designed to be completed in 5 hours, given a 24-hour window to do so). \r\n\r\nSpoke with only someone from HR, not someone from the Legal team, so I didn't get to ask many substantive questions. Also was in contact with 3 or 4 different HR people, and they kept sending conflicting information. Never received the email address of the person who interviewed me, so I was unable to send a follow-up thank you. \r\n\r\nNever got a response from the office, even though I followed up with (one of) my contact points in HR.  Deeply frustrating that I was expected to jump through hoops and I was required to produce three writing samples, when HR can't be bothered to send an email to rejected candidates (there were only about 8-10 shortlisted candidates, so a brief email would have been appropriate).", "Interview Questions": "Why are you interested in this position? What do you think you would excel in at this position and what might you struggle with? "}, {"date": "1 Oct 2019", "title": "Program Officer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 5 months. I interviewed at Open Society Foundations", "Interview Descriptions": "There were two rounds of interviews. The first and preliminary round had 3 interviewers. The second had a panel of 4 people. It also included a 45-minute role play in the final interview stage. There were two written tasks as well.", "Interview Questions": "Why did apply for this job? "}, {"date": "22 Dec 2019", "title": "Program Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Open Society Foundations (New York, NY) in Sept 2019", "Interview Descriptions": "The process began 2 months after applying online\r\n1- Phone screening\r\n2-video panel interview\r\n3- written assessment\r\n4-final panel interview\r\n\r\nIt was an incredibly thoughtful process  that really sought to gauge fit in the team and expertise in the topic area. There were no repetitive questions (which was a welcomed change to other interview processes ) and most questions are geared to test your competency for the job description. No trick questions.", "Interview Questions": "Most questions gauged thematic knowledge and ability to defend strategic decisions"}, {"date": "9 Aug 2021", "title": "Communications Officer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 months. I interviewed at Open Society Foundations (New York, NY) in Jun 2019", "Interview Descriptions": "I am compelled to warn future applicants to not bother with this organization.   With great enthusiasm, I participated in six rounds of interviews (in addition to a writing test).  Following a sudden silence, I repeatedly tried to get some insight. After some hounding, the HR contact informed me they had extended an offer to the other finalist.   I took her feedback at face value, but just about a month later, the job was reposted. To this day, years later, the job remains unfilled.  Over my 20-year career and I've never have had such a disrespectful experience.  I see here on Glassdoor several nearly identical experiences.  I suggest that OSF/the Communications department read and heed their mission statement.  Certainly treating others with respect is one of their core values, is it not?   Also:  given that they are repeat offenders, I cannot help but think: are they really in good faith seeking a professional or are they mining for ideas on how to do their jobs?   Note: I've also interviewed with a number of corporations and was always treated with respect and dignity at all stages of the process.  This is an NGO that needs to walk the talk.", "Interview Questions": "Why do you want to work for OSF?"}, {"date": "16 Nov 2021", "title": "Project Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Open Society Foundations (Berlin) in Jun 2019", "Interview Descriptions": "The first step was a phone/skype interview by HR (no camera). The second step was an interview with members of the team and the supervisor, alltogether 3 people.  Notification was quite quick following the interview. No unexpected questions, if you look up the \"100 most popular job interview questions\" on the net, you should be fine.", "Interview Questions": "Describe a difficult work situation at your present position. "}, {"date": "16 Feb 2022", "title": "Program Specialist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 7 months. I interviewed at Open Society Foundations in Apr 2019", "Interview Descriptions": "I had to submit a cv and cover letter, followed by two rounds of interviews and a one-one chat when I was shortlisted. The whole process took nearly 7 months", "Interview Questions": "About my experience in the role"}, {"date": "18 Mar 2019", "title": "Program Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Open Society Foundations", "Interview Descriptions": "It took a couple of months before they contacted for an interview. Process is preliminary interview by the HR, followed by an in depth panel interview, and a written assessment.", "Interview Questions": "What was an example or instance of you working with a difficult team member and how did you  resolve it"}, {"date": "26 May 2019", "title": "Program Administrative Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Open Society Foundations in Mar 2019", "Interview Descriptions": "Bluejeans interview following a phone interview. The phone interview was a regular hr interview. The video conference was with two of the program officers, so I was asked several \r\n specific questions related to the position.", "Interview Questions": "Can you tell me about a time when you were expected to deal with sensitive information?\r\nCan you tell me about a time when you did not know how to do a task and you gained the necessary knowledge to do it?\r\nIf you were to organize a meeting, how would you do it? Can you tell me how you would do it step by step?\r\nCan you tell about a big mistake you have done in your life? How did you deal with it?"}, {"date": "22 Feb 2019", "title": "Legal Officer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 9 months. I interviewed at Open Society Foundations", "Interview Descriptions": "The process took more than 9 months, and it was a 3 part process (1. first screening interview, 2. writing assignment and 3. final interview). The interviews went smoothly, the interviewers were kind and polite making it more as a conversation.", "Interview Questions": "2 types of questions: 1. general questions such as: how did you learn of the position?, why you want to work in this organization?, why are you interested in this position?  2. specific questions: how does your experience match the qualifications we are looking for? how would you handle a situation (describing a problem that might happened at the job)?\r\n"}, {"date": "4 Jun 2019", "title": "Program Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 months. I interviewed at Open Society Foundations in Feb 2019", "Interview Descriptions": "I have had 2 interviews. First was with an HR, followed by a panel interview with 3 potential coworkers. \r\nThe first interview was appointed 6-7 weeks after I sent the application.\r\nBoth interviews were nice. All the people are great, friendly, they provided all the explanations about the role during the interviews.\r\nI was offered to make an analytical test assignment and given 24 hours. \r\nAfter sending the completed test assignment back, it took about 2 months to get a refusal, despite I was sending follow-up emails from time to time.\r\n\r\nAfter the refusal, I asked for feedback from all 4 people I communicated with. No feedback is provided a month after the refusal (and counting). I still would be happy to know what could be improved upon to be more competitive candifdate next time", "Interview Questions": "Why OSF?\r\nWhy me for OSF?\r\nWhat my qualities are good for OSF and the work?\r\nHow the Foundations' work aligns with my own aspirations.\r\nMany behavioral questions"}], [{"date": "23 Jan 2019", "title": "Legal Research Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Open Society Foundations", "Interview Descriptions": "Online skype interview; very friendly interviewer, not a particularly challenging interview. Seemed like they highly valued finding the right personality \"fit\" for the position, and also gauging your interest/background for human rights work.", "Interview Questions": "Why do you want to work in the field of human rights advocacy?"}, {"date": "1 Dec 2018", "title": "Advocacy Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Open Society Foundations (Barcelona)", "Interview Descriptions": "1 - CV and Cover Letter.\r\n2 - Invited to 30 min chat with 3 members of the team. \r\n3 - Written 2 part exam to be completed in 2/3 hours.\r\n4 - Final 1hr interview with 3 members of team.", "Interview Questions": "1. How would you run an advocacy campaign?\r\n2. How would a manager describe you in 3 words?\r\n3. Give an example of a time that you faced conflict within a team - how did you resolve it?"}, {"date": "26 May 2022", "title": "Grants Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Open Society Foundations (Barcelona) in Nov 2018", "Interview Descriptions": "Not dificult, passed 3 rounds, including a written text. however they haven’t followed up with communication of the selection process results. Ghosting, and ignoring all requests for an update over emails. In general, displayed quite arrogant approach towards intervieews.", "Interview Questions": "What are the essentials of grant making process? "}, {"date": "19 Sept 2018", "title": "Administrative Program Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Open Society Foundations (New York, NY) in Aug 2018", "Interview Descriptions": "Seamless! Very thorough, engaging and efficient interview experience. Recruitment team was very responsive. Submitted app online, heard back from recruiter the following week for phone screening for same week. Next day had a video interview with two people from the program. Staff was very friendly and transparent about the work. Very genuine conversation that didn't feel rushed. Next step in process I had to complete writing assessment within 24 hrs. The following week was called in for in person panel interview. Thoughtful questions that were very experienced focused.", "Interview Questions": "Can you give an example of when an outcome of a project/task didn't go as planned, how did you deal with it? "}, {"date": "8 May 2018", "title": "Program Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Open Society Foundations", "Interview Descriptions": "The process was a good one, although lengthy due to the high amount of candidates, so it lasted for almost 3 months. There was a thorough process, starting with a written assignment which was very on point, and then 3 phone/video interviews which has an open, supporting atmosphere, and were based on good insights and behavioral patterns.", "Interview Questions": "One question I truly appreciated was giving my own vision on the program and on the subjects of human rights and education at large."}, {"date": "9 Jan 2018", "title": "Program Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2+ months. I interviewed at Open Society Foundations (New York, NY) in Dec 2017", "Interview Descriptions": "Phone Interview (30 minutes) lead to In-Person Interview (1 hour). The phone interview consisted of questions about my fit and qualifications for the position. The in-person interview consisted of questions by the panel on why they would want me, personally, to fill the role.", "Interview Questions": "The question that most stuck out to me was \"What is your favorite political movement or leader and why?\""}, {"date": "18 Dec 2017", "title": "Communications Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Open Society Foundations (New York, NY) in Dec 2017", "Interview Descriptions": "I applied through the website, heard back within a month, had a good phone-screening interview, an interview with two senior staff in the department, then did a written test and a final round interview with two more senior staff.  Everyone was very engaged and communicative, and the process felt very well-run. I didn't get the position but they were very interested in my candidacy and I felt more inclined, after the process, to apply for new positions with the organization as they come up.", "Interview Questions": "What's your experience of crisis communications?"}, {"date": "20 Dec 2017", "title": "Legal Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 7 weeks. I interviewed at Open Society Foundations in Dec 2017", "Interview Descriptions": "I applied online, and was contacted for an initial interview 1+ month later. The interview was 35m long, and I spoke with the supervisor and an HR rep. Overall, the questions were straightforward, but there were some minor things that I found a bit unprofessional: After we confirmed a time, they had me reschedule. Additionally, the HR rep gave me the wrong salary range in the interview and emailed me a few days later to tell me that the range was 10-20K lower than what we had originally discussed. I thought the interview went well, and was surprised I did not receive an offer.", "Interview Questions": "What is your experience providing legal support? "}, {"date": "10 Oct 2017", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Open Society Foundations (London, England)", "Interview Descriptions": "It was a standard interview process but rude interviewer - Tip - avoid an end of the day interviews if possible. They may be more interested in wanting to wrap up and go home.", "Interview Questions": "How do you ensure you meet your deadlines?"}, {"date": "6 Sept 2021", "title": "Senior Program Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Open Society Foundations (New York, NY) in Aug 2017", "Interview Descriptions": "The process was straight forward and I think appropriate. There was one brief interview with a recruiter. This was followed by two panel interviews. The final panel interview entailed a take home exercise.", "Interview Questions": "For my final interview, I was given a take home exercise to then present to a panel. It was a lot of work, but I enjoyed the process and found it useful."}], [{"date": "17 Jul 2017", "title": "Program Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Open Society Foundations", "Interview Descriptions": "Submitted resume through website, and received confirmation of first round interview -- almost 3 months after the fact -- over e-mail.  The group interview took place via video, and focused on previous experience and subject matter expertise.", "Interview Questions": "How does your experience relate to OSF"}, {"date": "16 May 2017", "title": "Program Officer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Open Society Foundations (New York, NY)", "Interview Descriptions": "Had a total of six interviews beggining with recruitment staff and ending with Program Director. Went through many panels and had to submit written samples of my work. The process was long (three months) and frankly very disorganized; with very little communication between the different interviews.", "Interview Questions": "How do you believe change happens? "}, {"date": "9 Jun 2017", "title": "Communication Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Open Society Foundations in Apr 2017", "Interview Descriptions": "Applied for the position online. Was contacted by email one month after I submitted my application asking for an initial phone interview with a recruitment associate. I was then contacted again for another video interview with a committee, followed by a written test a few weeks later. Very pleasant staff and overall experience but quite a lengthy process.", "Interview Questions": "Give an example of a communication strategy you have worked on."}, {"date": "4 Apr 2017", "title": "Program Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Open Society Foundations (New York, NY) in Mar 2017", "Interview Descriptions": "The interview process was efficient and transparent. HR moved quickly and was very responsive over email.  After an initial interview via video with two members of the team, I had a panel interview, followed by a mock site visit with writing assignment, and then a final interview with the program director.  Everyone was genuinely friendly and open about the benefits and challenges of working at OSF.", "Interview Questions": "What were the push and pull factors that led you to apply for this position? "}, {"date": "23 Feb 2017", "title": "Policy Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2+ months. I interviewed at Open Society Foundations (Washington, DC)", "Interview Descriptions": "A relatively protracted recruitment process--about a month after submitting an application online, I was invited to complete a quick initial screening interview conducted by a recruitment associate based in the NYC office. After this, I was invited to sit for an in-person interview which involved four panelists from the Washington office. About a week after this interview, I was asked to complete a 1-hour assessment which I was able to do at home. Then, I was asked to return for a second in-person interview, which involved the same panel. Then I was asked to supply references. In total, the entire process took over ten weeks.", "Interview Questions": "If you had five minutes with the President, what issue would you raise and why?"}, {"date": "23 Feb 2017", "title": "Policy Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Open Society Foundations (Washington, DC)", "Interview Descriptions": "Applied online, had a brief phone interview about a month after that.  In person interview one month after that with three people, lasted about an hour.  Completed timed writing exercise from home after that, and then went back for a final interview with two people, lasted about 30 minutes.  Was then asked to submit three professional references, which were checked quickly.", "Interview Questions": "How do you manage your time?"}, {"date": "23 Mar 2017", "title": "Program Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Open Society Foundations (New York, NY) in Feb 2017", "Interview Descriptions": "The whole process, from sending the application to getting the final decision, took around 3 months.  The first stage was to have an interview with one hiring manager, second stage is an interview with two hiring managers and another team member. In the mean time, I was also interviewed by the HR officer for the Latin American Department. The third stage is to get a written assignment.  In overall, the process ran very smoothly and the HR officer that was responsible of this process was excellent.", "Interview Questions": "N/A"}, {"date": "3 May 2017", "title": "Program Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Open Society Foundations in Nov 2016", "Interview Descriptions": "The interview process was very time consuming and badly managed. It consisted of a telephone interview, a writing assignment and two interviews with the program staff. The interviewers were very polite, but not attentive. They spoke loads and constantly repeated themselves, so by the time they finally asked their questions I was really bored! My main complaint relates to how they treated me in the end, having gone through to the last stage of the interview process.  I was really holding my breath after they told me I was shortlisted with only one other candidate, but after a month or so of not hearing from them I decided to chase the HR. In response,  I received an unsympathetic email stating that the other candidate was chosen instead. It was unkind and offensive, considering the effort and time (at least 3 weekends of my life) I invested in this process. Although I still think OSF is a great organisation, I felt very disappointed and pushed around by the staff.", "Interview Questions": "Is corruption linked to human rights?"}, {"date": "1 Nov 2016", "title": "Communications Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Open Society Foundations (New York, NY) in Oct 2016", "Interview Descriptions": "Very Professional. I went through a first round screening with HR but unfortunately didn't make it past that. When I received the e-mail saying I didn't make it to the next round, I asked for feedback and received a prompt response with helpful feedback. Sad that I didn't get the job but I definitely respect an organization with solid recruiting practices.", "Interview Questions": "What challenges do you think you'll face in this position?"}, {"date": "23 Sept 2016", "title": "Strategy Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 8 weeks. I interviewed at Open Society Foundations (New York, NY) in Sept 2016", "Interview Descriptions": "First I was invited to a 30 minute phone screening with a HR representative with generic questions about why I wanted the job, how I was qualified, etc. I was then invited to a four person panel interview via video conference, or in person if I was in NYC. The four panelists are staff members from the Strategy Unit, and they asked several competency based questions specific to the job description. I was informed that there would be another round of interviews and a written assignment, and potentially a final interview. However, I did not make it past the panel interview and was informed via a generic HR email that I would not move forward.", "Interview Questions": "Give an example when you have explained a complex problem to someone.\r\nGive an example of coordinating among disparate offices or programs. \r\nHow do you manage your time? \r\nWhat excites you about this position, and what gives you pause?"}], [{"date": "28 Oct 2016", "title": "Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Open Society Foundations in Sept 2016", "Interview Descriptions": "took about month after apply for a job. First round phone interview follow up next day in person interview. Not difficult questions. Every since then no answer, even after couple emails. They publish job again so doesn't feel great not to get any answers. No answer is no answer, I think they should definitely improve they communication skills and generally all recruitment process.", "Interview Questions": "Q Just general question about admin stuff"}, {"date": "31 Oct 2016", "title": "Program Administrative Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Open Society Foundations (New York, NY) in Aug 2016", "Interview Descriptions": "I was contacted for an interview about a month after I applied. I had a great phone screening that lasted 30 minutes. I was told I would be moving forward in the process and that I would hear from them in about a week  to schedule a follow up interview. The next interview was a panel-type Skype interview with two members from the department. One of the interviewers was awful. Very aggressive and rude. He pointed out a typo on my cover letter which was totally fair, however then he proceeded to inquire about mistakes that I have made in the past. Each time I attempted to answer this, he suggested that my examples were not what he was looking for (it sounded like he was looking for me to tell him about a time I completely failed without any sort of redemption). I tried to explain how some of my mistakes have led to improvements in how I manage my time, my workload, my attention to details, etc. But he was not interested in hearing this. He also pointed out that my cover letter addressed my communication skills and he asked how comfortable I would be in NOT using my communication skills in this position. I explained that I was comfortable working independently, however I believe my communication skills would benefit my working relationships internally, etc. And he basically started picking up his phone and ignoring me. \r\n\r\nAfter feeling like I bombed the most difficult interview of my life, I luckily made it to the next round of interviews. I had a written assignment to complete first but was then scheduled for an in-person interview with the director of the program. She was lovely. Super fun and nice and really lively. I thought we really clicked well, but I didn't end up getting the job offer. I was pretty disappointed but it is probably for the best since the other interviewer didn't seem to like me and I think it would have been difficult to work with him anyway.", "Interview Questions": "Why are communication skills important?\r\nWhat is an example of good communication?\r\nWhat is an example of bad communication?\r\nWould I be comfortable not using my communication skills in this role?\r\nCan you tell me a time when you've made a mistake?"}, {"date": "26 Oct 2016", "title": "Program Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Open Society Foundations (Brussels) in Aug 2016", "Interview Descriptions": "I've applied for two positions at OSF - one in the summer 2015 and one in the summer 2016. Both times the way the application process was organised was terrible. The first time I did not get an email confirmation after I submitted my application so I emailed an HR person to check if they've received my application ok. No response. I understand that everyone is busy but isn't it part of the responsibility of an HR person to reply to enquiries like these? I never got a rejection or acknowledgement I ever applied to the position.\r\nThe next time I applied I received a confirmation of my application but no information thereafter. No rejection even months later. At this point I am not going to bother ever applying again.", "Interview Questions": "Never got to the interview stage and won't apply again."}, {"date": "21 Jul 2016", "title": "Policy Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Open Society Foundations (Brussels)", "Interview Descriptions": "1 hour panel interview, very friendly, no trick questions. HR rep, office manager, director & senior analyst all asked related questions.\r\n\r\nThen written test to show knowledge on area plus writing skills.\r\n\r\n2nd interview more in depth on content.", "Interview Questions": "Whats the first thing you'd do if you started the job"}, {"date": "24 May 2016", "title": "Legal Research Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Open Society Foundations", "Interview Descriptions": "It was fairly informal. They are looking for cooperative and engaged individuals. I was sent an email requesting me to select a time for the interview and whether it would be in person or online. I was then sent further details. The process was fairly informal and low key. I was interviewed by a single individual and it felt more like a conversation about who I am and what motivates me, rather than a test of intelligence or a competition.", "Interview Questions": "Mainly about personal interests and motivations"}, {"date": "21 Feb 2017", "title": "Program Officer Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Open Society Foundations in May 2016", "Interview Descriptions": "Very organized, friendly, prompt and efficient. Quick contact after application submission. very pleasant interaction at each stage of the interview process, both with the domestic and the international research teams.", "Interview Questions": "Previous experience related to position."}, {"date": "17 Jun 2019", "title": "Program Specialist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Open Society Foundations in May 2016", "Interview Descriptions": "The hiring process was really smooth. HR was very responsive and timely. I had a phone screening with HR, then a group interview, and then another one on one with the manager. This all happened over the course of a month.", "Interview Questions": "Can you list some organizations that you think would align with the themes of our portfolio?"}, {"date": "13 Jul 2016", "title": "Program Administrative Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Open Society Foundations (New York, NY) in Mar 2016", "Interview Descriptions": "There were numerous stages and it took almost 3 months:\r\n1. Phone Interview\r\n2. In person interview with half of program staff\r\n3. Writing and Data Reporting Exercise\r\n4. In person interview with senior staff of program\r\n5. Background check, reference check\r\n6. Offer made\r\n\r\nAll in all, it was more than I am used to, but was also well organized and allowed me to get a really good idea of what each staff member was expecting and the general feel of both our department and the program.", "Interview Questions": "They asked very general questions, not too specific. Important to them that your personal beliefs and ideologies match with the organizations."}, {"date": "16 May 2017", "title": "Program Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Open Society Foundations (New York, NY) in Jan 2016", "Interview Descriptions": "Online screening process, then a phone interview where they made a first selection with a panel comprised of people from within and outside the department. After the panel, a written exam was requested with two broad questions and a 8 hour timeframe. After the exam, one final interview in headquarters in order to decide on who to offer the position", "Interview Questions": "Main skills, Management questions, Important decisions/mistakes made during pivotal moments in previous jobs, etc"}, {"date": "15 Jun 2015", "title": "Justice Initiative Fellowship Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Open Society Foundations", "Interview Descriptions": "Got an invitation to interview 3 months after sending my application. Online 30 minute videoconference. There were 2 people in the panel (1 HR and 1 director). They were nice, polite and very interested.\r\nI was able to ask questions concerning the job and the future steps of the selection process.", "Interview Questions": "What competencies/skills do you have that are interesting for us?\r\nIf you could file a claim before an international court, what case and which court would you choose?\r\nPractical case question: how would I manage a specific situation in human rights.\r\nWhat subject really motivates you?"}], [{"date": "21 Jun 2015", "title": "Communications Officer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Open Society Foundations (New York, NY) in May 2015", "Interview Descriptions": "I was very disappointed with how OSF handled my interview process. In total I went through 6 rounds (2 Skype interviews, 2 face-to-face panel interviews, and 2 written tests) at the end of which after repeatedly reaching out for updates, I was informed that they were not in a position to hire for this post at the moment. A week later they re-advertised the position. I reached out again for clarification on their actions, but received no response. Overall I think they exhibited very poor communication, and a blatant lack of respect for my personal time. In addition, the fact that they spent so much time and effort with these interviews, only to later decide they weren't interested in me as a candidate with no real feedback or explanation suggests a lack of efficiency and unprofessionalism on their part. Not a pleasant experience.", "Interview Questions": "Why do you want to work for this organization?\r\nWhat qualities would you bring to this position?"}, {"date": "13 Jun 2015", "title": "Program Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Open Society Foundations (Washington, DC) in Apr 2015", "Interview Descriptions": "I was recommended internally and interviewed informally for the position before I applied. The hiring staff was friendly and emphasized the administrative side of the work. They did say it was a great organization to work for in terms of access. I felt that the office space was friendly and inviting and seemed like a great place to work. Most staff stay on for many years.", "Interview Questions": "What experiences or skills do you bring?"}, {"date": "25 Jan 2015", "title": "Entry Level Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Open Society Foundations", "Interview Descriptions": "There were 2 telephone interviews, since I was living abroad at the time. They asked basic interview questions. Both interviews went well. However, even with a master's degree and 3 years of living and working abroad, they still said I didn't have enough experience. I think they meant that I didn't have enough experience working with a NGO, which is funny because it was an entry level position.", "Interview Questions": "Why did I want that job considering my degrees and background."}, {"date": "10 Nov 2014", "title": "Program Officer Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied through other source. I interviewed at Open Society Foundations", "Interview Descriptions": "It was a rather rigorous interview process with 2 rounds of interviews with two different panels. I was required to submit a writing sample and to complete a docket writing assignment in a 48-hour window.", "Interview Questions": "Working in diverse contexts, managing relationships, ability to work in a team, leadership skills. "}, {"date": "8 Nov 2016", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Open Society Foundations (New York, NY) in Oct 2014", "Interview Descriptions": "Received an email approx a month after applying. Had a brief phone interview with 2 people, then came in probably a week later for an in person interview with 3 people. The interview was pretty friendly and focused on my previous experiences and why I was interested, what I wanted to get out of it. Generally there was no curveball questions- asked me what some problems in the program were, etc. FYI, in order to intern you have to prove you will get credit for it. Maybe a couple days after the interview they offered me the internship.", "Interview Questions": "What previous experience do you have that made you interested in this program area?"}, {"date": "1 Aug 2014", "title": "Program Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Open Society Foundations (New York, NY) in Jul 2014", "Interview Descriptions": "This interview process was unlike any other I have been through before. 4+ weeks after submitting my application online (I found the posting via their website), someone from HR finally got back to me. I went through 3 interviews for the position of Program Assistant, and when I was waiting to hear back, an HR recruiter called me and asked me to interview for a Program Associate position which I had not applied for, explaining to me that they often did this: looked at their wider pool of candidates and tried to see which skills could be transferable. \r\n\r\nI went through two rounds of interviews for their Program Associate position, each with 3 people present during the interview. I also had to send them a first draft (unfinished) writing sample, and complete a writing assignment before I was offered the position. They also got in contact with all 3 references that I provided.", "Interview Questions": "Apart from the usual questions about experience, I found that in all my OSF, they asked alot of behavioural and professional development questions so be prepared for that. \r\n\r\nExamples:\r\n- What role do you play in a group? \r\n- Give an example of a time you worked with a difficult colleague\r\n- What do you hope to learn from this position and your colleagues?\r\n- What motivates you?\r\n- What areas do you hope to develop professionally in the future?\r\n- Can you speak about a time when you had to challenge authority?\r\n- What managerial style do you work best under?\r\n- What are some things that you continue to struggle with?\r\n- How would your current supervisor describe you, strengths and weaknesses?"}, {"date": "16 Jul 2014", "title": "Program Assistant for Information Program Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Open Society Foundations (New York, NY)", "Interview Descriptions": "I submitted my application online on the same day the job was posted, and exactly 1 month later, a someone from HR contacted me by email to schedule an interview for the day after tomorrow. I met with a Program Manager and Program Assistant who made it clear that these were first round interviews and there would be one more round to follow. I am still waiting to hear back about the second round.", "Interview Questions": "This interview was fairly different to any others I have done previously - instead of asking standard questions such as, \"tell me about yourself,\" it started with \"what specific programs in the organization are you interested in a part from this one,\" and \"what made you apply for this job.\" It was also not as structured as I'm used to. As the conversation progressed, I was asked if there was anything on my resume I would like it highlight or speak about -- instead of them asking me specific questions."}, {"date": "6 Jan 2016", "title": "Program Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Open Society Foundations (New York, NY) in Jul 2014", "Interview Descriptions": "Some standard background questions, more specific questions about processes.  They asked how my skills would relate to the offered role.  Some of what they were asking assumed an existing knowledge about the way things worked, which made things a bit difficult.", "Interview Questions": "How has your education prepared you for the role?  What are your ideas for changing how we do things?"}, {"date": "23 May 2014", "title": "Program Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Open Society Foundations", "Interview Descriptions": "Online application process was streamlined and efficient.  Received email for phone interview, which was postponed several times, but always with sufficient notice.  Phone interview was conducted by prospective direct supervisor, who was courteous and professional, but clearly had not reviewed my resumé.  Was informed I would be notified if I was to be considered for the next interview (in person or via Skype).  Position was filled (as visible from web posting) without further contact from OSF.", "Interview Questions": "\"What do you understand to be the nature of this job, based on the job posting?\""}, {"date": "13 May 2014", "title": "Program Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Open Society Foundations", "Interview Descriptions": "I was contacted via phone and invited to interview the following week. The first interview consisted of two rounds. I interviewed with someone from HR afterwards with two heads from the specific program. Everyone was very friendly and I came away with a good feeling. A little while later I was contacted for a second interview. Before going to the interview I was asked to complete a short test which consisted of some translation work and administrative planning. The second round was considerably shorter and I met with a program assistant and the head of another related program. The entire process took about a month.", "Interview Questions": "Tell us about a time you made a mistake and how you handled it. "}], [{"date": "8 Apr 2015", "title": "Entry Level Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Open Society Foundations (London, England) in May 2014", "Interview Descriptions": "Phone call interview initially with HR department, describing the role and why I was interested in the role/organisation.\r\n\r\nImmediately booked in for a face-to-face interview.\r\nThis was a panel interview.\r\nStandard introductory questions followed by in-depth questions on skills asked and asked how I would react within a typical scenario.\r\n\r\nSome tricky questioning, but it revealed a lot about the culture - LONG HOURS!\r\nNo call back or feedback whatsoever - I'm glad in a way.", "Interview Questions": "How do you manage your workload?"}, {"date": "5 May 2014", "title": "Program Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Open Society Foundations (New York, NY)", "Interview Descriptions": "First-round interview in person with a human resources representative and the Program Director for the program I was interviewing for.  Total interview time took about 1 hour.  \r\n\r\nI was really impressed with how open both interviewers were with the interview/hiring process and where I was within it.  They told me how many applications, how many people were invited to the first-round interview, and how many people would be invited to the final-round interview, and what that interview would entail.  \r\n\r\nI got a telephone call a few weeks after I sent in my application asking if I was available to come in the next day for an interview.  Luckily I was available.  After the interview, I was told they should have an update for me within the next week/week and a half...but I didn't hear an update for several weeks.  Ultimately did not get the position.\r\n\r\nThe interview questions were very straightforward--interest in the company and position, related experience and skills.  Nothing out of the ordinary or unexpected.\r\n\r\nOverall, one of the better interview experiences I have had.", "Interview Questions": "Interviewer asked if I was able to type on a foreign keyboard (in this case, Russian).  The job listing included Russian as a required language skill, but I wasn't expecting to have to break down my familiarity with the language so far."}, {"date": "23 Oct 2018", "title": "Research Consultant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Open Society Foundations (Brussels) in Apr 2014", "Interview Descriptions": "The interview was with two managers from OSF Brussels, and mainly related to my experience and its relevance to the job description.  I spoke extensively about the research I had done in each of the fields, and about cooperation networks I was part of.", "Interview Questions": "Tell me one research finding that most surprised you."}, {"date": "25 Feb 2014", "title": "Program Officer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 5 months. I interviewed at Open Society Foundations (New York, NY)", "Interview Descriptions": "Standard hiring procedure: telephone interview, personal interview, both with hiring manager. Dress code business casual. Interview very in-depth, hiring manager was known reputed to hire only the very best specialists in the field. Short introduction to additional team members. Overall not a remarkable interview experience and hiring decision seemed to be driven mostly by \"gut feeling\" of hiring manager.", "Interview Questions": "Overall interview on a very high level of knowledge. Be prepared with lots of background knowledge and show off networks that you have."}, {"date": "15 Aug 2014", "title": "Program Assistant Interview", "results": "No Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Open Society Foundations (New York, NY) in Feb 2014", "Interview Descriptions": "After submitting my resume and cover letter to the e-mail indicated on the OSF website, I was contacted via phone by Human Resources to schedule an interview. I called back with my schedule, and my interview was scheduled for the next week.\r\nI arrived and waited for my first interviewee. The interview was two parts, each about 40 minutes- 1 hour long. One is a behavioral interview, asking questions about interactions with former employers, best and worst situations, situations you are proud of, etc. The other is one more related to the company itself and your qualifications and asking if you know the requirements of the job itself. The person conducting the behavioral interview takes diligent notes and is open to questions for clarification.", "Interview Questions": "Identify a conflict situation with an employer and what you did to handle it."}, {"date": "12 Apr 2016", "title": "Program Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Open Society Foundations (New York, NY) in Feb 2014", "Interview Descriptions": "It was a bumpy road as I was asked some tricky questions. I was asked assessment and situational questions immediately without any ice breaker and it seemed like the officer who was interviewing me was kind of hostile towards me. I almost thought they are making me uncomfortable so as to see how would I react in this type of situations, but at the same time I thought it was not what I was hoping to do -  to work in such high stress level enviroment.", "Interview Questions": "How do you deal with difficult people?"}, {"date": "16 Nov 2015", "title": "Program Associate Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 8 months. I interviewed at Open Society Foundations in Apr 2012", "Interview Descriptions": "There were random questions at times and it was a long interview but very detailed and interesting. The panel consisted of programmatic staff as well as an HR representative. I was given a written task before the second interview. I found the second interview very intense but also more friendly and less formal. HR took their time in responding afterwards (at least a month).", "Interview Questions": "Why this job? Match between the job ad and your experience? Ability to travel?"}, {"date": "9 Oct 2011", "title": "Program Officer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Open Society Foundations in Jun 2010", "Interview Descriptions": "Received very positive feedback during the interview process. Enjoyed the questions asked - they were thoughtful and appropriate to the position. Was invited to a second interview; again received very positive feedback. After the second interview didn't hear back for about a week. Finally, they said they re-opened the search. There were no reasons given for the rejection or the re-opening of the search.", "Interview Questions": "Tell me about a difficult professional situation and how you dealt with it."}, {"date": "6 Jan 2011", "title": "Program Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through other source. The process took 2 weeks. I interviewed at Open Society Foundations (New York, NY) in Jun 2010", "Interview Descriptions": "I was contact by phone for an interview and told it would take about 2 hours.  I went in for the interview and first met with someone in HR and then met with 3 program heads and then 2 people working at a lower level.   Everyone was very nice, but it was a pretty intense interview considering how many people I met with and how much time it took.", "Interview Questions": "If you were putting together a report on the oil spill in the gulf, how would you proceed?  What would you start with?"}]]