[[{"date": "25 May 2023", "title": "Membership Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Loma Linda University (Loma Linda, CA)", "Interview Descriptions": "3 interviews total and everyone was nice (2 interviews were on the same day). took months to hear from them about the first interview. Received a job offer about a week after the last 2 interviews", "Interview Questions": "If you were on an island and can only have one item what would it be and why?"}, {"date": "29 Mar 2023", "title": "Graduate Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Loma Linda University", "Interview Descriptions": "Met with various professors of diverse backgrounds and fields. Each interview was anywhere from five to twenty minutes. Some of the interviews were in person in their respective offices and some of the interviews were over the phone.", "Interview Questions": "What are your strengths and weaknesses"}, {"date": "26 Oct 2022", "title": "Pediatric Registered Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Loma Linda University", "Interview Descriptions": "Very thorough, interviewers were kind and I felt comfortable throughout the interview. I was being rotated through 4 interviewers along with 3 other candidates. We also had to do an activity where we introduce a fellow candidate to the interviewers and why they should hire our partner.", "Interview Questions": "Why did I choose Loma Linda? What can I bring to the unit?"}, {"date": "31 Oct 2022", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Loma Linda University (Loma Linda, CA) in Oct 2022", "Interview Descriptions": "It was a very relaxed and good interview. The Interviewer made me feel comfortable. basic questions were asked regarding education and skills. Also about my research interests and experience with using SPSS statistics software.", "Interview Questions": "Do you know how to use statistics software?"}, {"date": "10 Jan 2023", "title": "Grants Officer Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Loma Linda University (Glendale, CA) in Jul 2022", "Interview Descriptions": "I applied for the position online. I was contacted by the hiring manager through the e-mail shortly after my application was received. The hiring manager suggested a date for the interview, but knowing that I live one hour away from the office, to my convenience the interview location was changed. Highly appreciated. The face to face interview went very well. The questions were very work related. Follow up was done though e-mails again. Overall, that was a great experience of an interview.", "Interview Questions": "How many grants I have written in my previous job."}, {"date": "16 Jun 2022", "title": "Physician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Loma Linda University", "Interview Descriptions": "Professional and smooth. I flew in for an in person interview. Met with staff and leadership for 30 min interviews. Took awhile to get a response from them but good communication from faculty medical group", "Interview Questions": "What are you looking for"}, {"date": "8 Mar 2022", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Loma Linda University", "Interview Descriptions": "It was easy. just be yourself and you're set. make sure you prepare in advanced, try to write out possible interview questions in order to fully prepare yourself! I would also make sure to do a mock interview with a sibling or parents or friend in order to really grasp the full interview effect.", "Interview Questions": "What were your strengths and weaknesses"}, {"date": "4 Mar 2022", "title": "RN New Grad Residency Program Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Loma Linda University", "Interview Descriptions": "The interview was done through zoom, it was quick and straight to the point. There were not many questions asked.  Opened the interview with, \"tell me about yourself.\" I got a call to schedule an interview a few days before.", "Interview Questions": "Why did you choose this unit to apply to? "}, {"date": "24 Sept 2022", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Loma Linda University (Loma Linda, CA) in Nov 2020", "Interview Descriptions": "First you have to choose a time for your interview,, typical behavioral questions, what is your experience. Why do you want to work at loma linda. Interview in a large room with many others. ", "Interview Questions": "Why do you want to work at loma linda\nDoes your values align with our, how so\n"}, {"date": "12 Nov 2020", "title": "Marketing Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Loma Linda University in Oct 2020", "Interview Descriptions": "I applied online and was contacted two days after for an interview with the hiring manager, who was the Director of the department. The interview was fine but I could tell that she was easily irritated or dismissive if I answered a question in a way she didn't like. After the interview, I never heard from her again. I was only aware that I did not move on to the next step when I received an automated email over a month later. I know this is typical of big companies to do, but I expected some kind of personal follow up or communication after the interview. To me, that would have reflected the mission and values of the university with which they strongly identify.", "Interview Questions": "Have you had experience with digital marketing on social media platforms, placing banner ads, developing content, writing, and website experience?"}], [{"date": "1 Mar 2022", "title": "Patient Care Assistant (PCA) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Loma Linda University (Loma Linda, CA) in Sept 2018", "Interview Descriptions": "Fairly easy. Panel interview with 6 staff, all a mix such as educator manager charge nurse staff nurse director etc. a few questions about interests, tell me about yourself, core values of the hospital and how you align with them. And then clinical based scenario questions and how you would handle it.", "Interview Questions": "A patient has a blood pressure that is out of range, walk me through the steps on what you would do.\r\n\r\nAs a follow up, After notifying the nurse what would you do?"}, {"date": "3 Oct 2022", "title": "Admissions Records Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Loma Linda University (Loma Linda, CA) in Sept 2018", "Interview Descriptions": "I applied for the position and was scheduled for a clerical test shortly after.  The clerical test consisted of Microsoft Word, Excel, typing, and proofreading.  I was called in for an interview about 3 weeks later.\n\nThe interview was with the Assistant Dean, Assistant Director, and someone from HR. It took about 35-40 minutes.  I felt that they asked more questions that had to do with my personality (how do I handle stress, do I prefer working with men or women, etc.) than my work experience.  There weren’t any difficult questions.  If I hadn’t asked questions myself, it probably would have lasted 20 minutes.\n\nAfter I was hired, I was told that I was chosen because they felt that my personality would fit in well with the rest of the team.", "Interview Questions": "How do you handle stress?\n\nWhat’s your favorite thing about yourself?\n\nDo you prefer working with men or women?"}, {"date": "21 Nov 2017", "title": "Technician Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Loma Linda University (Loma Linda, CA)", "Interview Descriptions": "Hiring supervisor came 40 minutes late to interview. She was very unprofessional, and rude. This was a major red flag. I would not recommend Loma Linda University Health to anyone.", "Interview Questions": "Do you have good attendance? I'm going to call your former bosses.\r\n\r\nWhat experience do you have with patient care?\r\n"}, {"date": "21 Nov 2017", "title": "Records Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Loma Linda University (Loma Linda, CA) in Sept 2017", "Interview Descriptions": "I applied online and was notified that my application was forwarded to the hiring manager 2 days later.  I was asked to come in to take a clerical test which included MS Excel, Word, typing and proofreading.  About 3 weeks after the test, I was called and asked to come in for an interview.  The interview was with 3 people- the 2 head people from my department that I would be reporting to, and one person from HR.  The interview lasted about 45 minutes, with the last 8-10 minutes consisting of me asking them questions.\r\n\r\nAfter verbal confirmation that I got the job, the pre-employment process took another 3 weeks.  This included online paperwork for HR, a background check (criminal, past employment and education), a physical (including TB & drug test), and a final meeting with HR where they go over employment benefits and give you your badge.", "Interview Questions": "1.  What type of environment do you prefer?\r\n2.  How would your boss describe you?\r\n3.  Brag about yourself- what are your best qualities?\r\n4.  Have you ever gotten into a conflict with a co-worker?\r\n5.  Do you prefer to work individually or in a group?\r\n6.  Have you ever had to handle confidential information?"}, {"date": "23 Jul 2017", "title": "Withheld Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Loma Linda University in May 2017", "Interview Descriptions": "About a week after applying online, I received an email about an interview and options for dates.  My interview was 2 hrs and 40 minutes with a total of 6 people.  They were all very nice, but seemed scripted in everything they said.  All questions were behavioral. They checked my references but did not make me an offer.", "Interview Questions": "Describe a time when you were angry?  How would your coworkers describe you?  Tell of a time you had to be flexible.  Where do you see yourself in 5 years.... 10 years? Goals for yourself? "}, {"date": "25 Feb 2017", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Loma Linda University (Loma Linda, CA) in Feb 2017", "Interview Descriptions": "3 part interview; Nurse Manager, Staff RN and Nursing Director (all were from the floor/dept in which you applied and interviewing for).  Length was approximately 2 hours. Interviewers were welcoming and friendly.  Most questions focused on situational factors that give them a sense of your personality and work ethic.  Offered position same day without much negotiation due to the position being a \"new grad RN\".", "Interview Questions": "Situational questions such as, \"tell a time when you had to make a difficult decision...how did you come to that decision and what was the outcome?\""}, {"date": "30 Dec 2016", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at Loma Linda University (New York, NY)", "Interview Descriptions": "We discussed the position, my qualifications, expectations and where my passions lie with a recruiter then was told I'd be contacted by the department directly. I was contacted by the department and that interview was smoother and more comfortable. HR employees are RUDE.", "Interview Questions": "I was asked if I knew the LLU system. "}, {"date": "23 Feb 2018", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Loma Linda University (Loma Linda, CA) in Apr 2015", "Interview Descriptions": "i had an interview with the head of the PCOR program. He already knew me just asked about my previous experience as a teacher assistant and i would be able to do 20 hours/ week while still being a full time student. He shared the nature of the PCOR program and my role as a teacher assistant", "Interview Questions": "Previous TA experience "}, {"date": "23 Nov 2019", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Loma Linda University (Loma Linda, CA) in Jan 2015", "Interview Descriptions": "Screening (tele) from HR/Recruiting officer. Followed by a computer test *Word, Excel, Typing* Then interview with manager and applicable staff. After that, Drug Screen and varification of degrees (HR will call schools directly).", "Interview Questions": "How would you prioritize two separate (from two equal mangers?"}, {"date": "31 Dec 2014", "title": "Assistant Professor, Biochemistry Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 12 months. I interviewed at Loma Linda University", "Interview Descriptions": "For me this was a grand experience.  I was recruited.  The leadership and institution wished for me to come here and did a lot to make me feel at home and wanted and needed.", "Interview Questions": "Why would you leave your current institution to come here?"}], [{"date": "31 May 2014", "title": "Resident Assistant - Sub At Kate Lindsay Hall Women's Residence Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Loma Linda University", "Interview Descriptions": "Make sure to submit your resume on time and connect with the dean of women regarding your interest in working as a Resident Assistant. When interviewing for a Resident Assistant position at Kate Lindsay Hall Women's Residence, prepare yourself for a group interview. The group being the dean of women and select employees and you, the interviewee. You will be later notified if you were selected to be hired and whether you were chosen to be hired as an RA or RA-sub. The position of RA-sub is offered to you when all RA positions have been filled.", "Interview Questions": "What do you think makes up the responsibilities of an RA?"}, {"date": "27 Sept 2015", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 2 weeks. I interviewed at Loma Linda University (Loma Linda, CA) in Feb 2012", "Interview Descriptions": "I initially went in as a temporary worker assigned. I managed to catch on to the job quickly so they hired me on full-time before my assignment was even scheduled to end. Because of this the interview process for me may have been a little different than usual. It was more like a 2 month working interview.", "Interview Questions": "We will give you 5 minutes to write a draft letter to a client informing them of something pertaining to this job."}, {"date": "13 Jun 2013", "title": "Research Analyst Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Loma Linda University (Loma Linda, CA) in Jan 2010", "Interview Descriptions": "Most positions at LLU are offered initially internally and interviews are rare. I was interviewed by a professor after only submitting a resume by email. As far as I know, no ATS system like Taleo is used for these jobs and most of the time they aren't even posted online until someone internal already has the position. If you see an opporunity online that's been posted, it's likely outdated or taken. If you are called in for a interview, expect it to be somewhat informal.\r\n\r\nQuestions I was asked involved my employment history, experience in research and skill sets. Since I was a student already, most of my background was already known but whether or not I had the knowledge of the particular studies involved was another matter. If you are applying to the university side, questions will more likely be related to whether or not you know the LLU policies about their religion (SDA) and culture. If you are applying to the medical center, questions will more likely be related to clinical settings and whether or not you can handle working with physicians. You should know most physicians at LLU are spoiled rotten and egotistical twats but if you are used to that, they can be very professional otherwise.\r\n\r\nOther questions might include the standard \"tell me about yourself,\" and questions on computer skills. Since this is a research analyst position, you should be familiar with quantitative data analysis, data management and microsoft office. For some reason, they relish in Microsoft Office and Outlook like no one's business and most computers there are old.\r\n\r\nWhen you are hired, you will face a standard HR introduction meeting that generally informs you on LLU and it's rules and policies. It's 8 hours long though and you sit in a small dining room and that is very boring. After you actually begin working, you will likely be in a small office (read: closet) and in front of a computer or collecting data depending on their needs.", "Interview Questions": "It's a religious institution and so they ask you if you believe in God. They won't discriminate against you if you don't, but they are required to ask and take it pretty seriously."}]]