[[{"date": "21 Apr 2023", "title": "Support Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Autism Initiatives (Edinburgh, Scotland)", "Interview Descriptions": "This was a panel interview with two senior members of the staff. The interview took place online. After a greeting, the interviewers asked a number of questions (I believe around 5 questions).", "Interview Questions": "Q: What do you have to keep in mind if you had to support someone to shower themselves."}, {"date": "27 Sept 2022", "title": "Support Worker Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Autism Initiatives", "Interview Descriptions": "Very relaxed . Two managers going over questions together asking about your experience and how you would need support if you were to have some kind of needs. Needs a better line up of the day today tasks you'll be doing", "Interview Questions": "What support would you need?"}, {"date": "7 Sept 2022", "title": "Support Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Autism Initiatives (Edinburgh, Scotland) in Jun 2022", "Interview Descriptions": "Interview was accessible and easy. Provided with interview questions before interview which was great.  Given full explanation of job role/service at start of the interview then invited to answer each question in turn. Opportunity to ask questions at the end. No surprises during interview.", "Interview Questions": "Questions provided before interview approx 48 hours before "}, {"date": "23 Jul 2021", "title": "Support Worker Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Autism Initiatives", "Interview Descriptions": "OK, fill out application form and send it back then you will receive either email or phone call if your application is shortlisted the you will attend formal interview with the manager and senior manager you will be contacted at a later date if you are successful", "Interview Questions": "What do you know about autism"}, {"date": "30 May 2019", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 6 weeks. I interviewed at Autism Initiatives", "Interview Descriptions": "saw job advert online, completed an application form and was offered personal interview a week or so later. Recruitment process thorough but sometimes long winded as DBS and references essential", "Interview Questions": "scenario question"}, {"date": "1 Jun 2018", "title": "Support Worker Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through other source. The process took 2 weeks. I interviewed at Autism Initiatives (Belfast, Northern Ireland) in May 2018", "Interview Descriptions": "Applied and had interview date within 2 weeks. \r\n2 person panel. Good cop/bad cop roles. \r\nIntense interview,felt like one was trying to catch me out and the other was trying to help me.", "Interview Questions": "What do you think this job entails?"}, {"date": "8 Mar 2017", "title": "Support Worker Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 1 day. I interviewed at Autism Initiatives (Preston, North West England, England)", "Interview Descriptions": "Advised desperate for staff. I was basically advised I would be offered the job regardless of the Interview. Interview was just a tick box exercise. I was advised staffing levels were poor and asked if I could ask friends to apply. I was informed experience was not necessary and that the job was common sense, easy", "Interview Questions": "Have you got any friends that need a job"}, {"date": "13 Jun 2018", "title": "Support Worker Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Autism Initiatives (Belfast, Northern Ireland) in Apr 2016", "Interview Descriptions": "Friendly and relaxed. Typical questions asked along with basic maths knowledge test at the beginning and a basic procedures knowledge test. Panel of 3 interviewers but was very relaxed and friendly.", "Interview Questions": "Tell us about a time when you dealt with conflict in the workplace."}, {"date": "25 Mar 2020", "title": "Support Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Autism Initiatives in Feb 2016", "Interview Descriptions": "The whole process was very straight forward. You had to prepare in advance about the organisation, what is autism and what the role is and the interview was with 2 people.", "Interview Questions": "Explain how you managed a difficult situation with an angry/distressed customer (no prior experience in care work)"}, {"date": "29 Oct 2016", "title": "Support Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 7 weeks. I interviewed at Autism Initiatives (Blackpool, England) in Aug 2015", "Interview Descriptions": "First step is a Online application form which is easy to complete. I was then invited to an interview where I was made to feel very comfortable. I had to complete a short activity to test my knowledge of handling money. I found out if I had got the job on the same day and Autism Initiatives were fast in the process of getting into work.", "Interview Questions": "Do I understand that the job may include personal care of service users?"}]]