[[{"date": "9 Jun 2023", "title": "Program Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at National Democratic Institute (Budapest)", "Interview Descriptions": "It was great, it went very smooth in a very friendly and warm atmosphere. General questions, very nice people. I enjoyed speaking with them. No stress at all. Overall, it was a nice experience.", "Interview Questions": "why did you apply for the position?"}, {"date": "9 Feb 2023", "title": "Program Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at National Democratic Institute", "Interview Descriptions": "They were quick to follow up on my application and set up the first interview, but it took them a month to follow up after that interview (did not move forward).", "Interview Questions": "How did you hear about National Democratic Institute? What attracted you to the role?"}, {"date": "6 Jan 2023", "title": "Temporary Project Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at National Democratic Institute", "Interview Descriptions": "I Applied online to the National Democratic Institute and heard back about three weeks later. I had two rounds of interviews via Zoom before receiving an offer. Questions were pretty standard.", "Interview Questions": "What are your strengths and weaknesses"}, {"date": "14 Oct 2022", "title": "Program Associate Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at National Democratic Institute", "Interview Descriptions": "The interview process involves an HR screening, and then depending on the team you will most likely have 2-3 rounds interviews with the team. Some teams have a writing assessment or language assessment depending on their needs.", "Interview Questions": "What is your experience or knowledge of the US Congressional system?"}, {"date": "26 Aug 2022", "title": "Program Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at National Democratic Institute", "Interview Descriptions": "Very short. Didn't ask many questions. I had one HR screening. They stated I was qualified and they were very impressed, yet I was ghosted even after sending a follow-up email...", "Interview Questions": "Are there any skills/tasks in the position description you are not capable/confident in doing?"}, {"date": "23 Aug 2022", "title": "Program Officer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at National Democratic Institute (Washington, DC)", "Interview Descriptions": "Interview took 13 weeks in total. An initial interview, a timed written exam, an interview with managers, and an interview with the department director. Each time it took several weeks without hearing anything and I never heard back until I already assumed I did not get the job.", "Interview Questions": "What political experience do you have?"}, {"date": "30 Jul 2022", "title": "Regional Administrative Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at National Democratic Institute (Washington, DC) in Jul 2022", "Interview Descriptions": "Initial interview 1 on 1, \nwriting assessment: summarize 2-page document in 1-hour \nadmin assessment: reading flight schedule. matching names etc. \ninterview with colleagues: evaluates If you will fit in with the team", "Interview Questions": "The biggest issue to central and eastern Europe?\nWhen was a time you had to be innovative?\nHow do you deal with conflict?\n"}, {"date": "6 Jul 2022", "title": "Program Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at National Democratic Institute (Washington, DC) in Jun 2022", "Interview Descriptions": "- The interview process was not difficult. It started with an HR screening with followed by 2 interviews with a manager and the director. Response emails were slow throughout the process.\n- Interviewers seemed uninterested\n- The position is extremely low paying considering the responsibilities and experience expectations\n- I would've declined the position had I gotten the offer", "Interview Questions": "What 5 suggestions would you give to a small humanitarian organization combatting disinformation?"}, {"date": "21 Apr 2022", "title": "Project Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at National Democratic Institute", "Interview Descriptions": "There was an Initial interview with recruiter, then a writing assignment relevant to work you would complete as an assistant, then there's a second interview with staff members you'd work with if hired", "Interview Questions": "What do you think are the greatest challenges facing this region?"}, {"date": "23 Feb 2022", "title": "Program Officer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at National Democratic Institute", "Interview Descriptions": "This was a multi step interview process that included meeting with a number of staff as well as a written portion.\r\n\r\nOverall, the organization was easily accessible and responded quickly to emails.", "Interview Questions": "What is your international experience in the region?"}], [{"date": "23 Feb 2022", "title": "Program Officer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at National Democratic Institute", "Interview Descriptions": "This was a multi step interview process that included meeting with a number of staff as well as a written portion.\r\n\r\nOverall, the organization was easily accessible and responded quickly to emails.", "Interview Questions": "What is your international experience in the region?"}, {"date": "12 Dec 2022", "title": "Project Officer Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at National Democratic Institute (Kiev, Kyiv) in Sept 2021", "Interview Descriptions": "The interview was participated by 4 managers of different NDI Programs, each asking their pre-determined questions one by one. Questions covered traditional topics such as what I know about the organization, why I would like to work with them, etc., the recent political events, and what media I prefer to read.", "Interview Questions": "What I would do in case I organized an event for top politicians and the key speaker cancels his participation right before the event."}, {"date": "29 Sept 2021", "title": "Project Officer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at National Democratic Institute (Seoul) in Aug 2021", "Interview Descriptions": "1. Application screening\r\nOnce my application get passed, \r\n2. Zoom Interview with the entire team members (5 persons)\r\nThe entire Korea-team members (5 membered team) logged-in to Zoom and asked questions for an hour.\r\n\r\n3. and at the same time take writing exam for an hour, that assessed a basic knowledge of project management. \r\n\r\nOnce you left on the final list, \r\n4. Another Zoom Interview with the regional office manager", "Interview Questions": "1. introduce yourself\r\n2. Motivation\r\n3. test the basic subject-matter knowledge"}, {"date": "29 Sept 2021", "title": "Program Associate - LAC Team Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at National Democratic Institute in Aug 2021", "Interview Descriptions": "There were about 5 steps in this process. The first two were pre-screenings for your language evaluation and HR evaluation. Later on, an exam was given to you where you translated a paragraph from Spanish-English and then writing a summary based on an article. \nThe 4th step was the team panel interview, and may I let you know, they ask questions very fast-paced, so please maintain calm and answer well. The last step is an interview with the Deputy and Regional Directors of the team.", "Interview Questions": "Aside from the normal, typical interview questions, be prepared for specific topic-oriented issues that are present in the region. "}, {"date": "2 Jun 2021", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at National Democratic Institute", "Interview Descriptions": "30 minute interview in English. I was asked about the knowledge of my country's political system, how it worked and also the knowledge about the Parliamentary procedures. There were three interviewers.", "Interview Questions": "Who proposes a draft law?\n"}, {"date": "26 May 2021", "title": "Senior Project Officer - SafeWork NSW Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at National Democratic Institute", "Interview Descriptions": "Two skype interviews conducted and no feedback from HR. Interview conduct since 2019 and still waiting for an update.  I think the position is occupied now, but this unprofessional and I know I did well in the interview.", "Interview Questions": "Experiences and historical background as well as skills"}, {"date": "7 May 2021", "title": "Project Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at National Democratic Institute", "Interview Descriptions": "Standard three step interview process. First there is a phone screening, then there is a  panel interview with about three or four people. They ask pretty basic questions related to work in an office environment and your interest in the position. Following that there is a final interview", "Interview Questions": "What are your three greatest weaknesses "}, {"date": "29 Apr 2021", "title": "Project Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at National Democratic Institute", "Interview Descriptions": "It was overall a pleasant experience. The interviewers were both nice and ask questions about my skills and school background.  The second portion of the interview process was a written exam where I had to resume a text, translate that text and edit some paragraphs.", "Interview Questions": "Do I have experience in accounting management? How do I like being managed? "}, {"date": "20 Apr 2021", "title": "Programmer Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at National Democratic Institute", "Interview Descriptions": "Efficient, honest, and very helpful. The interview was an initial screening and then a meeting with two staff members. I was in constant communication regarding references and was offered within 2 1/2 weeks of interviewing.", "Interview Questions": "Why I wanted to step into non-profit work. "}, {"date": "18 Mar 2021", "title": "Intern Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at National Democratic Institute", "Interview Descriptions": "The interview process was super easy, everybody was super welcoming. Just a typical interview with questions asked and answered. Mostly analytical questions, some creative. I had a great experience! yay", "Interview Questions": "I don't remember any questions"}], [{"date": "27 May 2021", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 3 weeks. I interviewed at National Democratic Institute (Kiev, Kyiv) in Feb 2021", "Interview Descriptions": "CV and cover letter submission, entry test of 2 hours (multiple-choice, essay, short questions), after this a short interview with programmes assistants and officers. After two weeks the offer was sent.", "Interview Questions": "Questions about previous experiences, knowledge of the topic, interest in the position etc."}, {"date": "15 Jul 2021", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at National Democratic Institute (Washington, DC) in Feb 2021", "Interview Descriptions": "The interview process was amazing. They are very professional and easy-going. And also, it took no more than 20 mins all in all. They asked various questions, mainly about the background and why I want to be a part of NDI", "Interview Questions": "How is my background related to the internship?"}, {"date": "24 Mar 2021", "title": "Senior Program Officer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at National Democratic Institute in Feb 2021", "Interview Descriptions": "Applied for the role and they responded back within a week asking for an interview. The overall process went pretty fast, they were prompt, and were generally friendly, which I appreciated. However, I rate this is a very poor experience. They had me go through all of the stages and I still got ghosted. \r\n\r\nProcess included:\r\n1) phone screening\r\n2) writing test\r\n3) panel interview with team (in English and Spanish)\r\n4) panel interview with directors\r\n\r\nWhy make someone go through all that to not even have the decency to write an email saying you decided to go with another candidate? It's not a big deal to get rejected, its part of the process.   \r\n\r\nBelieve the Glassdoor reviews on their work culture. This process was indicative of it. It is never a good sign for staff to unionize against you..especially given you're supposed to be spreading democratic principles. NDI- please start in-house before you tell others how to lead effectively.  There is so much potential here.", "Interview Questions": "What is the biggest threat to democracy in the region?"}, {"date": "17 Dec 2020", "title": "Project Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at National Democratic Institute", "Interview Descriptions": "Initial screening interview with a team hiring manager, followed by a panel interview with 4 program staff covering various countries. HR department was not involved until the final/offer stage, which was interesting.", "Interview Questions": "Describe the biggest challenge to democracy in the region.\r\nWhat are you strengths and weaknesses?\r\nDescribe a time you've had to tell truth to power."}, {"date": "1 Feb 2021", "title": "Program Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at National Democratic Institute in Dec 2020", "Interview Descriptions": "I applied online in December 2020 and received a phone call from a recruitment/HR coordinator about two weeks later. The phone screening lasted about 40 minutes, and a few days later I was invited to complete an hour writing assignment. A day later, I was offered an interview with two staff members. The interview consisted of many behavioral and situational questions. The two individuals were very distracted during the interview, muting themselves often, looking at their pets during the call (yes, you read that correctly), or looking at their screens. After multiple follow up emails, I finally received a rejection email more than a month after my interview date. While I understand that interviewing multiple candidates before the holidays can be stressful, the interview process was very rushed and unprofessional.", "Interview Questions": "What would you say are the biggest threats to democracy  in the region?"}, {"date": "12 Jan 2023", "title": "Program Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at National Democratic Institute in Dec 2020", "Interview Descriptions": "First an interview with HR followed by one with the team you’d work with and a writing assignment. Questions: Why do you want to work for NDI? How do you handle competing priorities?", "Interview Questions": "Why do you want to work for NDI?"}, {"date": "10 Mar 2021", "title": "Research Project Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at National Democratic Institute in Dec 2020", "Interview Descriptions": "everyone was polite, but the interviewers just read questions off of a list. it was very impersonal. I had two interviews, the first was a preliminary interview with the associates and the second one was with the senior managers.", "Interview Questions": "Describe how you prioritize multiple tasks."}, {"date": "9 Oct 2020", "title": "Project Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at National Democratic Institute", "Interview Descriptions": "Had the first interview two weeks after sending the application, then I was asked to come to the final interview a week later. After that, they went through a reference check and I was offered the position.", "Interview Questions": "Tell me about an experience where you had to make changes to the initial plan for a project. How did you deal with the situation?"}, {"date": "7 Mar 2021", "title": "Program Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at National Democratic Institute in Jul 2020", "Interview Descriptions": "The interview was relatively easy, based on the skills and core competencies of the job.  If you are interviewing with the LAC team, be expected to talk extensively in Spanish about democracy and politics in the region. I had about four interviews and one writing test. The writing test is a Spanish to English translation of a news article. Program management experience is necessary for this position.", "Interview Questions": "What is the greatest challenge to democracy in the region? "}, {"date": "17 Feb 2021", "title": "Temporary Project Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at National Democratic Institute in Jul 2020", "Interview Descriptions": "Called out of the blue and conducted a 20-minute introductory interview on the spot. Scheduled a zoom interview with three team members. After, they asked for a timed writing assessment.", "Interview Questions": "How do you handle multiple competing responsibilities and deadlines at once? "}], [{"date": "13 Jul 2020", "title": "Program Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at National Democratic Institute in Jul 2020", "Interview Descriptions": "I was contacted for a phone screening less than a week after submitting an online application. I did not move forward in the recruiting process but the human resources coordinator was kind enough to provide me with interview feedback after I asked.", "Interview Questions": "Why are you interested in this position?\r\nWhat are your salary expectations?"}, {"date": "24 Oct 2022", "title": "Program Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at National Democratic Institute in Jun 2020", "Interview Descriptions": "An interview with a board of program director and current employees, standard questions, a couple of program-specific questions as well. Relaxed atmosphere during the interview, quick response after the interview.", "Interview Questions": "Your plans for 5 years Describe your interest in the position"}, {"date": "20 May 2022", "title": "Finance Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at National Democratic Institute (Addis Ababa) in Mar 2020", "Interview Descriptions": "It took almost one hrs. The interviewer was three ,these are Senior Finance and Admin Manager ,Country Director and Admin Consultant\r\n\r\nIt is a way of discussion, because of this I was free to talk about me and my job experience and qualification.\r\n\r\nI was passed the first interview and called for written exam, It was a kind of psychology, it contain ten kind of question. \r\nFinally I joined this company on April 15 2020", "Interview Questions": "About my self, work experience and educational background "}, {"date": "2 Dec 2019", "title": "Program Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at National Democratic Institute", "Interview Descriptions": "Received no call or e-mail regarding scheduled HR phone screening - HR simply didn't call or reach out until the following day. In both interviews they provided false dates of hearing back by. Overall it seemed like an unprofessional hiring process.", "Interview Questions": "How would you deal with multiple deadlines?"}, {"date": "31 Oct 2019", "title": "Project Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at National Democratic Institute in Sept 2019", "Interview Descriptions": "Standard 3 part interview process:\r\n-Pre-Interview\r\n-Writing Test\r\n-Interview\r\n\r\nThe pre-interview and final interview were very similar, but the final one was longer and with more people. Their behavioral questions were pretty standard, but be sure you have an answer to what the greatest threat to democracy (in the region) is. They asked me this every single time. The writing test was pretty standard, but had obviously difficult language to test your skill.", "Interview Questions": "What is the greatest threat to democracy in the region?"}, {"date": "7 Nov 2019", "title": "Senior Program Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at National Democratic Institute (Washington, DC) in Sept 2019", "Interview Descriptions": "1) Interview with a recruiter for the regional team for which I was applying 2) Made it to the second round writing tasks. 2 hour writing assignment 3) After the writing task was invited to a panel interview with the specific team they saw me joining.  Overall, it took about 6 weeks from application submission to offer.", "Interview Questions": "What interests you in the position?"}, {"date": "10 Jan 2020", "title": "Project Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at National Democratic Institute in Sept 2019", "Interview Descriptions": "They sent me screening questions via email, then asked me to do an interview. Did a phone interview that lasted about 30 minutes, then had another call, only about 10 to test my foreign language skills.", "Interview Questions": "Why are you interested in NDI?\r\nHow do you deal with administrative tasks?"}, {"date": "16 Sept 2019", "title": "Program Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at National Democratic Institute in Aug 2019", "Interview Descriptions": "I was contacted a few week after submitting my online application. They said they had an opening and were wondering if I was still interested in interviewing. They were flexible with the interview hours and responded quickly to emails. The interview itself however felt very impersonal and broad, as if the HR officer hadn't seen my resume. Questions were very standard, and it lasted about 20 min.", "Interview Questions": "How would your work/experience abroad apply to this position?"}, {"date": "11 Nov 2019", "title": "Program Officer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at National Democratic Institute (Washington, DC) in Aug 2019", "Interview Descriptions": "There was an initial 30 minute phone screening with both the recruiter and supervisor on the phone, which ended up feeling more like a full on interview rather than general questions. We spoke about my CV, qualifications, what I desired to get out of my next job, and salary expectations. Then there was a timed writing sample that had to be submitted within 24 hours. After this, I was asked to go for an in person interview with the whole team, which felt like a repeat of the same questions from the phone screening.", "Interview Questions": "Why are you interested in NDI?"}, {"date": "6 Nov 2019", "title": "Senior Program Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at National Democratic Institute in Jul 2019", "Interview Descriptions": "I conducted a brief preliminary interview, did a writing test, and then a two-hour interview with the program manager. Then I never heard from NDI again... no rejection and no responses to my follow up emails.", "Interview Questions": "Where do you see yourself in 10 years?"}], [{"date": "5 Sept 2019", "title": "Program Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at National Democratic Institute (Washington, DC) in Feb 2019", "Interview Descriptions": "The most unprofessional interview process I have ever undergone! Several people I interviewed with basically said they hated their job, in so little words, and that they lost many employees this year. After interviewing several times, they never even had the professionalism to let me know I didn't get the job. Having read the reviews and talked to people who used to work there, I guess I should count my blessing, if even the interviewers are obvious about hating their jobs!!", "Interview Questions": "Describe a time you had to overcome a challenge"}, {"date": "3 Feb 2021", "title": "Program Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at National Democratic Institute in Feb 2019", "Interview Descriptions": "It was easy but long. I interviewed 4 times and didn’t even get the job (and ended up getting a much higher paying, much more senior position elsewhere). It seems like they don’t even know what they’re looking for.", "Interview Questions": "What would you do if you had to work on a project proposal that you didn’t support ?"}, {"date": "27 Jul 2019", "title": "Project Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 3 weeks. I interviewed at National Democratic Institute (Washington, DC) in Jan 2019", "Interview Descriptions": "Most positive interview experience I have ever had. Initial phone screening with a program assistant and manager which was basically just a few simple (and easy) questions and an overview of the position. A week later, I was invited for an in person interview with the same two people I had spoken with over the phone. Super friendly and helpful, asked the typical interview questions.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "26 Jul 2019", "title": "Senior Systems Administrator Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at National Democratic Institute (Washington, DC) in Jan 2019", "Interview Descriptions": "This was the easiest interview ever in my 8 years of sysadmin experience\r\nWas meant to be with the Director of the Tech Team, but he got distracted and left after 2 minutes.\r\nI was left with several members of the \"Tech Ops\" team who spent the next hour lobbing me softball tech questions that just underlined their own lack of knowledge. I got the impression that they were using this interview to gain knowledge from me that they didn't have.\r\nAfter that, I was handed over to the \"CTO\" who asked some slightly harder (but frankly very dated) questions.\r\nIt's not hard to impress this crowd, frankly.\r\nNot sure if I got an offer as I ghosted them after this experience.\r\nIf you have no scruples and mediocre skills you will do well here.", "Interview Questions": "What is a web server?"}, {"date": "26 Jan 2019", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at National Democratic Institute (Washington, DC) in Dec 2018", "Interview Descriptions": "Long so be prepared to take some time off if you are working. Phone Interview and then 3-4 in person interviews. They are unprofessional and despite all the time I dedicated to interview with them multiple times, they didn’t even have the decency to follow up and let me know that I wasn’t chosen. Which is fine since multiple recent reviews state that it’s a toxic work place with low pay and crappy PTO. Glad I held out for something better and DOMESTIC.", "Interview Questions": "Why NDI? "}, {"date": "31 Jan 2022", "title": "Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at National Democratic Institute in Oct 2018", "Interview Descriptions": "There were three interviewers including an HR manager. The Process was straightforward. They drilled me down if I was ready for the assistant position.  I thought I impressed them, only to know that I was rejected by them.", "Interview Questions": "What is the most significant political incident this year? "}, {"date": "21 Sept 2018", "title": "Project Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at National Democratic Institute", "Interview Descriptions": "It was a phone interview and I didn't advance beyond that stage. It was a positive interview and I was very passionate about the issue and region around which the position would revolve. I was slightly confused because I got the impression from the interviewer that I could be advancing to the next stage. Instead, NDI sent me three rejection emails over the two weeks. Perhaps I wasn't \"qualified\" enough, but I think I can get a hint without needing to read three rejection emails.", "Interview Questions": "Q:  Why are you interested in the region that you're applying to?\r\nQ: What is your impression of what NDI does as an organization?"}, {"date": "29 Nov 2018", "title": "Program Officer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at National Democratic Institute in Sept 2018", "Interview Descriptions": "I was very happy to be invited to interview at NDI, but I had an unprofessional interview experience. I'm writing this review because I respect NDI a lot, and really hope that they can improve. \r\n\r\nMy first point of contact was with a woman from HR, who called me 15 minutes after our scheduled appointment time. The first question she asked me was whether I would be willing to take a lower salary.  She asked me to commit to accepting the job at a particular salary point, and told me that I would have to do this in order to proceed with the interview process. While I can appreciate an organization being upfront about their budget constraints, the manner in which this was communicated was really off-putting.  The interview process had hardly begun, and I was being asked to make a commitment before they'd asked me any substantive questions (and before I'd been able to ask any questions myself). \r\n\r\nDespite some misgivings, I said I'd like to proceed. I really do respect NDI's work, and I know that sometimes HR doesn't represent an entire organization. I was asked to set up a phone interview for the following day. \r\n\r\nThis (second) interview went well. I spoke with someone from the program team who was extremely knowledgeable and professional. I came away from this interview really hoping for an opportunity to work with NDI. \r\n\r\nThe following week, on Rosh Hashanna, I received a calendar invite for a third-round interview, scheduled for the following day. There was no accompanying note, just the calendar invite. The interview was to take place 20 hours after the invitation was sent, giving me very little time to (a) get out of my existing work commitments and (b) prepare for the interview. As I mentioned above, the invite also happened to have been sent on a major religious holiday--equivalent to Easter or Christmas. I get it, this happens sometimes, but given the extremely short notice, it was frustrating. Nonetheless, I accepted the invitation.\r\n\r\nThe third-round interview--like the second-round interview--was appropriate and professional. Although I hadn't had much time to prepare (I had to work extra in order to make time for the last-minute interview), I enjoyed learning more about NDI's work.\r\n\r\nOverall, I was impressed with NDI's work, but extremely disappointed in the interview process. The last-minute scheduling made it extremely difficult to prepare for the interviews, and the strange salary discussion left me feeling confused about whether to broadcast or downplay my skills and experiences. \r\n\r\nThere are a ton of brilliant and qualified people in DC, and I have no doubt that whoever got the job offer will be excellent. There's a good chance I wouldn't have gotten the job even if the interview process had been perfect. That said, NDI should know that its selection process has some major issues. It can do better.", "Interview Questions": "Have you worked on a political campaign?"}, {"date": "8 Sept 2018", "title": "Program Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at National Democratic Institute (Washington, DC) in Aug 2018", "Interview Descriptions": "I applied on 7/30, they contacted me two weeks later to schedule a phone interview for the next day with an HR person. She asked pretty basic questions, but it was clear that she had read my resume before our call, which I appreciated.  A week later she responded to set up an in-person interview for the next day, with the two-person unit (Director and Senior Advisor). At this interview, they were running a little behind and the team seemed a little frazzled. This interview was profoundly strange to me because it was incredibly serious but also informal. We were just sitting and chatting, but they also asked very serious questions, which threw me for a loop. They finally contacted me on Sept 7 to say they'd chosen another candidate.", "Interview Questions": "How does your (unique) background offer \"value-add\" skills to the team?"}, {"date": "23 Apr 2018", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at National Democratic Institute in Mar 2018", "Interview Descriptions": "Phone interview with the entire department (only three people). Very friendly, mostly just discussed when I could start and what specific skills I had which I could add to the department.", "Interview Questions": "Do you have any experience producing videos or working with such technology? "}], [{"date": "16 Feb 2018", "title": "/Program Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at National Democratic Institute (Washington, DC) in Jan 2018", "Interview Descriptions": "I applied online and about a week or so later I received a phone call for an informational/informal interview. Following that call, I waited about another week before I received an e-mail for the final interview to be conducted in-person or on Skype. I preferred in-person. The interview was done by project assistants and lasted about a half hour to forty minutes. It seemed to be going well, but I did not receive an offer.", "Interview Questions": "How would you handle working on multiple projects?"}, {"date": "31 Jan 2018", "title": "Project Assistant/ Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at National Democratic Institute in Jan 2018", "Interview Descriptions": "I submitted an application for the project assistant/intern position on a regional team, and was contacted over the phone for a 15 minute screening about a week later. The interviewer asked a few basic questions, including \"how did you become interested in the region?\" and \"what is one challenge you see facing the region?\" After this stage, I was contacted about two days later and asked to complete a short writing assignment. It was an hour-long assignment that required you to write an executive summary regarding issues facing a fictitious country. I was contacted for an hour-long interview with three members of the team shortly thereafter.", "Interview Questions": "What is one challenge you see facing the region?"}, {"date": "23 Jan 2021", "title": "Senior Program Assistant and Training Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at National Democratic Institute in Sept 2017", "Interview Descriptions": "The first interview is an HR phone screening which is simple and largely confirmatory. However, they will ask about why you are interested in working for NDI. \r\n\r\nSecond is a team interview with junior management who ask about why NDI, why the team you applied to, your experiences in the field, your opinions about the largest current challenges in the field, experiences working for multiple managers, etc. \r\n\r\nThen there is a brief writing exercise that you have one hour to complete and following that up to one more interview with more senior team management.", "Interview Questions": "1) Describe what NDI does in your own words. \r\n2) What made you interested in (fill in the team)?\r\n3) What is your experience in this region/ area of expertise? Do you have any experience in democracy promotion and strengthening and if so, could you please describe?\r\n4) Have you ever worked for multiple managers? How do you handle time/ task conflicts under multiple managers?\r\n5) What is the largest challenge you see in democratic trends in this region/ area of expertise?"}, {"date": "3 Aug 2017", "title": "Program Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at National Democratic Institute", "Interview Descriptions": "I received an email for an interview the day after I submitted my application online. It was a two-phase  face-to-face interview that took an hour. The first 30 minutes was with the program staff, and the second part was with the senior managers.", "Interview Questions": "Share something that is not in your resume. "}, {"date": "30 Jul 2018", "title": "Project Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at National Democratic Institute (Washington, DC) in Aug 2017", "Interview Descriptions": "I applied online and was first called for a phone interview where they mainly tested my foreign language skills and asked me about my interest in joining the organization.  After this, I was asked to do a translation for them and a week later I was called in for an interview with 2  members of the team. Questions were standard focusing on language skills and personal skills. Nothing out of the regular.", "Interview Questions": "Past experiences living abroad and why are you interested in the region?"}, {"date": "30 Jan 2019", "title": "Project Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at National Democratic Institute (Washington, DC) in Aug 2017", "Interview Descriptions": "I did a brief phone screening which took about 5 minutes. Then a phone language test, which was basically an interview in the language that was required. Then I took a written translation test, and then an in person interview in D.C.", "Interview Questions": "Why do you want to work at NDI?"}, {"date": "28 Aug 2017", "title": "Human Resources Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at National Democratic Institute (Washington, DC) in Aug 2017", "Interview Descriptions": "I applied online on 8 July 2017. Received an email with request to schedule a phone interview with Senior Manager, Human Resources on 21 August 2017. She had very detailed questions about my resume and my experience. I liked her approach as she did not asked me to just to talk about my previous work as was done by other HR who contacted me. She had specific questions regarding specific information in my resume. She asked me about my salary expectations and I told her that I would llike to receive 40k-50k annually but it can be negotiated based on overal benefits package. We had a 1+ houre conversation. I asked her when they want the person to start working and she replied that approx in the middle of September 2017. I told her that I have one offer and one pending interview so she changed her approched and asked for in-person meeting to be scheduled the next day after phone interview. I went for interview with 2 people. We had known each other better through more detailed questions. She informed that that she is going on vacation and in case if I do not accept any other offer before she is back they will contact me again.\r\nAs I understand such orginizations are not usually in a hurry so recrutiment processess takes more that 1 motnh.", "Interview Questions": "Where do you see yourself in 6 months and 1 year after employment?"}, {"date": "8 Jul 2017", "title": "Project Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at National Democratic Institute", "Interview Descriptions": "First, they will contact you for a phone interview. A second interview will follow, this time with the whole team.\r\nFor the anxious interviewers out there: Just remember to take some deep breaths. They are already impressed by you, so don't fret too much. I found taking notes on the different programs and writing down all of my questions to be very helpful.", "Interview Questions": "Many of the questions were related how I'd handle certain aspects of the job description. They wanted me to talk about the experiences on my resume, mainly. They also asked why I was interested in the position and what I knew about the program."}, {"date": "26 Apr 2019", "title": "Program Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at National Democratic Institute (Abuja, Niger) in Jul 2017", "Interview Descriptions": "It was very professional and straight to the point. Expect the panel to drill you. I was asked to related my current job role with the one i was applying for and how i plan to leverage on the skills of my current  job role for a greater performance if employed.", "Interview Questions": "What are you bring to NDI?"}, {"date": "4 Jun 2017", "title": "Project Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at National Democratic Institute (Washington, DC) in Mar 2017", "Interview Descriptions": "The interview was quite laid back. I interviewed with 3 members of the team, and each took turns asking me various questions about my experience in regards to the responsibilities and requirements of the position.", "Interview Questions": "How do you keep yourself organized?"}], [{"date": "14 Feb 2017", "title": "Program Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at National Democratic Institute (Washington, DC)", "Interview Descriptions": "After I applied online and conducted an informal phone interview, an NDI staffer sent me a writing test. After returning my answers, apparently to the satisfaction of the staffer, I was invited to NDI's offices in downtown Washington to interview in person. The interview was friendly, congenial, and around 45 minutes in length. Two NDI staffers asked me a battery of questions to establish my interest in NDI's work, any regional-specific knowledge/skills/qualifications, and generally to identify any glaring personality defects.", "Interview Questions": "Why do you want this job and how do you plan to progress onwards in your career?"}, {"date": "31 Jan 2017", "title": "Program Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at National Democratic Institute (Nairobi)", "Interview Descriptions": "It was rigorous. They require extensive knowledge on parliamentary procedures, general knowledge on politics and governance issues. They also require someone who has studied social sciences especially international relations or political science because they will seek your understanding on certain theories and concepts in these fields.", "Interview Questions": "Short term and long term goals"}, {"date": "1 Feb 2017", "title": "Project Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at National Democratic Institute (Washington, DC) in Dec 2016", "Interview Descriptions": "I was introduced to one of the Directors prior to applying.  After meeting with the Director over coffee, her forwarded my information over to the decision makers, who ultimately conducted my interview.  My interview was conducted over the phone by two individuals.  They asked questions related to by background and experience.  I had prior experience on Capitol Hill which they liked very much.", "Interview Questions": "Explain your expertise working with Google docs?"}, {"date": "3 Feb 2017", "title": "Project Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at National Democratic Institute (Washington, DC) in Dec 2016", "Interview Descriptions": "Overall, pretty standard. I was asked questions about my past experience, why I wanted to work at NDI, what distinguished me from other candidates. If you prep the standard interview questions you should be fine. I was able to ask lots of questions about the job and received thorough answers.", "Interview Questions": "Why do you want to work at NDI?"}, {"date": "26 Oct 2016", "title": "Project Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at National Democratic Institute (Washington, DC)", "Interview Descriptions": "Standard interview process with a super quick turnaround, because they were desperate to fill the position. Phone call followed by in person interview. Job offer made dependent on references.\r\n\r\nThey asked the basic interview questions, with a few technical questions focusing on women and tech and electoral violence. \r\n\r\nOverall it was a good interview with two of the team members.", "Interview Questions": "Why do you think you are suited for this role?"}, {"date": "9 Aug 2016", "title": "Project Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 5 days. I interviewed at National Democratic Institute", "Interview Descriptions": "I learned about the position through a university listserv, and sent my application directly to the team member(s) that I would be working with.\r\n\r\nWent through two sets on interviews with two people each. The first interview was a bit intimidating, but by the second one I knew what to expect, and it was a lot better.", "Interview Questions": "Why are you interested in this position?"}, {"date": "11 Oct 2016", "title": "Project Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at National Democratic Institute (Washington, DC) in May 2016", "Interview Descriptions": "Was not contacted for an interview until 5 months after I submitted my application. Once interviewed everything went very quickly, with one brief 15 min phone call and a follow up hour long in person interview the next week. Jr. staff conduct interviews, something they may not have a lot of experience doing prior.", "Interview Questions": "There were no unexpected questions. Typical strengths and weaknesses? Why are you interested in the position?"}, {"date": "10 Apr 2016", "title": "Internship Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at National Democratic Institute (Washington, DC) in Mar 2016", "Interview Descriptions": "After submitting a cover letter and resume online, I was called to set up a phone interview. At the end of that interview, I was asked to come in for a one-on-one. After the one-on-one with a Program Assistant, I received a call requesting I return two days later to have an interview with a Program Officer, which I did.", "Interview Questions": "What other teams would I like to work for at NDI and why?"}, {"date": "30 Sept 2015", "title": "Executive Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at National Democratic Institute (Espanola, NM) in Sept 2015", "Interview Descriptions": "pre interview over phone, several questions, follow-up phone call, email with news of in person interview, interview in person, 3 person panel, 45 minutes, ending with opportunity to ask questions, email following week with thank you for interviewing, 2nd email with rejection and offer to another candidate and thank you", "Interview Questions": "Why are you applying for the position"}, {"date": "12 Oct 2017", "title": "Program Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at National Democratic Institute (Bishkek) in Sept 2015", "Interview Descriptions": "It was a two-step process. I took a writing test as a first step. I was short-listed and invited for an interview with my supervisor. After having an interview with my supervisor I was invited for an interview with the Country Director.", "Interview Questions": "I was asked if the women's situation in the country was better now or during the Soviet Union."}], [{"date": "22 May 2015", "title": "Program Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at National Democratic Institute (Washington, DC)", "Interview Descriptions": "First phone interview, then face to face at the hiring agency. Then I got called in the offices where I had to meet my supervisor, followed by a phone call with my supervisor's supervisor and finally the group interview.", "Interview Questions": "There was no difficult question for me."}, {"date": "13 Mar 2017", "title": "Senior Program Assistant Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at National Democratic Institute (Washington, DC) in Mar 2015", "Interview Descriptions": "Applied online in December 2014, got a call 3 months later in March 2015. \r\nIt started with a phone interview, followed by two in-person interviews and a request to submit a writing sample, and I was hired within 2 weeks.", "Interview Questions": "Will I be okay with what NDI pays considering it's a \"nonprofit\"?"}, {"date": "22 Feb 2015", "title": "Program Officer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2+ months. I interviewed at National Democratic Institute (Washington, DC) in Jan 2015", "Interview Descriptions": "Typically, there is a 20-minute phone screening, two-hour writing test, 90-minute in-person panel interview, and, if you make it to the final round, an interview with the team director. I had applied and interviewed for positions with this same team at NDI previously, so this time around I did not have to do the phone screening nor the writing test. There is no language testing, which I thought was odd for a regional team -- typically in this field, strong foreign language abilities are requisite for this type of work, if not highly desirable.\r\n\r\nThe in-person interview lasted for about two hours, and I met with a Program Manager and a Program Assistant. They asked some standard behavioral questions, as well as some questions about politics in the region to assess my knowledge of the main issues. They also described the programs that I would be managing, which the Program Assistant (despite being just out of college with no other relevant work experience), was singlehandedly backstopping. I asked some questions about the team and organizational culture, and they were very forthcoming about NDI's bureaucratic nature and lack of opportunities for professional development. Finally, they said that it could be a long time before they would be in touch about the final round, but they did ask for my references before concluding the interview. \r\n\r\nOver six weeks have passed since the interview, and I haven't received any more information or even an automated rejection email. I followed up with my interviewers a few weeks ago and didn't receive any response. I found out through informal channels that the team instead hired an intern/Project Assistant to help with these programs (instead of a Program Officer)... That seems really fishy to me, especially given that these programs warrant management from a more seasoned employee, as opposed to the skills of an intern. I thought the experience was a tremendous waste of time, and it was unprofessional on the part of the hiring managers to not at least send some sort of \"thanks, but no thanks\" message. I can safely say that I will not be applying for any positions with NDI in the future.", "Interview Questions": "Tell us about a time when you had to work with a difficult person."}, {"date": "18 Aug 2014", "title": "Intern Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. The process took 2 weeks. I interviewed at National Democratic Institute", "Interview Descriptions": "I got invited for a phone interview over a month after I submitted my application. The process itself was quick and easy. Interview questions focused on what I knew about the organization, why I was interested in the position I applied for, and how I thought it would benefit my future career path. Orientation is a bit much, especially for an intern position, but it turns out to be useful once you're actually working.", "Interview Questions": "How did you first hear about NDI? This question threw me off because I wasn't sure how to answer it - at my university it was so well known, it was almost like asking how I first heard about the US government. "}, {"date": "12 Jul 2014", "title": "Project Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at National Democratic Institute", "Interview Descriptions": "Applied online, phone interview two weeks later with junior staff team members, a one hour timed writing test the next week, reference check and then extended offer. The junior staff members are all potential supervisors and they make the final decisions on whether to hire you or not. Questions were pretty straightforward. Writing test is just to make sure you have basic writing skills and competencies, so don't be too stressed.", "Interview Questions": "What is something of interest to you that is happening in the region?"}, {"date": "21 May 2014", "title": "Technical Trainer Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. I interviewed at National Democratic Institute", "Interview Descriptions": "Initial interview was with Tech Director, and he was multitasking during the interview. It was held at the office of the recruiting firm NDI used, and I was shown into a conference room where he was working on papers, making calls, and working on his laptop.  I sat quietly until he engaged me, and he remained distracted throughout the interview. He conveyed he was a very important and busy person, which I'd like to believe I responded to with wry amusement.  His questions were cursory, and I had no feedback about the result. However, the next day I had a phone interview with my supervisor, and got the job.", "Interview Questions": "N/A"}, {"date": "26 May 2015", "title": "Program Assistant, Monitoring and Evaluation Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 5 months. I interviewed at National Democratic Institute (Washington, DC) in Apr 2014", "Interview Descriptions": "The application process was quite lengthy. When I did get called for an interview, it was a very quick turnaround with minimal flexibility in terms of scheduling. Essentially, after nearly four months of waiting, I received an email on a Monday, asking me to come in on Tuesday or Wednesday. So there wasn't much time to prepare.  \r\n\r\nThat being said, the interview itself was prompt and professional. The first hour was a brief writing test and data analysis exercise. Very simple, just testing basic writing and data analysis skills while seeing how well an applicant can think on their feet with minimal prior information.\r\n\r\nThe second hour was a standard interview. They were very understanding of any gaps in knowledge, knowing that their line of work is quite complicate at times. So it was in part an \"orientation\" as well as an interview. Most of the questions revolved around material on my resume, asking me to elaborate.", "Interview Questions": "Please explain how your experience, which is not particularly relevant to M&E, will help you be successful in this role, based on what you have learned today thus far."}, {"date": "30 Oct 2014", "title": "Project Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at National Democratic Institute in Apr 2014", "Interview Descriptions": "The hiring and interview process was smooth. I was contacted for a preliminary phone interview, after which I had a second, longer, phone interview with three current staff members. They asked basic interview questions: why am I interested in working for NDI, what experience do I have, how do I handle x, y, z. Then I was asked to completed a 1-hour written exam and submit three references and a writing sample.", "Interview Questions": "All the questions were expected. "}, {"date": "25 Dec 2013", "title": "Project Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at National Democratic Institute", "Interview Descriptions": "3- part interview process: 1) phone interview. 2) language abilities test (if interviewing for a regional team), 3) face-to-face interview. Be sure to know what is going on in your particular region. Read the news, talk to people that know about the region, and do your research of the organization.", "Interview Questions": "What is going on in X part of the world?"}, {"date": "13 Dec 2013", "title": "Project Assistant Interview", "results": "No Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at National Democratic Institute", "Interview Descriptions": "Phone interview, the usual questions, walk me through your resume, how you can help the program, what have you learned from this specific position, your skills...Friendly and very polite interviewer.", "Interview Questions": "Nothing out of the ordinary "}], [{"date": "28 Aug 2015", "title": "Intern Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at National Democratic Institute (Washington, DC) in Dec 2013", "Interview Descriptions": "I was emailed to schedule a phone interview a couple of weeks after applying at their website. The interview was conducted in English, Spanish and French. The job announcement said you only needed basic knowledge of French. Nevertheless it was clear during the interview that they were looking for a candidate who could speak it fluently.", "Interview Questions": "Why I wanted to work with them and they asked me to repeat my resume to them. Also they wanted me to indicate the Latin American country which I thought needed more assistant from the US government."}, {"date": "3 Dec 2013", "title": "Senior Program Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at National Democratic Institute (Washington, DC) in Nov 2013", "Interview Descriptions": "Found job ad on university career service email. Applied online. Was contacted within one week and arranged a 1-on-1 interview. Interviewer was very friendly. The interview was largely based on questions about personal background and familiarity with the specific region. I did not proceed to the second round of interview due to work authorization issues. (NDI rarely sponsors for work authorizations.)", "Interview Questions": "No difficult or unexpected questions asked"}, {"date": "14 Nov 2013", "title": "Program Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at National Democratic Institute (Washington, DC) in Oct 2013", "Interview Descriptions": "Shortly after I applied online, I was contacted for a screening interview, which was very relaxed. The following week, I completed a timed writing test at home, then was called in for interviews with three members of the staff. Another two weeks later was my interview with the program director.", "Interview Questions": "Questions were standard, none stood out as difficult or surprising."}, {"date": "2 Sept 2014", "title": "Program Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at National Democratic Institute (Washington, DC) in Aug 2013", "Interview Descriptions": "I was invited for a Skype interview with standard questions, such as \"Tell me about why you want to work for NDI\", and why I am interested in democratization. The interview went well, so over the phone they invited me to take their next round, which is an assignment in two parts. First I had to summarize an article for them, submit it, and then receive the next assignment, which was to compose a mock newsletter with important regional articles. After submitting this, I did not hear from NDI and the department was unresponsive to my follow-ups.", "Interview Questions": "Questions were very standard."}, {"date": "16 Jul 2013", "title": "Project Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at National Democratic Institute in May 2013", "Interview Descriptions": "I was contacted for an interview a few weeks after applying to the position. My first interview was by phone (I wasn't living in DC at the time). The questions were fairly standard. They wanted to know why I was interested and to hear more about my research, writing, and development experience. The interviewers (two of them) were junior-mid level staff: one from the program area I was being considered for, and one from HR. They were friendly and easy to chat with and both seemed genuinely interested in helping me navigate the beginning of a career in IR/development.\r\n\r\nLater that week, I was invited to the second round of interviews (an email-based writing assignment). Though we made an appointment and I was to spend no more than an hour completing the assignment, the email was sent to me the evening before our scheduled time (I decided not to touch it until morning). I definitely would have needed more than an hour to do it well (and wasn't convinced other candidates would be scrupulous about the time limit), but I turned it in, in mediocre condition, after one hour had passed. It took them a month to tell me I had not been selected for the internship.", "Interview Questions": "Summarize this ten page, single-spaced technical document in less than one page. You have one hour."}, {"date": "13 Mar 2014", "title": "Program Assistant Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at National Democratic Institute (Washington, DC) in Mar 2013", "Interview Descriptions": "I was given the offer in the initial interview.", "Interview Questions": "I was begged to talk the job, which should have been a red flag right there."}, {"date": "19 Feb 2013", "title": "Program Assistant Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at National Democratic Institute", "Interview Descriptions": "I was called in for an interview a few days after my application submission. The interviewer was very friendly and professional, making sure she explained all that i have to know about NDI and the position.", "Interview Questions": "What do you want to make out of your experience with NDI"}, {"date": "16 Feb 2013", "title": "Project Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at National Democratic Institute", "Interview Descriptions": "I applied online and was contacted via email for an interview.  After interviewing  and completing some tests, I was  sent an email offering me the position.  Later, I got a formal offer letter from HR.    The whole process was pretty straightforward.", "Interview Questions": "It was standard. Nothing too difficult. "}, {"date": "16 Oct 2012", "title": "Human Resources Intern Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at National Democratic Institute (Washington, DC)", "Interview Descriptions": "Got a email within 1 week of applying requesting a phone interview by a HR assistant. Its was very difficult to understand the HR, she could hardly speak understandable english, and every time after my answer kept on saying thats great.", "Interview Questions": "Basic question,\r\nWhat do you know about NDI,\r\nWeakness and strength\r\nTell us about your self \r\n\r\n\r\nI was also interested in the project assistant internship and mentioned it during the interview. I guess I should not have, after 3 emails following up and 1 calls never heard back. Happy i never heard back, got a internship at a much better international NGO who cared to reply back if I write and respects my time and efforts.\r\n"}, {"date": "25 Jul 2012", "title": "Program Officer Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. The process took 2 months. I interviewed at National Democratic Institute (Washington, DC)", "Interview Descriptions": "Contacted a month after submitting application. The interview process was scattered and unorganized, though not unpleasant. It included: a language screening (10 mins); 2 phone interviews, submitting writing examples and an executive summary excersize. It spanned 2-3 months.", "Interview Questions": "What is the region's biggest challenge to democracy? "}], [{"date": "22 Jun 2012", "title": "Senior Program Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at National Democratic Institute (Washington, DC) in May 2012", "Interview Descriptions": "There was an initial phone interview to verify language proficiency, followed by a panel interview in person. It was a generally relaxed environment with typical questions about previous experience and what the candidate felt they could bring to the work place. The interviewers were open to questions about the work place, duties to undertake, and expectations for work and travel. Salary was not discussed and a writing and translating test followed the interview.", "Interview Questions": "Describe your greatest weakness?"}, {"date": "1 Apr 2015", "title": "Intern Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at National Democratic Institute (Washington, DC) in Apr 2012", "Interview Descriptions": "First I was contacted for an initial screening conversation. The conversation took around 30 min. Then I was moved to a written assessment test. The test was online for an hour.", "Interview Questions": "Summarize a report. Write an executive summary."}, {"date": "2 Oct 2012", "title": "Program Officer- Latin America and the Caribbean Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at National Democratic Institute (Washington, DC) in Feb 2012", "Interview Descriptions": "Over the phone pre-screening with a program assistant. Was then scheduled for an interview (Skype) with two individuals from the Latin America department. After the interview I was asked to do a written examination which included a summary and a translation exercise. \r\n\r\nWas unable to continue with the process due to travel conflicts but I was told that they would keep my file active and I could continue with the hiring process upon my return. Before I even got back from my trip I received an email from them inquiring if I was still interested in the position (I was) and they scheduled me for another  interview. Did the same interview again via Skype with two new individuals. A week after this interview I received an email stating I was not selected for the position.", "Interview Questions": "What steps do you take to implement a program"}, {"date": "24 Jun 2013", "title": "Project Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at National Democratic Institute (Washington, DC) in Aug 2011", "Interview Descriptions": "Interview process is fairly standardized.  They were transparent and professional.", "Interview Questions": "technical area of democracy that you know about?"}, {"date": "1 Oct 2011", "title": "Programs Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at National Democratic Institute (Washington, DC) in Jul 2011", "Interview Descriptions": "I submitted an online application and then had two rounds of interviews. Some of the individuals that I met with were great - very knowledgeable and clearly dedicated to their work, while others were much more mixed. The overall process was not great and didn't give me a good impression of the organization's management - they rushed me through the initial stages and then I didn't hear back for well over a month, only to be told that the position was changing.", "Interview Questions": "Why do you want to leave your current position?"}, {"date": "6 Jul 2015", "title": "Intern Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at National Democratic Institute in Jun 2011", "Interview Descriptions": "I applied online and shortly received email for phone interview one week later. After the phone interview the next step was a  written translation. The next step would have been another interview, but I did not reach this step. The interviewer was very friendly, though I was not sure if they had much experience interviewing people.", "Interview Questions": "Translate one page memo."}, {"date": "18 Oct 2010", "title": "Intern Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at National Democratic Institute (Washington, DC) in Jul 2010", "Interview Descriptions": "Arrived at the office roughly 10 minutes ahead of the interview. I was forced to wait an additional 35 minutes to be interviewed. The decision to hire was probably already made by management, making my interview a formality.  Regardless, forcing an applicant to wait more than 45 minutes to be interviewed was thoroughly unprofessional. \r\n\r\nDuring the interview itself, the manager felt the need to remove their shoes and massage their feet. The questions were fairly generic without adequately gauging my skills, education or previous experience.\r\n\r\nEven though the position was an internship, I still deserved some level of professional courtesy. Overall, I found the experience to be generally insulting and unbecoming of an organization that conducts great work throughout the world.", "Interview Questions": "Can you walk me through your resume?"}, {"date": "11 Feb 2012", "title": "Intern Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 2 weeks. I interviewed at National Democratic Institute in Apr 2010", "Interview Descriptions": "I submitted my resume and cover letter through their website. Soon after that I got a call from HR, the woman was super nice, asked the standard questions (what do you know about NDI, what do we do, why NDI etc). There was also a written test (draft an executive summary)", "Interview Questions": "What does NDI do? Why NDI?"}]]