[[{"date": "8 May 2023", "title": "RBT - Registered Behavior Technician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Southwest Behavioral Health Services", "Interview Descriptions": "Recruiter was nice and whole process was good. Everyone was very approachable and answered all my questions. I was very nervous and they made me feel very at ease with the whole process.", "Interview Questions": "Tell me about yourself ?"}, {"date": "30 Sept 2021", "title": "Counselor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Southwest Behavioral Health Services (New York, NY) in Sept 2021", "Interview Descriptions": "We had a great conversation about Mental Health regarding how the age/ experience can bring on triggers in certain situations. We also discussed my background and how I became interested in mental health. The pay and schedule of the counselor will was also discussed.", "Interview Questions": "How and why I chose the professions?"}, {"date": "28 Dec 2022", "title": "Substance Abuse Prevention Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Southwest Behavioral Health Services in Apr 2021", "Interview Descriptions": "It was an average interview. They asked questions based on the job description. They also asked a lot of situational questions. Think of examples before hand to easily answer questions.", "Interview Questions": "Tell us about a time you managed a project"}, {"date": "29 Dec 2020", "title": "Behavioral Health Technician Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Southwest Behavioral Health Services (Phoenix, AZ) in Dec 2020", "Interview Descriptions": "The interview was 15-20 minutes long. They mentioned what salary you are looking forward to and asked the interview questions . It was the general ones at first and then the scenario questions came in.", "Interview Questions": "What would you do if you see a co-worker be abusive towards a client (patient)?"}, {"date": "25 Jul 2018", "title": "BHT Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Southwest Behavioral Health Services (Phoenix, AZ)", "Interview Descriptions": "The interview process was very easy. I had a one on one interview, but there is a possibility of a panel type interview. I’m pretty sure it depends on the job position If you were unsure of a question the interviewer gave an example. The process is a situation, action, outcome style.", "Interview Questions": "Q: what was one mistake you made? How did you handle it? What was the outcome "}, {"date": "8 Jan 2017", "title": "BHT Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Southwest Behavioral Health Services (Phoenix, AZ)", "Interview Descriptions": "There was a phone interview to make sure I met the basic qualifications. Then a face-to-face interview with two supervisors. The questions had to do with basic knowledge of psychiatric symptoms and symptoms of drug use, and then some situational ones, where I had to give examples of times when I had experienced certain situations and how I responded.", "Interview Questions": "What would you do if you witnessed a client masturbating in the Dayroom? (They love to ask this question)"}, {"date": "20 Oct 2016", "title": "Customer Service Representative Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Southwest Behavioral Health Services (Bullhead City, AZ)", "Interview Descriptions": "Standard \"Behavioral Interview\". You will be asked a series of three part questions and you must answer each question with a three part response. You will interview with a panel of at least three people who take turns asking each question. The interview is lengthy and can last up to an hour and a half long.", "Interview Questions": "Name one mistake you had in a past employer and what did you do to correct it and was the outcome?"}, {"date": "25 Jun 2018", "title": "Case Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Southwest Behavioral Health Services (Prescott Valley, AZ) in Oct 2016", "Interview Descriptions": "Panel interview with program director, front desk supervisor and current client.  Be ready with specific examples of your successes. Its all \"tell me a time when...\" there are no \"what would you do if...\" questions.", "Interview Questions": "Tell us about a time when you dealt with an angry customer."}, {"date": "20 Sept 2016", "title": "Case Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Southwest Behavioral Health Services (Phoenix, AZ)", "Interview Descriptions": "There was two people interviewing and they took turns asking questions off a computer screen. They typed all your answers down. A lot of STAR questions in the interview so be prepared to have those types of answers ready. Definitely research the company and job description before going in as well because there were some questions relating to that.", "Interview Questions": "Describe a time you disagreed with a supervisor and how you handled it."}, {"date": "26 Jul 2016", "title": "Family Coach Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Southwest Behavioral Health Services (Phoenix, AZ) in Aug 2015", "Interview Descriptions": "Face to face, experience based. After application, the interview was scheduled within two days, completed within a week, and the offer call came ten days later. The start date was two weeks out following a background check and drug test.", "Interview Questions": "Tell me about a time...."}], [{"date": "21 Aug 2015", "title": "Program Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Southwest Behavioral Health Services (Phoenix, AZ) in Jul 2015", "Interview Descriptions": "Extensive first interview. Lots of questions regarding individual experiences in the work place. Doesn't seem as if HR understands hiring needs of departments. (I got a rejection letter the same day I was called to schedule for interview.) I didn't recieve a notice on whether I was hired or not after the interview process. So I called, left a message, and still didn't hear back ...", "Interview Questions": "Explain a situation in the work place where you were required to handle a difficult situation with an employee, a patient, a superior, etc."}, {"date": "20 Jan 2016", "title": "Mental Health Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Southwest Behavioral Health Services (Bullhead City, AZ) in Jan 2015", "Interview Descriptions": "It went well. Easy. Had several individuals on the panel including community peer support members. The interview turn around went quickly and I received the job. I met with employees prior to meeting the interview panel. They also gave me a tour of the organization.", "Interview Questions": "What were my strengths as a counselor"}, {"date": "18 Jun 2014", "title": "Senior Team LEader Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Southwest Behavioral Health Services (Phoenix, AZ) in May 2014", "Interview Descriptions": "For me, it only worked to apply to different positions directly. Sending the resume to their general database got me nowhere. Got an email response that was followed by a 30 minute phone at my earliest convenience. Final stage was a panel interview, on site, that lasted for about 1 hour.", "Interview Questions": "What is a strength you have that I should be aware of?"}, {"date": "2 Apr 2014", "title": "All Openings Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. The process took 2 months. I interviewed at Southwest Behavioral Health Services", "Interview Descriptions": "Several interviews and can be a lengthy process.  A few phone calls then face to face meetings....then a long delay before hiring.", "Interview Questions": "N/A"}, {"date": "1 Sept 2015", "title": "Senior Team Lead Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Southwest Behavioral Health Services (Phoenix, AZ) in Mar 2014", "Interview Descriptions": "Four people interviewing, admin. and coordinators. They take turns asking questions. They are a standard set of questions often used for multiple positions within the company. A former coordinator ended up getting the position.", "Interview Questions": "Tell us about a mistake you made and how you resolved it at one of the work sites you&#039;ve worked over your many years with Southwest."}, {"date": "6 Sept 2013", "title": "Case Manager Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Southwest Behavioral Health Services", "Interview Descriptions": "After submitting the application, I received a call to set up the interview.  Had a basic first interview and I was called shortly after interviewing and got the job.  Everyone was very welcoming and seemed pleased to be there.  I would recommend being professionally dressed and don’t seem like the ‘dry’ candidate.", "Interview Questions": "What is the most difficult thing you have been asked to do to someone else by an employer?"}, {"date": "25 Jun 2013", "title": "Supervisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Southwest Behavioral Health Services (Phoenix, AZ) in Jun 2013", "Interview Descriptions": "Initial phone screening was very courteous and professional with good questions.  In person interview was quite lengthy with numerous repetitive HR related scenarios.  The culture appears to be dress casual but very very pleasant. NIce building, internal offices could use some updating, but this is to be expected for a non-profit.", "Interview Questions": "The HR related scenario questions of dealing with conflict.  Many questions were similar, it was difficult to provide new answers for the same topics."}, {"date": "27 Feb 2016", "title": "Lead Mental Health Clinician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Southwest Behavioral Health Services (Kingman, AZ) in Mar 2013", "Interview Descriptions": "Scripted questions asked by a panel of people you will be working with and a second interview by management. The same questions were asked during both interviews. Questions had more to do with personality than education and experiences.", "Interview Questions": "Tell us about a time when you made a decision and it did not workout the way you had hoped."}, {"date": "22 Aug 2014", "title": "Eligibility Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 6 days. I interviewed at Southwest Behavioral Health Services in Dec 2012", "Interview Descriptions": "This was a 3 person, panel interview using a specific example as an answer. Must describe specific situation, what you did and the result. It took about an hour or more.", "Interview Questions": "Describe a time when you were unethical"}]]