[[{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 5, "review_title": "Wonderful school!", "rating": "4.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "8 Nov 2020", "job_title": "Administrative Staff in Berkeley, CA", "duration": "N/A", "pros": "Rewarding to work with exceptional students, staff, and faculty. Mission-driven, warm, happy work environment. The president of the school provides healthy snacks for the students and staff and prepares traditional Japanese meals during mid-terms and finals. Also, the president is very dedicated to the success of the students and the school.", "cons": "Small non-profit school. Pay is on the low side but still fair."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": 4, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Great School!", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "13 Oct 2020", "job_title": "Anonymous Employee in Emeryville, CA", "duration": "N/A", "pros": "Good memories of going here, not the most organized staff but the most caring people with good hearts. Awesome herbal program, great, old-school education in Classical Chinese Medicine. Also good school for learning Japanese technique.\r\n\r\nThe CEO is awesome, he is always cooking for the students over their exams, finals and midterms. He really cares about the school and the students.", "cons": "Clinic management needs a lot of improvement. Clinic skills are not at all how running your own clinic will be like, not by a long shot. Students should be able to comfortably treat two patients an hour by the time they graduate. The teams they set up in threes always guarantee someone in the team will be losing out on the experience. Teams should be divided up into two students at a time. \r\n\r\nSome of the teachers, I won't name names, are a little eccentric. This takes some getting used to. They're wonderful people overall but some of them have boundary issues.\r\n\r\nThe students in general are great, but the school could do better at weeding out people. Only half of the students graduating pass the licensing exam, many are moving out of state. This is not because the school doesn't do the best job preparing them, but because these particular students don't always have the discipline or lasting passion for the medicine and the craft.\r\n\r\nThe school needs to do better at teaching students adjunct therapies such as cupping, e-stim, and moxibustion. The needle head moxa class that Barbara teaches is great, I wish I had paid better attention to it. So when you get to Barbara's Japanese class please pay attention to it.\r\n\r\nThey also could do a better job with teaching students counseling and communication skills with their patients. They focus too much on political correctness and not enough on how to manage patient care, educate patients on their care, and handle difficult conversations about complaints, grief counseling, etc."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": 0, "Senior Management": "N/A", "review_title": "Instructor", "rating": "3.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "14 Aug 2015", "job_title": "Clinical Instructor in Berkeley, CA", "duration": "N/A", "pros": "Flexible schedule, friendly staff, discounted acupuncture services.", "cons": "Low pay, disorganized.  I only worked here for a semester a long time ago so things have probably changed."}], [], [], []]