[[{"date": "5 Jul 2023", "title": "Therapist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at LifeWorks NW (Portland, OR)", "Interview Descriptions": "It was very casual and conversational and just a way to get to know you as a person and not to grill you. It does seem like they’re understaffed (as is everyone) so I don’t know if that is making the interview process less rigorous.", "Interview Questions": "Tell us your story. What are your thoughts on data? What is your experience with assessments like?"}, {"date": "29 Dec 2021", "title": "Mobile Crisis Clinician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at LifeWorks NW", "Interview Descriptions": "The process included two interviews. One with supervisory staff and a second one with the team. Both conducted via zoom. Staff took turns asking questions pertaining to previous experience. Clarifying follow up questions were asked from time to time. Examples  of experiences from previous jobs were requested.", "Interview Questions": "Have you worked on a team setting in the past?"}, {"date": "31 Aug 2021", "title": "Mental Health Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at LifeWorks NW", "Interview Descriptions": "I think I had a phone interview and then interview with admin and then with other coworkers. It was an easy and comfortable experience.  I heard back from them very quickly.", "Interview Questions": "What is a client that you have difficulty working with?"}, {"date": "30 Jun 2021", "title": "Clinician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at LifeWorks NW", "Interview Descriptions": "When I interviewed with Lifeworks, the first interview was with a supervisor. The first interview focused on if I would be a good candidate for the job. Second interview was with the team. Standard interview questions asked but by many members of the team. The second interview focused on fit within the company.", "Interview Questions": "Experience working with law enforcement?"}, {"date": "18 Nov 2020", "title": "Service Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at LifeWorks NW (Hillsboro, OR)", "Interview Descriptions": "I got a call from the Hiring Manager at first, it was more like a screening type of interview, after that they will let you know if they want you to come to the location for an in person interview. It went great, and I was told that they will let me know by next week at the latest, as to when the final interview will be. Weeks have gone by and I still have not heard anything. Would really appreciate if they gave me a heads up if they will proceed with the final interview or not, because I'd be fine with whatever the outcome was. I just want people to be more communicative to applicants like me, that way guessing games will be avoided.", "Interview Questions": "Have you ever dealt with an upset/irate client? what approach did you take to handle the situation?"}, {"date": "10 Aug 2020", "title": "Mentor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at LifeWorks NW (Portland, OR) in Jan 2020", "Interview Descriptions": "Screenings 1st and second interview. They asked questions back and forth about my lived expirance and how to deal with certin situations. They made it easy as it was all done over zoom.", "Interview Questions": "How to build repore"}, {"date": "10 Feb 2018", "title": "Mh Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at LifeWorks NW", "Interview Descriptions": "Phone interview then in person interview where they had a list of questions about time management, how I work with clients, etc. I also had to do a writing sample. They also had me shadow and tour the clinic.", "Interview Questions": "How do I prioritize competing demands "}, {"date": "21 Jun 2019", "title": "Integrated Care Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 6 weeks. I interviewed at LifeWorks NW (Portland, OR) in Aug 2016", "Interview Descriptions": "I was an internal candidate, having been a Lifeworks employee for a few years before applying to this position. I applied online then emailed a former co-worker who worked at the community partner's organization where I would be stationed if offered the position. The emailed the Lifeworks supervisor to put in a recommendation. I had a phone screen with the supervisor then scheduled to shadow a provider I would be supporting if hired then had an in-person interview with the supervisor and program director.", "Interview Questions": "What is your familiarity with learning how to use a new EMR software?"}, {"date": "14 Nov 2017", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 2 months. I interviewed at LifeWorks NW (Portland, OR) in Nov 2013", "Interview Descriptions": "I met with 3 staff. 2 supervisors and my potential office mate. They were very friendly and obviously got along very well with each other. All 3 took turns asking various questions...in order. It reminded me more of an interview to join a club than a job interview.", "Interview Questions": "What kind of animal would you be if you were an animal?"}, {"date": "24 Oct 2013", "title": "Family Advocate Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. The process took 2 weeks. I interviewed at LifeWorks NW", "Interview Descriptions": "Very informal and easy going.", "Interview Questions": "N/A"}]]