[[{"date": "N/A", "title": "Certified Nursing Assistant CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. I interviewed at Centura Health (Littleton, CO) in Apr 2023", "Interview Descriptions": "it has been going well. everyone has been very helpful. Can't wait to start. Seem like Centura really cares about their employees. The benefits are really good. Am looking for long term. Glad to be onboard.", "Interview Questions": "It was really good i did a voom. Watch i really enjoyed. I had a good time with Lynn .Really did good as to talking to me about the job."}, {"date": "27 Jun 2023", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Centura Health (Denver, CO) in Jun 2023", "Interview Descriptions": "It was quick, easy, and straight forward. The manager called to set up interview shortly after applying online. The interview was conducted in person by the manager for the duration of one hour.", "Interview Questions": "Tell me about yourself. What were some experiences you had with patients that were challenging?"}, {"date": "19 Apr 2023", "title": "Pharmacist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Centura Health", "Interview Descriptions": "The interview was timely and scheduled very soon after my job application was submitted. I had a tour of the hospital and then interviewed with a couple people in the department.", "Interview Questions": "What do you like to do for fun?"}, {"date": "6 Mar 2023", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Centura Health", "Interview Descriptions": "I applied for the job online then a recruiter contacted me 2 weeks later. They put me in contact with several managers. I had only interviewed with one manager and love the floor so that manager made an offer right away", "Interview Questions": "my strengths and weaknesses. My goal for the next 5 years"}, {"date": "10 May 2023", "title": "CNM Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Centura Health (Parker, CO) in Mar 2023", "Interview Descriptions": "Interview process was well organized. The recruiter was helpful and knowledgeable. The entire team was great. I felt very comfortable throughout. The interview process was completed in a timely manner. It was a positive experience!", "Interview Questions": "Explain my background and work history"}, {"date": "17 Feb 2023", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Centura Health in Jan 2023", "Interview Descriptions": "Filled out an application and was contacted within a couple of days. Process was smooth and easy. Was able to ask questions and all were answered. Sent many emails with information about the job and job duties. Good experience.", "Interview Questions": "What intrested me about the job?"}, {"date": "10 Nov 2022", "title": "Mid-level Provider Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Centura Health", "Interview Descriptions": "Super friendly and conversational. I almost forgot I was on an interview - it felt more like networking. I was really impressed and accepted the offer because I really got the feel for how the hiring manager would be as a manager.", "Interview Questions": "What patient-care experience defined your career."}, {"date": "24 Nov 2022", "title": "New Grad Program Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Centura Health in Nov 2022", "Interview Descriptions": "I emailed with the recruiter to set up interview. The interview was with recruiter and manager over Zoom. I received an offer the next morning from the new grad program director.", "Interview Questions": "Tell me about a time you saw a clinical error."}, {"date": "18 Aug 2022", "title": "Assessment Specialist Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Centura Health", "Interview Descriptions": "Phone interview covering work experience. Chronological with general follow up questions.\nWork orientation.\nSoftware skills.\nData analysis and statistical software.\nScope and breadth of projects worked on in past roles.", "Interview Questions": "Salary requirements, commute. Question about handling competing demands."}, {"date": "12 Aug 2022", "title": "Human Resources Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Centura Health (Denver, CO)", "Interview Descriptions": "Recruiter called and asked some general questions- focused on job responsibilities and culture. Moved into a 2-person interview, and then a 5-6 person interview; included a short presentation to deliver", "Interview Questions": "What did you do well when you delivered your presentation? "}], [{"date": "23 Sept 2022", "title": "Patient Service Representative Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Centura Health (Northglenn, CO) in Aug 2022", "Interview Descriptions": "I applied and attended interview twice. Two different location. After those interviews, I was told they’ll decide before the end of the week. None. Never heard from them again. I thought it’s absolutely unprofessional and says a lot about the company’s culture. It would’ve been nice to at least let the candidates know that they were not selected.", "Interview Questions": "Tell me about yourself ?"}, {"date": "26 May 2022", "title": "Digital Marketing Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Centura Health (Denver, CO) in May 2022", "Interview Descriptions": "I applied for the role because it felt like a good fit for my background. When I was asked, I mentioned the writing. I was told it wasn't a writing role.\r\n\r\nFirst thing in the job description: \"communication and writing ability will be integral to success\" \r\n\r\nThe job was misrepresented. The person in the role basically responds to requests on the website to fix updated content and information or posts other people's work. \r\n\r\nWhen I asked why I was considered for the role, I didn't get a straight answer or the obvious one. \r\n\r\nShe just kept rambling about who is on the team providing a big picture but didn't seem to know what the role had.", "Interview Questions": "Why did you apply for this role?"}, {"date": "15 Mar 2022", "title": "HBA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Centura Health", "Interview Descriptions": "My interview was virtual.  It was very laid back but to the point.  My supervisor is the one that interviewed me.  I was currently working for Centura so this was an internal transfer.", "Interview Questions": "Why are you a good fit for this position?"}, {"date": "19 Jan 2022", "title": "Senior Cloud Engineer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Centura Health", "Interview Descriptions": "Friendly.  The team members are very knowledgeable and understanding.  I would apply again.  This was for a Senior Cloud Engineer position.  I do not remember any of the questions, sorry.", "Interview Questions": "N/A"}, {"date": "12 Jan 2022", "title": "Health Information Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Centura Health (Longmont, CO) in Jan 2022", "Interview Descriptions": "My interview with Ms. Fleming was very relaxing and I felt so at ease.  I am excited to come aboard and meet all of the already awesome and talented co-workers that I will have the pleasure of working with.", "Interview Questions": "I was asked about my experience level and how I handled difficult tasks. "}, {"date": "21 Oct 2021", "title": "Certified Nursing Assistant CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 days. I interviewed at Centura Health (Durango, CO) in Oct 2021", "Interview Descriptions": "I never had an interview that I felt so calm in.  She was very understanding and professional. I was happy to accept the invite via Zoom. Took 30 min to answer questions and hear of the learning opportunities I will be experiencing in the near future.", "Interview Questions": "Have I ever worked in a hospital setting before?"}, {"date": "31 Aug 2021", "title": "Patient Access Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Centura Health (Colorado Springs, CO) in Aug 2021", "Interview Descriptions": "Submitted application online and got an initial call 2 days later to discuss the position and was scheduled for a formal interview based on my Resume and experience. Interview was related to the position and lasted about 30 minutes. Questions were fair and I was very confident in my answers. At the conclusion, I was offered to move forward in the process. 2 days later and I was presented with a job offer.", "Interview Questions": "Based on Administrative functions and tasks related to being a patient access representative."}, {"date": "9 Jun 2021", "title": "Patient Access Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Centura Health", "Interview Descriptions": "Good. They get back to you quickly which is nice. Make sure you respond ASAP to not miss an opportunity though. Questions were relevant. Quick interview. Did not waste my time or theirs.", "Interview Questions": "Explain a customer service experience "}, {"date": "24 Apr 2021", "title": "Onboarding Liaison Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Centura Health", "Interview Descriptions": "The first panel interview was professional and provided a positive impression of Centura.  From there, the process fell apart.  A member of the recruiting team sent a text advising of a request for references.  Then an email was received stating references would be requested.  The recruiter advised the name of the third party reference check vendor.  When the email still didn't arrive after a few days, I sent the recruiter an email letting her know.  She never responded.  I completed an interview with the supervisor immediately after this.  She was unprepared and abruptly ended the interview when she realized her 30 minutes expired.  It was a lackluster experience and left me uninterested in pursuing opportunities with Centura.", "Interview Questions": "Why do you want to work at Centura?"}, {"date": "12 Apr 2021", "title": "Athletic Trainer Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Centura Health", "Interview Descriptions": "the turnaround time was very prompt, organized, and streamlined.  HR reached out fairly quick and organized everything between contacts and interview dates. super convenient and very friendly. Interviewed and heard back within 4-5 days on decision", "Interview Questions": "how do you deal with stressful situations"}], [{"date": "5 Apr 2021", "title": "Sourcing Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Centura Health", "Interview Descriptions": "Initial phone interview with hiring manager and then a video conference with the team to better understand the role along with the team dynamic. Questions were asked about personal experience along with situational questions.", "Interview Questions": "Why Centura Health? What do you think will be the most difficult part for you about this role?"}, {"date": "14 Nov 2021", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Centura Health (Colorado Springs, CO) in Apr 2021", "Interview Descriptions": "I spoke to HR on the phone, then the Manager in person. The charge RN who does the scheduling also came in to the interview which was great so I could start scheduling right away.", "Interview Questions": "What is my purpose for working there, what hours I would prefer."}, {"date": "18 Mar 2021", "title": "Cook, SR Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Centura Health", "Interview Descriptions": "Not very intensive. The head chef was friendly and knowledgeable and had many accolades.  Sous chef was amazing and had didn't sit in on the interview process but should have because he does most of the cooking.", "Interview Questions": "What my favorite thing to cook is?"}, {"date": "18 Mar 2021", "title": "New Grad RN Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Centura Health (Denver, CO) in Mar 2021", "Interview Descriptions": "Zoom interview, it was a series of 5 questions and you could prepare before the interview.  The interview was pretty average and I enjoyed it better than in person interviews personally.", "Interview Questions": "What is a difficult situation you have been in?"}, {"date": "10 Mar 2021", "title": "Family Medicine Physician Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Centura Health (Durango, CO) in Feb 2021", "Interview Descriptions": "I had a phone interview and then a clinic site visit. Overall, it was very comfortable and they made sure that all my questions were answered. I felt that I could ask them direct questions and get direct answers", "Interview Questions": "Why do you want to join our practice"}, {"date": "27 Apr 2023", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Centura Health (Denver, CO) in Feb 2021", "Interview Descriptions": "Very easy. Interviewed with manager. Barely asked any usual interview questions. Kind of just got a vibe of my personality. Immediately offered me the job. What kind of experience do you have?", "Interview Questions": "What kind of experience do you have?"}, {"date": "30 Jan 2021", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Centura Health", "Interview Descriptions": "Informal, typical interview questions , Spoke with hiring manager was very thorough but not difficult\nInterview was not stressful\nOn boarding process could have been better\nManagement was friendly and easy to talk to", "Interview Questions": "Elaborate on my experience and background"}, {"date": "28 Dec 2020", "title": "Customer Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. I interviewed at Centura Health", "Interview Descriptions": "It was ok, the process was quick and easy and efficient.. I was satisfied with the overall experience of the interview. It was straight to the point and defined the job responsibilities very well", "Interview Questions": "What reason should we hire you?"}, {"date": "5 Mar 2021", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Centura Health in Dec 2020", "Interview Descriptions": "Applied through the online portal, a recruiter reached out to set up a zoom interview and I received an offer the next day.  Normal interview questions relevant  to the job.", "Interview Questions": "Describe a situation where you went above and beyond what was expected of you."}, {"date": "21 Nov 2020", "title": "Patient Access Representative Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Centura Health", "Interview Descriptions": "The interview was extremely easy. The manager did not ask any difficult questions. The company looks for personable and down to earth people,  As long as you know your résumé like the back of your hand and you’re extremely warm and personable while maintaining a sense of professionalism you will be ok!", "Interview Questions": "How do you prioritize tasks ?"}], [{"date": "21 Jul 2022", "title": "Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Centura Health in Oct 2020", "Interview Descriptions": "The interview process went smoothly. The hiring manager was friendly and accommodated all the questions I had.  She described the job in detail. She mostly asked about my clinical experience as it related to the job.", "Interview Questions": "Describe a time you had a conflict with a coworker. How did you deal with it? "}, {"date": "5 Oct 2020", "title": "New Grad RN Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Centura Health (Denver, CO) in Sept 2020", "Interview Descriptions": "The first interview was a one way video recording where ask a few questions that you submit on line. You get a couple minutes to think of a response and then a couple minutes to answer. You do not get the option to view your submissions.", "Interview Questions": "A time you had to give a patient difficult news?\r\nA time with a difficult Coworker?\r\nA time you went above and beyond?\r\nA time you applied a new skill?\r\nWhy do you want to work for centura?"}, {"date": "27 Aug 2020", "title": "Registered Nurse, BSN Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Centura Health", "Interview Descriptions": "Video/One-way interview\r\nVery straightforward questions.  The process was a little difficult to get used to at first.  It feels like a theater audition almost.   I felt like I had trouble concentrating on the screen when there is no-one there to actually talk to.", "Interview Questions": "Why did you want to become a nurse?"}, {"date": "30 Aug 2020", "title": "RN New Grad Residency Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Centura Health (Denver, CO) in Aug 2020", "Interview Descriptions": "Very strange being a one way video interview, not having a panel of people to actually talk to and having to accurately represent yourself without hearing and responding to feedback during the process was very strange. Only 6 questions with a three minute response time for each.", "Interview Questions": "Why did you select the units you applied to?"}, {"date": "7 Apr 2022", "title": "Covid Screener Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Centura Health (Denver, CO) in Jul 2020", "Interview Descriptions": "Easy interview process over the phone. Straight to the point and answered all my questions quickly. It was a temporary entry-level position but they still tried to make the position a good fit for me", "Interview Questions": "What schedule works best for you?"}, {"date": "14 Jun 2020", "title": "Nurse Residency Program Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Centura Health in May 2020", "Interview Descriptions": "I applied online and got an email a few days later from a nurse recruiter about scheduling a phone interview.  I interview the following week with the unit manager.  Interview was over the phone due to COVID and was told this was there would be no in person interviews.  Interview was 30 minutes with no unexpected questions.", "Interview Questions": "A time you noticed a break in protocol or a safety issue"}, {"date": "21 May 2020", "title": "New Grad Registered Nurse Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Centura Health (Castle Rock, CO) in Apr 2020", "Interview Descriptions": "Applied online. Was contacted by a recruiter via email and asked to send over some availability to interview in upcoming days. Scheduled phone call interview with nursing manager of the unit. Phone call lasted 15-30 minutes.", "Interview Questions": "Tell me about a time when you dealt with a difficult coworker"}, {"date": "11 Sept 2020", "title": "Medical Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Centura Health (Denver, CO) in Mar 2020", "Interview Descriptions": "The interview was over Zoom and asked pretty typical interview questions. There wasn’t anything that really caught me off guard. There were 5 other people interviewing me and they didn’t show their faces.", "Interview Questions": "Why do you want to work at the clinic?"}, {"date": "28 Dec 2020", "title": "Program Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Centura Health (Denver, CO) in Oct 2019", "Interview Descriptions": "I was first contacted by HR for a phone interview, then a week later set up a phone interview with Director. Third and final interview was a group interview with eight member panel.", "Interview Questions": "How do you deal with difficult patients?"}, {"date": "13 Sept 2019", "title": "Clinical Nutrition Assistant Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Centura Health", "Interview Descriptions": "First you are contacted via email to set up a date and time for a phone interview. If that goes well your resume and cover letter are submitted to the hiring manager. If you're contacted by the hiring manager you will go in for an in-person interview.", "Interview Questions": "Why are you applying for this position?"}], [{"date": "27 Aug 2019", "title": "Physical Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Centura Health", "Interview Descriptions": "Pretty laid back but very drawn out; took a long time. They require a drug test only at there facilities with 36 hours but have very limited availability. Friendly managers though.", "Interview Questions": "Describe a moment you went above and beyond for a patient?"}, {"date": "3 Jan 2020", "title": "People and Culture Development Advisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Centura Health (Denver, CO) in Aug 2019", "Interview Descriptions": "I applied for a role whose scope includes improving Centura’s leadership and culture - a role I was told was important to the organization. I came in for multiple individual and team interviews and delivered a presentation. The interviews and my presentation seemed to go extremely well, with clear resonance. \r\n\r\nAt the end of the interviews, the hiring manager told me that I was one of the finalists for the role, and I would hear within a week or two about a decision. \r\n\r\nNot only did I not hear anything over the proceeding 3+ months, I was never pro-actively communicated to once in that time, by the hiring manager or the recruiting team. The only way I have gotten any information was by emailing them, multiple times with few replies. When they did respond, I was continually pushed off in those communications, with minimal information provided.\r\n\r\nI am fine with not having gotten an offer - that is the way of the job market. But to not be given any communication, any updates, with me being a finalist and for a high-value role (really for any professional role), is inexcusable. It is outlier behavior in the job market for professional roles such as this. It has given me a terrible candidate experience, and is particularly surprising given Centura’s mission of “nurturing communities” and values including “compassion, integrity, and respect”.  In fact, my interview presentation included my alignment with that mission and values, and it is incredibly disappointing that Centura is not living up to these (and more). \r\n\r\nAnother “highlight”: I was required to provide 4 people as references during the process, and those people took time out of their day to do fill out the lengthy reference tool - at 30 questions,  lengthier than any they had every seen. It was a big favor they did for me. And, apparently I was not in fact close to an offer, so that favor and these people’s time were for naught. It is a standard in the talent acquisition field for references to only be checked at the end of a hiring process, near an offer. That is the practice for this very reason in point: to not give candidates unnecessary hoops to jump through, and give them a poor candidate experience. Which this has most definitely been.", "Interview Questions": "Ranged from questions about my OD and coaching styles, behavioral interview questions, and a number of questions asking me to be very vulnerable about thoughts and emotions."}, {"date": "30 Mar 2020", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Centura Health (Colorado Springs, CO) in May 2019", "Interview Descriptions": "Great interview process, very personable. They really care about what you are looking for in a job. Other staff was very helpful in learning new skills and over all unit was clean and organized.", "Interview Questions": "My goals and values. My personal and education goals"}, {"date": "23 Apr 2019", "title": "Executive Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Centura Health", "Interview Descriptions": "First step was a 30 minute phone screen with a recruiter. They asked questions about my resume and work experience. I had applied for two open positions, and the recruiter scheduled an in-person interview with the hiring managers.  The first one, I interviewed 1:1 with the executive the role would be supporting. Lots of behavioral based questions. The interviewer was unprofessional. He made comments about how the person he'd interviewed before me had given such a bad answer to one of the questions and went on about it. He also mentioned that some of the executive assistants in the office really like to gossip. Ironic since he also kept emphasizing what a Christian and mission-driven organization Centura is. The second interview, the recruiter called me 30 minutes before I was supposed to leave and said the executive had an emergency come up, which was a lie. I received an email later saying that they'd filled the position. Shady interview practices overall.", "Interview Questions": "How do you finesse an answer to a question you don't know?"}, {"date": "28 Mar 2019", "title": "CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at Centura Health (Lakewood, CO) in Mar 2019", "Interview Descriptions": "Went to a cna interview fair. The questions were fairly easy and didn't have to prepare for them. The manager was very nice, I was able to be myself. Asked a lot of what if and scenario questions.", "Interview Questions": "What is a time where you had an emergency and how did you act?"}, {"date": "5 Dec 2019", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Centura Health (Denver, CO) in Feb 2019", "Interview Descriptions": "Very easy going, was interview it was very casual and helped me understand the role more so. They both seems extremely excited about the position and asked normal behavioral interview questions", "Interview Questions": "How would you resolve a problem among a team memeber "}, {"date": "19 Jan 2019", "title": "ICU RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Centura Health (Colorado Springs, CO)", "Interview Descriptions": "45 minute interview, mostly situational stuff (tell me about a time you had a disagreement with a coworker, you sensed a patient was going downhill, etc). One interview with managers then was called that week with an offer.", "Interview Questions": "Describe a time you sensed a patient was going downhill and intervened "}, {"date": "1 Feb 2019", "title": "Certified Nursing Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Centura Health in Jan 2019", "Interview Descriptions": "Applied through Centura Health website. Followed by an emailed assessment and they called me about two weeks later with an in person interview. After I arrived a nurse gave me a tour of the unit and then I had my interview is the nurse manager. The main thing that I thought was strange was after the interview was complete she told me that they didn’t have an open position available? I was very confused because the position I applied for had become available only a few weeks before but she asked me back for a second interview anyways to have my information on file as soon as a position opened up.", "Interview Questions": "Tell me about a time you failed someone and how you fixed your mistake?"}, {"date": "9 Sept 2020", "title": "Network Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Centura Health (Denver, CO) in Jan 2019", "Interview Descriptions": "I was called by a recruiter. The interview was a meeting with my current manager and lead. We discussed what I had worked on before. Protocols I knew, Network technologies I had worked on.", "Interview Questions": "Explain what other networks you have worked on?"}], [{"date": "17 Dec 2018", "title": "Director Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 7 months. I interviewed at Centura Health (Denver, CO)", "Interview Descriptions": "I interviewed with over 20 people within a 6-7 month period.   The process was incredibly frustrating with very litte communication.  I felt like I was inconveniencing them for interviewing me.  They also gave me a personality assessment that they refused to give me the results of.  I regret ever applying for the role.", "Interview Questions": "Do you align with our mission that we serve Christ?"}, {"date": "5 Jan 2022", "title": "Patient Service Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Centura Health (Denver, CO) in Nov 2018", "Interview Descriptions": "Lots of Behavioral Interview Questions. Be sure to brush up on remembering stories, results, outcomes.  Also when you arrive to your interview, dress professionally and be polite to the front desk staff. Managers always ask front desk staff their thoughts on job candidates.", "Interview Questions": "Tell me about a time you had a difficult coworker and how did you over come your differences?"}, {"date": "13 Jan 2019", "title": "Business Systems Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Centura Health (New York, NY) in Nov 2018", "Interview Descriptions": "I had 1 recruiter interview 3 weeks after applying. She asked basic questions about my current job. The next week I had 2 other interviews. With the hiring manager and my future team. They use a behavioral style of interview. I googled that method to prepare. In the 2nd interview with the hiring team they asked more personal and easy-going questions to get to know me. A few hours later they asked for references. I made sure all my references completed their survey the next morning and 2-3 days later they called with an offer. I was able to negotiate salary.", "Interview Questions": "Tell us about a time when you..."}, {"date": "29 Oct 2018", "title": "Executive Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 3 days. I interviewed at Centura Health (Denver, CO) in Oct 2018", "Interview Descriptions": "It was a video chat interview. Sort of unorthodox but a great experience. Its nice to see who you're chatting with instead of just a phone screening. The interview was thorough and at the end of it I felt like all my questions were answered.", "Interview Questions": "He asked about my past experience with budgeting spreadsheets and my level of comfort with other executive assistants. "}, {"date": "28 Feb 2021", "title": "Integrated Behavioral Health Clinician-LCSW Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Centura Health (Castle Rock, CO) in Aug 2018", "Interview Descriptions": "Was quickly contacted by HR, met with manager, moved to panel interview and came in to meet the clinic team and then received my offer. The hiring team remained available for questions throughout the process.", "Interview Questions": "Why I was interested in the position. "}, {"date": "7 Nov 2022", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Centura Health (Colorado Springs, CO) in Aug 2018", "Interview Descriptions": "Fast and easy. They make sure you qualify for the medical assistant position. They do three interviews. Very honest and straightforward, they make salary expectations very transparent. I would work there again if the opportunity comes.", "Interview Questions": "What is your biggest inspiration to help people?"}, {"date": "29 Aug 2018", "title": "Gen-Surg RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Centura Health (Littleton, CO) in Aug 2018", "Interview Descriptions": "First was a phone interview with the talent recruiter then after a week, was called to set up an in person interview at the institution site with the manager, once it was set up,  showed up at the designated address/time and meet with the interviewers, before/after the interview, RN manager showed me around and meet other personnel working in the unit, then after that, was called again to set up another interview with their  Manager of Clinical Nursing and after that interview,  was offered the job  6  days later. The vibe I got during the interview process and meeting the interviewers as well as the talent recruiter was all positive,  all are very professional .", "Interview Questions": "Tell me about your Nursing journey/career?"}, {"date": "24 Jul 2018", "title": "Information Technology Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. I interviewed at Centura Health", "Interview Descriptions": "You will only interview with the team that your position is with. The cats you wind up working with daily are cool. There's just too much institutional idiocy for you to stay here long.", "Interview Questions": "Mostly technical stuff"}, {"date": "9 Apr 2019", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 days. I interviewed at Centura Health (Denver, CO) in May 2018", "Interview Descriptions": "Very brief and concise. Everything related to your resume and some SQL functions . Know everything about your resume skills. Make sure you are well dressed in a suit.", "Interview Questions": "SQL Questions"}, {"date": "8 May 2018", "title": "Health Information Services Clerk Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Centura Health (Denver, CO) in Apr 2018", "Interview Descriptions": "Behavioral interview- what did you do when...? How did you...? Are you a team player? Are you a visual or audio learner? Are you analytical or procedural? Do you work better independently or in a group?", "Interview Questions": "How do you act/react?"}], [{"date": "12 Dec 2018", "title": "Social Work Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Centura Health (Denver, CO) in Apr 2018", "Interview Descriptions": "I applied online and recieved an e-mail requesting phone interview 7 days later. I applied for the transplant social work posisiton. I recieved an e-mail which asked that I select three possible dates and times that I can be reached to conduct the over the phone interview. I was asked to review the Centura Health interview page to help prepare for the interview.", "Interview Questions": "I was asked about my strengths and weaknesses"}, {"date": "31 May 2018", "title": "Executive Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Centura Health (Colorado Springs, CO) in Feb 2018", "Interview Descriptions": "Easy application process.  Interview was via telephone, then in person. Interview was comfortable, no tough questions.  The position was exactly the same as my previous employer, so I found the interview easy.", "Interview Questions": "There were no difficult questions."}, {"date": "27 Aug 2019", "title": "Rehab Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Centura Health (Colorado Springs, CO) in Feb 2018", "Interview Descriptions": "Interview was relaxed and I was made to feel very comfortable and could be myself and think clearly. Interviewer did most of the talking and then had me answer questions. Went over a clinic scenario, the job description, hours, salary and benefits. Ended with a job offer on the spot.", "Interview Questions": "Why do you want to work here? "}, {"date": "8 Aug 2019", "title": "Patient Service Representative Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Centura Health (Colorado Springs, CO) in Feb 2018", "Interview Descriptions": "asked the following information: how long have I lived in the area...what can I bring to the company..how fast can I type...do I know how to use a fax machine...do I have a problem cleaning patient spills....can I lift over 50 pounds...can I concentrate on the phone and type while asking patients questions", "Interview Questions": "what can you add to this company"}, {"date": "9 Jan 2018", "title": "Diagnostic Medical Sonographer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Centura Health", "Interview Descriptions": "Applied fort he position early December was contacted for an interview within 3 weeks, had the interview a week later and received an offer within a week. I applied around the holidays so that is why the process took a little longer.", "Interview Questions": "Describe a time when there was a difficult situation and you helped, what was the situation and what was the outcome?"}, {"date": "21 Mar 2018", "title": "Management Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Centura Health (Garden City, KS) in Jan 2018", "Interview Descriptions": "Timely and efficient. Professional and conscientious. Very well done from start to finish. The individuals that were involved provided details that were pertinent to the position, and that afforded me the opportunity to make an informed decision.", "Interview Questions": "Personal goals and what did I bring to the organization"}, {"date": "15 Feb 2022", "title": "Phlebotomist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Centura Health in Jan 2018", "Interview Descriptions": "One one or potentially a group interview of 2 or more people. More than 2 interviewers is not as common. Smaller interviews are usually more personality focused and become more scenario based with more interviewers. Generally, they want to see if your thought process is logical, even tempered, and accommodating.", "Interview Questions": "If you have 3 stats, 2 routines, 1 timed, and an outpatient lab what would your approach be to collecting them?"}, {"date": "24 Nov 2018", "title": "Supply Chain Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Centura Health (Lakewood, CO) in Jan 2018", "Interview Descriptions": "I had a phone with the hiring manager, and then had a somewhat informal panel event with the rest of the team members. The interview was very informal on both settings but obviously they expect the professionalism.", "Interview Questions": "Run through my resume"}, {"date": "22 Nov 2019", "title": "Recruiter Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Centura Health (Colorado Springs, CO) in Jan 2018", "Interview Descriptions": "very easy process they paid for my flight from new york to colorado and covered a rental car and hotel just for an interview they also gave me a meal stipend for food.", "Interview Questions": "awesome"}, {"date": "16 Feb 2018", "title": "RN Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Centura Health (Colorado Springs, CO) in Dec 2017", "Interview Descriptions": "Brief phone interview, followed by interview with hiring director. I did not hear back after two weeks. I called and was told they were interviewing internal candidates. After a month, I received a very nice email, stating the position was no longer open to fill.", "Interview Questions": "Describe a situation when I had a conflict with a co-worker and how did I resolve it."}], [{"date": "18 Oct 2017", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Centura Health in Oct 2017", "Interview Descriptions": "The hiring process for Centura always seemed to me to take longer than others for nursing. With the application, you get a call from a recruiter, who then sends you a survey with five required emails for references that you have to input.  Once those went through, they flipped it to the floor mamager, I scheduled an interview, and I was interviewed by two supervisors and a charge RN. After that, the recruiter called back with the offer. Total process was about 2.5 weeks, which isn't bad, just tedious, especially trying to find email references when most references don't use emails, and if you're looking to relocate to the position.", "Interview Questions": "Name a time when you had to make a difficult decision and how or why would you change the outcome?"}, {"date": "5 Sept 2017", "title": "Registered Nurse Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 3 weeks. I interviewed at Centura Health (Colorado Springs, CO) in Aug 2017", "Interview Descriptions": "I applied online through Centura Health website. Within two weeks I received a call from the hiring manager for an interview. \nWhen I arrived I was greeted by the hiring manager who asked simple get to know me questions. What I previously did, why I'm interested in that floor, etc. She explained a lot about the floor and how they do things, their policies, sick time, vacation, hours, schedule, patient to nurse ratio, acuity levels, etc.. and asked if I was still interested.\nFollowing speaking with her, I had an interview with two floor hurses. This was a little more nerve racking. They took turns asking me behavioral type questions. \nFollowing the interview I was told they would be in touch after the weekend.", "Interview Questions": "Tell me about a time when you had a conflict with a CoWorker. \nTell me about a time when you had to delegate a difficult task to a CoWorker. \nWhat do you consider your weaknesses and strengths?"}, {"date": "27 Jul 2017", "title": "Executive Assistant/Supervisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Centura Health (Lakewood, CO) in Jul 2017", "Interview Descriptions": "There was no description of the expectations of the job.  A lot of \"fluff\" questions asked that I didn't feel were relevant to the position.  One HR representative had not read my resume prior to the meeting and was highlighting key words on the resume throughout the meeting.", "Interview Questions": "Describe an error that you've made in the past and how you handled it."}, {"date": "12 Jul 2019", "title": "Provider Relations Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Centura Health (Denver, CO) in Jun 2017", "Interview Descriptions": "Very thorough interview where I connected with marketing, communication, business development and senior leadership. The staff brought different perspectives to the table regarding their positions and how we would partner.  Senior leadership talked about the culture of the organization and how important my role would be and how it would impact the hospital.", "Interview Questions": "How did I handle a difficult personality and their push back regarding the organization I was working for at the time?"}, {"date": "14 Oct 2017", "title": "Student Nurse Extern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Centura Health (Pueblo, CO) in Mar 2017", "Interview Descriptions": "I got a call from the recruiter that I was being considered for the hob and I would hear from her again to schedule an interview. I waited and didn't hear back after two weeks, so I emailed the recruiter that I was still interested n the job and was eager to hear back from her.  Another week went by before I heard from the manager to come in for a job interview. When I arrived for my interview, I met with the manager and she asked me several questions, mostly about my experience as a nursing student. She was very easy to talk to and I could tell she was passionate about the hospital. After the interview,  I told her I was excited about the potential to work at the hospital and she replied that she sees no reason that I wouldn't be hired. I received a call a few days later with a job offer and instructions to complete preemployment paperwork. I started working soon after.", "Interview Questions": "What was one time while you were in clinical that you were challenged and what did you do?\r\n"}, {"date": "20 Apr 2017", "title": "Medical Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Centura Health (Denver, CO) in Feb 2017", "Interview Descriptions": "Great interview very friendly. The lab is beautiful. All brand new instrumentation. I would suggest more people to apply to CENTURA health. The people who work there are great. Management is just lovely.", "Interview Questions": "What is your availability "}, {"date": "1 Feb 2017", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Centura Health (Colorado Springs, CO)", "Interview Descriptions": "Situation/behavioral questions, telephone interview, skype interview followed by panel interview in person. job offer sent, no negotiation. job accepted. drug screen, nicotine screen, physical, lifting, and blood work submitted prior to finalizing acceptance.", "Interview Questions": "Tell us a time you demonstrated the ability to work as a team player."}, {"date": "25 Jun 2017", "title": "Rehab Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Centura Health (Milwaukee, WI) in Jan 2017", "Interview Descriptions": "I applied out of state and it was done over the phone. Initially contacted by a recruiter via email then telephone describing duties. Next had a phone interview with the clinic director and head physical therapist via telephone", "Interview Questions": "Name one situation where you had to deal with multiple tasks at once"}], [{"date": "28 Jan 2017", "title": "Social Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Centura Health (Colorado Springs, CO) in Dec 2016", "Interview Descriptions": "1st interview: It was really more of a conversation with hiring Supervisor and very relaxed. 2nd interview: panel of 4 people...still more conversational but a little more formal.  They all asked questions. Met the rest of the team and took a tour. Overall experience was relaxed.", "Interview Questions": "Why do you want to work here?"}, {"date": "14 Nov 2017", "title": "SPD Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 8 weeks. I interviewed at Centura Health in Oct 2016", "Interview Descriptions": "I was late for my interview ,but the manager was so nice and gave me an opportunity. I didn't have past experience for this position, but this company is so open-minded that it didn't matter. The process was nice .I wasn't nervous ,I felt as if I were talking to people I have known. We laughed as well!", "Interview Questions": "What made you interested in this position?"}, {"date": "25 Jul 2017", "title": "Referral Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Centura Health (Denver, CO) in Oct 2016", "Interview Descriptions": "Phone and in person interview.  Background checks and reference checks take a while.  Took 4 weeks to get on board.  Orientation was nicely organized.  You are required to get a flu vaccine.", "Interview Questions": "What would my previous employers say about me?"}, {"date": "21 Sept 2016", "title": "OFFICE SPECIALIST Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Centura Health (Longmont, CO) in Aug 2016", "Interview Descriptions": "This was an initial phone screening. It was very straightforward, I was told I was going to move on to the next step in the hiring process but that first I had to give them 5 references.", "Interview Questions": "They asked me to go through and describe each job listed on my resume."}, {"date": "27 Jul 2016", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at Centura Health", "Interview Descriptions": "Motivational interviewing - so you basically telling a story for each question you are asked. This can be difficult for some people. Interviews are about 1 hour long for most positions and typically a single interview with multiple interviewees.", "Interview Questions": "You will be ask to 'give an example' for each question - tell the situation, what transpired and the outcome."}, {"date": "13 Jul 2016", "title": "Behavioral Health Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Centura Health (Denver, CO)", "Interview Descriptions": "I met once with a hiring manager and once with a group from the governing council. They did their best to make me feel comfortable and were charming and accommodating. They had good senses of humor.", "Interview Questions": "If someone came in who you clearly knew was not taking their bipolar meds, what would you do in therapy?"}, {"date": "3 Jul 2016", "title": "Program Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Centura Health", "Interview Descriptions": "The interview process was fairly straightforward. It was a group interview setting. The process of actually getting hired was quite lengthy and took a couple of months for me to become an actual Centura Health employee, even though I started work as soon as I got the job offer.", "Interview Questions": "Interview questions were standard- it was more of a conversation then an interview"}, {"date": "26 Jun 2016", "title": "CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Centura Health (Denver, CO)", "Interview Descriptions": "In was very in depth.they asked questions about what you would do in certain scenarios. Also ask about what feel about certain aspects of the job your applying for. They let you know what they require of and if you feel like you can do it. They let you know right then if you have the job and what rest of hiring process is. Must pass a background check and drug test. Also submit references and those references must be good. You have 48 hours to have the references completed. If everything comes back good you are officially hired.", "Interview Questions": "What qualities are important to have working on the floor with other cnas and rns? And why?"}], [{"date": "22 Jun 2016", "title": "Paramedic Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Centura Health (Denver, CO)", "Interview Descriptions": "To the point, good interview.  Standard questions, but more personalized.  Not a lot of prep was needed for this interview.  Not a lot of fluff or silly questions.", "Interview Questions": "What do I think a Paramedic added to the ER"}, {"date": "1 Aug 2016", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Centura Health (Centennial, CO) in Jun 2016", "Interview Descriptions": "I applied for the intern position online and a couple days later received an email for a recruiter to contact me for a phone interview. The phone interview was pretty easy, all they asked was why I wanted to work there and questions based around the position. From there, the recruiter set up an interview with the hiring manager a for the position. \r\n\r\nThe issue with this job is that the description and length of employment was never consistent. One person would say it was temporary and not for during the school year, another person would say the exact opposite.", "Interview Questions": "Are you familiar with the following financial terms?"}, {"date": "31 May 2016", "title": "Health Information Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 5 days. I interviewed at Centura Health (Denver, CO)", "Interview Descriptions": "Very generic. Very few questions. Done in less than 10 minutes. Only verified my recent information and asked a few questions about my experience with records management and working with  an Alzheimer's unit.", "Interview Questions": "Why are you leaving your current job?\r\nWhat is your experience in records management?"}, {"date": "24 May 2017", "title": "OFFICE SPECIALIST Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Centura Health (Denver, CO) in Jun 2016", "Interview Descriptions": "Initial phone interview with recruiter, did initial screening and asked basic behavioral based questions, only took about 10 minutes. Then in-person interview with supervisor, more in depth behavioral based questions, this took about 30 minutes.", "Interview Questions": "Describe a time when you had to solve a problem."}, {"date": "28 Mar 2017", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 1 day. I interviewed at Centura Health (Englewood, CO) in May 2016", "Interview Descriptions": "Sent resume to hiring agency and they then coordinated with the company's recruitment department to schedule an interview. I then interviewed with an HR person, the Manager, and the current employee in the prospective position. The Interview lasted about 30 minutes.", "Interview Questions": "What are your best skills"}, {"date": "21 Apr 2017", "title": "Value Optimization Facilitator Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Centura Health in May 2016", "Interview Descriptions": "A screening interview was done by HR and one done by the hiring manager at the hospital.  There was a bit of a disconnect from what the corporate office told me and what the hiring manager stated.  This caused some red flags for me and I withdrew my application.", "Interview Questions": "They went in depth with projects I facilitated and wanted to know measurable outcomes for improvement."}, {"date": "24 Apr 2016", "title": "Office Specialist II Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Centura Health", "Interview Descriptions": "A recruiter calls you for a preliminary interview and then sends your information to the hiring manager. Before a hiring manager can even contact you , you have to fill out a form allowing 5 , thats right 5 references to be contacted via email. What a complete waste of time. I went to the interview for a PRN position  where no hours would be guaranteed  . They expected complete flexibility and couldn't say how many hours they actually needed someone for. After completing the interview over a month and a half ago I received  a generic rejection email . What a waste of time especially since they contacted my references without me even being offered the job. Which just bothers your references who think you are in the running for an actual job, instead it is just there standard hiring practice. I won't be applying for this company again. The pay is very low starting at $14.00 no matter your experience or education level and they are unwilling to negotiate.", "Interview Questions": "Just a bunch of behavioral questions. Seem really focused on team player . If you don't fit the stereotype of the office you probably won't be offered a job. For example, I am biracial and I interviewed in an office filled with middle age white  females , who looked very similar ( blonde hair and tans). I could tell from the moment I stepped into the office I wouldn't be considered for the job. Despite having experience and a degree in health care."}, {"date": "21 Feb 2016", "title": "Resource Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Centura Health (Denver, CO) in Feb 2016", "Interview Descriptions": "Called by recruiter, had phone interview, had face to face. Had bad interviewers and possibly too old for job (53 years old). Per the Workforce Centers the average age of employees in Denver is around 33 years old, due to the invasion of millennials (legal pot). Employers are more likely to hire these kids, even though there are less dependable. My suggestion is to ask the recruiter for the average age in the particular office you are applying in, if you are over 40 years of age. I'm sure this company didn't age discriminate against me, but it's just the way it is in Denver at this current time. If you are a  millennial, there is probably a place for you here, just remember to get your flu shot first.", "Interview Questions": "Behavioral Interview Questions  Examples on You Tube"}, {"date": "4 Dec 2015", "title": "Infection Preventionist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Centura Health in Dec 2015", "Interview Descriptions": "45 minute scheduled interview with the IP manager and other recently hired IP/RN. Interview lasted a total of 75 minutes. \r\n\r\nWas told there are four other candidates and those selected to move forward would have a panel interview with Directors from other departments (like ED). Manager also gave away that there was at least one individual who flew in -- begs the question why locals aren't being considered as the job market in Southern Colorado is pretty bad and there are qualified individuals within the city. No need to bring in out-of-city/state individuals when you would have to provide site specific training anyway. \r\n\r\nSeems as though they already had made up their mind and pre-selected an individual so the interview was a formality to say they interviewed other equally if not more qualified candidates but had already made up their mind. Would have preferred they canceled if that were the case and not wasted my time.", "Interview Questions": "Lots of people-related skill questions like \"tell us about a time when...\""}], [{"date": "2 Jan 2017", "title": "Patient Account Representative Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Centura Health (Centennial, CO) in Nov 2015", "Interview Descriptions": "The interview was with a panel of three supervisors.  It wasn't any different than the standard interviews I have been in throughout my entire life.  They say they use the \"Star\" system or interviewing but I didn't find their questions any different than those I was asked 30+ years ago.", "Interview Questions": "Give an example of time when you gave good Customer Service."}, {"date": "15 Oct 2015", "title": "RN Clinic Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Centura Health", "Interview Descriptions": "lengthy process. close to 2 months before an offer was made. applied online and received a call from the general recruiter from the corporate office. passed the initial interview and later heard from the department director. interviewed with the director and manager of the department. it took a few weeks before i received an offer from that point.", "Interview Questions": "standard interview questions. behavioral based including questions relating to \"how did you handle _____? What did you do ____?"}, {"date": "14 Aug 2016", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Centura Health (Denver, CO) in Sept 2015", "Interview Descriptions": "Pretty straightforward. They are interested in your education and your goals.  If they see a good fit, they will hire you on as an intern. There was a panel with corporate office people, than a separate interview with the direct supervisor.  At the very end there was a phone call just to find out mutual interests.", "Interview Questions": "What are your skills, what you think will support Centura the most?\r\nWhat do you like in your studies?\r\nWhat are you passionate about?"}, {"date": "31 Aug 2015", "title": "Surgical Support Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Centura Health", "Interview Descriptions": "A recruiter emailed me saying they wanted to do a phone interview. Called me a week later for the phone pre-screen. Lasted about 40 minutes long. Was very polite said my resume was going to be sent over to the direct manager of that team where I would be contacted later", "Interview Questions": "Was there a time that someone needed help or where there was a difficult task? what did I do?  what was the outcome?"}, {"date": "12 Jan 2017", "title": "Marketing Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at Centura Health (Pueblo, CO) in Sept 2015", "Interview Descriptions": "The hiring process was simple and seamless. It made me excited to begin working at St. Mary-Corwin Medical Center and all onboarding steps were done easily and quickly. It was very professional and exciting and the interview made me feel much more confident in my skills.", "Interview Questions": "I was asked how I could positively contribute to the team at St. Mary-Corwin. "}, {"date": "31 Aug 2015", "title": "Patient Account Representative Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Centura Health (Centennial, CO) in Jun 2015", "Interview Descriptions": "I rcvd a phones interview.  Had 2 in person panel group interview and it took  6 weeks to get a call back that they went with an internal  candidate", "Interview Questions": "Tell me about yourself? "}, {"date": "19 Jun 2015", "title": "Executive Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Centura Health (Denver, CO) in May 2015", "Interview Descriptions": "Great phone interview, was supposed to hear back and never did. I find it looks extremely bad on a company to not have an HR follow up after an interview. Even after and additional email from me.  Not everyone gets every job for a variety of reasons, if your HR/Recruiting department doesn't have the ability to address people that's probably a bad sign on the company itself. I definitely wouldn't interview with them again because of it.", "Interview Questions": "Basic"}, {"date": "22 Sept 2016", "title": "Human Resources Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 4 weeks. I interviewed at Centura Health (Denver, CO) in May 2015", "Interview Descriptions": "I applied, had a brief phone interview and then an in-person interview 2 weeks later. Phone call appeared to only be for gauging interest in the position. In-person interview asked very general interview questions, I wasn't well prepared at all but was completely capable of answering the questions as they required no specific technical knowledge. Overall, very easy interview process and although my interview wasn't the best, it must've been better then the other applicants.", "Interview Questions": "Talk about a time you had difficulties working on a team"}], [{"date": "12 Sept 2016", "title": "Cleaner Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Centura Health (Pueblo, CO) in Apr 2015", "Interview Descriptions": "Was met in the lobby and escorted to the cafe. Was asked standard questions and was given ample opportunity to ask questions. I was asked at least 20 questions, we talked about the technologies they use at the Hospital and about my education and how it pertained to the technologies the hospital used. A random guy interrupted the interview to talk to the person I was interviewing with and they chatted for a few seconds and he wandered off. That was kind of weird to have a random person stop the interview just to chat with the interviewer. I did not get to give him my resume because he already had a copy from the online application.", "Interview Questions": "What would I do if fellow employees asked me to not do my job because they said it was fine and sit and have a break?"}, {"date": "13 Apr 2015", "title": "Management/Supervisor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Centura Health (Denver, CO) in Mar 2015", "Interview Descriptions": "I applied on line via the Centura Health website. I was contact the following week by a Centura Health Recruiter via email requesting a phone interview. Immediately I received a calendar request to schedule. The calendar gave me many options. I chose the following week. The recruiter called me at the appropriate time. The Centura Recruiter was very nice and very professional. The interview lasted approximately 30 minutes. She gave me a very good idea about the length of time for the process, information about the Centura location and the department of which I was interviewing. It was a positive experience. (I would like to say I was not hired for this exact position but am in the interviewing process for another management position. I have many good things about Centura Health and am hoping this works out for both Centura and I.)", "Interview Questions": "What is your management style?\r\nHow do you handle conflict?"}, {"date": "30 Sept 2018", "title": "Medical Office Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Centura Health (Denver, CO) in Mar 2015", "Interview Descriptions": "Interview is very standard. Mostly behavioral questions. Tips for STAR type of questions is to describe the situation, then action, and result of the situation you are describing. One of the questions I had was \"Tell me about conflict situation you had, and how you resolved it?\"", "Interview Questions": "Tell me about conflict situation you had, and how you resolved it?\r\n"}, {"date": "24 Apr 2015", "title": "Clinical Supervisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Centura Health (Littleton, CO) in Jan 2015", "Interview Descriptions": "Behavioral interviewing, comfortable atmosphere, understanding, looking for specific examples of past experience relative to management experience, team work, conflict management, stress management, time management, ability to multi-task, EHR experience etc.", "Interview Questions": "Tell me about a time you encountered significant change, how did you handle it?"}, {"date": "4 Dec 2014", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. The process took 3 days. I interviewed at Centura Health", "Interview Descriptions": "Applied online through Centura's job site. Got a call the next day from the assistant manager for an interview and came in the following day for it. Interviewed with the manager and assistant manager. Lots of behavioral-based questions (as I'm sure is in any interview for an RN position). Whole interview took about 20-30 minutes.", "Interview Questions": "Why should we hire you over someone else?"}, {"date": "12 Jan 2016", "title": "Emergency RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Centura Health (Canon, CO) in Dec 2014", "Interview Descriptions": "Face to face group interview then at phone call that day asking if I want the position. I was a transfer from another hospital so it was not a big deal but still had to interview for the position", "Interview Questions": "How many days have you called off in the past year"}, {"date": "9 Sept 2016", "title": "Supervisor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Centura Health (Denver, CO) in Jul 2014", "Interview Descriptions": "I met a C-level executive at a restaurant one evening and we struck up a conversation about our careers. He encouraged me to apply online and forwarded my contact information on to the hiring manager. I interviewed once on the phone with a recruiter and twice with my direct manager before an offer was made.", "Interview Questions": "Tell me about a time you had to deal with a difficult customer. How did you handle the situation?"}, {"date": "2 Dec 2016", "title": "Business Support IV Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 3 weeks. I interviewed at Centura Health (Colorado Springs, CO) in Jul 2014", "Interview Descriptions": "After applying for the job you will get an email stating you have moved on to the next step. Then you are called for a Phone screen by a recruiter. Then the hiring manager calls you to do a phone interview. Then you do a one on one interview in person. Then a call is made for offer. Takes 3 weeks.", "Interview Questions": "Tell me about a time you had a time limit and was unable to finish a project how did you handle it?"}, {"date": "9 Apr 2014", "title": "RN Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Centura Health", "Interview Descriptions": "I had a phone interview for one of the Centura Hospitals, it did not go well.  The interviewer asked very few questions and had poor social skills.  After that I have been unable to get anymore phone interviews for jobs with that nurse recruiter.", "Interview Questions": "I was asked very few questions and did not have a good opportunity to represent myself."}, {"date": "25 Aug 2015", "title": "Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 5 weeks. I interviewed at Centura Health in Apr 2014", "Interview Descriptions": "I was contacted by the HR recruiter for a phone interview, then interviewed with hiring manager. the HR recruiter worked on salary and why I was interested in the position.", "Interview Questions": "They use behavioral interviewing"}], [{"date": "19 Feb 2014", "title": "Systems Engineer III Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied through a staffing agency. The process took 2 months. I interviewed at Centura Health", "Interview Descriptions": "Misleading, The job is billed as a Sys Engineer job the work is  Sys Admin work.", "Interview Questions": "N/A"}, {"date": "12 Oct 2013", "title": "Administration Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Centura Health", "Interview Descriptions": "3 interviews total: phone interview with recruiter, in-person with hiring manager, then group interview\r\nbehavioral questions, little to no questions about related skills or experience, lots of background on the company\r\nVery little information given about actual job duties/confusion about exact responsibilities\r\nRecruiter asked my salary requirements, yet my offer was significantly less, unwilling to negotiate increased salary", "Interview Questions": "Describe a time when you had to supervise a person or project and how did you go about it?"}, {"date": "22 Apr 2015", "title": "Facilities Support Tech Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Centura Health (Colorado Springs, CO) in Mar 2013", "Interview Descriptions": "was interviewed by 2 people. Was asked how I handle stressful situations, If I had problems working in mostly female office or different shifts. asked about different approaches to issues at work. Was given a tour of department, shown job expectations.", "Interview Questions": "how would you handle an aggressive caller? do you have concerns working in a mostly female department?"}, {"date": "25 May 2013", "title": "Patient Access Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Centura Health (Colorado Springs, CO) in Apr 2012", "Interview Descriptions": "I applied several times over a three year period before I was ever considered for employment.  There is a pretty extensive screening process.", "Interview Questions": "The interview was a panel interview.  That was more difficult than any of the questions they asked.  Questions were, \"tell us of a time you encountered xyz, what did you do and why.\""}, {"date": "6 Apr 2012", "title": "Secretary Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through other source. The process took 2 months. I interviewed at Centura Health (Denver, CO) in Mar 2012", "Interview Descriptions": "It was fine as long as a person is comfotable interviewing with 6 to 8 people.", "Interview Questions": "Explain how you have handeled conflict in the past."}, {"date": "23 Oct 2015", "title": "Buyer Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Centura Health (Denver, CO) in Jun 2011", "Interview Descriptions": "I received a phone interview.   About 2 weeks later I was asked to interview with the manager of the department.  It was an easy interview in his office.  I waited about 4 weeks and called to follow up.  They said a current employee was given an opportunity to accept the job and they were waiting for his response.  When he turned it down about 2 weeks later I was called and offered the job.", "Interview Questions": "What do you do when you have a upset staff member at a hospital that needs to have an order taken care of immedately?"}, {"date": "22 Apr 2012", "title": "Staff RN (Desk Job) Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Centura Health (Colorado Springs, CO) in Jan 2010", "Interview Descriptions": "I made appt with the VP of HR at Penrose.  Took about four telephone attempts to set up appointment.    I asked if Penrose could arrange a \"desk job\" such as RN Case Managing or the like as I had been crippled in their hospital but still wanted to work for them.  The VP's response to my asking for this kind of accommodation? \"We don't do that.\"", "Interview Questions": "The VP of HR had clearly done his homework on my bad surgery there"}, {"date": "3 Mar 2014", "title": "EVS Tech II Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Centura Health (Colorado Springs, CO) in Jan 2010", "Interview Descriptions": "I was interviewed by 2 people. They asked very basic interview questions", "Interview Questions": "They didn't really ask anything too difficult."}, {"date": "6 Oct 2013", "title": "Computer Operator III Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 5 days. I interviewed at Centura Health (Englewood, CO) in Sept 2009", "Interview Descriptions": "The hiring and interview process started with a contracting company. They interview and filter people out before Centura even receives the resume for anyone. After that interview process, they set up an interview with your possible manager at the Centura location of choice. At that point, they ask some pretty standard questions regarding HR, they then ask experience, previous work experience, the usual. The only thing out of the ordinary was they ask if you are comfortable in receiving a flu shot, which is required, even if you do not work anywhere near patients.", "Interview Questions": "Are you comfortable with receiving a flu shot as a part of your employment requirements?"}, {"date": "19 Mar 2010", "title": "Scheduling Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Centura Health (Denver, CO) in May 2009", "Interview Descriptions": "Interview process was good.  I felt comfortable and confident during the interview.  The people who screened me were straight to the point no games.  They just wanted to know what I could do in correlation to the open position.", "Interview Questions": "Where do see yourself in 5 years"}], [{"date": "23 Jun 2010", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. The process took 1 day. I interviewed at Centura Health (Colorado Springs, CO) in Jul 2008", "Interview Descriptions": "The employer asked me about 10 specific experience questions.", "Interview Questions": "Tell me of a time when you were morally conflicted and how you handled it."}]]