[[{"date": "3 Feb 2022", "title": "Clinical Lab Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at UCSF Benioff Children's Hospital Oakland in Feb 2022", "Interview Descriptions": "The process was very simple and easy. I applied to the position online and got an email a week later. Interview was with operations manager, preanalytical supervisor, and supervising microbiologist. Very easygoing, casual interview experience.", "Interview Questions": "Availability, interests, and education background"}, {"date": "3 Oct 2020", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UCSF Benioff Children's Hospital Oakland", "Interview Descriptions": "I have been working at this job for 3 years. I first interviewed with the manager then interviewed with the members of the clinic team, which included 5 people at that time.", "Interview Questions": "Why do you want this job?"}, {"date": "22 Jan 2021", "title": "Clinical Research Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UCSF Benioff Children's Hospital Oakland in Sept 2020", "Interview Descriptions": "The interview process was long. I applied for the position and got an email about a month later to schedule a phone interview. The phone interview went great so I was invited to do a zoom interview with a panel of other coordinators and a few doctors/PIs. The interview was about an hour long and I was asked several behavioral questions and given the chance to ask any questions I had at the end.", "Interview Questions": "Q: Tell us a little about yourself and your background in relation to this job position. Do you have any clinical research experience?\nQ: Why are you interested in this position?\nQ: Tell me about a time where you had to adapt to a new situation.\nQ: Tell us about a situation where you had a conflict. How did you go about it and what were the steps you took to resolve it?\n"}, {"date": "4 Mar 2020", "title": "Clinical Research Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at UCSF Benioff Children's Hospital Oakland", "Interview Descriptions": "There was one interview. The interview was fairly relaxed  and conducted by one supervisor. Many of the questions gauged existing knowledge of clinical research and was informative by filling my knowledge gaps. The rest of the questions were about my experience and future plans. Felt like a conversation, but definitely be prepared with basic knowledge of clinical trials.", "Interview Questions": "Do you know about IRB and regulatory processes?"}, {"date": "6 Nov 2019", "title": "Customer Success Specialist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UCSF Benioff Children's Hospital Oakland", "Interview Descriptions": "Very nice interviewers, but I felt as though they weren’t very prepared in their questioning; with the subjects being pretty all over the place. Four rounds of interviewers that I had to go through.", "Interview Questions": "Can you commute to Oakland from south bay?"}, {"date": "8 May 2019", "title": "Ambulatory Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at UCSF Benioff Children's Hospital Oakland (Oakland, CA)", "Interview Descriptions": "I first applied on line in January and was contacted via email in March stating that the hiring manager wished to schedule an interview.  Three weeks later I went in for the interview and met with the director of ambulatory and three medical directors from several of the departments managing the position for which I was interviewing.  Later that same day I was asked to provide references because the director wished to move forward in the interview process.  I returned the references two days later.   My references were never contacted.  I followed up with the director twice over the course of one month and never heard back.  One month later I checked the status of my application on line to find that I was no longer being considered for the position.", "Interview Questions": "Please tell me a little bit about yourself."}, {"date": "23 Oct 2020", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at UCSF Benioff Children's Hospital Oakland (Oakland, CA) in May 2019", "Interview Descriptions": "I had about an hour long group interview. Each candidate was asked different questions but had to answer in front of a group. Overall pretty standard but did ask some situational questions.", "Interview Questions": "Q: How would you handle a patient who is crying?"}, {"date": "19 Jul 2017", "title": "Rehab Aide Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UCSF Benioff Children's Hospital Oakland (Oakland, CA) in Jul 2017", "Interview Descriptions": "I was called 2-3 days after I submitted my application and was requested for an interview within the next 2 days. I went to the hospital and had the interview and was told they were at the beginning of their hiring process and it would take a few weeks to get back to me", "Interview Questions": "Why do you want to work with children?"}, {"date": "23 Sept 2016", "title": "Medical Social Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at UCSF Benioff Children's Hospital Oakland (Oakland, CA)", "Interview Descriptions": "I was contacted directly by head of Social Services who then coordinated a panel interview with the medical team I would be assigned to. A date and time when all members of their team were available to meet that I was available was agreed upon. I first met individually with the Social Services head, who reviewed general responsibilities of the social services staff, and then was brought to the panel for the remainder of the interview.", "Interview Questions": "Team requested information regarding my previous workplace experiences, how well I work with a team setting."}, {"date": "7 Sept 2016", "title": "Psychology Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at UCSF Benioff Children's Hospital Oakland (Oakland, CA)", "Interview Descriptions": "National matching process. Interview was a group interview with a panel of psychologists, psychiatrists, and current interns. One question is asked and then every interviewee is expected to answer the same question. Authenticity, self awareness, willing to learn and grow is important.", "Interview Questions": "Talk about how diversity impacts your clinical work"}], [{"date": "16 Aug 2016", "title": "Office Associate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at UCSF Benioff Children's Hospital Oakland", "Interview Descriptions": "first phone call they advised will set up interview date that's it no more I can say I did not get hired\r\nI just want to finish this so I did not get a call back to continue the interview", "Interview Questions": "N/A"}, {"date": "8 Feb 2017", "title": "Dietetic Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at UCSF Benioff Children's Hospital Oakland (Oakland, CA) in Jul 2016", "Interview Descriptions": "I was contacted by a recruiter via email and we scheduled a day and time for an in-person interview. I met with two of the department's managers in a small room. The interview was pretty quick as the two managers did not have that many questions. I asked a few questions of my own and the managers told stories of previous employees moving to higher paid positions.", "Interview Questions": "How do you work under pressure?"}, {"date": "10 Feb 2016", "title": "Clinical Laboratory Scientist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at UCSF Benioff Children's Hospital Oakland (Oakland, CA) in Feb 2016", "Interview Descriptions": "The administrative assistant contacted me via phone and then email. After the first brief conversation we had, I heard nothing for about a week. Then a week later, I received more information about the next steps for interview. The panel of people I met were very nice and relaxed. They also seemed very happy.", "Interview Questions": "How long do I intend to work for them? When can I start? How did I hear about them?"}, {"date": "9 Mar 2016", "title": "Study Coordinator I Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at UCSF Benioff Children's Hospital Oakland (Oakland, CA) in Jul 2015", "Interview Descriptions": "Interview process was very straightforward. One in-person interview with my potential supervisor which consisted of basic questions such as goals, experiences, what I hoped to get out of this job, etc. No curveball questions and the whole process was extremely informal. I was able to ask questions about my potential duties as well as other aspects of the position. Process takes a very very long time from interview to job offer however due to the slow nature of the hospital's administration.", "Interview Questions": "What are your short-term goals? Where do you see yourself in the next 5 years?"}, {"date": "7 May 2015", "title": "Staff Research Associate Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. I interviewed at UCSF Benioff Children's Hospital Oakland", "Interview Descriptions": "More on the informal side. I got to know the lab, was showed around the facilities. We discussed previous research experience and current projects in the lab. Overall, it was a very relaxed interview.", "Interview Questions": "My experience level, my comfort level with particular procedures."}, {"date": "19 Jul 2016", "title": "Study Coordinator III Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at UCSF Benioff Children's Hospital Oakland (Oakland, CA) in Feb 2015", "Interview Descriptions": "I had one interview (I have heard others have 2).  Was offered the job during the interview.  Over about a month span I had my background check done, drug test, submit vaccinations then attended an orientation", "Interview Questions": "Experience with EDC, regulatory"}, {"date": "2 Nov 2014", "title": "Mental Health Worker II Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at UCSF Benioff Children's Hospital Oakland", "Interview Descriptions": "Got interview through school recruitment process. Interviews were very nice and friendly.  Typical questions of 5-year plan and what my strengths and weaknesses are. Main pro was that they noticed I wanted to learn from different branches of CHORI and would personally set these shadowing opportunities up for me should I sign on.", "Interview Questions": "Job experience,  techniques on working with children with ASB,  showing them my therapy knowledge"}, {"date": "8 Jul 2014", "title": "Dietetic Assistant Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at UCSF Benioff Children's Hospital Oakland", "Interview Descriptions": "After applying on the Children's Hospital website, they contact you by phone to schedule an in person appointment. The interview is with two people and they ask you to first describe yourself and your background related to the job. Both interviewers had a paper with a bunch of questions that they can draw from to ask you. They asked questions like what was a goal you made and what you have done to achieve it and your availability if you are hired. There were a lot of scenario questions where they ask you what you would do when talking to a parent or patient who has called down from the patient room requesting certain menu items such as a parent requesting grapes for their child, but grapes are considered a choking hazard and not offered for the child. Another scenario was asking what you would do if lactose intolerant patient called down for scrambled eggs but the system showed that the eggs from the kitchen contain dairy. After these scenario question, they ask if you have further questions for them.", "Interview Questions": "Scenario question: Patient underwent surgery and has been on a clear liquid diet but the nurse insists to send regular food to the patient before they are discharged. What would you do?"}, {"date": "8 Jun 2014", "title": "Director of Health Information Interview", "results": "Declined Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at UCSF Benioff Children's Hospital Oakland", "Interview Descriptions": "The interview was very relaxed and comfortable.  The series of interviews were scheduled some what far apart, due to communication issues at the facility.  There were specific people that they wanted references from.  They were given several references, letters of recommendation, it was a different process.", "Interview Questions": "The request for specific types of references from individuals in certain positions."}, {"date": "28 Aug 2013", "title": "Interpreter Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at UCSF Benioff Children's Hospital Oakland (Oakland, CA)", "Interview Descriptions": "1 interview with manager and 2 other full time interpreters with 3 scenarios and interpretation in consecutive mode.", "Interview Questions": "Cardiac terms"}], [{"date": "12 Aug 2015", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at UCSF Benioff Children's Hospital Oakland (Oakland, CA) in Apr 2013", "Interview Descriptions": "Standard interview process. First fill out the application online. Check to make sure you have completed all the attached forms, collect and organize all your medical records, submit the forms to the volunteers office in the Hospital on the 3rd floor, wait for an email response (typically 4-6 weeks) though I've heard they cycle through the applications so if you submit at the beginning of the cycle the process will go faster. Once contacted by the volunteer office you'll schedule an interview with the volunteer coordinator, get a background check, explain why you're interested in volunteering, what you're future career plans goals are, what part of the hospital interests you the most. You'll then rank your departments in order of interest and will be selected for a certain department. All volunteers are required to initially spend 10 hours or something like that at the art cart which is basically the outpatient center where you draw and do fun coloring activities with children instead of clinical volunteering. It still counts toward your clinical volunteer hours.", "Interview Questions": "Why are you interested in volunteering at the Children's Hospital specifically and what are your career goals? "}]]