[[{"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 3, "Diversity and Inclusion": 3, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 1, "review_title": "Excellent place to work", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "2 Jul 2022", "job_title": "Post Doctoral Fellow in Ciudad de Mexico", "duration": "N/A", "pros": "Excellent place to work, good staff, good location", "cons": "Work life balance tough, Life is not easy in Mexico"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 3, "Compensation and Benefits": 0, "Senior Management": 4, "review_title": "Great organization and purpose", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "13 Apr 2023", "job_title": "Consultant in Ciudad de Mexico", "duration": "N/A", "pros": "An interesting organization with a good mission and objective", "cons": "Really low pay for an international organization"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 0, "Diversity and Inclusion": 0, "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Great benefits as an Internationally Recruited Staff", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "23 Feb 2023", "job_title": "Project Manager in Texcoco", "duration": "N/A", "pros": "Life Balance and the mission to eliminate world hunger/poverty.", "cons": "There is not much professional growth at CIMMYT. Internationally recruited staff receive way higher salaries and benefits than nationally recruited staff."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 0, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Lack of vision and direction", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "27 Jan 2022", "job_title": "Anonymous Employee in Texcoco", "duration": "N/A", "pros": "- Honorable mission and history.\r\n- Good pay and benefits", "cons": "- Generally old-fashioned. Lacks flexibility and is extremely slow to include new methods, new ideas, new ways of working..\r\n- Since the change of leadership in 2021, the organization has been lacking vision and direction. It is not clear what CIMMYT wants to accomplish and how to get there. It has also changed the culture to mistrust and micromanagement. Along with the general lack of motivation caused by Covid and the merge with One CGIAR, staffs are burning out and leaving. \r\n- Lack of transparency. Leadership never explains the reasons behind decisions or appointments. It is not even clear who is leading certain programs or departments. \r\n- Leadership doesn't trust other teams and units. Everything has to be micromanaged by the top leader and his clique. Initiative and proactivity are discouraged. \r\n- Short-sighted decisions and policies. Policies are applied and interpreted against staff, just to save a few dolars.\r\n- Lack of professional development prospects. Zero possibilities to evolve to a higher role.."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": 4, "Career Opportunities": 3, "Compensation and Benefits": 5, "Senior Management": 0, "review_title": "Good", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "30 Oct 2022", "job_title": "Postdoctoral Fellow in Texcoco", "duration": "N/A", "pros": "Good Benefits, Mexico is cheap life", "cons": "Hybrid between public breeding program (90%) and research (10%)"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 5, "Culture & Values": 3, "Diversity and Inclusion": 3, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 3, "review_title": "On working at CIMMYT", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "15 Feb 2021", "job_title": "Communications Manager in Texcoco", "duration": "N/A", "pros": "good salary and conditions (for international staff); room for professional growth; great Mission", "cons": "inequalities and discrimination (systemic sexism and racism - no so much by individuals, but built-in biases that are not being tackled in any serious or committed fashion)."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 0, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Great mission, great people, toxic working environment.", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "16 Jun 2019", "job_title": "Anonymous Employee in Chihuahua, Chihuahua", "duration": "N/A", "pros": "You work for a good cause, contributing to a better world.  Multicultural environment is great.  There is a lot of staff committed to the mission and working together for a better world, not only in their role but in their personal time too. \nProjects are super interesting and it’s a great place to learn, because of the work and complex projects you work on. \nDespite the gender gap, there are some concrete actions to reduce it.  There is a lot of effort in increasing transparency, teamwork and eliminating discrimination and negative hierarchies but there is still a lot to do.", "cons": "Too much politics.  In half of the departments the heads/directors reward loyalty instead of performance or capacity.  There is still considerable discrimination vs national staff (normally paid 1/5 of foreigners), vs women, vs young staff and vs administrative staff (scientist are always right whether they actually know what are they talking about or not).  There is no professional development plans and most supervisors are appointed because of personal favors or because they are technically good in their field but not because they know how to supervise.  There is a lot of harassment and the compliance officer only takes care of cases where the harasser is not her friend."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "Working for CIMMYT is very satisfying.", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "9 Feb 2015", "job_title": "Anonymous Employee in Texcoco", "duration": "N/A", "pros": "The best thing about working for CIMMYT is the international staff.  The multicultural environment is truly wonderful.  It is amazing to work with people from around the world with a shared commitment to improving food security. I also enjoy the international travel opportunities and the flexibility to work from my home country. Working in Mexico is made safe by the high security of the Texcoco campus and diplomatic immunity while driving CIMMYT vehicles. Central Mexico has lovely weather and offers a rich cultural experience.", "cons": "The experience of workers is extremely dependent on program. The management of some programs is very poor. The turnover rate in upper management is high and the morale of some workers low.  The contained Texcoco campus offers security, but little privacy for those that work and live there.  Internal politics can be overwhelming, particularly for international workers who feel \"trapped\" professionally and personally."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 1, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "Wonderful Mission, Constantly Struggling to define and adjust Vision, Difficult work environment", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "18 Sept 2019", "job_title": "Coordinador in Ciudad de Mexico", "duration": "N/A", "pros": "When you work with CIMMYT, your work contributes to building the foundation of food system development on a world scale.\r\nA wonderful intercultural staff and work experience.....if that is what you are looking for and where you function well.\r\nThis work affords you a great sense of purpose and significance in your day to day activities.", "cons": "HUGE pay and benefits gap between national and international employees. This reality creates tension and an almost colonial feel to the institutional hierarchy. \r\nCIMMYT struggles to play well with local national/host country institutions. There is often an impression (mostly unfair) of CIMMYT as elitist and somewhat of an ivory tower.  CIMMYT often lacks the institutional ability to navigate local politics, institutional relations, etc. because it is an agricultural scientific organization run by agricultural scientists. This results, often, in good science not making it to the field or to the intended recipients."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Beautiful mandate totally overshadowed by extremely poor management and unethical practices...", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "30 Mar 2017", "job_title": "Program Manager in Texcoco", "duration": "N/A", "pros": "- The organization´s purpose is, in general, admirable and encouraging. \r\n- Opportunity to interact with people from various disciplines and backgrounds.", "cons": "- Toxic work culture of gossip favoured (the DG openly encourages \"positive gossip!\")\r\n- Lack of accountability from managers and senior managers. Racism, ageism, bullying and harrassment prevalent at all levels, enticed by upper management. Mexicans are discriminated and poorly spoken about in their own country by international staff in upper management positions. \r\n- Nepotism is present across the organization. Spouses are designated in decision-making positions without proper credentials. \r\n- Gross misconduct and gross ineptitude from managers in key departments, mainly in human resources and finance mean that incorrect, negligent practices are covered and unattended."}], [{"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "If you are a young scientist and have another employment option, steer clear from this place.", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "30 Jan 2015", "job_title": "Postdoctoral Fellow in Marseille", "duration": "N/A", "pros": "Interesting job, international environment, excellent school for children, good (not excellent, though) benefits.", "cons": "Career growth for younger scientist is close to impossible unless someone retires or leaves the places. Strongly centralized system, at least in the Global Wheat Program and the management is not used to listen to the staff. No sense of community/team. Too much inside/dirty politics and hatred."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Steer Clear. Do yourself and your family a favour, don't work here.", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "18 Nov 2013", "job_title": "Anonymous Employee in Texcoco", "duration": "N/A", "pros": "Birthdays off.\r\n\r\nGood benefits, especially for those who negotiate better packages and special privileges than their colleagues and co-workers. Negotiation is common rather than standard staff policies and practices. If you're a good negotiator and a self-promoter, you'll do well for yourself. Anyone interested in a workplace where staff are treated equally and fairly, steer clear. \r\n\r\nGood benefits for families, however those benefits (and any others) can be stripped away at any time. You and your family will be at the mercy of an organization that treats its employees like slaves. Anyone who protests will be swiftly threatened or given the boot and made an example of to others who might raise concerns.\r\n\r\nSelf-promoters and non-performers will feel right at home here. Anyone with any moral decency, look elsewhere. Anyone with integrity who actually wants to focus their efforts on working towards the organization's mission will be disappointed and not recognized for their achievements and hard work.\r\n\r\nThe mission of the organization attracts a lot of decent, intelligent, and fantastic people. However, after working here for some time, these same people either turn into bullies themselves, leave the organization, or are sacked.", "cons": "The last thing someone wants to worry about after working in an organization for 20 years is showing up one day and being told they’ve been sacked with no warning, no notice, and no explanation.  But this is common practice at CIMMYT.  Staff are regularly expected to work 60-70 hours a week, are poorly compensated, and are terminated without notice or explanation. Bully mentality is common especially among senior management and filters down throughout the organization.\r\n\r\nUnder-performance and gross non-performance of responsibilities are consistently ignored for preferred employees.  Nepotism and favouritism are rampant throughout the organization.  Save your talent, energy, and hard work for another organization that has a modicum of consideration for its employees.\r\n\r\nStaff are expected to dedicate their entire life to the organization while anyone can be let go at any time regardless of their contract. Staff who decide not to work weekends or evenings will not last long. Upper managers don't have a personal life and expect staff to be virtually on call. Work/life balance is poor. If you don't comply, you won't have a job.\r\n\r\nHorrible management and treatment of staff have been well documented and raised as a concern by oversight bodies and independent councils. However, there are no real mechanisms to hold management accountable. Minorities, women, and certain nationalities are targeted and treated especially unfairly. With no real mechanisms in place to rectify poor treatment of staff, unethical practices go unchecked and are common."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Great Organization", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "4 May 2016", "job_title": " in Texcoco", "duration": "N/A", "pros": "Multi cultural and great work environment make CIMMYT a great place to work, benefits, children day care, training and so much more.", "cons": "Distance from a big city, lot of manual work and sometimes is difficult to propose a new idea. Salary is not as competitive as could be."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Stay away, Don't work here", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "13 Dec 2016", "job_title": " in Tequisquiapan, Querétaro", "duration": "N/A", "pros": "Work for the poor farmers, Multi cultural, few projects are very well run and offer a good opportunity to make impact", "cons": "lack of humanity and ethics in most of the management circles, very poor metrics to measure job achievements, very bureaucratic. At all costs, stay away from the Sustainable Itensification Program (SIP) as it is an extremely unhealthy workplace, managed ineffectively and deeply unprofessional."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Frank review of work experience from a former staff member", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "28 Mar 2017", "job_title": "Freelancer in Ciudad de Mexico", "duration": "N/A", "pros": "Opportunity for a varied experience; international exposure due to high numbers of expatriates", "cons": "Obvious lack of autonomy, blatant favoritism shown toward less qualified personnel, passive-aggressive culture"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Sr. Software Engineer", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "27 Apr 2017", "job_title": "Senior Software Engineer in Ciudad de Mexico", "duration": "N/A", "pros": "- Projects are really interesting and you can discover how computer and software allows to poor people live better", "cons": "- Most of contracts are only for 3 years or 4"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Great peark in a work that is so difficult to upgrade", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "6 Mar 2017", "job_title": "Program Assistant in Texcoco", "duration": "N/A", "pros": "Great pearks, international enviroment, 9 to 5 work", "cons": "Non oportunities to scale, low communication between departments, low salary,"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 0, "review_title": "Good organization, but uneven management", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "6 Feb 2020", "job_title": "Senior Analyst in Texcoco", "duration": "N/A", "pros": "Great mission. Great colleagues. International orientation.", "cons": "Weak HR. Management quality varies. Internal infighting ."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 5, "review_title": "Cimmyt is an amazing company", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "21 Feb 2019", "job_title": "Remote Sensing Technician in Ciudad de Mexico", "duration": "N/A", "pros": "- Facilities\r\n- international company\r\n- International researches\r\n- Good work environment", "cons": "- As local worker there are not many benefits as a international one"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 0, "Culture & Values": 0, "Diversity and Inclusion": 3, "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "Nice place to work at", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "16 Oct 2020", "job_title": "Chercheur in Texcoco", "duration": "N/A", "pros": "Work environment, interesting job and great science", "cons": "Administration . Everything takes ages to be done!"}], [{"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Reporting", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "18 May 2020", "job_title": "Associate Scientist in Ciudad de Mexico", "duration": "N/A", "pros": "good working environment for scientists", "cons": "boss oriented environment impedes growth"}]]