[[{"date": "10 Jul 2021", "title": "Certified Pharmacy Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Akron General Health System in Jun 2021", "Interview Descriptions": "Was a simple few questions over the phone with the hiring manager before having a one on one with the boss. Manager was super nice and made me feel welcomed before I even got the job", "Interview Questions": "What makes you a good fit for this position?"}, {"date": "27 May 2021", "title": "Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Akron General Health System", "Interview Descriptions": "I had a phone interview with HR, followed by a phone interview with the department manager, and an in-person interview with several potential managers and co-workers. After this, they told me they were interviewing several others, and to give them two weeks to make their decision. HR called within a week to offer the position.", "Interview Questions": "What was a time where you had to stand up for one of your patients?"}, {"date": "13 Oct 2017", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Akron General Health System (Akron, OH) in Oct 2017", "Interview Descriptions": "Very streamlined. Interviewed first with HR recruiter to determine best fit and then with the unit manager. Both interviews were based on behavioral questions.  Very friendly and professional process.  Pleasant experience.", "Interview Questions": "Where do you see yourself in 5 years"}, {"date": "6 Sept 2017", "title": "Unit Clerk Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Akron General Health System (Akron, OH) in Jan 2017", "Interview Descriptions": "Interview was fairly easy got a call from HR stating they found my resume and wanted me to take a typing and medical terminology test. Passed both and they scheduled me a interview the following week. First interview was with HR recruiter and the second one was with the Director of the unit I would be working on.", "Interview Questions": "Name a time when you had to deal with a tough situation at work? How did you handle it"}, {"date": "8 Oct 2016", "title": "Senior Tech Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at Akron General Health System", "Interview Descriptions": "I interviewed 1st with HR. I felt that things really went well,  I was called later on in the day by HR again to schedule an interview with the manager on the floor where they had an opening.\nI went to this interview thinking that HR would have  forwarded my information over to the manager on the floor that they asked that I interview with...Nope!\nThat didn't happen. Nor did I actually get to interview with the manager that I was scheduled to interview with, it was someone else. So I go to this interview expecting to answer typical interview questions..which I did.. but I had no resume for a 2nd Interview nor did the person actually conducting the interview have a copy of my resume or any of my   info from interview 1.\nI feel as though I was robbed of the opportunity of working for this company due to the fact that there was a lack in communication between HR and the Manager on the floor. My 20 plus years experience didn't matter to the person that I wasn't scheduled to interview with...but had to because the actual manager was not available. By this person not having my info from HR sent over to her prior....made it look as though I was not prepared to interview... and it made them look as though they do not follow through on or with information of their  potential candidates", "Interview Questions": "what is your work history?"}, {"date": "27 Jun 2016", "title": "Financial Analyst Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 1 day. I interviewed at Akron General Health System (Akron, OH) in Jun 2016", "Interview Descriptions": "Great interview process very casual. Great people. The salary was below what I needed, so I pulled my name when asked for a second interview. Their benefits were higher then I am current paying which was a surprise given that its a medical organization.", "Interview Questions": "Reviewed my back ground"}, {"date": "1 Aug 2015", "title": "Vallet/Greeter Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Akron General Health System in Feb 2015", "Interview Descriptions": "It was a very easy process they tell you where to park and then give you turn by turn directions to the HR department which is pretty hard to find without directions. First you have a interview with the HR interviewer and if that all goes well you then go to the manager or supervisor of of the department your applying for and have about a half hour interview and if all goes well you get a call in a day or so asking when you can have your physical done and all the other little stuff like name badge and uniform then you pick and orientation date and after orientation you get your start date.", "Interview Questions": "Can you drive a manual transmission."}, {"date": "24 Mar 2014", "title": "Manager Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Akron General Health System", "Interview Descriptions": "Easy interview process", "Interview Questions": "What do you like least about your current job"}, {"date": "8 Jul 2015", "title": "Senior Tech Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Akron General Health System (Akron, OH) in Mar 2013", "Interview Descriptions": "The process was quick and straight to the point. They made you comfortable because I was nervous about doing an interview because it's been so long. But they gave you lots of information about the position", "Interview Questions": "Describe yourself "}, {"date": "18 Jul 2016", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Akron General Health System (Akron, OH) in May 2012", "Interview Descriptions": "Very long process. Several interviews. Met with a recruiter even prior to meeting with a manager on the floor that I was applying for. Multiple layers of interviews. Multiple situational questions. The process seemed more difficult than necessary, Overall experience was difficult but I did get the job. I found it ironic, it was even difficult to get the assigned scrubs.. that was the last step of the process.. it was in an area above a parking garage.. the sign on the door said \"almost done:", "Interview Questions": "Many situational questions, as well as working well with co workers in stressful environment."}], [{"date": "15 Aug 2014", "title": "Radiation Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 days. I interviewed at Akron General Health System (Akron, OH) in Apr 2010", "Interview Descriptions": "The department manager did the interviewing.  He actually did an interview with me and a girlfriend of mine looking for a job also.  He hired us both so we could car-pool as Akron was an hour away for\r\nboth of us.  He told us it was a great place to work and that working there would be much better than \r\ntheir counter hospital Akron City that we also had interviewed at.  We believed him and took the job.", "Interview Questions": "Can you get along with anyone?"}, {"date": "1 Jul 2012", "title": "Personal Trainer Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Akron General Health System (West Akron, OH) in Dec 2008", "Interview Descriptions": "The process took a while because various people you had to talk with.  Also, there is a drug test.  A good one.  After that the job started right away.  The place has the normal interview that would be expected from any other Personal Training job.", "Interview Questions": "What is your experience as a Personal Trainer and how do mouthing you can help?"}]]