[[{"date": "18 Feb 2023", "title": "Shop Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Save the Children", "Interview Descriptions": "The interview process was very natural and the shop manager taught all the in-store tasks through two hours. At the same time getting your hands on the execution。Culling clothes, pricing, cashiering and window display", "Interview Questions": "Why did you come to volunteer?"}, {"date": "12 Aug 2022", "title": "Analytics Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Save the Children", "Interview Descriptions": "Interviewed by someone junior to the role who only actually asked 2 questions but spoke a lot and meant really couldn’t show of skills or suitability for the job. Found out afterwards has happened with all 10+ candidates put forward so far so feels like process isn’t working", "Interview Questions": "Only 2 asked in total 30m interview "}, {"date": "18 May 2022", "title": "Shop Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Save the Children", "Interview Descriptions": "I found the  interview process to be straight forward and relaxed. I was asked some questions about availability and to expand on some of the information I had put in my written application.", "Interview Questions": "When are you available to volunteer?"}, {"date": "3 Jun 2021", "title": "Scrum Master Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Save the Children", "Interview Descriptions": "telephone screening to talk about general role and experience, and then invired to a second interview via  video call with hiring manager and lead agile coach and a scrum master, they asked 3-4 questions each.", "Interview Questions": "describe a time you overcome a difficult situation. "}, {"date": "16 May 2021", "title": "Operations Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Save the Children (London, England) in May 2021", "Interview Descriptions": "First  stage was a pre call, and if successfully,  second stage had 10 a minute presentation followed by competency based questions from the group. This was done over teams online.", "Interview Questions": "How to keep team motivated? How to  support multiple teams with limited resources "}, {"date": "15 Oct 2020", "title": "IT Support Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Save the Children", "Interview Descriptions": "General questions, how will you act if... Basically understanding how you deal with issues\r\nWhen you are part of a distributed team. Multi stage. Previous phone screen. Nothing like technical questions or extensive list of topics", "Interview Questions": "Tell me about a time you have to say no."}, {"date": "27 Jul 2020", "title": "HR Business Partner Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 4 weeks. I interviewed at Save the Children (London, England) in May 2020", "Interview Descriptions": "I was kept well informed and it was a smooth process. The interviewers were friendly and gave me plenty of opportunity to ask questions. I was informed quickly as to the outcome of the interview and provided with feedback.", "Interview Questions": "Question regarding my commitment to safeguarding"}, {"date": "10 Dec 2019", "title": "Fundraising Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Save the Children", "Interview Descriptions": "A competency based interview with general questions about teamwork, organisation, meeting deadlines, and my reasons for applying. Experience was admin focused.\r\nGood interview process that was straight forward.\r\nInterviewed by two members of staff from the fundraising department.", "Interview Questions": "Describe a time you had to handle multiple deadlines "}, {"date": "21 Jun 2019", "title": "Project Monitoring and Evaluation Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 2 weeks. I interviewed at Save the Children (London, England)", "Interview Descriptions": "Telephonic, written test and personal interview \r\nThe first round of telephonic interview was not an HR round but a committee asking you theoretical questions like - What is co-relation? what would be the indicator for a particular project ?", "Interview Questions": "N/A"}, {"date": "3 Nov 2019", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Save the Children (Hendon, England) in Jun 2019", "Interview Descriptions": "Those over 18 may print from STC website or from a local STC retailer they may fetch, fill out and deliver the STC application form giving two referees (non-family).", "Interview Questions": "Why do you want to work for STC?"}], [{"date": "14 Apr 2019", "title": "Digital Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Save the Children (London, England)", "Interview Descriptions": "3 stage interview, took too long to get info on the decision, however, the online system was good to remember the interview details.  overall was positive and the panel was very accommodating and professional.", "Interview Questions": "Typical for specific subject, methodologies, experience, why you are leaving the present job, etc"}, {"date": "6 Dec 2018", "title": "Senior Adviser Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Save the Children (London, England) in Aug 2018", "Interview Descriptions": "One hour interview and 30 minutes written test. There were two interviewers reading all the questions. All the questions were about the role, about your experience related to the job, a time when you failed, an experience you are proud of.", "Interview Questions": "A time when you did not agree with your boss\r\nA time when you did not succ"}, {"date": "2 May 2018", "title": "Human Resources Advisor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Save the Children in Jan 2018", "Interview Descriptions": "A 30 minute telephone interview and then an invite for a face to face interview. \nDemand for the role was very specific which did not reflect in the job description.", "Interview Questions": "Give an example when you faced  a difficult HR situation?"}, {"date": "29 Sept 2020", "title": "Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Save the Children (London, England) in Jan 2018", "Interview Descriptions": "The interview panel was very accommodating and made me feel very comfortable to respond to questions. It was a really good experience. I also had the opportunity to ask questions about the organization as well as the project I would be supporting.", "Interview Questions": "General workplace skills related questions."}, {"date": "29 May 2017", "title": "Administrative Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Save the Children (London, England) in May 2017", "Interview Descriptions": "I undertook two interviews for two different administrative positions at Save the Children. I was given very little notice to prepare (2 days), and both times had to complete pre-interview tests (prioritising and spreadsheet comprehension based.)\r\n\r\nWhile the interviewers were generally polite during both interviews, they came across very snooty. This is a problem in the international development sector anyhow. Yes, you work to 'save children', but have a bit of humility please! \r\nThe office is beautiful, but the small room in which they my interviews meant I could see everything impolite which was getting written about me, which is very off-putting!\r\n\r\nBut the worst part for me is that after both interviews, none of them contacted me with the result. I've clearly been declined, but please recognize the massive effort and emotional-toll on the job seeker that has decided to approach you. They have, for however long, taken rejection after rejection, and have probably worked very hard just to prepare for this interview. It takes very little time to copy and paste a rejection to me and the 6 or 7 other people you reject at interview stage. In fact I'd consider it basic politeness.\r\n\r\nI knew after walking out of there that I wouldn't fit in anyhow, because I want to help the needy too, but I don't need to look down my nose at other people in the process.", "Interview Questions": "* How do you prioritise between urgent and important\r\n* How do you deal with stress\r\n* Have you handled big budgets"}, {"date": "22 Oct 2016", "title": "Senior Digital Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 2 weeks. I interviewed at Save the Children (London, England)", "Interview Descriptions": "I was asked about previous experience from documentation handling to technical knowledge and to share examples, plus advise on the effectiveness of past PM tools used.\r\n\r\nCurrent DBS required. \r\n\r\nInterview friendly, but professional.  Suit not required for this role but smart appearance necessary.\r\n\r\nThey look for a keen interest in their organisation and preferences of charity background, but not essential.", "Interview Questions": "What PM tools have you used? On what projects? How did you find them?"}, {"date": "11 Jul 2016", "title": "Finance Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Save the Children (London, England)", "Interview Descriptions": "Applied online. Interview was also booked online. Arrived at H/O -meeting was on time and took an hour. It was well structured and interesting. I was told briefly about the set up of the department, than had to answer series of questions about my current job and abilities. It took just over a week to hear back. The whole process was very a possitive experience, was made to feel comfortable and at ease. People working there are very motivated by the job that they do. It seemed like it would be a busy but rewarding place to work.", "Interview Questions": "flexibility"}, {"date": "5 May 2018", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Save the Children (London, England) in Sept 2015", "Interview Descriptions": "lengthy process for an administrator role, with multiple interview rounds. 2 at most would have been sufficient for the level of this role . I did a phone screening, a panel interview a test and another panel interview.", "Interview Questions": "how do you manage competing priorities"}, {"date": "22 Aug 2015", "title": "Supporter Care Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. The process took 2 weeks. I interviewed at Save the Children in Aug 2015", "Interview Descriptions": "Telephone interview, took around 15-20 minutes. Applied through an agency and while I was initially turned down after interview another position opened up shortly after and I was given an offer without a second interview.", "Interview Questions": "How do you cope with pressure?"}, {"date": "19 Oct 2015", "title": "Digital Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Save the Children (London, England) in Jul 2015", "Interview Descriptions": "The interview process took place over two stages, with questions and an exercise at the first stage and both a presentation and questions at the second. There was a panel of two at stage one, and a panel of three at the second stage. Questions ranged from generic 'Why StC' to more targeted questions around the role and requirements, as you'd expect.", "Interview Questions": "Why do you want to work at Save the Children?"}], [{"date": "20 May 2016", "title": "Project Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Save the Children in May 2015", "Interview Descriptions": "Telephone interview walked through my cv and described the role followed by face to face Competency based interview. 4 competency questions from job description supplied followed by opportunity to ask my own questions. Very friendly and put me at my ease. They are new to competency based questions. Overall a positive experience.", "Interview Questions": "Tell us about a time you delivered results"}, {"date": "30 Mar 2015", "title": "Project Coordinator Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Save the Children (London, England) in Mar 2015", "Interview Descriptions": "Interview was over Skype. My interviewers looked like they were in their pajamas, I acknowledge that's there's a time difference, but still would be respectful to dress appropriately. At one point, one interviewer left room and wandered off to another room, without excusing herself, a little distracting.  Was given 1.5 days notice for the interview.", "Interview Questions": "How do you like to be managed?\r\nHow would you track a project with lots of stakeholders?"}, {"date": "2 Jan 2016", "title": "Head of A Technical Sector Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 1+ week. I interviewed at Save the Children (London, England) in Feb 2015", "Interview Descriptions": "I applied online and had two interviews: a first with two managers on the phone, tgen a tehnical test and eventually got the last round which was a panel face to face interview with two senior managers. After the interview process tge human resources department contacted two of my referees and ran a background check on me to ensure that I can work with children.", "Interview Questions": "Experience of security incidents in the field"}, {"date": "13 Mar 2018", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Save the Children (London, England) in Oct 2014", "Interview Descriptions": "I went in and asked the manager if I could volunteer as part of my DOfE awards. She accepted right away and asked me when I'd like to start and how many times a week would I like to volunteer.", "Interview Questions": "It was not a proper interview. The manager just asked me which days I'd like to volunteer."}, {"date": "31 Oct 2015", "title": "Shop Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 5 days. I interviewed at Save the Children (Cheam, England) in Sept 2011", "Interview Descriptions": "Phoning the branch to have an initial chat with acting shop manager, discussing motives, availability etc. Then being called in for an informal interview/chat in person to assess your suitability for the role and also to be shown around the shop. Was a really straightforward process and once we'd discussed what days I was available I was ready to start the next week! At that time I was under the legal age for operating a till so this was one of the things we discussed - alternatives and how I could get involved e.g. with sorting donations in the back room.", "Interview Questions": "Why do you want to work for Save The Children?"}]]