[[{"date": "27 May 2022", "title": "Mental Health Technician Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Carrier Clinic", "Interview Descriptions": "It took longer than the job was worth and they asked questions about empathy. There was a time that the person I was supposed to interview with did not show.", "Interview Questions": "Do you feel like you're empathetic?"}, {"date": "18 Nov 2021", "title": "Tech Support Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Carrier Clinic", "Interview Descriptions": "It wasn’t too hard at all, as long as you maintain good customer service then almost anyone can do the job. Just have to believe in yourself.  Only typing still to fulfill 30 word minimum.", "Interview Questions": "Tell me about yourself in three words "}, {"date": "27 Feb 2021", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Carrier Clinic", "Interview Descriptions": "The interview process was pretty painless, although everything is done virtually. Everyone I spoke with was very helpful. It was all very straightforward, no surprises. I interviewed with my future supervisor, which I thought was nice. No bad things to say about this, really.", "Interview Questions": "How I interact with co-workers. "}, {"date": "10 Oct 2020", "title": "Residential Counselor Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Carrier Clinic", "Interview Descriptions": "I applied About a week ago to the residential counselor position. They called me for a phone interview and asked me experience questions and situational questions. The topics were easy as long as you understood what they were looking for.", "Interview Questions": "What has been a challenging aspect in your last work place "}, {"date": "6 Jun 2020", "title": "Residential Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Carrier Clinic", "Interview Descriptions": "You will sit down with one or two of the lodge supervisors and discuss your education, life experience and work experience. You'll be asked the usual questions and maybe be asked how you would react in a hypothetical situation that is very mild so as not to scare you away.", "Interview Questions": "What is your biggest weakness?"}, {"date": "17 May 2019", "title": "MHT Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Carrier Clinic", "Interview Descriptions": "First with HR then unit supervisor. Kind of informal and pretty relaxed. The Hr staff was very helpful and made me feel welcomed and relaxed. They were able to answer questions that I had and if they didn't know they found out for me right away. They escorted me to the unit directors office where the second portion of the interview happened. Questions were more personal but pretty standard.", "Interview Questions": "\"What would past managers say you'd need to change about your work style, or your weaknesses\"? \"Talk about a time where you had to lead or take charge.\""}, {"date": "15 Oct 2018", "title": "Residential Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Carrier Clinic (Hillsborough, NJ) in Jul 2016", "Interview Descriptions": "I met a recruiter at a job fair and was immediately contacted for an interview. I was told there were only certain departments, on the Eagle Mountain Lodges, I could apply for due to my experience, which I found out was not true. The interview was straight forward, however actually working there was very different. Also, wish I would have been given more background information when I had to choose which departments to apply to , since each lodge is very different.", "Interview Questions": "How do you handle challenging situations?"}, {"date": "4 Apr 2016", "title": "Mental Health Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Carrier Clinic (Belle Mead, NJ)", "Interview Descriptions": "Applied multiple times online and then personally delivered an application. Got a phone call to come interview, went in and HR basically acted like I got the job with meeting with the Director that same day. Showed me around and then asked when I could start. If you actually get a call back then you are in.", "Interview Questions": "Basic information of experience and education"}, {"date": "8 Feb 2016", "title": "Social Worker Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 8 weeks. I interviewed at Carrier Clinic (Belle Mead, NJ) in Nov 2015", "Interview Descriptions": "Spoke with in-house HR Manager and had a phone interview and then In-person IV. Then met 3 hiring managers and HR Manager sat in on interview. Had second IV with direct hiring manager. All went great! Then met two \"peers\" for a peer IV who I found to be immature and rude. These two peers, much younger than I and less experienced, fired questions at me and and smirked at each other. They had no idea how to interview someone and I could not wait for it to end. I wondered if I wanted to work with these peers and decided, NO.", "Interview Questions": "What did I know about the organization, strengths and weaknesses, how did I find out about the organization (thought that was a strange ?)"}, {"date": "13 Jan 2016", "title": "Mental Health Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Carrier Clinic (Belle Mead, NJ) in Oct 2015", "Interview Descriptions": "great interview. human resources is great. They make you feel very comfortable. They really want to make sure they are hiring the right people as it is a psychiatric facility and you are working with patients who can be  difficult. over all the interview process was not bad!", "Interview Questions": "why i wanted to work at a psychiatric hospital"}], [{"date": "29 Jul 2015", "title": "Mental Health Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Carrier Clinic", "Interview Descriptions": "Discussed with the human resources recruiter why I wanted to job over the phone. Then came in to have a second, more in depth interview with unit director which lasted about an hour.", "Interview Questions": "Have you ever had an experience at your former job where you had to console a co-worker in a time of stress?"}, {"date": "20 Feb 2015", "title": "Residential Counselor Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Carrier Clinic", "Interview Descriptions": "I applied online and the process has taken several months. HR is impossible to get in touch with and is making the entire process very difficult. The worst experience I've ever had.", "Interview Questions": "How do you handle crisis situations?"}, {"date": "12 Jul 2015", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Carrier Clinic (Belle Mead, NJ) in Dec 2014", "Interview Descriptions": "After completing a lengthy  application including references I interviewed with human resources and then with the director position available. Subsequently I pass a drug test, background check and skills checklist.", "Interview Questions": "Why do you want to switch specialties?"}, {"date": "25 Nov 2017", "title": "Mental Health Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Carrier Clinic (Belle Mead, NJ) in Aug 2014", "Interview Descriptions": "Initially, it took a while for them to respond to my application. Then someone called me for a brief phone interview. After that, I had the opportunity to meet with someone in person. After hired, I then completed a one-week training.", "Interview Questions": "Prior experience and what I wanted to get out of a career at Carrier."}, {"date": "1 Nov 2017", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Carrier Clinic (Belle Mead, NJ) in Nov 2013", "Interview Descriptions": "Interviewed as a new grad. Interview process went smoothly.  People were friendly and gave a fair representation of the job requirements and benefits.  If the area is unfamiliar to you, it would be beneficial to drive to prior to interview appointment. It is not centrally located and buildings are difficult to find.", "Interview Questions": "Describe a challenging situation with patients. "}, {"date": "14 Jan 2012", "title": "Mental Health Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Carrier Clinic (Belle Mead, NJ) in May 2010", "Interview Descriptions": "I went to the Human Resources Building to find that  the human resources person was just coming in.  She asked me typical questions and then I walked over to the unit director's office.  She asked me more challenging questions.  She was enthusiastic and eager to have me.  They are looking for people that are dedicated and will be hard workers, engaged and eager to be of service to their fellow employees and to the patients.  The culture is characterized by one where there are those who work hard and those who do not and there is a friction between the two.", "Interview Questions": "Give three words to describe you."}, {"date": "1 Jul 2011", "title": "Mental Health Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Carrier Clinic (Belle Mead, NJ) in May 2009", "Interview Descriptions": "I was called in to do a one:one interview with the director of human resources.  She asked me the general questions about my background.  She asked me the populations I would or would not be interested in working with in order to assess which units I could apply to.  She then set up a one:one interview with the unit Director of the unit that they thought was most suitable.  I drove over to that unit and did the interview with that Unit Director.  She was very friendly and asked personality type questions related to punctuality (very important), consideration of others and teamwork skills, 3 questions to describe me, etc.", "Interview Questions": "What are three questions to describe you?"}]]