[[{"date": "25 May 2023", "title": "Neuro Nurse Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Summerlin Hospital (Las Vegas, NV) in May 2023", "Interview Descriptions": "The manager gave a patient scenario with chest pain and shortness of breath. Then asked what medication you would give them. We spoke directly with the unit manager. We did not get offered to choose the position we would like.", "Interview Questions": "Tell me about yourself. Where do you see yourself in 2 and 5 years?"}, {"date": "4 Nov 2021", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Summerlin Hospital (Las Vegas, NV) in Nov 2021", "Interview Descriptions": "Received a phone call from one of the hiring managers about an interview. It was a panel interview with 3 different hiring nurse managers from different units. I was asked a series of questions such as personality questions, how you've handled a difficult situation with a patient, etc. I was also asked clinical/situational questions regarding labs/orders for a patient with DOB & chest pain, a patient receiving Lasix, etc. All 3 nurse managers are great interviewers and will make you feel as comfortable as possible. Just know your nursing basics and you'll be fine!", "Interview Questions": "What do you monitor before and after with a patient taking Lasix; If a patient comes into the ED with chest pain and DOB what orders do you expect to be done on the patient; how do you treat a patient with blood clots?"}, {"date": "1 Oct 2021", "title": "New Grad RN Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Summerlin Hospital", "Interview Descriptions": "You sit down with multiple med surge department heads. They are all super friendly and try to make you feel less nervous. Be prepared to answer a few clinical questions (super basic).", "Interview Questions": "Tell us something about yourself that makes you stand out from other new nurses. What labs to check for when a patient is taking lasix? "}, {"date": "1 Sept 2021", "title": "Cerified Phlebotomist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Summerlin Hospital", "Interview Descriptions": "Wasn’t too bad. Lasted about 30 minutes. Have a thorough description of the position and what to expect as far as the interview process goes. All steps were explained and kept in contact throughout the process", "Interview Questions": "Previous experience and what would I do in specific situations"}, {"date": "28 Jul 2021", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Summerlin Hospital (Las Vegas, NV)", "Interview Descriptions": "It was with a few managers from different units. They asked several personal questions such as tell me about yourself, etc., and then asked me nursing scenario questions. It was a bit intimidating since there were a few managers but they were all nice and friendly. Just be confident and you'll do fine.", "Interview Questions": "Tell me about yourself and your qualities. "}, {"date": "29 Aug 2019", "title": "CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Summerlin Hospital (Las Vegas, NV) in Feb 2019", "Interview Descriptions": "It was a great experience getting interviewed by multiple people at once. They asked questions about myself and events of what I did at my previous job and what I can bring to the hospital.", "Interview Questions": "If you know a patient is fall risk, what would you do to keep the patient safe?"}, {"date": "14 Sept 2018", "title": "Medical Technologist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Summerlin Hospital", "Interview Descriptions": "I came from out of state so it was a phone interview. I interviewed with the supervisor while the manager was out of town. It was a basic interview. I didn't hear back for a few weeks but they did reach out after about a month.", "Interview Questions": "How do you handle stress?"}, {"date": "12 Jul 2019", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Summerlin Hospital (Las Vegas, NV) in Jul 2018", "Interview Descriptions": "Fast, easy, friendly.  I had my resume with me. The Manager was very welcoming and informative,  showed the unit, showed patient's rooms, break room, nursing station,  and introduced me to the staff.  The hiring process was quick and easy.", "Interview Questions": "What type of patients you cared for?"}, {"date": "7 Apr 2018", "title": "OB/GYN Postpartum Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Summerlin Hospital (Henderson, NV) in Apr 2018", "Interview Descriptions": "I got a call the hiring manager we met and she was the nicest person ever. Just be yourself, smile, honest, and show willingness of wanting to be part of their team and you’ll get the job.", "Interview Questions": "What can you offer Summerlin Hospital ?"}, {"date": "7 Sept 2017", "title": "Evs Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Summerlin Hospital (Las Vegas, NV) in May 2014", "Interview Descriptions": "Interview was brief, and straight to the point. Not intimidating at all, interviewer was kind, making the interview easier. After interview you go in for a group orientation with food provided.", "Interview Questions": "What are your strengths, and what are your weaknesses?"}], [{"date": "6 Sept 2014", "title": "Software Support Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 1 week. I interviewed at Summerlin Hospital in May 2012", "Interview Descriptions": "I was hired by a third party agency. The recruiter wanted to know what modules of Cerner I was familiar with? I responded : I'm familiar with the following Cerner Modules: Power Notes, Power Charts, First Net , and CPOE. \r\nAfter completing the phone interview, the recruiter advised me he would get back with me after submitting my resume to the hiring manager. The recruiter got back with me in a couple of day's and advised me of the next step. The next step was to complete my paper work for back ground check and drug test.", "Interview Questions": "I did not have a difficult or unexpected question. I made sure I was prepared for the interview. "}]]