[[{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great company, great leadership", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 8 years", "job_date": "25 Apr 2019", "job_title": "Senior Admissions Representative in Chicago, IL", "duration": "N/A", "pros": "High salary, great benefits, team atmosphere, you get to help lots of people while being compensated properly.", "cons": "Sometimes you had to work weekends and during the week until 8pm"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Horrible", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "7 Dec 2022", "job_title": "Instructor in Chicago, IL", "duration": "N/A", "pros": "None, there are no pros", "cons": "Worst job ever. Regret completely"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Hard school to “sell”", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "24 Aug 2022", "job_title": "Admissions Representative in Chicago, IL", "duration": "N/A", "pros": "Their training was good for new employees", "cons": "You had quote to hit for new admissions. It’s hard to sell a college just to hit quota"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Warning", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "29 Jul 2022", "job_title": "Assist Director in Chicago, IL", "duration": "N/A", "pros": "All were disappointing, short lived....", "cons": "Poor management. Latch of growth opportunity, and poor benefits."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Buyer Beware", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 8 years", "job_date": "6 Apr 2022", "job_title": "Business Office Manager in Denver, CO", "duration": "N/A", "pros": "You have the ability to take classes entirely online.", "cons": "You are going to receive career advice that isn't true. Admissions is going to hound you endlessly until you enroll. Then, you are going to pay more for a bachelor's degree than if you had gotten your doctorate."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "BEWARE", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "22 Oct 2014", "job_title": "Online Admissions Representative in Denver, CO", "duration": "N/A", "pros": "The Co-workers were the best part of the job. I meet and worked with a lot of really amazing people working at West wood.Co-workers were amazing, helpful and friendly. I am grateful for gaining valuable sales experience that will be needed for future work with a real company. Yes, you do have the opportunity to help students change their lives through education, however you end up hurting far more students, than actually helping, in the process. You are responsible for getting students into school that are not ready for school, don't have the computer skills for online classes, no time for for school or really don't have the ability or desire to make it through school.", "cons": "The admissions positions at West wood college is a revolving door for employees.Most employee's are let go within the first year due to not meeting their goals( Number of students they enroll) The metrics and standards set by the school are so tough that only a few representatives are able to meet them. The main goal is to enroll as many students and have them start for classes so that the school can collect federal financial aid from the students. Then get those students to take out loans to cover the remainder potion for the extremely overpriced school.  For-profits schools in general, including West wood, needs a complete top to bottom overhaul or needs to cease to exist altogether."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "I've been very impressed by the progress of the institution and I support the direction it is headed.", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "5 Aug 2013", "job_title": "Anonymous Employee in Denver, CO", "duration": "N/A", "pros": "I've been lucky to work closely with people who genuinely care about doing the right thing and serving the students and graduates of the college. Every campus I've visited has an extremely positive and welcoming environment, run by people who believe in their students. There are so many programs that are created to enhance the culture of the organization and add to the community of everyone who works for and attends the school. I've worked for other companies that have reacted poorly to some pretty challenging situations and the way I've observed Westwood handling their specific challenges is very impressive and promising. No organization is perfect, but the way the college aspires to be better is reflective of the truly good people who make it all work from the ground up.", "cons": "The organization has some more work to do to build the culture of its employees, but I've seen improvement over the years and I believe it will continue to get better. There will always be individuals who choose to focus on the negatives in any organization, but overall if the leadership team listens to the faculty and staff and continues to make improvements that lead to better outcomes for students, I can't see any significant cons."}, {"Recommended": "N/A", "CEO Approval": "Neutral", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 3, "review_title": "I enjoy the \"hands off\" experience and flexibility in my schedule as I teach Online.", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "12 Nov 2011", "job_title": "Adjunct Faculty in Denver, CO", "duration": "N/A", "pros": "Good Chairperson support (they are the direct managers over adjunct faculty). Good Student Advisor support. Flexible schedule. This is the Online school. Many of the adult learners are amazing.", "cons": "No raises for adjunct faculty. No vacations for adjunct faculty with any substitute teaching. There used to be substitute teachers for online but this service was taken away. If you travel you have to take a computer with you and work late at night while vacationing with others during the day. There is a lack of technical support for problems with student Webspace and the Adobe Connect rooms. The Adobe Connect rooms for live meetings disconnect sharing frequently and disconnect all together at least one time during meetings. Instructors used to have a lot more input with respect to the class designs and which classes were taught and added to the curriculum."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 0, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 0, "review_title": "Strong Educational Product with Enticing Chicago Experience for Out of State HS Students.", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "21 Jul 2013", "job_title": "High School Field Admissions Representative in Chicago, IL", "duration": "N/A", "pros": "Pay, Reviews, Bachelor Programs Offered for HS Students, Training.", "cons": "Manager bullied staff. The week after qualifying and receiving a $2k raise after my first 6 months my HSDOA said multiple times he really hoped he made the right decision and that I would prove it. Also would call early on Saturday and demand activity and make statements against family time church etc. and would often use cuss words inappropriately on one on one calls. Staff meetings he was a lot better because others were around. It is sad I had this experience because after 11 months I needed to resign after the above tactics and him saying \"I never jumped $20k in 1 yr by sitting on my ass eating Cheetos watching movies with my wife and kids I had to get out there and work!\" also the straw that broke the camels back was \"I love God with all my heart but God doesn't pay my f*****g bills\" Although an amazing salesman and great trainer who I learned a lot from and enjoyed everything about the product and company I was selling for, he was just too old school bi-polar militant leadership style that although I was 5 hrs away in St Louis recruiting for Chicago and making it happen needed to re-sign to keep my values in perspective."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "N/A", "Work/Life Balance": 0, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "glorified salesperson", "rating": "2.0", "reviewer_affiliation": "Former Employee", "job_date": "6 Sept 2009", "job_title": "Admissions Representative in Calumet City, IL", "duration": "N/A", "pros": "some great people to work with. training offered in denver.", "cons": "sales, with sales quotas and tons of cold calling. You have to enroll so many students a week, month, period whether they are right for the school or not. The staff surrounding the enrollment process are under-qualified, underpaid, and overworked which means that you end up doing everyone else's job. Often it will take someone in student services 20 minutes just to respond to your original request or question and if something is missing for \"your student\" you need to fix it. Hand holding is a necessity and the show rate for appts is around 20%. Leads are given to you but it is based on how your performance is which means you constantly have to prove yourself in order to do your job. Getting on the wrong side of management means that you will be cutoff and it will be impossible to hit your quota's and do your job."}], [{"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 3, "review_title": "Worked hard established myself as core subject matter expert and in the end it was a fulfilling teaching experience.", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "10 May 2014", "job_title": "Full-Time Instructor in Calumet City, IL", "duration": "N/A", "pros": "Working with the students and helping them overcome their difficulties. This is the real perk to the job.", "cons": "Even though my track record was perfect and never called off in 8 years they let me go because they couldn't offer me 3 classes.\r\n\r\nComplete hands off administration. \r\n\r\nDisrespectful and aggressive financial aid staff interrupting class to intercept students to fill out financial aide forms, etc. \r\n\r\nCost of school is astronomical. 80k for a bachelor's degree. Many students never see that salary upon graduation and default on their loans.\r\n\r\nNo vacation, No matching 401k."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Admissions Dept in need of overhaul", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "8 May 2013", "job_title": "Admissions Representative in Denver, CO", "duration": "N/A", "pros": "The actual team members I work with are fantastic. Management was a different story. Several years ago, there was an opportunity to make more money and move around in the company. However, for the past 3 years, there have been salary freezes.", "cons": "Unrealistic goals and terrible leads; Rude management personalities and micro-management with time management throughout the day. The Admissions team was required to use their 30 min break time to use the restroom. \r\n\r\nSelling a 75K degree over the phone in 2 hours time; with all the negative press and disclosures, and consistent  IT issues was not a good experience. \r\n\r\nHR dept with little compassion for representatives - and more aligned with Director's agendas and disciplinary actions, than fairness."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 4, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "Felt a little morally bankrupt as an Admissions Rep", "rating": "2.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "9 Nov 2014", "job_title": "Admissions Representative in Denver, CO", "duration": "N/A", "pros": "Payrate is decent\r\nGreat co-workers who seem to believe in what they are doing\r\nMy supervisor was respnisive and communicative...you knew where you stood.\r\nSales experience (make no mistake...this is a SALES job)", "cons": "You are actively participating in bankrupting students who really have not business/ need to pay $40,000+ for an education that probably will not result in a position that will allow them to payback that loan\r\nThey say your pay is not based on enrollments....but it most assuredly is.\r\nLooking back...I feel dirty and dishonest after working in admissions here.  They are very good at cheerleading the school, the system and thier sales staff...and I bought it.  Now I am ashamed that I did."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "Miserable", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "7 Sept 2015", "job_title": "Admissions Representative in Woodridge, IL", "duration": "N/A", "pros": "Decent pay. Lots of great people work there, but I got the feeling that most of them didn't have a choice. There were also a few great instructors.", "cons": "On paper, my job was an Admissions Representative. In practice, I was a sales person. There was incredible pressure to recruit students and convince them to take out tens of thousands of dollars in loans at any cost. I was told that veterans were easy recruits because they have \"Uncle Sam money\" to pay for school. And once you convinced a student to enroll, you had 14 days to convince them to remain enrolled. There was a saying: \"As**s in classes for 14 days,\" which referred to the requirement that the college wouldn't receive money from government-issued student loans unless the student is there for a minimum of 14 days. If they didn't stay those 14 days, I couldn't count that enrollment towards my enrollment quota. In the end, I was fired for not enrolling enough people. It was the best thing that could have happened to me."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Design Faculty Experience", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "8 Jan 2015", "job_title": "Instructor in Woodridge, IL", "duration": "N/A", "pros": "Over my long stay with the campus I have come to know a lot of talented and passionate students and faculty members.  Insurance and salary used to be fairly good.  I had the opportunity to open my lab so that groups of students could voluntarily work long hours on extracurricular projects.  In the past, I would rate the workplace as a positive place where there is no shortage of opportunities to engage students.", "cons": "Regulatory and legal problems abound and the student body is dwindling.  There is little need for instructors since the student body has shrunken so drastically that it is likely that the campus will close.  In recent years there has been a reduction in force and there are practically no benefits.  Ratings will be very low if I base them on the current state of the campus."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "N/A", "Work/Life Balance": 0, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 1, "Senior Management": 0, "review_title": "Good place to get experience but do not plan on staying long term.", "rating": "2.0", "reviewer_affiliation": "Former Employee", "job_date": "24 Feb 2011", "job_title": " in Denver, CO", "duration": "N/A", "pros": "Flexible hours, free parking, gym on site", "cons": "Salaries are way under market which is probably why they cannot hold onto anybody that is worth anything. Raises are pretty much non-existent and bonus for one year was a 15 dollar Mc Donalds gift card. When somebody leaves then they just dump extra work on who ever is left. Managers say they appreciate you and respect you but actions are quite different. It does not have to be spoken but is already understood that you are a disposable unit. It is sad that they are so concerned with the bottom line and not the quality of the product."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "N/A", "Work/Life Balance": 1, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "This Career College is under investigation by the Federal Government, practices are less than professional.", "rating": "2.0", "reviewer_affiliation": "Current Employee", "job_date": "11 Jul 2011", "job_title": " in Dallas, TX", "duration": "N/A", "pros": "you can help lower income students get an education", "cons": "low level students, high turnover of teachers, corporate profits come before educational standards, students rule teachers through fear of feedback to keep jobs, all that matters is student numbers. Overall quality of programs is low and intellectual quality of students is generally lower than it should be. Many come from backgrounds with great social and emotional problems. Work load is extremely high with little support or funding."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Average Company - needs improvement", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "9 Aug 2009", "job_title": " in Anaheim, CA", "duration": "N/A", "pros": "Staff is friendly (well non-management) --- you get a sense of \"You are in this together\"\r\nFree food whenever student events are held at campus", "cons": "Lower than average wages\r\nBudget seems to be focused more on external apperances at Westwood compared to internal improvement. This means money will go toward an xbox 360 for student lounge first before updated software to teach for class."}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 5, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 5, "Senior Management": 0, "review_title": "Apply Only if Your Background is in Design and Business!!!", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "5 May 2013", "job_title": "Instructor in Beirut", "duration": "N/A", "pros": "Pay is great\r\nSome faculty and staff are really helpful, caring and supportive\r\nDepending on your teaching area, you will always have courses to teach", "cons": "High Turn-Over rate in all departments\r\nDepending on your teaching area, you may not have courses to teach\r\nSome department chairs do not work well with some instructors"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 5, "review_title": "Executive Administrator", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 8 years", "job_date": "14 Aug 2015", "job_title": "Executive Administrator in Denver, CO", "duration": "N/A", "pros": "Westwood College is a great company!  Fantastic, engaged, intelligent employees who really value what they do and the contribution they make to helping people be successful.  I worked directly with the executive team and found them to be very committed and ethical in an environment where the industry was being maligned on a daily basis.  I was proud to work for them.", "cons": "For me, the only downside was relocating the office to lengthen my commute.  It was also difficult to see downsizing during a rough time with the economy and the education industry as a whole."}], [{"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Money Hungry Soul Suckers", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "25 Jan 2016", "job_title": "Senior Admissions Representative in Douglasville, GA", "duration": "N/A", "pros": "My coworkers were mostly awesome people who really cared about the students, however, burn out can take it's toll on everyone.", "cons": "Those in power didn't really care about the students and those who did care had no power to change things or do what needed to be done or make the needed decisions. Those with the most power put people with little to no experience in management positions so that they could be pawns and \"yes\" men because they had no actual education, training or experience to know any better."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "Great place for a second career", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "25 Jun 2015", "job_title": "Full-Time Instructor in Atlanta, GA", "duration": "N/A", "pros": "I joined Westwood as an adjunct and was promoted after one year. I had been forced to retire from the public school system after I turned sixty. Westwood has a great diversity of students, which allows me to use my special talents in special education and teaching English as a second language learners. I have enjoyed full support from the administration. This has allowed me to introduce an expanded curriculum in mathematics and the science classes.", "cons": "I think that more thought should be given when planning scheduling for mathematics class. Five and six hour math classes don't work. The classes need to be broken into two class periods."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Hopefully things have changed!", "rating": "2.0", "reviewer_affiliation": "Former Employee", "job_date": "29 Oct 2015", "job_title": "Admissions Representative in Denver, CO", "duration": "N/A", "pros": "I worked in Admissions for the online campus, and for the most part, the people I worked with were awesome. The middle management genuinely wants you to succeed, and they do that with very structured, well-coordinated training.", "cons": "Upper management and the executive division were both hot messes They over-budgeted, were completely oblivious to the down trend in the for-profit educational markets, and unfortunately, it cost about eighty people their jobs as a result of a corporate layoff."}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "You'll make great friends... but that's about it", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "15 Sept 2014", "job_title": "Admissions Representative in Denver, CO", "duration": "N/A", "pros": "Great people that work there, pay is really good", "cons": "it will suck your soul, the school cost WAY too much, managers have no idea what they are doing, they run off all good reps and just hire new ones, completely number focused even though it is illegal. Also, there is no room for advancement or lateral movement what so ever."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "It was very rewarding helping students earn a degree who may not have had a chance othewise.", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "25 Oct 2013", "job_title": "Admissions Representative in Westminster, CO", "duration": "N/A", "pros": "Getting to know students personally and helping them on their journey to earn their degree and change their lives.", "cons": "A lot of emphasis is placed on and enrollment being a \"sale\" where the human value and importance of education can be lost."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "If you hit your metrics you will do great!", "rating": "4.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "14 Sept 2014", "job_title": "Admissions Representative in Chicago, IL", "duration": "N/A", "pros": "Compensation, Office environment with the ability to leave your office if need be, friendly staff members, Majority of employees are always looking out for the students and their best interests which provides success for the student and the school", "cons": "Some members of management are two-faced and manipulative making it hard to withstand for a long time, Metrics are high even during a drought of a mindset that education is worth it"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "For-profit college internal struggle; Fantastic co-workers", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "7 Apr 2014", "job_title": "Instructor in Arlington, VA", "duration": "N/A", "pros": "Co-workers were professional, courteous, kind. Hiring manager was laid back, easy to talk to. Not intimidating at all. Willing to work with my schedule to determine teaching schedule. Were open to me incorporating fresh ideas to the shared syllabus. Free parking at building for instructors.", "cons": "Training session was tiresome, but expected. It's hard to teach young people knowing that they are going into tremendous amounts of debt just to get a diploma from an unaccredited university. (Hiring managers typically only accept accredited colleges and universities when reviewing applicants.) Seeing the recruitment process first hand was sobering. Talk about a moral/ethical dilemma. I had to leave."}, {"Recommended": "Yes", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Lower level management means well, but the \"C\" level executives are a mess.", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "28 May 2013", "job_title": "Admissions Representative in Centennial, CO", "duration": "N/A", "pros": "The team managers (called Directors Of Admissions), were great and wanted to see everyone succeed. The leaders just above them were great as well.", "cons": "The executive team for Alta really are the ones who are responsible for the negativity involved in the company. When pressed about why Westwood was being sued (in a meeting with about 2000 employees there), the COO said, and I quote \"Above my pay grade\". Have never actually heard a bunch of employees literally \"boo\" one of their bosses."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "I worked in admissions and as a trainer for over 3 years", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "26 Nov 2013", "job_title": "Admissions Representative in Denver, CO", "duration": "N/A", "pros": "Really excellent training department when I was there.  They really make sure their employees know the job.  Also, this is one of the funnest places I ever worked, in terms of working with great co-workers.", "cons": "It's a nationally accredited university which means the education does little to nothing for the students we were enrolling. It's hard to stomach at the end of the day.  There are also aggressive sales tactics and clever ways we are taught to not tell students about the detriment of going to a nationally accredited college."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Worst Experience Ever", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "16 Jul 2014", "job_title": "Anonymous Employee in Atlanta, GA", "duration": "N/A", "pros": "There aren't any to give.", "cons": "Low level students, they learned to manipulate management by threatening to leave if you don't do what they want. They also rule teachers through fear of feedback to keep jobs, this is what matters to the Dean and Program Chairs. \r\n\r\nThe Campus President compared the programs to selling cars. The employees are deceptive and back stabbers. The program chair smile in my face while looking for my replacement. \r\n\r\nI worked crazy hours like 8:00 am to 10:30 pm.  They were angry when I wanted to discuss this issue. \r\n\r\nOverall quality is subpar. Tired of calling students who refused to show up for class. They are allowed an unusual amount of days out of class. All of them come from backgrounds with great social and emotional problems."}], [{"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Not even close to acceptable.  Stay away. Period.", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "18 Mar 2014", "job_title": "Graduate Advisor in Woodridge, IL", "duration": "N/A", "pros": "Met some really nice people.", "cons": "They charge way too much to not education their students!  These poor students think they are \"accepted\" to a higher education institution, but whats really happening is Westwood is signing them up for lifetime debt for education that's definitely not worth the sticker price. Management could take quite a few lessons on how to manage and lead.  Directors do shady things to keep the school in operation.  Stay away from this place!  The pay is much lower then most higher education institutions, yet they charge about the same or more than reputable institutions.  So where's the money going??? Upper level management, that's where!"}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "A good place to work.", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "5 Aug 2010", "job_title": "Instructional Designer in Denver, CO", "duration": "N/A", "pros": "Great place to learn and grow professionally because of peer collaboration. Sharing of ideas and integration of those ideas into processes is also a plus.", "cons": "Sometimes, there is so much work to be done, that colleagues are unaware of the work that others are doing, because there is no time to share that work."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "My Experience at Westwood College", "rating": "3.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "20 Dec 2016", "job_title": "Print Center Operator", "duration": "N/A", "pros": "There are some great instructors there that teaches, and have 20+ years in the industry in which they teach. They are very professional as well.", "cons": "There are other employers who are not instructors that did not set examples concerning honest and ethical behaviors, they stole from the company thinking that they would never get caught. There was another issue as well, the school was not state accredited which is one reason why they are being sued and couple with the employee's steeling, Westwood College went under and had no choice but to close its' doors for good here in Atlanta, GA."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "N/A", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "okay place if you can get over their unethical business practices", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "28 May 2013", "job_title": "Anonymous Employee in Denver, CO", "duration": "N/A", "pros": "great place to start in the field of instructional design or educational technology. Good practice.", "cons": "One major con is that once you have Westwood on your CV, it is difficult to get a job anywhere else. People all around the area distrust Westwood because of their terrible ethical standards. Management is micromanaging and looks over your shoulder at everything you are doing. If you are in the bathroom \"too long\" you get suspicious looks from your manager. It is a culture of distrust."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Sunny at times, but mostly shady", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "11 Mar 2014", "job_title": "Senior Admission Representative in Chicago, IL", "duration": "N/A", "pros": "-Decent pay.  I got in when they were able to monetarily reward their admissions representatives for good performance.  New incoming employees may not think the pay is decent now that they have a new pay structure.  \r\n-For the most part it was a fun atmosphere until they got into trouble for employing a few bad apples in their admissions and financial aid departments.  Then it felt like you were walking through a field of land mines.\r\n-The career focused, small class sizes, accelerated format is a great fit for some people.", "cons": "- Everything in admissions is scripted, so you will always feel on edge about saying exactly the right things in exactly the right way.  Ever since they got into trouble we were observed and secret shopped constantly.  \r\n-Your calls are monitored, so expect to make 75 calls a day, and expect to answer to why you did not make that many the next day if you fail to do so.  The director of admissions will also record your calls and make sure you are following the phone script.  Periodically, they will send you recordings of your phone calls, so you must always be on your game.  \r\n-There is major favoritism. As a newcomer, expect to call off of call sheets that are a couple of months old.  You will be calling prospects that the more senior representatives could not convert into students.  The quality of prospects you will receive will depend on your \"numbers\", so don't have a bad class because you will most likely be punished by not getting any quality prospects.  And then you will be grilled for your continued poor performance even though they know the types of leads they are providing you.          \r\n-The school is very expensive.  Students leave with a lot more debt than if they went to a not for profit institution.  The Westwood College student default rate is extremely poor.  They target the low income, first generation college student and charge them extremely high tuition.     \r\n-The benefits are not very good."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 4, "review_title": "Good while it lasted", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "29 Dec 2015", "job_title": "Anonymous Employee in Los Angeles, CA", "duration": "N/A", "pros": "Worked with some great people that really cared about the students and worked hard", "cons": "The company stopped enrolling students therefore, it will be closing soon. There are some people that work for the company that should have left along time ago. They did not seem to care about the overall goal of the company."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "Telemarketing. Not Advising.", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "29 Nov 2012", "job_title": "Admissions Representative in Chicago, IL", "duration": "N/A", "pros": "I get along great with my team and director.\r\nOk pay.\r\nGood PTO (if you can use it)", "cons": "Goals are very un practical\r\nlate hours\r\nAG suit-so enrolling and even 'career orientations' are very difficult...not sure IL campuses will be around in the near future...?\r\nlots of un ethical tactics have to happen it seems to be successful\r\nnot enough leads-too many people-its like one carcus and 10 voltures. and then the leads get killed by feeling bombarded."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "N/A", "Work/Life Balance": 0, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "Working at Westwood was a horrible experience where they show no shame in taking advantage of people.", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "19 May 2011", "job_title": "Admissions Representative in Denver, CO", "duration": "N/A", "pros": "One good thing about working for Westwood College Online is that they pay a decent wage and offer benefits health benefits.", "cons": "They do not care that employees feel that what they are doing is unethical.  They do not give good feedback on how to become a better representative when the representative continues to dial the phone and get hung up on for calling the same person for the 20th time."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "The Job Title should be \"Sales Person\" and not \"Admission Rep\"", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "16 Sept 2012", "job_title": "Admissions Representative in West Chicago, IL", "duration": "N/A", "pros": "You have your own office\r\nDecent pay", "cons": "Sales, sales and more sales\r\nThe school has a bed reputation\r\nYou are required to enroll as many as possible to meet your quota\r\nVery stressful\r\nLots of micromanaging\r\nManagement has no idea what they're doing\r\nI felt like i was doing something really wrong each time I enrolled someone to school\r\nOverall, you have to be an sales person, who is good in selling a product no matter what to thrive there. I just don't think that sales and higher education should ever be mixed."}, {"Recommended": "N/A", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Career college working to provide world or experience to students", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "26 Aug 2012", "job_title": "Program Chair/Education in Denver, CO", "duration": "N/A", "pros": "Staff in both my previous department and current department truly care what happens to students and perform their jobs with the intent to help every student succeed.", "cons": "Alta does try to guess where issues may arise and sometimes puts too many restrictions upon itself rather than waiting for final legislation. They also tend to send program information and changes outin pieces rather than providing all of the necessary info to all campuses at the same time and before it might be a problem."}], [{"Recommended": "No", "CEO Approval": "No", "Business Outlook": "N/A", "Work/Life Balance": 0, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 4, "review_title": "Aroller coaster ride! The company need solid direction and communication from the employees on improving.", "rating": "2.0", "reviewer_affiliation": "Former Employee", "job_date": "14 Jul 2011", "job_title": "Senior Admission Representative in Anaheim, CA", "duration": "N/A", "pros": "A check and benefits was the reason.  At first it was an opportunity until you get inside and see the\r\ncold staff.", "cons": "High pressure, management got attitudes of \"Who are you\" Good old boy network and not connecting with the workers!"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "Could Have Been Great", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "29 Dec 2015", "job_title": "Anonymous Employee in Torrance, CA", "duration": "N/A", "pros": "I have worked at 2 campuses. Each campus had a great team. There was so much potential in each department. Great co-workers.", "cons": "Corporate management didn't seem to know what they were doing, which greatly affected us at the campus levels. Each decision by management brought down morale. They thought they were doing better but in reality they were putting salt on old (and new) wounds."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "It was great at first, until they get tired of you", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "13 Sept 2013", "job_title": "Student Services Advisor in Upland, CA", "duration": "N/A", "pros": "Compensation was pretty good for a for-profit school. And as long as you work there, you get to go to school there for free, minus book fees.", "cons": "Even if you're doing a good job and being productive, if your manager or the president of the campus are tired of you, or seeing you everyday, you might as well start looking elsewhere."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Nothing Special", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "12 Dec 2012", "job_title": "Administration in Denver, CO", "duration": "N/A", "pros": "Decent salaries, good people at the campus level, good programs, solid faculty", "cons": "Top management is too concerned about profits and not about their people.  Executive management making bad decisions.  Nothing really different about the system as compared to other for profits.  No pay increases 2 out of last 3 years and employees told to do more with less."}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Hard work, but rewarding", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "17 Nov 2011", "job_title": "Admissions Representative in Los Angeles, CA", "duration": "N/A", "pros": "fun environment, lots of training, talented individuals, good benefits, good recognition programs, departments work well together- lots of internal customer service", "cons": "not appreciated, work your butt off, make sure to negotiate a good salary when you start- if not, your screwed, nationally accredited school- has a bad reputation which is no fault of your own, but you are left defending the school all the time to students, parents and other professionals/companies"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Been here for 7 years and it's been a very good experience", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "8 Mar 2014", "job_title": "Marketing in Denver, CO", "duration": "N/A", "pros": "The organization has a great mission and has helped thousands of students get the skills and training to find meaningful work. It is a collaborative environment and there is an openness to trying out new ideas.", "cons": "The organization has gone trough a lot of regulatory and legal issues and at times has lost focus. This has also impacted the culture and we've seen a lot of great people leave the organization."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Poor management and technology infrastructure", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "5 Sept 2012", "job_title": "Information Technology in Denver, CO", "duration": "N/A", "pros": "The salary  for IT is good but you will work a lot of off hours.  And don't even think about asking for PTO time for all the weekend and nights you will work.", "cons": "Besides all the bad press and lawsuits, the management is a joke.  I have yet to meet an inspirational manager.  \r\nThe 401k contribution is depressing and almost not worth contributing to at all.\r\nLong hours that will impact your nights and weekends\r\nNo compassion from leadership\r\nNo opportunity to move around the company\r\nLies, lies, and more lies"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "Company Out of Business", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 10 years", "job_date": "13 Apr 2016", "job_title": "Director in Denver, CO", "duration": "N/A", "pros": "Great people, awesome to support students achieve their goals and provide access to a college education for students regardless of their financial status.", "cons": "Decisions in key strategic areas were not made in order to keep the doors open. It is unfortunate so many students are now deprived of access to a great education."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": "N/A", "Senior Management": 1, "review_title": "Shut this place down", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "6 Feb 2016", "job_title": "Anonymous Employee in Woodridge, IL", "duration": "N/A", "pros": "There are no pros this place is a joke.", "cons": "As a graphic/web design student, they didn't have enough staff for my major and they didn't have enough web classes either. Plus now they are saying that they're no longer going to have the graphic design program at the damage campus. Gee I wonder why, probably bc the school is not accredited through the region which hurts your chances at a few companies. Plus the school is way overpriced. I am over 90K in student loans bc I had to take out a few grants in order to stay there. They don't care about their students. Stay away."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Not A Place Where You Can Succeed", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "6 Feb 2015", "job_title": "Admissions Representative in Los Angeles, CA", "duration": "N/A", "pros": "Every now and then you actually feel like you are helping someone.", "cons": "Success in this position is next to impossible without playing company politics and being fed.  The standards are so unrealistic, they will push you to enroll anyone. They count on you losing 50% of your enrollments and practically want you to lie to keep students in school 14 days.  Instructors are disgruntled and under paid. Resources for students are non existent.  This school will not last."}], [{"Recommended": "No", "CEO Approval": "No", "Business Outlook": "N/A", "Work/Life Balance": 0, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Not what I expected, good start to gaining experience but not a place for long term employment", "rating": "1.0", "reviewer_affiliation": "Current Employee", "job_date": "17 Mar 2012", "job_title": "Admissions Representative in Denver, CO", "duration": "N/A", "pros": "Being able to fall back on your co-workers for assistance, location is safe. Reimbursement is fine for those at entry level.", "cons": "More like telemarketing than admissions. Not helping future students gain an education but more like selling the product. College has a bad reputation, having to defend the college. High stress. Not being able to help current or future students with their academics, have to be more concerned about getting them enrolled and keeping them enrolled whatever it takes."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Management doesn't care about employees", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "23 Jun 2014", "job_title": "Instructor in Broomfield, CO", "duration": "N/A", "pros": "Great co workers, working with students.", "cons": "Really don't want people to stay a long time, Took away long term benefits. Student numbers is all they care about. not the quality of the students, Admissions people lie about wages and jobs. No raises for last 4 years. Money from one program goes to other programs not back into one that's making it."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 4, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 4, "Senior Management": 0, "review_title": "Admissions department.", "rating": "2.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "14 Aug 2014", "job_title": "Admissions Representative in Denver, CO", "duration": "N/A", "pros": "The salary and benefits were good.", "cons": "As a Admissions representative you had to lie to get people to attend a school where the degree was not recognized, the cost for the programs outside of computers was not worth the  money as the ROI was not there. You don't need a degree for a career that will only pay you $12.00 an hour and have over $60K in debt."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Sweatshop environment, low ethics, encouraged manipulate prospective students.", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "10 Oct 2013", "job_title": "Admissions Representative in Denver, CO", "duration": "N/A", "pros": "If you are good with people this is a place you can use your skills, but there are many more places that will treat you better and pay better too", "cons": "Poor products, deceptive marketing techniques, incomplete training, no long-term invesment with their own people"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 5, "review_title": "This is not a kiddy college", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "10 Jun 2014", "job_title": "Faculty in Atlanta, GA", "duration": "N/A", "pros": "Westwood has been a great place to apply my prior experience in teaching nontraditional students. I feel like the students that attend here really want to improve their lives and that the faculty is here to help make that happen. The training and community at Westwood is terrific.", "cons": "I don't see a clear path for advancement with in the organization. There is no internal posting system for openings."}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 0, "Senior Management": 3, "review_title": "My experience at Westwood College has been rewarding.", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "16 Dec 2013", "job_title": "Adjunct Instructor in Arlington, VA", "duration": "N/A", "pros": "Some of the best reasons to work at Westwood College is the fact you interact with a diverse and intelligent student body and the environment/atmosphere is inviting.", "cons": "Some of the reasons for not working at Westwood College includes their marginal salaries and advancement may not come as quickly as one may desire."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Biggest mistake I ever made.", "rating": "1.0", "reviewer_affiliation": "Current Employee", "job_date": "7 Mar 2015", "job_title": " in Chicago, IL", "duration": "N/A", "pros": "Faculty and staff genuinely care about the students despite their treatment from management.", "cons": "College worries more about money than they do about students. Retention is important, but this campus president takes it to an extreme and is known for going off on rampages. Forces faculty and staff to call any student who misses a class. Students receive many calls and respond that they feel 'stalked.' Rumors are constantly heard about the colleges financial struggles and possible campus closures. Definitely an environment of fear."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 4, "Senior Management": 0, "review_title": "All about the numbers!", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "16 Jun 2012", "job_title": "Admissions Representative in Denver, CO", "duration": "N/A", "pros": "Good pay\r\nDecent benefits\r\nSome great co-workers\r\nTuition assistance is available", "cons": "It's a sales job as much as they tell you it's all about the student. \r\nHIGH turnover rate- about a third of employees have been there less than a year.\r\nMakes you doubt your own integrity because you can lose your job if a certain number of students don't start.\r\nSchool has a bad reputation and just tries to shove it under the rug. \r\nStressful"}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "Eh. They are going to shut down soon anyway.", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "19 Aug 2013", "job_title": "Admissions Representative in Chicago, IL", "duration": "N/A", "pros": "My Admissions Director was the main reason I stayed for so long. The man CARES about his employees. Don't see that much in sales.", "cons": "Cut throat. And when I say cut throat I don't mean fellow employees jump on your leads every so often 'by mistake'. I mean you better call your leads like 500 times to get that answer because if you don't...you have like 8 other reps calling FROM YOUR SCHOOL. Your Assistant Director? The one whos the 'biggest team player'? Yeah..he's got time tables/Outlook reminders of when to call all of his Admin. reps leads. People who have been there for more than a couple years know the tricks. If you don't-you'll sink quick. The vets want you out so more lead rotation goes in their favor. More new people-more leads for them. Get ready too-youll have rules but vets don't follow them. I would suggest you play dumb and play their game. \"oh im sorry I called him by accident! I enrolled him because I had NO idea!...you can have my lead list if you want!' (that have already been called 50+ times)\r\n\r\nPrograms WW SAYS they offer...and the ones they actually do. If they don't have enough kids-they cancel the program for that term. Oh and expect to be selling over 80k/year programs When these kids/adults will MAYBE make...12 bucks an hour? At a high? Good luck convincing because a lot of these people cant even pay for a 2.50 blue line ride let alone make payments for school (which by the way-WILL happen. Rare they get most/all covered) And the Career Services? Only will help your student get a job IF it helps them. There is a certain time span they have. If the student doesn't fall in it-oh well. They will just avoid them and not return their calls. Then they will cancel/drop because well...cant get a job. \r\n\r\nThe hours aren't great. 8pm at night? Really? \r\n\r\nRegardless-for profit is going to Hell. Westwood is going under...so if you want a OK paycheck to tie you over for a bit, go for it."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Don't work here if you care about Education", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "16 Jan 2014", "job_title": "Admissions Representative in Woodridge, IL", "duration": "N/A", "pros": "Decent pay. Close to home. Got to know some good people who processed loans and such. They flew me to Denver for training too.", "cons": "I accepted a position there because I genuinely care about students. I have a degree in education and when the economy tanked, this was a good option. Sometimes I wonder if that's the only reason they hired me--so they could tell their critics that their staff has education experience.\r\n\r\nAt the beginning of every semester, there are these intense meetings for 14 days straight, at least an hour or more each day. All of the department heads would have to attend. The purpose of that meeting? To figure out why student A, B or C hasn't processed their paperwork for their loans/grants/military benefits yet. Why 14 days? Because that's the magic number of days that the federal government requires a student to be attending class before they will send the loan and grant money to a college. The saying was \"We need asses in classes.\"\r\n\r\nAfter 14-days, I was told to stop caring about those students I had just recruited and start recruiting new ones for the next session. The only reason I should be talking to old students is to get names and phone numbers of new people to recruit. \r\n\r\nWe received incentive pay for meeting and exceeding recruiting goals. It’s technically against the law for any school receiving federal funds to have quotas for their admissions recruiters. Westwood will tell you that the goals are “incentives.” If it’s just that, then why are there trophies and plaques and exotic trips for reps who have the highest recruiting numbers? \r\n\r\nWestwood has been trying to get Regional Accreditation (the highest standard available) for years. Whenever the accreditation people would visit, we'd have to take down our plaques and trophies.\r\n\r\nEverything that we did was for the ultimate goal of getting that big fat loan check from the government or a bank. I felt like I was brainwashed. Every time I questioned a recruiting tactic, they would tell me that I was being to \"cerebral\". \r\n\r\nMy director told me to say things like, \"Oh, you said your 7th grade English teacher really supports you going to college. Do you think she would co-sign a loan for you?\"\r\n\r\nIn the end, they fired me for not meeting my sales goals. That was the best thing that could have happened to me. I look back and I feel like I sold my soul."}], [{"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "This school is morally bankrupt and their only goal is to take people's money - NOT to educate.\"", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "21 Aug 2012", "job_title": "Management in Denver, CO", "duration": "N/A", "pros": "The people in staff positions really want to help the underserved.", "cons": "They use the catch phrase, \"We are changing lives.\" They are changing people's lives FOR THE WORSE. Horrible leadership."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Bad", "Work/Life Balance": 4, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Good first sales position", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "26 Sept 2013", "job_title": "Admissions Representative in Westminster, CO", "duration": "N/A", "pros": "Great people, my manager was one of the few managers that cares and respected me.", "cons": "They fire a lot of people and promote idiots. Increase in Daley ends at 1 year and 6 months."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Employees' Experience", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "23 Sept 2013", "job_title": "Education in Anaheim, CA", "duration": "N/A", "pros": "The college should be focus on student and staff success because everyone wants to succeed in life or their career.", "cons": "Management behavior is improper, never supportive of their employees' just judge them. Training is not an option. Employees' pay for their own educational advancement without reimbursement and attend meetings without pay."}, {"Recommended": "N/A", "CEO Approval": "No", "Business Outlook": "N/A", "Work/Life Balance": 0, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "Alta Colleges", "rating": "2.0", "reviewer_affiliation": "Former Employee", "job_date": "29 Oct 2010", "job_title": "Admissions Representative in Arlington, VA", "duration": "N/A", "pros": "It is a great opportunity to make a strong contribution in the lives of a diverse student population.", "cons": "Chaotic, frentic, and unbalanced and unforgiving.  Poor management, low salaries, no loyalty, and no integrity."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "I loved teaching the students", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "1 Apr 2014", "job_title": "Instructor in Torrance, CA", "duration": "N/A", "pros": "Teaching the students was the best part.  The reward of teaching the students helped make this a nice place to work.", "cons": "The red tape of the administration.  The college was more concerned about administrative issues and complying with corporate requirements than teaching the students."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "About Westwood College", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "15 Jan 2016", "job_title": "Adjunct Faculty in Arlington, VA", "duration": "N/A", "pros": "Westwood College started as a Graphic Design school. It has a very creative design department and  design students rock.", "cons": "Westwood College is closing down soon. Just when enrollment was going up in Arlington campus. A shame."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "adjunct professor", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "28 Aug 2016", "job_title": "Instructor in Chicago, IL", "duration": "N/A", "pros": "worked with a teaching staff committed to continuing education. Frequent reviews were beneficial for self improvement.", "cons": "Admission standards was lowered resulting in a  diminished quality of education. Admission staff were commissioned based and lacked understanding of committed students."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "A lot of great people work there, but executive management has no clue.", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "16 Dec 2014", "job_title": "Admissions Representative in Denver, CO", "duration": "N/A", "pros": "Great people, chance to help people move up in life.", "cons": "Terrible benefits, no raises in 4 years, lots of layoffs"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Field admissions", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "19 Jul 2015", "job_title": "Field Sales Representative in Henderson, NV", "duration": "N/A", "pros": "Salary  and benefits are ok  They run around and expenses are not covered. Meetings are boring and all about administrative work", "cons": "Horrible and no credits transfers. Overprice career school"}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "N/A", "Work/Life Balance": 0, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "Not bad, but no matter what they say, its sales", "rating": "2.0", "reviewer_affiliation": "Former Employee", "job_date": "30 Mar 2010", "job_title": "Admissions Advisor in Denver, CO", "duration": "N/A", "pros": "- Good pay for telesales \r\n- Reasonable Quotas\r\n- Decent Orientation\r\n- Decent Company parties\r\n- Fairly good looking co-workers", "cons": "- Little opportunity for advancement\r\n- Stuck at a desk making 100+ calls per day\r\n- Lots of unqualified leads\r\n- High turnover"}], [{"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "N/A", "Work/Life Balance": 0, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 1, "review_title": "too much pressure", "rating": "2.0", "reviewer_affiliation": "Former Employee", "job_date": "12 Oct 2011", "job_title": " in Colorado Springs, CO", "duration": "N/A", "pros": "great compensation and advancement opportunity. made really great friends and i liked the tuition benefits. rewards and recognition were numerous", "cons": "pressure, incompetent leadership, greed, unethical. it is not surprising that they are struggling to stay afloat. left after 3 years of not being able to be proud of where i worked"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Working environment", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "15 Aug 2012", "job_title": "Adjunct Faculty in Woodridge, IL", "duration": "N/A", "pros": "Many of the staff members are nice and easy to work with at the work site.  The company worked hard to provide up to date technology.", "cons": "Admissions periodically engaged in less than ethical behavior when seeking new students for the college.  The administration advocated passing students at any cost."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "Westwood College", "rating": "3.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "12 Nov 2015", "job_title": "Head Librarian in Denver, CO", "duration": "N/A", "pros": "SOME OF THE MOST CARING, SELFLESS AND ENCOURAGING STAFF MEMBERS I HAVE EVER WORKED WITH!", "cons": "Corporate was a beast (and not a good one)"}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Bad", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Great School!", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "1 Sept 2016", "job_title": " in Florissant, MO", "duration": "N/A", "pros": "Very caring employees that were dedicated to furthering the students education and improving their lives.  Went to great lengths to transition its students to parent schools.", "cons": "For-profit education sector has taken it's toll on several schools.  It was no longer feasible for the school to remain open."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Worst company ever", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "10 Aug 2016", "job_title": "Field Admissions Representative in Atlanta, GA", "duration": "N/A", "pros": "Nothing about my experience was great", "cons": "I interviewed for one job and they gave me another one I started. They are quota driven so if you aren't enrolling enough students to make them any money then count on being FIRED! As soon as I left my manager was fired and after that the had of the school was fired for using school credit card for personal use. The school is currently closed nationwide because they SUCK!"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Adjunct Professor", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "31 Mar 2015", "job_title": "Adjunct Professor: Physics & Political Science in Los Angeles, CA", "duration": "N/A", "pros": "Academic flexibility, Lesson plans and text books were appropriate, Classrooms and equipment were of current technology and functioned.", "cons": "Insufficient guidelines and assistance for Institute's procedures and protocols."}, {"Recommended": "N/A", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Class act", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "10 Mar 2016", "job_title": "Program Chair in Torrance, CA", "duration": "N/A", "pros": "Wonderful people and culture at the South Bay(Torrance) campus.", "cons": "The school is closing due to poor strategic decisions at the corporate office."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Assistant Systems Administrator", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "30 Jun 2015", "job_title": "Assistant Systems Administrator in Chicago, IL", "duration": "N/A", "pros": "Assist the Campus System Administrator with daily duties, future planning and resolving Help Desk tickets, essential duties and responsibilities.", "cons": "I was so busy working 2 jobs and going to school, I didn't have a chance to get ant certifications."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "DON'T DO IT!!!!!!!!!", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "26 Jun 2015", "job_title": "Field Admissions Representative in Atlanta, GA", "duration": "N/A", "pros": "The pay is decent compared to other for profit colleges who want you to work for free!", "cons": "Bad product!   Programs are worthless, over priced and students can't transfer credits\r\nits all about the numbers.  you miss 2 starts you might as well clean off your desk you will get written up and then fired"}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 0, "review_title": "Great place to work", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 8 years", "job_date": "25 May 2016", "job_title": " in Los Angeles, CA", "duration": "N/A", "pros": "met great people\r\nmet wonderful students\r\nmade lifelong friends", "cons": "erratic work hours\r\npoor management\r\nthe school closed down"}], [{"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "My experience was fillies with highs and lows. Unfortunately, the later was more predominate", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "16 Jun 2018", "job_title": "Assistant Director of Admissions in Chicago, IL", "duration": "N/A", "pros": "Bonus and elite status benefits", "cons": "Promotion opportunities were limited at best.  Lack of diversity at senior management level."}, {"Recommended": "N/A", "CEO Approval": "Yes", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 0, "Senior Management": 4, "review_title": "Fun place to have spent my time!", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 8 years", "job_date": "11 Mar 2014", "job_title": "Student Finance in Westminster, CO", "duration": "N/A", "pros": "I built amazing relationships with staff.\r\nHad great hours and a flexible schedule.\r\nWas able to build on my skills by working with talented groups of people.", "cons": "Income limitations.\r\nNo 401K Matching.\r\nBenefits were only ok."}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "Senior Admissions Representative", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "31 Jan 2016", "job_title": "Senior Admissions Representative in Upland, CA", "duration": "N/A", "pros": "The best job I ever had.  I love working with people and making a difference in their lives.", "cons": "No job security.  I worked everyday"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 0, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Motivate your employess", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "11 Sept 2019", "job_title": "Assistant Director of Admissions in Redlands, CA", "duration": "N/A", "pros": "Very professional, friendly and helpful toward employees and its students.", "cons": "Not enough program to offer.  Faced with tough regulations from the government."}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "The entire experience was very rewarding.", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "23 Jun 2014", "job_title": "Library Aide in Woodridge, IL", "duration": "N/A", "pros": "The staff actually cares about each student and staff member as an individual and it feels more like a family than a work environment.", "cons": "There are no cons for this business."}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": "N/A", "review_title": "Great coworkers and faculty. Over-priced programs.", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "4 Mar 2015", "job_title": "Admissions Representative in Alexandria, VA", "duration": "N/A", "pros": "My coworkers were great and the faculty showed genuine interest in their students.", "cons": "Although the faculty was great, the school was not regionally accredited like most state schools, but nationally accredited instead."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 3, "review_title": "Program Chair of the School of Healthcare", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "14 Jan 2016", "job_title": "Program Chair/Externship Coordinator/Instructor in Chicago, IL", "duration": "N/A", "pros": "Friendly environment\r\nCaring faculty and staff\r\nUnderstanding management\r\nFlexible work schedule", "cons": "Pay/Salary\r\nCan be stressful during certain times of a term\r\nReact and not patience to see the results"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "N/A", "Work/Life Balance": 1, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Just a job not a career", "rating": "1.0", "reviewer_affiliation": "Current Employee", "job_date": "5 Oct 2011", "job_title": "Financial Business Specialist in Denver, CO", "duration": "N/A", "pros": "non stessful environment\r\neasy work load \r\nno pressing deaslines", "cons": "Company has a bad reputation\r\nno room for improvement or growth\r\nMicro managed\r\nlooked down at for taking days off\r\nno Raises\r\nPeople promoted to management positions without proper skills/qualifications"}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Revolving door", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "21 Apr 2014", "job_title": "Instructor in Denver, CO", "duration": "N/A", "pros": "Flexible schedules\r\nGood peers\r\nSome really great students", "cons": "Revolving door for management and peers, no continuity, management out-of-touch with classroom realities, no loyalty to staff"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 0, "review_title": "The students and fellow workers are great... Job experience is not that great!", "rating": "1.0", "reviewer_affiliation": "Current Employee", "job_date": "15 Sept 2011", "job_title": " in Denver, CO", "duration": "N/A", "pros": "It is very relaxed and you have the freedom to teach.", "cons": "The higher ups are only interested in the numbers and not the students or teachers. They have sterilized the environment and taken away many things that make it a creative environment to teach."}], [{"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 0, "Senior Management": 3, "review_title": "Customer Service/Financial Aid Advisor", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "26 May 2015", "job_title": "Customer Service Representative/Financial Aid Advisor in Westminster, CO", "duration": "N/A", "pros": "Great communication at all levels, relaxed work atmosphere, No quotas.", "cons": "Job relied on new student population"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 5, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 5, "review_title": "Employee", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "17 Jan 2016", "job_title": "Employee in Denver, CO", "duration": "N/A", "pros": "The current works for me and the people I work with do great work for the students", "cons": "Locations is closing. We will all need to find a place to go soon."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Returning Student Coordinator", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "1 Feb 2016", "job_title": "Returning Student Coordinator in Chicago, IL", "duration": "N/A", "pros": "We were always treated as professionals.  The compensation was more than fair. The students were truly a pleasure.", "cons": "We had some challenges with cross-departmental communications."}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "Instructor at Westwood College", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "1 Aug 2012", "job_title": "Instructional Designer in Upland, CA", "duration": "N/A", "pros": "Good students and great hared working staff.", "cons": "Management is a bit clueless about the arts."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "5 years and no raise", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "24 May 2016", "job_title": "Production Manager in Gaithersburg, MD", "duration": "N/A", "pros": "For profit schools have a wide net that they cast for talent because the pay is low", "cons": "Compensation to education below national standards"}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Not good at all at anytime", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "12 Sept 2013", "job_title": "Admissions Representative in Westminster, CO", "duration": "N/A", "pros": "Most of the fellow employees work nice to work with.", "cons": "Everything the job required was terrible."}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "A fun place to work, with no advancement", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "14 Aug 2014", "job_title": "Student Finance in Arlington, VA", "duration": "N/A", "pros": "Staff is very friendly and welcoming. Always feeding the staff food. Fun activities", "cons": "Low Pay, Turnover, benefits, leadership, management"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 0, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "IT department", "rating": "4.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "6 Jan 2016", "job_title": " in Lithonia, GA", "duration": "N/A", "pros": "learned alot on the job", "cons": "got stuck by myself not having nobody to show me had to teach myself"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 1, "Senior Management": 5, "review_title": "great place to work in", "rating": "5.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "1 Jun 2012", "job_title": "Work Study in Upland, CA", "duration": "N/A", "pros": "good hours for the stuidents\r\nthe supervisors are great people", "cons": "their where very little hours\r\ntheir where no real benifits for the work studies"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Stay away!!", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "24 Feb 2017", "job_title": "Admissions Representative in Atlanta, GA", "duration": "N/A", "pros": "Great co-workers but that's about it", "cons": "The school and everything about it is a scam! Horrible management! They literally tell you NOT to tell students the real truth about how terrible the program and the school is. You work pretty much every weekend even though they tell you that you will only have to once a month. STAY AWAY!"}], [{"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "DON'T BOTHER -- THEY'RE CLOSING", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "18 Dec 2015", "job_title": "Student Finance in Denver, CO", "duration": "N/A", "pros": "Some of the best co-workers I've ever had.  Dedicated, hard workers, unfortunately not many are left.", "cons": "It's a sinking ship, and will be running on skeleton staff until they close.  They have laid off so many, the ones left are carrying a massive burden."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Company shuts down and no one gets a warning", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "5 Feb 2016", "job_title": "Student Loan Specialist in Whittier, CA", "duration": "N/A", "pros": "its a job, good coworkers, PTO", "cons": "Bad management, un-organized, horrible business strategy, non caring for employers or students"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Great College", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 10 years", "job_date": "18 Aug 2016", "job_title": " in Strasburg, CO", "duration": "N/A", "pros": "Great teamwork environment and good growth for those who put the student first", "cons": "Sometimes acted reactive versus proactive and it created issues in the future"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 5, "Senior Management": 0, "review_title": "Admissions", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "6 Nov 2012", "job_title": "Admissions Representative in Calumet City, IL", "duration": "N/A", "pros": "Training program was sufficient. Compensation is great for your efforts", "cons": "Stressful sales goals. Focus on the dollar not the quality and preparation of the studen"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "The experience has been refreshing and rewarding.", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "8 Jul 2014", "job_title": "Library Assistant in Chicago, IL", "duration": "N/A", "pros": "Helping others and the overall quality of people.", "cons": "There are not enough hours and pay."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Executive Outside Sales Representative", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 8 years", "job_date": "28 Oct 2015", "job_title": "Executive Sales Representative in Riverside, CA", "duration": "N/A", "pros": "flexible, great pay, independence and opportunity for advancement", "cons": "paper work, some weekends, work life balance"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "assistant director of admissions", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "26 Oct 2015", "job_title": "Anonymous Employee in Denver, CO", "duration": "N/A", "pros": "culture is one of the best", "cons": "growth opportunities are limited with school"}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "QA Analyst and Business Analyst", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "1 Feb 2016", "job_title": "Software Tester/Business Analyst in Denver, CO", "duration": "N/A", "pros": "Very nice place to work with.", "cons": "There is no cons . Had a nice experience with the manager and the co workers."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 1, "Senior Management": 4, "review_title": "Good College", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "14 Mar 2016", "job_title": "Educator in Upland, CA", "duration": "N/A", "pros": "Great people to work with.", "cons": "The company does not provide salary increase and eliminated 401K benefit for many years."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Sales over Education", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "20 May 2016", "job_title": "Program Director in Chicago, IL", "duration": "N/A", "pros": "I can't think of any", "cons": "The focus was not on Education. Teachers and Management were expected to \"sell\" the school and keep students enrolled, regardless of whether they actually learned something, There have been numerous class action suits against this school. They have no integrity or concern for students or faculty."}], [{"Recommended": "N/A", "CEO Approval": "Neutral", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "Senior Leadership does not communicate well with staff", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "4 Feb 2011", "job_title": "Executive Director in Colorado Springs, CO", "duration": "N/A", "pros": "Great place to build peer to peer relationships, tuition benefits are great.", "cons": "Global commuincation needs to improve"}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "I worked there", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "6 Jan 2014", "job_title": "Program Director in Chicago, IL", "duration": "N/A", "pros": "Teaching the students and helping them.", "cons": "For profit institution. Shady recruitment, hard to face students being ripped off. Administration only cares about profits."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Out of business", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "4 Nov 2016", "job_title": "Education Representative in Atlanta, GA", "duration": "N/A", "pros": "none, they were an absolute dumpster fire. poorly run company, not forward thinking, and greedy.", "cons": "see pros, this was the worst place to work They ripped off students and treated employees with minimum respect. Shut down the company on a random day right before the holidays."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "N/A", "Work/Life Balance": 0, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 0, "Senior Management": 4, "review_title": "employee", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "1 Oct 2010", "job_title": " in Denver, CO", "duration": "N/A", "pros": "the people are great to work with", "cons": "lack of internal communication and technology"}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "Good money and no job security", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "17 Nov 2014", "job_title": "Academic Advisor in Denver, CO", "duration": "N/A", "pros": "The money is not bad. They give you pretty standard work hours. Everyone is pretty nice. Cubicle environment with lots of meetings", "cons": "The industry is failing. You will never feel any sense of security if you are looking for something temporary this is the job for you"}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "Ok to work here", "rating": "2.0", "reviewer_affiliation": "Former Employee", "job_date": "16 Jan 2015", "job_title": "Admissions Representative in Whittier, CA", "duration": "N/A", "pros": "you will enjoy working with the students", "cons": "staff needs to work on professionalism"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Westwood", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "2 Mar 2016", "job_title": " in Denver, CO", "duration": "N/A", "pros": "Competitive pay, good benefits, friendly staff, flexible schedule.", "cons": "Enjoyed this position - Position involves speaking on the phone all day."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Friendly Enviroment", "rating": "4.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "27 Jul 2015", "job_title": "Adjunct Faculty in Chicago, IL", "duration": "N/A", "pros": "Professional Staff and Students make teaching worth while.", "cons": "Not enough hours if you want full time employment. ."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Student Support", "rating": "5.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "5 Nov 2015", "job_title": "Anonymous Employee in Stockbridge, GA", "duration": "N/A", "pros": "Helping students further their education.", "cons": "Not being able to continue working there."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "GRAPHIC DESIGN INSTRUCTOR", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 10 years", "job_date": "13 Jun 2017", "job_title": "Design Instructor in Los Angeles, CA", "duration": "N/A", "pros": "Freedom to teach as you like.", "cons": "Grade inflation. Ask to pass students after you have honestly fail a student."}], [{"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "Field Admissions", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "26 Jan 2018", "job_title": "Field Representative in Fresno, CA", "duration": "N/A", "pros": "Independence of work schedule set own hours", "cons": "Management were out for them selved"}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 4, "review_title": "Professor", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "30 Apr 2017", "job_title": "Adjunct Professor in Los Angeles, CA", "duration": "N/A", "pros": "non interference with the instructors and academic freedom", "cons": "Improve and adhere to planning"}, {"Recommended": "N/A", "CEO Approval": "Neutral", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 0, "Senior Management": 3, "review_title": "Satisfied", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "25 Apr 2012", "job_title": "Student Finance Counselor in Denver, CO", "duration": "N/A", "pros": "Relaxed work enviroment, awesome coworkers, flexible schedule, good training", "cons": "Benefits could be better, Salary compensation"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Systems Administrator", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 10 years", "job_date": "2 Aug 2016", "job_title": "Systems Administrator in Hammond, IN", "duration": "N/A", "pros": "Wide variety of technologies to work on", "cons": "benefits were good when the company did well"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "My Experience", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "10 Apr 2018", "job_title": "Anonymous Employee in Atlanta, GA", "duration": "N/A", "pros": "Great experience and learn many leadership tactics", "cons": "Not having enough leads were a problem"}, {"Recommended": "Yes", "CEO Approval": "No", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Different", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "12 Mar 2014", "job_title": "Admissions Representative in Denver, CO", "duration": "N/A", "pros": "Opportunity to obtain degree at a discounted price.", "cons": "High turn-over.  Little job stability."}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Professor", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "8 Jun 2016", "job_title": "Anonymous Employee in Torrance, CA", "duration": "N/A", "pros": "Students; coworkers; open door policy", "cons": "Limited options for advancement"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Adjunct Instructor", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "26 Jun 2015", "job_title": "Adjunct Instructor in Torrance, CA", "duration": "N/A", "pros": "Great people to work with", "cons": "Compensation is not competitive with industry standards."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Financial Aid", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "16 Dec 2015", "job_title": "Student Finance Officer in Woodbridge, VA", "duration": "N/A", "pros": "Great working atmosphere and great co-workers", "cons": "No cons at this time"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Office assistant", "rating": "3.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "22 May 2017", "job_title": "Office Assistant in Denver, CO", "duration": "N/A", "pros": "It was a ok job to have", "cons": "Not organized never prepared or confused"}], [{"Recommended": "N/A", "CEO Approval": "No", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Loved it!", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "8 May 2014", "job_title": "FWS in Chicago, IL", "duration": "N/A", "pros": "Great people to work around.", "cons": "Limited hours. Limited advancement opportunities."}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "EC", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 8 years", "job_date": "13 Jul 2020", "job_title": "Enrollment Counselor in Denver, CO", "duration": "N/A", "pros": "Benefits were very good there", "cons": "leads were not qualified for admissions"}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Professor", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "27 May 2017", "job_title": "Professor in Atlanta, GA", "duration": "N/A", "pros": "Great salary and schedules for work.", "cons": "Logistics of the location."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Academic Dean", "rating": "1.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "19 Feb 2016", "job_title": "Academic Dean in Los Angeles, CA", "duration": "N/A", "pros": "Great people and wonderful students who cared about their education.", "cons": "The school is closing down in March 2016."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Avoid Westwood College like a Plague!", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "3 Jan 2014", "job_title": "Full-Time Instructor in Los Angeles, CA", "duration": "N/A", "pros": "Close to home. Easy driving.", "cons": "Profit oriented and they don't care about student success."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "great place to work", "rating": "1.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "24 Jun 2015", "job_title": "Senior Admissions Representative in Los Angeles, CA", "duration": "N/A", "pros": "very laid back, room for growth/ more responsibility's", "cons": "maybe set up more events for co workers to connect more"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Professor", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "12 Feb 2016", "job_title": "Professor in Denver, CO", "duration": "N/A", "pros": "IT Department success ratio 07% school else 15%", "cons": "inadequate knowledge base total miss managment"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Bad", "rating": "1.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "24 Feb 2020", "job_title": "Admissions Representative in Chicago, IL", "duration": "N/A", "pros": "No pros at all none", "cons": "Bad Environment as no advantages"}]]