[[{"date": "15 Jun 2023", "title": "BHT-behavioral Health Tech Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at KVC Health Systems (Kansas City, KS) in May 2023", "Interview Descriptions": "After the interview, I was offered a position but had to wait six weeks for the training to begin. They also send all HR and pre-employment documents/appointment information out randomly and with a 48 hour time constraint.", "Interview Questions": "What background do you have in mental health services"}, {"date": "19 Apr 2023", "title": "Case Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at KVC Health Systems (Radcliff, KY)", "Interview Descriptions": "Interview was very good and organized. You are made to feel comfortable and give the highs and lows of the job. They are also open to answer your questions to make sure the job is a fit for you.", "Interview Questions": "What makes you a great fit for our organization"}, {"date": "2 Jun 2023", "title": "Administrative Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at KVC Health Systems (Kansas City, KS) in Apr 2023", "Interview Descriptions": "It was a great process. Very informative and there was a genuine desire to ensure candidates were a good match. I walked away knowing how the department operated and could make an informed decision.", "Interview Questions": "They asked about my level of education and experience."}, {"date": "1 Nov 2022", "title": "Case Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at KVC Health Systems", "Interview Descriptions": "Very easy to schedule, professional, and very direct when explaining the position. There was a good balance of asking qualifications and lining that up to the position itself. I also had the opportunity to ask and clarify things. There is a lot of transparency from the scheduling process to the interview process.", "Interview Questions": "What is your experience with case assessments"}, {"date": "2 Jun 2022", "title": "Behavioral Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at KVC Health Systems", "Interview Descriptions": "Applied and went in for an interview. It took about 30 minutes. They wanted to know if I have worked with kids and if I had worked with kids with a variety of diagnosises and if I would be comfortable", "Interview Questions": "They asked about how I would give care for kids in different situations"}, {"date": "5 Sept 2022", "title": "Therapist Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at KVC Health Systems (Omaha, NE) in Feb 2022", "Interview Descriptions": "The interviewer missed the first online interview and was late for the second interview. The interviewer seemed unprepared. Cookie cutter interview questions, with kids in the background, which I found distracting.  She was personable once the interview could begin.", "Interview Questions": "Provided more information and \"their culture\" than the job itself, which was disappointing.  \n\nWhat type of team member would you be? "}, {"date": "8 Aug 2022", "title": "Residential Case Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at KVC Health Systems in Feb 2022", "Interview Descriptions": "I had a group interview via Webex. They asked me questions about my experience history as well as scenario questions. The interviewers were friendly and the questioning process flowed naturally. There were some wifi glitches.", "Interview Questions": "I was asked about my comfort level with working in the mental health field. "}, {"date": "3 Nov 2021", "title": "Family Support Worker Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at KVC Health Systems", "Interview Descriptions": "In person, quick.- Cannot recall entirely. This was many years ago. I recall feeling very comfortable, leadership was accommodating during the interview. Was not tense environment during the interview.  Director and supervisor were the only one in the interview.", "Interview Questions": "In person, quick.- Cannot recall entirely. This was many years ago. I recall feeling very comfortable, leadership was accommodating during the interview. Was not tense environment during the interview.  Director and supervisor were the only one in the interview. "}, {"date": "19 Mar 2021", "title": "Behavioral Health Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at KVC Health Systems", "Interview Descriptions": "Very nice and fully explained the job duties and the type of clients I would be working with. Able to work with me and get the schedule and hours that fit me best.", "Interview Questions": "How do would you address a conflict with a co-worker? A supervisor?"}, {"date": "8 Aug 2022", "title": "Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at KVC Health Systems (Kansas City, MO) in Mar 2021", "Interview Descriptions": "The interviews were fair and honest. I was respected and given the opportunity to ask questions that were helpful for me. I did not feel intimated, but the process was thorough. KVC really wants their employees to succeed, so they will not hire you unless they think you will do well at  the position you are applying for.", "Interview Questions": "What would you do if a child was being aggressive with you or other children?"}], [{"date": "7 Sept 2021", "title": "Intensive In-home Specialist Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at KVC Health Systems (Omaha, NE) in Feb 2021", "Interview Descriptions": "easy, very laid back. Interviewer was kind and very personable. it was one interview and i was hired. it was in person and it was very structured.  It was not a bad interview at all I enjoyed it.", "Interview Questions": "experience, skills, strengths and weaknesses. "}, {"date": "15 Oct 2019", "title": "Marketing Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at KVC Health Systems (Olathe, KS) in Jul 2019", "Interview Descriptions": "Somewhat informal, very focused on the interviewee and why they applied to KVC, great opportunity to show your personality and to talk about the things and causes you care about, able to make a personal connection to the interviewer", "Interview Questions": "What marketing experience do you have?"}, {"date": "3 Oct 2017", "title": "Family Preservation Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at KVC Health Systems (Pittsburg, KS) in Oct 2017", "Interview Descriptions": "First had a phone screening with a recruiter then an in-person interview. Both interviews were straightforward. Basic interview questions on why you want the position, how your skills are a fit, and weaknesses that you may have. Ability to ask questions. Very relaxed setting!", "Interview Questions": "How does your skills make you a good fit for this position?"}, {"date": "17 Aug 2017", "title": "Foster Care Specialist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at KVC Health Systems", "Interview Descriptions": "Was called right away for an in person interview, however, had to travel 90 minutes to attend the interview.   Was not told a salary or hours before attending this interview.", "Interview Questions": "What are some of the trainings that you have attended that you feel would benefit you in this position?"}, {"date": "8 Nov 2021", "title": "Foster Family Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 1 week. I interviewed at KVC Health Systems (Pittsburg, KS) in May 2017", "Interview Descriptions": "Asked scenario questions, how long you have been in child welfare, if there are any situations you would be uncomfortable with.  You will have one interview typically in person, then they will make a decision and call you.", "Interview Questions": "What would you do if you went to a biological family home and there was clutter everywhere?"}, {"date": "2 Jun 2017", "title": "Paraprofessional Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at KVC Health Systems (Kansas City, MO) in Feb 2017", "Interview Descriptions": "I interviewed with the President of Niles and the two co-admins. We went into a large room and they took turns asking questions. Overall, it was very laid back and not stressful. I felt positive about our interactions. After all the questions were complete they took me on a tour and introduced me to other employees. I got a call the very next day.", "Interview Questions": "Tell me about yourself."}, {"date": "3 Mar 2017", "title": "Receptionist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 2 weeks. I interviewed at KVC Health Systems in Jan 2017", "Interview Descriptions": "Applied online and received a call a couple weeks later for an interview. The interview was strange as one interviewer didn't shake my hand and they interviewed me in a room with the lights off - only light was through the window. Basic questions and some behavioral questions.", "Interview Questions": "How would you handle an angry parent that won't calm down?"}, {"date": "26 Feb 2018", "title": "Front Desk Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at KVC Health Systems (Kansas City, KS) in Jan 2017", "Interview Descriptions": "They set up phone interview twice and forgot to call both times. I emailed after first incident and decided not to contact a company like this after it happened second time.", "Interview Questions": "N/A"}, {"date": "17 Jan 2017", "title": "Campus Supervisor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at KVC Health Systems (Kansas City, KS) in Jan 2017", "Interview Descriptions": "The interview was 1:1 with a Program Director. The woman who scheduled my interview with her did not show up, so a man was contacted to interview me in her absence. He shook my hand and led me to a conference room where we sat on opposite ends of a table. He gave an overview of the position I was interviewing for, asked me questions, I asked him questions, and we thanked one another.", "Interview Questions": "He asked how much experience I had in a similar role."}, {"date": "22 Nov 2016", "title": "Family Support Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at KVC Health Systems (Ottawa, KS) in Nov 2015", "Interview Descriptions": "Friendly, personable, relatable, explained job details well and appeared to have a strong knowledge of the agency. The interviewers made me feel at ease and not intimidated, they understood I had not worked in this field before, but had some experience which could relate to the position.", "Interview Questions": "What do you consider to be your biggest flaw?"}], [{"date": "21 Jun 2017", "title": "Transportation Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at KVC Health Systems (Ottawa, KS) in Mar 2015", "Interview Descriptions": "Phone and in person. Met with supervisor conducting interview , discussed overall procedures and requirements. Very thorough and frank description of duties and was comfortable during entire interview. Complete explanation of the position and benefits.", "Interview Questions": "Can you handle confidentiality?"}, {"date": "27 Jul 2014", "title": "Therapeutic Case Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at KVC Health Systems", "Interview Descriptions": "They hired me right away, and later I found out it was because they are so extremely short-staffed that they will hire anyone with a degree, a license, and a pulse.", "Interview Questions": "The interview was easy and there was nothing about it I consider difficult or unexpected or intimidating. And I am a fairly shy person!!!!"}, {"date": "1 Aug 2016", "title": "Family Support Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at KVC Health Systems (Pittsburg, KS) in Sept 2013", "Interview Descriptions": "The interview process was pretty easy. Due to lack of licensed workers and high turnover- maybe too easy. It primarily consisted of explanation of the agency and expectations of what the job entails. They explained the high demands and difficult client base.", "Interview Questions": "what ways do you cope with stress? "}, {"date": "8 May 2015", "title": "Therapeutic Case Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at KVC Health Systems (Olathe, KS) in Jan 2012", "Interview Descriptions": "The interview was easier than thought. The person giving the interview was very nice and then find out how that person really is. Very unethical and doesn't really care about there employees", "Interview Questions": "What can you bring to the company"}, {"date": "30 Mar 2011", "title": "Field Worker Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at KVC Health Systems in Jul 2010", "Interview Descriptions": "Was contacted by phone for initial interview and was asked to come to office for face to face interview.  Was interviewed by 2 supervisors.  Was called one week later to begin training.", "Interview Questions": "N/A"}]]