[[{"date": "16 May 2023", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Anaheim Regional Medical Center", "Interview Descriptions": "Apply for the job online and get a phone call from the hospital. Confirm an interview date and time via phone call. Attend the interview, and answer the questions. They would talk to you about the possible benefits.", "Interview Questions": "Tell me about yourself and why you want to become a nurse"}, {"date": "21 Feb 2023", "title": "ICU Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Anaheim Regional Medical Center in Feb 2023", "Interview Descriptions": "The interview was composed of two people (director and manager). The interviewers were easy going and answered all questions in a clear and concise manner. No scripted scenarios were given. The questions were based off of experience and personality based. The director advocated for the unit.", "Interview Questions": "Tell me about yourself (professionally) and scenarios."}, {"date": "6 Oct 2022", "title": "Telemarketer Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Anaheim Regional Medical Center in Aug 2022", "Interview Descriptions": "Why did you choose Anaheim regional medical center Post hip surgery what to watch out for Pt complains of Chest pain what orders do you expect What are your strengths", "Interview Questions": "Why did you choose Anaheim regional medical center Post hip surgery what to watch out for Pt complains of Chest pain what orders do you expect What are your strengths"}, {"date": "18 Feb 2021", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Anaheim Regional Medical Center (Anaheim, CA) in Jan 2021", "Interview Descriptions": "it started on time. two interviewer. it was not so hard, warm atmosphere and slight casual. the interviewers checked resume already, and they asked what they wanted to know more.", "Interview Questions": "3 strengths and weakness, expected order for chest pain"}, {"date": "5 Aug 2020", "title": "RN NURSE Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Anaheim Regional Medical Center (Anaheim, CA) in Jun 2020", "Interview Descriptions": "it took 45 minutes. the interviewers made me feel very comfortable. they did not start  with the typical question, \"tell me about yourself\" instead  they told me to tell that everything that was not on resume.", "Interview Questions": "Tell me about yourself?\r\nTell me about a time you experience conflict, how did you resolve it?"}, {"date": "24 May 2018", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. I interviewed at Anaheim Regional Medical Center", "Interview Descriptions": "Submitted my resume and cover letter directly to the directo.  Got the call the next day for interview.  They called me back after a week for the job offer.", "Interview Questions": "Tell me something about yourself. Why do you want to work here. "}, {"date": "15 Nov 2015", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Anaheim Regional Medical Center", "Interview Descriptions": "Applied online, a couple of weeks later I received a phone call from HR to schedule for an interview.  then met up with unit manager and director at director's office.  Received an offer on the next day.  Then sent out to physical exam and drug screen.  There were math, science and simple ekg test when orientation phase began- which lasted about a week.", "Interview Questions": "Why do you want to work in this department? How do you handle a stressful situation at work?"}, {"date": "20 Oct 2015", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Anaheim Regional Medical Center (Anaheim, CA) in Sept 2014", "Interview Descriptions": "Applied directly to their site through finding the job on a separate job site (Indeed.com). One day I received a call to interview from the COO. Scheduled my interview. Arrived 15 mins early. Reported to front desk to let them know I was there. Waited in the guest area. COO came and brought me to the office of the director of the unit. Interviewed with 2 managers and director. Came prepared with resumes, just in case they didnt have a copy. Left interview with writing each interviewer a thank you card.", "Interview Questions": "\"Tell me about yourself?\" \"Strengths and weakness?\" \"Where do you see yourself in 5 years?\" One scenario given."}, {"date": "13 Nov 2015", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Anaheim Regional Medical Center in Jul 2012", "Interview Descriptions": "Submit resume through company career site and, contacted by director of unit. Office interview about 1 hour by director 1:1. Director contacted me 1 week later. Whole process took 3 weeks.", "Interview Questions": "What is your hectic day is like? Give me scenario."}, {"date": "28 Sept 2013", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Anaheim Regional Medical Center (Anaheim, CA) in Jul 2012", "Interview Descriptions": "Applied online. Interviewed in person with the Clinical Shift Manager in the manager's office for 30 minutes about a month after applying. Offered a position 2 weeks later.", "Interview Questions": "They asked clinical questions. What would you do in this senario? Be prepared to answer clinical nursing questions"}]]