[[{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Small territories, great education team", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "4 Aug 2019", "job_title": "RN in Arvada, CO", "duration": "N/A", "pros": "Large agency so you don't have to drive as far, 5 territories. Great support from managers, clinical educators, and CWOCNs. Education is encouraged at this agency, educators and CWOCNs are available for co visits. High volume of patients, so I can usually work more if I want to make more money.", "cons": "Processes change a lot, it's hard to keep up with.  More charting than will previous agency. This agency has a high standard of care which I love, but also means working a little harder."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Reviewing", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "11 Jun 2023", "job_title": "Accounting Specialist in Arvada, CO", "duration": "N/A", "pros": "clear job description, you know what you're going to do every day", "cons": "Not much room for advancement or growth"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 3, "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "a ness", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "12 Apr 2023", "job_title": "RNCare Manager 1 in Loveland, CO", "duration": "N/A", "pros": "wirk from home. ok oay", "cons": "a disaster under current leadership. blame not getting nurses for closing north territory in reality had a full staff and worked every rn to death. also blames covid for everything"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Short staffed and poor response to patient care", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "3 Apr 2023", "job_title": "Registered Nurse in Arvada, CO", "duration": "N/A", "pros": "Supportive team, in the field, and in the office", "cons": "Short staffed Poor management from President High turn over of staff Poor response to patient care"}, {"Recommended": "N/A", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": 3, "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Company is changing…", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "16 Nov 2021", "job_title": "Occupational Therapist in Denver, CO", "duration": "N/A", "pros": "Flexibility \r\nLots of work available for you if you want it \r\nWorking with some other really awesome therapists and nurses \r\nWorking with motivated clients\r\nFriendly managers\r\nThe home health setting in and of itself fosters a lot of autonomy and independence", "cons": "Compensation for work was decreasing (no travel stat when asked to go far distances for patients in other territories)\r\nRequired to work 7-8 weekends a year\r\nAdmissions staff often didn’t have demographics confirmed which would lead to issues with scheduling on the therapists part\r\nCommunication amongst team members not always good. There were definitely times it was communicated to office staff that I could use more work and there was a major delay in getting the patient information to me and I then could not see the intended patient\r\nThe culture often feels like productivity is number one and everything else is secondary… office staff and field staff sometimes seem to be on different wavelengths and not too understanding of each other.\r\nI worry about the longevity of the company since combining with Care Synergy…"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Went downhill with Care Synergy", "rating": "2.0", "reviewer_affiliation": "Former Employee", "job_date": "11 Dec 2022", "job_title": "Registered Nurse, BSN in Arvada, CO", "duration": "N/A", "pros": "Worked remote, good People , stable", "cons": "Low pay, things went south after cafe synergy took over and fired many people"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": 4, "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "great company for a long term employment. wonderful benefits.", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "18 Jan 2022", "job_title": "Licensed Practical Nurse in Denver, CO", "duration": "N/A", "pros": "Very cooperative office staff and well-organized company.", "cons": "Some of the visits are far apart it may take time to get to clines home."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 0, "review_title": "Concerns about where company is heading.", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 8 years", "job_date": "14 Dec 2020", "job_title": "RN Clinical Manager in Arvada, CO", "duration": "N/A", "pros": "Great people to work with, support within management team but little support or help from upper management. Clinicians are great for the most part, office staff work well together.", "cons": "Just too much work to reasonably do, and not change or help came when this was pointed out with respect. Concerned about direction where company heading which is a bit unclear."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Na", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "14 Apr 2021", "job_title": "Registered Nurse in Denver, CO", "duration": "N/A", "pros": "Hoursz, hours hours hours hours", "cons": "Mgmt, mgmt, MGMt, mgmt, mgmt"}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "Almost entirely awful.", "rating": "2.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "2 Jul 2016", "job_title": "CNA in Denver, CO", "duration": "N/A", "pros": "Shift differentials for weekends/night of 15%", "cons": "Even if you are part-time you are going to be pressured to work a 50-60 hour week. Schedulers will manipulate you into taking more patients than you are physically able to do because this agency is so short staffed. Oh, and you are required to work every other weekend. So, basically you are working 12 days in a row with no breaks. \r\n\r\nBasically, this is the most disorganized company I have ever interacted with. I was encouraged initially by the fact that they have been established for such a long time, like a 100+ years. However, it is an extremely dysfunctional environment. The office is so hectic and stressful, even just coming in to turn in paperwork. You have stressed out nurses running around trying to find out what is going on, frenzied schedulers yelling about CNAs in the field and gossiping about patients, angry managers storming in/out of offices and being generally condescending. This is not an exaggeration in any way.\r\n\r\nMake no mistake, initially I chalked it up to a couple bad days in the office, but every single office stop I have made there is some new catastrophe occurring. It definitely is going to translate into your work in the field as a CNA. There is always a million issues so no one at the office is going to answer their phones or reply to an email for 2+ weeks because it is so hectic."}], [{"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Horrible Mngmy", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "5 Feb 2021", "job_title": "Clinician in Denver, CO", "duration": "N/A", "pros": "None At All\r\nCompany gives no incentives to make an employee stay...", "cons": "No way to grow.... Unreasonable expectations.."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Inspiring", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "7 Mar 2014", "job_title": "Anonymous Employee in Denver, CO", "duration": "N/A", "pros": "I have never worked in the healthcare industry and it provided new challenge.   I enjoy working with the compassionate nurses and caregivers.   I feel that my work matters and important to our life on this earth.    It has purpose.   I am amazed every day.   The  VNA Colorado really focuses on the patient -  they provide the best training and the management continues to focus on providing the best support for the field staff.   It is a pleasure to work with the managers -  they are responsive, committed to their part in the recruitment process.   I also have not worked in a non profit environment - I admire the generosity and what is provided to the clients.  I believe that if you are a nurse or caregiver in the medical field -  you will enjoy exceptional support from your managers and the satisfaction of  one on one patient care.   VNA Colorado was established 125 years ago and has a rich history.", "cons": "Because of the cost constraints of a non profit -  the office and environment could use updating.   it requires creativity to work with some of the limited resources."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Great Mission, change in culture", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "24 Apr 2017", "job_title": "Anonymous Employee in Denver, CO", "duration": "N/A", "pros": "The culture is changing!  CVNA thrives to keep the value in our mission with patient care.  CVNA is constantly trying to improve on services and focusing on new ways we can better provide for our community.  When you work for CVNA this isn't just another job you dread having to go to.  CVNA makes you feel welcome from the beginning.  Your ideas will be listened to and if appropriate they will make necessary changes to implement the ideas.  I absolutely love this company and what it stands for. \"Visiting Nurse Association is committed to a continuum of health care in the home and community supporting optimal well-being, independence, and dignity.\"  We hire the best so we can be the best in every area of our agency from our field staff to our office staff.", "cons": "I really cannot think of anything at the moment.  If I have a concern I go directly to my supervisor and share with the team."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "RN Case Management", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "29 Jul 2015", "job_title": "RN Case Manager in Denver, CO", "duration": "N/A", "pros": "Good orientation. Keep busy, supportive field staff. Holidays worked, pay is decent.", "cons": "Low pay, no raise no interest or little interest in employee retention.  Poor yearly evaluations, they do not accurately weigh your talents/strengths or willingness to work more than 8 hours a day.\r\nmany hours are uncompensated with documentation while not in the field,  both before and after work hours . Some days work 12 hours, but not compensated for extra hours needed to  do the job correctly. Managers are not available when you need them, They are over worked and stretched to the max."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Making an Impact!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "30 Jul 2019", "job_title": "Anonymous Employee in Arvada, CO", "duration": "N/A", "pros": "Working here is enjoyable.  Our company has a such a great history it seems like everyone knows us,  also I love that our company gives back to the community.  If you don't already know,  we care for our senior population in their homes and it is super rewarding. There is never a shortage of work and the Management seems to actually care about their employees and patients.  I really like that that they are really mindful of compliance and accuracy.   The CEO Chris is involved with all aspects of the company and well respected in our company.  He comes to the IDTs to speak to he clinicians and get feedback.  One time the employee In charge of snow shoveling hurt his back.  Although the employee tried to still shovel,  our CEO told him to sit down and he grabbed a shovel and went outside and shoveled snow for his employees safety.  He is Legit.  Company is legit awesome.", "cons": "My issues are resolved pretty quickly just by talking to my manager."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "RN", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "5 Mar 2016", "job_title": "Registered Nurse in Denver, CO", "duration": "N/A", "pros": "Some good coworkers with a lot of dedication. Sad that they feel they have no other options. Alot of good people are gone.", "cons": "There's so much wrong with this company. I have seen a lot of bad management but this company is unique. They wear staff down. They are demeaning. There's no support for staff. The managers HR and CEO are all involved and let it go on. Staff knows exactly what's going on. VNA is under investigation for several issues. They have lost clients. In spite of being on the verge of going under they still have the nerve to treat employees horribly. They lie and cheat and instead of trying to save their company they plan and scheme to have staff fail. They hate to pay unemployment or workmans comp or overtime. The labor board has their number. They have angry clients trying to break in the front door. They could care less about employees safety including staff who make home visits. They will reap what they sow and the sooner the better."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Love it here", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "21 Apr 2017", "job_title": "Certified Nursing Assistant in Denver, CO", "duration": "N/A", "pros": "Good pay. Co workers are awesome. Make my own schedule. Hospice managers always have your back. Great communication as a team. Longest place I've ever worked and I don't plan on leaving anytime soon. 5 plus years.", "cons": "The only thing I find difficult is the being a field employee doesn't allow me to really get to know the office staff. I don't know how or if that can be corrected.  But it is probably my biggest complaint. So, I try to make a point of getting to know people on my own. However, those are still mostly the people I make contact with for my specific job. Like supplies,front desk, or HR."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 5, "review_title": "Community Liaison", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "17 Jan 2017", "job_title": "Marketing Representative in Denver, CO", "duration": "N/A", "pros": "The Company is a non profit who has been in business 127 years in Denver.  I like my manager!  We are covered on a lot of insurances.  We can take care of seriously ill patients and our palliative care is unique in the market because it is covered by the home health benefit and the CVNA can offer weekly care instead of monthly care which are competitors offer.", "cons": "There is no advertising or promotional budget because of the non profit status.   When many providers want a luncheon to see them, I cannot see them.  My salary is the low.  Commission is only $50 for a referral."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Poor work-life balance", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "22 May 2017", "job_title": "Wellness RN in Denver, CO", "duration": "N/A", "pros": "Reasonable second income for retirees, refresher RNs\r\nPleasant work conditions, daytime hours, congenial clients and co-workers", "cons": "Most of the year, the primary business is foot care. Nurses average 10 hours a week. \r\nThe benefit of these chunks of free time in between clinics has disappeared over the last few years with the expectation of daily email, mandatory monthly phone calls or meetings.You never really feel like you get away from this job, because if a client calls about their appointment, it is up to the nurse to return the call-not office staff."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "LPN", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "4 May 2017", "job_title": "Anonymous Employee in Denver, CO", "duration": "N/A", "pros": "I am a 27 year employee and have loved my work at CVNA! I was able to craft my schedule in a way that worked to raise my daughter. I have worked with many caring, wonderful people through the years.  I now manage an off site program.  I feel totally supported by my immediate supervisor.", "cons": "I think the RN's have a lot of responsibility to assess and meet the needs of the patient and the paperwork (on the computer) is cumbersome. It is challenging for RN's to oversee LPN's because of the paperwork so an LPN must find a willing RN to tag team with.  LPN's are not able to do as much in home care as they do in the hospital."}], [{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 3, "Senior Management": 5, "review_title": "Wellness Nurse", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "21 Apr 2017", "job_title": "Wellness Nurse in Denver, CO", "duration": "N/A", "pros": "Best group of nurses I've ever worked with.  Managerial staff are understanding and capable.  They have really encouraged team work, and I FEEL like part of a team.  New nurses are fully oriented and trained before being asked to work in the field.  The schedule is flexible and there is plenty of accommodation for personal life. I feel appreciated by my clients, and enjoy providing care to such a needy population.  I am proud to be part of CVNA.", "cons": "As a non profit, there is not a lot of excess cash flow.  We would like to provide care to a larger portion of the senior population."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Admissions Coordinator", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "1 Apr 2016", "job_title": "Admission Coordinator in Denver, CO", "duration": "N/A", "pros": "A steady paycheck even though not compensated fairly. There really are no more. This place is horrifying. Ask anyone there but they won't have courage to tell the truth.", "cons": "Management. Period. If you go to upper management to complain about your direct supervisor, it will not be in confidence. Nothing will be done to resolve the issues either. Everything will be told to your direct supervisor and you will be degraded and treated badly to the point of wanting to quit or they will fire you. No one has anything positive to say about the working conditions there and the staff are treated like peons. Staff is not compensated fairly. The only folks happy with their jobs are management."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Management", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "25 Jan 2016", "job_title": " in Denver, CO", "duration": "N/A", "pros": "Amazing leadership and newer CEO in place has made very positive changes to the organization and lots of exciting growth. A culture of transparency. Very ethical organization with a high degree of integrity and top management support. A positive mission lived every day that truly helps our community and clients. Focus on quality care and outcomes that exceed our competitors. A 4 star agency, proud to be apart of.", "cons": "Technologies had been antiquated and have needed updated for a long time, The VNA is moving in the right direction with new improvements and investing in technology for all clinicians. This is good news for all employees."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Big thumbs down", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "1 Jan 2016", "job_title": "Anonymous Employee in Denver, CO", "duration": "N/A", "pros": "Great coworkers and most clients really appreciate the work that the underpaid nurses do for them. Feel like doing good work in the community.", "cons": "Executive makes over $100K per filing status, but has the nerve to post on Glassdoor that \"we all have to pull in the belt\" to rationalize violating Colorado laws to not pay nurses for all hours worked. Also someone hacks former employees' ADP accounts and involved with possible identity theft. FBI and CO AG investigating possible cyberterrorism against ADP.  You also had someone pose as Denver cop to harass former employee and their family members."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "Wellness RN", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "8 Jun 2015", "job_title": "Staff RN in Denver, CO", "duration": "N/A", "pros": "Flexible schedule, nice coworkers, community setting \r\nIt was a great first job as an RN but then again, I didn't know what I was missing.", "cons": "Very poorly organized and managed; hourly rate not competitive with market. \r\nThe closer I got to advancing in my department, the more I realized how unorganized and unstructured things really were"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 0, "Senior Management": 4, "review_title": "As a billing and collection specialist, one aspect of my duties I enjoy most is handling/facilitating VA authorizations.", "rating": "4.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "16 Mar 2015", "job_title": "Billing/Collections Specialist in Denver, CO", "duration": "N/A", "pros": "Friendly, professional team environment, expectation of what is required of ones duties are clearly communicated with a limited degree of micro management which allows the employee to work at their own individual pace to do their best.", "cons": "HCHB billing software can be cumbersome at times. Salary is a bit low in comparison to the States high cost of living."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Poor Management", "rating": "2.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "27 Apr 2017", "job_title": "Anonymous Employee in Denver, CO", "duration": "N/A", "pros": "Large company, strong referral base of business", "cons": "Management unsupportive of staff concerns, overworked office staff, ignores field staff concerns, multiple managers have departed in last year, unable to fill open positions with qualified managers, compensation is below Denver medical staff average. Their seems to be a lack of career opportunities, positions filled by outside candidates. Low moral."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Solid for a student", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "22 Sept 2020", "job_title": "Certified Nursing Assistant CNA in Arvada, CO", "duration": "N/A", "pros": "The pro is that it is a more relaxed setting to be a CNA in, drive time pay, mileage pay, rewarding relationships with clients", "cons": "It racks up a lot of mileage on your car, and visit appointments are often not conducive for efficiency"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "RN Case Management", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "26 May 2016", "job_title": "Assessment RN in Denver, CO", "duration": "N/A", "pros": "Good company with good reputation. High employee retention. Supportive management team. Exciting opportunities for growth and expansion.", "cons": "Can be inconsistent and disorganized making it somewhat difficult to maneuver job responsibilities. The company is going through many changes and exciting growth, so this is expected."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Sr. HR Generalist", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "7 Jan 2017", "job_title": "Senior Human Resources Generalist in Denver, CO", "duration": "N/A", "pros": "Great employer that has provided an opportunity for me to use my skills and exceed in areas that have been provided to me.  Very progressive organization!", "cons": "None that I can think of."}], [{"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "Poor treatment of staff", "rating": "2.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "26 Oct 2017", "job_title": "Nurse in Greeley, CO", "duration": "N/A", "pros": "Good working with clients and good co-workers.  Pay is not bad.", "cons": "Clinical supervisor in Greeley is very difficult to work with.  Agency is very demanding of staff so it's impossible to have a work/life balance. Atmosphere created by management is almost toxic."}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "Receptioinist", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "22 Apr 2015", "job_title": "Receptionist in Denver, CO", "duration": "N/A", "pros": "I have been working with Colorado Visiting Nurse Association for about a month now. I really enjoy the healthy work environment and my very helpful and professional collogues.", "cons": "I wish we could get a fish tank and more plants in the waiting room."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Great people to work with", "rating": "4.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "18 Jun 2012", "job_title": "Homemaker in Denver, CO", "duration": "N/A", "pros": "employees are caring people; you can drop your clients if you don't mesh well with them; part time or full time job", "cons": "pay is low; some clients are too demanding; drive time/mileage reimbursment only counts between clients"}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 0, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "CNA", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "28 Mar 2017", "job_title": "CNA in Denver, CO", "duration": "N/A", "pros": "Able to set your own schedule.", "cons": "They say they have work, but I don't ever get the hours I need."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "A career that matters.....", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "26 Feb 2015", "job_title": "Anonymous Employee in Denver, CO", "duration": "N/A", "pros": "Focus on patient care, strong management team, emphasis on education and a career that matters.", "cons": "non profit -  good and bad,   resources -  sometimes limited"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": "N/A", "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": 1, "review_title": "Poor Managent/ Poor Communication", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "28 Jan 2017", "job_title": "CNA in Greeley, CO", "duration": "N/A", "pros": "Working with the patients was the best part of this job", "cons": "Lack of respect from upper management and very poor communication skills with patients and Staff,  I would not recommend this company to anyone, you would have better luck working at Taco bell"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "RN", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "19 Mar 2016", "job_title": "RN Field Nurse in Denver, CO", "duration": "N/A", "pros": "Flexible.  Educational support. Patients.  Co workers", "cons": "Driving. Need to work weekends."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 1, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Occupational Therapist", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "27 Feb 2016", "job_title": "Occupational Therapist in Denver, CO", "duration": "N/A", "pros": "Flexibility in scheduling work time", "cons": "Must rotate in to work weekends"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Save yourself", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "1 Nov 2014", "job_title": "Wellness Manager in Denver, CO", "duration": "N/A", "pros": "Great mission, a lot of wonderful nurses and mid-level managers", "cons": "The CEO and CFO lack such leadership, it is sometimes comical."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "VNA", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "21 Nov 2015", "job_title": "Anonymous Employee in Denver, CO", "duration": "N/A", "pros": "The mission is in the right place.", "cons": "Financially unstable. No money for continual training of staff. Little money to do job."}]]