[[{"date": "30 Jan 2023", "title": "Operations Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at NCQA", "Interview Descriptions": "Panel interview with approximately four team members ask behavioral questions. Interview was via Zoom. Questions were straightforward. Panelist made the experience pretty smooth and easy to connect with to answer questions.", "Interview Questions": "Tell me how you prioritize multiple tasks with deadlines."}, {"date": "7 Sept 2022", "title": "Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at NCQA (Washington, DC)", "Interview Descriptions": "Really enjoyed Malik & his insightful conversation. \nHe really made me fell comfortable making a big decision. \nI was on the fence about making the move & Malik really took the time to break down each part of the process.", "Interview Questions": "How would you describe your mindset toward the adversity?"}, {"date": "23 May 2022", "title": "Intern Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at NCQA", "Interview Descriptions": "The interview was on Zoom with one individual. They asked why I am interested in the company and just to talk about my experiences that would be helpful in the role.", "Interview Questions": "Why NCQA and this role?"}, {"date": "16 Jan 2022", "title": "Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at NCQA", "Interview Descriptions": "There was an initial phone screening where an HR representative asked basic questions like \"tell me about yourself\", \"why are you interested in this position?\", etc.\r\nThis was then followed by a panel interview a few weeks later with four team members (including a manager).  After this panel interview, they sent an assignment that I had to complete.", "Interview Questions": "Describe a time when you had to work in a team. \r\nDescribe your experience with project management and handling multiple deadlines. "}, {"date": "17 Dec 2021", "title": "Health Care Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at NCQA in Sept 2021", "Interview Descriptions": "It was done via Zoom. I had 1 interview with somebody in a leadership position, and they completely ghosted me. I emailed the recruiter and this person multiple times checking on my status and nothing. Also, I asked them about their diversity initiatives and they couldn’t give me an answer, so major red flag.", "Interview Questions": "Can you tell me about yourself and how this aligns with the position. "}, {"date": "1 May 2023", "title": "Health Care Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at NCQA (Washington, DC) in Sept 2021", "Interview Descriptions": "First, the recruiter will call to do a screen. If you pass that first step, you are then interviewed by a manager. Last, there is a third round where you are interviewed by several members of the department you applied to work in.", "Interview Questions": "Give an example of a time when you work with x-type data (if it's for the finance dpt. then financial, quality than qualitative and quantitative data)"}, {"date": "15 May 2019", "title": "Health Care Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at NCQA in May 2019", "Interview Descriptions": "I was asked to answer some screening questions. Then I had a phone interview and a one hour interview with three directors. The interview lasted an hour and it seemed to have went well but you never know with these interviews it could go either way. I am disappointed in the outcome", "Interview Questions": "My background on research and I was asked other behavioral questions."}, {"date": "6 Mar 2019", "title": "Health Care Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. I interviewed at NCQA", "Interview Descriptions": "I had three 1:1 phone calls with different department directors and one group skype interview with two directors and a senior analyst. They were pretty standard and everyone was approachable.", "Interview Questions": "Experience working in groups, experience writing for external partners, experience complying with deadlines, juggling multiple tasks, analyzing data, performing a literature review"}, {"date": "13 Jan 2021", "title": "Health Care Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at NCQA in Mar 2019", "Interview Descriptions": "Had an over the phone interview, in-person interview with three members of the team I was applying into, and finally a writing assessment. Thought they all went well but they ultimately said they went with someone who was a better fit.", "Interview Questions": "Tell me about a time you had to work in a team."}, {"date": "10 Apr 2019", "title": "Software QA Engineer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at NCQA (Washington, DC) in Feb 2019", "Interview Descriptions": "Long Process than normal. A phone call, Assignment, Then a Phone call, then Skype. less technical more behavioural. Technicals are easy and fine but behavioural you never know what they are going to ask.", "Interview Questions": "Did you hear any rumour about you among your colleagues?"}], [{"date": "18 Mar 2019", "title": "Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at NCQA (Washington, DC) in Feb 2019", "Interview Descriptions": "Started with a brief phone screening with HR, then a phone interview with the manager of the department, then an in-person interview with the team. Everyone was friendly and very accommodating.", "Interview Questions": "Describe your biggest challenge and how you got through it. "}, {"date": "24 Jul 2018", "title": "Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at NCQA (Washington, DC) in Jun 2018", "Interview Descriptions": "Had some difficulty getting in touch with the recruiter. I spent a lot of time chasing them for an interview. First had a phone screen with the recruiter, then with the team. Found out about the position about a week after I interviewed", "Interview Questions": "Why NCQA? "}, {"date": "22 Mar 2018", "title": "Data Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at NCQA (Washington, DC) in Mar 2018", "Interview Descriptions": "There was an initial screening call with the HR Manager to assess my interests and schedule an interview with the department\r\n\r\nAbout two week later, I was scheduled for a skype (call) interview which consisted of 5-6 individuals reviewing my resume and typical questions (behavioral professional). It lasted about 45 minutes and was quite calm (conversational in nature).\r\n\r\nAfter another 2 weeks, I was invited for an in person interview in DC. That consisted of two back to back 30 minute sessions with two teams. A few were on the phone and some were in a conference room with me. \r\n\r\n\r\nThe location is beautiful by the way and pretty easy to get to in the city. I liked the environment, very diverse, everyone was nice (greeted me) in and out and very accommodating of guests.\r\n\r\nThe process (took 3 Months)  bc it's extensive vetting process which is effective for them", "Interview Questions": "They asked me to review my experience once again and I took it as an opportunity to try to draw a connection with the position I was seeking and my background.\r\n\r\nTheir style was very calming, even though several people were interviewing me and asking me questions at once.  I admit that I was nervous but when chatting with them they were so kind. It made me loosen up and we had a genuine conversation.\r\n\r\nThey asked how I stayed organized, what I did under stress, how I deal with workplace tension, what I would do if someone didn't like me at work, how I get along with others and questions like that.  I also discussed with them my resume, answered more behavioral questions and talked about the types of training available. \r\n\r\n"}, {"date": "13 Nov 2017", "title": "Healthcare Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at NCQA (Washington, DC) in Apr 2017", "Interview Descriptions": "I had a phone interview with one of the project managers and then was called in for an in-person interview a couple weeks later. The in-person interview consisted of two panel style interviews: first with the several senior project managers and then second with other healthcare analysts. The questions were pretty standard. They wanted to know a lot about my experience using large datasets which I didn't have and I think they were looking for someone with more quantitative research skills but my experience is qualitative heavy. The HR recruiter was a nightmare to work with - never responded on time, emails were weirdly phrased and even the staff didn't seem to care for her. It was difficult interviewing for the position because they didn't tell me the specifics of the projects they needed me for.", "Interview Questions": "Why do you care about healthcare quality?"}, {"date": "1 Jun 2017", "title": "Health Care Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at NCQA in Apr 2017", "Interview Descriptions": "I had a phone screening with someone from the department. The following week they asked for in an-person or skype interview. I did a skype interview since I was not near D.C. The skype interview lasted for an hour and fifteen minutes. I waited another week and they asked for a writing sample. Once I provided that I heard nothing else from them.", "Interview Questions": "They focused a lot on my past experience and how it could be used in this position."}, {"date": "2 Aug 2016", "title": "Health Care Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at NCQA", "Interview Descriptions": "I was referred through a current employee. The interview was setup quickly. I met with two Research Associates and two current Analysts. Standard interview questions. I waited one week before reaching back out to HR about the status of the position and while I was not offered the job, they did provide interview feedback without having to ask for it.", "Interview Questions": "How familiar are you with conducting phone interviews in order to gain research information?"}, {"date": "10 Oct 2016", "title": "Healthcare Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at NCQA (Washington, DC) in Aug 2016", "Interview Descriptions": "Applied online and in a couple of weeks, received an email to schedule a phone interview. A week later, I had the phone interview but never heard back about their decision. The interview itself was unpleasant. Both my interviewers were not pleasant to speak with. Usually, interviewers try to make the candidate comfortable. There was no such attempt by the interviewers at NCQA. Both dove straight into interrogation mode. Most of their questions were along the lines of \"Do you have XYZ experience\"? They clearly were looking for very specific experiences (that were not mentioned in the position description). If they had ever read my resume, they would have realized that my answer to their questions would consistently be a \"No\". One of the interviewers asked me the definitions of mean, median, and mode; I am not sure what the relevance of high-school level questions like these held for the position I applied to.  I found the interview rather unpleasant so was not disappointed to not hear back from them.", "Interview Questions": "Define mean, median, mode. Not difficult but unexpected and I felt it was a puerile question."}, {"date": "8 Jul 2016", "title": "Health Care Analyst Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at NCQA (Washington, DC) in Jun 2016", "Interview Descriptions": "I applied online and heard back in 4 weeks. Then was scheduled for a phone interview via email. The interview was relatively short and straight forward. They asked me questions about the experiences I had listed on my resume then scheduled to connect me their hiring team.", "Interview Questions": "During the phone interview, they began by asking if I had any questions for them. Then proceeded to ask me about each experience listed on my resume."}, {"date": "18 Jul 2016", "title": "Senior Health Care Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2+ months. I interviewed at NCQA (Washington, DC) in May 2016", "Interview Descriptions": "I applied through the NCQA website at the end of April. I received an email from HR asking to schedule a phone interview about 3 weeks later. The phone call with HR was very basic--just asking me about my background and my interest in the position. They had positions open with two teams, so I scheduled interviews with both at the end of May. The first team was larger, so I met with two upper level hiring mangers for about 30 minutes and then with two Senior Health Care Analysts for 30 minutes. For the second interview, I just met with two upper level team members. Both sets of interviews were fairly standard. They wanted to know about my background and my interest in NCQA--my experience working with multiple projects simultaneously, competing deadlines, time management skills, working with teams, etc. They also talked about the projects their team are involved in and what this person's role would be. I felt both interviews went well. During both interviews it was mentioned that the teams were also interviewing internal candidates. I appreciated having this information, but I also realized that my chances of getting either position were fairly slim. And, as I had suspected, both teams ended up promoting from within and hired internal applicants. I can't begrudge them wanting to develop and grow their teams internally, but I suspect that as a result it's difficult to get hired into the organization as anything other than an entry-level analyst.\r\n\r\nThe entire process, from application to second rejection was about 10 weeks. The first team was 2 weeks from interview to rejection, the second was 6 weeks. I did have to each out to HR to receive both decisions, though the HR person was very responsive then and throughout the entire process.", "Interview Questions": "How do you prioritize when working on multiple projects?"}, {"date": "28 Aug 2015", "title": "Healthcare Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at NCQA (Washington, DC)", "Interview Descriptions": "The process started with the recruiter coordinating a phone interview. I then had another phone interview with different managers. I was then called in for an in-person interview that lasted half the day. I met different panels.", "Interview Questions": "Recall a time you had to work in a group"}], [{"date": "27 Jul 2015", "title": "Analyst In Information Products Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 3 days. I interviewed at NCQA (Washington, DC) in Jun 2015", "Interview Descriptions": "There was a screening call from someone in HR and then a phone interview with the supervisor for the position a day later. Both people were very nice and their attitudes helped me to feel at ease. The HR person in particular went out of her way to make herself available to me for additional questions.", "Interview Questions": "What interest do you have in the healthcare field?"}, {"date": "3 Apr 2015", "title": "Health Care Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2+ months. I interviewed at NCQA (Washington, DC) in Mar 2015", "Interview Descriptions": "I initially had a phone screening with a HR representative, which was straight forward resume based. Then I had in-person interviews the following week, which were two interviews with two people at a time lasting 30 minutes each. It was a pleasant experience, the interviewers made me feel relaxed and while most stuff was resume based it felt like we just had a chat about the position, the organisation and research in general.", "Interview Questions": "What is your favourite thing about research?"}, {"date": "29 Sept 2016", "title": "Senior Network Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 1 week. I interviewed at NCQA (Washington, DC) in Oct 2013", "Interview Descriptions": "Went to my interview. Took about 2 hours. Very pleasant team. Met with the Director and another engineer and pretty much gave them a good idea of what my knowledge and experience was. They had a few trick questions that I aced.", "Interview Questions": "Draw a network layout i worked on in the past."}, {"date": "4 Feb 2013", "title": "Healthcare Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at NCQA", "Interview Descriptions": "Comprehensive, typical, (2) in-person interview process, one phone screening. Typical questions.", "Interview Questions": "Describe optimal leadership. --> the reason why this was the most difficult question was because my potential manager was the person asking the question. If I did not respond to his personality, it could have been an easy way out of the position."}, {"date": "6 May 2016", "title": "Customer Engagement Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at NCQA (Washington, DC) in Feb 2012", "Interview Descriptions": "The interview was one of the favorite ever. I was interviewed in a team setting and they asked questions that were off beat yet really got to the core of my compatibility.", "Interview Questions": "What would be one reason why you would leave our company?"}, {"date": "13 Dec 2010", "title": "Healthcare Policy Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at NCQA (Washington, DC) in Nov 2010", "Interview Descriptions": "I was contacted by Sr. HR person and screened in regards to background and interest in the position.  The next step was a phone interview with the department head I will be woking in.  After the phone interview, I was invited in for a panel interview.", "Interview Questions": "Give an example of a project I have worked on in the past either form school experience or work experience that involved using qualitative and/or quantative analysis and what were the findings and/or outcome?    "}]]