[[{"date": "11 Jan 2023", "title": "Human Resources Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Hamilton College - New York", "Interview Descriptions": "Group interview with all members of the department, very nice conversation with the entire department. Felt very welcoming and it was the best interview experience I have ever had. Encouraging and friendly atmosphere, wpuld love to work with the group.", "Interview Questions": "Why do you want to work at Hamilton?"}, {"date": "8 Feb 2022", "title": "Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Hamilton College - New York", "Interview Descriptions": "A thorough interview process with a wide variety of representatives on the search committee. Well planned and structured interviews with appropriate levels of engagement at each stage of the interview process.", "Interview Questions": "prior experience with the type of work"}, {"date": "25 Jun 2021", "title": "IT Help Desk Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Hamilton College - New York", "Interview Descriptions": "It was great! The questions were applicable to the job and the conversation was really interesting and informative. The hirer was really nice and spoke to me a lot about my expectations.", "Interview Questions": "Why do you want to work here?"}, {"date": "22 Feb 2021", "title": "Visiting Assistant Professor Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Hamilton College - New York", "Interview Descriptions": "The interview process was very smooth.  They were very opened to answering all questions with honesty. The department was very nice and welcoming. The area was secluded where the college was.", "Interview Questions": "Where do you see yourself in 5 years? "}, {"date": "10 Jan 2022", "title": "Tour Guide Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at Hamilton College - New York in May 2020", "Interview Descriptions": "It's one round of interviews. You will be interviewed by a group of admission officers. Questions are very common such as why do you think you will be a good tour guide, what are you involved on campus?", "Interview Questions": "why do you think you will be a good tour guide, what are you involved on campus?"}, {"date": "11 Sept 2017", "title": "Docent Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Hamilton College - New York", "Interview Descriptions": "Easy, no tricks, they asked about experience. You apply online and then they contact you for an interview. You should find out almost immediately about hire and I think they hire almost everyone who applies.", "Interview Questions": "What is an example of a situation in which you had to resolve conflict?"}, {"date": "9 Mar 2017", "title": "Professional Staff Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Hamilton College - New York (Clinton, NY)", "Interview Descriptions": "I interviewed for a staff position at a cultural organization on campus. I had a phone interview, which I would say was more extensive than most I've had, and then a day of in-person interviews at the office in which I'd be working. Overall, it was a good experience--interviewers were friendly and gracious, they made sure to show me around the facilities/campus, and I got to meet my potential coworkers, all of which helped me assess my level of interest in the position. They were also helpful and communicative when I was making travel plans (I was traveling in from another state).\r\n\r\nI've never received a rejection from either the hiring manager or the human resources office. Considering the time I spent traveling to the interview and back, this is really disrespectful and has certainly tanked my impression of the organization. I realize \"ghosting\" on candidates has become common, but there's really no excuse for not getting in touch with a candidate to let them know the outcome of the search and thank them for their time.", "Interview Questions": "What do you know about Hamilton College?"}, {"date": "4 Jul 2017", "title": "Admission Counselor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Hamilton College - New York in Apr 2015", "Interview Descriptions": "Applied online and was contacted for a group phone interview. Everything went quite smoothly during the interview and I followed up with a thank you for each of the interviewers the same day. The experience was much like other initial interviews, but there was absolutely zero follow up from Hamilton after the interview.", "Interview Questions": "Do you anticipate any difficulties working at an institution that you did not attend for undergrad?"}, {"date": "24 Jan 2018", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 months. I interviewed at Hamilton College - New York (Clinton, NY) in Jan 2015", "Interview Descriptions": "Sent resume and cover letter to head of the department and had an in person interview. The interview was pleasant. The questions were fair. They discussed wages and compensation clearly and openly.", "Interview Questions": "What experience have you had with research?"}, {"date": "3 Aug 2016", "title": "Senior Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at Hamilton College - New York (Clinton, NY) in Oct 2014", "Interview Descriptions": "The interview process is just a way for the office to get to know your personality and your ability to represent the college well. It involves a written application to demonstrate your knowledge and passion for the college. There is also an interview with the majority of the deans, your potential colleagues, to assess how you can articulate yourself in a clear and professional manner.", "Interview Questions": "What was your favorite course at Hamilton?"}], [{"date": "8 Jul 2014", "title": "Admission Representative Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Hamilton College - New York", "Interview Descriptions": "The interview lasted for a whole day. I first met with current student representatives in a group interview format. They were very concerned with an outsider's ability to fully represent the school. I also ate lunch with them and while it wasn't formally part of the process, I'm sure conduct during lunch counted in the evaluation. I then met with the Director of Admissions for a one on one interview and then other associate directors for another group interview. The interview ended with a tour around campus and a stop at the HR office to discuss benefits and salaries.", "Interview Questions": "Why Hamilton? Give us a one minute spiel as if you were working an event."}, {"date": "19 Dec 2015", "title": "Digital Media Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Hamilton College - New York (Clinton, NY) in Mar 2014", "Interview Descriptions": "The process is very simple, with basic questions regarding digital media. A participant would have to bring past experiences in using digital media applications. The interview lasted about 10 minutes with a very casual mood.", "Interview Questions": "Q: What experience do you have regarding consumer interaction?"}, {"date": "6 Jan 2016", "title": "IT Help Desk Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Hamilton College - New York (Clinton, NY) in Mar 2013", "Interview Descriptions": "The interview was conducted by the supervisor and the student trainee. The interview began with general questions to get to know the candidate better. This was followed by questions pertinent to skills required for the job. A live role-play scenario ensued to get a better feel for the candidate's communication skills and how they would actually perform the job.", "Interview Questions": "What would you do if you had a shift at 10am and could not make it on time?"}, {"date": "27 Oct 2011", "title": "Administrator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Hamilton College - New York (Clinton, NY) in Jun 2009", "Interview Descriptions": "Was OK, but not very personable.", "Interview Questions": "Why are you interested in the position?"}]]