[[{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Great place to work", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "7 Sept 2019", "job_title": "Project Coordinator in Los Angeles, CA", "duration": "N/A", "pros": "Staff is close nit and helpful", "cons": "clients can pose strenuous senarios"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": "N/A", "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Dont believe the hype this is a DIPLOMA-MILL", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "20 Mar 2020", "job_title": "Anonymous Employee in Claremont, CA", "duration": "N/A", "pros": "easy degree if you want to put a Chuck E Cheese Degree on your wall", "cons": "This place is a diploma mill, trust and believe they are running a cash machine. They don't care about education or students. More than likely the teachers are grading papers in their drawers. CLU catalog is inconsistent, same with their degree programs. It is like hell trying to get in contact with anyone to talk about school, you want to know why? Because no one is in the school, no one has a schedule., no office hours. Imagine a college where the so-called secretary cant get you in contact with the so called President. I have taken classes here and from experience I can tell you this is a diploma mill. The advisors and the recruitment department are only concerned with getting people to pay for their faux communication courses. Lets talk about the structure of the courses it is BS, you maswell do yoga and look at inspirational BS, while paying thousands of dollars. They preach this mindfulness, but the staff are at most inconsistent and they make excuses. Heres a question when is anyone at work? As a student it will take forever to get a response from anyone of importance . I don't know how they got accreditation, I can only assume a brown paper bag.... Stay away that is my review."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 5, "Senior Management": 1, "review_title": "Limitless Squandered Potential", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "15 Apr 2018", "job_title": "Director in Claremont, CA", "duration": "N/A", "pros": "The opportunity to be in on the ground floor of a new university is thrilling and the compensation pacakage was incredible.  There was so much hope and the faculty and staff dreamed of revolutionizing higher ed.", "cons": "The executive leadership is perhaps the worst I have ever encountered professionally.  All roads lead back to the president in a way where there are no checks and balances and the president rules with absolute authority.  This causes every employee to feel that if they question decisions or even offer a dissenting opinion meant as constructive criticism that they will be marked as a traitor and then fast tracked towards termination or simply bullied into resigning.  The years I spent at CLU were the best and worst times of my professional life.  Sadly, great pay and benefits and even many great colleagues couldn’t make up for the emotional stress and subsequent health problems I suffered attempting to cope with the culture of fear and paranoia at play.  While there are multiple factors that account for the experience at CLU the main source of the problem, in my opinion, is that the role of the president is a position of absolute power.  The president is the direct appointee of the university’s sole benefactor and as such has almost fascist dictator-like control over the employees.  And like a fascist dictator she used coercion, fear, intimidation and outright bullying to push whatever her agenda was that day of the week.  If you are looking to simply get a solid paycheck and can handle emotional abuse with the perspective that working here is a means to an end then CLU could be stepping stone for you professional.  In my professional life post CLU I’ve found I’m able to let most things roll off my back because no work place will ever be as insidiously toxic as CLU was."}], []]