[[{"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Positive Experience", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "20 Apr 2017", "job_title": "Contract Organizer in Washington, DC", "duration": "N/A", "pros": "I was at CIR for almost two years and left simply due to another opportunity falling into my lap. I had a terrific experience there. There was a lot of focus on my professional development, I had a large degree of autonomy and the members that they have are energetic and willing to learn about organizing. There were a lot of opportunities to try new things. I had a lot of support from other departments (legal, political, etc) whenever I needed it and a really healthy relationship with managers. Pay and benefits are near top of the market for union staff.", "cons": "I was an outer regions staff (outer regions are MA, DC, FL and NM) and coordinating with the home office in New York can be challenging, but over the course of my time that CIR many improvements were made. Some of those challenges just come with working away from the main office and are part of the job."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 3, "Diversity and Inclusion": 3, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 0, "review_title": "Not as good as it used to be", "rating": "2.0", "reviewer_affiliation": "Former Employee", "job_date": "28 Apr 2023", "job_title": "Organizer in New York, NY", "duration": "N/A", "pros": "Great benefits Amazing members and coworkers You get to do some good organizing work in high need hospitals So much potential for greatness and you feel like you’re on the cusp of something exciting", "cons": "Recent management hires are extremely bad Cannot sustain level of growth: short staffing all around Increasing tension between staff and management which is odd because we all share a common goal Training for inexperienced organizers is non-existent"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": 3, "Career Opportunities": 5, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Decent culture; needs competitive pay", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "19 May 2022", "job_title": "Field Organizer in Palm Springs, CA", "duration": "N/A", "pros": "Culture is so much better than most SEIU locals and it’s a small shop so there’s lots of room to grow. Prefer to promote from within. Good healthcare benefits and time off policies. Very member driven. Lots of flexibility, good staff union. Good spot for semi-experienced organizers who are looking to grow their careers. Lots of flexibility for field staff.", "cons": "Pay doesn’t match up to a lot of SEIU locals so they have a lot of trouble hiring (and generally a bad HR dept). Workload can sometimes be overwhelming if you’re in a dept that’s short staffed. For newer organizers, there isn’t enough training. Flexibility for field staff comes at the cost of irregular hours (lots of late nights). Workforce represented is often short on time. Working with coworkers in different time zones."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 5, "Senior Management": 0, "review_title": "Stability vs. Mission", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "12 Jan 2017", "job_title": " in New York, NY", "duration": "N/A", "pros": "Stable job, great hours, pay for a union job and the benefits were amazing.  The staff contract is more than anyone can ask for because the staff union and stewards have done a great job.  Many refer to CIR as the \"golden handcuff\" in labor.  For purpose/mission driven people, it's not the most fulfilling, but you stay there because of stability.  Promotions and ways to move up in the org exist, but are limited.", "cons": "Lots of office politics, and the job culture is not exactly union and not exactly corporate either.  Dealing with management can be dicey, and accountability is their weak point."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 5, "Senior Management": 1, "review_title": "Great colleagues, benefits and pay - terrible senior leadership and politics", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "22 Sept 2016", "job_title": " in New York, NY", "duration": "N/A", "pros": "Great colleagues, good pay, and amazing benefits.", "cons": "Terrible senior management, terrible politics and favoritism. ED has no people skills, doesn't know how to look at the big picture, is sexist and condescending and overall should do the organization a huge favor by retiring."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "Work Atmosphere", "rating": "1.0", "reviewer_affiliation": "Current Employee", "job_date": "23 May 2015", "job_title": " in New York, NY", "duration": "N/A", "pros": "Ability to create new, innovative programs abound. But, when there's no overall, organizational strategy it ends up being a bunch of programs with no goals. Benefits are amazing.", "cons": "Lack of leadership and clear vision: no one knows what goals and benchmarks are organizational, divided executive committee, divided admin staff, overworked, understaffed bargaining unit, lack of enforcement of procedures across departments, terribly low staff morale due to last few years of drama."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "Not a good time to be joining CIR", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "28 Jan 2015", "job_title": "Organizer in New York, NY", "duration": "N/A", "pros": "Great members and colleagues, good benefits and salary", "cons": "Terrible ED and lacking in strategic vision, poor staff retention"}], []]