[[{"date": "24 Mar 2023", "title": "Marketing Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Diabetes Canada in Feb 2023", "Interview Descriptions": "For those on the job search, I’d recommend using caution when applying to Diabetes Canada. I had an hour long conversation with their HR team as a screening interview and was enthusiastically scheduled for an hour long interview with the hiring managers. At that interview, I was told I’d hear back either way (if I was a successful candidate or not) by a specific date. I hadn’t heard back by that date, and so after a few days had passed I followed up. I never received a response. After over 2 weeks I sent another nudge and was told they reposted the role again as they couldn’t find anyone suitable in the first round of applications. A month later they resent me the same rejection out of the blue. A significant amount of time was put into both the interviews and the preparation beforehand. Telling interviewers that you will give them an answer either way, and then completely going silent until a few follow ups is very disrespectful to their time and concerning.", "Interview Questions": "-inquiries regarding my not for profit experience"}, {"date": "12 Jan 2023", "title": "Software Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Diabetes Canada", "Interview Descriptions": "The interview process was a two step process meeting with the director and the senior leadership team. There are a variety of technical and behavior questions that were asked. In addition, related experiences were important.", "Interview Questions": "Why do you want to join the company?"}, {"date": "21 Nov 2021", "title": "Information Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Diabetes Canada", "Interview Descriptions": "The process started with a phone interview which was followed with a video interview and then I was contacted with an offer. Questions were not out of the ordinary - scenario based mostly.", "Interview Questions": "Q: How do you handle difficult calls or client?"}, {"date": "25 Oct 2019", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Diabetes Canada", "Interview Descriptions": "The interview process was easy and informative. They look for a positive attitude and communication skills.  want to know how much we know about the organization? as its a fundraising company, they look for someone who can work along with all teams and departments", "Interview Questions": "Why do you want to join Diabetes Canada? What is the purpose?"}, {"date": "2 Mar 2019", "title": "Inbound Customer Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Diabetes Canada (Saskatoon, SK) in Dec 2018", "Interview Descriptions": "Submit resume and cover letter, answer some preliminary questions, then a phone interview.  For a work from home position.  Interview takes about an hour over the phone. Thank you.  That is all.", "Interview Questions": "Why you want to work from home?\r\nWhat is important to you when providing customer service?\r\nHours available for work?\r\nCan you work evenings and weekends?"}, {"date": "25 Jun 2018", "title": "Engagement Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Diabetes Canada (Toronto, ON) in Feb 2018", "Interview Descriptions": "I had a phone interview, followed by two great in-person interviews. I was told during the third interview that I was the top candidate. Expecting to receive an offer, I was surprised not to receive a follow-up email from Diabetes Canada. After I sent the hiring manager an email, a representative from HR called me and let me know an internal candidate had applied for the role last minute and they will be in touch within a month to let me know if the role is mine. Incredibly unprofessional.", "Interview Questions": "Out of all the other candidates, why should we hire you?"}, {"date": "16 Jul 2017", "title": "Warehouse/Delivery Driver Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Diabetes Canada (Edmonton, AB)", "Interview Descriptions": "Good company and good team work get job ready asap\r\nBe time manner and no late for a work\r\nBe ready in morning little early  \r\nOvertimes\r\nMon to sat long term employment", "Interview Questions": "Best interviews "}, {"date": "7 May 2018", "title": "Telephone Recruiter Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Diabetes Canada (Winnipeg, MB) in Jun 2017", "Interview Descriptions": "First was a phone call to ask about me and the kind of person I am. Scheduled an in-person interview shortly afterwards. The interview was a generic interview  with normal interview questions followed by a few mock phone call to understand the process", "Interview Questions": "How would you handle a phone call with an angry person?"}, {"date": "22 Feb 2017", "title": "IT Helddesk Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Diabetes Canada (Toronto, ON) in Nov 2016", "Interview Descriptions": "The interview was arranged by the school career development specialist.  A few e-mails and quick telephone calls where arranged between the school´s career development specialist.  An introduction e-mail was sent to the Team lead and Administrator. The interview was very quick and short.", "Interview Questions": "Tell me about your education in relevant position you are applying for"}, {"date": "4 Oct 2019", "title": "Marketing Manager Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Diabetes Canada (Toronto, ON) in Aug 2015", "Interview Descriptions": "Didn't meet my boss until second interview; she was insane. They offered a low salary. The HR woman was nice. That's all I have to say! I met an HR person, and then had a second meeting with my boss, who was awful.", "Interview Questions": "can't remember, general things about my experience and where I'd worked before; how I managed to accomplish some of my previous successes"}], [{"date": "9 Mar 2015", "title": "Office Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 days. I interviewed at Diabetes Canada (Toronto, ON) in Jan 2015", "Interview Descriptions": "They did a quick phone interview, then asked me on the spot to come in about a week later. They were really unprofessional after the interview...They did not follow up with me as they said they would on a specific day and would not return any of my emails inquiring as to the status of the application process. Totally not impressed with this organizations treatment of potential candidates.", "Interview Questions": "How do you stay organized and manage multiple priorities?"}, {"date": "13 May 2014", "title": "Coordinator, Partnerships, Programs & Services Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Diabetes Canada in Apr 2014", "Interview Descriptions": "Job posted on CharityVillage. Interview process: phone, then two in-person interviews. I was called before the application deadline was even reached to set up a phone interview. I was told that there were many applicants and it was very competitive for this permanent position. In the end they were looking for someone with more project management experience.", "Interview Questions": "What is your personal philosophy of health promotion?"}, {"date": "5 Oct 2013", "title": "CSA Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1+ week. I interviewed at Diabetes Canada", "Interview Descriptions": "Hired over the phone.", "Interview Questions": "N/A"}, {"date": "6 Apr 2015", "title": "Fundraising Manager Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Diabetes Canada (Toronto, ON) in Jul 2012", "Interview Descriptions": "Three step process.  Standard.  Initial interview.  Follow-up second interview.  Final interview with senior level and job offer.  The questions were soft, and the vetting was not difficult.  The person hiring seemed intent on hiring me, which was flattering at the time, but I now realize was probably because there were not very many qualified people applying.", "Interview Questions": "Previous experience.  Situational interview questions...such as what to do in X scenario."}, {"date": "23 Apr 2016", "title": "Customer Service Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 1 day. I interviewed at Diabetes Canada (Hamilton, ON) in May 2012", "Interview Descriptions": "As I was dressed properly for the interview, and I also provide the person interviewing me with an extra copy of my resume and a copy of my references, the person interviewing me, knew that I had the experience and the correct attitude to work for the Canadian Diabetes Association.  I also indicated, that I am able to work any hours that they needed me to work, including, working on a Saturday after working a Friday night shift.", "Interview Questions": "Are you able to work any hours, that the Canadian Diabetes Association need you to work in order to obtain clothing donations."}]]