[[{"date": "8 May 2023", "title": "Recruiter Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at University of Michigan Health-West (Grand Rapids, MI) in Apr 2023", "Interview Descriptions": "Scheduled a phone screen with the recruiter. Once completed I was required to provide 5 references online, once completed I was told I’d hear back. All of my references provided feedback to the recruiter the same day. I never received a rejection email from them or anything. I wish they hadn’t made my references do all of that work just for me to be ghosted.", "Interview Questions": "What makes you want to work here?"}, {"date": "26 Jan 2021", "title": "Family Nurse Practitioner Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at University of Michigan Health-West", "Interview Descriptions": "A multi-step systematic interview beginning with human resources.  Progressing then to a peer to peer interview followed by a several hour job shadow.  Each step taking up to two to four weeks.", "Interview Questions": "Describe how your past experience has prepared you for this job?"}, {"date": "11 Jun 2021", "title": "Human Resources Position Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at University of Michigan Health-West (Grand Rapids, MI) in Jan 2021", "Interview Descriptions": "Worst female recruiter I’ve ever spoke to.  Seemed new to career.  Repeated same questions over, reiterated what I said and asks to reconfirm everything. Will talk your resume to death rather than who you are and what you can contribute. God forbid you have a gap on your resume, or left a job because you were miserable at it.  You will be disqualified as a candidate.  After this experience, I would not want to work here even if there was an offer.  Even being 100 percent honest, the way they interrogate you over the littlest details,  you will even start to doubt yourself by the end. I was ready to hang up, except I was trying to remain professional.  Fix this mess and have a more meaningful process.  The people you screen and decline are still your ambassadors in the community.  Hands down worst process I’ve ever been involved in.", "Interview Questions": "Are you sure that’s the dates of your employment? (Then repeats everything you said to have you confirm again)"}, {"date": "25 Feb 2019", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of Michigan Health-West", "Interview Descriptions": "I interviewed with the manager then had a peer interview with 3 other staff that worked on the unit. Everyone was very kind and asked if I had any questions about the unit and answered by questions honestly.", "Interview Questions": "Why do you want to work here?"}, {"date": "9 Nov 2017", "title": "Anonymous Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of Michigan Health-West", "Interview Descriptions": "It took 1 month 2 days, 4 interviews, and a bit of negotiating, but I feel it was worth it. The HR department seemed a bit confused on 100% of all goings on with the process...but in their defense HR was short handed during this time and the entire interview process was done in reverse. Other than that the interview process was not to be taken lightly, and yet a great experience.", "Interview Questions": "Why did you leave your past positions?  This is asked for every job listed on your resume, no matter how long ago the position was held. "}, {"date": "27 Sept 2017", "title": "Physician/Rheumatologist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at University of Michigan Health-West (Grand Rapids, MI) in Sept 2017", "Interview Descriptions": "over phone, they did ask about my preferences regarding general atmosphere of the practice, which is good. I didn't like when asked about my prior salary. Later I was offered a time for physical interview.", "Interview Questions": "What is you current salary "}, {"date": "6 Apr 2016", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at University of Michigan Health-West (Wyoming, MI)", "Interview Descriptions": "It was brutal.  I felt like I needed a drink after I left.  The interviewer was not easy to speak with and I wanted to slug him when I left.  I would say you better be prepared to discuss almost everything about your life.  If I wasn't so stunned I would have gotten up and left.", "Interview Questions": "Talked to death about my previous work history."}, {"date": "4 Apr 2016", "title": "Radiology Assistant II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Michigan Health-West (Grand Rapids, MI) in Mar 2016", "Interview Descriptions": "I first met and interviewed with my recruiter from HR. He asked all the legal questions and a few typical interview questions, like strengths and weaknesses, etc. He was very friendly and polite, gave me a bottle of water and everything. He also gave me a printed detailed job description and had me read over it and tell him what I thought. I then met with the head of radiology, who asked me more about my work experience and what I learned from it, and more specific questions about my skills. The whole process was about one hour.", "Interview Questions": "When someone first meets you, what is a first impression they have of you that, after getting to know you better, they realize was not accurate?"}, {"date": "10 Dec 2016", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Michigan Health-West (Cleveland, OH) in Jan 2016", "Interview Descriptions": "I went through a recruiter and then I met with the supervisor.  Then I went to orientation for 3 days. Then I started working the following week.I was in probation for 90 days after that I got a 15 cent raise. In November they made me resign.", "Interview Questions": "Why do I want to work for metrohealth?"}, {"date": "17 Aug 2015", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of Michigan Health-West (Wyoming, MI)", "Interview Descriptions": "There were 3 different interviews. One with HR, one with the Manager/Assistant Manager, and then a shadow day. The shadow day consisted of following along side of the current medical assistants as they room a patient, also the front desk check in process and then lastly the check out process.", "Interview Questions": "There were no extremely hard or unexpected questions."}], [{"date": "21 Jul 2015", "title": "Materials Handler Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at University of Michigan Health-West (Wyoming, MI)", "Interview Descriptions": "Contacted by a recruiter over the phone and was given a over the phone interview. I was then invited for a in person interview and if that goes well you have a meeting with the heads of the department for which you applied.", "Interview Questions": "What is something you need to work on? What are your long term goals? Why should we hire you?"}, {"date": "23 Sept 2014", "title": "Quality Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at University of Michigan Health-West", "Interview Descriptions": "Peer and Manger review and can be at two different times or on the same day,  Not to complicated of a process and its not too involved.  They usually offer within the week. Fairly good about notifying of status. Salary is neg at time of offer.", "Interview Questions": "All Questions are situation based"}, {"date": "18 Jun 2014", "title": "Staff Nurse Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied through a recruiter. The process took 6 months. I interviewed at University of Michigan Health-West", "Interview Descriptions": "They will take FORVER to get back to you!!! I interviewed and they did not call me back for 6 months, I had already found a job but luckily I still wanted the job and quit my other one.", "Interview Questions": "They ask you how you lots questions about working as a team player."}, {"date": "23 Feb 2014", "title": "Nurse Aide Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Michigan Health-West (Wyoming, MI) in Apr 2013", "Interview Descriptions": "The interview process was great, it was very conversation based.  There were the usual questions such as; biggest strengths/weaknesses, past job experiences that relate to current opening, etc… Overall, it was more of a sit down, relaxed atmosphere.", "Interview Questions": "What past experiences relate to the current position."}, {"date": "23 Dec 2016", "title": "Food Service Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at University of Michigan Health-West (Grand Rapids, MI) in Mar 2012", "Interview Descriptions": "I had two interviews, one with HR and the final one with the Food Services Department manager. It was relatively informal since it was an entry level, nonmedical, support positions.", "Interview Questions": "Why would I like to work at the hospital?"}, {"date": "8 Apr 2010", "title": "Information Services Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at University of Michigan Health-West (Cleveland, OH) in Sept 2009", "Interview Descriptions": "Since I alreaddy worked here and done previous work with my current bosses it was easy. Basically I was fortunate and blessed enough to know someone to get my position.", "Interview Questions": "How do you think you would fit into our team."}, {"date": "3 Jul 2010", "title": "Barista Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at University of Michigan Health-West (Cleveland, OH) in Aug 2008", "Interview Descriptions": "i was called by the supervisor she said she wanted to hire me but i needed to speak with HR so i set up an appointment and went in for my drug/background test and to have my one on one got hired then had to go for orientation", "Interview Questions": "Why do i think im good for this position"}]]