[[{"date": "19 Feb 2023", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Room to Read", "Interview Descriptions": "Very long process, several rounds of interviews, met lots of current staff, though some no longer with the organization by the time I came on board. Presentation element and long delays in between rounds, but I do know they’re actively reviewing the process and making it more streamlined for current recruitment.", "Interview Questions": "Why RtR at this moment in your career?"}, {"date": "2 Aug 2022", "title": "Management Position Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. The process took 5+ months. I interviewed at Room to Read", "Interview Descriptions": "I had three interviews in fast order, all of which seemed to go very well.  I was told that they were in a hurry to hire for the position and that I would hear from someone about the next steps soon.  They appeared very interested in me and seemed impressed with my experience.  They told me the next steps would involve another interview, and then making a presentation. \r\n\r\nAfter waiting more than two-weeks, I sent an email asking about my status.  I received a terse email informing me that I would hear from Room to Read only if I was selected to continue in the process.  I wrote back politely asking to be informed either way,  but received no acknowledgement or reply.  \r\n\r\nSince then, nothing.  Looks like Room to Read ghosted me. This is not a professional way to treat someone who has gone through three interviews already.  This experience left a bad taste in my mouth and a negative impression of how RTR treats job applicants.  The non-profit world is too small for us to be treating each other badly.", "Interview Questions": "With your extensive experience, why are you interested in this position?"}, {"date": "22 Jan 2022", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Room to Read", "Interview Descriptions": "Long interview process, several rounds, met lots of staff through the various interviews. Followed by a final prompt presentation that I had a few days to turnaround and was 5-6 hours of work. Enjoyed meeting and hearing from so many staff, but definitely intense.", "Interview Questions": "Why this cause and this role?\r\nWhat are you most nervous about with the role?"}, {"date": "20 Jul 2022", "title": "Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Room to Read (New York, NY) in Jan 2022", "Interview Descriptions": "Took about a 1.5 half. Had three interviews. First was a phone screening and the other two were with team members.  Asked generic interview questions and alot of \"tell me about a time\" type of questions", "Interview Questions": "Why do you want to work for us"}, {"date": "23 Feb 2022", "title": "Director of Finance Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Room to Read (San Francisco, CA) in Nov 2021", "Interview Descriptions": "The process took many months. I met with the recruiter, hiring manager, and a panel of people from the company. I went through the entire process, through to the final interview, then radio silence. I had to contact them three times to confirm what I already knew. I did it out of principle as candidates deserve some acknowledgement. Word of advice to this organization, you don’t seem to know who your current or future donors may be, don’t alienate them. Ultimately the reasons I was given for being passed up were for items not listed in the job posting. And while I was further offered an equivalent position that I did not apply for, the experience raised many red flags I could not ignore.", "Interview Questions": "Why are you interested in this organization?"}, {"date": "18 May 2022", "title": "Associate Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Room to Read in Oct 2021", "Interview Descriptions": "Long- 4 interviews and an assignment. Very disorganized and frankly they don't communicate with each other and it got very frustrating during the offer period which is what led me to decline the offer.", "Interview Questions": "Why do you want to work here?"}, {"date": "12 Feb 2022", "title": "Global Support Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Room to Read (San Francisco, CA) in Oct 2021", "Interview Descriptions": "Interview had three rounds and was fairly straightforward. There was an \"assignment\" but really just a prompt that asks you what you would do in a hypothetical situation to support the people you report to. Being contacted by the recruiter and the follow up scheduling of the interviews was a pretty quick process. I went to the final round and was followed by radio silence. I would understand ghosting candidates who only made it to the first round and possibly even second round, but a company should definitely let a finalist know that they have moved on with someone else. I had to reach out after over a month and was finally told what I already knew.", "Interview Questions": "Why are you interested in this role? Why do you want to leave your current role? How do you approach working in teams? "}, {"date": "9 Aug 2021", "title": "Legal Assistant Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Room to Read", "Interview Descriptions": "Three rounds of interviews with about nine different people. Each was at least an hour, I got to speak with a variety of people. After the interviews I had to get a background and credit check.", "Interview Questions": "Describe your problem solving abilities"}, {"date": "30 Jan 2022", "title": "Director of Strategic Partnerships Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Room to Read (New York, NY) in Aug 2021", "Interview Descriptions": "Overall the experience was very good.  The recruiter and senior staff that conducted the interviews were very professional but also warm and friendly. Also, it was done in a timely manner.", "Interview Questions": "Why do you want to work here?"}, {"date": "13 Jul 2021", "title": "Digital Marketing Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Room to Read in Jun 2021", "Interview Descriptions": "I had a half hour phone call with a recruiting specialist. She was friendly, but the questions were confusingly worded. She was unable to answer basic questions about the position - for example, it had the option to be remote, but there was an office I could work at in my city, and she was unable to tell me even vaguely what part of that city the office was located in. I was told I would hear whether I was advancing in 1-2 weeks, followed by radio silence for 6 weeks while the job posting remained open, at which  point I let them know I was withdrawing my application because clearly a place that can't treat interview candidates with basic decency is not going to be a good work environment.", "Interview Questions": "What  programs I have used for marketing purposes"}], [{"date": "13 Apr 2021", "title": "Strategic Marketing Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Room to Read", "Interview Descriptions": "I reached the second level, the first was a half hour call, the second a total of an hour and a half with two individuals over video call. Everyone was professional and polite.", "Interview Questions": "What interests you in this organization?"}, {"date": "17 Feb 2021", "title": "Marketing and Communications Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Room to Read", "Interview Descriptions": "I first met with someone for coffee  for my initial interview, who happened to be in my area for a conference. I also had a second phone interview with someone on the team in a different location.", "Interview Questions": "After standard job interviews, they asked who my favorite author is. "}, {"date": "11 Jan 2021", "title": "Biz Dev Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Room to Read", "Interview Descriptions": "Very thorough with several rounds meeting many of the staff ending with a presentation prompt. Short time frame on the prompt and big audience watching and asking questions with the prompt.", "Interview Questions": "Why the role? Why the org? Reason for leaving last role, fairly typical questions no curve balls."}, {"date": "4 Nov 2020", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Room to Read", "Interview Descriptions": "Two rounds. First meet with the head of HR and then meet with the CFO, Director, and colleague. First interview is about thirty minutes.  Second round is a longer, meeting with multiple people.", "Interview Questions": "How do you stay organized?"}, {"date": "24 Oct 2019", "title": "Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Room to Read (San Francisco, CA)", "Interview Descriptions": "The interview process was great. Applied and spoke with a wonderful recruiter who made me feel very comfortable and excited about the role. Shortly after came in for a final round interview with the rest of the team. I felt like I got to know the team really well, and everyone was very friendly and welcoming.", "Interview Questions": "How did you first hear about Room to Read?"}, {"date": "27 Jul 2019", "title": "Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Room to Read (San Francisco, CA) in Jun 2019", "Interview Descriptions": "It's a 3 stage interview process: first a phone screen, then 2 rounds of in-person interviews. During the in-person interviews, I met a total of 6 different people from the department. Overall, it's a very smooth interview process- the recruiter was very kind and responsive, and all the people I met made me feel welcomed and comfortable. My main piece of advice is to be sincere and allow your personality to shine through- they're looking people who will fit well into the culture of the organization as well as someone who has the appropriate professional/educational experience.", "Interview Questions": "Why did you apply for this role specifically?"}, {"date": "12 Apr 2019", "title": "Mid- Management Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Room to Read (New Delhi)", "Interview Descriptions": "First round interview with HR and another senior manager.  Second round with Country Director. The first involved questions to do with personality and knowledge. The second was more about work experience and skills.", "Interview Questions": "Some really shoddy questions including if you are married, what your siblings do, if you can speak your native language. The interviewer's attitude was hostile and the HR even looked at you in a typical up and down way -- usually, the way teenagers in high school behave towards a new person.  The HR blatantly judged your clothes, was quite unprofessional. The other interviewer openly asked unprofessional questions about past work experience including one's views on specific individuals.  The HR blatantly lied about the real workplace location (said it was going to change) to dissuade the applicant. The experience left a bad taste in the mouth. The interview with country director was better. It seemed the HR Room to Read India has a very parochial and regressive attitude. Looks like Room to Read India is filled with mediocre people who have taken powerful positions and want to guard their position. "}, {"date": "14 Jul 2018", "title": "Associate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Room to Read (New York, NY) in Jun 2018", "Interview Descriptions": "This company expected a lot and in the end, it left a bad taste in my mouth. I was contacted by a recruiter 3 days after I applied and the initial interview was 30 minutes long. It went very well and by the end of the week, I was called back for the next round. The next round, which took place the week after my first interview, was almost 4 hours long. It was with three different team members and consisted of a job assignment. The interviews themselves were great enough and I thought I connected well with all the interviewers and had a great time. The assignment was quite easy because there were resources available. However, the interview process felt quite lengthy to me as it was only the second round and they told me there two more rounds to go. After I interviewed for the second round, I emailed all the interviewers thank you notes and asked the timeline of the rest of the process. They told me they would get back to me within a week. They never did. I sent 2 follow up emails but they never answered back. Incredibly rude. I wasted 4.5 hours of my time interviewing and more hours researching and corresponding with these people. Not to mention they most likely took the assignment I completed and used it as their own. I was expecting so much from this organization and had a tremendous amount of respect for them. After that, no more.", "Interview Questions": "Basic behavioral questions. Make sure you emphasize your desire to continue the org's mission and why you want to work for them."}, {"date": "8 Jun 2018", "title": "Assistant Director of Annual Giving Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Room to Read (San Francisco, CA) in Apr 2018", "Interview Descriptions": "After submitting a resume and cover letter I was contacted for a phone screening interview. The time between submitting the application and the phone screening was about a week and a half.", "Interview Questions": "Given that you live in the East Bay, how do you feel about commuting into San Francisco?"}, {"date": "25 Aug 2017", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Room to Read", "Interview Descriptions": "- We had a brief and friendly chat about my goals, my background and life\r\n- Wanted to know more about what I wanted to do as opposed to them telling me what they expected from me", "Interview Questions": "What do you think you can contribute to our organisation?"}], [{"date": "16 Sept 2016", "title": "Marketing and Communications Associate (Temporary) Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Room to Read (San Francisco, CA) in Sept 2016", "Interview Descriptions": "The interview process went smoothly. I applied and was emailed about a phone interview a little over a week later. I had a phone interview with their HR associate less than a week later afterwards was sent an email the next day asking to come in for an in-person interview the following week. During the in-person interview I was given a writing test which was not difficult because they gave you resources to use. I then met with two members of the development team who were very nice and easy to talk to. They asked me better general questions and after about 30 minutes we were done. I found out 5 days later that I was not getting the job.", "Interview Questions": "What skills do you want to improve in this position? What are some problems you faced in your last position? They asked about my technical capabilities. "}, {"date": "23 Apr 2019", "title": "Associate Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Room to Read (New Delhi) in Feb 2016", "Interview Descriptions": "There was multiple process for the interview.  a telephonic discussion following with written test and then group panel interview. At final stage there was face to face interview of final round with ASIA regional director and Finance director.", "Interview Questions": "All related to core Finance or subject matter"}, {"date": "22 Mar 2018", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Room to Read (New York, NY) in Feb 2016", "Interview Descriptions": "Easy interview. Just need to show your interest and have a passion in the field. Just be upfront about your time commitment. Make sure you are good with your time management and leadership skills.", "Interview Questions": "Why do you want to work for Room to Read?"}, {"date": "7 Aug 2015", "title": "Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Room to Read (San Francisco, CA)", "Interview Descriptions": "If your application is successful the following steps will follow: Phone interview, in person interview, final round (including testing). References typically occur at the final stage, prior to receiving an offer.", "Interview Questions": "Why do you want to join our org? How did you first learn of us?  What skills would you like to gain or strengthen by joining the team? What differences do you see between the work you did before and this role?  How would you approach these differences?"}, {"date": "6 Aug 2015", "title": "Human Resources Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Room to Read (San Francisco, CA)", "Interview Descriptions": "The first was a phone interview with HR/Recruiter. Then, invited in-person 2 different times to meet with team and Recruiter again. Skills test took place during the 2nd round in person interview.", "Interview Questions": "Background, interest in nonprofit"}, {"date": "15 Oct 2014", "title": "Development Analyst Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Room to Read", "Interview Descriptions": "This was a 2 month process. I submitted my application, was contacted a few weeks later by a recruiter. We had an initial phone interview. Then scheduled an interview with 2 staff members (one on the specific team, one on another). Then scheduled an interview with 3 others + HR staff.", "Interview Questions": "If I called your current manager, what critical feedback would s/he give?"}, {"date": "21 Jul 2014", "title": "Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Room to Read", "Interview Descriptions": "One written test and two interviews was conducted.written test on my subject and position related questions.Interview on responsibilities and my expectation from the post.\r\nLast interview with CD and HR head on personality base question and why I want to do the job.", "Interview Questions": "Situational case and applicant's reaction to it"}, {"date": "8 Jul 2014", "title": "State Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Room to Read (New Delhi)", "Interview Descriptions": "The process is good. Application through mail after review telephonic interview was organized based on this the first round of interview was organized . The final interview was very rigorous and in depth discussion by experts.", "Interview Questions": "N/A"}, {"date": "13 Feb 2014", "title": "Development Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Room to Read", "Interview Descriptions": "Found job available on craigslist. Room to Read has a great reputation here in San Francisco. You will work extremely hard with a group of intelligent, enthusiastic colleagues who give everything to their work. My interview process took about 10 weeks from start to finish as I had to meet with multiple people in various time zones and do a ten minute presentation.", "Interview Questions": "Business cases about how to handle difficult colleagues/clients."}], [{"date": "12 Feb 2014", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 days. I interviewed at Room to Read (San Francisco, CA)", "Interview Descriptions": "Interviewed through college/university. Interview was very personable and informal. I got to tour the office and experience the intricacies of a corporate non-profit atmosphere. I would highly recommend applying for this position.", "Interview Questions": "Tell me about a time when you exemplified leadership in a business setting."}, {"date": "13 Jan 2016", "title": "Development Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Room to Read (San Francisco, CA) in Oct 2013", "Interview Descriptions": "The interview process is very thorough. I interviewed with 5 people for 4 hours total (including the first screening call). That being said, it is still relatively casual and many interviews involve a casual coffee interview to see if you're a good cultural fit for the organization. Being a culture fit on the development, PDTA, and program operations teams is key. There is less of a focus on culture fit on the finance and legal team.", "Interview Questions": "Interview questions depend on who you are interviewing with, but it is important to show your connection to and passion for the mission."}, {"date": "13 Jul 2013", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 3 weeks. I interviewed at Room to Read (San Francisco, CA)", "Interview Descriptions": "Contacted organization with interest to intern. Got prompt response from HR, which led to 1 phone interview with HR and 1 phone interview with program manager. Discussed mainly about interest and past experience, as well as potential assignment during internship.", "Interview Questions": "No difficult or unexpected question. Basic question about resume and past experience."}, {"date": "1 Dec 2015", "title": "Marketing and Communications Associate (Temporary) Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Room to Read (San Francisco, CA) in May 2013", "Interview Descriptions": "The interview process was very standard. First, they scheduled a 30 minute phone call where they asked general questions around my interest and skill level. Next, I was called in to do in-person interviews with two employees. The office was very large and spacious and employees were very friendly. I met with each employee individually in a very small room. I was asked to bring marketing samples. Afterwards, they took quite awhile to get back to me. Then I got a very standard email back mentioning I didn't get the position.", "Interview Questions": "What kind of software, i.e. Salesforce, Adobe Creative Suite, have you used and know well?"}, {"date": "10 Dec 2013", "title": "Development Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Room to Read (San Francisco, CA) in Feb 2013", "Interview Descriptions": "Phone interview", "Interview Questions": "What is your salary range"}, {"date": "2 Nov 2017", "title": "Senior Program Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 months. I interviewed at Room to Read (San Francisco, CA) in Jan 2013", "Interview Descriptions": "The first interview was with HR by phone. They asked some basic questions about my experience. Then I had an interview with 2 colleagues that would be on my team and are based abroad. These were conducted by Skype. They focused on my technical expertise and ability to work cross culturally. Then I had an interview with the hiring manager, also focused on technical expertise and organizational fit.", "Interview Questions": "What experiences have you had that make you a good candidate for this position?"}, {"date": "20 Jun 2012", "title": "Finance Analyst Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Room to Read in Jun 2012", "Interview Descriptions": "I have never been so pleased by the whole end to end interview process until now.  The position was contract and they were upfront about how the position would work before the initial phone screen even began.  Everyone I met was extremely nice and was very excited to be working at Room to Read.  They gave me an Excel skills test just to make sure I was qualified to do what I say I did.  They always said \"we'll get back to you by x\" and always contacted me on that day.  They sold me on the job, the company and the people there.", "Interview Questions": "What is it about the non profit mission that inspires you?"}, {"date": "18 Nov 2011", "title": "Development Analyst Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Room to Read in Nov 2011", "Interview Descriptions": "After applying online, I received a call 2 weeks later and had a phone interview.  it consisted of regular behavioral questions (such as Why this job?  Why development?  What experiences do you have?).  Afterwards, I was scheduled for an in-person interview at the headquarters a week later.  It consisted of 2 1:1 interviews with fellow members of the team (question were more about fit and team members).  One week later, I was scheduled for a 5 hour interview session with 6 team members.  2 could not make it though so it was 4 1:1 interviews with similar questions from each one.  More of general conversation and fit again.  Then, they contacted all 3 references I had as well as scheduled 2 phone interviews with the last two team members.", "Interview Questions": "What kind of Manager do you work best with?"}, {"date": "3 Nov 2011", "title": "Development Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Room to Read (San Francisco, CA) in Oct 2011", "Interview Descriptions": "Sent in resume and cover letter, heard back for a phone interview about 1-2 weeks later. The HR individual scheduled me for a phone interview with the recruiter a few days later. The interview screening was typical with questions about my interest in the position, as well as behavioral.", "Interview Questions": "Why are you interested in Room to Read?"}]]