[[{"date": "2 Jun 2023", "title": "Study Abroad Advisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at University of Rhode Island", "Interview Descriptions": "Excessive preparation required to develop presentation on a large, complex problem on short notice for viewing by staff and potential supervisors. Topic included recruitment ideas which were clearly what they really wanted to hear based on their note taking.", "Interview Questions": "Why am I interested in this position?"}, {"date": "28 Jan 2023", "title": "Master Gardener Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Rhode Island (Kingston, RI) in Nov 2022", "Interview Descriptions": "The initial interview was held with two of the program administrators. It was about 30 - 45 minutes. The discussion focused on overview of the program, part time position expectations and suitable candidacy.", "Interview Questions": "How does this position fit in with your career path/ goals?"}, {"date": "22 Oct 2022", "title": "Building Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of Rhode Island", "Interview Descriptions": "It was easy and nice. Very warm and welcoming, the interviewee was nice. It made me feel calm. I loved it there. Just be yourself and you'll be fine. It was nice.", "Interview Questions": "Why do you want this job?"}, {"date": "14 Aug 2022", "title": "Executive Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of Rhode Island", "Interview Descriptions": "I was interviewed by a panel of 5, one was via zoom.  Each panelist asked a question and others were allowed a follow up.  It was a process I have become very familiar with.", "Interview Questions": "How do I manage up."}, {"date": "5 Feb 2022", "title": "Assistant Professor Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at University of Rhode Island in Jan 2022", "Interview Descriptions": "Fewer meeting for a tenure tracking position in academic area. Partial online partial in person. Not many useful information a interviewer can get from this visit. Not sure will it be better if all meeting are in person", "Interview Questions": "Why you choose this position?"}, {"date": "24 Mar 2022", "title": "Lecturer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of Rhode Island (Kingston, RI) in Nov 2021", "Interview Descriptions": "The initial interview started with a panel of professors and then they asked me for a second interview and promised to be back InTouch.  I never received any thing back from them.  For the attitude from the panel I concluded that the job was already given to a candidate, my interview was just a decoy to complete. \r\n the process.  The evidence was clear when the time sheet assign a 45 minuets for a panel discussion I only had one question about 5 minutes, then the dean was bragging about hiring most of the faculty.  It is simply IMAO type of people.", "Interview Questions": "Why are you interested in the Job, How do you handle the diversity of students in the class room.  What would you see yourself after 5 years from now."}, {"date": "20 Jan 2022", "title": "Adjuct Professor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at University of Rhode Island (South Kingstown, RI) in Sept 2021", "Interview Descriptions": "They have a fairly efficient interview process. They're fairly strict regarding COVID policies which is a major plus in my opinion. Interview was conducted by a panel as is similar to other experiences I've had.", "Interview Questions": "Describe your teaching philosophy and how you assist students?"}, {"date": "13 Mar 2021", "title": "Director Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of Rhode Island", "Interview Descriptions": "Everyone was very nice, very thorough, and really personable. Had a great time during the on campus interview. The facilities are also very clean and modern, would be a wonderful place to work.", "Interview Questions": "How you would start in the position"}, {"date": "2 Sept 2022", "title": "Teacher Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at University of Rhode Island (Kingston, RI) in Mar 2021", "Interview Descriptions": "The current teachers would give you a tour, learn about your research interests, and  allow you time with the students. It is a warm welcome but they ask a lot of hard questions.", "Interview Questions": "What is your teaching philosophy? "}, {"date": "5 Aug 2019", "title": "Teacher Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 1 week. I interviewed at University of Rhode Island", "Interview Descriptions": "I was asked to apply for the position by the professor, because I had asked questions that demonstrated my knowledge of the material and was helping other students follow the material during the lecture.", "Interview Questions": "How much experience do you have presenting in front of large groups."}], [{"date": "13 Feb 2018", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at University of Rhode Island", "Interview Descriptions": "Was able to get internship through connections and also being a student at URI. Was not that hard since I did attend the school already. Did get offered the internship.", "Interview Questions": "What makes you stand out?"}, {"date": "11 Sept 2019", "title": "Administrative Position Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of Rhode Island (Kingston, RI) in Jan 2018", "Interview Descriptions": "First I had a phone interview with the manager and several key department heads. About a week or two later I had an in person interview with most of the same team - two one on one interviews and one group interview. I found everyone to be personable, professional, and they asked interesting questions and put me at ease.", "Interview Questions": "Can you point to a project that didn’t work out as you had expected? How did you respond?"}, {"date": "28 Apr 2022", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at University of Rhode Island (North Kingstown, RI) in Jan 2018", "Interview Descriptions": "The interview was fairly standard and prepared me for future interviews.  I appreciated their preparation and professionalism. I felt this interview covered any questions I had about the position and clearly set their expectations.", "Interview Questions": "Q: Discuss your past work experience."}, {"date": "28 May 2018", "title": "Service Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at University of Rhode Island (Kingston, RI) in Aug 2017", "Interview Descriptions": "Enter room with other candidates, work with another person to identify what is wrong with computers that have specific problems, such as disconnected HDD. All candidates were given offers and all accepted. Interview was done by current student employees.", "Interview Questions": "What is wrong with this computer that has this error?"}, {"date": "24 Jun 2021", "title": "Postdoctoral Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Rhode Island (Narragansett, RI) in Jul 2017", "Interview Descriptions": "The interview was super easy. You usually go through 2 short interviews. They asked questions about your research and also others like where you live, how you commute, and what your availability is.", "Interview Questions": " Questions about your previous research."}, {"date": "30 Jun 2017", "title": "Senior Word Processing Typist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at University of Rhode Island in Jun 2017", "Interview Descriptions": "I applied online and was contacted two days later by email to come in for an interview two days after that. I met with manager for a certain dept. and her asst. I already knew it was a bogus formality interview and she really wasn't interviewing me for the job. She knows a former co-worker who drove me to quit my last job because she was a nightmare to work with. So the manager was trying to provoke me into saying negative things and insulting me. It was obvious because of how sarcastic she became half-way through the interview, even to the point of insulting my intelligence. She was pretty much being a witch. \r\n\r\nWhen I asked why the person who presently holds the job is leaving, she got defensive and her tone became rude. She said she needed to change her hours because she has kids and the new position was a higher salary so she had a good reason to vacate. Hmm, based on the 10 minute interaction I had with this manager, I highly doubt that's really why she's leaving. After putting me through the ringer and insults, she suddenly says she thinks I will be bored with the job and I'll probably get tired of it so that was a concern for her. At no time did I say anything to warrant that statement and I told her I didn't feel that would be the case at all. Then she asked, even though I've been out of work for some time, if I got the job, did I need to give anyone notice - like say my husband, if I needed to check with him. Gee, maybe if I was from her generation, you know, where Fred Flintstone resides.\r\n\r\nI was told by the manager she and her asst. would make a decision by the next day because she was going on vacation for two weeks. I'm sure I will get a thanks, but no thanks email. Trust me, I'd rather be unemployed than work for that nut job.", "Interview Questions": "Many of the standard questions you get in an interview."}, {"date": "26 May 2017", "title": "Event Coordinator Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of Rhode Island (Narragansett, RI) in Mar 2017", "Interview Descriptions": "It was an informal interview. There was a panel. They asked about my experience my knowledge with customer service, event planning, scheduling, computer experience. What was the largest event I ever had.", "Interview Questions": "Did I know excel"}, {"date": "23 May 2018", "title": "Resident Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at University of Rhode Island (Kingston, RI) in Feb 2017", "Interview Descriptions": "At the time there were three stages of interviews.  The first was an online application, pretty much everyone got through past that stage.  Then there were group interviews, which did not say much about the individuals participating, but still, most people got past this.  Then there was an individual interview, which was done by someone currently in the position and their director.", "Interview Questions": "What does diversity mean to you and how can you apply it to your work life?"}, {"date": "5 May 2020", "title": "Fitwell Attendant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 1 day. I interviewed at University of Rhode Island (Kingston Station, RI) in Jan 2017", "Interview Descriptions": "Definitely needed to have an in to even get the interview. It consisted of one phone call and one in person interview where I answered some very standard questions and got the job.", "Interview Questions": "What is your prior customer service experience?"}, {"date": "17 Apr 2017", "title": "Undergraduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at University of Rhode Island (Kingston, RI) in Nov 2016", "Interview Descriptions": "All I had to do was to get in touch with the professor with whom I wanted to work to let him know. I then applied for funding from our college and got it. Which made it easy for my professor to take me, since he didn't have to pay me himself.", "Interview Questions": "It was very casual. He simply asked me what I was interested in among the projects he had available, and I chose to work one based on my skills."}], [{"date": "6 Feb 2019", "title": "Team Leader- CMA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at University of Rhode Island (Kingston, RI) in Sept 2016", "Interview Descriptions": "It was quite easy. I was contacted and asked to come in for an interview within a week of applying. The hiring manager was very nice and pleasant to talk to", "Interview Questions": "Have you worked on AV technology before"}, {"date": "20 Sept 2020", "title": "Communications Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 4 months. I interviewed at University of Rhode Island in Jun 2016", "Interview Descriptions": "Two rounds of interviews; one very formal and second one more free-flowing. The first lasted a half hour, the second  interview lasted a full hour. Each interview had a panel of about six people, including the head of the department.", "Interview Questions": "How do you deal with difficult people?"}, {"date": "9 Jan 2017", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at University of Rhode Island (North Kingston Beach, RI) in Feb 2016", "Interview Descriptions": "It was very simple. Just had to submit resume, and then answer some questions. Not super intense interview just asked about past experience. The interviewer was friendly and the position was not very competitive.", "Interview Questions": "Past experience."}, {"date": "1 Sept 2015", "title": "Writer, College of Engineering Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at University of Rhode Island (Kingston, RI) in Aug 2015", "Interview Descriptions": "The first round was conducted by phone, with three search commit embers on the line. The second interview, which I have been notified that I \"made the final cut\" will be held in person.", "Interview Questions": "Phone interview had 14 questions to answer in 30 minutes. They were broad ranging, asking about both technical knowledge and personal perspective."}, {"date": "18 Jul 2016", "title": "Upper Level Administration Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 days. I interviewed at University of Rhode Island (Kingston, RI) in Apr 2015", "Interview Descriptions": "The job was already filled, the position was only advertised to comply with federal regulations. The search committee was  a joke. They asked very few questions. One of the committee members let me know that there was an internal candidate and that the search was a formality.", "Interview Questions": "Why do you want this job"}, {"date": "31 Jan 2016", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at University of Rhode Island (Kingston, RI) in Mar 2015", "Interview Descriptions": "It was an all-day interview. I met with two main professors for my master's program. I also interviewed for one GA position. (Others got more than one interview invitation for a GA position). I also had a dinner with the professors and other applications and a dinner with current master's students.", "Interview Questions": "Tell me about a challenge or conflict you've faced at work, and how you dealt with it."}, {"date": "14 May 2015", "title": "Assistant Professor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at University of Rhode Island in Dec 2014", "Interview Descriptions": "My phone interview consisted of approximately 30 minutes conversation with five members of the hiring search committee. Each member asked me questions about myself, my teaching experience, philosophy and style as well about my research plan and my five years research plan. At the end of the interview they allowed me to ask questions.", "Interview Questions": "Tell me about your teaching philosophy and style"}, {"date": "3 Aug 2018", "title": "Game Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at University of Rhode Island (Kingston, RI) in Sept 2014", "Interview Descriptions": "Student panel asking basic interview questions: what is your past work history, when have you experienced conflict in the work place and how did you handle it, etc. Since it is primarily a student-run program, the panel was only students - the supervisors and selected game managers.", "Interview Questions": "When was a time you had to step up at work?"}, {"date": "29 Apr 2015", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at University of Rhode Island (South Kingstown, RI) in Apr 2014", "Interview Descriptions": "The position was posted on the public job board at the university where I registered and submitted my application. A couple of weeks after the application deadline I was asked to attend two panel interviews. These were scheduled to be held on campus on two consecutive days. Each interview took 1-2 hours and had 2-3 panel members including the PI.", "Interview Questions": "\"Describe the previous projects you worked on in this area of research.\""}, {"date": "8 Oct 2015", "title": "Lab Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 days. I interviewed at University of Rhode Island (Providence, RI) in Mar 2014", "Interview Descriptions": "it was friendly and they asked questions related to work and my experience. All of them had print out questions from which they asked. I found that little funny as it happened to me first time but as they told me later university required it.", "Interview Questions": "my work experience"}], [{"date": "9 Jan 2014", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at University of Rhode Island", "Interview Descriptions": "Application for graduate school, Gre and Toefl score, statement of purpose, placement exams", "Interview Questions": "Placement exam, Heracles groups to join"}, {"date": "13 Mar 2016", "title": "Undergraduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at University of Rhode Island (Providence, RI) in Jan 2014", "Interview Descriptions": "It was rather easy. Just asked questions about myself. Why am I pursuing engineering, and what do I wish to do with it. I found out I got the job right after the interview was over.", "Interview Questions": "Why am I pursuing engineering, and what do I wish to do with it."}, {"date": "15 Aug 2018", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at University of Rhode Island (Kingston, RI) in Jan 2014", "Interview Descriptions": "was a student in the program looking for free money, as a Theatre major I thought it was great to be able to teach students from other majors what goes into the workings for professional theatre and entertainment", "Interview Questions": "what makes you want to teach students?"}, {"date": "17 Nov 2013", "title": "Administrative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 4 weeks. I interviewed at University of Rhode Island (Kingston, RI)", "Interview Descriptions": "Search Committee process. Conducted telephone interview first,then was scheduled for follow-up interview on site.", "Interview Questions": "N/A"}, {"date": "6 May 2015", "title": "CMA IT Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at University of Rhode Island (North Kingstown, RI) in Jan 2012", "Interview Descriptions": "Easy, like a few questions and I got the job\r\nIt wasn't difficult, I sent an email and got responded to the same day. Then I went in to the library, which is the base of operations and went right in to an interview. Was not hard, they entire process was really laid back. I didn't even feel worried about not getting the job,", "Interview Questions": "Can you work in a team?"}, {"date": "30 Jul 2016", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 months. I interviewed at University of Rhode Island in Jan 2012", "Interview Descriptions": "Phone interview first, then on site.                                                                                                                                                              \r\nThe phone interview is 30 minutes long. Two professor asked questions about scientific projects. One asked questions to evaluate personality and behavior. They are all easygoing and the talk is very relaxing. For full-time job and those interviewees who are physically in US,on site interview is needed. The graduate students and postdocs are also involved in the onsite interview. For faculty positions, presentation as a seminar is needed. It's a one day on site interview. Including touring different labs and talking to different professors.", "Interview Questions": "Describe your previous project"}]]