[[{"date": "1 Aug 2019", "title": "Case Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Blue Ridge Behavioral Healthcare", "Interview Descriptions": "Applied online, got an email for an interview in less than a week, a couple days later HR called with a job offer. Interview was friendly and took about 30 minutes.", "Interview Questions": "Why do you want to work here? "}, {"date": "24 May 2018", "title": "Disability Case Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Blue Ridge Behavioral Healthcare (Roanoke, VA) in May 2018", "Interview Descriptions": "I had applied to this position before, but they chose another candidate. I applied again but this time I had an updated resume with relevant experience. I also contacted via email & phone the interviewer and the human resources recruiter with a proposal to do a 30 day internship without pay because I lacked clinical experience. The interviewer contacted me to setup the interview within a couple of days.", "Interview Questions": "Describe a weakness you have."}, {"date": "26 Oct 2017", "title": "Recovery Coach Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Blue Ridge Behavioral Healthcare (Roanoke, VA) in Jun 2017", "Interview Descriptions": "I saw the job on messenger on Facebook and applied for it. About a week later I received a phone call from my now supervisor, asking me if I would like to come over and shadow for a few hours one day. I said yes. During the shadow session/interview, I was asked several questions about my recovery and my past. I was nervous but told the truth. Three days after that, HR called me and made me an offer. I accepted. The application to hire was very quick. I started about three weeks after I accepted, to allow for my two weeks notice and a ten day vacation before I actually started working.", "Interview Questions": "Did I feel comfortable sharing my story with strangers?"}, {"date": "4 Jan 2017", "title": "Budget Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Blue Ridge Behavioral Healthcare (Roanoke, VA) in Sept 2016", "Interview Descriptions": "Online application submission followed up by 2 interviews. The first being a 1 on 1 and the 2nd being before a panel of program managers, business analysts, etc. The agency was very thorough and open throughout the entire process.", "Interview Questions": "Strengths and weaknesses"}, {"date": "24 Mar 2017", "title": "Clinician Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Blue Ridge Behavioral Healthcare in Jun 2016", "Interview Descriptions": "Answered questions, go over experience, provided writing sample. It was a interview held with two supervisors, and interviewee. I was told the first interview I was not qualified, but my application would be kept in the pool. I was called back months later to come in for another interview before receiving the job, which required a year's worth of weekly supervision with a LMHP.", "Interview Questions": "How would you handle a situation in which the client was offending you, and acting out dangerously?"}, {"date": "11 Mar 2016", "title": "TDT Supervisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Blue Ridge Behavioral Healthcare (Roanoke, VA) in Sept 2015", "Interview Descriptions": "The interview process was very smooth and streamlined. the interviewers made me feel very comfortable and were well informed for answering the questions I had for them. Throughout the process their HR division kept in contact and kept me informed of where I was in the process from interview to hire. Solid questions and a simple process for on-boarding!", "Interview Questions": "How do you manage your time and multiple task assignments?"}, {"date": "23 Sept 2015", "title": "Case Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Blue Ridge Behavioral Healthcare (Roanoke, VA) in May 2015", "Interview Descriptions": "It was a long process, however it was very thorough and professional and it covered all of my background and experience.  It was a panel that asked numerous questions about my experience and gave me information about the position.", "Interview Questions": "How long have I been in the mental health field."}, {"date": "2 Apr 2015", "title": "Human Resources Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Blue Ridge Behavioral Healthcare (Roanoke, VA)", "Interview Descriptions": "Manager called and asked me some questions, then interviewed with the whole team, then with just the Manager and Director. Got to meet everyone I would be working with, which was nice. The team interview was not as formal, got a feel for everyone's personality and roles on the team. Was called about a week or less later with the offer. They do start dates every other Monday, so I selected a start date and went to Orientation.", "Interview Questions": "Behavioral-based questions about \"Tell us about a time when you had a situation with a customer that did not turn out well, and what did you do?\""}, {"date": "27 Jan 2015", "title": "Case Manager (Recovery Support Teams) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at Blue Ridge Behavioral Healthcare", "Interview Descriptions": "Arrived dressed nicely and waited in lobby to meet with supervisor. Was taken to a room where another supervisor was waiting. They were friendly and it felt pretty casual. Was asked a series of hypothetical questions like \"how would you respond if a client..\" or \"what would you do if one of your clients..\" and they both wrote down everything I said WORD-FOR-WORD. Was slightly strange, as I often had to slow down and repeat myself...seems like a recorder would make things much easier for them and the interviewee. After the hypothetical questions, they gave me a worksheet of sorts that had a couple Q&A's in an essay type format, and while I completed the worksheet, they sat there across from me. It was kind of strange, but I knew how to answer most of them (ex: describe a serious mental illness that you are familiar with, it's symptoms, and it's treatment). Afterwards, I was given a tour around the building that ended in the supervisors office, where I asked a series of questions about the position.", "Interview Questions": "The hypothetical questions could be difficult if you aren't familiar with mental illnesses or human services."}, {"date": "2 Apr 2015", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 1 day. I interviewed at Blue Ridge Behavioral Healthcare (Roanoke, VA) in Sept 2014", "Interview Descriptions": "Was asked how I would handle certain situation.  After interview I waited for someone in HR to call and offer me the job. After the call I was given time to respond back and let know if I wanted job or not.", "Interview Questions": "N/A"}], []]