[[{"date": "21 Sept 2021", "title": "Infusion RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at UMPhysicians", "Interview Descriptions": "I met with the nursing supervisor and the infusion clinic manager. I had the I interview over the phone because of long distance as I was planning to move back to Minnesota. Very friendly and positive, not intimidating.", "Interview Questions": "Describe a conflict that you had with another person? "}, {"date": "23 Feb 2021", "title": "Medical Coding Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at UMPhysicians", "Interview Descriptions": "It was an easy process and everyone was so nice. It went by quickly. The recruiters are great and walk you through everything.  General questions were asked. Benefits are great.", "Interview Questions": "What Can you bring to the company."}, {"date": "7 Oct 2020", "title": "Clinic Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UMPhysicians (Saint Paul, MN) in Oct 2020", "Interview Descriptions": "It took about 3-4 weeks before I got an email about a phone screen/interview. Matthew was my recruiter. He was nice. He asked very basic questions.  This was an entry level position but it didn't seem like there was a lot of growth in the position. It's either you move up to be a supervisor or a senior clinic coordinator. So because of that, I quickly became uninterested in the position. Overall, the interview was easy and only took like 15 mins. He probably asked me like, 4-5 questions.", "Interview Questions": "Why do you think you're a great fit for this role?"}, {"date": "28 Sept 2022", "title": "RN - Clinician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at UMPhysicians (Minneapolis, MN) in Jan 2020", "Interview Descriptions": "Easy interview.  Be honest.  Share your expectations of  this position.  Process for interview easy.  It was the process after that was very lengthy.   Nice person who interviewed me, she was not a nurse so could not share the clinical expectations.", "Interview Questions": "Experience, how would you hand this situation?"}, {"date": "21 Oct 2019", "title": "Physician Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at UMPhysicians (Edina, MN) in Oct 2019", "Interview Descriptions": "Basic phone interview and full day in-person interview meeting all players of the team.  Phone interview was 1:1 with the recruiter and contained fairly common interview questions. The in-person interview with at Southdale and East Bank with 30 min interviewers with 7 member of the team. For lunch I went out for a nice meal with the team.", "Interview Questions": "Why neurology"}, {"date": "12 Apr 2021", "title": "Clinic Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at UMPhysicians (Minneapolis, MN) in Aug 2019", "Interview Descriptions": "Very basic questions geared around patient care. These consisted of how you would greet a patient and how would you help handle an issue that they were experiencing. If a patient was angry, what would your approach be?", "Interview Questions": "If you noticed a coworker was doing a task incorrectly, how would you address the situation?"}, {"date": "24 Apr 2019", "title": "Summer Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at UMPhysicians", "Interview Descriptions": "There was a phone interview and then an in person interview that lasted about a half an hour. The HR staff was very nice and supporting throughout the interview process.", "Interview Questions": "Why did you choose nursing? "}, {"date": "2 Jun 2022", "title": "Clinical Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at UMPhysicians (Minneapolis, MN) in Jan 2019", "Interview Descriptions": "Very easy. Honest people. Very clear process and the nature of job was the same as in job description . I work there for nine months and very happy there.", "Interview Questions": "Why I choose UMPhysicians for work "}, {"date": "13 Mar 2018", "title": "Patient Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at UMPhysicians (Minneapolis, MN) in Feb 2018", "Interview Descriptions": "Interview process was simple.  I met with the front desk manager and the clinic manager. The interview lasted about an hour. First part was me going over my resume and professional experience. Then the UMP employees open a packet of behavioral questions which takes up a majority of the interview. Then I got a brief tour of the front desk area of the clinic.", "Interview Questions": "Explain a time you had to handle a difficult situation or task and what did you do to overcome it or find a solution?"}, {"date": "25 Oct 2017", "title": "LADC Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at UMPhysicians", "Interview Descriptions": "The phone screen was brief and informal. The interviewer informed me we would review my experience, they would ask me a few questions, they would describe the role, and I would have the opportunity to ask questions as well. The interviewer told me the position was grant funded and only secured for 18 months which limited the salary they could afford for a counselor.", "Interview Questions": "What type of supervision do you work best under? What are your short and long term professional goals?"}], [{"date": "12 Aug 2021", "title": "Scheudling Agent Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at UMPhysicians (Minneapolis, MN) in Sept 2017", "Interview Descriptions": "The interview was straight forward and has fairly easy questions. The questions were mostly situational based questions. There were two interviews one call with HR and one with the hiring manager.", "Interview Questions": "Why do you want to work here?"}, {"date": "4 Oct 2017", "title": "Clinic Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. The process took 4 weeks. I interviewed at UMPhysicians (Minneapolis, MN) in Sept 2017", "Interview Descriptions": "I was contacted via email for an initial phone interview. I was then asked to come for an in person interview with three Clinic Coordinator Supervisors at the new Clinics and Surgery Center at the university campus. This was third time I had tried for a job there and I have no clue what it takes to get a foot in the door. I guess you have to make sure you say all the right things. Not impressed with my experience.", "Interview Questions": "What kind of hours are you looking for?"}, {"date": "22 Jan 2017", "title": "Patient Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UMPhysicians in Jan 2017", "Interview Descriptions": "Submitted application online. I was called for a phone interview and was asked to come in for a face to face. The interview was casual and the clinic supervisor was very nice. I was emailed 4 days later for a second interview. I have that next week.", "Interview Questions": "Name a time when you have gone above and beyond what was required of you in a work situation."}, {"date": "6 Aug 2016", "title": "CMA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at UMPhysicians (Minneapolis, MN)", "Interview Descriptions": "They call you set up a phone interview, then you take a personality  test, and then if you are selected you go in for an in person interview.  The process is actuality fast and easy.", "Interview Questions": "How do you handle an upset co worker?"}, {"date": "2 Jun 2016", "title": "Psychometrist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at UMPhysicians (Minneapolis, MN)", "Interview Descriptions": "Easy interview looking at past history and work-related experience. Consisted of phone screener from HR, interview with hiring manager, and interview with current employees. No behavioral questions, only wanted to know how my past experience would contribute to my capacity to work in the role.", "Interview Questions": "How do you build report with patients?"}, {"date": "14 Apr 2017", "title": "Clinic RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at UMPhysicians (Minneapolis, MN) in Apr 2016", "Interview Descriptions": "An initial interview and screening was conducted over the phone with a member of HR team first, then an over the phone interview with the department supervisor was arranged, then an in person interview with the department supervisor was arranged and completed.", "Interview Questions": "Describe a time when you worked with a challenging patient. What did you do to help resolve the situation?"}, {"date": "25 Oct 2018", "title": "CCRC Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at UMPhysicians (Minneapolis, MN) in Jul 2015", "Interview Descriptions": "It was very relaxed and professional. I never felt rushed, but that they had all the time in the world for questions. Very open and honest. Best interview I've ever had!", "Interview Questions": "What I would do in a particular situation"}, {"date": "4 Jul 2015", "title": "Clinical Supervisor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UMPhysicians in Jun 2015", "Interview Descriptions": "A recruiter emailed asking for times we could talk over the phone for an initial screening.  Once we were able to talk she sped through a script about the hospital and department.  Then she asked about 8 questions including:\r\n\r\nWhy are you looking for a job?\r\nHow did you hear about the open position?\r\nWhat is your career outlook?\r\nWhy did you leave your previous jobs (she wanted specific details)?\r\nShe wanted details about my responsibilities in previous positions.\r\nWhat can you bring to the department that will benefit the hospital and other employees?\r\nList out a specific issue you have had in the past as a supervisor and how you handled it.\r\nList out a specific issue you have had in the past as a supervisor that you were not able to resolve.\r\nWhen am I available to start?\r\nLast question was about the amount of compensation I expected.\r\n\r\nThe entire conversation lasted 45 minutes.  She said that my information would be sent to the hiring manager who would contact me in about 7-10 days.", "Interview Questions": "Why are you looking for a job?\r\nHow did you hear about the open position?\r\nWhat is your career outlook?\r\nWhy did you leave your previous jobs (she wanted specific details)?\r\nShe wanted details about my responsibilities in previous positions.\r\nWhat can you bring to the department that will benefit the hospital and other employees?\r\nList out a specific issue you have had in the past as a supervisor and how you handled it.\r\nList out a specific issue you have had in the past as a supervisor that you were not able to resolve.\r\nWhen am I available to start?\r\nLast question was about the amount of compensation I expected."}, {"date": "6 Mar 2018", "title": "Patient Representative Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at UMPhysicians (Minneapolis, MN) in Nov 2014", "Interview Descriptions": "I had a phone screen with HR, then had a group interview with other HR reps, then I interviewed with  managers in my department.  They ran a background check, and then I was hired.", "Interview Questions": "What are your strengths, what are our weaknesses, when was a time you went above and beyond, what interested you in this job, where do you see yourself in five years"}, {"date": "20 Sept 2016", "title": "Patient Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at UMPhysicians (Minneapolis, MN) in Oct 2014", "Interview Descriptions": "Interviewed with clinic supervisor and manager on clinic site. Both participated during the interview alternating with questions and answered any questions that I had. Very casual process and both presented genuine interest in the clinic and patient care.", "Interview Questions": "Explain a situation that you had to deal with a difficult customer, and what did you take away from that experience?"}], [{"date": "15 May 2014", "title": "Medical Scribe Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at UMPhysicians", "Interview Descriptions": "General and open ended questions, typicals questions of thinking about a time when you did.... (fill in the blank), strength and weakness, phone interview first, then in person interview, nothing in particular that you need to prepare for ahead of time", "Interview Questions": "N/A"}, {"date": "1 Jan 2017", "title": "Executive Assistant Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at UMPhysicians (Minneapolis, MN) in Mar 2014", "Interview Descriptions": "I was interviewed by a narcissistic moron, who would still be my \"manager\" today had I not gone to HR. The other person was a stand in for someone out of town, so not much to say there. It was a complicated interview since they had no idea how to describe the complete chaos of the company.", "Interview Questions": "Targeted selection bs that actually means nothing here. It's such a dysfunctional company that TSI is a joke that thy waste everyone's time doing. If you're interviewing here, just lie to make yourself sound better because then they'll hire you. They only hire incompetents."}, {"date": "3 Dec 2014", "title": "Health Records Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at UMPhysicians in Oct 2013", "Interview Descriptions": "You get a phone interview with a recruiter. Then you get an interview with the manger and supervisior, You get a valid paid parking. If they like you then you would get a phone call with the offer. The building is on a corner and is on top of a dairy queen.", "Interview Questions": "Unexpected question was when I was asking how fast I type."}, {"date": "8 May 2015", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at UMPhysicians (Minneapolis, MN) in Apr 2013", "Interview Descriptions": "fairly straight forward and pretty easy.  Typical interview questions. I was contacted for a screen interview that was actually a full interview.  The second interview was with a couple of colleagues.  the third one was with the hiring manager.  The last one was with a VP.  There were a few weeks between interviews.", "Interview Questions": "Strength and Weaknesses"}, {"date": "7 Mar 2016", "title": "Office Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at UMPhysicians (Minneapolis, MN) in Apr 2013", "Interview Descriptions": "Applied online, had a phone interview a week later. The phone interview was with a recruiter, which went very well. He set up an in person interview with the clinic manager a week after the initial interview. Met with the clinic manager and was hired a few days later.", "Interview Questions": "Tell me about a time when you had a conflict with an employee at work."}, {"date": "8 Jun 2015", "title": "Nurse Practitioner Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 3 months. I interviewed at UMPhysicians (Minneapolis, MN) in May 2012", "Interview Descriptions": "Took several months due to trying to coordinate with providers schedules.  Interviewer 1 hour late to interview.  Not well organized.  Did not describe the role well or the staff", "Interview Questions": "About experience."}, {"date": "30 Apr 2012", "title": "Patient Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 1 week. I interviewed at UMPhysicians (Minneapolis, MN) in Nov 2011", "Interview Descriptions": "Was contacted after submitting my resume online. Set up a phone interview and had to complete a short test, which I can't really remember what it was exactly. After the phone interview I was contacted to attend a panel interview with several clinic managers. The interview took place at a round-table setting where I was asked a lot of situational questions, questions about my background, and why I wanted to work at UMP. For patient representative positions, those with strong customer service backgrounds will do well, as this is what they are looking for a lot of the time. I had absolutely no healthcare experience, but had customer service skills, which landed me the job. I had a panel interview because at the time there were several patient rep positions open as well as some other administrative positions, which ultimately gave me the opportunity to choose which clinic I wanted to work in. I toured all the clinics and met one on one with each clinic manager, met their staff, and decided which clinic was the best fit for me. It was a tough decision to choose because each clinic offered different learning opportunities, but I feel I made the right one!", "Interview Questions": "N/A"}, {"date": "2 Sept 2015", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. I interviewed at UMPhysicians (Minneapolis, MN) in Jun 2011", "Interview Descriptions": "When applying, there will be a personality survey. I am not sure about now. Telephone Interview will be done first before a 1 on 1 interview.  Sometimes the 1 on 1 interview could be a group depending on how many supervisors the job positions involved with. After the interview, if they decided to proceed on the hiring process HR will call and discuss a pay over the phone. I find the hiring process went smoothly for me.  HR explained how their hiring process is from the beginning.", "Interview Questions": "How did you hear about University of Minnesota Physicians?"}, {"date": "14 Oct 2015", "title": "Administrative Coordinator II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at UMPhysicians (Minneapolis, MN) in Feb 2011", "Interview Descriptions": "First there was t he phone interview/screening. Then I got offered to come in for the interview with management. The interview process was great overall. The only down side was that it was more of a \"read off the paper interview Q's\", instead a flow conversation.", "Interview Questions": "If I could manage myself without supervision and be self sufficient."}]]