[[{"date": "21 Jan 2022", "title": "Marketing Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Memorial Blood Centers in Nov 2021", "Interview Descriptions": "The HR screener went line by line on why the length of each role, why I left and why I didn't select 'yes' on being able to contact former employers on the application. Not conversational and very attacking when answers were not meeting her expectations.", "Interview Questions": "Why did you mark 'do not contact' on your application?"}, {"date": "4 Oct 2016", "title": "Communications Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Memorial Blood Centers (Saint Paul, MN) in Sept 2016", "Interview Descriptions": "Initial F2F screening with the HR Manager. Then 1 hr. interview with Marketing dept managers. Very personable and professional interviewers. Outlined department and position more clearly, and then asked for questions at the end.", "Interview Questions": "What was your worst working experience and how did you handle it?"}, {"date": "22 Mar 2016", "title": "Lab Assistant Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Memorial Blood Centers (Saint Paul, MN) in Mar 2016", "Interview Descriptions": "Quick, easy interview process - I had an initial phone screening, then an on-site interview.  The phone screen was the most difficult part of the process as I felt the interviewer was not very interested in our conversation.  When I got on-site, there was a lot of paperwork to complete before I got to the actual interview.  There was only one interviewer.  I got the offer the next business day.", "Interview Questions": "Describe the main responsibilities of your previous job."}, {"date": "2 Apr 2017", "title": "Call Center Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Memorial Blood Centers (Saint Paul, MN) in May 2015", "Interview Descriptions": "First, they contact you through email, then you do a phone screening. Next, you go and interview with 2 of the call associate department.\r\nThat took about two weeks or so.", "Interview Questions": "How did you go about dealing with a conflict?\r\nWhat are your strengths and weakness?"}, {"date": "28 Sept 2016", "title": "Technical Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Memorial Blood Centers (Saint Paul, MN) in Dec 2014", "Interview Descriptions": "I was contacted the day after applying to the position via a 3rd party online website, on the third day I had an initial phone screening with HR and was offered an interview pending a completed background check and drug screening process, I received an interview the following Monday and received an offer that afternoon. The entire process took 5 days.", "Interview Questions": "What would be your first goal in this position if hired."}, {"date": "21 Oct 2015", "title": "Customer Service Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Memorial Blood Centers (Saint Paul, MN) in Nov 2014", "Interview Descriptions": "Received a call to schedule 20 minute phone interview, Set time and day. Phone interview went well, Received a call back and set up in person interview. Interview was very standard with two supervisors doing the interview.Management that interviewed under dressed and the other wearing cargo pants dressed for 2nd job stocking shelves at Target, I believe his name is Tim.\r\nThis company certainly is lax on the dress code. I figured out real quick it is a revolving door at this company.", "Interview Questions": "questions regarding past positions"}, {"date": "3 Jul 2015", "title": "Driver Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Memorial Blood Centers (Saint Paul, MN) in Oct 2014", "Interview Descriptions": "Slow, recruiter is extremely anal about everything, does not know what to actually look for in a person which is what make a good recruiter. Took 2 and a half months to actually start because she moved the start date back for no reason.", "Interview Questions": "What would you say to a nervous first time donor?"}, {"date": "21 May 2014", "title": "Lab Tech Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Memorial Blood Centers (Saint Paul, MN) in May 2014", "Interview Descriptions": "The HR person was very easy to deal with.  She called right when she said the phone interview would be, and got back to me about the in-person interview quickly.  The interview questions were fairly generic.   The interview was followed by a tour of the facility, which lasted maybe 20 minutes.  The laboratory is a bit dank and dark, even by laboratory standards, which may be an issue for some.", "Interview Questions": "I cannot recall any specific questions, only that they were fairly typical. "}, {"date": "28 Oct 2015", "title": "Lab Tech Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Memorial Blood Centers (Saint Paul, MN) in Aug 2013", "Interview Descriptions": "I was interviewed by the head of the department and her assistant.  They had a few questions to ask me and immediately brought me into the lab to meet the staff.  It was as if I already had the job before they even interviewed me.", "Interview Questions": "N/A"}, {"date": "22 Apr 2013", "title": "Training Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Memorial Blood Centers (Saint Paul, MN)", "Interview Descriptions": "Applied online and had a phone interview with HR.\r\nAn in-person interview with the manager followed within a few days.\r\nFinally, there was a 3rd interview with a panel and with a VP.\r\n\r\nThe interviewers gave several hints about the challenges with lack of updated technology and lack of technology freedom.  If the position you are interviewing for relays a lot on current technology, ensure that you ask a lot of questions related to this.", "Interview Questions": "\"Did you have the opportunity to experience integrity at your previous position?\""}], [{"date": "10 Jun 2011", "title": "Grant Writer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Memorial Blood Centers (Saint Paul, MN) in Jun 2011", "Interview Descriptions": "My first interview was a phone screening by the HR Manager.  I was then called in for a face to face interview with the Director of Marketing and Development and a major gifts officer.  I would call the questions pretty standard; walk through my resume, how to do I research and construct a grant, why the organization and its mission is attractive to me, what type of feedback I like, how do I work with minimal supervision, how do I develop and maintain relationships.  I was asked to provide writing samples at the end of the interview, and I had a portfolio already made so I brought that into the interview.  My suggestion for anyone that wants to stick out from the crowd is to have a portfolio made and bring it to the interview.  This really impressed the interviewers.  \r\n\r\nI was then brought in for a second face to face interview.  I met with the Director of Training and Education.  She asked me questions about how I manage relationships, how do I project manage and time.  I met again with the major gifts officer and director of marketing and development.  These half hour sessions were all about me asking questions.  \r\n\r\nI had a final phone interview yesterday with the director of marketing and development; she offered me the job on the phone, and HR followed up with a formal offer that is being sent in the mail.  The entire process took about 3 weeks from start to finish.  I start Monday.", "Interview Questions": "How do you manage and build relationships?"}]]