[[{"date": "14 Jun 2022", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 days. I interviewed at Tennessee Tech University (Cookeville, TN) in Mar 2022", "Interview Descriptions": "consisted of 2 interviews asking about my work history and skill sets. the interview process was very straightforward and relaxed. the interviewers were very nice, polite, and professional. the whole interview was about 30 min.", "Interview Questions": "what is your work history?"}, {"date": "11 Jul 2023", "title": "Residential Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Tennessee Tech University (Cookeville, TN) in Nov 2019", "Interview Descriptions": "Really easy and painless you do need to make sure that you stand out or have a hall director very interested in you during the mixers. Outside of the interview process is where the majority of the relationships and therefore the decisions are made.", "Interview Questions": "What is your role in a team?"}, {"date": "7 Dec 2019", "title": "Cybersecurity Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Tennessee Tech University (Cookeville, TN) in May 2019", "Interview Descriptions": "I was interviewed by 2 professors who were electrical engineers. They were also the principle investigators who were awarded a grant from the National Science Foundation to investigate smart cities, smart manufacturing, cybersecurity and information systems security & data analytics.", "Interview Questions": "I was asked about my academic performance, technical skills acquired, certifications acquired, experience with cybersecurity & informations systems security, and about other internships."}, {"date": "13 Jul 2016", "title": "News & Communications Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Tennessee Tech University (Cookeville, TN) in Apr 2016", "Interview Descriptions": "I applied online and received a call back about 2 weeks later.  I Interviewed with two department heads and a staff member. The process took about 30 minutes.  I received a call to schedule an all day campus interview. I spoke with at least 15 people during the process and had a writing test for my final hour on campus.  The people seemed nice and professional.  However, I waited almost a month later to find out whether or not I got the job, and I still didn't receive a call back.  I emailed the Director of Public Relations to check on the status of the position, but I didn't receive a response back.  I only found out that they hired someone by going on their website.  It seemed very unprofessional to not let your top candidates know whether they got the job or not.", "Interview Questions": "Why do you want to work for Tennessee Tech University?"}, {"date": "11 Oct 2015", "title": "Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Tennessee Tech University", "Interview Descriptions": "Talked to employer. We were at a table. Asked what i made in certain classes. Easy interview. Decent pay. Would do again. The quick brown fox jumped over the lazy dog.", "Interview Questions": "What grade did you make in :"}, {"date": "21 May 2019", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Tennessee Tech University (Cookeville, TN) in Aug 2015", "Interview Descriptions": "There was no interview process. You apply through financial aid and they assign you to the location on campus where you work. To work over the summer, however,  you have to show throughout the semester that you can adequately get the job done and work hard to be considered to work during that summer period. Very straightforward process and would recommend to anyone looking for extra cash while going to school.", "Interview Questions": "N/A"}, {"date": "18 Mar 2017", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Tennessee Tech University in Aug 2015", "Interview Descriptions": "Interview Process took several days and it was a good experience for me. I had to explain my previous teaching experience and the amount of time I spent on doing projects related to that field.", "Interview Questions": "Why do you think you would be a good teaching assistant for this course?"}, {"date": "3 Nov 2016", "title": "Hall Director Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Tennessee Tech University (Cookeville, TN) in Mar 2013", "Interview Descriptions": "It was an all day interview meeting with the whole Reslife department. The interview consisted of individual meetings with the Director, the Associate Director, the Assistant Directors and then the Hall Directors. Student support was there as well.", "Interview Questions": "Why are you interested in coming down to TTU from the Chicago land area?"}, {"date": "18 Jul 2011", "title": "IT Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Tennessee Tech University (Cookeville, TN) in May 2011", "Interview Descriptions": "The interview was in a conference room with most of the IT staff.  It consisted of a brief introduction of myself and a slideshow of my previous work experience.  Next was the chance of anybody in the room to ask me any questions they had.  This was the hardest part of the interview because some of the questions were aortic loaded where their was not an easy way to answer them.", "Interview Questions": "Why work here?"}, {"date": "27 Feb 2011", "title": "Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Tennessee Tech University (Cookeville, TN) in Apr 2010", "Interview Descriptions": "didn't get interviewed except by secretary", "Interview Questions": "N/A"}], [{"date": "31 May 2012", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 1 day. I interviewed at Tennessee Tech University (Cookeville, TN) in Jan 2010", "Interview Descriptions": "it was an easy interview, based on my GPA i got it", "Interview Questions": "what is your GPA"}, {"date": "15 Apr 2010", "title": "Gallery Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at Tennessee Tech University (Cookeville, TN) in Dec 2009", "Interview Descriptions": "I had to fill out a paper interview and send it through campus mail to the Gallery Coordinator. I waited three weeks before hearing back from her in email and she said that the position had been filled already. A week later I received another email from her stating that the original possible gallery assitant fell through and she offered me the job instead. And I gladly accepted.", "Interview Questions": "The questions were very basic. I think there were only 3 and they pretty much asked what skills I possesed and why I wanted the job."}]]