[[{"date": "28 Jun 2023", "title": "DEI Administrative Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at California State University in May 2023", "Interview Descriptions": "Applied online, had the initial phone call with HR and then had a panel interview with 3 others while also being recorded for others to review. I've been in a number of interviews in my career and this has got to be the worst one I've ever had. I literally started getting annoyed mid-interview when they were asking me questions that 1) were covered in both my resume and cover letter had they read it prior to meeting 2) answers I already discussed or covered when I talked about my background, but instead of listening or having a conversation, all 3 participants were looking at questions and reading from their screens. Did not make eye contact at all until finishing their question and looking up. It was just awful and I was so offended by the lack of genuine interest in a candidate they showed. They all seemed like they didn't want to be there, which then made me feel uncomfortable. Never heard back, but also didn't bother to follow-up after.", "Interview Questions": "What is your experience working in education?"}, {"date": "1 Mar 2022", "title": "Peer Mentor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at California State University (Monterey, CA) in Mar 2021", "Interview Descriptions": "It went very smooth, and the questions weren't too difficult- mostly a chance to introduce yourself to the panel. They were also very supportive and engaging throughout the interview. It wasn't more than 30 minutes.", "Interview Questions": "How do you react to stress at work?"}, {"date": "25 Jul 2022", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at California State University (Arcata, CA) in Aug 2020", "Interview Descriptions": "I was interviewed by a hiring committee of 3 people that worked in different offices across campus via zoom, though I think that the norm is to do in-person interviews.", "Interview Questions": "They wanted to know how/why diversity is important"}, {"date": "13 Apr 2020", "title": "Instructional Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at California State University", "Interview Descriptions": "I was asked by my professor if I would be available to assist in future semesters for the class. I was happy to do it for an excellent professor. The \"interview process\" was not formal and rather streamlined. The biggest waiting period was for paperwork to be processed by the school.", "Interview Questions": "There was no real interview questions. The professor already knew who was qualified."}, {"date": "6 Dec 2019", "title": "Tutor Center Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at California State University (Los Angeles, CA) in Aug 2019", "Interview Descriptions": "The recruiter was very friendly. Basically we just chat, introducing my background, introducing the responsibility of the position, and I was also asked several hypothetical situations and how I am gonna deal with.", "Interview Questions": "Why do you think we should hire you as a  tutor?"}, {"date": "22 Feb 2019", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at California State University", "Interview Descriptions": "The interview was standard with questions often asked in an interview process. It lasted for about 30 to 40 minutes. The interviewers were professional and  friendly most of time.", "Interview Questions": "How to deal with hard situation in a project"}, {"date": "8 Jun 2018", "title": "Front Counter Support Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at California State University (San Bernardino, CA) in May 2018", "Interview Descriptions": "Panel was very friendly and easy going. Each panel member asked an interview question and was very attentive to your answer. I also felt they were looking for you behavior as well.", "Interview Questions": "How do you measure success?"}, {"date": "8 Mar 2018", "title": "Buyer II Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at California State University (Long Beach, CA)", "Interview Descriptions": "I was interviewed by the associate director, contracts manager, and A/P manager with a list of questions. It was sort of like a structured interview but with less hypothetical questions.", "Interview Questions": "Describe a time when you had to deal with a difficult vendor or customer. What was the situation and how did you resolve it?"}, {"date": "11 Dec 2017", "title": "Peoplesoft Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at California State University (Hayward, CA) in May 2017", "Interview Descriptions": "There were two rounds of interviews. The first interview was with the technical Team members, who wanted to understand my technical background and skills. I was tested on software security and authentication, database concepts and SQL, and customer services experience. Since this job was mostly a tier-2 support role, there was a customer service component when explaining technical solutions in layman's terms. The second interview was with upper level management to determine if I was a good fit for the Team. They were striving for adding diversity in ideas and approaches and adding new skills to the Team.", "Interview Questions": "Describe the layers of security for a typical Web application including authentication, Web app access, data access, etc."}, {"date": "28 Feb 2017", "title": "Research Analyst Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at California State University", "Interview Descriptions": "I had a 15-minute \"screening\" interview with an HR person, then just a 1 hour interview with a panel of five people.  Unfortunately I did not get a 1-1 interview with the person who would be my immediate supervisor.  \r\n\r\nIt's after the interview and \"soft offer\" that the crazy part begins: a full background check involving previous salary verification and reference checks, and every address you've had for the past 7 years.  It took forever.", "Interview Questions": "They were reading scripted questions, really didn't deviate much from their script.  I left really not knowing much about the job I was applying for (other than what it said in the description and had researched before)."}], [{"date": "2 Dec 2016", "title": "Business Analyst-Financial Business Systems Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at California State University (Long Beach, CA) in Nov 2016", "Interview Descriptions": "I applied October 29, 2016, the job closed November 9, 2016. Shortly I received a call to schedule an interview. HR Analyst seemed extremely excited to interview. Nice Guy, process took a bit long; I'm sure it's because of Thanksgiving break. Interviewed with the company end of November, it didn't last long at all. Not a tough interview at all. Just make sure to have set examples of accomplishments you have achieved. They asked to perform a criminal history before my interview. Thought that was a bit odd.", "Interview Questions": "How does your experience apply to this job? Describe a time you had to shift your priorities to complete a task. How did you meet all your deadlines? They also asked about process improvement projects. Just make sure to know your resume. I made sure to have at least 5-10 examples from each job I had, showcasing my ability to managed my time, successful process improvement projects, and forecasting and analyzing financial statements. "}, {"date": "8 Dec 2015", "title": "Part-Time Lecturer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 months. I interviewed at California State University (Los Angeles, CA)", "Interview Descriptions": "Very thorough 1:1 interview process. I was interviewed by the Director of the department who provided an overview of the roles and responsibilities. Was  given information about the class I would be teaching and asked how I would structure it. I was also given an opportunity to share about my background in teaching and explain how it was relevant to the position I am applying for.", "Interview Questions": "Tell me about your experience teaching at the college level."}, {"date": "8 Aug 2018", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at California State University in Dec 2015", "Interview Descriptions": "Very brief, by recommendation. Submission of written papers, transcripts, copies of work evaluations and work product. The recommendations of prior co-workers and prior instructors were also considered. My appearance and ability to present were considered.", "Interview Questions": "What do you bring to the campus?"}, {"date": "2 Jun 2016", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1+ week. I interviewed at California State University (Long Beach, CA) in Sept 2015", "Interview Descriptions": "It is just the basic interview from the professor about your back ground, Technical skill and interests.\r\nafter that you are suppose to mail the Department Head about your interview and set up a brief meeting and let him know your availability", "Interview Questions": "do you have any experience with analytical and experimental stress analysis?"}, {"date": "21 May 2015", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at California State University (San Bernardino, CA)", "Interview Descriptions": "Group interview. Asked a lot of questions about experience. They interviewed six of us back-to-back. I didn't hear back for two weeks. I then called, and they said i got the position. Over all good experience, and this is a good place to work as a student.", "Interview Questions": "Please tell us a time when you could not figure out a problem, what did you do?"}, {"date": "23 Sept 2015", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at California State University in Feb 2015", "Interview Descriptions": "Initially did a phone interview with the recruiter for the position. She asked me basic questions about myself and described what the job entailed. She informed me that she was initially conducting phone interviews and that she would narrow down the candidates after that.", "Interview Questions": "Tell me about yourself."}, {"date": "30 Oct 2015", "title": "Graphic Designer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at California State University (Long Beach, CA) in Oct 2014", "Interview Descriptions": "Very friendly and laid back. Learned about the company. Basically had the position already before I went in because they liked my work. So most of the interview was just explaining more of my work and them showing me their current design work.", "Interview Questions": "Describe your design style."}, {"date": "18 Feb 2017", "title": "Graphic Designer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at California State University (Los Angeles, CA) in Jul 2014", "Interview Descriptions": "This interview was for a student position. Not the hardest interview I have ever had but it was about 30-40 minutes for a part-time job! So in that case it was pretty extreme. They asked like 15 questions. They were thoughtful questions though, meant to prepare students for interviews later in life. It definitely helped me later on, so I guess it worked.", "Interview Questions": "How do you feel about working on a diverse team?"}, {"date": "9 Sept 2015", "title": "Auditor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at California State University (Long Beach, CA) in May 2014", "Interview Descriptions": "I applied online and heard back within the week. The process to apply, interview, and receive an offer letter took about two weeks (including planning time around my schedule to fly down for an interview in Long Beach). The process was painless and efficient.", "Interview Questions": "How well do you deal with uncooperative auditees? Describe a situation and how you dealt with it."}, {"date": "26 Jun 2017", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at California State University (Northridge, CA) in Feb 2014", "Interview Descriptions": "the interview process was great. It was very straight and to the point. no beating around the bush or fluffy commentary. However, it still felt like a friendly and comfortable experience to be involved in.", "Interview Questions": "why did you choose this position?"}], [{"date": "3 Aug 2015", "title": "Academic Assistant, Grading Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 3 days. I interviewed at California State University (Sacramento, CA) in Dec 2013", "Interview Descriptions": "The interview process was more subjective than one might imagine- it was semesters of work with these professors as an undergraduate and student where i excelled on exams myself, participated in  lectures a lot, and hardly ever missed any class.  My performance, and enthusiasm for the topics were my interview in a way.  That is what set me apart as a candidate for assisting more than anything.", "Interview Questions": "Dr. Roberts once asked me how late i had ever stayed up studying for exams or writing papers during the time when i contacted her about assisting."}, {"date": "23 Mar 2017", "title": "Web Developer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at California State University (Sacramento, CA) in Mar 2013", "Interview Descriptions": "Brad was good at interviewing. He has a great poker face and the whole time you are focused. They ask great questions that no one else can think of.", "Interview Questions": "Why do I want this job? "}, {"date": "11 Jan 2016", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at California State University (Los Angeles, CA) in Aug 2012", "Interview Descriptions": "The department head conducts the interview. High importance is placed on your prior education vis-a-vis the requirements of the assistantship. High grades are definitely a plus. I was also asked for details on my undergraduate degree and the content of my major subjects. A few warm up questions on family and my decision to study in the United States.", "Interview Questions": "Prior v experience with teaching"}, {"date": "14 Jan 2016", "title": "Graphic Designer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at California State University (San Bernardino, CA) in Apr 2012", "Interview Descriptions": "First contacted for a brief phone interview. Then called in for a 1 on 1 interview where I presented my portfolio. The interview was very casual, but they did ask questions in order to gauge my knowledge in the Adobe Creative Suite programs.", "Interview Questions": "What was my favorite Disney character?"}, {"date": "9 Apr 2016", "title": "Information Technology Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at California State University (Torrance, CA) in Feb 2012", "Interview Descriptions": "Long draw out process. They were asking lots of question that were hypothetical. A lot of what if questions. It was uptight and it needed to be loosen up a bit. There were a lot of people that were nervous. It felt really hot because the A/C wasn't turn on. They did call us one on one for a second interview. The one thing that I learned is that you must be confident in yourself and let them know what you can bring to the table.", "Interview Questions": "What can you bring to the company, the other canidates can't?"}, {"date": "20 Jul 2015", "title": "Project Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at California State University (Long Beach, CA) in Jun 2011", "Interview Descriptions": "2 different interviews, both in person with travel costs covered.  First interview panel was very friendly and engaged, with a wide range of questions.  They were the program and subject matter experts.  2nd interview was with higher level decision-makers and was very friendly, mostly for confirmation. They gave me a good idea about how the organization works, what was expected and that this position had top level support.", "Interview Questions": "N/A"}, {"date": "23 Jul 2015", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 3 days. I interviewed at California State University (Hayward, CA) in Jun 2011", "Interview Descriptions": "very quick and easy, my boss already knew she wanted to hire me before the interview after she saw me volunteering at an event on campus. she basically did the interview while she was showing me around the office and where I was going to work and where our supplies were held.", "Interview Questions": "How familiar are you with Microsoft Word and Excel?"}, {"date": "20 May 2015", "title": "Auditor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at California State University (Long Beach, CA) in May 2011", "Interview Descriptions": "Interview was a group session which lasted about 45 minutes and included top management officials.  It was relaxed and consisted of a series of open ended questions.  Applicants are given the opportunity to describe similar work performed in detail.  Much emphasis is paid to certifications and previous audit experience.  The benefits of accepting a job with the state are discussed in some detail.  There was a focus on the requirements to travel to various campuses in the system of 23 campuses.", "Interview Questions": "Why are you the best person for the position?"}, {"date": "6 May 2014", "title": "Assistant Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at California State University (Turlock, CA) in Apr 2011", "Interview Descriptions": "The hiring and interview processes are fair. They pay candidates' travel expenses for interviews,  including meals. Interviewees meets with a panel of department faculty, the dean, the provost and a group of students. I was asked about my past teaching experiences, research, service, and problematic situations. The dean was most interested in my research. The provost lectured more than interviewed, and I had to look for an opportunity to chime in and describe what I could contribute to the campus.", "Interview Questions": "How did you handle a problematic situation with a colleague? "}, {"date": "7 Sept 2010", "title": "Graphic Designer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at California State University (Fresno, CA) in Sept 2009", "Interview Descriptions": "I meet with a councilor and went over a list of classes. Then I meet with a counselor about what classes I would need to make it to the finish. I meet with the department head and learned that the program was impacted and would take time to get through. I learned that there are current 250 kids waiting on 22 seats available. There is not much in the way of selection.", "Interview Questions": "What do you want to do here."}], [{"date": "1 Aug 2012", "title": "Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. The process took 3 days. I interviewed at California State University (Los Angeles, CA) in Feb 2008", "Interview Descriptions": "3 rounds, 1st being telephone, then on campus 2 day interview process including research presentation.", "Interview Questions": "Why should we hire you over other applicants."}]]