[[{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great Company", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "18 Apr 2021", "job_title": "Manager in Manchester, NH", "duration": "N/A", "pros": "Westbridge has excellent pay, benefits, and training. I have never received so many benefits as an employee before. Management invests in the training of every employee every year. As a result, there are many internal promotions. Almost all of the people on the current senior leadership team achieved their position through multiple internal promotions. The senior management team has also implemented several organizational changes in the last two years to increase two-way communication and become more employee-centered. It is a great place to work and grow. The CEO, Steven Berry, is a great leader who is highly respected.", "cons": "Really none except we have open positions that need to be filled with good hard working people who are committed to our mission."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": 4, "Career Opportunities": 1, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Great people, but they are not at all financially stable", "rating": "3.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "22 Feb 2022", "job_title": "Anonymous Employee in Manchester, NH", "duration": "N/A", "pros": "People are great, benefits are decent. Pay is decent for a non-profit", "cons": "Only 6 holidays, and sick and vacation time are separated, so if you're not someone that gets sick you're just losing those days. There's flex time so you don't even need to use it for appointments. But the biggest problem is they are financially unstable, lots of meetings and talking about ways to get out of the red...not a lot of actual action to make it happen... So, they keep running in the red and no one feels safe from a layoff."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Wonderful Place to Work!", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "30 May 2020", "job_title": "Outreach and Provider Relations Specialist in Manchester, NH", "duration": "N/A", "pros": "WestBridge is great place to work. I worked remotely for over 5 years. The teams are truly dedicated to the well-being of each participant and their families. WestBridge is strategic about every aspect of programming, management, staff support and education. They use patient-centered, research-based models of care that have been proven to work in long-term recovery. This is rewarding for staff to see participants and families quality of life improve--in many cases saving lives. I've been in behavioral health over 20 years and this has been my favorite place to work.", "cons": "Sometimes the travel can be challenging, but this is due to outside factors (i.e. delayed flights)."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Love it Here!", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "19 Jun 2019", "job_title": "Director of Business Development in Manchester, NH", "duration": "N/A", "pros": "On a day to day level I enjoy the relaxed  interactions between staff, participants, families, and alumni coordinators. Communication is not just top down yet flows several ways from family, participants, staff, national advisory board of experts in mental health and substance use disorders, family advisory council, etc. I am excited to work for an innovative caring organization! Learning, early on, about our strong treatment outcomes, confirmed by Westat and Dartmouth Medical School made confirmed that I was in the right place.  Perhaps most profoundly, it is great to see the changes in how our participants present, after a few months of treatment gains.", "cons": "I am glad that we enhanced the benefits package to include designated sick time, personal days, and a volunteer day in addition to vacation time since I started."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Professional Growth & Development Opportunities", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "15 Apr 2016", "job_title": "Anonymous Employee in Manchester, NH", "duration": "N/A", "pros": "Ability to embrace wellness and play a role in supporting participants (clients) to recover and get well.\r\nTrue collaborative teamwork environment\r\nOpportunities for professional growth & development (as far as you are willing to take it)\r\nLeadership team supports staff in offering feedback and \"having a seat at the table\".\r\nLearning to embrace the corporate culture can provide further enhancement of communication skills in other areas of your life.", "cons": "Culture of being authentic, direct and open/honest can be difficult to acclimate to if you're not open to it and doing the work to develop your skills.\r\nThis is a company that appreciates those staff who are driven, have a strong work ethic so if staff of the \"status quo\" don't identify with those qualities they may have a difficult time."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "Great environment, great mission", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "12 Jan 2018", "job_title": "Anonymous Employee in Manchester, NH", "duration": "N/A", "pros": "The staff and supervisors are very supportive and are willing to be flexible to meet employee needs.  Everyone is free to give feedback and everyone is a valued member of the WestBridge team.  Standards are very high and we provide health care that we can be proud of.", "cons": "Semi-regular work-related obligations outside work hours.  Sometimes employee feedback is not factored into company decision making.  Feedback from leaders can be a bit harsh."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Eh", "rating": "2.0", "reviewer_affiliation": "Former Employee", "job_date": "28 Oct 2016", "job_title": " in Brooksville, FL", "duration": "N/A", "pros": "The people I worked directly with were great - I really enjoyed building the friendships I did while I was working at WB.", "cons": "Once you get on their bad side, that is it..you could have done several things properly, but you have one misstep and you might as well start looking for new opportunities. For an organization that claims to be open and authentic you constantly have to watch your back. The shame based feedback you will experience while at WB really has such a negative effect on your attitude and self worth"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Once in a lifetime", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "9 Nov 2018", "job_title": "Residential Counselor in Brooksville, FL", "duration": "N/A", "pros": "Passionate staff, solid local leadership as this has been a historical challenge, new scheduling  that provide a healthy work/life balance, supportive senior leadership as this has been a historical challenge as well. An oppertunity to work at WestBridge is a gift. Very rewarding work!!", "cons": "At times there is a lower than desirable census. However, that too is beginning to shift."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "A great place to work!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "1 Dec 2017", "job_title": "Anonymous Employee in Manchester, NH", "duration": "N/A", "pros": "This organization provides very unique and comprehensive care. There is great opportunity for internal growth and to work with a team that can think outside of the box. WestBridge does a great job of focusing on both staff and participants strengths. The leadership team is flexible and willing to work with staff around personal issues.", "cons": "None at this time."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Still a great place to work", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "9 Nov 2019", "job_title": "Anonymous Employee in Manchester, NH", "duration": "N/A", "pros": "WestBridge’s  model provides continued opportunities to be part of our participants and family’s recovery journey. Unbelievable clinical fulfillment. Collaboration and overall team approach. Employee friendly working environment.", "cons": "There are no cons to report from my perspective"}], [{"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "Cult like atmosphere", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "17 Apr 2019", "job_title": "Care Manager in Brooksville, FL", "duration": "N/A", "pros": "Good pay and benefits for the area", "cons": "Before I accepted the position at WestBridge, I did some research. One word kept coming up: Cult. I took the job anyway because the pay and benefits were good, and the site looked clean, people seemed nice. After orientation the veneer wears off and you see WestBridge truly is a cult like atmosphere. You are literally given a list of approved phrases, and you will be speech and thought policed the entire time you're there. No one can be trusted, and everyone has to talk like robots, saying the same key phrases and holding the same ideas. If you question this in any way, you put a huge target on your head and will be called in to HR for re-education camp. They constantly claim they want feedback and to hear your voice, but this is a trap. In actually their model is a like a religion to them, and any questioning or independent thoughts will be punished. \r\n\r\nThe model is intentionally slow and inefficient. Insurance does not cover most of Westbridge's care, so patients are allowed to stay in pre-contemplation for YEARS without making any progress, so that Westbridge can keep milking their families for thousands of dollars every month. I have worked in long-term dual diagnosis care before, and there is no reason for it to be as slow as Westbridge is making it. They are taking advantage of desperate wealthy families and providing sub-par care. I was only there for 2 months and observed multiple relapses and re-hospitilization, and life endangering medical errors such as patients not being given their anti-biotics. \r\n\r\nWork life balance is poor, as you'll frequently find yourself staying late in meetings or up all night answering phone calls and having to drive back to work to deal with a crises. Turnover is extremely high despite good pay. This should be a huge red flag. \r\n\r\nOverall, I found management to be incredibly controlling and untrustworthy. I would not recommend WestBridge as a career path or as a treatment facility."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Outstanding organization", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "7 Jun 2018", "job_title": "Vocational Specialist in Manchester, NH", "duration": "N/A", "pros": "Incredibly supportive and compassionate staff and colleagues for participants and co-workers. By far the best job I've ever had", "cons": "My experience has been extremely positive."}]]