[[{"date": "10 Jul 2023", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Assuaged Foundation in Jul 2023", "Interview Descriptions": "The process was very smooth. What Assuage does and is about was the primary focus of the interview. I was then asked a little bit about myself and the reason why I chose Public Health. The internship was explained a little bit to me, and I was told I would receive the new hire intern paperwork to complete.", "Interview Questions": "Talk about myself and what Public Health means to me."}, {"date": "19 Jun 2023", "title": "Internship Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Assuaged Foundation (Green Valley Lake, CA)", "Interview Descriptions": "The interview process was great and the hiring manager created a welcoming environment and ensured time and video call was done easily. Overall an easy interview with questions on fit and what the company is about.", "Interview Questions": "What attracted you to this company?"}, {"date": "9 Jun 2023", "title": "Marketing Team Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Assuaged Foundation", "Interview Descriptions": "The inter view process was great! Talking to Cynthia felt like a genuine conversation rather than a pressuring, high-stress job interview. She was very kind to talk to and it felt like talking to a close friend.", "Interview Questions": "Tell me about yourself and who you are?"}, {"date": "5 Apr 2023", "title": "Public Health Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Assuaged Foundation (Dallas-Fort Worth) in Apr 2023", "Interview Descriptions": "It was a virtual interview. I did not feel like I was questioned in a formal manner. I felt warm and extremely comfortable in the conversation I had with Novalie. It was more like discussing what I have been doing and what I aim to be and why I was interested in Assuaged.", "Interview Questions": "Q: Tell me about yourself? Q: Why are you interested in us? Q: What are your academic requirements? Q: When can you start?"}, {"date": "28 Mar 2023", "title": "Public Health Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Assuaged Foundation (Rancho Cucamonga, CA) in Mar 2023", "Interview Descriptions": "I had such a lovely interview with Cynthia! The interview itself was hosted on Google Meets and lasted roughly 40 minutes. Straight to the point and felt more like a warm, welcoming conversation. Cynthia is incredibly supportive and genuinely cares about the applicants, taking the time to thoroughly read my application and answer all my questions. The majority of the time was spent on reviewing the organization's mission, values, and goals. A great experience through and through.", "Interview Questions": "Could you tell me about yourself?"}, {"date": "2 Mar 2023", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Assuaged Foundation (Falls Church, VA) in Feb 2023", "Interview Descriptions": "The interview process was great! Cynthia was kind, professional and very knowledgeable. She shared with me the presentations she used during the interview and answered all my questions. The interview was over Teams where Cynthia shared her screen with me and walked me through a powerpoint presentation that gave me a lot of information about what Assuaged is all about.", "Interview Questions": "She asked me what my background is and what my career goals are"}, {"date": "2 Feb 2023", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Assuaged Foundation (Valparaiso, IN) in Feb 2023", "Interview Descriptions": "Someone from HR had a 30-minute video meeting with me in which she explained the role, got to know me, and explained next action steps. Then she emailed me the official forms to get registered with the organization.", "Interview Questions": "Why do you want to intern with Assuaged?"}, {"date": "16 Mar 2023", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 3 days. I interviewed at Assuaged Foundation in Feb 2023", "Interview Descriptions": "The interview process with Cynthia was very easygoing and relaxed. It very quickly became an organic conversation rathe than a hardcore Q&A session. Cynthia explained what Assuaged is and the goals of the organization in a very clear manner.", "Interview Questions": "What are your goals for the internship?"}, {"date": "27 Feb 2023", "title": "Public Health Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Assuaged Foundation (Honolulu, HI) in Feb 2023", "Interview Descriptions": "My experience was pleasant. I was greeted with such enthusiasm and professionalism which lead me to feel comfortable opening up about my experience and desire to be apart of a influential foundation. I was give guidance on going through the different applications within the foundations website. I felt that this was a great place to begin working in the public health sector.", "Interview Questions": "One question was tell me why you want to work with Assuaged."}, {"date": "6 Jan 2023", "title": "Public Health Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Assuaged Foundation (Green Valley, Los Angeles, CA) in Jan 2023", "Interview Descriptions": "Very professional, but relaxed and personally catered to students' affinities. Timeframe and method (remote, video interview) were flexible and well-organized. Interview was conducted conversationally, leading to a proper discussion of student strengths and the needs of the company, as well as which hybrid of work and experiential learning would maximize the benefit of both.", "Interview Questions": "What would be one goal you would want to meet during your internship with us?"}], [{"date": "22 Jan 2023", "title": "Public Health Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Assuaged Foundation (Redlands, CA) in Jan 2023", "Interview Descriptions": "The interview process was fun and easy. I got to learn more about the program and what makes Assuaged Foundation unique. All of my questions were answered, and I got to see all of the programs Assuaged Foundation uses. Additionally, I learned that all of the interns have a great time as they get to work on various projects together.", "Interview Questions": "What can you tell me about yourself?"}, {"date": "7 Feb 2023", "title": "Public Health Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Assuaged Foundation (Whitman, MA) in Jan 2023", "Interview Descriptions": "The interview process was amazing. The person interviewing was wonderful I got to learn the basis of what the internship was. It truly was a friendly interview and it was great to give my incite and view on Public health as a whole", "Interview Questions": "Why are you passionate about Public Health"}, {"date": "31 Jan 2023", "title": "Human Resources Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Assuaged Foundation (Los Angeles, CA) in Jan 2023", "Interview Descriptions": "I believe the interview went really smooth a lot of information was given on what I will be doing and how the internship will help me in my career growth.", "Interview Questions": "How did I hear of this opportunity"}, {"date": "9 Jan 2023", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Assuaged Foundation (San Jose, CA) in Jan 2023", "Interview Descriptions": "A zoom interview was set up at a time that worked for me and Assuaged. I was able to experience my interview through zoom in the evening after my work day. I appreciated the flexibility of the interview time and how they sent a reminder to me. Very kind and professional.", "Interview Questions": "I was asked about my passion towards a plant-based diet and what inspired me to enter this field. I felt Assuaged was genuinely interested in me. I felt supported and inspired during the interview. I felt I could just be me."}, {"date": "22 Jan 2023", "title": "Public Health Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 5 days. I interviewed at Assuaged Foundation in Dec 2022", "Interview Descriptions": "Interview process was very personal as Cynthia called me and took the time to go over the different apps the foundation uses! Felt at ease on the phone call and felt welcomed to the Assuage family", "Interview Questions": "Cynthia asked questions to get to know me better and asked what my intentions were with the foundation."}, {"date": "5 Jan 2023", "title": "Student Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Assuaged Foundation (Philadelphia, PA) in Dec 2022", "Interview Descriptions": "The interview process was great. Cynthia Murphy and I had a very gainful phone call. Cynthia was very welcoming, and she made me feel at ease. The questions were mostly about getting to know me and what I want to do within&nbsp;the foundation. Assuaged genuinely cares about its students and their success.", "Interview Questions": "Q: What would you like to contribute to Assuaged? Q: Please tell me about yourself Q:What do you know about Assuaged?"}, {"date": "9 Jan 2023", "title": "Student Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Assuaged Foundation in Nov 2022", "Interview Descriptions": "The interview process felt very welcoming yet straight to the point. The interviewers were very informative and helped me in understanding the goals and mission of the organization as a whole and the position itself.", "Interview Questions": "What is your passion/what do you seek to do professionally?"}, {"date": "2 Nov 2022", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Assuaged Foundation in Sept 2022", "Interview Descriptions": "The interview process went extremely well. Cynthia was very welcoming and the dialogue was good. She was able to answer all of the questions that I had regarding the internship", "Interview Questions": "Please tell me about yourself"}, {"date": "11 Aug 2022", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Assuaged Foundation", "Interview Descriptions": "The process was really fun. Assuaged does really care about students and their success so it was an easy choice for me. A cool part about the process is that they make you upload a motivational video about yourself which makes you feel like this organization cares more about you as a person and your well-being than their bottom line.", "Interview Questions": "What do you know about Assuaged?"}, {"date": "9 Aug 2022", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Assuaged Foundation", "Interview Descriptions": "Very professional and relax.No difficult questions were ask during the interview.Cynthia was really polite and very welcoming. She made me feel inspired during the interview. Also,she made me feel like I can learn alot from the company.", "Interview Questions": "Why are you interested in this internship?"}], [{"date": "16 Nov 2022", "title": "Video Editing Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Assuaged Foundation (Los Angeles, CA) in Aug 2022", "Interview Descriptions": "Novalie Rose was helpful and welcoming as my interviewer. Although there was some screen mirroring issues with my google meeting setting, which made Rose's share screen display as a mirrored image, Rose decided to send me a video link instead of going through the introduction in the interview to resolve the problem. Overall, the interview went quickly without many questions but more of giving information about the organization itself. Thus, due to the screen mirroring issue the entire interview lasted only 5-10 mins,", "Interview Questions": "Asked to briefly talk about myself"}, {"date": "16 Nov 2022", "title": "Video Editing Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 1 day. I interviewed at Assuaged Foundation (Los Angeles, CA) in Aug 2022", "Interview Descriptions": "Novalie Rose was helpful and welcoming as my interviewer. Although there was some screen mirroring issues with my google meeting setting, which made Rose's share screen display as a mirrored image, Rose decided to send me a video link instead of going through the introduction in the interview to resolve the problem. Overall, the interview went quickly without many questions but more of giving information about the organization itself. Thus, due to the screen mirroring issue the entire interview lasted only 5-10 mins,", "Interview Questions": "Tell something more about myself"}, {"date": "21 Oct 2022", "title": "Public Health Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 days. I interviewed at Assuaged Foundation in Aug 2022", "Interview Descriptions": "Cynthia made me feel comfortable and forget that I was at an interview. Cynthia and the rest of the Assuaged team made me feel so welcome, and I am excited to be part of the team.", "Interview Questions": "What could I see myself doing in my career in public health?"}, {"date": "9 Aug 2022", "title": "Public Health Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Assuaged Foundation (San Jose, CA) in Jul 2022", "Interview Descriptions": "Very comfortable and easy to talk to.  Made me feel like we were having a conversation.  The process was smooth and inviting.  The interviewer was knowledgeable in the field.  The interview took place over Zoom and was done on time with technology issues.", "Interview Questions": "It was more of a conversation in discussing public health topics and potentially coming up with a possible solution."}, {"date": "19 Oct 2022", "title": "Research & Public Health Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 days. I interviewed at Assuaged Foundation (Green Valley Lake, CA) in Jul 2022", "Interview Descriptions": "I had a very pleasant positive experience with one of the nicest and sincere person I have ever met Cynthia. She interviewed me and we had lots in common, she asked me what I was interested in and how she can help me. The interview process was really getting to know the individual where they actually care about you, your goals, and your overall well-being. It was very informal and a breath of fresh air compared to what other employers want and ask. I highly recommend ASSUAGE Foundation to anyone that wants to intern for an amazing non-profit.", "Interview Questions": "What are your interests? What are your goals?"}, {"date": "22 Oct 2022", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Assuaged Foundation (Hamden, CT) in Jul 2022", "Interview Descriptions": "The whole process was very smooth and engaging, I felt as though I learned so much information that is going to help me with my career. Cynthia was very outgoing and she answered all questions thoroughly.", "Interview Questions": "Q: How did you hear about Assuaged?"}, {"date": "6 Jul 2022", "title": "Public Health Intern Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Assuaged Foundation (San Diego, CA) in Jun 2022", "Interview Descriptions": "Professional and warm as if having a nice conversation with a colleague. She was well prepared and carried herself confident.  She described the he positions available and what is expected.", "Interview Questions": "What are my goals to work with the company?"}, {"date": "9 May 2022", "title": "Public Health Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Assuaged Foundation (Riverton, UT) in May 2022", "Interview Descriptions": "The interview was well timed and professional. It was also flexible which worked great with my schedule. There was a little mix up on the day and time but that was sorted out quickly.", "Interview Questions": "Asked about my previous experience and about me."}, {"date": "8 Jun 2022", "title": "Student Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at Assuaged Foundation in May 2022", "Interview Descriptions": "The interview process was clear, supportive, and comfortable. Each step of the application and interview was obvious during the whole process. During the interview, the interviewer was nice and supportive. Answer and explain my question well.", "Interview Questions": "Why are you interested in this internship?"}, {"date": "3 Apr 2022", "title": "Finance Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Assuaged Foundation", "Interview Descriptions": "Easy, just a few questions about who I was. It wasn't difficult at all, and it needed very minor preparation. If you're looking to interview and work here, don't stress out too hard.", "Interview Questions": "What are you looking for in this job?"}], [{"date": "16 Mar 2022", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Assuaged Foundation", "Interview Descriptions": "The interview was good. Cynthia was really nice and very welcoming. The questions were pretty fair, mostly getting to know who I am and what I want to do in the company.", "Interview Questions": "What role would you like to take on?"}, {"date": "18 Mar 2022", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Assuaged Foundation in Mar 2022", "Interview Descriptions": "I filled out a simple application form online and received correspondence from someone in a matter of hours. \r\n\r\nThe interview process was relatively smooth. THe interviewer was very relaxed with the format and it was like talking with a new friend. She asked about my professional and personal interests. She asked what I felt I could contribute to their growing team. She went into detail about the company. It took the entire 30 minute scheduled time. Very pleasant experience.", "Interview Questions": "Can you tell me about yourself? \r\nWhat are somethings you enjoy about school? \r\nWhat was your interest in our program?\r\nWhat do you know about veganism?"}, {"date": "7 Jun 2022", "title": "Graduate Student Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Assuaged Foundation in Mar 2022", "Interview Descriptions": "The application process for the internship was very interactive and fun. It truly focused on the candidate's interests and skills. After the application process, I was contacted by one of the founders who is also the CFO and scheduled an interview meeting. The interview itself was productive and felt welcoming. I was asked about my interests and why I wanted to gain experience as an intern with Assuaged. After further discussion, I was reeled into the endless opportunities offered here. I had a great internship interview experience!", "Interview Questions": "Why are you interested in becoming an intern for Assuaged?"}, {"date": "9 Mar 2022", "title": "Data Analyst Intern Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Assuaged Foundation (San Francisco, CA) in Mar 2022", "Interview Descriptions": "I felt very comfortable, the person was very nice and kind. It was not too long or too short, I got the opportunity to ask questions. I was explained about the internship opportunity, everything was very clear.", "Interview Questions": "They asked me to talk about myself "}, {"date": "20 May 2022", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Assuaged Foundation (San Francisco, CA) in Mar 2022", "Interview Descriptions": "It was very easy, you do not feel nervous as they care about you as a person not only as a professional. They make you feel confident and valuable. It was an online interview and the job is remote.", "Interview Questions": "They asked me about my lifestyle, about my background, my goals "}, {"date": "8 Feb 2022", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Assuaged Foundation", "Interview Descriptions": "Very thorough! They took the time to get to know me as a student. I knew this was the organization I wanted to be a part of! Sweet and to the point!", "Interview Questions": "I do not remember the questions, but they are not tricky questions. They want to know you though!"}, {"date": "21 Jun 2022", "title": "Project Management Intern Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Assuaged Foundation (Los Angeles, CA) in Feb 2022", "Interview Descriptions": "The interview process was very smooth and laid-back. It was a one-round interview where I was asked about my passions and what drives me. It was very chill and relaxed process", "Interview Questions": "Tell me more about yourself?\nWhy do you want to intern with us?\nWhat are some of your skills ?"}, {"date": "4 Mar 2022", "title": "Student Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at Assuaged Foundation (Savannah, GA) in Feb 2022", "Interview Descriptions": "During the interview process I was able to make and schedule an interview time which best set my schedule.  I met via web interview with a company founder and discussed the goals and previous work that I felt were relevant to the position.", "Interview Questions": "I was asked about why I would like to intern with the company and how I felt that I would benefit from and to the team."}, {"date": "7 Mar 2022", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Assuaged Foundation in Feb 2022", "Interview Descriptions": "Cynthia conducting the interview and really made me feel at ease. She was very encouraging and passionate about Assuaged. I explained some of my limitations being active duty military stationed overseas but she was very understanding and detailed how the program would work and help me reach my goals based off the work I put in. The more we conversed the more I knew this would be the internship program I wanted to be a part of!", "Interview Questions": "What is goal of my internship and what did I want to get out of time with Assuaged?"}, {"date": "18 Jan 2022", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Assuaged Foundation (Fullerton, CA) in Jan 2022", "Interview Descriptions": "The Interview Process was absolutely wonderful! Cynthia made compromises to speak with me over the phone and I appreciate her flexibility and kindness so much. We had a great conversation that sparked so much excitement to be a part of the team. I understood more after speaking with Cynthia about the goals and morals of the company and I can't wait to be a part of it. She has such a loving and caring personality, you can tell her energy is so great just through the phone!", "Interview Questions": "What made you interested in Assuaged and what are the skills you can contribute?"}], [{"date": "21 Jan 2022", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Assuaged Foundation (Los Angeles, CA) in Jan 2022", "Interview Descriptions": "It was a very relaxing environment, and I felt extremely comfortable. We mostly spoke about my interests and my relationship with being healthy and such. It was super light hearted and it felt like I was talking to a friend. This was easily the best experience I've had with an interview, ever!", "Interview Questions": "What do you have to offer with us?"}, {"date": "7 Mar 2022", "title": "Data Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Assuaged Foundation (Dallas, TX) in Jan 2022", "Interview Descriptions": "The interview process with Cynthia was an experience like none other. Her vivacious attitude alongside her amazing personality immediately made me feel as ease during the process. She was extremely knowledgeable about the company's objectives and I definitely completed the interview ready to join the Assuaged Team.", "Interview Questions": "How will my current skills be of an asset to the company?"}, {"date": "4 Dec 2021", "title": "Remote Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Assuaged Foundation (Allentown, PA) in Dec 2021", "Interview Descriptions": "Process was very easy and communication was understandable. Felt like I was talking to a friend and not someone I just met online. I was very excited to meet for this opportunity.", "Interview Questions": "Please tell me about yourself."}, {"date": "8 Mar 2022", "title": "Public Health Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Assuaged Foundation (Green Valley Lake, CA) in Dec 2021", "Interview Descriptions": "When I applied for the position, Assuaged was incredibly prompt at getting back to me that the application was received. I thought the technology used to schedule the interview was also very considerate to both parties' availabilities and made the process painless and seamless. The virtual interview itself went smoothly and was conducted in a friendly and casual manner that didn’t make me feel stressed at all.", "Interview Questions": "1. Tell me about yourself.\r\n2. What skills do you want to improve?\r\n3. Do you believe that maintaining an active social media presence is important for staying relevant?"}, {"date": "8 Dec 2021", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at Assuaged Foundation (Boston, MA) in Dec 2021", "Interview Descriptions": "A conversation more than an interview on google meetings (remote). It was so pleasant to be spoken to like a person, not a number. The CFO, Cynthia, got on the interview as the interviewer which I thought was tremendous and exquisite. I felt important and like me as a  person mattered.", "Interview Questions": "Tell me a little about yourself\r\nDo you have any more questions for us?\r\nHave you looked at the website and interacted with certain videos?"}, {"date": "25 Mar 2022", "title": "Public Health Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 months. I interviewed at Assuaged Foundation (Norfolk, VA) in Dec 2021", "Interview Descriptions": "The interview application was very detailed and lengthy. It wasn't a cookie-cutter fill-in-the-blank type application. It required some thought. Once I was selected, I had an interview with Cynthia. She's very sweet and personable and answered all of my questions.", "Interview Questions": "If we asked you to complete an arduous task you thought was impossible at first, how would you go about it? "}, {"date": "7 Jan 2022", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Assuaged Foundation (Denver, CO) in Nov 2021", "Interview Descriptions": "In connecting with Cynthia over our interview, it was a privilege to have a glimpse into Assuaged’s ongoing evolution and the nature of their internship program. \nShe has built an empowering organization from the ground up, supported by a vision of advocating for sustainable lifestyle changes and health-conscious living, empowering voices in marginalized communities, and the overall transformation of public health systems. Through the expansion of technology and media as channels of communication with the collective audience, Assuaged holds space for individuals to connect with themselves and others—leading them to a place where they can discover those who align with the lifestyle they are striving for in the world of health. \n\nCynthia truly carries the message of envisioning a healthier, happier individual. She held space for me to freely express myself in a personal and professional manner, within an inquisitive and supportive environment. What initially pulled me in to apply for this program was their emphasis on community-based collaborative efforts to manifest a unified vision. In talking with Cynthia, I gained a deeper understanding of Assuaged’s alluring brand and their distinctly powerful message that immensely affects peoples lives in positive ways. Aside from the incredible array of benefits and valuable resources offered within this internship, I endeavored to apply for this internship due to the opportunities within this program to make valuable connections and potentially experience growth in exciting, yet challenging territories.\n\nIn sharing informational resources and offering avenues of connection, Assuaged leads the individual to a more health-conscious way of living, while encouraging connection with communities comprised of individuals facing chronic disease or a common struggle. Cynthia embodies the fearless commitment to personal health, as she demonstrates the exquisite growth and rewarding change it can lead to. Her compassionate personality intensely reflects Assuaged’s inspirational mission and their striving ideals.\n\nI believe it would be the mission of a lifetime to dedicate one’s energy to creating sustainable lifestyle changes across the individual and collective level. I am grateful for Cynthia’s time and willingness to connect. It would be a privilege to partake in an organization ultimately founded upon a meaningful vision that makes it possible to build balanced, optimistic communities.", "Interview Questions": "Cynthia asked me to expand upon why I view Assuaged as an ideal work place to learn and connect.  "}, {"date": "21 Sept 2021", "title": "Data Analyst Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Assuaged Foundation (Chicago, IL)", "Interview Descriptions": "After I applied for the internship program there was an email from Assuaged to schedule an interview date and time. Based upon my flexibility and their availability I selected the time slot. In the day there was a call from Assuaged.  The interview was for half an hour and was a very friendly interview.", "Interview Questions": "The department of interest for the internship program and the reason behind this position. My education and responsibility at my current work."}, {"date": "24 Jan 2022", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Assuaged Foundation (South Brunswick Terrace, NJ) in Sept 2021", "Interview Descriptions": "The interview process was very smooth and clear. Details about the position were stated clearly and all questions were answered thoroughly. The flow was very easy to understand. Overall the interview process was very well organized.", "Interview Questions": "Q. Why are you a good fit for Assuaged?"}, {"date": "9 Nov 2021", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Assuaged Foundation (Croton-on-Hudson, NY) in Sept 2021", "Interview Descriptions": "The interview process was great the interviewer was very personable and transparent about the work ahead.  Good questions were asked, and I can say what they look for is someone who is passionate about their work, whether it is public health, marketing film etc.", "Interview Questions": "Why do you want to do an internship here? "}], [{"date": "6 Oct 2021", "title": "Character Animator and Designer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Assuaged Foundation (Savannah, GA) in Sept 2021", "Interview Descriptions": "When I got an interview with Assuaged, the interviewer was so friendly and kind all the time, so I could feel comfortable during the interview. The most interview was about explaining what I will work on, so everything was easy going.", "Interview Questions": "Q: What was your favorite thing about Assuaged?"}, {"date": "22 Sept 2021", "title": "Content Writer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Assuaged Foundation (Denver, CO) in Sept 2021", "Interview Descriptions": "The interview process was very smooth. I felt very cared for as a human and as a professional. I have not felt that way at any company I have interviewed at before.", "Interview Questions": "What does wellness mean to you in your life? "}, {"date": "11 Oct 2021", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Assuaged Foundation in Sept 2021", "Interview Descriptions": "I interviewed with Cynthia Murphy, the CFO of Assuaged. The interview was \"easy\" because of Cynthia's encouraging and friendly demeanor. After I answered the interview questions, I learned more about Cynthia's background, how Assuaged developed, and heard about ongoing projects. I was also able to ask my own questions, which were all completely answered. \r\n\r\nwas able to ask all of my own questions. and learn not only more about Assuaged itself, but also Cynthia's background and how and how it came to be.", "Interview Questions": "One interview question was roughly \"what would you like to contribute to Assuaged?\" \r\n\r\nThere are multiple areas an intern can contribute to, such as marketing, data, project management, content, etc. "}, {"date": "24 Nov 2021", "title": "Data Analysis Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Assuaged Foundation (Lake Los Angeles, CA) in Aug 2021", "Interview Descriptions": "The interview was mutual and wasn't stressful as an interviewee. Most interviews feel one-sided, but I truly connected and had genuine conversation during my interview, which helped display my true self.", "Interview Questions": "What are you studying and why?"}, {"date": "5 Aug 2021", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Assuaged Foundation (Tuscaloosa, AL) in Aug 2021", "Interview Descriptions": "Met with Mrs. Murphy on a google video interview, she asked a few questions to get to know me personally a little bit more, and the process was easy. She also showed me a lot of the interfaces we would be using and the communication hubs.", "Interview Questions": "What led me to want to intern with Assuaged ?"}, {"date": "31 Jan 2022", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Assuaged Foundation (Loma Linda, CA) in Aug 2021", "Interview Descriptions": "Interview went very smoothly and efficiently. The questions were easy to answer and I did not feel pressured in any way. I was comfortable speaking with the interviewer and was able to communicate effectively.", "Interview Questions": "What are you studying in school?"}, {"date": "2 Jul 2021", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 1+ week. I interviewed at Assuaged Foundation (Los Angeles, CA) in Jul 2021", "Interview Descriptions": "The interviewer is very nice. After asking a few basic questions, she gave me a detailed introduction to the company's structure, activities, history, and development prospects. I really hope to be able to work with her soon!", "Interview Questions": "Tell me about yourself please?"}, {"date": "29 Jul 2021", "title": "Character Animator REMOTE Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Assuaged Foundation (Freeport, ME) in Jul 2021", "Interview Descriptions": "After choosing my interview appointment time, I was sent a confirmation, so I could add it to my Google calendar with ease. I received a reminder email about the appointment an hour before the time. Though we had some technical difficulties, when we finally connected, the interview was friendly and informative about the brand. There was interest in me as a person and student, and what I was looking for as an intern. I felt very comfortable and was offered opportunities to ask questions often.", "Interview Questions": "What made you interested in Assuaged? "}, {"date": "9 Aug 2021", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Assuaged Foundation (Green Valley Lake, CA) in Jul 2021", "Interview Descriptions": "The interview was great! I was provided insight into what an internship with Assuaged would entail, as well as their mission goals. I was asked questions that were challenging and elucidating. The interview had open communication and salient detail.", "Interview Questions": "Interview questions were along the lines of fields of proficiency, personal goals for career, and ability as a team member. Additionally, during the interview was able to provide an introduction and highlight my abilities. "}, {"date": "26 Aug 2021", "title": "Film and Video Editor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Assuaged Foundation (Castaic, CA) in Jul 2021", "Interview Descriptions": "The interview process was well-organized and professional. It was done over Google Meet and the interviewer arrived at the time we had previously agreed upon. Questions asked pertained to the position and the interviewer had a lot of infectious energy.", "Interview Questions": "What do major in and how can that contribute to the company?"}], [{"date": "10 Aug 2021", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Assuaged Foundation (East Lansing, MI) in Jul 2021", "Interview Descriptions": "The process was very easy! Cynthia was extremely sweet and very easy to talk to. It made the nerves of a job interview non-existent. She started off the topic with talking about astrology, which made me think that she is easy-going and fun. I definitely look for employers who make me feel like a part of their team right off the bat. We then mostly talked about my background in regards to a healthy lifestyle. It included a lot of small talk and everyday conversation, as well as showing me the behind-the-scenes of the company to give me a perspective.", "Interview Questions": "What do you do to take care of yourself?"}, {"date": "17 Jun 2021", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Assuaged Foundation", "Interview Descriptions": "The  interviewer made me feel comfortable during the interview and was easy to talk to. Was transparent with what the company does, who the partners are and future projects. Felt like you could ask any questions.", "Interview Questions": "Tell me about yourself and what your goals are. "}, {"date": "14 Jun 2021", "title": "Summer Internship Program Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Assuaged Foundation (Demarest, NJ)", "Interview Descriptions": "The interview process was intimidating at first but quickly became very enjoyable being able to about plans, goals, and accomplishments. Throughout the duration of the interview, there many positive past accomplishments and", "Interview Questions": "One question was \"why this company\""}, {"date": "12 Jul 2021", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Assuaged Foundation (Ogden, UT) in Jun 2021", "Interview Descriptions": "The interview process was easy. I felt engaged and inspired. The interviewer was interested in my background and showed me many facets of the company.  I was shown the different platforms that they used, as well as what I would be doing as an intern.", "Interview Questions": "I was asked about my education experience."}, {"date": "1 Feb 2022", "title": "Project Management Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Assuaged Foundation in Jun 2021", "Interview Descriptions": "After applying, a schedule is made with Cynthia virtually. Questions are asked regarding your goals, what you'd like to accomplish, etc. My experience, itself, took a bit long due to a lot of factors coming into play, however, Cynthia did keep in touch throughout the process and I was able to join the internship on January 2022.", "Interview Questions": "What are your goals after graduating from school?"}, {"date": "10 May 2021", "title": "Remote Data Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Assuaged Foundation (Tampa, FL)", "Interview Descriptions": "The interview process was very fulfilling. I learned about the mission and goals assuaged has a company.  We talked about some things that I'd be involved with as an intern. The environment was overall very welcoming.", "Interview Questions": "I was asked about my background, what I'm studying, and any hobbies that I have. "}, {"date": "8 Jun 2021", "title": "Summer Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Assuaged Foundation in May 2021", "Interview Descriptions": "Very streamlined and straightforward. The initial application was simple and the interview was one of the best I've had. Very positive and much more personal than usual. While some focus on my qualifications, there was a point in the meeting when we were discussing things like birth charts. Felt much more personal than I am used to  (which is a good thing!).", "Interview Questions": "Why would you like to work for Assuaged?"}, {"date": "7 Jun 2021", "title": "Digital Marketing Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Assuaged Foundation (Philadelphia, PA) in May 2021", "Interview Descriptions": "The interview process was straightforward and enjoyable! I didn't feel stressed like I usually do during interviews. Assuaged does a good job at making applicants feel comfortable and supported. They had good communication as well, which I respect.", "Interview Questions": "They asked about myself and my past experiences."}, {"date": "9 May 2021", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Assuaged Foundation in Apr 2021", "Interview Descriptions": "The interview process was pleasant and easy. The interviewer was kind and patient even though I was nervous. Made me feel comfortable, mostly asked questions about me and my interests. The entire conversation was on the phone, and there weren't any difficult questions. ", "Interview Questions": "What do you hope to get out of this internship?"}, {"date": "10 May 2021", "title": "Research & Public Health Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Assuaged Foundation in Apr 2021", "Interview Descriptions": "Joined the call, was asked about myself, asked about Assuaged and what they do, was asked about my previous job experience and skills, asked about what my role would look like as an intern.", "Interview Questions": "Q: What is your experience with video editing?"}], [{"date": "4 Jun 2021", "title": "Public Health Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Assuaged Foundation in Apr 2021", "Interview Descriptions": "I discovered Assuaged through Chegg internships. Once I found it and checked out the website I knew it was something I wanted to be apart of. I applied online and had a scheduled interview shortly after that. Initially, I was very anxious for the interview, however once it started Cynthia was extremely welcoming and kind which helped me to relax! Overall the interview went very well.", "Interview Questions": "Why do you want to intern with Assuaged?"}, {"date": "1 Apr 2021", "title": "Summer Internship Program Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Assuaged Foundation", "Interview Descriptions": "The interview went great! I loved my interviewer, Cynthia. She was super nice and easy to talk to. I was nervous throughout the whole interview,  but it wasn't bad at all. I was nervous for no reason.", "Interview Questions": "Q: Tell me some things about yourself."}, {"date": "7 Jul 2021", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Assuaged Foundation in Apr 2021", "Interview Descriptions": "The interview process was amazing! Unlike other interviews, it was very easy going but structured as well. Cynthia was great as she not only introduced the organization and the benefits of working within Assuaged.  She answered questions honestly and made me excited to be a part of the organization.", "Interview Questions": "Where do you see yourself fitting within the organization? "}, {"date": "22 Mar 2021", "title": "Public Health Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Assuaged Foundation", "Interview Descriptions": "I had my interview with the founder, Cynthia. She was very welcoming and made me feel comfortable during the interview process. I could tell that she wants to get to know each interviewee and she allowed many opportunities for any questions.", "Interview Questions": "Tell me a little about yourself."}, {"date": "9 Mar 2021", "title": "Public Health Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Assuaged Foundation", "Interview Descriptions": "Mrs. Murphy was very friendly and sweet. She explained the process and mission of Assuaged. We spent time discussing other fun topics as well. Overall, it was very pleasant and informative. Thank you for the opportunity!", "Interview Questions": "Tell me more about yourself"}, {"date": "23 Mar 2021", "title": "Video Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Assuaged Foundation (Riverside, CA) in Mar 2021", "Interview Descriptions": "One on one phone/video interview that was comfortable and made me excited to join the team. The background and mission of the company was explained thoroughly and all questions were addressed.", "Interview Questions": "They asked me about myself. "}, {"date": "26 Mar 2021", "title": "Public Health Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Assuaged Foundation in Mar 2021", "Interview Descriptions": "The interview went very well. Cynthia was very welcoming, she is the best! She relieved my anxiety about interviewing. I am so excited to be connected with her and excited to start my internship", "Interview Questions": "Tell me a little bit about you"}, {"date": "12 Jul 2021", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Assuaged Foundation in Mar 2021", "Interview Descriptions": "I met up with the CFO of Assuaged to discuss the opportunity at Assuaged, what the role entails, and to see if I was a good fit for the team.", "Interview Questions": "What do I hope to get out of an internship at Assuaged? \n"}, {"date": "18 Mar 2021", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. I interviewed at Assuaged Foundation (Rockford, IL) in Mar 2021", "Interview Descriptions": "Interviewed with Cynthia, CFO and founder. It Went very well. I was offered the internship, I am very excited to begin with such a progressive company, there is so much to learn!!", "Interview Questions": "Tell me a bit about yourself "}, {"date": "23 Feb 2021", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Assuaged Foundation (New York, NY)", "Interview Descriptions": "The interviewer who I spoke to, was very nice. She explained to me about the company and how we will work together.  I am very excited to work with them.", "Interview Questions": "The interview asked to \"tell me about yourself\" "}], [{"date": "10 Feb 2021", "title": "Research & Public Health Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Assuaged Foundation", "Interview Descriptions": "I was remotely interviewed through natural conversation about the company and myself. My personality, skills and interests were examined by the chief financial officer. My duties and company incentives were explained.", "Interview Questions": "How did you get into start-ups?"}, {"date": "8 Mar 2021", "title": "Content Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Assuaged Foundation (Garden Grove, CA) in Feb 2021", "Interview Descriptions": "Very quick and easy! They don't deny students who are willing to learn and interning for academic credit! Cynthia is wonderful and her story is very inspiring! Can't wait to work with her and everyone on the team!", "Interview Questions": "Tell me about yourself and what you like to do."}, {"date": "22 Mar 2021", "title": "Public Health Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Assuaged Foundation (Green Valley Lake, CA) in Feb 2021", "Interview Descriptions": "This process was quick and inviting! Cynthia and I clicked right away and she was very sweet. I felt very comfortable speaking with her and I'm sure we could have gone on for hours! I feel very thankful to work at a place that genuinely cares about their interns, as not many places do.", "Interview Questions": "\"Tell me about your life experiences in this field\" "}, {"date": "14 Mar 2021", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Assuaged Foundation in Feb 2021", "Interview Descriptions": "My interviewer was extremely friendly and made me feel at ease. I think that she provided me with a thorough description of the company and the software that the interns will use. She also gave me room to ask my own \r\nquestions at the end.", "Interview Questions": "Tell me a little bit about yourself?\r\n\r\nDo you have any questions?"}, {"date": "19 Feb 2021", "title": "Graphic Designer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Assuaged Foundation (Silver Spring, MD) in Feb 2021", "Interview Descriptions": "After greeting each other, the interviewer asked  me some questions related to the internship and  my personal life.  The interviewer then  explained what they did and what they had to offer for interns like me. I am very grateful to have had this opportunity .", "Interview Questions": "What were my goals for the internship?"}, {"date": "23 Mar 2021", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Assuaged Foundation (New York, NY) in Feb 2021", "Interview Descriptions": "My interview with Assuaged was unlike a lot of interviews I have done in the past for similar positions. Questions were aimed more toward who I am as a person and not so much just a recitation of my resume.", "Interview Questions": "What brought you into the Public Health field?"}, {"date": "9 Mar 2021", "title": "Student Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Assuaged Foundation (Los Angeles, CA) in Feb 2021", "Interview Descriptions": "The interview was very informative and concise with the expectations of the position. The interviewer was very sweet and made me feel very connected to the company.  I highly recommend people applying for Assuaged.", "Interview Questions": "Why are you interested in working for Assuaged?\nWhat are you involved with currently?"}, {"date": "26 Jan 2021", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Assuaged Foundation", "Interview Descriptions": "After filling out and submitting the needed forms and resume for the initial application process I was contacted back for a virtual interview. The interview process flowed very seamlessly and my interviewer was vibrant and made me feel as comfortable as possible, and had answered any follow up questions I had very clearly. By the end of the interview I was even more excited and proud to join the team and company.", "Interview Questions": "What initially drew me and interested me to Assuaged and the company as a whole"}, {"date": "24 Jan 2021", "title": "Educational Research Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Assuaged Foundation", "Interview Descriptions": "Looked for an opportunity that was mutually beneficial and went the extra mile by getting to know me as a  person.  I was able to get a good grasp on what the company does and their mission statement.", "Interview Questions": "What could the company provide me."}, {"date": "6 Jan 2021", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Assuaged Foundation (Los Angeles, CA)", "Interview Descriptions": "The interviewer was really welcoming and went straight to the introduction of the basics. It was very informative of the org and their connections that they have. The interviewer asked for my opinion of what I think Assuaged was about and what I want to gain out of this experience.", "Interview Questions": "Q: What do you think we are about?"}], [{"date": "4 Jan 2021", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Assuaged Foundation", "Interview Descriptions": "The interview process was relatively straightforward since the application for the role was very detailed and asked a lot of different in-depth questions. I was pleased the the process of getting into contact with the organization was easy and quick from the time I submitted my application.", "Interview Questions": "I was just asked about my background and anything interesting about me that I wanted the organization to know. Since the application was really detailed and through, it gave us more time to talk about other things which was nice. "}, {"date": "27 Jan 2021", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Assuaged Foundation (Boston, MA) in Jan 2021", "Interview Descriptions": "I applied for the internship online and the job description was written in a  friendly tone. I was interviewed by Cynthia. She made me very comfortable and made sure I know about my role in Assuaged. \n\nIt was a 30 minutes interview  and  the conversation was energetic & she also clarified the doubts I had.", "Interview Questions": "What made you apply for the internship at Assuaged?"}, {"date": "21 Jan 2021", "title": "HR Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Assuaged Foundation (Allentown, PA) in Jan 2021", "Interview Descriptions": "It was smooth and engaging. The CFO who spoke with me over Google Meet was very warm and lively. She made me feel very comfortable. I got the impression that it would be a great place to work.", "Interview Questions": "Tell me about yourself and why you applied to Assuaged"}, {"date": "4 Feb 2021", "title": "Data Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Assuaged Foundation (Los Angeles, CA) in Jan 2021", "Interview Descriptions": "The interview was normal. We had some technically issues on both sides, so i had to reschedule twice. The interview was normal were I talked about myself, why I wanted to work there. Cynthia, the interview and owner, was very kind  in describing the company's goals, products, sponsors and methods of business", "Interview Questions": "1. Tell us about yourself.\n2. What do you hope to gain from this internship?"}, {"date": "13 Jan 2021", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Assuaged Foundation (New York, NY) in Jan 2021", "Interview Descriptions": "The interview process was really amazing. I was able to learn more about the company and it's process. It was short, precise and straight to the point. I particularly liked talking to my interviewer because she was genuinely interested in me and my goals.", "Interview Questions": "I was asked to talk about myself."}, {"date": "29 Jan 2021", "title": "Research and PH Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Assuaged Foundation in Jan 2021", "Interview Descriptions": "The interview process with Assuaged went smoothly. It was professional and organized. I felt very welcomed into the company. My interview with one of the founders of the company was wonderful!", "Interview Questions": "Why are you interested in working for Assuaged?"}, {"date": "5 Feb 2021", "title": "Public Health Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Assuaged Foundation in Jan 2021", "Interview Descriptions": "I had to fill out two questionnaires about myself, why I wanted to join Assuaged, and my work ethic. I also had a one on one online interview that ended with talking to me about the final steps to becoming onboarded.", "Interview Questions": "Have you had experience interning in public health before?"}, {"date": "23 Feb 2021", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Assuaged Foundation (Huntsville, TX) in Jan 2021", "Interview Descriptions": "This is a remote internship so all of the correspondence was done online or by phone. The majority of the process was completed through email but there was one phone interview.", "Interview Questions": "If we asked you to complete an arduous task you thought impossible at first, how would you go about it?"}, {"date": "29 Apr 2021", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. I interviewed at Assuaged Foundation (Newport Beach, CA) in Jan 2021", "Interview Descriptions": "Meeting was Cynthia  Murphy was inspiring. She has built an amazing company with a vision of changing people's lives by eating healthy and making healthy choices.  She was so easy to talk to and knowledgeable in running her company, marketing and reaching a larger audience. I was fired-up to start working for her company immediately after the interview", "Interview Questions": "My experiences in school at Purdue and what I could bring to the organization.  What type of importance I place on healthy eating/lifestyle."}, {"date": "22 Jan 2021", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Assuaged Foundation (Savannah, GA) in Jan 2021", "Interview Descriptions": "This interview process was on of the easiest processes I have gone through. She (Cynthia Murphy) was so friendly and thorough and made sure I was comfortable. All the questions she asked felt like she was actually getting to know me and my all my skills and not just skills that applied to the internship.", "Interview Questions": "How will your knowledge and skills be a good contribution to the company?"}], [{"date": "10 Dec 2020", "title": "Finance and Entrepreneurship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Assuaged Foundation", "Interview Descriptions": "Great interview! Provided many valuable details about the company and its mission, as well as the expectations of the internship. Professional, cordial, and inspirational interviewer.  Love what this company is doing for communities all round the world!", "Interview Questions": "If you could change one thing about your personality at the snap of your fingers what would it be and why?"}, {"date": "22 Dec 2020", "title": "Editing & Film Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Assuaged Foundation in Dec 2020", "Interview Descriptions": "The interview process was very informative and exciting. Cynthia Murphy interviewed me, and she was an astounding individual. She was passionate about Assuaged mission, which put me at ease. Her personality allowed for us both to connect. I look forward to working with her and the team.", "Interview Questions": "What are your thoughts (on what was presented to me)?\r\ntell me about yourself."}, {"date": "3 Jan 2021", "title": "Research and PH Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Assuaged Foundation (Los Angeles, CA) in Dec 2020", "Interview Descriptions": "The process was a little troublesome at first, it took about three attempts to finally get an interview. There were some technical difficulties that led to having the interview pushed back twice. On the day of the interview though, I felt like the process was quite seamless and there was a lot of information given to me. It made me excited for the position.", "Interview Questions": "What am I most excited about this internship?"}, {"date": "4 Jan 2021", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Assuaged Foundation in Dec 2020", "Interview Descriptions": "The Assuaged team contacted me to set up an online meeting. The interview was a brief meeting learning about the company and asking any questions I may have had. Cynthia and her team were very welcoming and helpful!", "Interview Questions": "What technical skills do you have or are familiar with?"}, {"date": "25 Jan 2021", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Assuaged Foundation in Dec 2020", "Interview Descriptions": "There was a preliminary online application we needed to fill out which took approx. 1 hour. After a couple of days got an email about scheduling an interview. Interview was very relaxed and educational. After the interview I had to provide a past employer or educators email to get my identity verified.", "Interview Questions": "What drew you to Assuaged?"}, {"date": "4 Dec 2020", "title": "Research and PH Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Assuaged Foundation (Brea, CA) in Dec 2020", "Interview Descriptions": "The interview process was not nerve raking at all, I felt very comfortable and was greeting with nothing but smiles and enthusiasm. I was very happy with how the interview went about.", "Interview Questions": "How did our company stand out to you?"}, {"date": "20 Dec 2020", "title": "Project Managementfor Public Health Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Assuaged Foundation (Duluth, MN) in Dec 2020", "Interview Descriptions": "The interview went very smoothly. I felt comfortable and my interviewer was very kind. I had no problem asking any questions. I got an overview of what to expect and how things are done in Assuaged.", "Interview Questions": "Why do you want to work for this organization?"}, {"date": "26 Dec 2020", "title": "Public Health Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Assuaged Foundation (Louisville, OH) in Dec 2020", "Interview Descriptions": "It went great!  It was professional and relaxing.  Assuaged has a great work ethic and helps people all around the world strive to become better people.  I would recommend this company to my friends and family!", "Interview Questions": "What do you plan on doing after you graduate?"}, {"date": "8 Jan 2021", "title": "Student Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Assuaged Foundation (San Jose, CA) in Dec 2020", "Interview Descriptions": "The process was simple, fast, and easy. The interviewer walks you through on how to use the platforms and introduces how the position works. The interviewer was also really nice and explained how the community is.", "Interview Questions": "Why did you want to join Assuaged?"}, {"date": "4 Jan 2021", "title": "Internship Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Assuaged Foundation (Fayetteville, GA) in Dec 2020", "Interview Descriptions": "After a brief bout with technical difficulties, met with Cynthia over Google Meet, we discussed our various accomplishments and objectives for the future.  She let me know she would be looking forward to working with me and gave me everything I needed to get started.", "Interview Questions": "How do you feel about alternative diets?"}], [{"date": "12 Jan 2021", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Assuaged Foundation in Dec 2020", "Interview Descriptions": "The interviewer was extremely friendly and started off by asking a few questions about myself. They then described to me of the company atmosphere and what would be expected of me if I were to be extended an offer.", "Interview Questions": "They were interested in myself as an individual to see if I was the right fit for the company"}, {"date": "6 Jan 2021", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Assuaged Foundation (San Jose, CA) in Dec 2020", "Interview Descriptions": "Make an appointment.  Tune in.  Chat away! Very easy to talk to Cynthia.  She wants to help you grow within the company. There are many different avenues; you just need to choose one!", "Interview Questions": "What are you interested in within the company?"}, {"date": "12 Jan 2021", "title": "Video Editor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Assuaged Foundation (San Jose, CA) in Dec 2020", "Interview Descriptions": "Extremely friendly and loving vibes all around. I was initially and naturally a little nervous for the interview, but after we got to talking it was a breeze. The interview process was very chill and we only spoke for about 15 minutes.", "Interview Questions": "Q: Tell me a little bit about yourself."}, {"date": "22 Nov 2020", "title": "Social Media Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Assuaged Foundation", "Interview Descriptions": "15-minute video meeting talking about the company, what they do, and why they do it. then talking about me and why I wanted to be part of their company\n\nPros: Cynthia Murphy, Team members, and other employee benefits\n\nCons: don't have any", "Interview Questions": "Why do you want to work for this company?"}, {"date": "10 Dec 2020", "title": "Public Health Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Assuaged Foundation in Nov 2020", "Interview Descriptions": "The interview process was fun and casual. After filling out the application I spoke with Cynthia and she made me feel welcomed and like part of the family. After the interview, I felt confident in my abilities to complete the internship and what I would be helping with.", "Interview Questions": "They asked what my strengths were and how I would contribute to the company."}, {"date": "4 Dec 2020", "title": "Social Media and Outreach Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Assuaged Foundation (Norfolk, VA) in Nov 2020", "Interview Descriptions": "It was very easy just had to fill out some information about yourself and why would be good for this internship, just like a job.\nDue to covid everything was online so it was more comfortable.", "Interview Questions": "What is a problem and solution related to health and wellness do you think we might consider looking into? \n"}, {"date": "19 Nov 2020", "title": "Research and Health Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Assuaged Foundation (Philadelphia, PA) in Nov 2020", "Interview Descriptions": "The interview was conducted based on an application that is filled out prior, which discusses resume-like information and well as personal information to make sure you're a good fit for the company. The interview was brief, but we went over why I wanted to intern there and what my responsibilities at the company would be.", "Interview Questions": "Tell me more about you and why you want to work here."}, {"date": "7 Nov 2020", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. I interviewed at Assuaged Foundation in Nov 2020", "Interview Descriptions": "The process was simple, and I felt welcomed and valued from start to finish. My interviewer walked through my application and asked me a few basic questions. She spoke to the company's community initiatives and a few of their more prominent sponsors/backers.", "Interview Questions": "Why do you want an internship with us?"}, {"date": "21 Nov 2020", "title": "Public Health Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Assuaged Foundation in Nov 2020", "Interview Descriptions": "After sending in my applications Assuaged reached out soon after to set up an interview. The Interview took place through a google hangout video call. The interview was very comfortable and involved just a few questions.", "Interview Questions": "How did you hear about Assuaged?"}, {"date": "13 Nov 2020", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Assuaged Foundation (Philadelphia, PA) in Nov 2020", "Interview Descriptions": "This interview process was very detailed and informative. I was welcomed warmly and was given a presentation of the company’s mission. I also received information about what my responsibilities as an intern would be.", "Interview Questions": "How are you feeling about this company and interning here? "}], [{"date": "21 Jan 2021", "title": "Project Management Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Assuaged Foundation (Boston, MA) in Nov 2020", "Interview Descriptions": "The interview has continued about forty minutes and I was asked about software development experience and related skills. Besides, the interviewer has introduced daily tasks in Assuaged carefully. The conversation was kind and went smoothly.", "Interview Questions": " What skills you can bring to this intern?"}, {"date": "23 Nov 2020", "title": "Finance Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Assuaged Foundation in Nov 2020", "Interview Descriptions": "The interview was easy and very motivated. I learned many things about how the internship will goes. She was very kind and very approachable. Looking forward to many ideas, skills and knowledge to gain here.", "Interview Questions": "Tell me about your self"}, {"date": "18 Nov 2020", "title": "Research and Health Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Assuaged Foundation in Oct 2020", "Interview Descriptions": "I had my interview with Cynthia.  She went over the background and the goals of the company. She discussed the opportunities available and she was very open to addressing all my concerns and answering all my questions.", "Interview Questions": "I was asked about what I'm looking to accomplish and what my goals are while working with the team at Assuaged. "}, {"date": "18 Nov 2020", "title": "Data Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Assuaged Foundation (Los Angeles, CA) in Oct 2020", "Interview Descriptions": "It was a very friendly yet professional interview. Mrs. Murphy, the interviewer is a wonderful person and is truly an inspiration. Overall it was a very good interview and it felt like talking to a friend.", "Interview Questions": "Why do you want to work here as an intern?\nWhat previous experience do you have?\n\n"}, {"date": "3 Dec 2020", "title": "Public Health Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Assuaged Foundation (San Diego, CA) in Oct 2020", "Interview Descriptions": "The interview went really well. It was a great conversation and I loved getting to know more information about the company. You can tell that they truly care about their employees.", "Interview Questions": "What topics interest you? What are your goals? How did you hear about us?"}, {"date": "14 Jan 2021", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Assuaged Foundation in Oct 2020", "Interview Descriptions": "The internship process was flowy and comfortable. I was interviewed by Cynthia Murphy over Zoom.  I felt comfortable and confident expressing myself without feeling judged or limited! This was hands down the best interview I have ever participated in. I connected with Cynthia on deep, intimate levels!", "Interview Questions": "Why are you interested in interning for Assuaged?"}, {"date": "29 Sept 2020", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Assuaged Foundation", "Interview Descriptions": "Good and simple. Everyone was nice and very easy to talk to. Process was pretty straightforward and happened very quickly. The people are very nice and they care a lot about you which was obvious through the interview.", "Interview Questions": "They asked about yourself and interests "}, {"date": "9 Sept 2020", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Assuaged Foundation", "Interview Descriptions": "The interview process was simple and stress-free. Mrs. Murphey was incredibly welcoming and kind and showed me all the different opportunities I would have. I am excited to join Assuaged as an intern this year!", "Interview Questions": "Why do you want an internship with us?"}, {"date": "21 Sept 2020", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Assuaged Foundation (Los Angeles, CA) in Sept 2020", "Interview Descriptions": "I had a pleasant meeting with the owner of the company. We talked the company's overall mission and how my role fits in. We also talked about what I can expect to learn.", "Interview Questions": "They asked me about my experience"}, {"date": "30 Sept 2020", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Assuaged Foundation in Sept 2020", "Interview Descriptions": "Brief 30 minute talk regarding career goals, past experiences, etc. More of a laid back conversation than an interview and we found things to talk about not related to the job.", "Interview Questions": "Tell me about yourself and your interests"}], [{"date": "16 Sept 2020", "title": "Internn Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Assuaged Foundation in Sept 2020", "Interview Descriptions": "Met up online and discussed the position. Went over company operations, goals, accomplishments, and the possible fit. Talked about the goal of the company as well.  Very friendly staff, definitely a place that made me want to work in that environment.", "Interview Questions": "Why do you think you will fit in here?"}, {"date": "22 Sept 2020", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Assuaged Foundation (Atlanta, GA) in Sept 2020", "Interview Descriptions": "The interview process was very organized and I didn't feel under pressure. She was very down to earth, sweet, and understanding. Their energy is very vibrant and supportive. I have no negative comments whatsoever.", "Interview Questions": "What does this internship mean for you?"}, {"date": "28 Aug 2020", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Assuaged Foundation", "Interview Descriptions": "It was a quick 15-minute call where I shared my interests in working for the company and Ms. Cynthia Murphy explained the opportunities available and ways I could benefit from joining the Assuage family.", "Interview Questions": "What would you like to get out of this internship? "}, {"date": "18 Aug 2020", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Assuaged Foundation (Dublin, OH) in Aug 2020", "Interview Descriptions": "After I applied for the internship position, I got a meeting invitation. The CFO, Cynthia Murphy interviewed me. I felt encouraged as a beginner and I could perceive that it is going to be a great educational and positive environment for me. Cynthia shared all the educational links with me. I loved the transparency and respect. I look forward to a beautiful journey with the team.", "Interview Questions": "About my interests and anything I need to know from their end..."}, {"date": "16 Aug 2020", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Assuaged Foundation in Aug 2020", "Interview Descriptions": "I really enjoyed talking to Cynthia. She made me feel very welcomed and accepted. Talking to her made me super excited to get the opportunity to be apart of the Assuaged family.", "Interview Questions": "Cynthia asked me what me what my expectations of the internship are and what I am hoping to learn from it. "}, {"date": "28 Aug 2020", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Assuaged Foundation (Norman, OK) in Aug 2020", "Interview Descriptions": "The interview process was extremely friendly and conversational. Clear exchange of opportunities and responses to questions. Besides technical difficulties at the beginning of the process, I would say it was the most comfortable/relaxed interview experience I’ve had. Very informational as well.", "Interview Questions": "Are you wanting an internship for academic credit or work experience or both?"}, {"date": "24 Jul 2020", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Assuaged Foundation in Jul 2020", "Interview Descriptions": "I was interviewed by a very lively and energetic person. Cynthia was a true joy to communicate with. The roles and explanation of what the duties would consist of were very helpful for me to understand what exactly I would be working on.", "Interview Questions": "What do you envision seeing yourself doing at Assuaged?"}, {"date": "14 Jul 2020", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Assuaged Foundation in Jul 2020", "Interview Descriptions": "When it comes to initiating the actual interview, there were some technical difficulties but through the will of not giving up, I managed to speak with Mrs. Cynthia about her company and what they stand for and how they are able to help me and vice versa.", "Interview Questions": "If a situation was deemed impossible, would you consider it impossible? "}, {"date": "10 Jul 2020", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Assuaged Foundation in Jul 2020", "Interview Descriptions": "Submitted an application on the website and received an email to set up an interview. Was a quick and easy process, interview took about 30 mins and was really impressed with the opportunities and resources that they offer.", "Interview Questions": "Tell me a little about yourself, your experiences. Why did you choose this company?"}, {"date": "7 Jul 2020", "title": "MBA/MPH Rotational Program Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 days. I interviewed at Assuaged Foundation (Indianapolis, IN) in Jul 2020", "Interview Descriptions": "Following an online application a 1:1 interview reveiwed the Assuaged wellness platform and my skills which coul be utilized to enhance the company.  Ater a brief overview, the owner had several questions and reciprocated for me to ask for any clarification about the intern rotation for my MPH program.  We looked at several software examples together which the platform utilizes.", "Interview Questions": "How did I find out about Assuaged? "}], [{"date": "2 Aug 2020", "title": "Business Administration Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Assuaged Foundation in Jul 2020", "Interview Descriptions": "For this interview I applied online. The application form asked questions about our interests and passions towards healthy living. Within two day’s I heard back from the company and had an interview.", "Interview Questions": "Tell me a little about yourself. What interested you about the company?"}, {"date": "5 Jul 2021", "title": "Public Health Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Assuaged Foundation (Los Angeles, CA) in May 2020", "Interview Descriptions": "The interview was informal and enjoyable. Cynthia is personable easy to talk to. She was interested in my story and eager to share hers. She was excited that we share the same interests and passions.", "Interview Questions": "Why do you want to intern for Assuaged?"}, {"date": "27 Mar 2021", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Assuaged Foundation in Mar 2020", "Interview Descriptions": "I was interviewed by one of the owners of the company, Cynthia Murphy. She was super sweet and kind! She listened to my qualifications and explained to me what the internship would entail. After our conservation, she told me she'd be happy to have me on. Overall, an easy and great experience!", "Interview Questions": "Why did you choose this company to apply for an internship?"}]]