[[{"date": "28 Apr 2023", "title": "Fundraiser Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Greenpeace (Bengaluru) in Feb 2023", "Interview Descriptions": "It's very simple first you have to introduce yourself and you family background and then tell more about urself and why you are interested on this jobs and you must be very confident", "Interview Questions": "N/A"}, {"date": "23 Aug 2022", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Greenpeace", "Interview Descriptions": "It was conducted online and the interviewer was very friendly and welcoming. General questions on current issues were asked. Overall, It was a good experience of interview and working with them too.", "Interview Questions": "Why do I want to join Greenpeace?"}, {"date": "25 Apr 2021", "title": "Software Engineer Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Greenpeace (Pune) in Mar 2020", "Interview Descriptions": "Medium Level ,HR is very humble ,he give me tea and water when i reached the company\r\nwriting a job description, posting a job, scheduling interviews, conducting preliminary interviews, conducting in-person interviews, following up with candidates and making a hire", "Interview Questions": "OOPS concept,inheritance details,Java Framework\r\n1.How you decide between Abstract class/Interface?\r\n2.Why we even need Interfaces?"}, {"date": "26 Jan 2020", "title": "Fundraiser Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Greenpeace", "Interview Descriptions": "Applied online, got a screening call after which I was called down for an in-person interview which went rather smoothly given the nature of the job. It was conducted by a third party who were operating under the aegis of Greenpeace International.", "Interview Questions": "Q. Do you have any experience in fundraising?"}, {"date": "19 Mar 2022", "title": "Content Writer Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Greenpeace (New Delhi) in Oct 2018", "Interview Descriptions": "I volunteered for Greenpeace in college and tried for an internship. The interview process was very pleasant. For people who truly care about the environment, climate change and sustainability Greenpeace is a wonderful place to volunteer and work.", "Interview Questions": "How did you find out about this opening ?"}, {"date": "14 Mar 2018", "title": "Human Resources Recruiter Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Greenpeace (Pune)", "Interview Descriptions": "As per position of HR recruiter their  JD was nothing  realted to it. It was field sales job like going to every college campus and doing recuritment. No use of job portals or no office work only visiting colleges which was not made clear before calling for face to face interview . First 10 mins of interview were spent by City head on telling how she became City head and how much talented and deserving she is.", "Interview Questions": "what do you know about environment"}, {"date": "24 Jul 2017", "title": "Fund Raiser Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at Greenpeace", "Interview Descriptions": "Its easy to get hired, all you must have is confidence and presence of mind.\r\nSelection process has multiple rounds of Group discussion.\r\nApply only if you have no other choice or willing to face different situations on road i.e in public.", "Interview Questions": "Easy"}, {"date": "7 Aug 2017", "title": "Outreach Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at Greenpeace (Bengaluru) in Jul 2017", "Interview Descriptions": "2 rounds on the phone once with the recruiter and once with the HR Head.\r\nThen a Face to face interview with the Territory Manager.\r\nPost that a Skype call with the Functional Head.\r\nFinally a written assessment to test if you are apt for the role.", "Interview Questions": "Why are you interested in a job change and why Greenpeace?"}, {"date": "24 Dec 2017", "title": "Internship Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Greenpeace (North East) in Nov 2016", "Interview Descriptions": "2 Skype interviews: one initial round and a follow-up second round a few days later with the specific department. Both lasted around 30 minutes. I received an offer within a week of the second interview, but only had a 2 day period to make my decision as to whether or not to accept.", "Interview Questions": "What drew you to apply to this department?"}, {"date": "27 Jan 2016", "title": "Telemarketing Manager - Retention and Acquisition Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 1 day. I interviewed at Greenpeace (Bengaluru) in Jan 2016", "Interview Descriptions": "2  Rounds\r\n\r\nAll the time the interviewer kept talking about Greenpeace rather than conducting the interview, this went on for 1 hour. Post the interview or rather one sided discussion i did not hear from them.\r\n\r\nNot sure what the interview was about", "Interview Questions": "N/A"}], [{"date": "13 Jun 2019", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through other source. The process took 3 days. I interviewed at Greenpeace (New Delhi) in Jun 2015", "Interview Descriptions": "Telephonic interview followed by one in person- One on one meeting in the office environment. It was relaxed and seemingly casual but the questions asked were thorough and difficult. Once the hour passed I was given a good breakdown of the work culture and expectations and my own questions were answered patiently and were encouraged.", "Interview Questions": "What will be your contribution to the organisation?"}, {"date": "6 Jan 2015", "title": "Fundraiser Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Greenpeace in Sept 2014", "Interview Descriptions": "My interview was at Pune office. There were 2 interviews, one was a preliminary one. The next one was was taken by a senior professional. If all goes well through both the interviews, you are on your way to becoming a fundraiser. After that, you will undergo training of 3 days. Then they will keep u on observation period of a week during which you have to observe how they work. You may then start your job as soon as the next week starts. No-stress & fun-filled work. U will find reat people to work with. Salary is : 10 k+ incentives + daily fuel allowance of 100Rs. I dont' think that there can be any better job for a graduate than this. :)", "Interview Questions": "Why do want to get into NGO sice you have done engineering as graduation ?"}, {"date": "15 Aug 2014", "title": "Fundraiser Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Greenpeace", "Interview Descriptions": "Interview had two rounds. First was telephonic  and if selected the second round was on Skype.. There were some very normal question like abt the environment and yourself. The interviewer was looking for the influencing power actually.", "Interview Questions": "They just check how influencial and good orator you are."}, {"date": "10 Jul 2014", "title": "Specialist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Greenpeace (Bengaluru)", "Interview Descriptions": "Applied through website and it took few weeks-interviewed GP India.\r\nfew levels of hiring interviews including one telephonic round. one HR round, one  operations round, one functional head round, one zonal head round . all personal interviews at bangalore office. interviews were all on own personal experience and would be easy if u have got considerable knowledge in the processes and the organisation.", "Interview Questions": "general qns about organization,operation and the field i applied to"}, {"date": "20 Dec 2015", "title": "Daily Dial Recruter Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Greenpeace (Mumbai) in Apr 2013", "Interview Descriptions": "Interview was easy. Were asked normal HR questions for the interview. Also were asked about some  of my personal ideas about environmental issues. Also testing my knowledge about the company.", "Interview Questions": "Why do you want to join greenpeace India"}, {"date": "7 Jul 2014", "title": "Graphic Designer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Greenpeace (New Delhi) in Mar 2013", "Interview Descriptions": "You have to apply through a portal called Jobvite. If your application is shortlisted, you will get a call from either the HR/the concerned department. There is one round of phone interview and then you are called down for a F2F interview with the concerned department. If you meet the criteria they are looking for, then you will be selected and they will make you an offer. If you do not get selected, they are quite prompt in letting you know.", "Interview Questions": "What social causes do you feel passionate about and why?"}, {"date": "6 Oct 2012", "title": "Communications Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Greenpeace (Bengaluru)", "Interview Descriptions": "Starts with an intention to be rigorous but opposite pulls threaten the rigour - urgent need to hire versus need to comply with process. High attrition in Communications leaves line managers and HR little bandwidth to fully leverage the rigour desired. Hasty hires create ripple effects across the organization and often make whole departments shaky.", "Interview Questions": "How can Greenpeace build up a mass movement"}, {"date": "19 Mar 2015", "title": "Climate and Energy Cmapaigner Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Greenpeace (Bengaluru) in Mar 2012", "Interview Descriptions": "Pretty straight forward, 2 telephonic rounds and one face to face and one round with the HR.well bassic backround check followed with the expectations and a ppt presentation on a topic which is given to u couple of days back", "Interview Questions": "What do think about the current energy trend in the country and how does the govt sees it"}, {"date": "30 Jun 2012", "title": "Recriuter Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 days. I interviewed at Greenpeace (Chennai) in Jul 2009", "Interview Descriptions": "it was very easy to work at Greenpeace and even more easy to get into it it ll test Ur knowledge about environment and current knowledge of today's society  and it ll test Ur communication aswell", "Interview Questions": "what do you know about environment ?"}]]