[[{"date": "1 Nov 2022", "title": "Adjunct Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at ECPI University", "Interview Descriptions": "Short just had me teach a pretend class for about 5 minutes. They stopped me after a few minutes and gave me feed back on how I did. They also asked me how I would respond to a classroom disruption.", "Interview Questions": "Have you taught before and if so for how long?"}, {"date": "17 Oct 2022", "title": "Admissions Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at ECPI University", "Interview Descriptions": "Initial interview was with one Talent Director asking very standard question then the next interview was panel style with four directors asking mostly situational questions regarding the position. They also ask about expectations as a worker.", "Interview Questions": "Strengths and weaknesses pertaining to specific job?"}, {"date": "5 Oct 2022", "title": "Admissions Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at ECPI University", "Interview Descriptions": "Meet with initial interviewer. It seems to have gone well, as she introduced me to the University’s president. After that discussion, they indicated they would get back to me. I assumed I would be offered a job, but they never got back to me, not even to advise that they fill the position with someone else, and thank me for my time.", "Interview Questions": "My background in admisssions and sales."}, {"date": "6 Sept 2022", "title": "Admissions Representative Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 days. I interviewed at ECPI University", "Interview Descriptions": "So far they seem really nice. I'm looking forward to hearing back from this company. This seems really to much just to find out the reviews of others.  I hope no one else has to go through this.", "Interview Questions": "This is just too much"}, {"date": "16 Aug 2022", "title": "Adjunct Online Instructor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at ECPI University", "Interview Descriptions": "Initial interview followed by two weeks training which they called it the second phase of the interview. They put a lot of pressure on you during the training. They require of you to post at least 14 times in every discussion plus all the quizzes then you be completely ghosted. \nThis is a nickel and dime college. If you are asking people to put the time and effort for two weeks to attend a training that they will never benefit from, then it is fair to pay them for their time. Otherwise make your decision quicker with shorter interview.  These are people who have PhD and master's degrees with years of experience. Wasting their time like that is not acceptable.", "Interview Questions": "Why do you want to teach?"}, {"date": "6 Jul 2022", "title": "Admissions Advisor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at ECPI University", "Interview Descriptions": "Met with SR level person for about an hour, he pawned me off to an admissions advisor to show me around, she seemed uninterested, walked me to the door and I never heard anything from them. Horrible consumer interaction", "Interview Questions": "why do you want this job"}, {"date": "15 Jul 2022", "title": "Program Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at ECPI University in Jun 2022", "Interview Descriptions": "The interview process included a teaching demonstration and three other interviews with different persons at the university.  Poor communication process between the steps of the interview process and no communication within a month of completing the last part of the interview.", "Interview Questions": "One of the questions was if I understood the position was an on-campus position and not a remote one."}, {"date": "18 May 2022", "title": "Sociology Instructor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at ECPI University", "Interview Descriptions": "Initial interview was great. Then directed to unpaid training for 2 weeks after initially getting \"hired.\" Sailed through modules with flying colors. Afterward I was completely ghosted.  No pay and no contact.", "Interview Questions": "Initial interviewer was very positive. "}, {"date": "4 Apr 2022", "title": "Admission Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at ECPI University in Mar 2022", "Interview Descriptions": "The initial interview consists of basic interview questions. Interview held over the phone. It lasted around 30 minutes which is pretty short compared to most other job interviews. The next interview consists of a zoom interview with the hiring manager.", "Interview Questions": "Q: Tell me about a time where you had to handle a difficult situation"}, {"date": "12 Aug 2022", "title": "Business Development Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at ECPI University (Richmond, VA) in Jan 2022", "Interview Descriptions": "Good interview process, just wasn't the right fit. This was a new position that still needed defining. I'm sure they will find the right person. Wishing them the best of luck in their search!", "Interview Questions": " Asked about my background in manufacturing "}], [{"date": "29 Oct 2021", "title": "Director of Academics Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at ECPI University", "Interview Descriptions": "Clear process. Those involved were very friendly and accommodating. Required academic presentation followed by question and answer with existing faculty members. Faculty prepared with questions, and responsive to my questions.", "Interview Questions": "Do you think leaders are born or made"}, {"date": "20 Jun 2021", "title": "Admissions Advisor Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at ECPI University", "Interview Descriptions": "There was an initial phone conversation and then I was invited in for an interview. During the call I specifically asked if this was an advisor position because I was interested in helping students create a pathway to their degree. I was initially told that that would be part of the job. During the interview it became apparent that this is essentially a cold call/high volume position to increase enrollment. Very much like telemarketing. No advising involved.", "Interview Questions": "They asked if I was comfortable on the phone. "}, {"date": "25 Mar 2022", "title": "Admissions Representative Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at ECPI University (Virginia Beach, VA) in Jun 2021", "Interview Descriptions": "The interview was conducted in a polite and professional manner. They asked the right questions and I did not get the feeling that my time was being wasted. I would definitely recommend researching the position and the company ahead of time.", "Interview Questions": "Where do you see yourself in 5 years "}, {"date": "7 May 2021", "title": "Sociology Instructor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at ECPI University", "Interview Descriptions": "Two video interviews and unpaid training which took place over several weeks. I passed all modules on time and received excellent scores. When the training was over, ECPI went silent. I never heard from them again.  Waste of time, and very strange. I wondered if it was because I wear a headscarf?", "Interview Questions": "I aced two video interviews and was put through weeks of online training with no pay. I excelled in all modules and went above and beyond what was tasked to me. In the end, ECPI completely ghosted me with no explanations. "}, {"date": "13 Oct 2021", "title": "Admissions Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at ECPI University in May 2021", "Interview Descriptions": "The interview was via zoom for a remote position. There were 4 members of upper management in attendance. All were very friendly. Questions asked were standard to gain insight on my experience in the field. Adequately answered my questions as well.", "Interview Questions": "They asked about my experience working in admissions, my enrollment stats, my experience with industry standard software. The usual."}, {"date": "1 Mar 2021", "title": "Career Services Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at ECPI University", "Interview Descriptions": "Very efficient and responsive. The entire process moved quickly and everyone I interviewed with always got back to me quickly and answered all of my questions. I believe the entire process only took a week or less.", "Interview Questions": "Can you me about yourself?"}, {"date": "21 Feb 2021", "title": "Adjunct Faculty Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at ECPI University (Charleston, SC) in Oct 2020", "Interview Descriptions": "Zoom interview was very professional. I was told I would be contacted the next week but never heard anything more from the process.  \r\nMy Full Application was also Submitted without any response.", "Interview Questions": "Questions regarding my experience teaching"}, {"date": "4 Apr 2022", "title": "Admissions Advisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at ECPI University (Greensboro, NC) in Oct 2020", "Interview Descriptions": "It was very simple, phone interview then in person interview. However I was shocked and appalled at some of the personal questions that were asked in the in person interview such as marital status and if i had any children. I felt that that was inappropriate and affected their decision.", "Interview Questions": "Are you married?\r\nDo you have children?\r\nWhat ages? "}, {"date": "13 Apr 2021", "title": "Administrative Assistant Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at ECPI University (San Antonio, TX) in Aug 2020", "Interview Descriptions": "I was interviewed through zoom at first and was asked to come in to do a tour. The tour was 2 hours followed by an unexpected 2nd interview.  I was told an offer would be made once my background check came in. It took over 3 weeks to hear back and we played phone tag over a week. In the end I felt the process was very delayed.", "Interview Questions": "Would you feel comfortable working for a for-profit college?"}, {"date": "10 Jul 2020", "title": "Admissions Counselor Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at ECPI University", "Interview Descriptions": "Panel based, was a bit friendly. I'm just looking to see which company offers the best for work/life balance.  It wasn't a good fit professionally.  Overall it would be a good place to start for someone that has limited admissions experience.", "Interview Questions": "How do you deal with difficult circumstances?"}], [{"date": "24 Jan 2020", "title": "Student Success Advisor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at ECPI University", "Interview Descriptions": "they make you do a logic test first. then if you score high they bring you in to meet the President and your new manager. Interview process was not that long.", "Interview Questions": "what is your experience in education"}, {"date": "11 Sept 2019", "title": "Admissions Advisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 3 months. I interviewed at ECPI University", "Interview Descriptions": "Companies should be up front about the hiring process verses tell you that you’d be a good fit and they will get back to you only to never hear another word. It’s very unprofessional to leave applicants in limbo and reflects poorly on the organization.", "Interview Questions": "Are you available evenings and weekends?"}, {"date": "30 Mar 2019", "title": "Financial Advisor Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at ECPI University (Richmond, VA) in Mar 2019", "Interview Descriptions": "Very good interview.  They helped me feel relaxed and at ease.  The interview happened at the agreed upon time and was a reasonable length.  Was quick to be contacted", "Interview Questions": "Tell me about yourself "}, {"date": "19 Apr 2019", "title": "Admissions Advisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. The process took 2 weeks. I interviewed at ECPI University (Greensboro, NC) in Jan 2019", "Interview Descriptions": "Interviewed by DOA and President, and thought it went well. Then I interviewed with the Assistant Director, and it was the absolute worst interview I’ve ever experienced. My background was with a well know competitor but she had no knowledge of the school. It was obvious that she was looking at my resume for the first time because she grilled me about the dates of my employment (same school for 5+ years). She kept asking, “what concerns do you have”. I got the impression I was wasting her time.  This interview occurred several months ago and I’ve yet to hear a response.", "Interview Questions": "Why do you want to work here?"}, {"date": "24 Oct 2018", "title": "Adjunct Faculty Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at ECPI University (Virginia Beach, VA)", "Interview Descriptions": "First “interview” was a 5-minute phone call with a recruiter who basically verified my resume information was current. The second “interview” was a 15-minute video call on Zoom with the same recruiter and another faculty member where they briefly discussed my expectations of the position and what ECPI’s expectations are. The final “interview” was being enrolled in an on-line course, using ECPI’s online learning management system. This was a two-week course where prospective faculty were taught/learned about ECPI’s expectation of instructors. It is designed to be just like one of their online classes, and you are expected to participate in discussions, watch and response to videos, attend live video classes, and complete two quizzes and a test. \r\n\r\nThe interview process is simple, but there are a lot of what I would consider unnecessary steps. The first and second “interviews” do not really do anything to advance the process. The final “interview” using the online classroom was a unique approach, but I felt it was poorly administered. While it does show how well a candidate handles the time commitment and management of online instruction, it is a poor indication of how a candidate will perform in an instructor role in an online class. The decision to invite a candidate to teach a class is based solely on how well they perform in this online class. It was frustrating to spend a significant chunk of time in the online class for 2 weeks learning about ECPI policy, procedure, and expectations to not be offered a class/hired and receive zero feedback.", "Interview Questions": "No questions, just two informal discussions and an online class."}, {"date": "22 Aug 2018", "title": "Federal Work Study Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at ECPI University", "Interview Descriptions": "Group Interview with Admissions Director and Student Services.  The Director came in and asked a few questions and gave us an overview of the position.  Interview lasted about 30 min.  An hour after the interview I received a call from the director offering me the position.", "Interview Questions": "What receptionist skills do you have?\r\nHow do you handle stress?\r\nWhat is your school schedule?"}, {"date": "14 Aug 2018", "title": "Admissions Advisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at ECPI University (Virginia Beach, VA) in Jun 2018", "Interview Descriptions": "I applied online and less than a week later I was contacted for a brief phone interview and scheduled a face to face interview for the next week. I interviewed with 2 people, the director of admissions and another advisor. The first interview was very serious and straightforward. The second was more laid back and less organized. She made eye contact twice the entire time and focused more on her computer than my answers to her questions. It seemed like she was double booked but she was nice enough. After the second interview, I was advised that both people would discuss their notes and if I was a good fit, would be contacted at a later time to schedule a second face to face interview. After the second interview, I was told I would receive a phone call follow up stating they would either offer the position/state going with another candidate. \r\nThe second interview never took place and I never received any follow up calls.", "Interview Questions": "What are your roles at your current position?"}, {"date": "14 May 2018", "title": "Financial Assistance Advisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at ECPI University (Greensboro, NC) in Apr 2018", "Interview Descriptions": "There was a brief one-on-one interview and then a pattern-recognition aptitude test. I was told I would hear back after the test was scored, but I never heard anything else despite sending follow-up emails. The job is still listed as available.", "Interview Questions": "What is your previous financial aid experience?"}, {"date": "8 Aug 2017", "title": "Adjunct Faculty Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at ECPI University", "Interview Descriptions": "Submitted my application and received a response and interview request the following day. I had two online interviews, a few days apart. I was told I'd definitely get a class and had to go through a two week faculty training course. The course was quite a bit of work (more difficult than other ones I've done). I did very well in the course (score was almost 100%, had great feedback). I followed up after the course and was told I would not be getting a course. This was a complete waste of my time. The interviews were easy and fairly standard.", "Interview Questions": "How can you reach students with non-traditional backgrounds?"}, {"date": "21 Sept 2017", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. I interviewed at ECPI University (Roanoke, VA) in Sept 2017", "Interview Descriptions": "ECPI reached out to me. Right now I am in the process of waiting on a start date. Thank goodness I didn't submit a resignation at my present job. I didn't know once offered a position it would take so long to hear back.", "Interview Questions": "N/A"}], [{"date": "21 Jun 2017", "title": "Admissions Advisor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at ECPI University", "Interview Descriptions": "I was interviewed for 3 days. I came in for a group interview, was asked to take a 30 minute assessment (they don't warn you about that) then met with the Director for about an hour. Asked me to come back the next day, but complete a personality quiz at home. Met with the team and interviewed with two of the members as well to get their stamp of approval. Then I had to interview with the VP. It's a super lengthy process, but at least you get a good idea about the position by the end of it.", "Interview Questions": "How do you feel about explaining to students who don't qualify for the program they want? How would you convince them what was the better path for them?"}, {"date": "1 Aug 2017", "title": "Financial Assistant Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at ECPI University (Charleston, SC) in Mar 2017", "Interview Descriptions": "I actually interviewed for an Assistant Position originally which, i didn't get at first but then was later called back to be offered the position which i declined being that I was already working someplace else, I then was offered the position as the Front desk Personnel but i declined because I have worked the front office and its not for me. Finally i was asked to apply for this position, being that I had already interviewed, I just had to pass the background check. In that interview, I interviewed with 3 people, they all asked TELL ME  A TIME type questions, but what i did like was that they gave me the PROS and the CONS about the positions, they didn't sugar coat anything so I knew what type of environment i was walking into.", "Interview Questions": "They asked questions about me and what i was looking for"}, {"date": "3 Oct 2017", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at ECPI University in Feb 2017", "Interview Descriptions": "the interview process was extremely unorganized and you are left to find upper management by yourself. the questions asked had nothing to do with the job description.  and there really isn't a point of posting a job description, for this company, because they will have do work assignments that do not relate to your field.", "Interview Questions": "Can you type fast?"}, {"date": "17 Feb 2017", "title": "Financial Assistance Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at ECPI University (Newport News, VA) in Feb 2017", "Interview Descriptions": "The interview process involves several people from your immediate supervisor all the way up to the campus president or company vice president. I was interviewed by three different people who asked me similar questions.", "Interview Questions": "Why do you think you would be an asset to this company?"}, {"date": "13 Dec 2016", "title": "Electronics Engineering Technology Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at ECPI University (Raleigh, NC) in Dec 2016", "Interview Descriptions": "Prepare and deliver a short lecture. I was able to choose any topic relating to engineering. The committee evaluated my performance based on teaching format. After the lecture, I was giving a campus tour, and meet with the program director to view the curriculum. The next week I was invited to interview with the university president.", "Interview Questions": "Q: Why do you want to be an instructor"}, {"date": "1 Nov 2016", "title": "Nurse Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at ECPI University (New York, NY)", "Interview Descriptions": "Applied online and was contacted by phone to setup interview. It was a group interview with staff. I had a choice to view the school campus. All staff was very friendly.", "Interview Questions": "How do you handle conflict?"}, {"date": "21 Aug 2016", "title": "Student Finance Advisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at ECPI University (Raleigh, NC)", "Interview Descriptions": "First I applied for the position online. Then I received a call to go in person and complete what essentially amounted to an IQ test.  Finally, I was asked to interview.  It seemed from the beginning of this application process that they weren't really interested in me, or in hiring anyone for that matter, and that they were just data mining information to sell to LexisNexis or Acxiom.  I never received a call or email back to let me know that I was rejected.  Felt like a waste of time really.", "Interview Questions": "Tell me about yourself."}, {"date": "31 Jul 2016", "title": "Adjunct Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at ECPI University", "Interview Descriptions": "first round: technical interview to review your experience\r\nresume related questions and your masters course related questions.\r\ntell me about yourself\r\nwhy did you take this course in your masters\r\nwhat did you like about this course etc.\r\nsecond round: teaching demo.", "Interview Questions": "tell me about yourself\r\nwhy did you take this course in your masters\r\nwhat did you like about this course etc."}, {"date": "28 Aug 2016", "title": "Financial Aid Advisor Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at ECPI University in Jul 2016", "Interview Descriptions": "The interview was long bit not very difficult. I was asked a lot to describe a time where something happened example: describe a time when you disagreed with your manager what did you do? The people who interviewed me were very nice and welcoming. It did take thema a long time to make a decision though. Eventually I was offered a different job, one that better matched my schedule and i love it!", "Interview Questions": "How much do you want to get paid?"}], [{"date": "10 Jun 2016", "title": "Student Services Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at ECPI University", "Interview Descriptions": "applied online and received in person interview. afterward received no call back for several months. Then called back months later for me to take the logic test. still no call back.", "Interview Questions": "basic questions"}, {"date": "22 Jun 2018", "title": "Financial Aid Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at ECPI University (Virginia Beach, VA) in May 2016", "Interview Descriptions": "3 sets of interviews. Started with the Senior Advisor, then the Director and QC and then the Campus President. Everyone was pleasant; however, the Campus President seemed to ask some pretty backward questions that you don't expect.", "Interview Questions": "They asked me if I was proficient in Excel"}, {"date": "14 May 2016", "title": "Student Services Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "The process took 7 weeks. I interviewed at ECPI University (Denver, CO) in Apr 2016", "Interview Descriptions": "I went through two rounds of interviews, phone and in-person and then completed two assessments. I have no idea what comes after as no one has contacted me since or answers any emails or phone calls.", "Interview Questions": "N/A"}, {"date": "2 Jan 2016", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at ECPI University", "Interview Descriptions": "You receive an email for a phone interview and you have to choose a day and time listed. Phone interview lasts about 25-30 minutes and you're asked about past work experience, about you, and why you're good for the job. If they like you they ask you to come in to take a written test - it's a logic/aptitude test. Then you're interviewed by your future supervisor, campus director, and director of admissions and given a tour of the campus. You'll get a call in a few days to offer you the position.", "Interview Questions": "Why are you a good fit for this job? "}, {"date": "6 Nov 2015", "title": "Admissions Advisor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at ECPI University", "Interview Descriptions": "Was called for a short phone interview, at the end of the phone interview i was told to look out for an email that consisted of an assessment, after completing the assessment 3-4 days later i was contacted for a face to face interview.", "Interview Questions": "Phone interview was very general, face to face interview has not happened as of yet"}, {"date": "12 Dec 2015", "title": "Director of Career Services Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 1+ week. I interviewed at ECPI University (Summerville, SC) in Nov 2015", "Interview Descriptions": "Contacted by recruiter, interviewed with current director via phone, had an in person interview with president and then an interview via phone with university director of career services. He set me up with an online personality assessment test. I apparently failed it because I have never heard from anyone since. I feel they lack the professional curtesy to let me know one way or the other which is disappointing.", "Interview Questions": "Biggest weakness"}, {"date": "31 Dec 2015", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at ECPI University (Virginia Beach, VA) in Sept 2015", "Interview Descriptions": "The interview process was pretty basic. I was ask the general run of the mill questions you typically get from most interviews. There was nothing that caught me off guard or made me think of my feet really. The process was timely and everyone I came into contact with was friendly.", "Interview Questions": "N/A"}, {"date": "8 Aug 2015", "title": "Librarian Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at ECPI University (Newport News, VA)", "Interview Descriptions": "Panel of three to four, they grill you for at least 30 minutes. No one writes down answers so it is just question after question after question. You leave feeling like they don't actually want to fill the position. A lot of scenario questions are asked and a lot of form questions you can find in any google search online.", "Interview Questions": "What is your management style?"}, {"date": "14 May 2016", "title": "Financial Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at ECPI University (Roanoke, VA) in Aug 2015", "Interview Descriptions": "I started the process with the campus president and then I had a panel interview with about 8 people. The one on one interview was basic questions about my abilities to perform the job. The panel interview was about my ability to handle stressful situations and where I wanted to go in the company", "Interview Questions": "What are your strengths/ weaknesses? Explain a situation in which you were faced with negative confrontation?"}, {"date": "5 Jul 2015", "title": "Receptionist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at ECPI University (Newport News, VA) in Jul 2015", "Interview Descriptions": "I applied for the position online and received an email a few days later to set up a phone interview. I had the phone interview a few hours later. The interview on the telephone was easy just going over my job experience. Received a call the next day to schedule an interview face-to-face. This interview was more difficult lasted an hour. Received a tour of the office and took a test. Was told that day I was hired and discussed salary and start dates.", "Interview Questions": "What would your supervisor say is your weakness?"}], [{"date": "29 Apr 2019", "title": "Admissions Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at ECPI University (Virginia Beach, VA) in Jul 2015", "Interview Descriptions": "Very easy , I applied and and a week later I  was asked to take a personality test through email. The personality test determines if your personality matches to the position. I received a call thereafter.", "Interview Questions": "Why am I interested in the position. "}, {"date": "8 Jun 2015", "title": "Career Services Advisor Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at ECPI University", "Interview Descriptions": "Multiple interviews in person and over the phone. Had to do an assessment first in order to be considered for the position.  After that, I was asked to perform a phone interview and then a face to face interview with members of staff.", "Interview Questions": "Have you worked in a position before where you have had to meet specific standards and deadlines?"}, {"date": "10 Jun 2016", "title": "Admissions Advisor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at ECPI University (Manassas, VA) in Jun 2015", "Interview Descriptions": "Hiring process took about a month, but was fairly easy. If you show persistence, they will hire you. Mike did my interview, he's very gruff and makes the interview very awkward. Then you have an interview with the campus president, and then one with Chad, the University DOA. My last interview was over the phone. They'll also make you take a personality test online.", "Interview Questions": "How much are you worth?"}, {"date": "27 May 2015", "title": "Admissions Advisor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at ECPI University (Manassas, VA) in May 2015", "Interview Descriptions": "First interview was with the Director of Admissions.  It took approximately 20 minutes and I was told I would be contacted for a personality assessment test.  I took the test online and was called back for a second interview with the next manager up the chain.  After the second interview (again, 20 minutes), I was told I would be contacted for a third interview.  This has yet to occur.\r\n\r\nThe job is essentially a sales position.  Advisors are expected to call a certain number of leads/prospective students every day, schedule informational meetings/testing with the students, and convert a certain number of those scheduled meetings into enrollment.  All financial assistance and academic advising (course choosing, etc) would be done by other departments/individuals.", "Interview Questions": "Why should ECPI hire you?\r\nWhy do you want to work for ECPI?"}, {"date": "27 Oct 2015", "title": "Lab Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 5 days. I interviewed at ECPI University (Greensboro, NC) in Jan 2015", "Interview Descriptions": "Current Professor limited the job to students excelling and therefore interview was informal and casual.  There were two positions made available for the two students the professor want to have the position made for.  Necessity for continued long term assistance allowed the position to be made available through the school.", "Interview Questions": "Would you set up a new lab as a Lab Assistant."}, {"date": "7 Nov 2014", "title": "RN Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 3 weeks. I interviewed at ECPI University (Virginia Beach, VA)", "Interview Descriptions": "The interview is positive. Typically potential employees will have and interview with the director of nursing (DON), assistant director of nursing (ADON) and the program president.  They will be shown around the nursing building and may be briefly introduced to faculty member if they come in contact with any during the tour.  The prospective employee may be asked to present a brief  presentation to show teaching ability and be evaluated by current faculty members who can be present .", "Interview Questions": "Please tell me about your weaknesses ."}, {"date": "15 Dec 2015", "title": "Admissions Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at ECPI University (Columbia, SC) in Oct 2014", "Interview Descriptions": "It was very simple. I had to interview three times though. They first call you in for an interview with DOA and senior team lead, then if you pass you interview with President, then Vice President. Then you take a test, and then you get an hire.", "Interview Questions": "Basic interview questions: Tell me about your background."}, {"date": "16 Jan 2016", "title": "Career Services Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at ECPI University (Virginia Beach, VA) in Oct 2014", "Interview Descriptions": "It was really relaxed.  Professional but not intimidating.  The interviewers (as there were several) did not try to trick me with weirdly worded questions.  The were very up front but always made me feel relaxed.  I have interviewed with them for several positions and never had a bad interview.", "Interview Questions": "How would you help someone find a career with a specific issue (I.e. bad credit, criminal background, etc)"}, {"date": "11 Sept 2014", "title": "Receptionist Interview", "results": "Declined Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at ECPI University", "Interview Descriptions": "August 2014- Whole process took about a week and a half. I applied online and was called to go into a group interview the next day. At the group interview we discussed the company and the job responsibilities. After the initial group discussion, we meet individually. Then we were asked to take a test. After that I was called back for one more interview.", "Interview Questions": "What books have you read recently, and why did you enjoy them. (Really awesome question!)"}, {"date": "15 Dec 2016", "title": "Surg Tech Director Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at ECPI University (Virginia Beach, VA) in Sept 2014", "Interview Descriptions": "Interview was easy. I pretty much knew I had the job before going... these schools need someone with specific certifications and degrees. They pretty much just gave me a tour of the facility and made an offer.", "Interview Questions": "How many students I currently had in my program? And how many cohorts we had to start every year?"}], [{"date": "17 Aug 2014", "title": "Adjunct Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at ECPI University", "Interview Descriptions": "Pleasant. There were no hard questions as long as you  are honest. The most difficult part was the teaching demo in front of the other faculty. This is not difficult, but it is a little awkward since these are all of your future colleagues and not students.", "Interview Questions": "N/A"}, {"date": "25 Jul 2014", "title": "Corporate Role Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 4 days. I interviewed at ECPI University", "Interview Descriptions": "No follow up call or communication after interview. I did not feel company was professional and would not recommend. It appears management has been there for some time with little respect for employees.", "Interview Questions": "Why do you want to work for us?"}, {"date": "18 Jul 2014", "title": "Receptionist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at ECPI University", "Interview Descriptions": "I completed employment application on the website.  I was then contacted for a phone interview.  After the phone interview, I was offered a formal interview.  After the interview I scheduled testing for a later date.  I came in and completed the testing.  I was then called 2 days later for a second interview.  When I came in for a second interview, we discussed pay and benefit questions.  I was then told I would be contacted with any additional questions.   It was a very positive experience for me.  I was overwhelmed with how friendly everyone at this business was.", "Interview Questions": "What is your least favorite clerical task?"}, {"date": "24 Sept 2014", "title": "Marketing Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at ECPI University in Apr 2014", "Interview Descriptions": "The process is sometimes LONG and drawn out.  Once you respond to an ad you will get a screening call form the hiring manager.  If you pass that step on to your first interview.  If you pass that step you may be directed to \"apply online\".  I waited 3 months before a 2nd interview and subsequent job offer.", "Interview Questions": "What about you other people would say \"He needs to work on\""}, {"date": "10 Mar 2014", "title": "Account Manager Interview", "results": "No Offer", "experience": "N/A", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at ECPI University (Newport News, VA) in Feb 2014", "Interview Descriptions": "Was called for a telephone interview and then invited in to speak with the recruiter. Spent 2.5 hours speaking to recruiter and director - never called or sent anything afterwards - can only assume no selection.", "Interview Questions": "Standard questions, nothing unusual."}, {"date": "9 Oct 2013", "title": "ECPI Job Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at ECPI University (Virginia Beach, VA) in Aug 2013", "Interview Descriptions": "Applied online and the process took about a month.  I was contacted by phone to come in for an assessment test.  A week later I was contacted by phone for a mini-interview on the telephone and then invited to come in for a face to face interview.  The interview lasted about 30 minutes.  Another week later I was offered the position, but given no details about the offer over the phone.  Had to come in another week later to get the actual offer.", "Interview Questions": "Typical interview questions."}, {"date": "18 Jun 2015", "title": "Admissions Advisor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at ECPI University (Greensboro, NC) in Jun 2013", "Interview Descriptions": "Standard interview questions.  Nothing exciting.  I asked a lot more and was lied to repeatedly.  Like, lied to.  I was led to believe that this place operated in a way that was ethical.  I was told I would recieve overtime which I never did (my time card was frequently adjusted after the fact to remove time I had worked).  It was a horrible experience.", "Interview Questions": "What are your strengths?"}, {"date": "8 Apr 2013", "title": "Admissions Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at ECPI University", "Interview Descriptions": "Applied online, received call the next day.  Interview scheduled for two days later.  Follow up phone interview with regional director.  Offered position after background check was completed.", "Interview Questions": "Standard interview questions.  Nothing out of the ordinary."}, {"date": "23 Jan 2017", "title": "Instructor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at ECPI University in Apr 2013", "Interview Descriptions": "Demonstration along with some questions that included if you were willing to go back to school. A panel of at least three people and you conducted a 10-15 minute presentation.", "Interview Questions": "Do you mind working on weekends and when students are not there?"}, {"date": "23 Nov 2015", "title": "Admissions Representative Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at ECPI University (Virginia Beach, VA) in Mar 2013", "Interview Descriptions": "Long process plus an unnecessary testing procedure to basically check your IQ. This job is so easy and boring the qualifications are an overkill needed for this mediocre position. Interview was casual and not very professionally done. Felt like I was being analyzed more for my personality than I was for my professional skills. You are not made to feel as if you're being interviewed for your professional skills than you are at winning a personality contest.", "Interview Questions": "What was your most proudest achievement? How much experience do you have in marketing?"}], [{"date": "2 Aug 2017", "title": "Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at ECPI University (Raleigh, NC) in Jan 2013", "Interview Descriptions": "I met with the program manager for a pretty easy interview, then I did a \"test teach\" where I basically taught a class for about 20-30 minutes. There were no students, just other instructors and administration. Honestly, it is so difficult to get reliable instructors, they will take pretty much anyone here, that's why the interview process is so easy.", "Interview Questions": "N/A"}, {"date": "12 May 2016", "title": "Nurse Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 3 days. I interviewed at ECPI University (Newport News, VA) in Aug 2012", "Interview Descriptions": "I filled in an application, met with the acting DON and ADON a few days later.  Was hired after the actual interview, started working a few days later.  It was a positive experience as the ADON at the time was very personable and gracious.", "Interview Questions": "Appropriate for the position i.e. - how to manage a classroom, teaching style, ability, etc."}, {"date": "19 Nov 2013", "title": "Nurse Faculty Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at ECPI University (Greensboro, NC) in May 2012", "Interview Descriptions": "Interview process consisted of a team interview and a practice teach.", "Interview Questions": "What can you bring to the organization?"}, {"date": "4 Jan 2016", "title": "Admissions Advisor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at ECPI University (Greenville, SC) in Mar 2012", "Interview Descriptions": "You will meet with the DOA (Director of Admissions).  You will have to take a test on writing,reading, math, and logic.  It is explained to you that it is not part of the hiring process, but it is.  You will have at least 3-5 interviews before knowing if you are hired.  Ask about the schedule and especially working weekends and nights.  Ask about blackout months when you are not allowed to schedule vacations and take days off.  You must be a good fit to fit in this unusual work culture.  This is a sales position with no bonuses .  Raises are based on enrollment, but its against the law to pay employees according to number of enrollments if using Financial Aid, so the reviews are based on adapting to their culture, utilizing their resources, and how well you are enrolling students.", "Interview Questions": "What experience do you have that can contribute to this position ?"}, {"date": "16 Dec 2015", "title": "Library Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at ECPI University (Greensboro, NC) in Jun 2011", "Interview Descriptions": "They saved my resume after hiring someone else more qualified.  Then they called me in to interview for an administrative assistant position.  The interviewer gave me a rundown about the position and liked that I was looking for flexible hours and the willingness to assist in all departments as needed.", "Interview Questions": "N/A"}, {"date": "26 Aug 2011", "title": "Career Services Advisor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at ECPI University (Newport News, VA) in May 2011", "Interview Descriptions": "The interview process with ECPI was very quick with me interviewing for over two hours at the campus, and them following up with last minute interviews that I could not make being that I was out of state. Finally, I never heard from them again although they promised a third interview.", "Interview Questions": "Where do you see yourself in five years? "}, {"date": "18 Aug 2015", "title": "Admissions Advisor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at ECPI University (Newport News, VA) in Feb 2011", "Interview Descriptions": "Marathon Interview, Had to meet with President  MCI Regional President and COO and sat all day interviewing each and all of them required me to go for lunch and come back to finish.", "Interview Questions": "Don&#039;t remember much of the questions, was a basic conversation where they try to figure out how good you were."}, {"date": "28 Aug 2014", "title": "Admissions Advisor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at ECPI University in Jul 2010", "Interview Descriptions": "The interview process for this entry level, lowest job on campus is ridiculous. You are subjected to an interview with the local Director of Admissions, then move on to the campus President. If you make it passed them then you have to interview with the Regional Director of Admissions for the entire University and then be passed on to the Vice President of the University. We are talking about a month long process, at least, to get a job that now starts out at about $14 per hour. A little much considering the instructors only have 2 interviews and so do Directors.", "Interview Questions": "They typically ask you to sell them something to see if you are going to do it the way they want you to sell to the students. This is definitely a sales job and you will feel like a phone solicitor after your 1st week in the position."}, {"date": "29 Jul 2014", "title": "Admissions Advisor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at ECPI University in May 2010", "Interview Descriptions": "Get to sit down with the Director and/or Assistant Director of Admissions.   The interview will consist of questions regarding your background, how you will be a good match for the company, and what skills you have that make you better than other candidates.  Pretty much the typical questions we are all use to.  A Bachelors degree is required for this position.  They feel that if you are educated you will understand the value of an education.", "Interview Questions": "I think this will depend on each person. "}, {"date": "15 Mar 2013", "title": "Electronics Instructor Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 2 weeks. I interviewed at ECPI University (Raleigh, NC) in Jul 2009", "Interview Descriptions": "I had one technical interview where I had to deliver an electricity/electronics lesson of my choice in front of the director, department head, and HR representative.  During the interview, I was asked some easy technical questions. Because I had prepared well for my presentation, the director liked my presentation, told me that I did well, and offered me the job.", "Interview Questions": "The director asked me a very basic question about the uses of basic circuit components: resistor, capacitor, and inductor. He asked me this simple question because he didn't have a technical background!"}], [{"date": "10 Oct 2009", "title": "Adjunct Faculty Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at ECPI University in Mar 2009", "Interview Descriptions": "Initial communication was from Dean of School over the phone.  We reviewed my qualifications.  I was asked to elaborate on my experience (what was taught, how it was taught, how many hours a week).  At the conclusion of the phone interview, I was asked to come in for a face to face interview.  The face to face interview was a rehash of the phone interview.  In fact, the phrase used by the interviewer was 'I want to make sure I like you'.  At the conclusion of the face to face interview, I was asked to come back again to give a presentation.  During the 3rd interview, I met with a group of people, the CEO, and such.  I received a verbal offer at the end of the 3rd interview.  Specifics were emailed to me within the week.  It was a lengthy process and I'm not sure why the process took so long, even now.", "Interview Questions": "This isn't a 'normal' school.  How well will you deal with people coming from significantly different backgrounds than your own?"}, {"date": "22 Jun 2009", "title": "Admissions Representative Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 1 day. I interviewed at ECPI University (Greensboro, NC) in Jun 2008", "Interview Descriptions": "The interview starts with  a phone interview with one of the Higher ups  from corporate ( questions like what would you do if you had two students come in at once for an interview , etc.), than if that goes well you will meet with the Director of Admissions with more questions and a low ball estimated salary figure as to what one will make. Than sometimes you will meet with the Campus President and lastly the  head Owner of the that campus with your salary offer and more questions. The process usually is longer but sometimes it is quick.", "Interview Questions": "There was  really no difficult questions."}]]