[[{"date": "14 May 2023", "title": "Legal Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at CAIR (Anaheim, CA)", "Interview Descriptions": "The interview process is tough. You must go in knowing that this is the kind of work and advocacy you want to commit yourself to doing! Look into the company mission and values, and even most recent cases to prepare!", "Interview Questions": "Q: Do you have prior experience advocating on behalf of this specific community? If not, then why?"}, {"date": "25 Mar 2023", "title": "Research and Advocacy Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at CAIR", "Interview Descriptions": "3 rounds of interviews. First went well, interviewers made me feel comfortable. Second round went well but felt pointless. Third round was with president and one other board member. President asked most of the questions and it was an awful interview. No interest in knowing what my qualifications are.", "Interview Questions": "How would you start building relationships with the partners we work with and when would you start?"}, {"date": "7 Mar 2023", "title": "Program Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at CAIR", "Interview Descriptions": "I have applied to various positions with CAIR LA, that I was definitely qualified for, and it's the biggest waste of time. They pick people they know so applying is worthless unless you know someone there. Don't expect a 'sorry we didn't pick you email' until 6 months later. The one time I was offered an interview they told me I was the best candidate they had but I would still need to do 2 more interviews and then I never heard from them again. Their emails from HR are emails you cannot respond to and I had left messages at the office when it past 2 weeks since I heard. This was months ago and I never heard back.", "Interview Questions": "They ask the basics, why you want to work there, what do you hope to get out of it, your career path, etc."}, {"date": "19 Feb 2023", "title": "Operations Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at CAIR in Sept 2022", "Interview Descriptions": "The interview was about 30 minutes over the phone. Mainly asked about the experience and how it ties to the responsibilities of the job being applied to. The interviewer was very nice and easy to talk to.", "Interview Questions": "Why are you interested in working with CAIR?"}, {"date": "16 Apr 2021", "title": "Attorney Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at CAIR", "Interview Descriptions": "very easy, great interviewer, nice, he took his time to get to know me, and it was very nice to meet someone i never met before. I want to know more about the company but so far i like it.", "Interview Questions": "how is your day going"}, {"date": "17 Dec 2020", "title": "Management Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at CAIR", "Interview Descriptions": "It is an unnecessarily long process that CAIR follows. Not structured or job focused. There was no time line for decision making. Technical /Department leads should develop a better format for interviewing candidates.", "Interview Questions": "Tell us about your experience "}, {"date": "26 Jul 2019", "title": "Attorney Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at CAIR (Santa Clara, CA)", "Interview Descriptions": "I had 3 interviews for a legal position in the Santa Clara office. It took over a month to schedule the the 3rd interview with the ED, who ate her lunch during our meeting. It took  several weeks to receive an offer. The offer was about $60,000 per year .... I have approximately 10 years of experience as a practicing attorney, which they knew. Plus, their office is in one of the most expensive areas in the Bay Area. The ad did not indicate their salary and it was supposedly \"based on experience.\" Even for a nonprofit, the salary was low for seasoned professional. It was a waste of time.", "Interview Questions": "Asked about my experience mainly."}, {"date": "28 Sept 2017", "title": "Program Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at CAIR in Sept 2017", "Interview Descriptions": "I completed the pre-screening interview process, where I spoke with the person in charge of hiring for about half an hour. She asked me a number of questions including what I knew about CAIR, what attracted me to the job, what self-care methods I use/how I handle stress, and what is the most important thing about planning an event.", "Interview Questions": "What do you know about CAIR?"}, {"date": "30 Nov 2017", "title": "Civil Rights Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at CAIR (Washington, DC) in Aug 2017", "Interview Descriptions": "In-person interview with lots of questions and answers about past experience, ability to do key tasks, etc. There were questions about skill sets, working in civil rights.  It took a few days after I applied to get an email back.", "Interview Questions": "Why do you want to work here"}, {"date": "2 Jan 2018", "title": "Outreach Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at CAIR (Chicago, IL) in May 2017", "Interview Descriptions": "Applied online and was invited to come in for a formal interview. The interviewer was late and lasted longer than an hour, longer than I thought was normal. After the interview,  I was told to expect a decision within 1-2 weeks. Accepted.", "Interview Questions": "What are your strengths and areas for improvement? "}], [{"date": "25 Feb 2019", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at CAIR (Seattle, WA) in Jan 2017", "Interview Descriptions": "Simple and Casual, one on one, and lasted about a half an hour. I also got a tour of the occur and met a couple of other employees during the interview. everyone was very approachable and laid back, but clearly passionate about their jobs and CAIR-WA's objectives.", "Interview Questions": "someone has been contacted by the FBI - how do you assist them?"}, {"date": "16 Jul 2015", "title": "Programs Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at CAIR (Anaheim, CA)", "Interview Descriptions": "Some time after submitting my application, I received an email asking to come for an interview. \r\nI met with three people, they were all really nice.  They were professional but chill.  \r\nYou should dress formal/semi-formal.  \r\nThey may ask you if you know of CAIR's current or past programs.  Make sure to be aware of what they do in general, as well as specific things they've done (i.e. programs, media work, cases, etc.).  whichever pertains to the position that you're applied for.", "Interview Questions": "What are your strengths and weaknesses?\r\nWhy CAIR?\r\nWhat are you aspirations/goals?\r\nWhy do you want to intern for that particular position?"}, {"date": "14 Apr 2014", "title": "Civil Rights Intern Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. The process took 4 weeks. I interviewed at CAIR", "Interview Descriptions": "I called the office before applying just to ask about the internship in general. This turned out to be helpful because the Director said she would keep an eye out for my application. After sending in my application, I heard back pretty quickly, probably within a week, and was asked to complete a phone interview. The phone interview was very relaxed and conversational and lasted about an hour. The majority of the questions were tailored to my resume and experiences. Additionally, my interviewer spent a significant amount of time letting me know about the attorneys that worked at the office and their backgrounds.", "Interview Questions": "I was asked about the Hamdi/ Hamdan cases. I was honest and said that I didn't have a complete grasp on the cases. This didn't seem to be an issue as she agreed that they were difficult cases. "}, {"date": "27 Sept 2016", "title": "Intern Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at CAIR in Jan 2012", "Interview Descriptions": "It was an in person interview and they were all very nice. They are very personable and I would have loved to intern for them. I think they were filled by the time I applied but all in all it was a great experience. I would do it again if I could.", "Interview Questions": "Why do you Intern to work for CAIR?\r\n\r\nWhat relations do you with, if any, with the American-Muslim community?"}]]