[[{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Amazing Company", "rating": "5.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "6 Mar 2023", "job_title": "IT Service Desk Specialist II in Houston, TX", "duration": "N/A", "pros": "Menninger is an amazing company with amazing people. The level of comfort professionalism and culture are unlike any company I've worked at before.", "cons": "Not really any cons other than usual workplaces that you may have to contend with a couple of personality conflicts, but that the same at any job."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Not Worth It", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "29 Mar 2023", "job_title": "Project Manager in Houston, TX", "duration": "N/A", "pros": "The only pro is free parking", "cons": "-Racist (the way they treat their patients and staff), like working in right America -Heavy on favoritism - the staff care more about being liked by their peers than actual work -Incompetent leaders -No room for growth -Mask DEI work through 'company initiatives'"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Political", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "28 Apr 2023", "job_title": "Registered Nurse, BSN in Houston, TX", "duration": "N/A", "pros": "Cant think of any if I’m being honest", "cons": "Terrible leadership, only care about money, political management, favoritism"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Excellent co-workers", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "24 Aug 2022", "job_title": "Anonymous Employee in Houston, TX", "duration": "N/A", "pros": "Fair salaries, great working conditions and a family feel of coworkers.", "cons": "It can be challenging to get staff onboard with your ideas and to adopt new ideas."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": 5, "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Great Entry Level Experience", "rating": "4.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "3 Feb 2022", "job_title": "Mental Health Technician in Houston, TX", "duration": "N/A", "pros": "Good Benefits and free meals", "cons": "Very liberal staff to work with"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": 3, "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Do your research", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "25 Sept 2021", "job_title": "Administrative in Houston, TX", "duration": "N/A", "pros": "Free parking\r\nGrounds are well maintained", "cons": "Appears to be constant change in leadership\r\nUpper management is out of touch with non clinical staff\r\nThe whole \"we are Menninger\" is really just words and not something put in to practice."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 0, "Diversity and Inclusion": 3, "Career Opportunities": 3, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "In Transition", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "16 Nov 2021", "job_title": "Staff RN in Houston, TX", "duration": "N/A", "pros": "Getting to help patients recover", "cons": "Short staffing, sparse support from front-line leadership"}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 0, "Diversity and Inclusion": 0, "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Great Stepping Stone for New Graduates", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "5 Aug 2021", "job_title": "Registered Nurse, BSN in Houston, TX", "duration": "N/A", "pros": "A prestigious organization that will awe future employers\nLots of continuing education opportunities\nOpportunities for advancement as NPs, SWs, and Therapists if you build strong relationships with management\nCompetitive benefits", "cons": "Lower wages\nSurrounding hospitals know that the acuity is lower and may question your experience if you apply with them\nEverybody knows everything about everyone\nIt's a struggle between enforcing policies and Menninger promoting a positive customer experience."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Great place to work", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "25 Aug 2021", "job_title": "Psychologist in Houston, TX", "duration": "N/A", "pros": "Excellent and caring hospital that supports its employees.", "cons": "No cons associated with this hospital"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": 4, "Career Opportunities": 0, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Great Place", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "6 Jun 2021", "job_title": "Mental Health Associate in Houston, TX", "duration": "N/A", "pros": "Great coworkers to work with!", "cons": "Difficult being able to take time off."}], [{"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 1, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Menninger", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "8 Mar 2021", "job_title": "Security Officer in Houston, TX", "duration": "N/A", "pros": "Great work environment and sense of purpose.", "cons": "Small very little room for growth."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "job review", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "29 Jan 2021", "job_title": "Rehab Specialist in Houston, TX", "duration": "N/A", "pros": "people coworkers flexibility compensation work life balance", "cons": "not many management food flexibility"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Great Food", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "20 Oct 2020", "job_title": "Purchasing Coordinator in Houston, TX", "duration": "N/A", "pros": "the hours are Great, free food", "cons": "No Room to grow, low pay"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Best place to work!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "7 Jan 2019", "job_title": "Anonymous Employee in Houston, TX", "duration": "N/A", "pros": "I have been working here for more than ten years. There is NOT a single day that I have regretted regarding my decision to work at Menninger. I work with young adults on the Compass Unit. My bosses and co-workers are definitely like family members. We have very strong team work-I have never felt alone. Honestly, I feel this journey at Menninger has not only helped me professionally but also in my personal life-finding my identity and purpose in life.  The love we get from our clients is much more profound than paychecks and benefits. At the same time, I have noticed that one's hard work is always acknowledged by the management-through authentic evaluations and raises. There is a tremendous opportunity for research and continuing education. I cannot ask for more!", "cons": "Seriously, I have no complaints."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great place to work", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "17 Nov 2016", "job_title": "Anonymous Employee in Houston, TX", "duration": "N/A", "pros": "Numerous learning & training opportunities at all levels of the organization \r\n\r\nPositions for a range of educational backgrounds from Bachelor's, Master's to PhD level staff\r\n\r\nExpanding opportunities with a mental health club house, inpatient units, outpatient work, community integration program and new programs coming online in the next few years\r\n\r\nCompetitive salaries and fairly generous benefits \r\n\r\nPromotion opportunities, especially with increased education and certification (I started as a PRN Mental Health Technician working primarily on the weekends, transitioned into a contract clinical position, then into a staff clinical position, and now continue to do some clinical work and am also a mid-level manager at the clinic -- these shifts took place over the course of 7 years)\r\n\r\nOpportunities to earn extra income through the Menninger Outpatient/Extension Clinic for credentialed/licensed staff", "cons": "The work is challenging and it's incumbent on staff to practice self-care to manage the stress that goes along with that"}, {"Recommended": "N/A", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Look elsewhere! Not a healthy place to grow.", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "7 Nov 2017", "job_title": "Rehabilitation Specialist in Houston, TX", "duration": "N/A", "pros": "The experience of helping others is rewarding. There are  some amazing nurses still hanging in there. I think there are a few doctors left who are amazing and caring, though the whole hospital is understaffed and census is lower than ever.", "cons": "Horribly misguided company with tremendous turnover, yet they will not stop harming their staff. Leadership is their weaknesses. Not a place for advancement and is a mentally unhealthy culture. All the talented folks have left. There are better places to work! The entire company including the board of directors needs an overhaul.\n\nThe executive team and how they think about well-being is outdated. Top talent and research experts have left. That should tell you something!! Their CEO recently left as well but the infection is still there. The organization lacks healthy team building. Most of what that they do is superficial and executives seemingly care more about their legacies climbing the ladder than they do the people they serve. Staff is treated poorly and they continue to make it worse by hiring micromanaging, dysfunctional tyrants who manipulate, bully and feed negativity. Beware!"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Consider This About Menninger", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "14 Dec 2017", "job_title": "Administrative Director in Houston, TX", "duration": "N/A", "pros": "Our values, opportunities to excel and make a difference, and job satisfaction", "cons": "Teams are small yet nimble, need for customer service training at all levels"}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Do not work at Pathfinder. Run away..", "rating": "2.0", "reviewer_affiliation": "Former Employee", "job_date": "26 Oct 2016", "job_title": "Resident Adviser in Houston, TX", "duration": "N/A", "pros": "Menninger Clinic is a prestigious place to work at. They have wonderful training and amazing minds working on client progress. The campus is beautiful and well done. The cafeteria food is great as well. I wish I had worked in the hospital since it seems so much more professional and put together. I have complete respect for The Menninger Clinic, however the program I worked at (Pathfinder) does not live up to the reputation I was drawn in with. \r\n\r\nYou get free food sometimes working at Pathfinder and do get to have some fun adventures when there's outings.  There's a lot of funds to do activities with clients and depending on the amount of clients, you can have a good amount of interaction with them and work on fostering good interpersonal skills with them. You also have the chance to explore your own hobbies and passions if there's a way you can use them to connect with a client. \r\nFor example, if you're really into comics and there's a client who really loves comics and you two click on it, management would be okay with you two going out to a comic convention on a weekend and would pay for your ticket as long as it's therapeutic in nature.\r\n\r\nIf you're looking for easy money, a job that doesn't require a lot of thinking, where you spend most of your time driving and texting clients, and doesn't have a lot of paperwork to fill, then this would be good for you. I also enjoyed working with the team of RA's; i made some strong bonds with good employees after all those 14hr shifts. It always killed me to see them just as sad as I was working there and not being able to live up to their full potential. \r\n\r\nOverall the building is nice, the apartments are sometimes nice, depending on the clients living in their and how clean they are, and you don't have to drive your own vehicle. The supplied vehicles aren't too bad, except for a large white van. \r\n\r\nRA position only works 3 days a week, 14 hr shifts.", "cons": "I was lied to in my initial interview about the potential for job growth and my schedule and the actual nature of my job. I was promised many things and ultimately ended up being a driver and baby sitter for clients. And also ran errands, sometimes for clients and sometimes for my boss. \r\nEXTREMELY poor management.\r\nExtremely low morale amongst workers. Management doesn't seem to understand that they are the sole cause of the misery amongst their workers and instead blame the workers as opposed to trying to find the root of the problems (which is themselves). Managers micro-manage and don't seem to understand the nature of the very job role they created; they constantly change rules and procedures because they literally don't know what they actually are. Managers give unsolicited extremely negative career advice and make the workers feel horrible about themselves. \r\n\r\nIf you enjoy having boundaries with clients, throw those out the window because boundaries barely exist here.\r\n\r\nManagers tell employees to not refer to factual instances of sexual harassment as sexual harassment, and then chastise employees for deciding to not engage with clients after said harassment. Management rather insists on employees getting closer to clients after sexual harassment (again, boundaries don't exist here)\r\n\r\nManagers take everything personally, and don't seem to notice when employees actually go above and beyond their job description.\r\n\r\nManagers hire people who are way over qualified for the position and expect them to perform job activities that are not in their job description and get mad at them for not doing the things not listed there. Job description is vague for that reason. \r\n\r\nI've heard clinicians literally refer to clients as dogs. \r\n\r\nThe secretary there is notorious for yelling, having temper tantrums, causing a scene in front of clients, picking fights with employees and being the very definition of passive aggressive. She also likes to make new employees do her job for her (without any previous training or notice) while she can escape the office for a few hours and usually has the support from management when doing this. \r\n\r\nThe ethicality of how expensive the program is for clients (about $20,000 a month)  (vs how little employees get paid) is also extremely questionable. Is it really ethical to recommend a client stay in a program for 6 months or longer when there's far better treatment options out there that are less expensive? \r\n\r\nThis place is a business primarily. There is no question about that. Employees, specifically RA's, are treated as less than humans who are expendable. It's such a shame they've let so much talent go. In the short span I was there, over 8 people from a variety of different positions quit. My boss didn't even look me in the eye for months after I was hired, much less check in with me and see how my new job was going. My other boss didn't even bother to really learn my name until maybe 4 months in. Mind you, it's a small building with about ~15 people there working on a business day. There's no excuse for treating employees as less than human. \r\n\r\nOverall the work place is extremely unprofessional. I think the only reason this program is still running is because it brings in a lot of money for the hospital. \r\n\r\nAlso, the privacy rules for this place are extremely questionable."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 1, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 3, "review_title": "Dead-end job for Degreed employees unless you are a nurse.", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "6 Aug 2009", "job_title": "Degreed Mental Health Associate in Houston, TX", "duration": "N/A", "pros": "Small company.  Casual Fridays.  Motivates you to do whatever you need to get another job.", "cons": "Hard to get a day off.  No advancement unless you are a nurse.  No career ladder.  Not paid for educational accomplishments or for longevity.  NO weekend pay but you are required to work 2 weekends a month.  HUGE turnover."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 0, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Ok place but highly political", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "1 Sept 2014", "job_title": "Manager in Houston, TX", "duration": "N/A", "pros": "New campus, close to home, and basically can do the work you were hired to do.", "cons": "Highly political, a lot of infighting between the executive team. All executive team members look out for their own area of responsibility and are quick to blame other areas for their faults."}], [{"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Misguided company", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "11 Dec 2017", "job_title": "Anonymous Employee in Houston, TX", "duration": "N/A", "pros": "Co-workers are wonderful people to work with.\r\nPay is good for the BS you are forced to put up with.", "cons": "For the past three years this organization continues its spiral downward, once a prestigious and people first organization the company is now undergoing a culture change where the employees are no longer considered a valuable resource.\r\n\r\nExecutive Leadership has completely turned over and as a result, chaos is the standard of the day, with a fly by day management approach to employee issues and policies.\r\n\r\nThe current leadership methodology from the top down is Management takes a pessimistic view of their people and assumes that they are naturally unmotivated and dislike work, which is mostly true because of the afflictions of the executive leadership. Current leadership treats staff poorly and feels that team members need to be micro-managed or punished constantly to make sure that they complete their tasks.\r\n\r\nThe CEO was let go or resigned a few weeks ago which adds to the current day to day chaos of the organization.  The interim CEO “Gaglio” appears to have little or no experience running an organization or managing employees. Turnover is very high because of an unhealthy work environment and there are sudden and unexpected position eliminations amongst support and clinical staff. \r\n\r\nThe employee benefits package has slowly been reduced each year along with higher medical premiums and fewer and fewer company offered benefits.\r\n\r\nThis is a 120-bed facility and within the last three(3) years has been slightly half filled from year to year, the organization appears to be losing revenue so Management’s approach is to treat employees poorly so they will quit or eliminate the positions."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 3, "Senior Management": 5, "review_title": "Best of the Best", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "28 Jul 2017", "job_title": "Anonymous Employee in Houston, TX", "duration": "N/A", "pros": "People are generally friendly and helpful.", "cons": "There is some negativity that is out of control, but it's truly a character flaw of the people who display it, not necessarily attributable to the clinic itself. It only presents behind the backs of those who would do something about it."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Rewarding Job", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "17 Jun 2017", "job_title": "Mental Health Associate in Houston, TX", "duration": "N/A", "pros": "Overall great place to work, friendly co-workers. Good health benefits and PTO. Great work/life balance.  Good entry-level position to get experience in mental health field. Rewarding work.", "cons": "Pay could be higher, better raises for nursing staff. Management should learn to utilize the internal talent of its current employees. Not much opportunity for career advancement for."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "slice of heaven", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "22 Jan 2016", "job_title": "Call Center Operator in Houston, TX", "duration": "N/A", "pros": "It was wonderful working at Menninger. In fact, the best and friendliness environment I've ever worked in. Call center manager was always there to calmly help/guide me. All of the staff is friendly, I never felt divide. Pay and benefits were also great.", "cons": "They moved too far for me to travel to daily."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Great experience, I really enjoy working with our patients", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "28 Nov 2011", "job_title": " in Houston, TX", "duration": "N/A", "pros": "Nice environment, team work, and enjoyable atmosphere.  I really like my boss and his approach.  I like my coworkers. I enjoy working with the patients most of all, because that is what it's all about!", "cons": "It's cold sometimes (literally in my office)."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Patient Centered Care at its Best!", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 8 years", "job_date": "14 Dec 2019", "job_title": "Nurse Manager in Houston, TX", "duration": "N/A", "pros": "Academic setting where evidence-based practice is at the forefront.  Mentoring from experienced nurse leaders.", "cons": "None that I can think of"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "My experience as a whole in the company is OK and I learned a lot.", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "10 Jul 2014", "job_title": "Engineering Tech III in Houston, TX", "duration": "N/A", "pros": "The Company is a stable employer and you can achieve growth on other areas.", "cons": "The only challenges here is the equal opportunity for the employee."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "RN", "rating": "4.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "29 Oct 2017", "job_title": "Staff RN in Houston, TX", "duration": "N/A", "pros": "Salary. Coworkers. Good food if you were there in the day time but expensive", "cons": "Treated like high paid maids and file clerks rather than professional nurses"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Great 1st post College job", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "14 Feb 2016", "job_title": "MHA in Houston, TX", "duration": "N/A", "pros": "They are flexible with your schedule. Work with you and other responsibilities.", "cons": "You really have no room to move up from this position."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Excellent", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "2 Feb 2020", "job_title": "Registered Nurse in Houston, TX", "duration": "N/A", "pros": "Commitment to ongoing education: plenty of learning opportunities", "cons": "I cannot think of any"}], [{"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Mental Health Associate", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 8 years", "job_date": "17 Dec 2015", "job_title": "Mental Health Associate in Marietta, GA", "duration": "N/A", "pros": "Great place to work, diverse, team players", "cons": "Texas very humid and place hot  place to live, transit system is not readily available"}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Review", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "28 Sept 2020", "job_title": "Education and Training Assistant in Houston, TX", "duration": "N/A", "pros": "Clean establishment \r\nNice security guards \r\nreasonable lunch prices on campus", "cons": "Systemic racism \r\nLow salary \r\nNo advacement opportunities"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "Cook1", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "25 Feb 2018", "job_title": "Cook in Houston, TX", "duration": "N/A", "pros": "Very Good workplace environment.\r\nGood salary. Yearly raises", "cons": "Small Hospital. (Though expanding)\r\nNot a lot of room for advancement."}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 1, "Culture & Values": 3, "Diversity and Inclusion": 1, "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "Okay", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "18 Oct 2020", "job_title": "Social Worker in Houston, TX", "duration": "N/A", "pros": "Good networking, access to CEUs", "cons": "Lack of diversity in leadership, low morale"}]]