[[{"date": "12 May 2022", "title": "Basic Grade Medical Scientist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Mater Misericordiae University Hospital (Dublin, Dublin) in Apr 2022", "Interview Descriptions": "Interview was setup with a waiting area and the interview was punctual on the day. Technical knowledge and competency questions were assessed. Excellent structured interview. Was timed to be concise & had time to answer the questions well.", "Interview Questions": "What are the top traits you possess for this position."}, {"date": "23 Feb 2022", "title": "Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Mater Misericordiae University Hospital", "Interview Descriptions": "45 minute call with line manager and HR. Competency’ based questions. Scenarios provided to show how you would prioritise ill patients\r\nIt was over the phone in covid times. They ask you preference for area of work whether its medical or sugrical", "Interview Questions": "Patient with obvious signs of sepsis, blood transfusion allergy and high EWS"}, {"date": "15 Nov 2021", "title": "Oncology Nurse Navigator Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Mater Misericordiae University Hospital (Dublin, Dublin)", "Interview Descriptions": "The interview process is comprehensive. Experience and qualifications of candidates does not matter. The interview procedure has something wrong in selecting individuals. Sometimes  people feel candidates are preselected already.  Some questions are given to the staff and some others do not even know what would be ask. Managers give answers to candidates so there is a huge room for biases.  Candidates need to answer specific examples not just concepts.", "Interview Questions": "What is your idea about the job?"}, {"date": "6 Jan 2021", "title": "Clerical Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Mater Misericordiae University Hospital (Dublin, Dublin)", "Interview Descriptions": "Made feel very comfortable. Interviewers very friendly and reassuring, explained the job description in detail and asked how I would fit each aspect, asked about working under pressure. I applied online and was called for interview a week later", "Interview Questions": "How would you suit this position "}, {"date": "1 Oct 2019", "title": "Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 1 day. I interviewed at Mater Misericordiae University Hospital", "Interview Descriptions": "Interview process was pretty straightforward..submitted cv, had formal interview with HR and other managers..very friendly and made the whole process less daunting. Overall I felt very comfortable and quite supported.", "Interview Questions": "Tell me about your cv, former experience, also gave scenarios applicable to the job I was going for. "}, {"date": "15 Feb 2020", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Mater Misericordiae University Hospital (Dublin, Dublin) in Sept 2018", "Interview Descriptions": "Applied online, got interview invitation after around 3 weeks. The interview panel of 4 people, all very nice and wanted you to do good, interview results only after 3-4 weeks after the interview.", "Interview Questions": "How did you prepare for the interview, what would you do it X situation, give an example when you worked well with a team, Things going bad scenario - what are the steps you would take and why, etc. Nothing surprising"}, {"date": "2 Oct 2019", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 5 months. I interviewed at Mater Misericordiae University Hospital (Dublin, Dublin) in Nov 2017", "Interview Descriptions": "Hiring is long - no funding towards the end of the year. Very few external advertisements. Most positions are usually lined up prior to interview. It's very much who you know not what you know here. Many people are related to one another etc", "Interview Questions": "Communication skills "}, {"date": "30 Apr 2017", "title": "Lab Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Mater Misericordiae University Hospital (Dublin, Dublin) in Mar 2017", "Interview Descriptions": "Interview went quite well. I was asked about my current job and describe what is it that i do. I was also asked how can i implement my current knowledge and skill to a new job. Last but not least i was asked certain skills i have learned during my college years.", "Interview Questions": "How to apply my current experience in my actual job to a new job."}, {"date": "13 Sept 2016", "title": "Staff Nurse Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Mater Misericordiae University Hospital (Dublin, Dublin) in May 2014", "Interview Descriptions": "I was interviewed by 3 People\r\nI found it intense\r\nA lot of Q's were asked quite quickly\r\nI was very nervous\r\nThere were 4 others waiting with me to be interviewed\r\nA very brief introduction was made by the panel and I felt very unsettled and found it hard to concentrate", "Interview Questions": "Policies and Procedures\r\nHIQA Standards"}, {"date": "30 Dec 2015", "title": "Medical SHO Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Mater Misericordiae University Hospital (Dublin, Dublin) in Mar 2011", "Interview Descriptions": "I applied for the job through the royal College of Physicians of Irelands website. I was given an interview time and date within a few weeks of applying. I was interviewed in Beaumont hospital along with other candidates. I was contacted by email with the outcome within a few weeks of applying.", "Interview Questions": "What have you seen working abroad that you think would improve the Irish Health system?"}]]