[[{"date": "10 Sept 2022", "title": "Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Azusa Pacific University", "Interview Descriptions": "There is a preliminary resume and cover letter and letters of references submitted to portal. This is reviewed to my knowledge by HR for basic credentials before moving on to department review. Then interviews (committee) followed by a campus visit.", "Interview Questions": "Please tell me about yourself. \n"}, {"date": "14 Aug 2022", "title": "Certified Athletic Trainer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Azusa Pacific University", "Interview Descriptions": "They had some well rounded interview questions! Two separate interviews and required a cover letter, resume, and testimony.  The application process was pretty simple and the interview was more of a panel technique.", "Interview Questions": "What are my strengths and weakness and how can they help with my weaknesses? "}, {"date": "4 Aug 2022", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Azusa Pacific University", "Interview Descriptions": "Getting a role as a research assistant is more about working hard in your classes and showing your professors that you have a high aptitude for learning. After our Final exam I met with a professor to advise on the next steps within my major and I asked about Research roles in the dept. He offered me one on the spot.", "Interview Questions": "What are you hoping to learn? How would you like to grow in this field? "}, {"date": "25 Feb 2022", "title": "Assistant Director of Admisisons Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Azusa Pacific University", "Interview Descriptions": "Several rounds of interviews, generally similar questions repeated. Final one about faith journey. Average in difficulty. They want to see you engage with their team and show your experience. Be dressed professionally.", "Interview Questions": "Biggest mistake you made on the job and how you recovered.\r\nWhat you look for in a manager"}, {"date": "24 Feb 2022", "title": "Library Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Azusa Pacific University", "Interview Descriptions": "Short interview with questions, then will ask you to complete a test on organizing the books by their system. Then they will assess your answers and if you passed their test.", "Interview Questions": "How capable are you of learning their book organization system"}, {"date": "27 Jan 2022", "title": "MFT Trainee Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Azusa Pacific University", "Interview Descriptions": "once interview is set it is a one time appt. Questions were very open. Interview process is smooth and they let you hear back soon at least within a weeks time.", "Interview Questions": "how much time you can commit on a weekly basis."}, {"date": "9 Nov 2022", "title": "Customer Service/Casher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Azusa Pacific University (Los Angeles, CA) in Jan 2022", "Interview Descriptions": "I applied online. Received an email, had an in person interview and got the job a week later. They didn't ask too many questions, mostly just about experience. I loved my interview, she was kind and comforting and actually listened as I spoke.", "Interview Questions": "Tell us a little about yourself"}, {"date": "29 Mar 2023", "title": "MFT Trainee Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Azusa Pacific University (Azusa, CA) in Jan 2022", "Interview Descriptions": "The interview process was great and easy. I had an amazing time working along side many different professors in such a diverse community. It was a great experience for me.", "Interview Questions": "Tell me about yourself and why you want to be a therapist"}, {"date": "22 Dec 2021", "title": "Marketing and Communication Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Azusa Pacific University in Sept 2021", "Interview Descriptions": "The interview consisted of three phases: initial zoom interview with the hiring manager, second round of interviews with the team, and the third interview with both the hiring manager and the Vice President. \n\nDuring the initial interview, the hiring manager asked me generic questions about my faith, background and experience. He wasn’t very attentive during this interview and his Ring alerts kept going off. He didn’t bother to turn off his alerts, which was disruptive and rude. I was skeptical about working here after this initial interview, but I thought it would get better during the second interview.\n\nThe second interview was with the team in which they asked pre-selected questions. The team seemed like a tense group of individuals and did not mention anything about teamwork. I’m not too sure if it’s because this team is predominantly remote. I still did not have a good feeling about this position, this team, and potentially working at this university.\n\nThe third interview was the hiring manager and VP drilling me on my faith, and going over APU’s belief documents. I knew this wasn’t the place for me when I asked the VP about APU’s future plans, and he didn’t know. He just explained that each department will have different opinions about the future of APU. This is a big red flag for me.\n\nFinally, after all these hours spent participating in interviews, the hiring manager did not have the decency to tell me that I was rejected. I was simply “ghosted.”", "Interview Questions": "Tell us about your faith."}, {"date": "21 Nov 2021", "title": "Marketing & Communications Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Azusa Pacific University (Glendora, CA) in Sept 2021", "Interview Descriptions": "The interviewer wasn't really attentive over our virtual meeting. There were questions about my past professional experiences, interest in the position, and evaluation of my faith. Overall, the interview was only half an hour but required a follow-up writing sample.", "Interview Questions": "Describe your relationship with Christ"}], [{"date": "16 Nov 2020", "title": "Faculty Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Azusa Pacific University (Glendora, CA) in Jan 2020", "Interview Descriptions": "Skype interview with a panel of people from the department then an on-campus interview. The on-campus interview was multiple parts and lasted all day. Met with students and other faculty from different departments. Went on a tour of campus and downtown Forest Grove. Had to do multiple presentations to faculty and students", "Interview Questions": "Where do you see yourself contributing the most in the department?"}, {"date": "12 Aug 2021", "title": "Dining Services Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Azusa Pacific University (Azusa, CA) in Aug 2019", "Interview Descriptions": "To be honest, they are most likely gonna hire you if you have the availability, not much else. Be friendly and professional during interview and you will be good. Bonus points if you get along well with the manager.", "Interview Questions": "What is your major and where have you worked before."}, {"date": "30 Nov 2021", "title": "Admissions Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Azusa Pacific University (Azusa, CA) in Jan 2019", "Interview Descriptions": "1st interview was a video interview with an Associate Director. 2nd interview was a panel interview with all of the Associate Directors and Executive Director. They take turns asking prewritten interview questions. The 3rd interview is an interview with the Associate VP of Enrollment and Executive Director of Admissions.", "Interview Questions": "1. Tell me about yourself.\n2. Can you describe your job history?\n3. How does your faith integrate into your work?\n4. What does collaboration look like for you?\n5. Why are you interested in this position?"}, {"date": "27 Jul 2018", "title": "CLA Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Azusa Pacific University", "Interview Descriptions": "It was good. Short and did not find out results for a while. It was fun to work there. Enjoyed it. Yay.  There was two people. One employee and one last employee. I did not speak to the hiring person.", "Interview Questions": "Biggest fear?"}, {"date": "17 Jul 2018", "title": "Finance Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Azusa Pacific University", "Interview Descriptions": "Interview starts out with prayer led by one of the people who will be interviewing you. The whole process took about 1.5 hours. There were 3 people interviewing & if they like you they will schedule you for another interview. They make you feel very comfortable. All 4 people who interviewed me were Christian and gave me the sense that they would not hire anyone who isn't.", "Interview Questions": "Tell us about your background."}, {"date": "18 Jun 2018", "title": "Maintenance Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 3 days. I interviewed at Azusa Pacific University (Azusa, CA)", "Interview Descriptions": "They brought me in and asked me questions about my degree and my job experience.  The university is also interested in personal background, where you attended school and where you used to work.", "Interview Questions": "Why do you want this job?"}, {"date": "26 Mar 2018", "title": "Program Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Azusa Pacific University", "Interview Descriptions": "The first step, phone interview, the second step, panel interview with the team, third interview with Executive and Senior Director, lastly, interview with Vice President. If they like you, then they will move to the background check.", "Interview Questions": "Start with a presentation on any program.\r\nQuestions asked had to do with Faith questions, Diversity Question, Teamwork, Work history,  Behavioral Questions"}, {"date": "15 Sept 2022", "title": "Resident Advisor (RA) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 months. I interviewed at Azusa Pacific University (Azusa, CA) in Feb 2018", "Interview Descriptions": "Students need to fill out an application form that includes an essay, recommendations from past Resident directors and Resident Advisors, and a resume. The in-person interview is held with at least two other individuals in which they ask questions about why you seek this leadership position. ", "Interview Questions": "Why are you seeking this leadership role?"}, {"date": "8 Nov 2017", "title": "Associate Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 6 months. I interviewed at Azusa Pacific University", "Interview Descriptions": "Phone screening, in person interview, panel interview with 12 people (faculty, staff, students) on-campus. Answered 17 questions and asked about faith and work ethics, 5 year vision plan. Overall it was a lengthy and thorough process.", "Interview Questions": "What type of leadership do you have?"}, {"date": "27 Jan 2020", "title": "Maintenance Technician III Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Azusa Pacific University (Azusa, CA) in Nov 2017", "Interview Descriptions": "A 3 stage interview process with managers and directors of different levels. First interview is with direct supervisors of role, then department director, followed by Vice President of Facilities. Different questions are posed at each level but main interest is in fit and qualifications.", "Interview Questions": "How do you prioritize tasks?"}], [{"date": "1 Nov 2021", "title": "Resident Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Azusa Pacific University in Nov 2017", "Interview Descriptions": "Great, they try to get to know you as a person. They ask questions to gauge how you would perform as an RA and where your skills would be best used.", "Interview Questions": "Why do you want to be an RA?"}, {"date": "10 Jan 2018", "title": "Financial Aid Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Azusa Pacific University (San Dimas, CA) in Oct 2017", "Interview Descriptions": "Phone interview followed by an in person interview with two supervisors and then a final interview with the two VPs.\r\nPhone interview was generic.\r\nSecond interview was mostly about the job and my qualifications.\r\nThird interview was ALL about if you fit in with \"who they are\"\r\n\r\nWould like to say I rocked my first in person interview and even got a call back within a few hours to come in for a second interview. The second interview on the other hand was horrible and probably the worst interview I have ever had with a company. It was all about my faith and how I think I would fit in with them there. I'm going to be 100% honest. I am not a crazy religious person and I even told them this in the interview but I also let them know that I have my beliefs and would like to keep learning and spreading the teachings of god. After giving my testimony the VP was almost a little too harsh about how if I am not religious I will not fit in and he would not stop going on and on about it. \r\n\r\nWhen I left that day I knew I was not the right fit for the job. \r\n\r\nQuestion though for APU: \r\nYou want to spread the words of god but you are not willing to open your doors to people who are not as religious as you would like them to be for an opportunity to grow whom they are ? Doesn't sound like a true Christian to me but it's not my company so I'll just leave this hear for anyone who is in the same boat as I was. Don't waste your time unless you are willing too lie to get the job.", "Interview Questions": "What experience do you bring to the table ?\r\nWhat is your faith? \r\nWhat do you know about who we are? \r\n"}, {"date": "6 Jul 2017", "title": "Library Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Azusa Pacific University", "Interview Descriptions": "I applied online and interview in person. It was one interview with the coordinator. She was very nice and let me know that I would be trained well before officially starting.", "Interview Questions": "Can you tell me about yourself?"}, {"date": "11 Mar 2020", "title": "Academic Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Azusa Pacific University (Los Angeles, CA) in Mar 2017", "Interview Descriptions": "The interview went well, the staff were very helpful. Even though it took more than 2 hours I would say overall it was a great experience and would recommend to practice before interviewing", "Interview Questions": "Tell me about yourself?"}, {"date": "17 Jun 2020", "title": "Technical Director Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Azusa Pacific University (Azusa, CA) in Jan 2017", "Interview Descriptions": "Personal interview and then a practicum in which students were required to participate in. This allowed the panel to view the teaching process that the candidate would use in the classroom setting.", "Interview Questions": "How do you manage a team?"}, {"date": "24 Oct 2016", "title": "Loan Officer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Azusa Pacific University (Azusa, CA) in Oct 2016", "Interview Descriptions": "The interview involved three different stages. First a phone interview with the assistant director. Then followed by a group interview (assistant director, direct supervisor, director and co-worker) and lastly, a department dean interview. Questions were behavioral and about faith.", "Interview Questions": "Tell me about your faith"}, {"date": "12 Feb 2020", "title": "Media Services Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Azusa Pacific University in Jul 2016", "Interview Descriptions": "I applied through a contact of mine who had worked there previously and the interview process was over the phone.  There are a few requirements for the job but you don't need any prior media technology experience.", "Interview Questions": "You have to have your driver's license and be an undergrad APU student to get this job."}, {"date": "6 Jun 2016", "title": "Student Supervisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Azusa Pacific University", "Interview Descriptions": "Not stressful and very friendly. A simple and formal chat with the boss to see what your personality is like and how your will fit in. Overall very easy", "Interview Questions": "N/A"}, {"date": "2 Dec 2016", "title": "Multimedia Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Azusa Pacific University (San Dimas, CA) in Jun 2016", "Interview Descriptions": "The initial interview was with a Human Resources representative over the phone to discuss the job description, determine if I was interested in and whether or not I was qualified for the job. This interview was followed by a scheduled phone interview with the direct supervisor. where a more detailed job description was given followed by several questions and answers as well as giving me a chance to explain why I would be beneficial in this role. Lastly, an in-person interview was scheduled at the offices with executive management.", "Interview Questions": "Do you have a personal relationship with Jesus Christ? "}, {"date": "20 Jul 2016", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at Azusa Pacific University in Jun 2016", "Interview Descriptions": "Corresponded well with interviewer, easy, was asked questions of what interests me in research. Was asked about my background and why I want this opportunity. It was a really smooth process, and I did enjoy speaking with the interviewer. Most people at APU are great people and they want wholesome quality workers. I really appreciated the opportunity to interview!", "Interview Questions": "What brought you into nursing?"}], [{"date": "28 Apr 2016", "title": "Academic Records Counselor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Azusa Pacific University (Azusa, CA)", "Interview Descriptions": "There was an initial interview with a panel. If you are a finalist you will move on to meeting with senior leadership. If you are selected from that then you meet with the President.", "Interview Questions": "What is your statement of faith?\r\nHow do you handle stress?\r\nWhere do you see yourself in 5 years?"}, {"date": "21 Apr 2016", "title": "Instructional Designer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Azusa Pacific University (San Dimas, CA) in Apr 2016", "Interview Descriptions": "I submitted online application materials, was contacted the next day for the interview, interviewed the following week in front of a five person panel, and two days later they called me to say I wasn't the best fit.", "Interview Questions": "What Disney Princess are you?"}, {"date": "26 Apr 2017", "title": "MIDI Lab Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Azusa Pacific University (Azusa, CA) in Apr 2016", "Interview Descriptions": "I was hired pretty much entirely without an interview. The positions are filled on an opening-basis, and the supervisor seeks out students who have had success in the music technology courses. As a result, the position is somewhat hard to get into, even if you're a qualified individual—you just have to be at the right place at the right time.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "10 Nov 2016", "title": "Department Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. The process took 6 months. I interviewed at Azusa Pacific University (Azusa, CA) in Feb 2016", "Interview Descriptions": "From applying to receiving the job, the timeline was about 6 months. They had gone through the process several times and had not found someone they liked for the position. Unfortunately, the job I applied for and the job I interviewed for and the job I am doing are quite different. I am guessing that had something to do with the longevity of the interview process. However, once I got an email asking for some follow up questions, I was offered an interview the next day, offered a second interview the day after the first and offer the job on the spot at the second interview. Overall, about 1 weeks time.", "Interview Questions": "How I would manage a project from start to finish?"}, {"date": "24 Dec 2018", "title": "Data Scientist Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Azusa Pacific University (Sea Cliff, NY) in Jan 2016", "Interview Descriptions": "Great. I enjoyed it so much.  it was super great. Thank you for this awesome opportunity changed my life really so good oh wow. I hope everyone can find jobs as great as this i can't describe how much it changed my life", "Interview Questions": "What is one thing you're great at?"}, {"date": "10 Jul 2017", "title": "Lead Media Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Azusa Pacific University (Los Angeles, CA) in Aug 2015", "Interview Descriptions": "It was very comfortable, 3 people at the interview. Two bosses and one current student employee. They pray before the interview.  The interview questions are pretty basic and not too difficult.", "Interview Questions": "Have you worked with audio/visual equipment before?\r\nName these Cords and what they do: XLR, VGA, HDMI....."}, {"date": "21 Jun 2015", "title": "Residence Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Azusa Pacific University", "Interview Descriptions": "Two Skype interviews and one full-day in-person interview. Started the interview process in early April and was hired in early May -- about 1 month. The Skype interviews were both group settings and pretty standard Higher Ed questions were asked. The second Skype interview was probably the most difficult because it was a peer interview that included all other RDs. The on-campus interview was a full day but was the most fun. You meet with the Director, the Dean of Students, the Director of Student Life, a panel of various other Directors, and some students.", "Interview Questions": "What transferrable job skills do you bring to this job?"}, {"date": "9 Mar 2017", "title": "Support Desk Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Azusa Pacific University (Azusa, CA) in Apr 2015", "Interview Descriptions": "I applied as a student worker to the IMT Support Desk to be a Representative. I applied through the online Career Network through APU (available for students and alumni). They contacted me a couple days later to set up a time for a phone interview. I had the phone interview the next day and they asked customer service questions, questions in regards to strengths and weaknesses, as well as questions that gauge self-sufficiency and resourcefulness. From there, I got a call back two days later to come in for an in-person interview, which encompassed similar questions, but with the supervisor and two team leads. After that, about a week later, I met the director and she asked some questions and then was offered a job.", "Interview Questions": "What are your strengths and weaknesses?"}, {"date": "1 Dec 2015", "title": "Dining Services Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1+ week. I interviewed at Azusa Pacific University (Azusa, CA) in Apr 2015", "Interview Descriptions": "Two seperate face to face interviews with the manager of the convenience store. Very friendly and accommodating to school and social schedules.  Azusa Pacific requires you fill out all paperwork and provide all necessary documents before the interview process begins. They require original copy of social security card and drivers license but otherwise a simply process.", "Interview Questions": "Are you a good student?\r\n\r\nWhy are you qualified to work at APU?"}, {"date": "6 Mar 2015", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Azusa Pacific University", "Interview Descriptions": "Apply, email for an interview, group interview, sometimes individual. I suggest going in and speaking with a supervisor then applying so they remember you. As long as you are a decent person you will get hired. Be conversational during the interview, don't get too nervous.", "Interview Questions": "What is your relationship with God like?"}], [{"date": "1 Mar 2015", "title": "Student Account Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Azusa Pacific University in Feb 2015", "Interview Descriptions": "They do not relate themselves with people in our everyday world. They Want You to be a perfect christian. I felt if i was Christian that they would not hire me or accept me.", "Interview Questions": "What  church are you connetter to"}, {"date": "3 Jul 2019", "title": "Client Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Azusa Pacific University (Azusa, CA) in Jan 2015", "Interview Descriptions": "In person, went through 3 separate interviews with different members of different departments. It wasn't difficult. They each had different sets of questions and all were very polite. I have no complaints and it's been an easy interview for me", "Interview Questions": "Work availability"}, {"date": "24 Sept 2014", "title": "Records Coordinator Interview", "results": "Declined Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Azusa Pacific University", "Interview Descriptions": "Interviewed in a group setting. Each asked a question, questions weren't too difficult. There usually is 3 interviews then they will give you an answer as to if you received the job or not.", "Interview Questions": "What is your faith with God?"}, {"date": "23 Jan 2018", "title": "Admissions Counselor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Azusa Pacific University in Sept 2014", "Interview Descriptions": "I interviewed with 4 people for an entry level role. Took 3 months.  You do a phone screen, then come in for 3 or 4 different meetings. It was a long process for an entry level role.", "Interview Questions": "What is the most challenging part of the job description and the most exciting? "}, {"date": "3 Jun 2014", "title": "Media Manager Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied through an employee referral. The process took 4 months. I interviewed at Azusa Pacific University", "Interview Descriptions": "Had several interviews, all at least 2 hours long.  I first applied for the job with HR.  A month later I was asked to submit written responses to a supplemental questionnaire, and a few months later I was invited to interview.", "Interview Questions": "Some personal questions, but I wasn't asked anything ilegal."}, {"date": "25 Jul 2015", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Azusa Pacific University (Azusa, CA) in Jun 2014", "Interview Descriptions": "At first I interviewed with the Dept Chair and then after that they decided they wanted me to interview with the Dean of the school. He wasn't available so I interview with the Associate Dean via Skype. The interview was fairly casual. Spoke about work experience and what made me a good fit for this job.", "Interview Questions": "Christan Worldview"}, {"date": "7 Mar 2014", "title": "Residence Director Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Azusa Pacific University", "Interview Descriptions": "Interview process was well-explained, appropriately-timed, and very professional.", "Interview Questions": "N/A"}, {"date": "17 Jun 2017", "title": "Educational Mentor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Azusa Pacific University (Azusa, CA) in Jun 2013", "Interview Descriptions": "Applied online, was invited into office department for interview. Was greeted by friendly faces. Asked questions, why I wanted this position, why would I be a good fit, etc. was more of a casual interaction, than a structured question and answer session. They shared details about position and answered my question (what are they looking for in an applicant). Then we shook hands and they let me know they would let me know.", "Interview Questions": "What would make you a good fit for this position?"}, {"date": "7 Apr 2013", "title": "Tutor Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied through an employee referral. I interviewed at Azusa Pacific University", "Interview Descriptions": "I was referred for the class that I tutor by the professor. Essentially there was no interview and I was given the position after speaking with the head of the office. The work is completely dependent on whether or not the students enjoy your tutoring as they are the ones that can request certain tutors over another.", "Interview Questions": "There were no questions asked when applying for the position. Essentially as long as you have an A in the course that you desire to tutor and you fill out the application you can become hired. The only caveat is that you are not guaranteed any appointments with students so it is essential that you do a good job tutoring with the few students that you are given so that you can be referred to other students"}, {"date": "16 Dec 2016", "title": "Assistant Professor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Azusa Pacific University (Azusa, CA) in May 2012", "Interview Descriptions": "Much easier interview process than most universities. Skype interview followed by on-site interview. The on-site interview was 3 hours of interviews at the most, whereas most other institutions have been 12+ hours. I learned far more about the organization than they learned about me.", "Interview Questions": "Describe how you would integrate your faith system into your classroom teaching?"}], [{"date": "11 Aug 2010", "title": "Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 1 day. I interviewed at Azusa Pacific University (Azusa, CA) in Sept 2008", "Interview Descriptions": "I wanted to be a tutor for a class so I went into the learning enrichment center and I said, \"I would like to be a tutor for this class\" I then we told to fill out a few forms.  Once I did I got the forms signed by the professor and I was in!", "Interview Questions": "N/A"}, {"date": "18 Aug 2012", "title": "Program Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Azusa Pacific University (Azusa, CA) in Jun 2008", "Interview Descriptions": "I had three interviews and it took about a month or longer to get hired. After working there, I can easily tell as others could also see that it is not the most qualified candidate they are interested in. They are immersed in nepotism and favoring friends.", "Interview Questions": "All questions where easy. I had no experience for my job, neither was I trained for it. Yet I excelled and made those above me terribly nervous. How I got the job, without the required experience is still mystery, though I have my strong suspicion, which would be a tangent here."}]]