[[{"date": "23 Dec 2017", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Alliance (Chicago, IL) in Nov 2017", "Interview Descriptions": "Travel nurse, testing, rock star, was told\r\nThen used as a police nurse.  At least that is how I feel afterwards.  You get stipend for pay.  The check goes directly to your bank.", "Interview Questions": "Where you would like to go as well as your assignment."}, {"date": "27 Sept 2017", "title": "Technical Project Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 2 weeks. I interviewed at Alliance (Chippenham, South West England, England) in Sept 2017", "Interview Descriptions": "First stage phone call to go through my background and for the hiring manager to discuss the job and it's responsibilities in more detail. The hiring manager was easy to talk to.", "Interview Questions": "Describe a time you have dealt with a problem at work."}, {"date": "4 May 2017", "title": "Teacher Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Alliance (Los Angeles, CA) in Apr 2017", "Interview Descriptions": "Initial phone interview. Quickly thereafter called in for an on-site interview with administrators  and to teach a demo lesson. Afterward was asked for references and waited for email with next steps or decision.", "Interview Questions": "What are my classroom management strategies?"}, {"date": "3 Aug 2017", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. I interviewed at Alliance (Milpitas, CA) in Mar 2017", "Interview Descriptions": "Interviewed me on my hands on skills also made me take a math quiz An test me on filing alphabetical order. I also was asked a few questions about EKG an snellen chart.", "Interview Questions": "Why should they hire me as an intern. "}, {"date": "21 Feb 2017", "title": "Marketing Representative Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Alliance (San Diego, CA)", "Interview Descriptions": "1st interview - A quick one on one!\r\n2nd interview - took you out in the field to show you their one on one B2B selling process then back to the office for a 3rd round interview \r\n\r\nNot honest about being all about sales and commission", "Interview Questions": "Tell me about yourself.\r\nAre you money motivated? \r\n"}, {"date": "14 Feb 2017", "title": "Associate Brand Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. I interviewed at Alliance", "Interview Descriptions": "I received a call from an HR manager and an email immediately after she left a message. The phone call was vague and didn't mention the position I had applied for. I didn't recognize the name of the company as well, but found that my application had been passed through by a talent recruiting company (Zip Recruiter). I decided to do some quick research on Alliance since I had never heard of them. Their website is a complete facade. They make it look professional, but if you read the text and view several pages, something smells fishy about the whole business. I then looked up their address on Google Maps, only to find that it's a warehouse next to a farm field. Finally, I checked Glassdoor and found other interview reviews of people who described the company as a scam.", "Interview Questions": "When is a good time to schedule a phone interview?"}, {"date": "30 Nov 2016", "title": "Marketing Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Alliance (Seattle, WA)", "Interview Descriptions": "It seemed really strange to me that they emailed me an automated message as the initial contact email for the job I applied for. I was soon to be unemployed (contract work), so I applied to many roles I found online and could not remember what role I applied at with Alliance. In the email Alliance sent me, they never told me the role I applied for. The email only said to call them to schedule an interview. I called and I told them all about my experience working in marketing at Microsoft and advertising in Seattle. They said I was a good fit and that they wanted me to interview. I asked them what role it was for and they couldn't tell me. I then told them I was sure I applied to something in the marketing realm and then asked for a job description, and they couldn't give me anything. We scheduled an interview and they told me to dress business professional- which I thought was weird because I'm an adult who has been in the workforce for a while and I know how to dress for an interview. I don't need to be told how to dress. \r\n\r\nAfter I got off the phone, I went to their website and it looked very fake. I went to the company culture section and it had pictures of the office. It did not look very professional. In addition, all of the employees looked really young. I feel like the person I spoke on the phone with did not make the connection that I've already had a lot of experience working with some pretty big agencies and companies. This place is a waste of time for me. I don't know why they thought I would want to go in for an interview. I called back shortly after and canceled.", "Interview Questions": "Are you happy to work in marketing/advertising? Where do you currently work? Have you ever worked in advertising?"}, {"date": "14 Nov 2016", "title": "Event Coordinator Consultant Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Alliance (Tukwila, WA) in Sept 2016", "Interview Descriptions": "First interview was a simple check in to see if the interviewee would jive with the company. The second interview, which they didn't tell you was part of the process until the end of the first, ended up being a group interview with other applicants where they schooled the interviewee on how the company worked and answers to a written test that was taken in the lobby.\r\n\r\nThe company was nothing like they publicly present and was actually kind of sketchy, regardless of the very professional appearance of the staff. Red flags also went up when the interviewers didn't seem to know or care what job the applicant had actually applied for.", "Interview Questions": "N/A"}, {"date": "4 Oct 2016", "title": "Entry Level Marketing Representative Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Alliance (Kent, WA) in Sept 2016", "Interview Descriptions": "two round interview, both very easy.\r\nThey asked me a few simple questions. They talked way more than me. They did not want to know about you. They are just trying to promote themselves and want you to be their cheap labor. They said they are the top marketing agency in the country. (Obviously not) \r\nDo not waste your time.", "Interview Questions": "tell me about yourself"}, {"date": "10 Oct 2016", "title": "Public Relations Assistant Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Alliance (Kent, WA) in Sept 2016", "Interview Descriptions": "First off, what I came in to interview for wasn't even the job position they wanted to fill. I don't even think there was a position there for a PR assistant. I went through 3 rounds of interviews to where I received a job offer. The job was to be a marketing assistant. They kept saying this isn't sales its marketing. However, if it wasn't sales then why was your weekly salary based off of commission? They told me I would only get paid if someone were to use the code I gave them after my pitch and that I'd have to worry if I didn't get anyone to sign up. I'd rather have a normal day-to-day job where I know I'm going to get paid for the hours I put in instead of one where you could possibly go home with nothing. \r\n\r\nYou go through 3 different job titles until you get to a Manager title where you get an annual salary, benefits and double commission. This normally takes 12 months to 18 months or longer/shorter depending on you. \r\n\r\nAs for the questions, they were pretty straight forward. The first interview was a 15 minute introduction type where they got to know you and asked you some questions to see if you were a good fit. The second round was a longer interview which went on for about 45 minutes. After that interview if they wanted you to go to the next round you had to take a small quiz type thing. It asked what the best skills were to have for the job, the steps to a convo/pitch, why direct marketing works for their clients and consumers, and what other questions you'd like to ask. This \"quiz\" then went to the boss where he reviewed it and decided whether or not you should meet with him to go over your interview process. The second and third interview happened the same day and took about 2 hours for the entire thing.", "Interview Questions": "Where do you rate yourself from 1-10 in these three skills: attitude, student mentality and work ethic."}], [{"date": "2 Aug 2016", "title": "Receptionist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Alliance in Jul 2016", "Interview Descriptions": "Initial contact was via telephone. Conversation was great. One on one interview was with someone else. He was Not as pleasant. I thought I was being interviewed for a receptionist position, but actually it was for marketing. Interview process was very strained after that. He said they would call in a day or two either way, still waiting for that call.", "Interview Questions": "Am I willing to train for Marketing?"}, {"date": "28 Mar 2018", "title": "Production Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied through an employee referral. I interviewed at Alliance (Olathe, KS) in Jun 2016", "Interview Descriptions": "The interview was precise and thorough. The hiring manager asked me pertinent and well thought out questions for the position I was applying for. The interviewer summed up for what was expected of me in the position and the philosophy of the company.", "Interview Questions": "What situations ya e you been in that you were able to solve a problem working with a team. "}, {"date": "25 Jul 2016", "title": "Sales Representative Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Alliance (Orange, CA) in Jun 2016", "Interview Descriptions": "It was very fast faced. The interview process seemed rush, like they were very desperate to hire anyone. They call you on the daily until you answer. Obviously people are not interested if they do not return the phone call..", "Interview Questions": "What is one of your strengths?"}, {"date": "26 May 2016", "title": "Entry Level Sales Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "The process took 2 days. I interviewed at Alliance", "Interview Descriptions": "Probably an okay income if you enjoy sales and being talked down to. If you're looking for a rewarding career, look elsewhere. This company offers nothing but sales and \"performance based\" income.", "Interview Questions": "How much are your bills each month?"}, {"date": "30 Jul 2016", "title": "Sales Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Alliance (Orem, UT) in Jan 2016", "Interview Descriptions": "Really quick process they just wanted someone to hire. I was referred by a friend and they got me an interview right away. Had me shadow then took me in a room", "Interview Questions": "What drives you?"}, {"date": "21 Jan 2016", "title": "Sales Associate Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 days. I interviewed at Alliance (San Diego, CA) in Dec 2015", "Interview Descriptions": "Was very short but informative.  Very mixed reviews already. Not exactly what it seems. Its more in person sales at locations all over the city. They are not the specific on exactly what you will be doing.  This is why I felt something wasn't right with this whole operation.", "Interview Questions": "Are you available full time?"}, {"date": "1 Jul 2015", "title": "Rehab Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Alliance (Belcamp, MD)", "Interview Descriptions": "Was interviewed by two Rehab Coordinator II (supervisors). Was called back for a second interview with the Program Manager and the Program Director and was offered the job the same day. Background check and reference check process takes forever. I have no criminal background and had all three references but the process still took long.", "Interview Questions": "Why should we hire you for this job?"}, {"date": "21 Apr 2015", "title": "Administrative Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Alliance (White Marsh, MD) in Mar 2015", "Interview Descriptions": "I met with hiring personnel and felt totally at ease and confident then waited a couple of weeks for an answer.  The position was eventually given to an internal applicant.", "Interview Questions": "Why do you want to work here?"}, {"date": "6 Feb 2014", "title": "TOP Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied through college or university. I interviewed at Alliance", "Interview Descriptions": "Do not have the telephone interview process", "Interview Questions": "Business question"}, {"date": "27 Jan 2014", "title": "Rehabilitation Residentail Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Alliance (Rosedale, MD) in Apr 2013", "Interview Descriptions": "Very Comfortable. Applied on Careerbuilder and got a call within a couple days with an interview date. I didn't meet the requirements for the first job applied to, but feeling honored, they called me back with all the information with my current position held assured for room for advancement.", "Interview Questions": "Verbally asked, then a small written portion with 2 scenarios on it of \"what you would do if..\" situations."}], [{"date": "29 Sept 2016", "title": "Medical Biller Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Alliance (Paramus, NJ) in Apr 2012", "Interview Descriptions": "Spoke with the manager. She/he basically told about what the position entailed. She told me what other people did in the company and told me about ways to get promoted. She told me what other things I needed to learn.", "Interview Questions": "Q: What did I want to learn"}, {"date": "12 Jan 2014", "title": "Alliance Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Alliance (Dundalk, MD) in Jan 2010", "Interview Descriptions": "Smooth", "Interview Questions": "N/A"}]]