[[{"date": "22 Mar 2022", "title": "Systems Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Coordinated Health", "Interview Descriptions": "very relaxed, laid back.  i was on a phone interview first and then a in person interview. i was already getting a tour of the place after the second interview", "Interview Questions": "i dont remember the questions"}, {"date": "28 Jan 2021", "title": "Systems Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Coordinated Health", "Interview Descriptions": "i was contacted for a phone interview first then a in person appointment about two weeks later. the second interview felt like more of a meeting before being offered the job", "Interview Questions": "name a difficult time at work and how you worked through it"}, {"date": "19 Dec 2019", "title": "Cst Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Coordinated Health", "Interview Descriptions": "HR very friendly, staff on site rude ,condescending and not professional. It was about a month before they called me back to tell me I was t a good fit but if I wanted another position at a different location", "Interview Questions": "Would you be able to scrub in a hernia surgery right now if we asked you to?"}, {"date": "20 Jan 2020", "title": "Security Guard Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Coordinated Health (Detroit, MI) in Jan 2018", "Interview Descriptions": "The interview was super easy. You usually go through 2 short interviews. They asked about very basic questions, like where you live, how you commute, and what your availability is. One question they asked was what you think good hospitality is. You know right after if you are hired or not.", "Interview Questions": "How old are you? "}, {"date": "12 Feb 2019", "title": "Nurse Practitioner Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1+ week. I interviewed at Coordinated Health in Jun 2017", "Interview Descriptions": "Don’t even accept. All this place is good for is to practice your interview skills. \n\nThe people didn’t care to hear about anything. Their questions were basically steered to how YOU can feed the Ortho specialty. When offer is made, the “administration” REFUSES to allow you to shadow, state it is a HIPPA violation. Do they even know what a HIPPA means?!  Ofer was made like this, “92000 a year and you can earn up to $38,000 jn RVUs, if that doesn’t work for you then there is no need to go any further.”  Really?!  So unprofessional. FYI you’ll never get any bonus here, administrators will stop at NOTHING to prevent you from earning bonus from limiting your practice to even using the 60 opt out because you “have too much of a following” for the degree you have.", "Interview Questions": "What have you heard about us?"}, {"date": "26 Jan 2017", "title": "Front Desk Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Coordinated Health", "Interview Descriptions": "HR calls you and if you pass the phone interview then the clinic manager interviews you, he/she will give you a tour of the office and once that interview is done and they like you,  HR calls you to offer you the position.", "Interview Questions": "If you have experience, if you are capable of using different systems at once, if you have experience in the healthcare field, if your a good team player."}, {"date": "27 Dec 2016", "title": "Physician Extender Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Coordinated Health (New York, NY)", "Interview Descriptions": "Was contacted via e-mail thru internal communication . No formal interview was conducted . No further contact was made, even though I was an internal candidate with expierence. Very unprofessional process.", "Interview Questions": "Where I see myself in 5 years"}, {"date": "3 Nov 2016", "title": "Work Comp Case Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Coordinated Health (Allentown, PA) in Jun 2016", "Interview Descriptions": "I was called after submitting my application online.  I had an informal phone interview before being invited in for a face to face. I met face to face with Human Resources.", "Interview Questions": "What experience will you bring with you will benefit you in the role you are interested in."}, {"date": "4 Oct 2017", "title": "Internship Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Coordinated Health (Allentown, PA) in Feb 2016", "Interview Descriptions": "Internship process was quite simple. Mostly consisted of email communication with an invitation to an interview in one of their offices. Recruiter seemed interested but was not overly excited, hard to understand the body language. Interview was fairly short and mostly questions from resume.", "Interview Questions": "Tell me about why you're interested in this internship. "}, {"date": "26 Aug 2015", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Coordinated Health", "Interview Descriptions": "It was about 30 minutes. It was with the office manager and assistant office manager.  They told me about the potential for my career growth at the company. Then I walked around the office for a tour of facilities.", "Interview Questions": "How would you handle a disgruntled patient demanding more pain medication"}], [{"date": "2 Jan 2015", "title": "Physical Therapist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Coordinated Health", "Interview Descriptions": "Interview was conducted with 3 individuals, Head of Rehabilitation, Head of physical therapists and an administrator.  Individuals were cordial and each person had a different point of view and questions to ask.  Interview was preceded by brief tour of facility and description of how teams of PT/PTA work on a daily basis.  Company has multiple sites and therapists are expected to cover more than their home office/clinic when the need arises.", "Interview Questions": "There weren't many technical questions about physical therapy, but was surprised to have questions about commitment to being a physical therapist when the breath of my education and experience should have made that commitment obvious."}, {"date": "19 Dec 2016", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Coordinated Health (Allentown, PA) in Aug 2013", "Interview Descriptions": "Human resources in Allentown called me for an interview; met with her.  Human Resources employee referred me to potential supervisor. Spoke with her on phone and scheduled next interview.  Met with potential supervisor and her supervisor for next interview. Offered position after references were checked. Accepted. Attended mandatory introduction/training session.", "Interview Questions": "What makes me feel that I could handle this position and responsibilities, due to my limited experience in orthopaedics. "}, {"date": "29 Jul 2015", "title": "Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Coordinated Health (Philadelphia, PA) in Jan 2012", "Interview Descriptions": "Very cut and dry process, and average interview questions posed. Lots of talk about how wonderful their employee contributions were as well as benefit packages. Met with two people from the HR department and work site manager who were very pleasant.", "Interview Questions": "What do you want to work for Coordinated Health"}]]