[[{"Recommended": "Yes", "CEO Approval": "No", "Business Outlook": "Good", "Work/Life Balance": 0, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 3, "review_title": "Good working conditions", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "6 Sept 2021", "job_title": "Manager in Le Mans", "duration": "N/A", "pros": "The ICRC provides challenging and rewarding positions", "cons": "Career management and family life not always easy"}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 1, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 1, "review_title": "A mixed review", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 8 years", "job_date": "14 Apr 2019", "job_title": "Manager in Paris", "duration": "N/A", "pros": "Good salary, the chance to do good, autonomy and responsibility,  working alongside passionate talented individuals, organization's values, friendships. Offers a great professional experience. Working atmosphere in hardship, highly operational field missions is usually a unique and unforgettable experience.", "cons": "Huge workload and little work-life balance. Poor management and often lack of transparency in decision making.  Nepotism, outdated structure, lack of recognition. The cardinal sins of all big organizations going sideways are there: Organization is completely immune to any internal criticism, there is no organization-wide consultation.  Management in HQ is detached from the field (which is a standard in the industry) and surrounded by yes-men.  \r\nIt's a great job you won't be recognized for, as generally the HR policies are lacking. Career progression is haphazard and largely depends on whom you know.  Working atmosphere depends on management, and there are few good managers around. HQ atmosphere is atrocious, and non-operational missions are generally quite toxic too."}], []]