[[{"date": "23 Aug 2022", "title": "Assistant Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Western Carolina University", "Interview Descriptions": "Everyone is very friendly in the interview panel. There are 3 stages of the interview: phone, presentation, and site visit. You need to be well prepared for classroom lectures and research presentations.", "Interview Questions": "Why do you want to join us?"}, {"date": "4 Feb 2022", "title": "Administration Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Western Carolina University", "Interview Descriptions": "Group interview over Zoom and individual meeting with supervisor. I also was provided with a campus tour. Process was thorough but friendly and informal. The interview process lasted about two hours.", "Interview Questions": "What special strengths will you bring to this role?"}, {"date": "23 Mar 2021", "title": "Studio Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Western Carolina University (Cullowhee, NC)", "Interview Descriptions": "Very simple! was asked if i was able to perform simple tasks. Then went through what I would be doing on the job, collected my studio keys and then reported for my next shift. Hard part was paperwork for WCU though.", "Interview Questions": "are you able to fix the drafting tables with power tools? "}, {"date": "20 Jan 2021", "title": "Director Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Western Carolina University", "Interview Descriptions": "Phone interview followed by an on site combination of in-person and video interviews due to the pandemic.  Also toured campus briefly, limited by pandemic restrictions. Everyone was warm and welcoming.", "Interview Questions": "Range of questions related to role."}, {"date": "5 Jul 2019", "title": "Assistant Professor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at Western Carolina University (Cullowhee, NC) in May 2019", "Interview Descriptions": "Standard 2-day faculty interview process. Dinner with interview committee, day of interviews, research and teaching talks, meeting with various HR. Met with students at my request. Third day meeting with \"higher ups\", both of whom kind of grilled me, and didn't seem especially interested in answering my questions.  Everyone was very polite and professional.\r\n\r\nSome of my questions were not answered, or were given vague answers. E.g., no information on salaries would be provided. Answers suggested that research start up was limited to a few thousand dollars, and there were no research lab facilities associated with the position. Internal funding for research expenses (annual funding) is good - fairly easy to get annual grants of $5000 to $10,000 from the university system. North Carolina Universities do not offer sabbaticals (there is something alternate you can apply for but they are often rejected). Health care cost for family is about $6500 annually, which comes out of salary. Raises for successful promotion to associate and full professor are flat rates of around $4000 and $6000, if I remember correctly. I was informed that most people do make tenure. The culture of the program seemed very healthy and good, and there was a very strong interest in the well being of the students.\r\n\r\nDid not follow up with me for 2 months - I inquired with search chair and immediate received a canned rejection email from HR. I requested feedback from the search committee chair on my interview (how to improve, etc.) and received an email that the search committee does not make the decisions (the higher ups do) and so they have no feedback to give. So as a growth experience, the interview was not very valuable.", "Interview Questions": "A handout of 10 questions was provided, and there was 60 minutes to answer. This included the following:\r\nHow do you incorporate research into your teaching?\r\nWhat are your resource needs?\r\nHow would you develop another research plan if your \"Plan A\" did not work out?\r\n"}, {"date": "3 Dec 2018", "title": "Tech Commons Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Western Carolina University", "Interview Descriptions": "They ask you a lot of behavioral questions. The job is mostly helping student, faculty, and staff in any way we can. For example, helping in software and hardware issue, answering general questions and documenting interactions.", "Interview Questions": "How would you handle an irate client "}, {"date": "24 Mar 2022", "title": "Resident Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 months. I interviewed at Western Carolina University (Cullowhee, NC) in Nov 2018", "Interview Descriptions": "The interview process consisted of a rotation with two to four individuals total. The questions were mostly about leadership and skillset inquiries. The interviewers are leaders within the university and their kindness eases the stress. Other resident assistants also listen during the interviews.", "Interview Questions": "Describe a time you handled a workplace conflict\r\nWhat is your biggest strength and weakness"}, {"date": "10 Jan 2017", "title": "Mental Health Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Western Carolina University (Cullowhee, NC)", "Interview Descriptions": "You arrive for a full day of interviewing. There is a combination of individual interviews, group interview and group presentation. You will meet with the counseling staff, which is multi-disciplinary, as well as possibly health services and other people depending on if you are applying to a specialty area. Don't wear heels bc there is walking and its hilly.", "Interview Questions": "Orientation? Past experiences w Outreach?"}, {"date": "9 Jan 2018", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Western Carolina University (Cullowhee, NC) in Jan 2017", "Interview Descriptions": "Interview consisted of a lot of behavior questions from a committee of about five people in the department.  A typing test, multiple choice questions looking at your skills of ordering names, and numbers with percents.  An Excel assessment was given.", "Interview Questions": "Tell me a situation where you improved a procedure or made a process helpful for the organization. "}, {"date": "29 Sept 2016", "title": "Houskeeper Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Western Carolina University (Cullowhee, NC)", "Interview Descriptions": "They put you on the spot and have several groups of people interview toucan one time. They force people who have no interest in the interview process to attend. Overall worst interview experience I've ever had.", "Interview Questions": "Anything they feel like asking if the supervisor can even force them to ask anything at all. "}], [{"date": "15 Jun 2016", "title": "Admissions Counselor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Western Carolina University (Asheville, NC) in May 2016", "Interview Descriptions": "It was a panel of five individuals in a video conferencing room. Very official; resembled something from Star Trek. It was a bit intimidating, only because I was not expecting it. Most of the group was very friendly and professional. It was also intimidating because each time someone would speak the video conferencing camera would zoom in on that person's face, then to the group, and then to the next person. It also felt a bit unnatural to interview over Skype, but I understand why they do it.", "Interview Questions": "What is one experience where you excelled?"}, {"date": "26 Jun 2015", "title": "Community Family Educator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 3 weeks. I interviewed at Western Carolina University (Morganton, NC)", "Interview Descriptions": "Submitted resume in response to newspaper ad, was called in for interview and meet with program director.  Interview lasted about an hour.  Talked about experience and interviewer shared program philosophy being certain that I was aligned with mission", "Interview Questions": "What would you experience contribute to this position"}, {"date": "28 Dec 2017", "title": "Resident Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Western Carolina University (Cullowhee, NC) in Feb 2015", "Interview Descriptions": "Once you fill out the application, you will attend a two-part interview that is done all in one day.  The first part is a group interview where you're giving various scenarios and you and your group will rate the importance of a situation and give an explanation.  There will be a group of current RAs and pro-staff who will be watching and assessing you.  The second part is an individual interview where you go table to table meeting with a pro-staff member and a current RA and they'll each ask you questions pertaining to how well you follow policies, your interpersonal skills, your morals and values, how you handle diversity, etc.  After this, they run a background check and you receive a letter about a month or two later stating whether you've been selected, denied, or placed in the alternate pool.", "Interview Questions": "How would you handle a resident who was yelling racial slurs?"}, {"date": "8 Oct 2014", "title": "Instructor Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Western Carolina University", "Interview Descriptions": "Hiring process was full of miscommunication.  There were unclear expectations about salary and advancement.  The university failed to pay for much travel.  The management at the institution is completely disingenuous and doesn't really care about its employees.  There are too many mixed messages coming from this institution.", "Interview Questions": "They asked about teaching philosophy and appeared to be progressive in terms of their pedagogical approaches but were not ultimately."}, {"date": "19 Sept 2016", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Western Carolina University (Cullowhee, NC) in Mar 2014", "Interview Descriptions": "A list of minimum requirements for qualification is listed online. Among the requirements are GPA and GRE scores which must be met by the specified date. Also, communication skills were required to be at a certain level or above. My interactions there were personable and therefore made it an easy interview.", "Interview Questions": "What topic most interests you for your research."}, {"date": "30 Aug 2017", "title": "Administrative Support Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Western Carolina University in Nov 2013", "Interview Descriptions": "Submitted my application, and I heard back 3-4 weeks later.  I was brought in to WCU's campus to be interviewed by a panel of faculty members, for probably around 30 minutes.   I was called and offered the position about a week later.", "Interview Questions": "Have you supervised students"}, {"date": "13 May 2017", "title": "Resident Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Western Carolina University (Cullowhee, NC) in Mar 2013", "Interview Descriptions": "The hiring process had multiple rounds. I believe that they screen the applications first. A group interview is conducted as well as an individual interview. Overall the process was fun and straightforward!", "Interview Questions": "What's one way you handle adversity?"}, {"date": "25 Feb 2015", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Western Carolina University (Cullowhee, NC) in Oct 2012", "Interview Descriptions": "After filling out my application, I came to Cullowhee to interview with the professor's that I would be working with in my department. They were very accommodating and kind. They gave a wealth of information about the process and let me know I was hired within a few days of being interviewed. Great all around process", "Interview Questions": "What types of work have you done since leaving undergrad?"}, {"date": "25 Sept 2015", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Western Carolina University (Cullowhee, NC) in Feb 2012", "Interview Descriptions": "Laid back and friendly environment, just sitting in an office talking one on one with a professor. They are largely just curious about your knowledge, experience, and goals, it's really not an overbearing process. It is important that they understand and assess your research background to see if you would be a good fit in the department, and to see to what extent you would be able to conduct studies on your own. There is a lot of mentoring so it's not like they are expecting you to be able to do it by yourself right away.", "Interview Questions": "What literature is relevant to the types of studies you want to conduct."}, {"date": "24 Aug 2016", "title": "Library Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 5 days. I interviewed at Western Carolina University (New York, NY) in Feb 2012", "Interview Descriptions": "Quick in person interview, general questions about work ethic, sat down with the manager, went over my resume, very easy interview, its a college job thats part time...how hard can it be,", "Interview Questions": "how do you manage stress?"}]]