[[{"date": "14 Jun 2023", "title": "Environmental Health Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at CDC Foundation (Bismarck, ND)", "Interview Descriptions": "Short interview, was given a good referral for the job. It was a temporary position to help with the COVID—19 Pandemic. I was given the job very quickly after applying.", "Interview Questions": "Experience and Education history was asked."}, {"date": "5 Jun 2023", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at CDC Foundation (Atlanta, GA)", "Interview Descriptions": "It was a Phone screening interview followed by a virtual zoom meeting. Questions regarding experience, behavioral/situational questions as well. Process was fast but did not move forward with the position.", "Interview Questions": "Tell me about your experience with project management"}, {"date": "9 Feb 2023", "title": "Program Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at CDC Foundation", "Interview Descriptions": "Phone screen and another in person interview. Informed whether I got the position or not within 2 weeks. Very quick and easy process! Very direct and don’t keep you hanging.", "Interview Questions": "What do you bring to the organization?"}, {"date": "13 Dec 2022", "title": "Analyst Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at CDC Foundation", "Interview Descriptions": "It was first call with HR, Then supervisor n team. If you have a work exp at cdc will be an addon. this is a goood organization with good payment.", "Interview Questions": "average interview process need to know the projects"}, {"date": "3 Dec 2022", "title": "COVID-19 Vaccine Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at CDC Foundation", "Interview Descriptions": "3-person panel, 1 was the recruiter and 2 were from the company that I would've been working for. One of the main interviewers seemed like they did not want to be there and was very dry through the interview. The interview was 30 minutes and it felt like they had already had someone else in mind for the position and only agreed to interview me to check it off of their list. There wasn't even time left to ask them any questions even if I wanted to.", "Interview Questions": "Have you created any policies from your previous experience?"}, {"date": "23 Dec 2022", "title": "Public Health Data Scientist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at CDC Foundation (Madison, WI) in Dec 2022", "Interview Descriptions": "Pretty standard interview process- tell me about yourself, experience working with analytics and data dictionaries. The interview was with three individuals working on the project. They seemed like they wanted a candidate who had published before so I was surprised that I was offered an interview (seemed like a waste of everyone's time. They also asked for a writing example, which seemed very strange in an interview.", "Interview Questions": "tell me about yourself, experience working with analytics and data dictionaries, publishing experience"}, {"date": "5 Jul 2022", "title": "Program Manager Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at CDC Foundation", "Interview Descriptions": "I applied online, a recruiter called and set me up with the hiring manager, interviewed with hiring manager, got the offer 30 minutes after the interview. It was a great experience.", "Interview Questions": "What previous experience do you have?"}, {"date": "22 May 2022", "title": "Covid-19 Case Investigator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at CDC Foundation", "Interview Descriptions": "Very simple, spoke with CDC Foundation member first and then to the health department. The whole process including the application took about 3 months. Everyone was very friendly and eager to bring me on.", "Interview Questions": "They asked about my previous experiences in healthcare"}, {"date": "12 May 2022", "title": "Senior Director Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at CDC Foundation", "Interview Descriptions": "1 hr interview w a person who knew nothing about the role, couldn't answer questions and actually gave inaccurate information. 1 panel interview with 5 people. Called an hr after w an offer. Benefits are horrible and unless you push they won't disclose details about them until your 1st day", "Interview Questions": "How i reflect integrity in my work "}, {"date": "6 May 2022", "title": "Community OUtreach Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at CDC Foundation", "Interview Descriptions": "Easy quick and straight to the point. Very direct with questions and it was only a phone interview with one zoom call interview.  Only asked about five or six questions", "Interview Questions": "How do you value health equity?"}], [{"date": "19 May 2022", "title": "Microbiologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at CDC Foundation in May 2022", "Interview Descriptions": "The first interview was a 10 minute phone interview with a recruiter, the second was a 30 minute zoom interview with the project manager from CDCF, and the final informal interview was ~45 minutes with the PI and team-member on the project from the CDC. The interview process also included a 7 question case study.\r\n\r\nI wouldn't say the interview was that difficult just intensive.", "Interview Questions": "What is your experience with molecular techniques? \r\nTell me about yourself\r\nWhat is your experience with molecular virology?\r\nAre you comfortable with zoom? \r\nWhat are your salary expectations? \r\nAre you familiar with the molecular techniques used in this position? \r\nWhat is your experience training people with molecular techniques?\r\nWhat is my highest degree?\r\nHow do you like to organize?"}, {"date": "27 Apr 2022", "title": "Intern Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 3 days. I interviewed at CDC Foundation", "Interview Descriptions": "Felt like I brought more energy to the interview than the interviewers despite it being a 10 AM interview. Had to request a follow-up on decision after they missed their own deadline.", "Interview Questions": "Tell me about your decision behind pursuing public health."}, {"date": "30 May 2022", "title": "Communications Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at CDC Foundation (Baltimore, MD) in Apr 2022", "Interview Descriptions": "I received multiple emails from various recruiters to schedule an interview time and it made the process confusing. Additionally, I was unable to contact anyone, as the emails were sent from no reply accounts.", "Interview Questions": "How many years of project management experience do you have?\r\n\r\nWhat are your three biggest strengths?"}, {"date": "1 Apr 2022", "title": "Data Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at CDC Foundation", "Interview Descriptions": "great experience. The interview was conducted over the phone and it was like 15 mins. They were missing my resume and I had to send my resume again. But overall,  I look forward to doing my 2nd interview soon.", "Interview Questions": "What is your weakness and strength?"}, {"date": "13 May 2022", "title": "Epidemiologist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at CDC Foundation in Apr 2022", "Interview Descriptions": "HR screener was 30 minutes late, clearly hadn’t read my CV, and had zero information about the role. Felt quite unprofessional. This was meant to be the first conversation before a more formal interview but it gave me a bad impression.", "Interview Questions": "What is your highest degree? "}, {"date": "28 Feb 2022", "title": "Program Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at CDC Foundation", "Interview Descriptions": "Interview was over the phone and the interviewer was professional and prompt. There is an initial screening interview before the actual interview process. It was a quick and easy interview for the position", "Interview Questions": "Previous experience with data software, availability, and demographics "}, {"date": "4 Feb 2022", "title": "Public Health Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at CDC Foundation", "Interview Descriptions": "The overall process of interview and hiring was easy and fast. I interviewed with the person who would become my supervisor. I had an offer the same day I interviewed. This is a great company.", "Interview Questions": "about my history as a nurse"}, {"date": "17 Jun 2022", "title": "COVID 19 Task Force Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2+ months. I interviewed at CDC Foundation (Bellevue, NE) in Jan 2022", "Interview Descriptions": "Quick interview process, met with site and CDCF employee on interview. Had an offer within a week and negotiated start time. Basic questions, asked about remote or in person preferance.", "Interview Questions": "Why are you interested in the position? What do you bring to this position? "}, {"date": "22 Mar 2022", "title": "Public Health Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at CDC Foundation (Los Angeles, CA) in Jan 2022", "Interview Descriptions": "Great Initial Interview! Waiting for second one. Initial interview was a phone call. Quick and effective. Learned more about the role and the CDC Foundation. Interviewer described the role in an even more detailed way.", "Interview Questions": "Describe your background in Public Health."}, {"date": "15 Dec 2021", "title": "Infection Preventionist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at CDC Foundation", "Interview Descriptions": "average, phone screening that took 15-20 mins. Takes a while to hear back. But I hear others experiences honestly depends on the recruiter that contacts you. I tried to follow-up but couldn't get a response back after a few weeks to know where I stood in the interview process", "Interview Questions": "Often it's just tell me about yourself, why you are applying for the role, and scenario questions to see how you deal with others in the workplace "}], [{"date": "3 Jan 2022", "title": "Communicaion Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at CDC Foundation in Dec 2021", "Interview Descriptions": "The process was relatively quick-- sent out an application and received an email for an interview a week later.  I was interviewed for a different position than I applied, but I think it worked out better with my experience and background. Interview included questions specific to the job and how the duties related to my experience. Heard back from them later that day with an offer and a start date within 2 weeks.", "Interview Questions": "Do you have any knowledge or experience with XYZ and can you tell us about it ?"}, {"date": "22 Nov 2022", "title": "Epidemiologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at CDC Foundation (Atlanta, GA) in Dec 2021", "Interview Descriptions": "Short initial phone interview with recruiter to go over position applied for and expectations of position. This was later followed by a panel interview with CDCF recruiter and health department representatives via zoom.", "Interview Questions": "What is your statistical reporting experience?"}, {"date": "17 Nov 2021", "title": "Program Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at CDC Foundation", "Interview Descriptions": "There were multiple rounds of interviews. Initial call with recruiter, additional interview with actual supervisor. There was also a task/case study to complete over a certain time period. These were all remote.", "Interview Questions": "Work style, interpersonal conflict, why I was interested, goals."}, {"date": "8 Nov 2021", "title": "Epidemiologist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at CDC Foundation", "Interview Descriptions": "Only spoke with recruiter, did not make it through the next round. it was very thorough. CDC foundation, fresh graduate, sas, epidemiology, data analysis and data manipulation, masters in public health, graduate, undergraduate in dental surgery", "Interview Questions": "Experience in coding and data analysis"}, {"date": "9 Nov 2021", "title": "Covid-19 Contact Tracer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at CDC Foundation", "Interview Descriptions": "Career website is confusing -no central HR body with process knowledge. If you have experience and get a call back, there is a high probability that you get hired. There is no follow up or feedback if you don't get hired.", "Interview Questions": "What is your prior experience w data entry? Are you comfortable with Microsoft Suite? Do yo have a home office set up? Which languages do you speak fluently - English and Spanish being the most sought after."}, {"date": "13 Jan 2022", "title": "Covid-19 Contact Tracer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at CDC Foundation in Nov 2021", "Interview Descriptions": "Initial Phone Screen with a recruiter. Told I would be pushed up to the next level of the interview process. didn’t hear back until 3 months later with an email saying they were no longer hiring for the position.", "Interview Questions": "Why would you be a perfect fit for this role "}, {"date": "1 Oct 2021", "title": "Data Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 2+ months. I interviewed at CDC Foundation (Raleigh, NC) in Oct 2021", "Interview Descriptions": "I applied online and a talent person called me. It wasn’t until over 2 months that the Zoom interview was scheduled. They were disrespectful. They showed up late and asked the same questions more than once. I got rejected the same day but I am happy to not work for someone so disorganized.", "Interview Questions": "How would you respond to criticism?"}, {"date": "18 May 2022", "title": "Health Scientist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at CDC Foundation (Atlanta, GA) in Oct 2021", "Interview Descriptions": "The interview process was fairly quick. One screening phone call and one interview, followed by an offer. You have to submit a background check but there is no drug testing.", "Interview Questions": "Tell me about projects you’ve worked on in the field of —."}, {"date": "21 Nov 2022", "title": "School Liaison Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at CDC Foundation in Oct 2021", "Interview Descriptions": "It was a recruiter email with a phone call to follow hearing about the position. Then I had an interview with the CDC foundation. For the position I got hired for, it was just that process and then I was hired. Other cdc foundation positions, I met with the state government I was going to support", "Interview Questions": "What makes you interested in working with covid-19 response within schools? Have you worked with schools before?"}, {"date": "16 Sept 2021", "title": "Data Analyst Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at CDC Foundation", "Interview Descriptions": "Multiple phases. Phone interview, followed by 2 zoom interviews and a skill test. Information on needed skills from past experience either work or school is relevant. Ensure you have thought about the anticipated pay you want, there might be room for negotiation", "Interview Questions": "Experience when you used SAS or anything statistical software "}], [{"date": "23 Aug 2021", "title": "Communications Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at CDC Foundation", "Interview Descriptions": "I saw a LinkedIn post from a recruiter that said to send your resume to them. So I did and she answered right away and gave me a couple of positions to choose from. So when I had the interview she thought I was interviewing for a different position so I corrected her and she says oh you don't have enough experience for this role, even though she was the one that suggested it to me. Then proceeded to try to get me to go for a position that only needs a high school diploma when I have a master's degree.", "Interview Questions": "N/A"}, {"date": "2 Sept 2021", "title": "Epidemiologist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at CDC Foundation", "Interview Descriptions": "I got ghosted by a recruiter. Did not call at the time of the interview and did not answer my follow up emails to see what happened and to reschedule.", "Interview Questions": "Q: none because they don't follow through on interviews"}, {"date": "6 Sept 2021", "title": "Human Resources Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at CDC Foundation", "Interview Descriptions": "After submitting resume to posting, I was contacted for a phone screen which went well. It was about 3 weeks after when I received an email from Assistant Director of HR contacted me for an actual interview. We interviewed that next day and was offered the position.", "Interview Questions": "What drew you to a position with the CDC"}, {"date": "16 Mar 2023", "title": "Vaccine Demand Strategist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at CDC Foundation in Sept 2021", "Interview Descriptions": "I had a phone screening with the CDC Foundation. Then I had a second interview with the State Health Department that I would be working with and my supervisor from the CDC Foundation.", "Interview Questions": "Tell me why you would like to work for the CDC foundation."}, {"date": "30 Jun 2021", "title": "Data Scientist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at CDC Foundation", "Interview Descriptions": "They scheduled a phone interview, then never called. When following up with them they rescheduled, which they promptly missed again. After going back and forth 3 times they finally called me when I was at my other job without warning, and ignored all the times that I was available and provided for them, and clearly didn't my resume beforehand.", "Interview Questions": "What prior experience do you have?"}, {"date": "18 Jan 2023", "title": "Epidemiologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at CDC Foundation (Reno, NV) in Jul 2021", "Interview Descriptions": "Disclaimer: This was for a contract role during COVID (2021). I didn’t apply to the specific job; it appeared they reached out because my prior apps and resume matched the job needs. Very EASY interview process. Recruiter reached out to me via phone. This was scheduled for 15 minutes. I told recruiter about my experience. At first she said it would be a pass, which I was fine with. Called me back the next day after her other interviews. Guess they didn’t go so well. They passed my resume along to the state hiring team. This was scheduled for 1 hour. Hiring team included 1 CDCF staff member. I imagine each state hiring team has different needs and interview questions. After the interview, CDCF staff reached out almost immediately to tell me I did great and they’d send over an offer.", "Interview Questions": "Have you worked in SAS?"}, {"date": "6 Apr 2021", "title": "Public Health Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at CDC Foundation", "Interview Descriptions": "First  round interview was a screening with an HR person just to see if I was qualified, look at salary expectations, etc. Second round was with full team, quite in depth and intimidating. Third was fill team again but more informal, looking to see how I worked with the team", "Interview Questions": "Describe a difficult situation in previous workplace and how you handled it."}, {"date": "28 Jan 2021", "title": "Program Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at CDC Foundation", "Interview Descriptions": "after applying online, I was asked to interview with what would be my senior manager. Following that interview, I interviewed with someone slightly higher up. Both interviews were conversational and <1hr.", "Interview Questions": "Why do you want to work for the CDC Foundation"}, {"date": "1 Dec 2020", "title": "Covid-19 Contact Tracer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at CDC Foundation", "Interview Descriptions": "Very simple, 15-20 minute phone interview. Was contacted for the interview via email, and I was told a  day after the interview that there were no available positions but they would contact me if any come up", "Interview Questions": "Asked me to describe times when I handled confidential information and handled sensitive topics."}, {"date": "1 Nov 2020", "title": "Data Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at CDC Foundation", "Interview Descriptions": "In total, three round interview needed. HR is responsible for the first round and the other two are held by your potential managers. I experienced three interviews on three different roles and none of them is passed.", "Interview Questions": "What are you doing in your daily work ?\nGive me a brief introduction about yourself."}], [{"date": "21 Jul 2021", "title": "Epidemiologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at CDC Foundation (Houston, TX) in Oct 2020", "Interview Descriptions": "Scheduled a zoom meeting and had two people from the health department and one cdc foundation interviewer. They asked me 5 questions and discussed what the role will entail. They asked if I had questions for them and I asked based on interview question.", "Interview Questions": "Surrounded COVID-19 and what role an epidemiologist will play "}, {"date": "7 Aug 2020", "title": "Communicable Disease Investigator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at CDC Foundation", "Interview Descriptions": "Initial phone screening and then 2 interviews and asked for references; Good communication throughout the process but then ghosted and had to push to find out what happened; Interviews had seemed to go well but was solely told that I was no longer being considered after emailing recruiter; Friend was told that the previous person conducting interviews had quit, the new person in charge had never heard of me, and they said they were still looking to hire as soon as possible to let them know if they know of anyone fit for the role", "Interview Questions": "How have you handled a situation where you had to make an ethical/fair decision?"}, {"date": "10 Aug 2020", "title": "Content Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at CDC Foundation", "Interview Descriptions": "The questions were vague and the interviewer seemed like she didn't want to be on the call. It is hard to answer questions like - how do you approach content management...too vague", "Interview Questions": "What kind of content strategy have you come up with? \r\n(Very vague questions asked) "}, {"date": "13 Aug 2020", "title": "COVID CONTACT TRACER Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at CDC Foundation in Aug 2020", "Interview Descriptions": "Employer was very nice and personable. Employer welcomed communication on my part and was genuinely  interested in my answers. Also, the employer was highly educated and asked many relevant and challenging questions.", "Interview Questions": "What is an example where you lead by example at work.  "}, {"date": "14 Aug 2020", "title": "Hospital Surveillance Epidemiologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at CDC Foundation in Aug 2020", "Interview Descriptions": "I applied online received request for phone interview 3 days later to discuss salary requirement and availability for interview with public health adviser from DHHS  and CDC Foundation.  The questions are very clear and related to the role  interview took about 1 hour.", "Interview Questions": "tell me about your self ?"}, {"date": "21 Sept 2020", "title": "Communicable Disease Investigator CDC Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at CDC Foundation (Honolulu, HI) in Aug 2020", "Interview Descriptions": "Submitted the application and received an email within two business days for a screening phone call. After the screening phone call, interview was scheduled with two weeks. Two people interviewing a candidate and asking questions based working with other people.", "Interview Questions": "How would you handle a difficult supervisor. "}, {"date": "27 Oct 2022", "title": "Microbiologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at CDC Foundation in Aug 2020", "Interview Descriptions": "Very simple and quick. I was asked about my skills and if I was familiar with some of the protocols. I was asked about ten questions, and the position was thoroughly explained to me as well as what the onboarding process would consist of.", "Interview Questions": "Tell us about yourself What are your strongest skills? What are your weaknesses? How would you handle a problem with a coworker?"}, {"date": "13 Jul 2020", "title": "Syndromic Surveillance Epidemiologist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at CDC Foundation", "Interview Descriptions": "I applied online and received a request for a phone interview a few days later. The morning of the interview, the meeting was canceled less than an hour before, very impersonally through a calendar invite cancelation. The reason cited that the job now required more experience. The listing required a Bachelor's degree and I had a Master's degree. Highly unprofessional.", "Interview Questions": "N/A"}, {"date": "3 Sept 2020", "title": "Human Resources Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at CDC Foundation (Atlanta, GA) in Jul 2020", "Interview Descriptions": "I applied in early June, and received an e-mail containing phone interview details about a month later. I completed the phone screening, where everything seemed to go well and was told that we would schedule a Zoom interview for the following week with a director.  However, I never heard back. I followed up twice to set up the meeting and never received a response.", "Interview Questions": "Tell me about your relevant experience"}, {"date": "2 Sept 2020", "title": "Covid-19 Contact Tracer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at CDC Foundation in Jul 2020", "Interview Descriptions": "-Asked situational questions regarding contact tracing. You really have to understand the job role posted and think about what situations you might encounter. \r\n-They do screen for your experience and you have to answer some questions beforehand before you go on with interviewing with the supervisor of your state/county.", "Interview Questions": "1. Describe a situation where you used critical thinking.\r\n2. When contact tracing how would build rapport with the person you're investigating?\r\n3.  Situational\r\n4. How would show empathy in xyz situation? (remember this is a hard time for a lot of people)"}], [{"date": "2 Dec 2018", "title": "Informatics Epidemiologist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at CDC Foundation", "Interview Descriptions": "I applied online and quickly received a phone interview. That was on November 9. Today is December 2 and they have yet to provide any update. Surely, they must know next steps by now so I just find it rude.", "Interview Questions": "Have you worked with mental health data or substance abuse data before?"}, {"date": "17 Dec 2018", "title": "Informatics Epidemiologist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at CDC Foundation (Raleigh, NC) in Nov 2018", "Interview Descriptions": "It is a horrible interview process. I applied online and had one phone interview. It has been over a month now and I'm still waiting to see what the next steps are despite asking them if they could speed up the process since I had another offer on the table.", "Interview Questions": "Do you have experience working with substance abuse or mental health data. "}, {"date": "16 Oct 2018", "title": "Executive Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. The process took 3 months. I interviewed at CDC Foundation (Atlanta, GA) in Jul 2018", "Interview Descriptions": "The interview process spans a few months.  I met with all the C-Suite executives and a few others.  I had a total of 5 interviews (some with more than one person attending).  It was very informative and stoked my interest to be a part of the CDCF team.", "Interview Questions": "Be prepared to describe  your skills and accomplishments in detail.  You will be asked \"What if\"  and \"How would you handle\" questions. "}, {"date": "13 Jun 2017", "title": "Senior Program Officer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at CDC Foundation", "Interview Descriptions": "Multiple steps: 1) phone interview, 2) in-person department interview, 3) in-person cross-departmental interview, 4) extensive background check and reference check. Fairly straightforward process, however some of the practices were very unprofessional (e.g. internal candidate (who eventually got the job) was on my interview panel) and my experience has turned me off applying to any future positions with this organization.", "Interview Questions": "Why are you interested in this position/organization?"}, {"date": "30 Oct 2014", "title": "Communications Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at CDC Foundation (Atlanta, GA)", "Interview Descriptions": "Applied via email, received invitation for phone interview a month later, completed phone interview. Was then asked to submit a writing sample. After submitting, was invited to an in-person interview, with 3 staff. The interview included typical questions (why I'd be a good fit, about my writing experience, my interest in CDC Foundation, etc), as well as a 1-hour writing exercise.", "Interview Questions": "The writing exercise: write a news brief about CDC Foundation's contributions to buying bed nets for World Malaria Day, based on a page of information they provided, and with access to the internet. (They gave me an hour, but it only took about 20 minutes)"}]]