[[{"date": "5 May 2023", "title": "Graphic Designer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Renton Technical College (Renton, WA) in Mar 2023", "Interview Descriptions": "It is in Three parts- phone screening, panel interview with five people via zoom, if selected after this, you go to an in person last interview and tour of the college.", "Interview Questions": "Describe a situation where someone did not agree with the design that you made for them Erin, include how you communicated and made them happy."}, {"date": "16 Jun 2019", "title": "Network Security Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Renton Technical College (Renton, WA) in May 2019", "Interview Descriptions": "applied online, contacted by HR, took about 3 weeks. Was interviewed by 7 people, like do these people not really have anything to do! I've interviewed at amazon and for police departments and this was the toughest interview I've ever been in, for frankly a job that wasn't really that great. The CIO was actually a bit condescending, I got the impression that it may have been a somewhat tense work environment. Most of the questions were skill based, I have some skills that matched the description, but it became obvious that they were actually looking for a CCNA, which you can hire for a much lower wage than what they were advertising.  I was asked to fill out a skills survey, again a first for me ever, I've heard of skills testing but generally hiring managers and HR reps can get a good feel of your background with a skills test or a resume. The CIO seemed a bit obsessed with this survey that didn't really seem relevant to the position.  HR reps were completely professional and very accommodating.", "Interview Questions": "If you are selected, when can you start? Cmon man nobody is falling for that question."}, {"date": "14 Mar 2018", "title": "Reader/Scribe Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Renton Technical College (Seattle, WA) in Mar 2018", "Interview Descriptions": "The first thing I noticed is the campus is stuck in the 90's.  And basically that it needs a makeover. Also, when I asked about hours, I was told that I couldn't been given a firm schedule.  I get that is part time job, but I need work.  Plus, I don't drive and it seems that the commute would not be good and it didn't seem that would pay benefits either.", "Interview Questions": "No questions as the interview was literary 5 mins. "}, {"date": "28 Mar 2019", "title": "IT Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Renton Technical College (Renton, WA) in Jan 2018", "Interview Descriptions": "Really like that professional manner, HR provided detailed guidance for me on the college campus. I was interviewed by 5 people. They also provided a list of questions, it was way much more comfortable to handle the overall interview process with that list.", "Interview Questions": "Explain your background experience on this position."}, {"date": "12 Jan 2018", "title": "Outreach O Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Renton Technical College in Oct 2017", "Interview Descriptions": "I had a five-person panel style interview with questions from each faculty member for initial first round interview, then there was a more informal interview with the department head as well as the supervisor for the second round.", "Interview Questions": "Explain a time when you went above and beyond to help someone."}, {"date": "26 May 2021", "title": "Bookstore Buyer Full Time Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Renton Technical College (Bellevue, WA) in Jun 2017", "Interview Descriptions": "Interview easily arranged by email.  Actual interview was in person with a panel of 6.  It was fairly relaxed and informative, they took turns asking me questions which were the standard interview type you would expect.", "Interview Questions": "My favorite place I have travelled."}, {"date": "22 May 2017", "title": "Instructor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Renton Technical College", "Interview Descriptions": "Video interviewed with six members of the staff. I was asked several rounds of questions. Apparently I was supposed to receive those questions ahead of time, but did not. About a week later I received a call that I was selected for an in-person interview and to await the date and time. I was coming from out of state and they wanted to bring me out one time only. A week went by and no call, so I followed-up with a voicemail. Another week, nothing. About a month later, I received a voicemail about the position I \"interviewed for\" and that they were finalizing their chosen candidate. What a let down.", "Interview Questions": "Teaching scenarios, background"}, {"date": "24 Jun 2021", "title": "Network Engineer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Renton Technical College (Renton, WA) in Feb 2017", "Interview Descriptions": "interview from about 8 people from different department\nHR, Network engineer, security engineer, IT team.\nquestioned about project experience, weakness, 5yr goal,\nand it took about 1-2hours to finish interview and it was pretty difficult interview", "Interview Questions": "Please describe any projects you have done"}, {"date": "5 May 2017", "title": "IT Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied through college or university. I interviewed at Renton Technical College (Renton, WA) in Jul 2016", "Interview Descriptions": "it was really easy and fast interview, the hiring management was so respectful and i really enjoyed it,  my skills was good and was fits the position requirement and I was so confident to answer there questions.", "Interview Questions": "My Skills and availability. "}, {"date": "29 Jan 2016", "title": "Tenure Track Faculty Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 1+ week. I interviewed at Renton Technical College", "Interview Descriptions": "Interview with a panel of 6 people asking about experience and scenario based questions, 15 minute teaching demonstration. Second interview with the president. Questions were asked by each person, related to student behaviors, curriculum and program development as well as simulation experience.", "Interview Questions": "What does diversity mean to you"}], [{"date": "24 Aug 2015", "title": "Position In Information Technology Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Renton Technical College (Renton, WA) in Mar 2015", "Interview Descriptions": "Skype interview, then one on one. No reimbursements of travel were offered. A simple quiz preceded the panel interview, containing several questions that were more of an idiot screen than a true understanding of the potential employee.", "Interview Questions": "Bizarre questions that seemed more aimed at personality than professional experience."}, {"date": "18 Jan 2015", "title": "Lead Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Renton Technical College", "Interview Descriptions": "Initial interview of a panel of three, including 2 student. Used as a learning experience for student on both sides of the interview. If panel approves the applicant is then directed to the hiring manager for final follow up interview and orientation.", "Interview Questions": "Very standard interview questions, meant to be used as learning experience for students on interview panel."}]]