[[{"date": "N/A", "title": "Business Operations Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Children's Healthcare of Atlanta", "Interview Descriptions": "The interview process was very informal, it somewhat felt like I was discussing with a good friend. I felt very comfortable with the interviewer. Majority of the questions were situation-based interview questions. For example, tell me about a time you had difficulty completing a task.", "Interview Questions": "Tell me about a time you faced a challenge and how did you overcome it..."}, {"date": "6 Jul 2023", "title": "Unit Secretary Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Children's Healthcare of Atlanta", "Interview Descriptions": "Panel interview questions were repetitive. Showed you around the facility and let you talk with co workers. Kind of waste of time if you don’t get the job. It’s not even management that’s interviewing you. They have nurses as well", "Interview Questions": "What executive steps have you made and what was the outcome?"}, {"date": "7 Jul 2023", "title": "PCT/CNA Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Children's Healthcare of Atlanta (Atlanta, GA)", "Interview Descriptions": "I remember interviewing for my role and the manager made a weird remark to me saying that if hired to make sure I didn’t have an attitude problem or like drama or to argue and to be positive; just like i was during the interview . I thought that was a very strange remark to make since I was very excited to be there and have always been professional at work. The POC at a different hospital i worked at weren’t surprised when they heard about this occurring during their interview process at all. When I talked about it with non-POC they were extremely surprised and said that’s never happened to them.", "Interview Questions": "One question i was asked was how would you describe yourself."}, {"date": "5 Jul 2023", "title": "Certified Medical Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Children's Healthcare of Atlanta (Chamblee, GA)", "Interview Descriptions": "the interview process was very good. The manager was very nice and made me feel very welcome. i didn't feel intimidated. she made me feel very comfortable and explain the process and answered all my questions.", "Interview Questions": "what was one challenge than you went through and over came?"}, {"date": "5 Jul 2023", "title": "Compensation Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Children's Healthcare of Atlanta", "Interview Descriptions": "Smooth interview. I applied 1 month before I got an email from the recruiter. I had my phone screen and then my in person interview. I had to take an excel assessment. 1 week later, I got a phone call saying I got the job!", "Interview Questions": "They were more personality based questions vs. job questions"}, {"date": "12 Jun 2023", "title": "safety support specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Children's Healthcare of Atlanta (Atlanta, GA) in Jun 2023", "Interview Descriptions": "I had a very straight-forward and incredibly informative interview that left me with a deep sense of admiration for the confident and knowledgeable interviewer. Without a doubt, the atmosphere created during the interview was one that resonated with me, igniting a strong desire within to become a part of the team and work in such a positive and invigorating environment. The entire experience was nothing short of exceptional, providing valuable insights and leaving a lasting impression that affirmed my eagerness to be a part of this incredible opportunity.", "Interview Questions": "Experience within the medical environment"}, {"date": "22 May 2023", "title": "Nurse Residency Program Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Children's Healthcare of Atlanta (Atlanta, GA)", "Interview Descriptions": "Video recording answering 4-5 questions, where you have 3 chances to record yourself. Then you will be interviewed by a recruiter if they like your responses and resume. Lastly, interview with unit managers and shadowing.", "Interview Questions": "Why do you want to become a nurse? What specialties are you interested in and why?"}, {"date": "20 Jun 2023", "title": "Analytic Developer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Children's Healthcare of Atlanta (Atlanta, GA) in May 2023", "Interview Descriptions": "Had the phone screen in 10 mins with the recruiter. Then, I received interview schedule in same week. The interview was an hour with 2 people. The conversation was nice. They asked a lot about the previous projects and experiences, some simple technical questions about coding . They informed the last round which will be in-person interview with technical exams.", "Interview Questions": "Describe your previous project which is the most interesting to you."}, {"date": "1 Mar 2023", "title": "Business Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Children's Healthcare of Atlanta", "Interview Descriptions": "Normal interview, one interviewee asks pointed / situational questions where they want you to answer in STAR format. Other interviews were normal format, no hard / different questions. Did not get a response back after my interview", "Interview Questions": "What is a recent challenge you faced and how did you overcome it."}, {"date": "4 May 2023", "title": "Communications Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Children's Healthcare of Atlanta (Atlanta, GA) in Mar 2023", "Interview Descriptions": "The initial interview was virtual (led by two people) and very typical for the type of position. They dove into past work and qualifications as well as their vision for the role. The second interview was in-person and involved a timed writing test. They gave roughly 45 minutes to complete two prompts.", "Interview Questions": "Q: Tell us about the specific types of communications you have experience writing."}], [{"date": "25 Jan 2023", "title": "Nurse Residency Program Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Children's Healthcare of Atlanta (Atlanta, GA) in Jan 2023", "Interview Descriptions": "Video interview after you apply then phone screening with a recruiter to talk about your interest, why did you pick nursing and about the residency program, then you shadow and interview with your unit. Situational based interview questions", "Interview Questions": "Tell me about how you handled conflict"}, {"date": "25 Jan 2023", "title": "Patient Access Representative Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Children's Healthcare of Atlanta (Atlanta, GA) in Jan 2023", "Interview Descriptions": "Good, fair questions were asked. Many concerning previous work experience. Posititve environment. Role was described thoroughly and the tour of the facility was informative. Everyone was eager and displayed a positive attitude. Teamwork was encouraged.", "Interview Questions": "How to deal with difficult employees?"}, {"date": "13 Dec 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Children's Healthcare of Atlanta", "Interview Descriptions": "Great! Once I talked to a recruiter, it was a seamless process to an online Webex interview where I spoke with an assistant nurse manager and a manager. The interview was short as I am a re-hire for the company", "Interview Questions": "Tell me about a time where you made a mistake"}, {"date": "2 Dec 2022", "title": "Patient Registrar Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Children's Healthcare of Atlanta (Atlanta, GA) in Dec 2022", "Interview Descriptions": "Smooth sailing. The interviewer was very laid back making the interview process seamless. I answered all questions promptly and effectively. I was also able to prepare efficiently prior to my interview. Anyone having an upcoming interview with CHOA, Good luck and wishing you all the best!", "Interview Questions": "What made you decide to apply to CHOA?"}, {"date": "3 Nov 2022", "title": "Registered Nurse Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Children's Healthcare of Atlanta", "Interview Descriptions": "After submission of application, I was emailed to have a video interview and then was followed up with a phone call and offer for an in-person interview on the unit.", "Interview Questions": "Why do you want to work at CHOA?"}, {"date": "29 Oct 2022", "title": "Nurse Resident Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Children's Healthcare of Atlanta", "Interview Descriptions": "Behavioral health questions and shadowing afterwards. The interviewers were really nice and it was a casual interview. Overall great experience and nice hospital and staff. Would recommend working here. Nurses were young and since it’s a teaching hospital there is a lot to learn.", "Interview Questions": "Why do you want to be a nurse."}, {"date": "26 Oct 2022", "title": "PCT Patient Care Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Children's Healthcare of Atlanta", "Interview Descriptions": "Great process to get an interview they are very friendly understanding and makes it well worth your time and appreciate the work and position that you are offered I am delighted and over exstatic to be offered a interview here I have been trying for so long to get a position here at this hospital I love it I love kids and I’m glad that I can make a differe", "Interview Questions": "Basics questions and just knowing what to do"}, {"date": "29 Oct 2022", "title": "Patient Safety Attendant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Children's Healthcare of Atlanta (Atlanta, GA) in Oct 2022", "Interview Descriptions": "Interview process was very easy. It didn’t last a long time, but they continued to ask if I had any questions in between their explanation of the job, which I appreciated.", "Interview Questions": "What experience do I have with kids dealing with mental health concerns."}, {"date": "6 Sept 2022", "title": "Scheduler Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Children's Healthcare of Atlanta", "Interview Descriptions": "I was first contacted to do a phone interview where I had to answer a series of questions. After that, I was scheduled for an in-person interview with the department manager.", "Interview Questions": "Why do you want to work for Children’s?"}, {"date": "26 Aug 2022", "title": "Pediatrician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Children's Healthcare of Atlanta", "Interview Descriptions": "Interview through recruiter and through the team. After interviewing with the team you meet the staff and explore the facility. The interview process is thorough and smooth.  The recruiter talks to you through most of the process.", "Interview Questions": "Why are you interested in working at Children's Healthcare of Atlanta"}], [{"date": "23 Aug 2022", "title": "NICU RN Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Children's Healthcare of Atlanta", "Interview Descriptions": "It was a 1 hour + 2 hour shadow.  Questions were all situational - none of the \"Tell me about yourself...\"\nIt was more \"tell me about a time when ____\" with questions having varying difficulties. They make you feel comfortable & schedule at a time that works for you.", "Interview Questions": "Tell me about the last time you went through a high pressure situation."}, {"date": "3 Aug 2022", "title": "Patient Care Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Children's Healthcare of Atlanta (Atlanta, GA)", "Interview Descriptions": "I was asked several behavioral questions, for which I used the STAR method to answer them. I was also asked about my past experience, and I could tell they reviewed my resume because they asked questions about my experience and how to apply it to my current position. \n\nThe interview was a total of 15-20 min", "Interview Questions": "Tell me about a time you disagreed with a nurse. How did you navigate that conversation? "}, {"date": "25 Jul 2022", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Children's Healthcare of Atlanta", "Interview Descriptions": "Videoing self answering questions, recruiter phone call, 1 1/2 hour interview and 2 hrs of shadowing on the unit. \nWas interviewed by the nurse educator and the unit manager. Lots of questions about tell us a time that such and such happened and how you responded.", "Interview Questions": "Tell us about a time you spoke up about something wrong that was going on? "}, {"date": "13 Jul 2022", "title": "Registration Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Children's Healthcare of Atlanta (Alpharetta, GA)", "Interview Descriptions": "Fairly easy. Applied for position on a saturday. Heard from recruiter on tuesday. Interviewed that Wednesday. Spoke with recruiter first then interview to discuss role and schedule in person interview. Next I interviewed with department leader. Job was offered the same day.", "Interview Questions": "Describe  your work style, why this company, what are your personal interest "}, {"date": "22 Aug 2022", "title": "Research Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Children's Healthcare of Atlanta (Atlanta, GA) in Jul 2022", "Interview Descriptions": "It was a panel interview with 4 managers that lasted about an hour. Was an overall easy interview and all of the interviewers were super nice and really easy to talk to.", "Interview Questions": "From prior experience, how did you quickly communicate something to do with research to a physician or a clinical personnel?"}, {"date": "29 Jun 2022", "title": "Patient Care Technician Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Children's Healthcare of Atlanta", "Interview Descriptions": "It was a phone interview screening applicants to see if you have credentials you may need.. Than a  Video interview. Asked scenario based questions. Maybe like 8 questions. Then went over the next steps.", "Interview Questions": "How do you handle difficult situations. "}, {"date": "15 Jun 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Children's Healthcare of Atlanta", "Interview Descriptions": "Around two or three managers interview you. Ask typical scenario questions “tell me a time when..” “how did you handle” not to intense. Not a bad interview, no need to stress.", "Interview Questions": "Where do you see yourself in 5 years "}, {"date": "4 Jun 2022", "title": "Patient Safety Sitter Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Children's Healthcare of Atlanta", "Interview Descriptions": "The interview was amazing, everything was very straight foward. The recruiter and the person who interviewed did wonderful. I really enjoyed it. Very helpful i enjoyed it. Awesome lit good vibes", "Interview Questions": "What do you like about this position."}, {"date": "7 Sept 2022", "title": "Registered Respiratory Therapist (RRT) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Children's Healthcare of Atlanta (Atlanta, GA) in Jun 2022", "Interview Descriptions": "Zoom call with all managers/ supervisors, and clinical educators. Pretty simple, webcam must be on but theirs is not. Pretty straight forward. Series of questions asked.  You will most likely know if you got the job by the end of the interview", "Interview Questions": "Describe how an asthmatic patient would present "}, {"date": "23 Sept 2022", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Children's Healthcare of Atlanta (Atlanta, GA) in May 2022", "Interview Descriptions": "it was on zoom, everyone was friendly, and it was also brief. I had time to answer their questions, but also had time to ask them questions as well. Overall, great experience. ", "Interview Questions": "How to handle a problem-which they provided"}], [{"date": "31 Dec 2021", "title": "Scheduler Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 4 weeks. I interviewed at Children's Healthcare of Atlanta (Atlanta, GA)", "Interview Descriptions": "Applied online, spoke with recruiter, interviewed. Interview was easy: offered the job but declined due to incredibly low offer. They only wanted to use my professional experience that was in the healthcare industry only.", "Interview Questions": "They use the star method "}, {"date": "11 Jan 2022", "title": "2022 Nurse Extern Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Children's Healthcare of Atlanta (Atlanta, GA) in Jan 2022", "Interview Descriptions": "hire vue, was simplistic and easy to understand, questions were not over the top difficult and were easy to understand, able to show personality through videos. Asked preferences for units, why you want to be a nurse, why choa,", "Interview Questions": "why do you want to be a nurse"}, {"date": "4 Feb 2022", "title": "Registration Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Children's Healthcare of Atlanta (Duluth, GA) in Jan 2022", "Interview Descriptions": "I spoke with the employer for about 45 minutes about the job and what I’ve done in the past. Only about 10 minutes were spent talking about questions related to what I would contribute to the company.", "Interview Questions": "How would you respond to an upset patient?"}, {"date": "21 Dec 2021", "title": "Summer Nurse Extern Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Children's Healthcare of Atlanta (Atlanta, GA) in Dec 2021", "Interview Descriptions": "I received an email with a link to complete a video interview after turning in an online application.  They give you a few practice questions to get used to the formatting, time limit, and overall technology which was very useful.", "Interview Questions": "What makes you a unique candidate? "}, {"date": "22 Nov 2021", "title": "Family Experience Liaison Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Children's Healthcare of Atlanta", "Interview Descriptions": "I had to interview with 3 different people not including initial screen interview the last interview was where I shadowed for a day and then talked with three of the providers I would be working beside.", "Interview Questions": "How would I handle emotionally the difficult aspects of the job "}, {"date": "21 Oct 2021", "title": "Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Children's Healthcare of Atlanta", "Interview Descriptions": "Great. Virtual. Question straight forward. Waiting on call back. Been a week. 30 seconds prep. 1 minute answering. 9 questions. Got email about three days after applying. Quick application process. Uploaded resume. Good luck", "Interview Questions": "Why Children’s healthcare of Atlanta?"}, {"date": "2 Oct 2021", "title": "Lead Research Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Children's Healthcare of Atlanta", "Interview Descriptions": "A series of interviews with clinical and nonclinical stakeholders. Initial interview was with the hiring manager and utilized the STAR (Situation - Task - Action - Result) method for behavioral interviewing", "Interview Questions": "Share a time you supported a team member that was struggling."}, {"date": "3 Nov 2021", "title": "Paramedic Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Children's Healthcare of Atlanta (Atlanta, GA) in Oct 2021", "Interview Descriptions": "It was a very good experience. I loved every minute of it. It’s a very welcoming environment. Friendly staff, they explain everything well. I would have to say this was the best interview process I have ever been apart of. They get a 10/10.", "Interview Questions": "Easy to answer, they make sure they are hiring qualified people "}, {"date": "28 Sept 2021", "title": "RBT - Registered Behavior Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Children's Healthcare of Atlanta", "Interview Descriptions": "Virtual and in person interview. The tour/in person interview gives you a very good perspective of what to expect when working at the facility.  The place allows you to speak with other staff members to also get their \r\nperspective and experience working there.", "Interview Questions": "How do you work in team settings?"}, {"date": "27 Sept 2021", "title": "Patient Access Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Children's Healthcare of Atlanta", "Interview Descriptions": "There’s two rounds of interview. First round is a phone interview where an operator will ask you 10 questions. Once those questions are answered, if the recruiter sees an interest in you then they will submit it to the hiring manager of the location you’re interested and will be interviewed again which is the second round. Shortly after the second interview you’re recruiter will reach out to you within 1-3 weeks about a decision or simply look after the results in the profile section in CHOA Careers page.", "Interview Questions": "What made you choose CHOA?"}], [{"date": "23 Sept 2021", "title": "Research Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Children's Healthcare of Atlanta", "Interview Descriptions": "I think overall the interview questions were straight to the point. The questions asked were basic behavioral questions. I was at ease answering the questions. I had three interviewers the clinical research lead and the PI.", "Interview Questions": "what is your long term goal"}, {"date": "9 Sept 2021", "title": "New Grad RN Residency Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Children's Healthcare of Atlanta (Atlanta, GA) in Sept 2021", "Interview Descriptions": "Applied online to the new grad RN program. The following day, I received an email from HireVue, a virtual interviewing platform. I recorded myself answering some basic interview questions (walk me through your resume; why CHOA?). The day after that, I received an email from a recruiter who asked to set up a time to speak on the phone. She asked my what units I want to work on and why. She sent my resume to the unit director who decided she wanted to meet with me. The recruiter and I then scheduled an in-person interview as well as a 2-3 hour shadowing experience on the unit. The entire process took almost 1 month.", "Interview Questions": "(1) Describe a time you made a mistake,\n(2) Describe a time you experienced a high-stress situation,\n(3) Who are you outside of your professional life?\n(4) What are your short-term and long-term goals?\n(5) Describe a time where you saw a patient who had a diagnosis you've never heard of before. How did you go about learning about this diagnosis?"}, {"date": "13 Nov 2021", "title": "Investment Operations Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Children's Healthcare of Atlanta in Sept 2021", "Interview Descriptions": "The process went well until I provided references.  I was told that my references did not have enough specific examples of my work and I came to find out that at least one of the three references wasn’t even contacted.", "Interview Questions": "What are three adjectives to describe you? "}, {"date": "14 Mar 2022", "title": "Regsistered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Children's Healthcare of Atlanta in Sept 2021", "Interview Descriptions": "Applied online, got hirevue link within a day after applying, email and phone call sent within a week to set up in person interview. Very chill questions. Interview with multiple managers and get to shadow for an hour after.", "Interview Questions": "What are your Strengths and weaknesses "}, {"date": "29 Sept 2021", "title": "Patient Care Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Children's Healthcare of Atlanta (Atlanta, GA) in Sept 2021", "Interview Descriptions": "The entire process from asking me to interview and from when I got interviewed has taken a month so far. I have not received an offer yet but fingers crossed.", "Interview Questions": "describe a time with a difficult coworker\nWhy CHOA"}, {"date": "12 Aug 2021", "title": "New Grad Nurse Residency Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Children's Healthcare of Atlanta in Aug 2021", "Interview Descriptions": "First Round Virtual HireVue Interview. Question prompts given with 30 seconds of prep time before it recorded you for 3 minutes. Both 30 sec prep time and 3 min answer time could be overridden and cut short as wanted.", "Interview Questions": "Why Children's?\nWhat made you want to go into nursing?\n"}, {"date": "12 Aug 2021", "title": "Radiologic Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Children's Healthcare of Atlanta (Atlanta, GA) in Aug 2021", "Interview Descriptions": "The interview was pleasant. There were 2 people conducting the interview. They asked situation questions, like what would you do in certain situations. Overall I had a good experience. The interview lasted about 30 mins.", "Interview Questions": "Have you had a past situation where you had conflict with a superior and how did you handle it. "}, {"date": "11 Jul 2022", "title": "Wellness Screener Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Children's Healthcare of Atlanta (Atlanta, GA) in Jul 2021", "Interview Descriptions": "First you have to introduce yourself then the interviewer asks questions and listens to your response.Interview went really well and smooth. Interviewer made me feel comfortable.  Easy questions asked during the interview . Just be yourself  Interview process was quick.", "Interview Questions": "What made you interest working for children's?"}, {"date": "5 Aug 2022", "title": "Social Worker Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 days. I interviewed at Children's Healthcare of Atlanta in Jul 2021", "Interview Descriptions": "Informational interview discussed the job role. I was called by the head of the department. I felt pretty unprepared and did not realize that I had been given an informal interview.", "Interview Questions": "They asked me about relocation, what the role involved and my experience. "}, {"date": "25 Jun 2021", "title": "Registration Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Children's Healthcare of Atlanta (Atlanta, GA) in Jun 2021", "Interview Descriptions": "I was contacted by the department manager for an interview after speaking with a CHOA recruiter via phone. The interview was quite informative and asked a lot of questions regarding scenarios and examples from previous work history.", "Interview Questions": "How did you handle conflict with a difficult coworker?"}], [{"date": "14 May 2021", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Children's Healthcare of Atlanta", "Interview Descriptions": "Online, film yourself answering questions such as greatest strengths, weaknesses, Etc. Kind of awkward to film oneself with no one on other side but not terrible. Friendly people but I did not, unfortunately receive the job", "Interview Questions": "What are your greatest strengths"}, {"date": "27 Apr 2021", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Children's Healthcare of Atlanta", "Interview Descriptions": "The process wasn't complicated but with the increase in competition it may take some time to truly get a call back or interview. Be open and bubbly in the interview!", "Interview Questions": "How do I see children as the focal point of my care that I will give?"}, {"date": "23 Apr 2021", "title": "New Graduate RN Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Children's Healthcare of Atlanta", "Interview Descriptions": "I did a Hirevue interview first and then I was called and offered an in-person interview. The in-person interview was an hour long and then I did a 2 hour unit shadow with a few of the nurses.", "Interview Questions": "Tell us about a time you made a mistake."}, {"date": "24 Apr 2021", "title": "Maintenance Technician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Children's Healthcare of Atlanta", "Interview Descriptions": "Round table style interview with multiple supervisors and upper management laid back and very open atmosphere. They asked general knowledge questions then questions about me past experiences and my goals for the position I applied for.", "Interview Questions": "What approach would I take to handle work place productivity issues "}, {"date": "16 Mar 2021", "title": "Licensed Clinical Social Worker LCSW Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 6 days. I interviewed at Children's Healthcare of Atlanta (Seward, NE)", "Interview Descriptions": "Applied on a Friday, was contacted by a recruiter that following Monday to get more background on my experience and what kind of schedule I would like. 2 days later got a call from  another recruiter to set up an interview for Friday. Interview went well, lasted about an hour. It was done over web Ex, had som tech issues at first, but we figured it out quickly", "Interview Questions": "How do you stay organized to meet deadlines."}, {"date": "7 Mar 2021", "title": "Clinical Nurse II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Children's Healthcare of Atlanta", "Interview Descriptions": "It takes a while to get into CHOA.  First, there’s a phone screening with HR.  Then, there was a phone interview with the hiring manager, and a final interview in person.", "Interview Questions": "Where do you see yourself in 5 years. "}, {"date": "5 Mar 2021", "title": "Public Relations Intern Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Children's Healthcare of Atlanta", "Interview Descriptions": "The interview process was fantastic, with a knowledgable recruiter who showed real care for getting to know me as a person and a candidate. They are very value-based and intentional.", "Interview Questions": "Tell me about a time you were challenged. What did you do?"}, {"date": "6 Oct 2021", "title": "Patient Care Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. I interviewed at Children's Healthcare of Atlanta in Mar 2021", "Interview Descriptions": "Lots of steps during the interview process, but worth it if you want to be hired as an RN after nursing school. Make sure you have good references, be sure to highlight your attributes, and be very enthusiastic!", "Interview Questions": "Be prepared to answer situational questions or recall incidents where you went above and beyond or made a mistake and learned from it - things like that. "}, {"date": "6 Jul 2021", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 days. I interviewed at Children's Healthcare of Atlanta (Atlanta, GA) in Mar 2021", "Interview Descriptions": "I was called by a recruiter to discuss the job and my qualifications. Then I was invited to shadow and interview in person at Egleston. Everyone makes you feel so welcome, which makes it harder when you don't get the position.", "Interview Questions": "Why Children's?\nGive an example of a time you had to de-escalate a situation. \nWhat was your most difficult patient?"}, {"date": "22 Feb 2021", "title": "Nurse Residency Program Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Children's Healthcare of Atlanta", "Interview Descriptions": "The first interview was all online and you are video taped. There is no way you are actually speaking with.  The interview gives you 30 seconds to read a question and then 2 minutes to answer.", "Interview Questions": "Explain a situation where you had to stand up to a superior? "}], [{"date": "8 Feb 2021", "title": "Marketing Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Children's Healthcare of Atlanta", "Interview Descriptions": "The interview process was organized and communicated well. I always felt like I was in the loop with the status of my application and next steps, and the steps moved quickly after I was contacted for a first interview.", "Interview Questions": "The usual questions: 5-year plan, previous experience, why you're suited for this role, etc.?"}, {"date": "1 Feb 2021", "title": "Executive Director Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Children's Healthcare of Atlanta", "Interview Descriptions": "Fairly simple! I did one interview with the manager of the floor as well as a another employee I believe a clinical educator.  It was followed by a shadowing experience with another employee for a few hours.", "Interview Questions": "Why did you pick children’s? "}, {"date": "21 Jul 2021", "title": "Project Coordinator Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Children's Healthcare of Atlanta in Feb 2021", "Interview Descriptions": "A recruiter called me the day after I submitted my resume and seemed like they were very interested. They told me the salary on the initial call which I appreciated. I met with the program manager about 1.5 weeks later, did a second interview the next week and a third the week after. It took over a week to hear back after that last interview, but ultimately I took another position. Interview process was standard.", "Interview Questions": "Why do you want to work at CHOA"}, {"date": "10 Feb 2021", "title": "NICU RN Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Children's Healthcare of Atlanta (Atlanta, GA) in Feb 2021", "Interview Descriptions": "So far it’s been wonderful. Recruiter, nurse manager and staff we so sincere, informative and nice! I had my interview yesterday and am waiting to hear back. Checking my email every five minutes!", "Interview Questions": "Personal and work experience related "}, {"date": "3 Feb 2021", "title": "Recruiting Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Children's Healthcare of Atlanta in Feb 2021", "Interview Descriptions": "The manager called to verify where I lived and once she realized I didn't live in Atlanta she told me they were no longer interested because the job would be starting in two weeks and that's not enough time to move there. They could definitely use some unconscious bias training! I expect more from a manager.", "Interview Questions": "She only asked questions about the city I lived in. She didn't ask any questions about my experience."}, {"date": "10 Jun 2021", "title": "Public Relations Intern Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Children's Healthcare of Atlanta (Atlanta, GA) in Feb 2021", "Interview Descriptions": "They were very kind. They walked me through every step. The building was beautiful. They seem to be a tight knit team. I had several interviews over the phone first.", "Interview Questions": "Why are you interested in CHOA?"}, {"date": "18 Jan 2021", "title": "Nurse Residency Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Children's Healthcare of Atlanta", "Interview Descriptions": "Fairly easy. It was an online interview. Questions were challenging . I had to answer both video questions and had some written questions. I haven’t heard back yet status still says under review", "Interview Questions": "Why do you want to work at children’s hospital of Atlanta "}, {"date": "12 Jan 2021", "title": "Pcs Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Children's Healthcare of Atlanta", "Interview Descriptions": "If they really want to hire you..you will hear back fairly soon. It is important to let them know something that separates you from the other applicants. Something unique that could apply to how you would work better with children.", "Interview Questions": "When have you been in a difficult situation and how did you resolve it? "}, {"date": "4 Jan 2021", "title": "Scheduler Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Children's Healthcare of Atlanta", "Interview Descriptions": "The interview process took a few weeks like 2 weeks at the most. It was pretty smooth within the two weeks I would call to hear the status of my interview.", "Interview Questions": "Q: What would be most important to do first if there’s a high call volume & a ton of emails you’ll need to respond to "}, {"date": "18 Jul 2021", "title": "New Grad RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 2 weeks. I interviewed at Children's Healthcare of Atlanta (Tampa, FL) in Jan 2021", "Interview Descriptions": "The first interview was on HireVue where you are prompted with a question and have 30 seconds to think of an answer before you have to record your answer. You only have 1 try to record your answer and have around 2 minutes worth of time to record your answer. Kinda nerve racking but wasn’t too bad. I got an email not too long after I finished that part until I got a call from a recruiter who wanted to see what my interests were. \n\nFollowing that someone from the unit called me to schedule another interview, which was virtual because of COVID. Really good interview. Took about 45 minutes. Got an offer the next day and accepted", "Interview Questions": "Tell me a time where you had to be resilient"}], [{"date": "23 Dec 2020", "title": "Nurse Residency Program Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Children's Healthcare of Atlanta", "Interview Descriptions": "I applied on Children's Healthcare of Atlanta's website and got an email 3 weeks later for an interview through Hirevue. I haven't heard back from them yet. Hopefully I will know something soon.", "Interview Questions": "Why do I want to work at CHOA?"}, {"date": "30 Aug 2022", "title": "Sterile Processing Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Children's Healthcare of Atlanta (Atlanta, GA) in Jan 2021", "Interview Descriptions": "They will ask you to put together a minor tray from the count sheet. They make ask questions about the Sterilization method and if you are familiar with the case carts.", "Interview Questions": "What's the average temp for the steam sterilizer."}, {"date": "9 Mar 2021", "title": "Nurse Resident Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Children's Healthcare of Atlanta (Atlanta, GA) in Jan 2021", "Interview Descriptions": "The virtual interview included a computer screen asking 10 questions. The interviewee recorded herself/himself answering each question. There was no interviewer. It was difficult to feel confident about the interview since there was no person responding to you.  However, it was less intimidating than a normal interview since you are only speaking to a computer screen.", "Interview Questions": "Name a time when you went above and beyond for a patient. "}, {"date": "15 Feb 2021", "title": "Nurse Extern Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Children's Healthcare of Atlanta (Atlanta, GA) in Dec 2020", "Interview Descriptions": "It was an online interview with the app HireVue. It was easy questions. Your basically being recorded in your interview and then when you finish the recording gets sent to the employer.", "Interview Questions": "Why do you want to be a nurse?\nTell us a time you went beyond and above for a patient?"}, {"date": "17 Jan 2021", "title": "Summer Nurse Extern Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Children's Healthcare of Atlanta in Dec 2020", "Interview Descriptions": "The interview was through HireVue app. It was easy interview because no one is physically asking you questions. They show to question then you record your response.  I had my interview in December and still waiting to hear from them.", "Interview Questions": "Why do you want to be a nurse? "}, {"date": "16 Jun 2021", "title": "Patient Care Technician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Children's Healthcare of Atlanta in Dec 2020", "Interview Descriptions": "You have to do a virtual interview first where you answer questions on a video. It definitely feels weird but it’s not too bad. Questions were broad like why CHOA? why this unit?", "Interview Questions": "What made you chose this unit? "}, {"date": "30 Nov 2020", "title": "Team Member Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Children's Healthcare of Atlanta", "Interview Descriptions": "Easy. Normal interview questions. \r\nNothing hard. Interview was fast. Needed to state more actual events than anything.\r\nWould suggest for people to look into their website to have a better understanding of what needs to be done", "Interview Questions": "Why should we select you?"}, {"date": "4 Nov 2020", "title": "Patient Care Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Children's Healthcare of Atlanta (Atlanta, GA)", "Interview Descriptions": "I applied for  PRN PCT job and it's been a fairly long process. I applied a little over a month ago and received a call last week to set up an in-person interview (included shadow experience). It has been somewhat difficult to get any information, but their online job portal can keep you updated. Overall, a good experience.", "Interview Questions": "Describe a time you had a conflict with a colleague and how it was resolved.\nYou have a long list of things to do. How do you prioritize your day?"}, {"date": "2 Jun 2021", "title": "PSS Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Children's Healthcare of Atlanta in Nov 2020", "Interview Descriptions": "Video screening, super easy to navigate, was able to see myself and the question I was answering at the same time. Competitive in that it didn't let me change or edit my video once it was taken, but several practice takes were available", "Interview Questions": "Tell us about a problem you faced in your current job and how you managed it "}, {"date": "9 Oct 2020", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Children's Healthcare of Atlanta", "Interview Descriptions": "The first interview was with HireVue. I thought it was a little more difficult due to not actually having a conversation with somebody. It was ten questions, two of them were written.", "Interview Questions": "When was a time you had to speak up?"}], [{"date": "8 Oct 2020", "title": "PCT/CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Children's Healthcare of Atlanta", "Interview Descriptions": "It was easy.  Pre-corona so it was in person. The interviewer was nice. I got the job. jioho joihojo  pjjpoij ijpi  jihil jpjp ji jljio  j;kj p jpho jijp p khjl,p", "Interview Questions": "what are your strenghts and weaknesses?"}, {"date": "26 Oct 2020", "title": "Registration Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Children's Healthcare of Atlanta (Alpharetta, GA) in Oct 2020", "Interview Descriptions": "Registration traveler Prn position. Travel to different locations and gather patient information. I was interested in this position because it reminds me of consulting and that’s what I truly want to do after my MBA.", "Interview Questions": "How would you prioritize your work load."}, {"date": "29 Sept 2020", "title": "Special Assistant to the Chief Executive Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Children's Healthcare of Atlanta", "Interview Descriptions": "I was referred to CHOA by a recruiting/placement firm. I met with several individuals on 3 occasions prior to being interviewed by the person to whom I would report. I was told by one interviewer that there was definitely a role for me at CHOA, that they were working to find the right fit for me.", "Interview Questions": "Tell me about what you consider a weakness and how you deal with it."}, {"date": "18 Sept 2020", "title": "Registered Respiratory Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Children's Healthcare of Atlanta", "Interview Descriptions": "An hr recruiter called to schedule an interview. After I interviewed with her she sent my resume to the RT managers. Then about a week later I got contacted for a web interview.", "Interview Questions": "When was a time you felt you made a mistake and how did you correct it."}, {"date": "22 Oct 2021", "title": "Practice Operations Supervisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 6 weeks. I interviewed at Children's Healthcare of Atlanta (Atlanta, GA) in Sept 2020", "Interview Descriptions": "Be prepared for at least two interviews. They are typically panel interviews consisting of those in management/leadership and Human Resources. Also, depending on the position, it is possible to have to meet the head of the respective practice.", "Interview Questions": "What is your 5 year goal?"}, {"date": "18 Aug 2020", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Children's Healthcare of Atlanta", "Interview Descriptions": "CHOA uses Targeted Selection for interviews. It encourages specific examples. I think it can be too rigid when finding someone to hire, and it can be exhausting for the candidate. Especially when being interviewed by multiple people.", "Interview Questions": "Tell me about a specific time a project didn’t go as expected. How did you handle it? What was the outcome?"}, {"date": "11 Aug 2020", "title": "Lab Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Children's Healthcare of Atlanta", "Interview Descriptions": "2 rounds, online video questionnaire the in person interview if pass first round. Must dress professionally. talk clear and quite area. One on One you are interviewed my the supervisor and the  manager. Bring multiple copies of resume.", "Interview Questions": "tell us the what you think is most important when working in healthcare"}, {"date": "2 Jul 2021", "title": "Feeding Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Children's Healthcare of Atlanta (Atlanta, GA) in May 2020", "Interview Descriptions": "The interview itself was professional and they made sure to make you feel comfortable. Before starting the Interview I got a tour of the unit. I got to ask questions and got to know what they did before starting the question part of the interview. Overall wry professional and friendly", "Interview Questions": "They were very detailed questions. "}, {"date": "9 Oct 2022", "title": "EMR Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Children's Healthcare of Atlanta in May 2020", "Interview Descriptions": "The interview process is pretty straightforward. Being that there is no tech experience needed for the job a lot of the questions is about you work ethic and dependability. The supervisor also take you on a tour.", "Interview Questions": "Where are your long term goals? How you feel this position will contribute to those goals?"}, {"date": "21 Apr 2020", "title": "Student Nurse Extern Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Children's Healthcare of Atlanta", "Interview Descriptions": "I applied and received an invitation to complete a virtual interview. After completing the virtual interview, I was emailed about setting up a phone interview with my desired department. I completed the phone interview, but had not unperson interview or shadowing experience.", "Interview Questions": "The interview wast mostly behavioral with questions such as \"tell me about a time you...\". It focused on scenarios about time management, conflict resolution, and patient experience."}], [{"date": "30 Nov 2020", "title": "Buyer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Children's Healthcare of Atlanta (Atlanta, GA) in Apr 2020", "Interview Descriptions": "First you are contacted by the recruiter, and if that goes well you are called in for and in person interview with 2 different groups. All questions are “ tell me about time”", "Interview Questions": " All questions are “ tell me about time”"}, {"date": "11 Mar 2020", "title": "Nursing Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Children's Healthcare of Atlanta", "Interview Descriptions": "Contacted me 2 days after applied for phone call. Then called to set up an interview a few days after that. Went in for in person interview and shadowed", "Interview Questions": "Why I wanted to work for CHOA"}, {"date": "24 Aug 2020", "title": "Pediatric Occupational Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Children's Healthcare of Atlanta (Atlanta, GA) in Mar 2020", "Interview Descriptions": "My interview consisted of meeting with 2-3 occupational therapists, a written/multichoice exam, and questions from current staff members. Each staff member gave their background and asked for mine as well.", "Interview Questions": "Tell us a time where you had conflict with a co-worker"}, {"date": "9 Feb 2020", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Children's Healthcare of Atlanta in Feb 2020", "Interview Descriptions": "I applied on a Saturday. A representative from HR called me on Monday to set up a time to talk. I spoke with her regarding my resume and what I was looking for in a job on Wednesday. I interviewed with my department management on Friday and was offered the job later that day. The entire process took less than a week and was probably the most smooth application and interview process that I have ever been through to date in my career.", "Interview Questions": "Describe a time when you were faced with an overwhelming work situation and how did you overcome it?"}, {"date": "14 Feb 2020", "title": "Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Children's Healthcare of Atlanta (Atlanta, GA) in Feb 2020", "Interview Descriptions": "First you are contacted by the recruiter, and if that goes well you are called in for and in person interview.  All questions are “ tell me about time”", "Interview Questions": "Behavioral interview"}, {"date": "1 Feb 2020", "title": "Registered Behavior Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Children's Healthcare of Atlanta", "Interview Descriptions": "I applied online via Choa website. I was received and email invitation for online interview, through hirevue. A few days later I was asked to come in for an in person  interview", "Interview Questions": "What challenges did you face in a workplace and how did you overcome them? "}, {"date": "3 Jan 2020", "title": "Nurse Residency Program Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Children's Healthcare of Atlanta (Atlanta, GA)", "Interview Descriptions": "They do a multiple step interview, so you do an online/ recorded interview, then you will receive a phone call from a recruiter to have an in person interview", "Interview Questions": "Explain a time you and a coworker did not see eye to eye, what did you do to handle that situation? "}, {"date": "3 Jan 2020", "title": "Unit Secretary Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Children's Healthcare of Atlanta", "Interview Descriptions": "I submitted a resume through a reference that I personally know in the department I was applying to work in. I was contacted by email and I sat for an in-person interview  with 2 interviewers which lasted approximately 45 minutes.", "Interview Questions": "They asked many thorough questions that primarily pertained to conflict resolution and working with a team. They asked for many examples of times when I successfully performed conflict resolution or teamwork.  "}, {"date": "30 Sept 2022", "title": "Medical Coder Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Children's Healthcare of Atlanta (Atlanta, GA) in Jan 2020", "Interview Descriptions": "Very good, be prepared to answer coding questions and prepare for the interview. Think positive and do your best. They ask the typical interview questions along with coding questions.  You may do a phone interview before the real interview to know if you will make it to the next level", "Interview Questions": "What are modifiers used for "}, {"date": "27 Dec 2020", "title": "Clincal Research Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Children's Healthcare of Atlanta (Atlanta, GA) in Jan 2020", "Interview Descriptions": "Interviewed at 2 different locations. Scottish Rite and Egleston. Asked various questions about my background, why CHOA, and more detailed questions regarding databases. The interview was very nice and the team seemed amazing. Between both campuses the questions seemed the same. I even had the chance to speak with Doc I could potentially work with.", "Interview Questions": "What databases have you worked in for clinical data? "}], [{"date": "7 Dec 2020", "title": "Summer Nurse Extern Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Children's Healthcare of Atlanta (Atlanta, GA) in Jan 2020", "Interview Descriptions": "The interview process was kind of drawn out. About a week after submitting my application, I had an online interview that was just me recording answers to questions. I then was asked to submit my references. I did not move on after this step, but I believe the next step was online interviews via zoom or a phone call.", "Interview Questions": "Why do you want to work at CHOA?"}, {"date": "20 Dec 2019", "title": "Nurse Extern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Children's Healthcare of Atlanta", "Interview Descriptions": "I completed a HireVue interview. It was easy, they gave you one try for each question. Did not prepare much and was able to easily complete. They ask you to rank their locations and specialties.", "Interview Questions": "Why do you want to work at CHOA?"}, {"date": "19 Dec 2019", "title": "Physician Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Children's Healthcare of Atlanta (Atlanta, GA)", "Interview Descriptions": "Met with the team, and it was very laid back. There were no behavioral questions asked, more just getting to know you and seeing if you were a good fit. This may not be correct for all departments.", "Interview Questions": "Tell me about yourself. Why are you interested in the position. "}, {"date": "13 Nov 2020", "title": "Nurse Extern Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Children's Healthcare of Atlanta (Atlanta, GA) in Dec 2019", "Interview Descriptions": "The interview was conducted online via HireVue. I applied and was contacted a week later to do a virtual interview. I feel like the questions were fair. But when I was waiting on an offer, it took about three months to just to let me know I was not selected for the position.", "Interview Questions": "Why do you want to be a nurse?"}, {"date": "5 Feb 2020", "title": "Patient Care Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Children's Healthcare of Atlanta in Nov 2019", "Interview Descriptions": "Some places asked for you to receive a interview Through hireview. My interview I came into the unit and I was shown around the floor. I was also asked to shadow certain members to see what the position is about. I was later asked to sit for the actual interview. It was a fairly detailed process. I then waited about 2weeks after my interview to see if I have been offered the job. After that I went into training.", "Interview Questions": "How do  I deal with work conflicts? "}, {"date": "4 Nov 2019", "title": "Feeding Technician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Children's Healthcare of Atlanta (Atlanta, GA) in Oct 2019", "Interview Descriptions": "I first participated in an observation where I was essentially doing the duty of the position I was applying for, to see how quickly I could catch on, seeing if I had any questions, seeing how it would be in the day to day interactions with the patients. After the observation, I did an interview with the hiring manager and one other person. They asked me about 3 or 4 questions.", "Interview Questions": "Describe a time you had to collaborate on something that was different from what you were used to working on. What did you like about the collaboration and what did you not like."}, {"date": "25 Sept 2019", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Children's Healthcare of Atlanta", "Interview Descriptions": "Interview process was smooth, they sent me a request for a digital interview the day after I applied.  After the digital interview they will request an in person interview and provide an offer.", "Interview Questions": "What made you want to do nursing?"}, {"date": "24 Sept 2019", "title": "ED Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Children's Healthcare of Atlanta", "Interview Descriptions": "Interview was online and sent my resume'. Typical questions such as what do you see yourself doing in the next 5 years. It was an interview where I had a webcam and questions came across the screen. Guys, wear suit and tie.", "Interview Questions": "Why do you have desires of being an ED tech?"}, {"date": "20 Sept 2019", "title": "Radiologic Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at Children's Healthcare of Atlanta (Atlanta, GA) in Sept 2019", "Interview Descriptions": "Filled out application, a few days later a recruiter reaches out to me to schedule a interview, then I met with two team leads in radiology for my interview. Afterwards they take you on a tour of the department.", "Interview Questions": "Situational questions and why I want to work for CHOA."}, {"date": "29 Aug 2019", "title": "MRI Technologist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Children's Healthcare of Atlanta", "Interview Descriptions": "It was an on site interview, where I was asked basic behavioral questions. They want the answers in the star format.  After, I had to take a multiple choice physics test.", "Interview Questions": "How do you resolve conflict with a coworker?"}], [{"date": "11 Aug 2019", "title": "New Grad Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 8 weeks. I interviewed at Children's Healthcare of Atlanta", "Interview Descriptions": "I had a great experience during the interview process, which made me want to work at CHOA even more.  For the New Grad program, you submit an online application.  Once that’s reviewed, you may get an invitation to complete a digital interview.  I received that the day after I submitted my application then I had 3 business days to complete the digital interview (using an app to record answers to questions).   After about 6-7 weeks I got a call from my recruiter about setting up an in-person interview.  They’ll work with you on this part to try to get you the interview with your top unit choices if they think you are a good candidate.  I’ve been told that if you interview with a unit and don’t get the job, they will keep getting you interviews until all spots are filled. So if you don’t get your top choice, you can still do a second interview.", "Interview Questions": "Tell me about a time when you went above and beyond for a patient of yours. "}, {"date": "4 Aug 2019", "title": "Strategic Account Executive Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 months. I interviewed at Children's Healthcare of Atlanta", "Interview Descriptions": "Very unprofessional. Unprepared for the interview. Read questions off of a prepared HR sheet. Did not take interview seriously and wasted my time to come in. Didn’t engage in conversation or inquire about my answers but only moved on to the scripted question.", "Interview Questions": "Describe a challenge you faced and how did you handle it?"}, {"date": "13 Sept 2019", "title": "Associate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Children's Healthcare of Atlanta (Atlanta, GA) in Aug 2019", "Interview Descriptions": "The recruiter and I had confirmed a time different to what was sent in the confirmation email, so I had to arrive earlier than I stated in my availability. There were 2 interviews over 1.5 hours with a couple waits in between - nothing too difficult, although one of them was very condescending, like she knew upon seeing me she didn't want to hire me. Afterwards, I NEVER heard back. I have never talked to a company that did not have the professional courtesy to email me back, even if I didn't get the job. Unprofessional.", "Interview Questions": "strengths and weaknesses, how do previous jobs translate to this position, etc."}, {"date": "8 Oct 2019", "title": "Behavior Data Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Children's Healthcare of Atlanta (Atlanta, GA) in Aug 2019", "Interview Descriptions": "Did a virtual interview and then an in-person one. The in-person one was about half an hour. There were behavioral questions, and the interviewers were really nice and professional. They listen carefully and clarify things when needed; they answered questions patiently at the end too.", "Interview Questions": "What is your career goal?"}, {"date": "22 Sept 2020", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 months. I interviewed at Children's Healthcare of Atlanta in Aug 2019", "Interview Descriptions": "Kind and personable interview. Though it takes a while for CHOA HR to reach out to you after submitting an application, they are fairly quick with the process once the reach out to you. There are several training courses and modules to complete once you pass the initial interview.", "Interview Questions": "Why do you want to join the CHOA organization?"}, {"date": "1 Aug 2022", "title": "Applications Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Children's Healthcare of Atlanta (Atlanta, GA) in Aug 2019", "Interview Descriptions": "Many interviews ask behavioral- based interview questions and look for STAR answers. The STAR method is a structured manner of responding to a behavioral-based interview question by discussing the specific situation, task, action, and result of the situation you are describing.", "Interview Questions": "Tell me about a time when you faced a challenge and how you handled it."}, {"date": "20 Jul 2019", "title": "RT Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Children's Healthcare of Atlanta", "Interview Descriptions": "I applied online; the process did not take too long. I interviewed and got a call back within a couple of weeks. The interview wasn’t too bad. It was mostly situational questions.", "Interview Questions": "why do you want to work here?\r\n"}, {"date": "20 Oct 2022", "title": "Patient Registration Associate Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Children's Healthcare of Atlanta (Atlanta, GA) in Jul 2019", "Interview Descriptions": "Simple. Very to the point. First you talk with a recruiter, then you advance to the actual interview. If interview goes well, you’re then offered a pay rate that you can either accept or deny. Again, simple process. Helps if you’ve already been employed by the company.", "Interview Questions": "What’s your availability if you are applying for part time."}, {"date": "5 Aug 2019", "title": "Licensed Practical Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Children's Healthcare of Atlanta (Douglasville, GA) in Jun 2019", "Interview Descriptions": "I applied for the job and was contacted by a recruiter via email one week later to set up a phone interview. I then had a phone interview with the recruiter. Basic questions (why do you want to leave your current position, tell me about yourself, etc.) She found my skill set relevant for the position and moved forward by sending my info to the nurse manager. One week later, I was contacted by a nurse manager for a formal interview and shadowing the following week. The interview was fairly simple, professional but also casual (if that makes sense.) It lasted approximately one hour. Shadowing was approximately 2.5 hours. \nI was offered the job the same day.", "Interview Questions": "Why are you leaving your current position?"}, {"date": "13 Jun 2019", "title": "Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Children's Healthcare of Atlanta (Atlanta, GA) in Jun 2019", "Interview Descriptions": "I got a call from the recruiter after having applied online maybe a month after. The recruiter called and set me up for an in-person interview with two people panel which were the Director and Manager of the department. They asked a series of Behavioral and Situational questions. Then for the last portion of the interview talked about the role of the position. It lasted about an hour fifteen minutes Afterwards, on the same day a recruiter called me again to say they enjoyed the interview and wanted to set up a second interview but also wanted to get background and references started in the interim. The second interview was another panel set for a couple days later with the head scheduler and the Clinical Manager. They asked straightforward background questions i.e. Take me through your resume, Can you tell me about this on your resume, etc. Then took me on a tour of the facilities. Interview lasted about an hour and a half. Didn't hear anything on that day but got a callback on the next day with an offer.", "Interview Questions": "Behavioral - Tell me about a time you had a conflict with a coworker, Tell me about a time you solved a problem, Tell me about your experience... "}], [{"date": "30 May 2019", "title": "Patient Care Technician Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 12 months. I interviewed at Children's Healthcare of Atlanta (Atlanta, GA)", "Interview Descriptions": "Most interviewees give you a tour. The questions depend on the manager and the specific needs. You'll likely be asked why you want to work here and how you'd respond to a certain scenario.", "Interview Questions": "What makes you want to work for Children's Healthcare of Atlanta?"}, {"date": "5 Sept 2019", "title": "MA/Orthopedic Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at Children's Healthcare of Atlanta (Forsyth, GA) in May 2019", "Interview Descriptions": "Very easy interview, couple questions, about past job experience, the commute from house to the location, my availability, schedule. The interviewer make me fill comfortable,  It took about 15 minutes", "Interview Questions": "Orthopedic experience, when be able to start, salary offered "}, {"date": "16 Jul 2019", "title": "Environmental Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Children's Healthcare of Atlanta (Atlanta, GA) in May 2019", "Interview Descriptions": "I interviewed in May with Mrs. Sonia very great informal interview. I then had to wait for background checks following reference checks i then recieved a call back june 11th saying everything came back clear and that June 20th would be the day i went for badging, and drug testing which included nicotine urine testing. My start date was june 24th & i started then. Over all process took about a month.", "Interview Questions": "Why do you want to work for Childrens ?"}, {"date": "12 Jun 2019", "title": "Clinical Research Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Children's Healthcare of Atlanta (Atlanta, GA) in May 2019", "Interview Descriptions": "I met with a Lear Coordinator who was extremely nice. She was thorough in describing what CHOA was looking for, and did a good job explaining the culture, progression, and opportunity for advancement and learning.", "Interview Questions": "Tell me about your experience with Children."}, {"date": "23 Apr 2019", "title": "Nurse Extern Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Children's Healthcare of Atlanta", "Interview Descriptions": "I was asked to do an online interview a week after I applied. I completed the interview and didn't hear anything back until a couple months later when I got an email that they went ahead with other applicants.", "Interview Questions": "Why do you want to be a nurse?\r\nWhy CHOA?"}, {"date": "14 Aug 2020", "title": "Financial Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Children's Healthcare of Atlanta (Atlanta, GA) in Apr 2019", "Interview Descriptions": "I applied online, received call-back within two weeks of submitting application. Interview was done with Manager, Department supervisor and Team Lead. Interview questions were generic. I received a post-interview call the next day.", "Interview Questions": "Tell me of a time with a difficult situation and how did you handle it?"}, {"date": "25 Jul 2021", "title": "Patient Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Children's Healthcare of Atlanta (Atlanta, GA) in Apr 2019", "Interview Descriptions": "We went to the managers office. Talked about my experience, why I wanted to work with children's hospital. She asked a few questions and I felt really comfortable. Great job interview.", "Interview Questions": "Why I wanted to work for Childrens hospital.\n"}, {"date": "18 Apr 2019", "title": "Financial Operations Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Children's Healthcare of Atlanta (Atlanta, GA) in Mar 2019", "Interview Descriptions": "I submitted my resume through the company web site, and a recruiter reached out a week or so later, which led to a 30-minute phone screen.  After that I was invited to a 3 hour in-person interview with the hiring manager, the hiring manager’s boss and another associate.  Had good conversations with all three of them.  Everyone I spoke to during the entire process, including the recruiter, was super friendly, positive and professional, and they were all passionate about the organization.  I followed up with the recruiter via e-mail a couple of times over the following two weeks to express my continued interest, and inquire about next steps.  No response at all.  \r\n\r\nAfter 2 1/2 weeks I finally received a canned e-mail from their applicant tracking system saying that they were going to “pursue other candidates.” Now it was pretty evident that I was well-qualified for the position, so that wasn’t the issue.  Whatever the reason for them deciding that they want to “pursue other candidates” that’s fine, there are lots of qualified people out there.  But good grief, at least have the courtesy to reach out with an e-mail from an actual person or take 2 minutes to call me to let me know instead of ghosting on me, and eventually getting around to sending a boiler plate e-mail from a robot!  Especially  after I’ve invested 3 1/2 hours of my time interviewing, and they’ve invested 3 1/2 man-hours on their end too!  I found it very unprofessional, and in stark contrast to the entire interview experience up until that point.  I would have considered the overall experience a positive one, and would have even wanted to stay connected with the people I interviewed with despite not getting a job offer, but getting blown off like that really left a bad taste in my mouth about Children’s Healthcare.", "Interview Questions": "It was mostly conversational, although one person asked a handful of behavioral-type questions."}, {"date": "23 Mar 2019", "title": "Patient Safety Sitter Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Children's Healthcare of Atlanta in Mar 2019", "Interview Descriptions": "interviewed then took a tour of hospital .  nurse was nice snd easy tp talk to.  she asked me to tell her about each Company i worked for. why did i leave", "Interview Questions": "why did i apply"}, {"date": "8 Feb 2019", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Children's Healthcare of Atlanta", "Interview Descriptions": "The interview process was smooth. One hour spent on questions and how the unit was set up with the manager and unit educator and then a two hour shadow of the floor with a nurse.", "Interview Questions": "What groups I was involved in at my current job, or how I was involved in the unit. "}], [{"date": "20 Feb 2019", "title": "Clinical Research Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Children's Healthcare of Atlanta (Atlanta, GA) in Feb 2019", "Interview Descriptions": "Recruiter called, we had an over the phone interview for about 30 minutes. A week later I was invited in to interview with staff and other CRC. Fairly easy interview with great questions.", "Interview Questions": "Why pediatric cancer?"}, {"date": "26 Apr 2019", "title": "RN Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Children's Healthcare of Atlanta (Atlanta, GA) in Feb 2019", "Interview Descriptions": "Unfortunately, I only got a telephone interview because I have not worked since 2011.  Their interview process is available on their website.  I am planning to re-apply after I gain current experience or take a refresher course.", "Interview Questions": "Would I be able to obtain my Bachelor's of Science in Nursing within 2 years?"}, {"date": "30 Dec 2022", "title": "Internship Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Children's Healthcare of Atlanta in Feb 2019", "Interview Descriptions": "Zoom interview. 2 Interviewers - one from the feeding unit and one from the severe behavior unit. They were either playing good cop bad cop or one of the interviewers was simply unpleasant.", "Interview Questions": "Describe a case, describe treatment approach. Are you comfortable working with kids who have severe behavior problems."}, {"date": "10 Dec 2018", "title": "Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Children's Healthcare of Atlanta in Nov 2018", "Interview Descriptions": "Very comfortable. It felt like I was having a genuine conversation of my likes and dislikes in a work environment in comparison to what they need and if we would be a good fit for each other. Not your typical interview.", "Interview Questions": "All senario-based, tell me about a time where this happened and how did you handle it? "}, {"date": "16 Nov 2018", "title": "Rehab Aide Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Children's Healthcare of Atlanta (Atlanta, GA) in Nov 2018", "Interview Descriptions": "It was not intimidating at all and everyone was extremely nice. It was a lot more laid back than I thought. They like to ask open-ended (scenarios) type of questions to get a feel for who you are.", "Interview Questions": "Please explain a time where you might have had a disagreement with a coworker and how did you approach the situation."}, {"date": "23 Oct 2018", "title": "Patient Care Specialist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Children's Healthcare of Atlanta", "Interview Descriptions": "There was a video recorded interview in addition to an in-person interview on the unit. Two nurse managers completed the interview on the unit and included theoretical situation questions and personality questions.", "Interview Questions": "What qualities do you contribute to a team?"}, {"date": "15 Oct 2018", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Children's Healthcare of Atlanta", "Interview Descriptions": "I attended a recent recruiting event at CHOA Scottish Rite and was so impressed by the whole process! I worked for CHOA earlier in my career and was excited to see how I might fit back into the CHOA family now. I was able to meet with several of the nurse recruiters and even was offered a tour of the facility. The event was well executed and I am looking forward to my next step in my own career partnering with CHOA.", "Interview Questions": "What area of the hospital are  you interested in ?"}, {"date": "12 Oct 2018", "title": "Social Media Content Producer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at Children's Healthcare of Atlanta", "Interview Descriptions": "Applied online, was emailed that \"We have reviewed your application and considered your qualifications. However, we have decided to move forward with other candidates who more closely match the needs of this position at this time.\"", "Interview Questions": "N/A"}, {"date": "30 Oct 2018", "title": "EVS Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. I interviewed at Children's Healthcare of Atlanta (Atlanta, GA) in Oct 2018", "Interview Descriptions": "It was pretty great and brief I felt a sort of calmness almost felt like family  I was asked easy questions I was given a hospital tour and they have paid orientation if you want to work at a hospital Children's Hospital is the 1st pick", "Interview Questions": "What do you know about children's hospital "}, {"date": "12 Jun 2019", "title": "Patient Accounts Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Children's Healthcare of Atlanta (Atlanta, GA) in Oct 2018", "Interview Descriptions": "The interview consisted of 2 managers at a time. The first two managers were nice and professional. The second two managers came across as being very insecure and the gentleman appeared to be somewhat sarcastic. It was very awkward.", "Interview Questions": "What made you want to apply for the position?"}], [{"date": "12 Oct 2018", "title": "Clinical Research Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Children's Healthcare of Atlanta in Sept 2018", "Interview Descriptions": "Put in application about 1 month or so. 2 weeks after that received a email from the Lead Coordinator stating she received my application from recruiter and wanted to set up phone interview.  Did the phone interview and it went great. She stated she was going to call me back with details and never heard nothing back. Sent a follow up email, no reply.", "Interview Questions": "How long have you been a research coordinator?"}, {"date": "17 Sept 2018", "title": "Clinical Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Children's Healthcare of Atlanta (Atlanta, GA) in Sept 2018", "Interview Descriptions": "I was referred by a nurse that worked there. I heard from a nurse recruiter the next day. A few weeks later, I was called to go in for an interview. I was offered the job after the interview. I was interviewed by three nurse managers at once.", "Interview Questions": "How do you prioritize patients when you have a heavy load? Describe a time when you had a difficult patient or family member, what did you do?"}, {"date": "13 Aug 2018", "title": "Patient Registration Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Children's Healthcare of Atlanta", "Interview Descriptions": "I completed a FaceTime interview via Hirevue (no pressure). I then completed a  Face to Face interview with hiring manager, and after about a week, I received an offer and accepted it!", "Interview Questions": "When was a time you turned a bad situation around?"}, {"date": "15 Jun 2018", "title": "Nurse Extern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Children's Healthcare of Atlanta", "Interview Descriptions": "Process begins with a 14 question video based interview, asking herbal questions about why nursing, why CHOA, what you want to do, etc. Then continues with an inperson/phone interview and a reference check.", "Interview Questions": "What kind of nurse do you want to be?"}, {"date": "1 Jun 2018", "title": "Anonymous Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Children's Healthcare of Atlanta (Atlanta, GA)", "Interview Descriptions": "Applied online. Got a call from hr about 3 weeks later. She scheduled an interview with the hiring manager. It was a panel interview with 4 other people. I was asked basic behavioral questions. I prepared a week in advance. Googled behavioral questions. It gave me a good idea and helped with my nerves. Everyone was sweet and easy to talk to.", "Interview Questions": "Conflict resolution questions were asked more than one. Just worded differently."}, {"date": "29 Apr 2018", "title": "Applications Developer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Children's Healthcare of Atlanta (Atlanta, GA) in Apr 2018", "Interview Descriptions": "The interview process consisted of an initial screen by the Technical Recruiter where the questions were primarily about my background and why I was interested in the company to determine a good fit for the culture. The second interview was a technical screen for the position and the final interview was a team setting interview of approximately 8 people.", "Interview Questions": "Knowledge of Sitecore and how it related to my .NET background."}, {"date": "13 Feb 2020", "title": "Pediatric Nurse Practitioner Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Children's Healthcare of Atlanta (Atlanta, GA) in Apr 2018", "Interview Descriptions": "Very long! It was difficult to get any response for several months. I met with several people along the way, and got great feedback. At the end of the day, they gave the position to someone who had 12 years of experience. I have heard this is not uncommon at CHOA to rely heavily on experience.", "Interview Questions": "Why do you want to work with kids?"}, {"date": "8 May 2018", "title": "Buyer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Children's Healthcare of Atlanta (Atlanta, GA) in Apr 2018", "Interview Descriptions": "First step is a phone interview with HR to qualify. Then you will get a second phone interview with the managers that last about an hour to get to know you and your background. Last step is to meet in person with the managers do a panel interview of scripted questions. \n\nHad to follow up with HR to find out I wasn’t selected. They should email everyone that goes through this long process.", "Interview Questions": "What challenges have you faced and how did you overcome them."}, {"date": "28 Mar 2018", "title": "Research Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Children's Healthcare of Atlanta (Atlanta, GA) in Mar 2018", "Interview Descriptions": "Hiring process was quicker than I expected. Received a phone call from recruiter 2 days after applying online. After a week and a half I received an in person interview with 3 lead research coordinators. Interview was filled with task based questions and questions about my background. Second interview a week later with clinical research manager and lead research nurse and all the questions were straightforward backgrounds and research experience. Got a call the same day with a job offer", "Interview Questions": "Why did you choose CHOA?"}, {"date": "26 Sept 2020", "title": "Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Children's Healthcare of Atlanta (Atlanta, GA) in Mar 2018", "Interview Descriptions": "Havent done it yet, i am currently doing this because i want to have a heads up on interviw questions. I dont know why I have to fill this out if I have not had the interview yet, so yeah thats why ha ha ha", "Interview Questions": "tell me about yourself today"}], [{"date": "25 Aug 2022", "title": "Communications/Public Relations Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 5 months. I interviewed at Children's Healthcare of Atlanta (Atlanta, GA) in Mar 2018", "Interview Descriptions": "The interview process was thorough and included 5 visits with a top VP and during the 5th, he made me an offer. He asked great questions and was a good listener, also.", "Interview Questions": "Why I wanted to work for an institution that prioritizes children's health?\n"}, {"date": "8 Mar 2018", "title": "Anonymous Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Children's Healthcare of Atlanta in Mar 2018", "Interview Descriptions": "I applied online and  got a call for interview the next day. Went in for an interview which was very straight and  got offered a position  after interview on the same day", "Interview Questions": "Why do you wanna work at Children's?"}, {"date": "7 Feb 2018", "title": "Patient Care Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Children's Healthcare of Atlanta (Atlanta, GA) in Feb 2018", "Interview Descriptions": "It was an easy going interview. I did the digital interview. I answered a few basic questions about myself and why I chose CHOA. It was pleasant and quick. CHOA has Avery good reputation.", "Interview Questions": "Why did you choose CHOA"}, {"date": "20 Mar 2018", "title": "Internship Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Children's Healthcare of Atlanta in Feb 2018", "Interview Descriptions": "I applied online and received both a phone interview and a FaceTime interview because I was not local. The experience as a whole was very positive. The interview felt very conversational and consisted of many situational questions.", "Interview Questions": "Why Children's Healthcare of Atlanta?"}, {"date": "17 Nov 2018", "title": "Registrar Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Children's Healthcare of Atlanta (Atlanta, GA) in Feb 2018", "Interview Descriptions": "It went by fairly quickly. I received a call from a recruiter 1 week after applying online. I set up an interview for the following week. We had a group panel and in a few days was offered the position.", "Interview Questions": "What experiences have I had registering children?"}, {"date": "27 Feb 2018", "title": "Business Operations Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. The process took 3 months. I interviewed at Children's Healthcare of Atlanta (Atlanta, GA) in Jan 2018", "Interview Descriptions": "Very lengthy process. Applied in October 2017. Did online video interview a few days after applying.  Received phone call about an in person interview January 2018. Never heard anything back. I do wish companies would at least take the time to let candidates know that they weren't picked for the position instead of leaving us wondering and then seeing online that the position is closed without any word from anyone else. Aside from that, overall positive experience. Everyone was very nice at the hospital itself. \r\nMainly just asked situational questions, asking what you would do/or what you have done when in a certain situation.", "Interview Questions": "What did you do when dealing with problems in a group setting?"}, {"date": "18 Sept 2022", "title": "Family Experience Liaison Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at Children's Healthcare of Atlanta (Atlanta, GA) in Jan 2018", "Interview Descriptions": "I had a telephone interview and an in-person interview on the specific hospital wing that I would prove customer service care to. I was made to feel extremely comfortable in the interview and afterwards I was given a tour of that specific hospital unit. I got the job but even if I hadn't, the tour helped ease any tension and gave me the opportunity to see the environment I would work in and the people I'd work with. ", "Interview Questions": "One question that I scrambled to find an answer for: Give me an example of an experience in the workplace where I had a conflict with a coworker and how I fixed it."}, {"date": "1 Feb 2019", "title": "Nurse Extern Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Children's Healthcare of Atlanta (Atlanta, GA) in Jan 2018", "Interview Descriptions": "Fill out an application online and then it is an online interview with references and followed by an in person one if asked back. The process was very lengthy and they only accept about 30-40 applicants.", "Interview Questions": "What are your top 3 units you want to work in and why?"}, {"date": "12 Jan 2018", "title": "Radiology EMR Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Children's Healthcare of Atlanta in Dec 2017", "Interview Descriptions": "It was basically a panel interview with the manager and the lead team member. They both asked interview questions. They asked about my background. After the interview, they showed me around the work space.", "Interview Questions": "If you were in a conflicting situation with a colleague, how would you handle that? "}, {"date": "12 Mar 2019", "title": "Pharmacy Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Children's Healthcare of Atlanta (Atlanta, GA) in Dec 2017", "Interview Descriptions": "The interview process was quick considering I was a referred applicant. It was almost scary because it all happened so quickly. I can say I was a worthy applicant and employee, but this process should not be as easy for every one.", "Interview Questions": "Have you ever had experience with making IV medications? "}], [{"date": "21 Nov 2017", "title": "Wellness Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Children's Healthcare of Atlanta", "Interview Descriptions": "Applied online over and over online throughout the years. Despite having advanced edu and experience have been rejected without so much as a call. ATS sucks and this is why HR at companies like this perpetuate the lack of success both internally and externally. Try reading the applicant's resume and speaking to them instead of utilizing a useless ATS to rely on qualified candidates. Your reputation relies on your HR dept and hiring practices.", "Interview Questions": "NO questions asked - just a constant rejection without merit. I am more than qualified and have been sent repeated rejections"}, {"date": "28 Feb 2018", "title": "Clinical Research Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Children's Healthcare of Atlanta (Atlanta, GA) in Nov 2017", "Interview Descriptions": "I had a recruiter ask me questions about my research experience and salary expectations over the phone. Then I had my first interview with the department I would be working with. After two days I had a second interview with the department head. I was asked when I could start the position only to find out I did not get the job. Unfortunately, I was led on to believe I had the job which was not professional.", "Interview Questions": "What are your research interests? Are you interested in sickle cell disease?"}, {"date": "30 Nov 2017", "title": "Pct Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 3 weeks. I interviewed at Children's Healthcare of Atlanta (McDonough, GA) in Nov 2017", "Interview Descriptions": "I filled out an app and about a little over a week. I received an audio invite to take a interview via email. 1 week exact, the recruiter called me in for a in person interview. 1 more week exact later they called and offered me the job. So about a 3 week turn a round for me.", "Interview Questions": "Have you ever had a conflict with another staff member? If so how did you resolve it?"}, {"date": "4 Dec 2017", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Children's Healthcare of Atlanta in Nov 2017", "Interview Descriptions": "Fairly easy interview process. Very relatable interviewers . The interview itself only took about 30 min. Asked some casual questions to get the ball rolling. Overall the interview process was exactly how I expected it.", "Interview Questions": "How long do you plan on being with choa? What does your academic classwork bring to the table?"}, {"date": "28 Aug 2020", "title": "Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Children's Healthcare of Atlanta in Nov 2017", "Interview Descriptions": "The process took some time.  Interviewed with multiple leaders before the final decision was made.  The entire process took place over a few months.  I was asked to present a case review in front of a panel.", "Interview Questions": "How do you see growing this position over the next year?"}, {"date": "14 Oct 2017", "title": "Data Management Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2+ months. I interviewed at Children's Healthcare of Atlanta", "Interview Descriptions": "The whole process took 2 months , I received a phone call from recruiter then phone interview then 2 times personal interviews , first was with several people and last with the manager .", "Interview Questions": "what statistical softwares did you use in your analysis? ?\nmany other alot different types of questions"}, {"date": "5 Jul 2018", "title": "Benefits Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Children's Healthcare of Atlanta (Atlanta, GA) in Oct 2017", "Interview Descriptions": "The interview started with a couple of phone interviews with recruiting where you walk through your background and why you are interested.  Then they bring you in for  multi-round in person interviews with people you might be working with.", "Interview Questions": "how would you handle a situation where someone does not agree with you?"}, {"date": "9 Nov 2017", "title": "Weekend Coverage Social Worker Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Children's Healthcare of Atlanta (Atlanta, GA) in Oct 2017", "Interview Descriptions": "Screened via phone by Human Resources. Then face to face three person panel interview in department. Given a few days to prepare for interview. Response ten days after interview. Good experience & responsiveness.", "Interview Questions": "How to prioritize multiple tasks?"}, {"date": "13 Nov 2017", "title": "BI Quantitative Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Children's Healthcare of Atlanta (Atlanta, GA) in Oct 2017", "Interview Descriptions": "First is the HR interview, then the hiring manager, both phone interviews, did not get the onsite interview.  Both are friendly and relax. last for 40 min for the second round. first round is short about 10 min.", "Interview Questions": "How do you deal with conflicts with colleagues?"}, {"date": "17 Sept 2017", "title": "IT Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Children's Healthcare of Atlanta (Atlanta, GA)", "Interview Descriptions": "The first interview was a phone interview that covered technical questions (difference between a router and a switch, difference between HTTP and HTML, etc).\r\n\r\nThe second interview was a 30 minute interview at the Children's office where the job was located. It was with the hiring manager, and was an informal/unscripted interview. There were not many technical questions asked. The only technical questions were pertinent to items listed on my resume.", "Interview Questions": "Difference between HTTP and HTML, talk about my resume experiences, etc..."}], [{"date": "28 Aug 2017", "title": "Patient Registration Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Children's Healthcare of Atlanta", "Interview Descriptions": "Interview process was great.  Received a tour of the facility and manager and supervisor were in attendance. Pretty standard questions and both were very nice and inviting. Great culture, looking forward to hearing back soon.", "Interview Questions": "Describe a time I received an unreasonable request from a customer/ patient."}, {"date": "11 Aug 2017", "title": "Behavioral Data Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Children's Healthcare of Atlanta (Atlanta, GA) in Aug 2017", "Interview Descriptions": "Interviewed for two separate positions.  A few hours after submitting my first application I interviewed through hirevue. You have 30 seconds to prepare to answer each question and 3 minutes for your answer. Once you answer you cannot redo anything. \r\nA few hours after doing my interview I received my first offer to interview in person. Questions were \"behavioral\" and involve answering questions about handling past experiences in a STAR (look it up) format. \r\nMy interview for a different position was similar because the question format was the same.  Interviewers were friendly, and made the experience stress free. I received a call and email stating I received an offer 3 days after my interview.", "Interview Questions": "What are your short term and long term career goals? "}, {"date": "3 Aug 2017", "title": "Behavioral Data Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Children's Healthcare of Atlanta in Jul 2017", "Interview Descriptions": "It was a screening interview done through HireVue. It gives you 30 seconds to read and prepare your answer and another 3 minutes to record your answer via video and audio recording.", "Interview Questions": "Why do you want to work for CHOA?"}, {"date": "18 Jul 2017", "title": "Lab Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Children's Healthcare of Atlanta (Atlanta, GA) in Jul 2017", "Interview Descriptions": "Applied online. Got an invite to online interview  4 days later. Got the in person interview 3 days after that and was offered the job before the end of that day.", "Interview Questions": "What experience do you have?"}, {"date": "27 Jul 2017", "title": "Investment Operations Associate Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Children's Healthcare of Atlanta (Atlanta, GA) in Jul 2017", "Interview Descriptions": "Had an initial screening interview with a recruiter.  Was told regardless of whether or not I was moving forward she would be contacting me within a week or two. I haven't heard from her and this interview was 4 weeks ago.", "Interview Questions": "Go through your resume"}, {"date": "15 Mar 2018", "title": "Customer Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 2 weeks. I interviewed at Children's Healthcare of Atlanta (Atlanta, GA) in Jul 2017", "Interview Descriptions": "Two person interview. Know your basic medical terminology. Typical interview questions. Be professional, and just know medical terminology. Know situational questions & answers. I really can't remember b/c it's been so long ago.", "Interview Questions": "Where is a gtube?"}, {"date": "10 Aug 2021", "title": "Trainer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Children's Healthcare of Atlanta (Atlanta, GA) in Jul 2017", "Interview Descriptions": "They conduct panel interviews following targeted selection method. Have STAR answers ready to go! The follow up (interview 2) is a simulated classroom teaching experience where you are the teacher and prepare a handout.", "Interview Questions": "Questions asked to \"describe s time when...\" followed by requests for achieving success, confronting challenges, etc. They want to know the situation, task, what action you took and the (measurable) results."}, {"date": "23 Jun 2017", "title": "Marketing Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Children's Healthcare of Atlanta", "Interview Descriptions": "I applied online and then was contacted a few months later for a phone screening. The screening was very short and basic with questions like, \"why are you interested in Children's.\" I was then asked to come in for an in-person interview with a marketing team. I interviewed with the entire team in groups of two and the entire process was very relaxed, friendly and conversational.", "Interview Questions": "Have you ever had to handle conflict? How did you do so?"}, {"date": "22 Jun 2017", "title": "Patient Access Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Children's Healthcare of Atlanta (Atlanta, GA) in Jun 2017", "Interview Descriptions": "I applied and it took about a month for them to contact. I had an interview online and was contacted about a second interview. Which was panel. After that they asked for 3 references and background check consent. I think it's safe to say I have the job! :)", "Interview Questions": "Behavioral questions"}, {"date": "1 Nov 2017", "title": "Process Improvement Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Children's Healthcare of Atlanta (Atlanta, GA) in May 2017", "Interview Descriptions": "1 Phone call with human resources coordinator, Followed by two in person interviews: One with HR and one with Hiring Manager. They are willing to move quickly on the first two interviews but the second one seems to take a little time to set up", "Interview Questions": "Asked if I was okay with the salary of $60,000"}], [{"date": "29 Mar 2017", "title": "Interpreter Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Children's Healthcare of Atlanta", "Interview Descriptions": "I've applied for this role a couple of times. One time they called me and did the phone interview but nothig further. Last week they called me to see if I wanted to go interview.", "Interview Questions": "Behavioral questions"}, {"date": "29 Mar 2017", "title": "Human Resources Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at Children's Healthcare of Atlanta", "Interview Descriptions": "I was applying within the company so they interview process from the beginning was pretty speedy. As for the waiting period after the final interview, it was about 3-4 weeks before hearing anything back and that's after calling once a week for an update on the process. It seems like they had forgotten to update the career board that the position had been filled.", "Interview Questions": "Why do you want to work in HR?"}, {"date": "3 May 2021", "title": "Business Operations Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Children's Healthcare of Atlanta (Atlanta, GA) in Mar 2017", "Interview Descriptions": "Applied online and took an assessment. A month later I was outreached to by HR and came in for an interview with a supervisor and the director. After the interview, I received another call from HR offering me the position.", "Interview Questions": "The standard behavioral/ situational questions you would answer using the STAR response format"}, {"date": "12 Feb 2017", "title": "Staff RN Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Children's Healthcare of Atlanta (Atlanta, GA) in Feb 2017", "Interview Descriptions": "I was contacted for a digital interview fairly quickly after submitting my application. I was via webcam, though there was an audio only option, so it could be done at my leisure (within 3 business days).", "Interview Questions": "Why CHOA? Why this floor?"}, {"date": "1 Feb 2017", "title": "Marketing Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Children's Healthcare of Atlanta (Atlanta, GA)", "Interview Descriptions": "I sent my resume to a current employee, who reached out to the recruiter.  Set up a phone interview with the recuiter, about 30 minutes.  After a couple days, set up a face to face with the hiring manager.", "Interview Questions": "What brand do you admire most?"}, {"date": "22 Mar 2017", "title": "New Grad RN Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Children's Healthcare of Atlanta in Feb 2017", "Interview Descriptions": "I did a short online interview a few weeks back but haven't hear anything back yet. It was done by using a camera and the questions were prompted on the screen. You recorded your answers for them to review. It was not face to face", "Interview Questions": "What has been your most difficult situation and how did you handle it?"}, {"date": "2 Mar 2017", "title": "Nurse Extern Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Children's Healthcare of Atlanta (Atlanta, GA) in Jan 2017", "Interview Descriptions": "Applied online, 2 weeks later received an email to do an online interview. About 1-2 weeks later received another email to send in 3 references. 3-4 weeks later received a phone call that I had been chosen for a second interview with nurse manager for Hughes Spalding inpatient.", "Interview Questions": "Why are you interested in being a nurse?\r\nTell me a time when you have conflict resolution.\r\nTell me a time you went above and beyond for someone."}, {"date": "16 Jan 2018", "title": "Unit Secretary Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Children's Healthcare of Atlanta (Atlanta, GA) in Jan 2017", "Interview Descriptions": "The hiring process did not take long. I applied for the job, several days later I got an email about the virtual interview. Completed that and got a call back the same day for second interview.", "Interview Questions": "How did you overcome a difficult situation?"}, {"date": "16 Feb 2017", "title": "Foundation Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Children's Healthcare of Atlanta in Jan 2017", "Interview Descriptions": "I applied online by submitting my resume and a cover letter. I was then contacted via email to set up a phone interview time. I applied for a foundation intern position.", "Interview Questions": "Have you ever had to speak to a group in order to persuade?  "}, {"date": "8 Feb 2017", "title": "Histotechnician Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Children's Healthcare of Atlanta (Atlanta, GA) in Jan 2017", "Interview Descriptions": "The initial communication was via email when my application was selected. You are then given a digital interview,  to which you record your answers and wait to be contacted later if you are qualified. I was then given a different job description from what was posted on the website via email. This was very confusing as the qualifications posted were met by my education and experience. This way of interviewing is new to me since I have only ever had phone and face to face interviews in life.", "Interview Questions": "Why do you want to work for CHOA?"}], [{"date": "23 Feb 2017", "title": "Nurse Extern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Children's Healthcare of Atlanta (Atlanta, GA) in Dec 2016", "Interview Descriptions": "I filled out the application and that same day I was invitied to do a skype interview. The interview consisted of questions about why do you want to be a nurse and why would you want to work with children. Had to wait another month to hear back to see if I got the position.", "Interview Questions": "Why do you want to be a nurse?\r\nWhy do you want to work with children?\r\nWhat makes you unique?\r\nPick 3 units you want to work and tell why."}, {"date": "9 Dec 2016", "title": "Compliance Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Children's Healthcare of Atlanta (New York, NY) in Nov 2016", "Interview Descriptions": "I initially spoke on the phone with a recruiter, than a phone interview with the Director, and in person with the Director and the higher up (separately).  I finally got a phone call that they choose to hire internally.", "Interview Questions": "How have I dealt with a difficult situation."}, {"date": "2 Oct 2016", "title": "Unit Secretary Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Children's Healthcare of Atlanta", "Interview Descriptions": "Applied for the job and around a week later got a call for a video interview. The following week was called to do an in person interview with the supervisor and one of the charge nurses. The next week I was called again to do an interview with the same supervisor and manager of the floor. Accepted the job that day. The whole process is very long, took a month.", "Interview Questions": "How do you deal with stress, or things changing at the last minute"}, {"date": "9 Apr 2017", "title": "Pharmacist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Children's Healthcare of Atlanta (Atlanta, GA) in Oct 2016", "Interview Descriptions": "Very informal meeting.  Discussed basic job expectations, my background and how I would fit in to the new role with Children's Healthcare of Atlanta and why I was interested in moving into pediatric hospital pharmacy after working retail for so long.", "Interview Questions": "Why are you interested in making a career change from retail to hospital?"}, {"date": "17 Jul 2019", "title": "Pharmacist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Children's Healthcare of Atlanta (Atlanta, GA) in Oct 2016", "Interview Descriptions": "The interviewers were very professional. Everybody arrived on time and they asked very relevant questions.  There were 5 interviewers from departments of pharmacy and all asked questions that were relevant to their departments", "Interview Questions": "When are you available to start?"}, {"date": "1 Sept 2016", "title": "Family Experience Liaison Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 4 weeks. I interviewed at Children's Healthcare of Atlanta (Atlanta, GA)", "Interview Descriptions": "Behavioral interviewing - describe a specific example of ____. Spoke with recruiter o phone first; then was selected to interview in-person with recruiter. Later, interviewed with a panel of managers for the department.", "Interview Questions": "Describe a time you had a conflict with a co-worker."}, {"date": "31 Aug 2016", "title": "Registration Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Children's Healthcare of Atlanta", "Interview Descriptions": "I applied online 3-4 weeks before I was contacted by a recruiter to schedule a face to face interview. I was interviewed by both the practice manager and the office manager. The interview was pretty comfortable and they asked the basic interview questions. At the end of the interview they asked if I was currently working. I replied no and they said, \"okay good, so you won't have to submit a two weeks notice.\" I was sure that I got the job, but I didn't.", "Interview Questions": "Describe your work \"style\" (not verbatim) in three words."}, {"date": "25 Aug 2016", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Children's Healthcare of Atlanta", "Interview Descriptions": "I applied online and received an email the next day to set up a phone interview. After the phone interview, a face to face interview was scheduled for week later with the nurse manager and assistant nurse manager. After my face to face interview, I set up a day to shadow to see if the position was right for me. A few days later, I received a call with an offer.", "Interview Questions": "Describe a recent policy change and how it affected you?"}, {"date": "13 Jul 2016", "title": "Patient Care Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Children's Healthcare of Atlanta in Jul 2016", "Interview Descriptions": "From the time I filled out the application to when I got hired took about 3 months. You have to first get a video interview before they schedule a face to face in person interview. After the interview it was almost two weeks before I got the offer of employment.", "Interview Questions": "Tell us about a time you and a coworker didn't see eye to eye. How did you handle the situation and what was the outcome"}, {"date": "21 Jun 2016", "title": "Maintenance Engineer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied through a recruiter. I interviewed at Children's Healthcare of Atlanta", "Interview Descriptions": "HR at CHOA is very bad. They take so long to get back to you or you may never hear from them. My experience has been very negative. My wife works here so I had an employee referral. They called me the first day and it has been 2 months and still have not heard back. The position is still open.", "Interview Questions": "Why do you want to work at Children's?"}], [{"date": "29 Jun 2016", "title": "Pharmacy Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Children's Healthcare of Atlanta (Atlanta, GA) in Jun 2016", "Interview Descriptions": "The interview was a two hour interview. Everybody was really nice, I would have to say overall the interview went really well. I had interviewed with two people first and did situational type of question. Next was an interview with the clinical pharmacist, and then the supervisor pharmacist. At the end I had an math test which was easy.", "Interview Questions": "Why children healthcare of Atlanta and. Or any other hospital ?"}, {"date": "10 Mar 2016", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Children's Healthcare of Atlanta (Atlanta, GA) in Mar 2016", "Interview Descriptions": "I applied online; About a week later, received an email for a phone interview; Had a phone interview the next week; About another week later, received a call for an in person interview; Had an in person interview the following week", "Interview Questions": "Tell me about a time where you had to use communication skills"}, {"date": "20 Jun 2017", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Children's Healthcare of Atlanta (Atlanta, GA) in Mar 2016", "Interview Descriptions": "If you have a reference, you are SIGNIFICANTLY more likely to get hired. The hire rate is 6% according to orientation, so a reference is crucial. They invite you to interview, which lasted maybe 30-45 min, then you shadow a nurse for 2-3 maybe 4 max hours I believe.", "Interview Questions": "Why do you want to be a nurse? What will you do in the face of uncertainty/uncomfortable situations?"}, {"date": "13 Jan 2016", "title": "Healthcare Data Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. The process took 2 days. I interviewed at Children's Healthcare of Atlanta (Macon, GA) in Jan 2016", "Interview Descriptions": "Pleasant process and willing to help.  The person was friendly and helpful in listening.  However, my test scores were not what they needed to be and I was not even considered to interview with the hiring manager of the company.", "Interview Questions": "Basic questions and listened to career history."}, {"date": "28 Jan 2016", "title": "Quality Project Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 1 day. I interviewed at Children's Healthcare of Atlanta (Atlanta, GA) in Jan 2016", "Interview Descriptions": "The interview was scheduled by the recruiter.  It was a panel interview with a team of 3 individuals.  I was also interviewed by the Director.  I was given the organization chart and a complete introduction to the role and what to expect for the position.", "Interview Questions": "How did I feel I could contribute to the team?"}, {"date": "9 Dec 2015", "title": "Security Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at Children's Healthcare of Atlanta (Atlanta, GA) in Oct 2015", "Interview Descriptions": "Two Interviews: the first is with two supervisors and if you are fortunate to get another interview the next will be with the departments manager. They ask normal what would you do questions and the interview is fairly simple.", "Interview Questions": "Name a time you were challenged by a patron at work."}, {"date": "2 Feb 2016", "title": "Liaison Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Children's Healthcare of Atlanta (Atlanta, GA) in Oct 2015", "Interview Descriptions": "Three people interviewed, went smooth heard back an hour later about shadow process. Overall process took about a month. Health screen and everything scheduled, orientaiton the next week, communicated will through email. Thrilled to be apart of CHOA.", "Interview Questions": "Tell me about a time when you had conflict with a coworker."}, {"date": "13 Aug 2016", "title": "Orthopedic Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Children's Healthcare of Atlanta in Sept 2015", "Interview Descriptions": "Went well. Kind of intimidating when the head of the ER saw my tattoo when shaking my hand and was rude about it. Online interview first- in person interview a few weeks after. Was asked to shadow that same day. Went and bought scrubs to wear for shadow. Got the job- relocated the day before starting the job.", "Interview Questions": "What are your short and long term goals?"}, {"date": "30 Sept 2015", "title": "Patient Care Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 4 weeks. I interviewed at Children's Healthcare of Atlanta (Atlanta, GA) in Sept 2015", "Interview Descriptions": "Interviewed with two very nice ladies. They both had a copy of my resume and asked question based on that after describing the details of the job. It was very comfortable and at the end they told me that I will be getting a call to schedule my shadowing hours from my recruiter.", "Interview Questions": "What was your most memorable patient experience?"}, {"date": "28 Jul 2015", "title": "Administrative Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Children's Healthcare of Atlanta (Atlanta, GA) in Jul 2015", "Interview Descriptions": "Recruiter contacts you to set up an interview. I met with the manager for a one on one interview.  At the interview they ask you behavioral questions.  Manager mentioned that I would need to come back and do a second interview and then do a shadowing day.  I withdrew my application because the job wasn't a good fit for me.", "Interview Questions": "Tell me about a time you got into a disagreement with a co-worker.  How did you handle it?  "}], [{"date": "7 Jun 2015", "title": "Patient Care Specialist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 2 days. I interviewed at Children's Healthcare of Atlanta", "Interview Descriptions": "One on one with manager you will come to the copertate children location not a real hospital and if they like you u will go  to the next step of shadow date.", "Interview Questions": "Q what you like about helping children. why did u choose childrens"}, {"date": "28 May 2015", "title": "Patient Care Tech ER PRN Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 5 weeks. I interviewed at Children's Healthcare of Atlanta (Atlanta, GA) in May 2015", "Interview Descriptions": "I was contacted for an online interview. Shortly after, I was contacted for an in-person interview. When I went in, they were very dry and really looking at my resume. They almost had no personality. Very introverted! I had all of the necessary qualifications and experience. After the interview, they said they were \"moving forward\" with my application. They set me up to shadow a pct. I asked when I would find out and they said a week later. Two weeks later I got a call from the recruiter saying they were considering me for a transporter position, not a tech anymore. The whole process took about five weeks.", "Interview Questions": "What would you do in this situation? Have you ever had a time where you dealt with an angry customer? Why do you want to work here? "}, {"date": "12 May 2015", "title": "Staff RN Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 1 week. I interviewed at Children's Healthcare of Atlanta (Atlanta, GA) in May 2015", "Interview Descriptions": "You go through one of their HR recruiters first.  Then a nursing recruiter.  Then you go to the department you are interested in for an interview.  Then you shadow a nurse for 4 hours on that unit.  Questions they ask are on a preprinted form.  HR recruiters seem very disorganized and don't seem to know what the other one is doing.", "Interview Questions": "Describe a situation where you had to deal with...? How do you relax after having a stressful day at work? Do you work well with...?  How would you deal with a last minute assignment change?"}, {"date": "24 Jan 2017", "title": "Customer Resource Representative Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 2 weeks. I interviewed at Children's Healthcare of Atlanta (Atlanta, GA) in May 2015", "Interview Descriptions": "I was fairly difficult. It was a panel interview. There were three leadership staff members who were conducting the interview. If are nervous about speaking to more than one person at a time, I suggest practicing the night before the interview.", "Interview Questions": "Typical questions"}, {"date": "15 Mar 2016", "title": "Dietitian Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Children's Healthcare of Atlanta (Atlanta, GA) in May 2015", "Interview Descriptions": "I applied. I contacted someone that I knew there and was given an interview. It was a full day affair. I was treated to lunch. It was pretty grueling at times, but they were fair and asked great questions. I felt very much at ease with everyone there.", "Interview Questions": "What have you contributed to your current position/program?"}, {"date": "18 Sept 2015", "title": "Anonymous Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 days. I interviewed at Children's Healthcare of Atlanta (Atlanta, GA) in May 2015", "Interview Descriptions": "They use a selection known as Targeted Selection meaning they are looking for a S.T.A.R. Always make sure you have an example where everything was NOT perfect. No one wants to have a PERFECT Star.", "Interview Questions": "Name a time when you disagreed with your....."}, {"date": "6 Mar 2015", "title": "Administrative Assistant Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. I interviewed at Children's Healthcare of Atlanta", "Interview Descriptions": "I interviewed for the same position in two different. They use a set list of questions. The questions were the same for both departments. They ask all candidates the same questions so that they can rate them against eachother. The interviews felt forced and awkward. I felt weird about the score card, and I didn't really like the whole process. It's hard to get to know someone when the conversation isn't allowed to flow. They also you put you through testing before you can even be recommended for an interview. For an admin role, I took Microsoft office and typing tests. However, the Office tests were based on an old version of Officd that they don't even use anymore. I would have loved to work there, but the interview process was really odd to me.", "Interview Questions": "How would your handle xxxx situation. All questions were situational."}, {"date": "16 Mar 2016", "title": "Project Coordinator At the Marcus Autism Center Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Children's Healthcare of Atlanta (Atlanta, GA) in Mar 2015", "Interview Descriptions": "I applied for the position in November 2014, and was contacted in February 2015 via to see if I was still interested in the position.  Once I responded yes, I received another email with a leaflet about the Talk With Me Baby Project and a request for an interview.  The first interview was with the Lead Research Coordinator and the Director of Infant and Toddler Clinical Research Operations. Although I met the Lead Research Coordinator with a smile and hello in the lobby, her disposition was unfriendly and aggressive in disposition.  We went upstairs to the the Director's office, where the lights were off, the room with lit by natural light, but I found it dark.  The director was seated at a round table on her laptop (which she would continue to work on during the entire interview).  The Lead Research Coordinator interviewed me, and overall it was awkward.", "Interview Questions": "Behavioral type questions with scenarios..."}, {"date": "25 Feb 2015", "title": "Patient Care Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Children's Healthcare of Atlanta (Atlanta, GA) in Feb 2015", "Interview Descriptions": "I applied on the CHOA website. I had to complete a personality test before I submitted the application. After about two weeks I was emailed to complete a video interview via the internet. The video interview was about 6 questions.  About a 7-10 days later I was asked to come in for an one on interview.", "Interview Questions": "Why do you want to work at CHOA?\r\nGive an example of how you have dealt with a major change?"}, {"date": "7 May 2015", "title": "Medical Technologist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 8 weeks. I interviewed at Children's Healthcare of Atlanta (Atlanta, GA) in Feb 2015", "Interview Descriptions": "The process leading up to the interview was pretty smooth.  Filled out the application online and was contacted by their recruiting staff about a week later.  Interview was set up with the laboratory manager.  Showed up for interview, which I thought went well.  Pretty standard questions regarding the laboratory and what the expectations were.  At the end of the interview I asked when I would expect to hear something and was told they had an interview scheduled in 3 weeks and after that they would decide who to call back in for second interviews with the lab directors.  After 4 weeks I e-mailed the recruiter and asked her what the status was.  She told me they were still doing interviews and would be making a decision who to call back the middle of the following week.  But she assured me I was still being considered.  Waited two more weeks and e-mailed again.  Told once again they had more interviews and would make a decision by the end of the week.  Following week, told the same thing again.  After being told \"we are going to make a decision this week\" 4 weeks in a row I didn't bother following up.  And to date, I still have not heard anything.  I'm glad I didn't get the job as I would have turned it down as I believe this behavior is very unprofessional and rude!  I wouldn't want to work for a place that is this disorganized and unprofessional.  The recruiter should have followed up with me regarding the position.", "Interview Questions": "What have your past experiences in labs taught you?"}], [{"date": "30 Aug 2016", "title": "Social Worker II Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Children's Healthcare of Atlanta (Atlanta, GA) in Feb 2015", "Interview Descriptions": "I was called by the recruiter to schedule an onsite interview with the Social Work Manager. After, I received an email regarding a second interview. The second interview was more of a panel styled interview where I met with multiple social workers and nurses and nurse case managers. The whole interview took about two hours. They asked behavioral style questions. The STAR format will be most helpful. I reached out after a couple of weeks, but never heard anything.", "Interview Questions": "Tell me about  a time where you worked as a team?\r\nTell me about a time you went above and beyond for a patient or family?\r\nTell me about a time you dealt with an angry family?\r\nTell a time where you had multiple tasks to complete? How did you prioritize?"}, {"date": "25 Oct 2014", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Children's Healthcare of Atlanta", "Interview Descriptions": "Currently they are short staffed in HR so don't take a long response from them personally. Very kind hr staff will do initial screening and phone interview. Then you meet with manager for actual interview. They have set of behavioral questions all managers are required to ask minimum  of 3 or 4 of a set Choa list. They are all very typical tell me a time when...\r\n From the areas I can remember team work/ getting along with others, critical thinking, dealing with change, work ethic.  Usually ask tell me a time that you made a mistake what was the mistake, what was your response, and outcome?", "Interview Questions": "None. They were all typical. If you google interview nursing questions and have a pre-thought out senerio for each will be a breeze."}, {"date": "1 Oct 2014", "title": "Behavioral Data Analyst Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Children's Healthcare of Atlanta", "Interview Descriptions": "Interview consisted of a 8 question packet that asked about personal situations and how you resolved the problem.  Then the interviewer asked job specific questions about past experience and related skills needed to perform the job.", "Interview Questions": "What do you have over other candidates that would make you a perfect fit for this job."}, {"date": "17 Oct 2014", "title": "Recruiting Manager/Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Children's Healthcare of Atlanta in Oct 2014", "Interview Descriptions": "I was instructed to come to a local office and there was no parking so I had to call to see where to park I was told to park on the street. I went into my appointment my interviewer was 20 minutes late and really did not ask strategic questions. I felt after 15 minutes of waiting I had changed my mind about this company to begin with. I was directed to another interview where I had to sit and wait ten more minutes for the interviewer to show up. Less than professional especially for someone in the business. I had already made my decision in the first ten minutes of waiting.", "Interview Questions": "How would I work with another new manager. Very open ended question"}, {"date": "20 May 2015", "title": "IS&T Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 1 week. I interviewed at Children's Healthcare of Atlanta (Atlanta, GA) in Sept 2014", "Interview Descriptions": "I applied online through Children's career portal and was contacted by the recruiter via email then phone. The recruiter set up an interview with the hiring manager within a day. Had a face to face interview with hiring manager and team lead. It was really laid back, everyone was really nice. I would say it was the easiest interview I have even been to. I heard back from the recruiter within a day letting me know the feedback of the interview. The process was pretty quick, with interview, background check, drug test etc all done within a week or so.", "Interview Questions": "Why do you want to work for Children's"}, {"date": "19 Sept 2014", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Children's Healthcare of Atlanta in Jul 2014", "Interview Descriptions": "Online application with \"essay\" type questionnaire. Initial interview was online video interview with behavioral questions. Next interview was in-person with a panel. Everyone had watched the online interview and some had follow-up questions from that, but most of the questions were behavioral. Next step was shadowing on the unit. Once I passed that there was a multiple choice nursing exam to take. I was told it was the last \"hoop\" to jump through and if I pass I'd be getting a job offer. Not true. Passed with flying colors, received a \"thanks, but no thanks\" email about a month later. Called the recruiter to ask what happened and how I could improve, but she never returned my calls.", "Interview Questions": "What would your colleagues say that your weaknesses are on the job? "}, {"date": "11 Sept 2014", "title": "Lab Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at Children's Healthcare of Atlanta in Jul 2014", "Interview Descriptions": "First interview was via video which consisted on 10 questions about my character and the position in which I was applying.\r\nSecond interview was with the recruiter who also gave a ten question written test about the procedures of the position. And he gave an overall description of the position. \r\nLast interview was a 3 person panel consisting of the dept head, dept supervisor and your potential reporting supervisor. This interview consisted of constant questions about how you would deal with the negatives of the job. It seem as though they wanted someone who has ran into frequent complications and tell how they dealt with it. Everything seemed negative, no positives seemed to be taken into consideration for this particular position. For example: if the computer crashed how would I handle it? My answer was to get the data backed up or handwritten and advise the supervisor of the issue but that wasn't what they was looking for.", "Interview Questions": "The most difficult questions were those of bad encounters that I didn't see as negatives but instead I was able to continue working"}, {"date": "1 Feb 2018", "title": "Social Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Children's Healthcare of Atlanta (Atlanta, GA) in Jun 2014", "Interview Descriptions": "I was called by a reruiter who gave me a brief overview of the position. One day later I then received a call from the Social Work Manager who told to me briefly on the phone; asking me basic questions about my background. She then sent me an email message with interview date and time. For the 1st interview I met with the manager alone. I then met with the SW team. I was interviewed by a panel of 5 Social Workers. The interview lasted about 1 hour. I left and heard back from the 4 weeks later requesting me to return and meet with more social workers and also interview with the unit manager and nurse case manager I will be working directly with. I left and did not hear back from them for another 4 weeks. Where the Social Work manager sent me an email to inquire whether I was still interested. I told her I did. The next day from HR offering me the position.", "Interview Questions": "Describe your past position and share with us your highlights in that position"}, {"date": "21 Apr 2017", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Children's Healthcare of Atlanta (Atlanta, GA) in Apr 2014", "Interview Descriptions": "The hiring process was fast, and they were very accommodating.  There was a total of two interviews.  One was with HR and the other was with the specific unit.", "Interview Questions": "Any situational question..."}, {"date": "10 Feb 2016", "title": "Senior Applications Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Children's Healthcare of Atlanta (Atlanta, GA) in Apr 2014", "Interview Descriptions": "Interview process was well done.  Came to HR and sat down with the manager and 2 leads.  They were all great.  They asked questions appropriate to the job I was applying for.  They did have a standard question book they had to go over, which was interesting and fun.  It was professional and laid back.", "Interview Questions": "What is one of your weaknesses."}], [{"date": "28 Aug 2015", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Children's Healthcare of Atlanta (Atlanta, GA) in Mar 2014", "Interview Descriptions": "I had a phone interview with an HR person. That interview consisted mostly of experience questions.  Next, I had an hour long interview with a hiring manager, and then I shadowed a nurse for 3 hours.  It took over a week to hear back from HR, and then I had to go back in to take a skills test.", "Interview Questions": "What do you do when you are given information that does not pertain to you?"}, {"date": "11 Mar 2014", "title": "Registration Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Children's Healthcare of Atlanta in Feb 2014", "Interview Descriptions": "I have always wanted to work for this organization, and over many many applications I finally got an phone interview. From the phone interview you are given information about the position youmight have. Then you will be interviewed by a hiring manager, you might have to interview more than once.", "Interview Questions": "Tons of behavioral questions!!"}, {"date": "21 Mar 2014", "title": "Foundation Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Children's Healthcare of Atlanta (Atlanta, GA) in Jan 2014", "Interview Descriptions": "The interview process was very effiecient. Both of the team members that interviewed my had put some questions together, which they took turns asking. At the same time it was not super ridgid and formal, we talked openly and I was given time to ask them questions that I had.", "Interview Questions": "Discuss a major project or work event that you managed, or were mostly responsible for. "}, {"date": "19 Mar 2015", "title": "Nurse Extern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Children's Healthcare of Atlanta (Atlanta, GA) in Dec 2013", "Interview Descriptions": "I was contacted to schedule a phone interview about 3 days after I had applied online. I had a phone interview where they asked general and behavioral questions. After the phone interview, I had to send off my references. After that they scheduled a second interview which I actually never needed because HR decided to hire me after the first interview.", "Interview Questions": "Why nursing? What are your top 3 unit choices and why? Name an instance where you had a conflict and how did you deal with it."}, {"date": "22 Dec 2013", "title": "Access Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Children's Healthcare of Atlanta (Atlanta, GA) in Nov 2013", "Interview Descriptions": "must interview with hiring manager and human resources", "Interview Questions": "how do you handle high volume pressure"}, {"date": "20 Nov 2013", "title": "Manager Data Analysis Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Children's Healthcare of Atlanta (Atlanta, GA) in Oct 2013", "Interview Descriptions": "The hiring manager informally contacted me (as in, prior to HR conversation).  I set up a phone interview with hiring mgr, and in the meantime, spoke to HR.  The phone interview went well, and HR scheduled me to come in for a series of interviews with the hiring mgr, direct reports (for the particular position), and a couple of potential colleagues.  Everyone was very friendly, asked good questions, etc.  I felt it all went well.\r\n\r\nThe things that I found unimpressive about this situation were almost all based in HR.  When I arrived at the HR building (I drove in from a neighboring state), no one there officially greeted me.  I was taken to a conference room, and I wasn't offered a thing.  In any other situation, I've been offered water, coffee, etc.  I thought it was strange that I never met the recruiter.  I ended up not getting the offer (which was communicated via email), and I understand the hiring mgr is still trying to determine what he truly needs in a candidate.", "Interview Questions": "The questions were all fairly standard.  Nothing stood out as a particularly difficult question."}, {"date": "4 Aug 2013", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Children's Healthcare of Atlanta", "Interview Descriptions": "The hiring and interview process was smooth and easy.", "Interview Questions": "Very focused on behavioral scenario questions"}, {"date": "21 Jun 2017", "title": "Scheduler Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Children's Healthcare of Atlanta (Atlanta, GA) in Aug 2013", "Interview Descriptions": "Was decent and laid back. It was also kind of short time for an interview. The team of schedulers also came in to meet me and allowed me to ask questions and they also asked me questions.", "Interview Questions": "Can I handle high volume of calls and some times parents who are stressed out."}, {"date": "7 Nov 2017", "title": "Dental Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Children's Healthcare of Atlanta (Atlanta, GA) in Jun 2013", "Interview Descriptions": "It was a very long four hour interview\u007f process, I met with many different department heads and office staff before actually sitting down for my interview. I spoke with the director of dentistry as well as their clinical coordinator. I was then given a run down of how things work in that department and as told that this was a non profit agency and they had to review other candidates before getting back to me.", "Interview Questions": "My availability and why I wanted to work for this company?"}, {"date": "9 Apr 2013", "title": "Registration Coordinator Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Children's Healthcare of Atlanta (Atlanta, GA)", "Interview Descriptions": "Found a job listed on craigslist and applied on the Children's website.  Had 3 in person interviews and was not selected for the job.  Called the director and explained that I felt that I had been pulled around when they already knew the were going to hire an internal person. Was told they had another position available - the registration job, interviewed one more time and was offered the position.", "Interview Questions": "Nothing stands out special about the interview it was a behavioral interview and it was typical. "}], [{"date": "4 Nov 2013", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Children's Healthcare of Atlanta (Atlanta, GA) in Apr 2013", "Interview Descriptions": "Online application --> Phone interview with recruiter --> Face-to-Face interview --> Opportunity to observe current nursing staff in area of interest.", "Interview Questions": "What is your philosophy of nursing?"}, {"date": "29 Mar 2013", "title": "Image Processing Scientist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Children's Healthcare of Atlanta in Feb 2013", "Interview Descriptions": "I got a call from HR about setting up a phone interview. First interview was mostly the discussion regarding the position and the lady said they will contact me regarding the next interview. I received an email after two days  from the HR lady setting up the interview  for the next day. In this interview I was asked about my experience and the projects. I was informed after three weeks of the interview that somebody else with more cardiac experience was selected for the position.", "Interview Questions": "What do you think will interest you more - application based position or optimization related position? "}, {"date": "4 Jun 2013", "title": "Marketing Coordinator Interview", "results": "No Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 7 weeks. I interviewed at Children's Healthcare of Atlanta (North Atlanta, GA) in Feb 2013", "Interview Descriptions": "Communications in order to set up the interview were difficult. I heard from one person to set up the interview, but then didn't hear back. Weeks later I heard from a completely different person, but didn't receive solid interview information for another two weeks. Once there, they paid me attention, but did not receive confirmation of job choice without a few email prompts to HR. Disappointed in the service.", "Interview Questions": "If you could do any job, what would it be?"}, {"date": "23 Jan 2013", "title": "Performance Improvement Specialist Interview", "results": "No Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I interviewed at Children's Healthcare of Atlanta (Atlanta, GA)", "Interview Descriptions": "Received a call from an internal HR and spoke for few minutes, then she scheduled me in for an onsite interview. Arrived on time and was taken for my first interview with the Hiring Manager. We spoke about the job and he asked some situation type questions. then The next interview with the team was super weird. The three people in the team that interviewed me were all brought in by each other and someone that works within the organization. So this begs the question, if any three of them have someone in mind (of which they would considering the job climate), what chance do I have?", "Interview Questions": "Questions were really basic"}, {"date": "3 May 2017", "title": "Patient Care Technician Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Children's Healthcare of Atlanta (Atlanta, GA) in Jan 2013", "Interview Descriptions": "They have you do a video interview with a robot and take a personality quiz. Literally the worst interview process ever. Then they have two managers in on your sit down interview and ask the same type of questions every other interview asks. Trick questions that do not allow you to show your strengths. Why are we still asking people to assign themselves a weakness? What's your greatest weakness? My Achilles heel?", "Interview Questions": "Describe a difficult patient encounter and how you handled it."}, {"date": "26 Sept 2016", "title": "Credentialing Supervisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 6 weeks. I interviewed at Children's Healthcare of Atlanta (Atlanta, GA) in Oct 2012", "Interview Descriptions": "I was contacted by the HR team for phone interview and pre-screen and then was asked to come in person for an interview within two weeks.  The interview process was fairly simple and straight forward.  The interview was only held with the hiring manager for the position and I was offered a position with two weeks of the interview.  I would recommend researching the company ahead of the interview and come prepared with questions about the work you'll be doing and about the company's values and mission.", "Interview Questions": "Why do you want to work here?"}, {"date": "20 Sept 2012", "title": "Special Events Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 5 days. I interviewed at Children's Healthcare of Atlanta (Atlanta, GA)", "Interview Descriptions": "I called the company to inquire about availability of vacancies.  Was invited by the Event Director to interview.  First appointment was highly informal, just the two of us discussing what drew us to the company.  We also discussed what we each hoped to benefit from a new hire, as a supervisor and contractor.  I was offered the position and accepted immediately.", "Interview Questions": "Why choose Children's over another nonprofit agency?"}, {"date": "28 Sept 2016", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 3 days. I interviewed at Children's Healthcare of Atlanta (Atlanta, GA) in Sept 2012", "Interview Descriptions": "Typical behavioral interview/conversational.  Met with Recruiter, met with several current employees for panel interview, and met with a company psychologist for personality testing.  The interviews took place over the course of about 3 days.", "Interview Questions": "Typical interview questions about most recent work experience, skill set, job motivation, achievements, etc."}, {"date": "17 May 2015", "title": "IS Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Children's Healthcare of Atlanta (Atlanta, GA) in Mar 2012", "Interview Descriptions": "I interviewed with the HR Recruiter and a week later with the manager and director. The process has  become more complex where candidate interviews with HR then a hireview interview, then 2 panels consisting of 3 people each.", "Interview Questions": "Specific PM Questions - What are the triple constraints of Project Management"}, {"date": "17 Nov 2013", "title": "Marketing Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Children's Healthcare of Atlanta (Atlanta, GA) in Feb 2012", "Interview Descriptions": "The hiring process involved two interviews. Some of the questions were a little strange, but I tried to give the answers they wanted to hear and not what I thought was the right thing to say. There was an aptitude test, a background check, and a drug test. It took about a month until I learned I had the job.", "Interview Questions": "What would you do if a manager told you to collect information on a colleague?  "}], [{"date": "3 Dec 2013", "title": "Writer/Editor, Marketing Department Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 months. I interviewed at Children's Healthcare of Atlanta (Atlanta, GA) in Jan 2012", "Interview Descriptions": "The interviewing process was fine. I had to interview with a few different people, but nothing was out of the ordinary.", "Interview Questions": "How did I handle change? "}, {"date": "9 Aug 2011", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Children's Healthcare of Atlanta (Atlanta, GA) in Jul 2011", "Interview Descriptions": "Interviewed first with Nurse Recruiter, then Unit Manager and finally HR.  All 3 were courteous and seemed genuinely interested in my experience.  I took a skills test with the HR department before meeting in person with them, which was really common sense nursing scenarios.  All of my questions about hours, requirements and unit policies were answered during those sessions.", "Interview Questions": "Describe a situation in which you provided excellent customer service."}, {"date": "15 Dec 2013", "title": "Accountant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 5 days. I interviewed at Children's Healthcare of Atlanta (Atlanta, GA) in Jun 2011", "Interview Descriptions": "The interview process was seamless. I was contacted by a recruiter and they arranged the interview. It was scheduled within 2 days. HR provided logistics to the recruiting firm and the firm passed the information to me; however, after the interview, HR back peddled and refused to honor what was specified in terms of payment for parking. The interview was less than hour.", "Interview Questions": "Questions were job specific, technical and behavioral. It was a typical interview centered around competences. There were a few case scenario questions to gauge knowledge and GAAP basics."}, {"date": "23 Jul 2015", "title": "Maintenance Mechanic Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at Children's Healthcare of Atlanta (Atlanta, GA) in Jun 2011", "Interview Descriptions": "Very slow process. First was a phone interview with a recruiter and then a face to face with manager and supervisors of dept. Then the recruiter called with an offer which I accepted, the background check seems to take weeks. Everything else was smooth sailing. After hire you go to their hub location for 2 day orientation to learn about all benefits/and policies.", "Interview Questions": "Why would I be an asset to their team?"}, {"date": "22 Jun 2011", "title": "Operations Supervisor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Children's Healthcare of Atlanta (Atlanta, GA) in May 2011", "Interview Descriptions": "Seemed ill-prepared. Interview was changed to a phone interview at the last minute. Confusion with what number to call for the interview. It all began to seem like it was an annoying formality on the employer's side.", "Interview Questions": "N/A"}, {"date": "16 Apr 2011", "title": "Consultant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Children's Healthcare of Atlanta (Atlanta, GA) in Feb 2011", "Interview Descriptions": "Initial interview with Human Resources Business Partner.\r\nPhone interview with hiring manager.\r\nDaylong interview with other managers.", "Interview Questions": "Approximately 3 hours of testing done with industrial psychologist."}, {"date": "12 Oct 2011", "title": "Quality Control Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Children's Healthcare of Atlanta (Atlanta, GA) in Dec 2010", "Interview Descriptions": "The interview process was a mess. The job I applied for was Quality Control and per the job posting it was a full-time position. In the interview I was informed it was a PRN position & that the job posting was incorrect. Had to wait for a manager to confirm with Human Resources that they still had the posting up for the ROI Specialist. I then interviewed for that position instead. My interview was scheduled and rescheduled several times. The experience was very disorganized and unprofessional. The main reason I accepted the job is that I was not happy in my current employment & had heard wonderful things about this company....very disappointed.", "Interview Questions": "Give your definition of customer service."}, {"date": "2 Jul 2012", "title": "Patient Access Quality Assurance Supervisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Children's Healthcare of Atlanta (Atlanta, GA) in Aug 2010", "Interview Descriptions": "I had been working with a recruiter for the organization since I had applied to a previous position and did not get an offer.  My resume was given to the hirring manager.  She approved for me to take a personality test.  After compelting I was scheduled for a face to face interview with two people.  I was living in Atlanta and came to Texas for the interview.  I paid for my own travel.  During the interview most of the questions were behavioral questions where you were put on the spot to answer situations that you had experienced.  The problem was that there might of been questions where you didnt have an actual answer because it never happened.  They didnt want any hypothetical answers.  After the pannel interview I spoke with the National Manager in another city.  I completed a phone interview.  I was offered the position within a few days.  The entire process was about 2-3 weeks.  After I accepted I had to complete a background check, financial check and drug screening.", "Interview Questions": "Describe a time when you didnt agree with the direction you manager gave you."}, {"date": "10 Nov 2011", "title": "Human Resources Business Partner Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Children's Healthcare of Atlanta (Atlanta, GA) in May 2010", "Interview Descriptions": "I was contacted by a Recruiter regarding a position I applied for on the Children Healthcare careers website. The Recruiter conducted a phone interview. She was friendly and detailed, and very professional. She contacted me a few days later and indicated that they wanted to schedule an onsite interview. Everything was handled in an organized manner. I received confirmation of the onsite interview via email. \r\n\r\nI interviewed with the Recruiter and HR Director during my onsite interview process. Both individuals were prepared and fully engaged, and communicated well during both interviews.\r\n\r\nFollowing the interview, I sent an email thanking both individuals for the time they had taken. I never received any form of communication following the onsite interviews, and my subsequent emails. No phone call to let me know that they were moving forward with another candidate, nor a simple email communicating this decision. As a result, I was not impressed with the organization nor my experience overall.", "Interview Questions": "N/A"}, {"date": "28 Jun 2012", "title": "Marketing Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 2 weeks. I interviewed at Children's Healthcare of Atlanta (Atlanta, GA) in Oct 2008", "Interview Descriptions": "Must apply online initially. Next steps include phone screen, panel interview with your potential team and 1:1 with director and above as applicable. Prepare to address questions with specific examples, your actions and the results of your efforts.", "Interview Questions": "Tell me about a time when you made a mistake. What was the mistake, and what steps did you take to address it?"}]]