[[{"date": "19 Oct 2021", "title": "Billing Representative Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Doylestown Hospital", "Interview Descriptions": "Very detailed and lengthy. Lots of management to interview with. I interviewed in front of five to six people for the billing role. They even gave a tour/full review of what the position would entail in the day to day.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "28 Feb 2021", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Doylestown Hospital", "Interview Descriptions": "Easy interview process but hiring process was unprofessional, you have to pay for child clearance, finger printing. When i told them i had to wait they asked \"if i could borrow money from someone because i would be making full paychecks.\" Then they retracted the offer because i could not get the things i needed done fast enough for them", "Interview Questions": "what is your experience in this field "}, {"date": "29 Sept 2020", "title": "Patient Care Technician Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Doylestown Hospital", "Interview Descriptions": "The interview started by meeting with the Human Resources representative. She asked you five generic interview questions and recorded your answers onto a piece of paper. She was a very sweet lady. Next, you met with the nursing coordinator. She then asked you similar questions and took you on a tour of the floor that you applied to.", "Interview Questions": "Why do you think you are a good fit for a PCT? What is a moment you are proud of? What is a time you had to step out of your comfort zone?"}, {"date": "30 Sept 2020", "title": "Assistant Teacher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Doylestown Hospital", "Interview Descriptions": "I applied online and then did an in-person interview. Pretty sure the person hired me because we went to the same undergrad! Very easy process and the woman in charge was such an angel!", "Interview Questions": "What values do i have that align with children's village"}, {"date": "30 Aug 2020", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Doylestown Hospital (Doylestown, PA) in Jun 2020", "Interview Descriptions": "Two interviews: a competency test administered by HR followed by an interview with nurse managers. Neither is too challenging; they ask basic situational questions. However, after completeing both, I did not hear back for over 2 months. When HR finally notified me, I was told that internal candidates were selected for the position. I assumed I was not getting an offer based on the amount of time that went by.", "Interview Questions": "Tell me about a time you experienced conflict"}, {"date": "7 Oct 2019", "title": "Patient Care Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Doylestown Hospital", "Interview Descriptions": "Applied online. Received a phone call about 2 to 3 days following online application to set up interview date and time ( around a week or so later). Interviewed with HR then the unit manager.", "Interview Questions": "Why Doylestown Hospital?"}, {"date": "4 Oct 2019", "title": "Senior Director Finance Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at Doylestown Hospital", "Interview Descriptions": "The recruiting team was good to work at the beginning of the process. I went through two rounds of interviews, first with a member of executive management and then with colleagues for the position.  The interview process was seamless, I’m not sure if my experience fit completely with the role. My negative review comes from the fact they never communicated that I didn’t get a job, after 2 rounds of interviews the least a company can do is send a form email saying the role went to someone else. I wouldn’t work for a company that ghosts prospective employees.", "Interview Questions": "What my knowledge of upcoming changes in Medicare reimbursements."}, {"date": "31 Jan 2018", "title": "Dietitian Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Doylestown Hospital (Doylestown, PA) in Nov 2017", "Interview Descriptions": "The interview process was very simple. It was easy to schedule an interview. I sat down with HR first for a brief interview and then she passed me along to the director.", "Interview Questions": "How would you handle a situation with a difficult patient? \r\nWhat made you want to work here?\r\nWhat is you comfort level with TPN?"}, {"date": "29 Mar 2017", "title": "Supervisor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Doylestown Hospital (Chalfont, PA) in Mar 2017", "Interview Descriptions": "You arrive at the HR department. Someone gives you an application to fill out and part of the packet is a reading test a 5 year old would pass and some other questions to fill out.", "Interview Questions": "Do you have a problem with writing people working for you up."}, {"date": "15 Jul 2015", "title": "Hostess Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Doylestown Hospital", "Interview Descriptions": "I applied online and got a call back about 2 weeks after. I scheduled for an interview at the hospital with a lovely recruiter named Carla. I was extremely nervous, yet she was extremely understanding, cheerful and encouraging. She asked me a few questions, then told me a rough overview of the pay and how everything worked out. \r\nShe then gave me a walk down to the cafeteria and another lady interviewed me. This interview seemed more serious and the questions she asked were more detailed and harder. The whole interviewing process was an hour and a half.", "Interview Questions": "How did you overcome a recent challenge in your life?\r\nHow did you deal with a coworker that wasn't doing their work and was affecting you?\r\nWhat are signs you show people that you are listening?"}], [{"date": "16 May 2017", "title": "RN Case Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Doylestown Hospital (Doylestown, PA) in Apr 2014", "Interview Descriptions": "easy to apply on line HR responded in a timely fashion. HR  was responsive  and brought you to the department for the interview. panel interview of future peers that was fair and comfortable.", "Interview Questions": "what you would expect"}, {"date": "13 Jan 2014", "title": "Host Backslash Utility Worker Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Doylestown Hospital", "Interview Descriptions": "you will go through at least three or four interviews for a mediocre to sub level job", "Interview Questions": "nun just show persistence"}]]