[[{"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "FNE", "rating": "4.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "29 Sept 2018", "job_title": "FNE in Bogotá, Bogota", "duration": "N/A", "pros": "good stipend. \r\nhelp with visa and documents.", "cons": "the mentors have too many fellows to manage sometimes. Would be better to have more native Colombians to participate."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 4, "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Juggling too many balls at once", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "15 Mar 2021", "job_title": "Regional Coordinator in Bogotá, Bogota", "duration": "N/A", "pros": "There is a very human, very open vibe at HFC. People try to prfioritize that person-to-person connection.", "cons": "Very complex, bureaucratic and tongue-tied communication. Hard to get things moving from point a to point b."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Biggest mistake I ever made", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "28 May 2016", "job_title": "Fellow in Envigado", "duration": "N/A", "pros": "I don't have anything positive to say", "cons": "Signing up to this program was the biggest mistake I ever made. I was placed in an unfit school where I was never wanted, forced to work 20 hours with a co-teacher who was impossible to communicate or work with. I sat on the side and wasted my time doing absolutely nothing. Then when I finally started to teach, I taught five hours over the 8 weeks I was at the school, with 4 out of those 5 teaching hours alone in a classroom with 40, fifteen year old students… when I barely speak Spanish. \r\n\r\nMyself and the other fellow at the school made it very clear that we were both miserable the entire time. HFC did not care and I was forced to give an ultimatum that if they didn’t transfer me, I was going to quit because I could not mentally cope with my situation. The ministry refused to transfer me due to ‘quotas’, even when I was told there were spots available at other schools.\r\n\r\nThe school had three previous fellows before us and all three had problems and HFC still placed two new fellows into a school with a hostile environment.\r\n\r\nMy advice to anyone considering this program,: If someone asks for a 'commitment deposit', its because people aren't commiting for a reason."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "English Teaching Fellow Colombia", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "23 Mar 2018", "job_title": "English Teaching Fellow in Santa Marta, Magdalena", "duration": "N/A", "pros": "The organization tries their best to make you feel comfortable and safe while in the country. I had no problems reaching out to my regional coordinators for help and they were always available. The training we received when I arrived in July of 2016 was excellent.", "cons": "A bit disorganized but I never had a huge issue with the program. I know others that have. I did have a problem with the recruiting process. Some of the other fellows only seemed to want to travel and didn't do their job well."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "English Teaching Fellow", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "9 May 2017", "job_title": "English Teacher in Itagüí", "duration": "N/A", "pros": "To contribute to changing the lives of Colombian students and exposing them to the opportunities available to them for being Bilingual.", "cons": "Most students have extremely low level of English and its hard to carry out a class without the use of Spanish therefore they are not motivated all and see need in putting in effort to learn."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 0, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 1, "Senior Management": "N/A", "review_title": "Teaching Fellow", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "28 Sept 2016", "job_title": "English Teacher in Envigado", "duration": "N/A", "pros": "I have no pros to share.", "cons": "I regret signing up for this program. I came here with the intention to teach English while learning about Colombia and its culture. During my interview and orientation, I was told that we would be TEACHING alongside a Colombian teacher and that the teachers and people were happy to have us here. I found all of that to be untrue. The teachers do not want to share their classroom or even want fellows at the schools. I am actually working in Envigado at one of the best schools in the city apparently, but am shocked at how unprofessional and petty the staff are. I have been insulted and lied on plenty times since arriving. I have offered much advice and ideas to my co-teacher only to be pushed back and made to feel as if i am not welcomed. \r\n\r\nThe teachers try many things to get their way such as embarrassing or undermining fellows in front of the students. The teachers also do not want the students to respect us. No matter how hard we try to fit in and go with the flow, the teachers find something to complain about so that they won't have to work with us. I feel very sorry for the students as they are not learning as much as they should be. Many of the teachers look for reasons to skip class. I have been left with the student's alone many times (breach of contract) with out proper notice. I am not sure if the teachers actually enjoy teaching or are just teaching for a paycheck. The ministry however, does not reprimand the teachers or deal with the unfortunate situations that happen in their schools. \r\n\r\nIf you are coming to Colombia to party or just to say that you are doing something then this program may be a good fit. If you are coming for the teaching and cultural experience, then I would not recommend this program."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Stay away from this company!", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "11 Oct 2017", "job_title": "Volunteer in Bogotá, Bogota", "duration": "N/A", "pros": "They have Interesting  government projects\n\nUnlike other companies in Colombia, they do have bilingual staff who are able to communicate in English.", "cons": "Asks from employees more than they pay for.\n\nManagement is 100% inefficient\n\nVolunteering is the same as working a full time job at the price of a stipend.\n\nChanging lives is just a pretext for overwork.\n\nLots of policies against volunteers\n\nBeware of the documents you sign,  everything you sign is pro them vs you."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "ESL Teacher", "rating": "4.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "14 Apr 2018", "job_title": "Anonymous Employee in Medellín, Antioquia", "duration": "N/A", "pros": "HFC provides a great experience to teach students English and share a new culture with them. It's very rewarding!", "cons": "Classes at the schools were often cancelled without warning. This was challenging, but also comes with working in a different culture."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 4, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "'Volunteer' English Teacher Colombia", "rating": "2.0", "reviewer_affiliation": "Current Employee", "job_date": "23 Nov 2015", "job_title": "Volunteer English Teacher in Tunja, Boyacá", "duration": "N/A", "pros": "'Volunteering' stipend is more than most professionals are paid, including starting teachers.\r\nLots of holiday time.\r\nColombia students are great", "cons": "Dealing with the political rubbish from the Ministry of Education is a nightmare."}], []]