[[{"date": "15 May 2021", "title": "Staff RN Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Liberty Hospital", "Interview Descriptions": "Very casual. Introduced to other employees who made the environment seem unwelcoming. The hospital itself seems outdated. Also told that they get patients who aren’t part of their unit, which seemed annoying.", "Interview Questions": "What makes you interested in us?"}, {"date": "7 Dec 2017", "title": "Sterile Processing Technician Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Liberty Hospital (Liberty, MO) in Dec 2017", "Interview Descriptions": "Horrible!  I work night shift and state around for 2 hours because my interview was scheduled for 8 am the next day.  The person I was scheduled to meet with was late.  Then when She did arrive she ignored me.  She made almost no eyecontact and was frequently interrupted with phone calls and staff.  Someone barged in to tell her how someone failed to do something and she barked about how that person would need to be written up.  Then she just asked if I had questions for her.  There was no actual interview or chance for me discuss my experience!  It was a waste of time and a complete joke!!!!  Especially after HR just told me how I was going to be informed of certification opportunities and how I would eat a bonus for the 5 years of time in grade I've spent here.  None of that was addressed in the\"interview.\". Basically I was an inconvenience to my interviewer.  This place is a JOKE and after 5 years of work at the lowest pay in the region I am DONE!  Do NOT waste your time with these people!  Aim for North Kansas City I hear they at least look at you during the interview there.", "Interview Questions": "The ONLY question they asked me is if I had any questions for them."}, {"date": "11 Oct 2017", "title": "Graduate Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 4 weeks. I interviewed at Liberty Hospital (Kansas City, MO) in Oct 2017", "Interview Descriptions": "She discussed the position and the opening. Then asked me to tell about my clinical experience and why I want to be a nurse. Then she asked me some questions about my experiences.", "Interview Questions": "Have you ever had a difficult or demanding patient during clinical and if so how did you  deal with him or her?"}, {"date": "14 Jul 2017", "title": "Pharmacy Technician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Liberty Hospital in Jul 2017", "Interview Descriptions": "Applied July fourth, got a email request for a phone interview a week later. I did the phone interview today, it lasted about 15 minutes, I rehearsed my questions, and I answered with ease, towards the conclusion, she talked about the wages, and shift hours, and on the job training, so I'm not sure if that's a good sign, you can always speculate, but a call back is a sure sign. She told me to wait till the end of next week, so I'm not sure right now.", "Interview Questions": "Why do you want to work at Liberty hospital?"}, {"date": "31 Mar 2017", "title": "Event Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Liberty Hospital (Liberty, MO) in Jan 2017", "Interview Descriptions": "After the online form and personality test, there was a phone interview with HR staff followed by an In Person Interview with Director of the Foundation. The phone interview was generic, and the HR screener didn't know many specifics. The in person went well, but I didn't receive a follow up. It was over a month before I heard back.", "Interview Questions": "Why are you looking for a new job?"}, {"date": "8 Jul 2020", "title": "Sleep Technician RPSGT Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Liberty Hospital (Liberty, MO) in Oct 2016", "Interview Descriptions": "Cordial, relaxed and speedy.  Managers and peers all rolled into one interview.  Management asked pertinent organization questions while the staff asked the technical/knowledgeable questions.  I wasn't made to feel awkward or uncomfortable at things I didn't have an answer for.", "Interview Questions": "What are your strengths, what are your weaknesses, why are you wearing jeans to an interview?"}, {"date": "6 Apr 2016", "title": "Financial Counselor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Liberty Hospital (Liberty, MO)", "Interview Descriptions": "The manager of the department and their manager interview you after an interview with HR. The whole process takes around a month. The manager didn't know anything about this position and her manager did the interview. She will try to catch you off guard and make you uncomfortable so be prepared", "Interview Questions": "How do you handle gossip?"}], [{"date": "7 Sept 2017", "title": "Human Resources Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Liberty Hospital (Liberty, MO) in Jan 2016", "Interview Descriptions": "applied and heard back in 1 week, interviewed, friendly, personable, good questions. 2 way interview. 30-40min phone interview, followed up with emails during the entire process after each step. 24hr email return rate", "Interview Questions": "what is your goal for this position?"}, {"date": "21 Jan 2016", "title": "Nurse Practitioner Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Liberty Hospital (Liberty, MO) in Jul 2015", "Interview Descriptions": "Laid back, great questions, no \"politics\" in the interview.  Questions were straight forward.  Allowed plenty of time to ask questions of my potential employer.  The conversation was very give and take, and very comfortable.", "Interview Questions": "What is your goal career path?"}, {"date": "17 Jul 2015", "title": "Lab Department Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Liberty Hospital (Liberty, MO) in Apr 2015", "Interview Descriptions": "A professional, succinct, and understanding interview process. I went in to talk with the manager and she asked me about my future plans, job expectations, and said that they like to hire pre-med students. The hospital has been hiring employees recently since their recent layoff, they have a lot of projects in the work, and they are constantly upgrading their facilities.", "Interview Questions": "What are your future plans?"}]]