[[{"date": "7 Jul 2023", "title": "Patient Care Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Medical City Denton (Denton, TX) in Feb 2023", "Interview Descriptions": "The questions are harder than I expected, but I was able to answer the questions well. I had at least 2 people interview me. They have manager interviews and peer interviews.", "Interview Questions": "Q: How do you see yourself in 5 years?"}, {"date": "4 Jan 2023", "title": "Clinical Resource Director Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Medical City Denton in Dec 2022", "Interview Descriptions": "Telephone interview with system recruiter. Ended call by stating she would refer to the hiring manager with recommendation to progress forward. Titled as Director but recruiter stated not a true leadership position and no direct reports. Transparent that salary well under $90k and only has onsite option. No further response until I received declination letter two weeks later.", "Interview Questions": "Usual; why do you want to work for HCA, tell me about your experience, what are the top three strengths and weaknesses your former employer would say about you, etc."}, {"date": "12 Oct 2022", "title": "Graduate Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Medical City Denton", "Interview Descriptions": "Grad Bash. It was students and graduates from the metroplex. Apply to each location and unit then interview in 30 minutes at each table. Each table had a nurse manager and director there to answer questions. The questions were pretty typical you would see in an interview. There were not any scenario questions. I felt that to see how you would react to intimidation or making eye contact, at least one of the panel would not really speak to you or pay attention to you through eye contact or they would ask forward questions. I think that was to see if you were confident or not or test how it made you react to a difficult situation.", "Interview Questions": "Why do you want to be a nurse?"}, {"date": "5 Sept 2021", "title": "Patient Care Technician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Medical City Denton (Denton, TX) in Jun 2021", "Interview Descriptions": "Was asked behavioral interview questions and some patient care scenarios were given. Since it was in the ER we had to do a prioritization scenario. The interview process was not very difficult but you definitely had to have some knowledge. The hiring manager was very nice.", "Interview Questions": "How would you describe yourself? \nTell me about a time you failed.\nTell me about a time you receive feedback and how you used that to improve. "}, {"date": "14 Oct 2020", "title": "Nurse Extern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Medical City Denton (Denton, TX) in Oct 2020", "Interview Descriptions": "I waited 3 weeks after I applied. There were two interviews, two different people... one with a nurse, the other one with HR person. All the questions were the same type of questions asking about clinical experience. It was an easy process", "Interview Questions": "Tell me about a time that you shared too much info about something that you shouldn't? What did you do?"}, {"date": "24 Mar 2023", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 1 day. I interviewed at Medical City Denton in Jan 2020", "Interview Descriptions": "In person interview with manager after signing up for interview for emergency department, or any other department that's accepting interviews. Only had to do one interview, and it went really well.", "Interview Questions": "Case study questions. Hardest thing you've had to deal with. What have you had to overcome."}, {"date": "18 Apr 2019", "title": "Echo/CV Ultrasound Tech PRN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Medical City Denton (Denton, TX) in Apr 2019", "Interview Descriptions": "Arrived 15 minutes early. Was easier than expected! It was one on one which was unexpected and I did not have to do a scan interview either. The lady that interviewed me was very kind and pleasant and the interview was much less stressful than expected!", "Interview Questions": "Why I decided on this degree?"}, {"date": "24 Nov 2020", "title": "Radiologic Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Medical City Denton (Denton, TX) in Mar 2019", "Interview Descriptions": "You interview with the managers of the department first. Then if they approve you move on to a another interview with a small group from other departments who ask you questions. If they like you, then you get an offer!", "Interview Questions": "How would you respond to a coworker who’s view were different than your own?"}, {"date": "29 Oct 2018", "title": "Graduate Nurse Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at Medical City Denton", "Interview Descriptions": "A recruiter sent me a text asking if I wanted to interview with this hospital at the intern event. Went to the intern bash for initial interview. Was called for follow-up interview on campus and told it would be a peer interview. Went, but it was not a peer interview, it was a second interview with the same people from the first interview. Then had a third interview, cultural interview, that same day with some nurses and a social worker from other parts of the hospital. Said I would be contacted to schedule the peer interview as the next step.", "Interview Questions": "How are your IV skills?"}, {"date": "24 Feb 2017", "title": "RN Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Medical City Denton (Denton, TX) in Dec 2016", "Interview Descriptions": "I applied online and got an interview scheduled within a few weeks. The ER was hard to navigate as they were going through a remodel. I was initially interviewed by 2 experienced nurse managers who were very nice. Then I was taken to separate room where I was interviewed by a new nurse, more experienced nurse, and a nurse manager. All of the staff were very kind and welcoming. Although I did not get the job I felt it was a good experience and would have been a good place to work. I heard back by email within a week.", "Interview Questions": "Why do you want to work in this department?\r\nHow would your nursing instructor describe you?\r\nHow would you rate your attendance record?\r\nDescribe a time when you had a difficult patient and how you handled the situation.\r\nName 3 characteristics you need to work in this department and a time you have used each of these.\r\nWhat do you do when you have a very opinionated patient?\r\nWhere do you see yourself in 3-5 years?\r\nDo you have any questions for us?"}], [{"date": "3 Jun 2014", "title": "Hospitality Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 1 day. I interviewed at Medical City Denton (Denton, TX)", "Interview Descriptions": "I had one interview with the food service director and clinical nutrition manager. It was in a very intimate location next to the kitchen. The director asked questions along the lines of how I felt about doing certain activities. The Dietitian gave examples of situations with patients and diets. After getting a call back I had two days of orientation. The first was in Irving and the second was at the actual facility. The second day of orientation was followed by a shadowing period. Come dressed to work that day. I didn't and had to leave early because no one told me it was a full day of work.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "3 Jun 2014", "title": "PRN Cardiac Sonographer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 5 weeks. I interviewed at Medical City Denton (Denton, TX) in Dec 2013", "Interview Descriptions": "Very detailed, HR was very through and made sure all my information was correct even though I was a transfer from another facility with in the company. The employee heath information cleared immediately it seam to be the university verification information that took so long due to it being a holiday.", "Interview Questions": "N/A"}, {"date": "18 May 2013", "title": "EVS Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Medical City Denton (Denton, TX)", "Interview Descriptions": "Was asked about 7-10 behavioral questions like what makes a good employee or a good manager.", "Interview Questions": "N/A"}]]