[[{"date": "6 Jun 2022", "title": "Admissions Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Chatham University", "Interview Descriptions": "Halfway through the interview, I realized that they were looking to fill a position that wasn't what the job description had described. Even though I was now underqualified for this position, I thought the interview went really well. However, I never heard back from them. The least they could have done was tell me that I was underqualified. It seemed that they were looking for a very specific person and based on my resume, they should have never interviewed me if that was the case.", "Interview Questions": "What prior experience do you have?"}, {"date": "5 May 2022", "title": "Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Chatham University", "Interview Descriptions": "I had a decent interview experience. There were approximately four committee members in my interview. I got the job in the end and appreciated the attention to detail with the questions.", "Interview Questions": "Tell me about yourself and your experience"}, {"date": "3 May 2021", "title": "Data Entry Clerk Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Chatham University (Pittsburgh, PA) in Apr 2021", "Interview Descriptions": "There was one virtual interview where they asked about my experience with data entry and any projects I've worked on. Then there was a 2 hour in-person interview with essentially the same questions about experience/projects. After going through 2.5 hours of interviews, they never even sent me a rejection email, which I find incredibly rude.", "Interview Questions": "What are some projects you've participated in when it comes to data entry?"}, {"date": "20 Feb 2020", "title": "Social Media Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Chatham University (Pittsburgh, PA) in Sept 2019", "Interview Descriptions": "Supervisor is easygoing, interested in past experience and personality.  Got to meet with all of the other staff members and was contacted shortly after to let me know I had gotten the position.", "Interview Questions": "Give an example of a brand you believe is doing well on social media, and a brand you believe is not. "}, {"date": "6 Sept 2018", "title": "Resident Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Chatham University (Pittsburgh, PA) in Aug 2017", "Interview Descriptions": "It was kept to the point to assess the candidates qualifications and to get to know the skills of candidates under certain situations and scenarios. They also test what the candidate can bring to the table in addition to the required skills.", "Interview Questions": "How will you resolve conflicts between students"}, {"date": "8 Mar 2017", "title": "Social Media Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Chatham University (Pittsburgh, PA) in Dec 2016", "Interview Descriptions": "Lengthy process, had 4 interviews with multiple people, with 1:1 and including a phone interview, had to write some social media copy, discuss how past experiences will benefit them as well as some new novel ideas that I could bring to the table and/or change the way they did their social marketing.", "Interview Questions": "How do you reach different levels of social media users?"}, {"date": "22 Jul 2016", "title": "Assistant Professor Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Chatham University", "Interview Descriptions": "After a fair but well-controlled Skype interview we went to the school to perform a personal interviewing process. The professors were very polite and nice but one of them was already leaving the school after one year job to attend another university opportunity elsewhere... not a very good sign!. The main interviewer (the immediate dean) was clearly a snobby person and during the interview lecture there were basically no audience other them the dean himself, a secretary (who slept right at the beginning of the presentation) and the vice president, a very nice and enthusiastic person. But it is frustrating to see the lack of organization established during the interview presentation...", "Interview Questions": "fair questions but there was no clear indication of what the selected candidate would be teaching for the next semester... Not even a medium or long term plan. So the difficulty part of the interview was to position yourself to a job where the main interviewer had no clear idea of what you would be teaching and for what kind of audience. That is the reason I classified as difficult the interview process..."}, {"date": "12 May 2016", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Chatham University (Pittsburgh, PA)", "Interview Descriptions": "The interview process was straight forward. There was a phone interview and an in-person interview. The interviewer was very professional and polite. During the in-person interview, I met with several people that work at various capacities and levels within Chatham. Overall, it was a positive experience. I was asked very clear employment questions that were based on my past work experiences.", "Interview Questions": "Why are you interested in this position?"}, {"date": "3 Apr 2015", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2+ months. I interviewed at Chatham University (Pittsburgh, PA) in May 2014", "Interview Descriptions": "In the beginning, there was a short online survey and some email communication with Admissions. After I sent away my application for the program, I received an invitation to visit the campus and have a lunch interview. After a few days I got a personal offer send by email and I had enough time to think about my response as long as I needed. The whole process was very fair and open!", "Interview Questions": "Why are you interested in this job?"}, {"date": "8 May 2013", "title": "Information Technology Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Chatham University (Pittsburgh, PA) in Sept 2009", "Interview Descriptions": "Most students are hired after filling out the required paperwork and going through a simple interview process.", "Interview Questions": "Why do you want to work for Chatham University Information Technology?"}]]