[[{"date": "N/A", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at The Guthrie Clinic (Sayre, PA) in Nov 2022", "Interview Descriptions": "Panel interview, but they made me feel very relaxed and were great to talk to. Timely follow up, it was nice not to have to wait weeks to find out if I got the job.", "Interview Questions": "Talk about a time where you had a such a bad shift you wanted to quit and how you dealt with it."}, {"date": "27 Jun 2023", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at The Guthrie Clinic (Sayre, PA)", "Interview Descriptions": "I have an interview coming up soon. I'm looking for advice. So far the turnaround has been quick. I was contacted 24 hours after I applied and the interview is in one week.", "Interview Questions": "Please tell me about yourself?"}, {"date": "27 Jan 2023", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at The Guthrie Clinic", "Interview Descriptions": "The interview process was easy and organized. HR was very helpful initially and then after I was hired they seemed a little disorganized. Zoom interview and quick response. Staff was friendly", "Interview Questions": "Tell us about a time you showed compassion for a patient"}, {"date": "14 Feb 2023", "title": "Patient Care Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at The Guthrie Clinic (Towanda, PA) in Jan 2023", "Interview Descriptions": "Very easy interview! I was made to feel very welcome and listened to. I was given proper time to answer questions and she answered all of my questions thoroughly. I left feeling very confident as well.", "Interview Questions": "What would you do if a patient was upset with you?"}, {"date": "3 Nov 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at The Guthrie Clinic (Syracuse, NY) in Oct 2022", "Interview Descriptions": "Very warm and welcoming. Encourage asking questions and were very interested in my experience. Multiple members of management present allowed me to get a feel for how everyone interacts and what are the core priorities of the organization. There was a very positive attitude and they really took ample time explaining the position, onboarding process and next steps. A terrific experience overall.", "Interview Questions": "Tell me about your experience."}, {"date": "2 Nov 2022", "title": "Patient Service Specialist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at The Guthrie Clinic in Oct 2022", "Interview Descriptions": "Easy interview, quick turnaround. I was unhappy with employee health though as I live an hour from the Sayre facility and applied to an office that was much closer to my home. I was told I needed to get a mandatory vaccine and I could not get it at a closer office and I could not get it done on a day I would already be up there for onboarding. It would be great if they were more accommodating. Otherwise everything else was relatively easy.", "Interview Questions": "Do you feel the experience you have relates to the job you applied for?"}, {"date": "1 Mar 2022", "title": "Physician Recruiter Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at The Guthrie Clinic in Jan 2022", "Interview Descriptions": "Started with phone screen, and then was invited to on-site visit.  Was able to meet each member of the team and get a great sense of the position. The on-site portion was broken up into separate 30 minute sessions.", "Interview Questions": "Do you work best individually or in a team?\r\nTell a time that you had to deal with a rejection."}, {"date": "3 Nov 2021", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Guthrie Clinic", "Interview Descriptions": "The intervew uses some behavioral questions. More on situational question and answer rather than the typical interview style. The interview questions are direct to the point and has clear and concise questions. Over all it is a good interview process.", "Interview Questions": "How to handle conflict with a coworker or relative of the patient"}], [{"date": "18 Jul 2021", "title": "Nurse Practitioner Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at The Guthrie Clinic (Sayre, PA) in Jul 2021", "Interview Descriptions": "Multiple providers at different times as well as some members of the management team. It was well organized and they made me feel at ease. Definitely would recommend them for others.", "Interview Questions": "What do you envision your clinic like?"}, {"date": "21 Dec 2020", "title": "Health Administration Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Guthrie Clinic (Sayre, PA)", "Interview Descriptions": "Once you apply it might take up to a month to get a phone interview, then in-person interview is to follow about a few weeks to a month after. The interview is half a day long but if you get the job you will be offered it within a few business days.", "Interview Questions": "What is your professional background?\r\nLots of behavior questions. "}, {"date": "22 Jun 2021", "title": "Data Entry Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at The Guthrie Clinic in Dec 2020", "Interview Descriptions": "One phone interview with HR and then Zoom interview with hiring manager. Must pass physical and drug screening as well which caused process to be a bit drawn out. The reference system was also slightly complicated and sent emails to references with no indication of what it was for ie not including company name", "Interview Questions": "What are your long-term goals? Do you see yourself working here for a long time?"}, {"date": "13 Dec 2020", "title": "Licensed Practical Nurse (LPN) Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. I interviewed at The Guthrie Clinic (New York, NY) in Jan 2020", "Interview Descriptions": "My experience with the Guthrie Clinic interview was basically them asking your regular interview questions. Both people interviewing me were very kind. I did unfortunately turn the position because they offered me $16/hr, and honestly that was very offensive to me.", "Interview Questions": "Positive interaction with a patient "}, {"date": "28 Oct 2019", "title": "Eviromental Service Aide Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at The Guthrie Clinic", "Interview Descriptions": "Interview was okay. It was kinda awkward. My interviewer seemed awkward. There was alot of commotion the day of my interview and no one could point me in the right direction.", "Interview Questions": "What was your most difficult thing to do in your previous job?"}, {"date": "21 Oct 2019", "title": "Mental Health Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at The Guthrie Clinic (New York, NY)", "Interview Descriptions": "Got a phone call from the department to schedule interview. Interviewed with 3 senior members of the dept. Turned into a very good conversation, very friendly and down to earth. Talked about my career plans and qualifications and why I wanted to work here. Was offered the job.", "Interview Questions": "what was your fav part of your last job?"}, {"date": "28 Oct 2019", "title": "Patient Service Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at The Guthrie Clinic (Corning, NY) in Jul 2019", "Interview Descriptions": "The interview process was good it was very well done and informative. I was able to ask questions and keep it professional and relaxed. We covered a range of different topics.", "Interview Questions": "Why did i choose Guthrie"}, {"date": "5 Nov 2018", "title": "Information Technology Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at The Guthrie Clinic", "Interview Descriptions": "Interviewed by Supervisors and employees. HR takes a long time to call back after application submission. You must pass a personality test during application submission or you will not be considered for a first interview.", "Interview Questions": "How you would benefit Guthrie. Your previous experience. How long you intend to stay at this job role."}, {"date": "29 May 2019", "title": "Athletic Trainer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at The Guthrie Clinic (Sayre, PA) in Sept 2018", "Interview Descriptions": "The hiring process began with a rather complicated application and irrelevant detailed questionnaire geared at only Doctors and Nurses.  However, once meeting with the folks in person it was clear they understood my profession and why I was applying.", "Interview Questions": "Why did you choose the Guthrie Clinic?"}, {"date": "13 Nov 2019", "title": "Patient Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at The Guthrie Clinic (New York, NY) in Aug 2018", "Interview Descriptions": "Filling out an application and sending in resume with application. Then received a call to come in for an interview. Was then called a few days later and offered the position. I happily agreed to take the position and then started my hiring process of signing the work agreement and conducting background check and drug testing.", "Interview Questions": "Why do you want to work here?"}], [{"date": "31 Aug 2017", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Guthrie Clinic (Sayre, PA)", "Interview Descriptions": "Human resources called to set up interview. Interviewed with department manager then several staff from the department.  Gave examples of what they asked. They were impressed with my resume. Received a call 2 days later with an offer.", "Interview Questions": "typical interview questions on experience, prioritizing, case scenarios"}, {"date": "28 Sept 2017", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at The Guthrie Clinic (Corning, NY) in Jul 2017", "Interview Descriptions": "I applied my resume to corning hospital online first, and then I got an email which asked me for  references. For me, it took more than 1 month to get an interview. I met a nurse manager first and I had an interview with 2 managers. I was nervous but they made me feel comfortable during the interview. After the interview, I got a job offer a few days later.", "Interview Questions": "General questions - like introduce yourself, why did you become a nurse? what is your nursing experience? what is your strength? and so on. "}, {"date": "12 May 2017", "title": "Nurse Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. I interviewed at The Guthrie Clinic (Sayre, PA) in May 2017", "Interview Descriptions": "Have to take new test to be hired 100 questions if failed do get job I didn't get hired didn't pass test  wish I would have got it but no chance", "Interview Questions": "If your smart enough to be hired"}, {"date": "12 Sept 2017", "title": "Marketing Communications Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. I interviewed at The Guthrie Clinic (Sayre, PA) in Sept 2015", "Interview Descriptions": "My interview consisted of three in-person interviews - one with a group of peers, one with the person who would become my direct supervisor, and one with the department VP. I was able to do all three in one day due to residing a long distance away. Following the interviews, I completed a one-hour skills assessment on site. The whole process took four hours.", "Interview Questions": "Tell me about a project you worked on that did not go as planned and how you handled it."}, {"date": "22 Sept 2017", "title": "Medical Coder Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Guthrie Clinic (Sayre, PA) in Jul 2015", "Interview Descriptions": "Applied to the job by submitting an application and resume online.  Got a call from HR to come in for an interview.  Interviewed with the Manager and Director of the department. \r\n Was asked some specific questions related to the field and not just personality questions. \r\n Was asked to complete a skills test after the interview.  Received a call from HR a couple days later with a job offer.", "Interview Questions": "How do you manage your time to be able to complete necessary daily tasks?"}, {"date": "11 Sept 2017", "title": "Marketing Specialist Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Guthrie Clinic (Sayre, PA) in Apr 2015", "Interview Descriptions": "I was contact by an administrative assistant in the department three weeks after applying yo schedule an interview. The first interview was a team interview with members representing different job responsibilities. I was contacted two weeks later for a second interview, which included a meeting with the VP and another group interview with the same people. I also performed a skills test. A representative of HR called me three weeks late to offer me the job.", "Interview Questions": "How do you prioritize your work?"}, {"date": "3 Feb 2017", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at The Guthrie Clinic (Sayre, PA) in Nov 2013", "Interview Descriptions": "wonderful! Met with the Unit supervisors who may have hired me- wonderful, honest, personable managers who listened to my story and took a chance! I was offered a position 2 days later.", "Interview Questions": "N/A"}, {"date": "15 Mar 2016", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at The Guthrie Clinic (Sayre, PA) in Jan 2012", "Interview Descriptions": "Very organized, was set up with 4 Nurse Managers in one day, all based on the preferences and experiences I had. Very relaxed atmosphere, and Managers were proud of their nursing staff. Offers were made to me within 2 days of interviews.", "Interview Questions": "What strengths do I bring to the position?"}, {"date": "2 Jun 2011", "title": "Summer Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 1 day. I interviewed at The Guthrie Clinic (Sayre, PA) in Apr 2011", "Interview Descriptions": "A series of questions were asked in order to determine the ability and interest of the possible hire. Phone interview was conducted and offer was made that day.", "Interview Questions": "what have you learned that can contribute to the position here?"}]]