[[{"date": "5 May 2023", "title": "Sourcer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Memorial Health (Springfield, IL)", "Interview Descriptions": "The first step was a short phone interview. It was relaxed and not high pressure. It was then followed by a longer virtual interview with the hiring managers where a longer dialogue allowed me to ask all my questions and share my knowledge and skills with them", "Interview Questions": "What are ways that keep you organized in a fast paced environment"}, {"date": "22 Nov 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Memorial Health", "Interview Descriptions": "Had an initial phone interview with HR who then set up a zoom interview with the manager of the department. Shortly after received an offer per phone from HR. Pretty standard process", "Interview Questions": "Tell me how you would handle a difficult situation such as you were overwhelmed with patients."}, {"date": "8 Jul 2022", "title": "HR- Department Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Memorial Health", "Interview Descriptions": "It was a simple, easy to follow process. The recruiter was helpful and gave me valuable information. He / she responded to all of my questions. He / she kept me informed.", "Interview Questions": "What are some of your strengths and weaknesses?"}, {"date": "26 Jun 2022", "title": "Pharmacy Technician Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Memorial Health (Springfield, IL) in Jun 2022", "Interview Descriptions": "The process was smooth and the recruiter was friendly and answered all of my questions. The interview questions were pretty straightforward. The entire process was explained to me so I knew what to expect.", "Interview Questions": "What would you do if you had a disagreement with a coworker?"}, {"date": "18 Feb 2022", "title": "Software Engineer Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Memorial Health", "Interview Descriptions": "Great exp. Interview process was based on basic concepts, software e design and testing. One online test and 2 on site interviews. Online test was mid difficult level. On site interviews were with HR and team. Easy to moderate level of questions in on site interviews.", "Interview Questions": "Intro\r\nObject oriented design questions\r\nSql\r\nPython"}, {"date": "7 Aug 2022", "title": "Senior Instructional Designer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Memorial Health (Springfield, IL) in Oct 2021", "Interview Descriptions": "I spoke 15 min with a recruiter by phone, followed by an hour with department director via MS Teams. Both were pleasant experiences. I wanted the job, but didn’t get it, probably because I didn’t have a relevant enough portfolio.", "Interview Questions": "Experiences that would align with the position."}, {"date": "21 Oct 2019", "title": "Consultant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 7 weeks. I interviewed at Memorial Health (Springfield, IL)", "Interview Descriptions": "Completed a phone interview and was asked to send my references an online form to complete. I followed up 2 weeks later after receiving no communication. I received no response to my email. 5 weeks after that I received an email stating I wasn’t selected. I never heard from the recruiter again after the phone interview; only a declination email 7 weeks later.", "Interview Questions": "Situational questions... tell me a time when"}, {"date": "30 Sept 2019", "title": "Physical Therapist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Memorial Health (Jacksonville, IL) in Sept 2019", "Interview Descriptions": "First I had a brief phone call interview with the HR department in which I was asked as serious of questions. Then, the HR department sent my responses to the manager at the clinic, who reviewed my resume and decided if I passed on to next step. My references also had to fill out a survey based on my skills. Then the HR department called me to schedule an in-person interview and a chance to shadow at the facility.", "Interview Questions": "Describe a time when you went above and beyond for a patient?"}, {"date": "8 Dec 2018", "title": "Accountant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 5 days. I interviewed at Memorial Health (Springfield, IL) in Dec 2018", "Interview Descriptions": "Had a phone interview first.  Then was called for a second interview.  Met with some really nice people.  Then had a third interview with the director.  Have not heard back yet.  It was only yesterday.", "Interview Questions": "Asked if I had any questions first."}, {"date": "25 Jun 2018", "title": "Medical Coder Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Memorial Health in Jun 2018", "Interview Descriptions": "Phone interview, basic screening questions, I applied online and received an e-mail to choose a time for a phone interview. Interview seemed like it went well but the weekend after I received an e-mail they did not want to proceed with me.", "Interview Questions": "Why us?"}], [{"date": "5 Jan 2019", "title": "Medical Lab Assi Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Memorial Health in Apr 2018", "Interview Descriptions": "very easy, applied for job online, was emailed about my consideration, was contacted by HR in a timely manner, interview was set up shortly after. Meeting with my potential boss went very well, she was very friendly and welcoming to the lab.", "Interview Questions": "Why I was interested in working for Memorial"}, {"date": "6 Feb 2016", "title": "IS Project Manager II Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Memorial Health (Springfield, IL) in Jan 2016", "Interview Descriptions": "Overall it was a standard corporate type of interview.  First I received an email that asked for a day and time that I would like to have a telephone interview.  The HR recruiter called a couple of minutes late big deal.  It was very robotic feeling and seemed like they wanted pre-planned answers rather than actually taking time to think about their questions and give genuine replies.", "Interview Questions": "Why do you want to leave current employer?"}, {"date": "4 Dec 2015", "title": "Secretary Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Memorial Health (Jacksonville, IL)", "Interview Descriptions": "It wasn't a difficult interview. Sometimes they do group interviews (you with 3 or so bosses) but mine was only with one person. That person asked me about my education, background, etc. I felt it was an easier interview then others. You are asked to first go to human resources for a skills & typing test.", "Interview Questions": "Tell us about your previous employment"}, {"date": "14 Feb 2015", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Memorial Health", "Interview Descriptions": "Discriminatory hiring practices. Was hired at same time of approximately 20 others. I was the only new hire who was overweight. I was forced to go through a \"fit for duty\" assessment involving heart rate monitoring while lifting weights, doing squats, bending, pushing and pulling measurements and other muscle strength/stamina exercises. Despite never having an on-the-job injury, I discovered during orientation, no other new hire had to complete this assessment.", "Interview Questions": "N/A"}, {"date": "18 Jan 2016", "title": "Pharmacy Technician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Memorial Health (Springfield, IL) in Nov 2014", "Interview Descriptions": "I had an interview with an individual from HR, she was very nice and made me very comfortable. I then went to meet the Pharmacy Manager and I had a nice conversation with him, very nice people!", "Interview Questions": "Why should we hire you?"}, {"date": "31 Oct 2013", "title": "Program Manager IT PMO Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 4 weeks. I interviewed at Memorial Health (Springfield, IL) in Oct 2013", "Interview Descriptions": "First - 30 minute interview with Search Firm (Pro-Tech)\r\nSecond - 30 minute interview with Memorial HR - Standard questions\r\nThird - 30 minute interview with PMO Manager\r\nFourth - 2.5 hour interview with IT management; Other hospital management; HR review of benefits\r\nI was an out of state candidate and I was treated very well be both Memorial staff and the Search Firm while I was on-site.", "Interview Questions": "The most difficult situation I was put in was having the department managemenet I would be working with interviewing me during my on-site at the hospital."}, {"date": "15 Dec 2015", "title": "Staff Nurse Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Memorial Health (Springfield, IL) in Jun 2012", "Interview Descriptions": "It was very difficult to get in touch with the talent recruiter for this company. My calls went unanswered without any replies to my numerous voice mails for at least two weeks. I eventually had to contact the manager of the unit to find out the status of my interview.", "Interview Questions": "The biggest topic discussed were goals and where I saw myself in five years."}, {"date": "10 Jun 2015", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Memorial Health (Springfield, IL) in Jan 2011", "Interview Descriptions": "They called my cell phone and instead of scheduling a phone interview...just started doing it right then.  Talk about unprepared. Went in first with the human resource department for their interview process. After that part was done then went and interviewed with the nurse manager on the floor they had available.", "Interview Questions": "N/A"}, {"date": "3 Nov 2013", "title": "Director, IS Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at Memorial Health (Springfield, IL) in Nov 2010", "Interview Descriptions": "Interview process was a little rocky but overall a good experience.  HR at first wanted to set-up a skype interview rather than an in person.  Initial interview was through a recruiter, then HR phone screen, hiring manager, phone screen then in person with 8 people simultaneously.", "Interview Questions": "Asking me to detail how I would fix an issue without having any details related to the problem.  Kept asking and I kept asking for a little more detail.  Impossible to answer with a definitive answer until the problem was known."}, {"date": "3 Sept 2010", "title": "IT Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 1 day. I interviewed at Memorial Health (Springfield, IL) in Sept 2010", "Interview Descriptions": "Had several phone interviews with the staffing agency then came a 60 minute interview with the HR lady and then a 30 minute interview with the hiring manager. Of the 30 minutes the hiring manager took 15 minutes to describe the position. Then asked me a few questions. I was rejected because I did not speak in depth.", "Interview Questions": "What are the three top qualities of a manager "}], [{"date": "20 Sept 2013", "title": "Patient Access Associate Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Memorial Health in Dec 2009", "Interview Descriptions": "Had to interview with HR dept and supervisor of my dept", "Interview Questions": "You have to do an hour and a half of computer based tests before you can interview with supervisor of your department"}]]