[[{"date": "7 Jun 2023", "title": "Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Occidental College", "Interview Descriptions": "The interview process was unorganized and lackluster. I had to coordinate my own interview as a result of Occidental's inability. Questions were unclear and had no value nor allowed me to share my assets as a potential team member. It honestly felt like a complete waste of time, on top of the interviewees being rude. I did not get an offer, but I am happy I did not as a result of this difficult process and the knowledge that the energy of the team was simply bad.", "Interview Questions": "How do you make decisions, Where are you located"}, {"date": "21 Mar 2023", "title": "Campus Tour Guide Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Occidental College", "Interview Descriptions": "First, you fill out a Google form with common interview questions. Then, you give a mock tour of a single place on campus, then asked common questions used in most tours.", "Interview Questions": "Parent asks about party culture"}, {"date": "11 Mar 2023", "title": "Associate Director Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Occidental College in Feb 2023", "Interview Descriptions": "I received an email invitation to interview via Zoom and scheduled a set time that was confirmed within a day. The actual interview was conducted by three people who would be working closely with and/or supervising the position I applied for. Each person briefly introduced themselves and I was given a summary of their roles, the open position responsibilities, the office/department, and a short description of the college and its culture. I was asked 5-7 questions within a 30-40 minute time frame which ranged from addressing my past experience, interest in the position and how I would fit into the role, and scenario type of questions (i.e. specific examples of past accomplishments, contributions, etc. that demonstrate your competence for the role). I was able to ask questions at the end as is usually standard. Informed of a 1-2 weeks timeline to hear back but have not heard from the interviewers as of the 2 week mark. I assume I have not been selected for the role.", "Interview Questions": "Tell us about yourself, past experience, and why you are interested in this position and how you qualify to fulfill this role."}, {"date": "6 May 2022", "title": "Accounting Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Occidental College", "Interview Descriptions": "The interview process was a conversation with the hiring manager, including some questions about office experience. It was just one step, so it was very manageable! The training was also very thorough", "Interview Questions": "They asked about previous experience and skills relating to the computer software used in the office"}, {"date": "12 Aug 2021", "title": "Academic Advisor Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Occidental College (Los Angeles, CA) in Aug 2021", "Interview Descriptions": "No email confirmation. The notification for the job opportunity was through a phone call. \n\nWas in the restroom when I told him I was going to call back. He called back after just 15 in when I was still busy and when I return the call he ignored my call. Very unprofessional way of conducting business and suggest to not work in this environment.", "Interview Questions": "Are you willing to travel more than 30+ miles?"}, {"date": "26 Oct 2022", "title": "Information Technology Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Occidental College in Aug 2021", "Interview Descriptions": "Quick and easy. Very conversational and they give you an answer about the position at the end. The interviewer was very nice and asked about your experience in the school.", "Interview Questions": "Why do you want to work at the Helpdesk?"}, {"date": "19 Apr 2021", "title": "Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Occidental College", "Interview Descriptions": "Half day interview, met with other members of the team, asked standard questions about experience. Didn't give many scenarios, asked about what I was interested in, gave a lot of time to ask questions about the position.", "Interview Questions": "Why do you want to work for Occidental College?"}, {"date": "5 Sept 2019", "title": "Front Desk Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Occidental College", "Interview Descriptions": "Process took about 2 weeks. They were considering students with work study so the job was restricted to a degree. Everybody involved with the process was really nice and made interviewing for the job comfortable.", "Interview Questions": "Tell me about yourself"}, {"date": "17 Apr 2018", "title": "Infrastructure Systems Administrator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Occidental College (Los Angeles, CA) in Mar 2018", "Interview Descriptions": "Mainly an email with five questions.   First, few questions are designed to weed out those who can't start right away and have certain salary expectations.  The last question goes over a project you worked on recently.  After a few days, you get an email from an internal resource that someone will reach out to you for the next steps.  Days go by with no call or follow up email.  I noticed the position is no longer available online.  Then a few weeks later the position is open again.  No courtesy, inform applicants to expect a followup call or email, then nothing.", "Interview Questions": "Should you be offered this position, how soon would you be available to start upon receipt of an offer?"}, {"date": "2 Apr 2019", "title": "Media Services Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 days. I interviewed at Occidental College (Los Angeles, CA) in Jan 2018", "Interview Descriptions": "Very quick and easy I was happy to meet the hiring manager go over some of the logistics quickly understand what the job was really about and then have it offered to me.", "Interview Questions": "When can you start?"}], [{"date": "9 Oct 2017", "title": "Lifeguard Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Occidental College (Los Angeles, CA) in Sept 2016", "Interview Descriptions": "I submitted my application online through email with my certifications to the lifeguard coordinator and was offered the job without an interview.  The lifeguarding itself takes minimal effort since patrons are fairly responsible (college students).  I had to get a second job on campus because they hired a lot of lifeguards and hours are limited.", "Interview Questions": "N/A"}, {"date": "9 May 2017", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Occidental College (Los Angeles, CA) in Aug 2016", "Interview Descriptions": "Phone interview followed by an in-person interview with two individuals in the department. Answered a set of 6 or so questions. The questions were straight forward, standard interview questions. It was not an intimidating experience, very comfortable environment.", "Interview Questions": "Why are you an ideal candidate for this position?"}, {"date": "16 Nov 2019", "title": "Marketing Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Occidental College (Eagle Rock, CA) in Aug 2015", "Interview Descriptions": "There was an interview panel that consisted of 5 interviewers. All took turns proposing questions and explaining the mission of this institution. It was a professional setting, and beautiful campus.", "Interview Questions": "Why do you think you’re the best candidate for this position?"}, {"date": "18 May 2015", "title": "Programming Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Occidental College (Los Angeles, CA) in Dec 2014", "Interview Descriptions": "Interviews had two components: group activities and one-on-one interview. The group activities consisted of various problem solving exercises and the individual interview consisted of around 5 questions that tested candidates understanding of the position and how they are qualified for the position.", "Interview Questions": "I was asked to describe my understanding of the position"}, {"date": "9 Oct 2013", "title": "Barista Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at Occidental College", "Interview Descriptions": "Easy.", "Interview Questions": "Can you make coffee? Please serve me a latte."}, {"date": "8 Sept 2014", "title": "Information Resource Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Occidental College (Los Angeles, CA) in Jun 2013", "Interview Descriptions": "Very fast interview process. Submitted my resume and was called directly the following week for an on-site interview. One day interview process with both heads of the Cataloging and Information Resource departments. Never felt nervous, very conversational and easy going. Interview lasted about 30 minutes - was told I had the job at the end of the interview!", "Interview Questions": "How would you resolve team issues and bring them forth to management as group leader on this project? "}, {"date": "8 Dec 2015", "title": "Barista At Green Bean Coffee Lounge Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Occidental College (Los Angeles, CA) in Jan 2012", "Interview Descriptions": "It was a good process, the managers were really nice and asked about my experience working in service oriented environments. The interview was with three student managers and two other student applicants. Questions were posed to the group and managers asked follow up questions directed at specific students. They asked how we would handle a variety of tasks and situations, and about our class schedules and other involvements,.", "Interview Questions": "They asked if I had the time in my schedule to work there, if I had previous experiences in service oriented work environments "}, {"date": "26 Jun 2013", "title": "Library Supervisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Occidental College in Jan 2009", "Interview Descriptions": "I saw the ad posted on the college website.  Applied online and was called for an interview within a short period of time.  Interviewed with the supervisor, who introduced me to some of the library staff.  I received a decision within a short period of time, upon confirmation of references.", "Interview Questions": "General interview asking me to describe my previous job-related experience.  No high-pressure or high-powered interrogation.  Interviewer/supervisor was pleasant and put me at ease.  "}]]