[[{"date": "20 Dec 2022", "title": "Development Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 7 weeks. I interviewed at Cystic Fibrosis Foundation in Nov 2022", "Interview Descriptions": "After an initial phone call with the recruiter, I was invited to do a zoom interview with the Associate Executive Director of the local chapter. The wait between these two meetings was about two weeks. After another two weeks, I was invited to meeting in-person with the two person team. All three steps of the process were comfortable. There was some severe miscommunication between the AED and the recruiter with Nationals that was difficult to navigate on my end. Now three weeks after this meeting all communication has stopped from Nationals. The team appeared desperate to hire a third member but in the three weeks since my in-person interview, I was able to apply for, interview for, and accept a position with a different company.", "Interview Questions": "How will you handle the stress things going wrong on the day of your event?"}, {"date": "10 Sept 2022", "title": "Project Coordinator Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Cystic Fibrosis Foundation", "Interview Descriptions": "Three rounds of interviews, one with HR, one with the team you’ll be working with, one with the director. Everyone was nice and welcoming and very direct. But I couldn’t negotiate salary.", "Interview Questions": "What experiences do I bring outside of what’s on my resume?"}, {"date": "24 Aug 2022", "title": "Event Support Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Cystic Fibrosis Foundation", "Interview Descriptions": "Probably one of the most irritating interview experiences I've had. I applied via their website and was called by a recruiter who went over the position a little more and asked me some basic questions. During this time, he stated that the chapter that this position was posted for had expressed extreme interest in me and wanted to move quickly to have me come in for an in-person interview. I set up an in-person interview with the executive director and felt that the interview went well. She stated that she would be in touch by the end of the week . I had not heard anything for over a week, so I reached out to the recruiter. He responded two weeks later, saying that they would be in touch. I did not hear anything again, so I sent two more follow-up emails stating that I was still very much interested in the position. I am not usually one to \"bug\" recruiters or hiring managers, but they let on that they thought I would be a good fit and wanted to move quickly, so I thought reaching out would be a good idea. They have since hired someone for the position. I never heard back from anyone at the organization, and I still haven't received the standard thank you for trying email. Don't express extreme interest in a candidate and then never respond to them. I was very excited about the potential to work for the Cystic Fibrosis Foundation, but this experience left a sour taste in my mouth.&nbsp;", "Interview Questions": "Why do you want to work for the Fibrosis Foundation?"}, {"date": "19 May 2022", "title": "Case Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Cystic Fibrosis Foundation", "Interview Descriptions": "It was your typical interview process. What are your strengths and weaknesses in the work environment. It started our with a call from the talent acquisitions team, and then a panel interview.", "Interview Questions": "Tell me about a time when you faced a challenge, how did you handle the situation. "}, {"date": "17 Mar 2022", "title": "Investment Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Cystic Fibrosis Foundation", "Interview Descriptions": "The process started with a phone screen with a HR recruiter, then I met with 7 people on the team in 5 different rounds and completed a case study.  Most people were friendly but the process was time-consuming, and questions in later rounds were repetitive plus the case study also took time. There were a couple of similar reviews by others so maybe that's the vibe. Towards the end, I didn't think it would be a good fit because the investment program did not seem to have a clear strategy yet, and the hiring process was long and unstructured.", "Interview Questions": "Why do you want this job?"}, {"date": "18 Nov 2021", "title": "Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Cystic Fibrosis Foundation in Nov 2021", "Interview Descriptions": "The first contact was a screen with the HR contact, who was very pleasant to talk to. He told me about the position, the team, and the organization. He also asked about my work experience and gave me time to ask questions. The second contact was with the hiring manager who had a great personality. She was kind and interesting to speak to. She asked good questions about my background and answered the questions I had. She then sent me a “case study” to work on. One of the other reviews described it as a problem the organization was currently working on and thought they were trying to get free work from the applicants, but it wasn’t that at all. It was simply a test to see your skill level with Excel and investments. I couldn’t see how it could possibly be used as anything else. It was actually fun to do and I didn’t mind putting in the time. The next contact was a panel interview with the team. They were great! They seemed very happy at the organization and made me feel at ease on the call. The HR representative was also fantastic, keeping me informed each step of the way. The timing didn’t work out for me as I accepted another offer before they were ready to make a decision, but had they been ready and made me an offer, I definitely would have accepted without hesitation. They are a great organization and truly nice people.", "Interview Questions": "They asked about my background and what systems I had worked with. There was also a “case study” just to test skills."}, {"date": "10 Sept 2021", "title": "Finance Role Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Cystic Fibrosis Foundation (Bethesda, MD)", "Interview Descriptions": "Major red flag - the interviewer was late for our talk and then took a call in the middle of one of my answers about my background and skill set. I was on hold for about 10-15 minutes. I was told by the end that I had done a great job and they were excited about me - so they handed me a cases study to tinker with and I realized this was a problem investment wise that they were currently having - this is a MAJOR red flag. They were looking for me to solve their issue free of charge - this is also illegal in many municipalities. Buyer beware: this org has sketchy hiring practices. Once I realized they were looking for free work, I declined to speak with the HR team further. \r\n\r\nOther than that, it was a pretty run of the mill finance interview.", "Interview Questions": "1. Detail your background\r\n2. What is your best skill\r\n3. Why this job\r\n4. Weaknesses"}, {"date": "9 Sept 2021", "title": "Senior Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Cystic Fibrosis Foundation", "Interview Descriptions": "Talent acquisition was very friendly and kept me in the loop from the first e-mail, to the last phone call. I was very impressed with how open the communication was during their end of the interview process. When I got to the last round, the interview was panel style with three hiring managers. It went well and started off with introductions as well as some backgrounds of the different sectors that the position would work hand and hand with. The interview  consisted of going around the panel roughly 8 times, while each manager would ask a  general interview question.", "Interview Questions": "Tell me about a time when you didn't get along with another team member/co-worker. How did you handle the situation?"}, {"date": "6 Sept 2021", "title": "Data Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Cystic Fibrosis Foundation", "Interview Descriptions": "applied online, heard from the recruiter, then 2 follow-up interviews. One with the hiring manager then another with the team. The interview was fairly easy the process took less than a week.", "Interview Questions": "If you weren't working name something you would want to do with your life"}, {"date": "23 Jun 2021", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Cystic Fibrosis Foundation", "Interview Descriptions": "Phone interview then a seeping phone interview then a Day long in person interview. very good. Conversations were open honest and easy. Met all members I would work with and were able to ask important questions", "Interview Questions": "What do you like to do outside of work? "}], [{"date": "12 Apr 2021", "title": "Program Coordinator Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Cystic Fibrosis Foundation", "Interview Descriptions": "The first step was a phone screening interview with talent acquisition. The next step was a video interview with the program lead. The third interview was a video interview with two other managers from related departments. The final interview was with the head of events and conferences.", "Interview Questions": "Describe a time you were presented  with competing priorities or feedback, and how you handled it. "}, {"date": "24 Feb 2021", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Cystic Fibrosis Foundation", "Interview Descriptions": "It was a 2 stage interview Process. I applied for the job online using the platform handshake. I first received a call then went to the office for an interview. It was a vey positive experience and everyone was very welcoming!", "Interview Questions": "Why do you want to work at CFF?"}, {"date": "5 Oct 2020", "title": "Investment Associate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Cystic Fibrosis Foundation (Bethesda, MD)", "Interview Descriptions": "I went through 3 rounds of interviews and spoke to 6 six people. I think only the first interview with the hiring manager was efficient. The rest interviews were pointless and redundant. The same questions were asked over and over by 5 people. They did not ask about my professional or academic knowledge at all. It was all about my hobbies and activities.  The lady who is an Executive Assistant was very unprofessional.", "Interview Questions": "What are your hobbies? What do you like to do when you have free time? "}, {"date": "12 Nov 2019", "title": "IT Service Desk Technician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Cystic Fibrosis Foundation", "Interview Descriptions": "It was amicable and even though I did not get the job I was informed of the rejection in a timely manner. The interviewer was very knowledgeable and was very patient and clear spoken.", "Interview Questions": "What is the protocol associated with the port number 443?"}, {"date": "12 Mar 2022", "title": "IT Service Desk Tier I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 4 weeks. I interviewed at Cystic Fibrosis Foundation (Bethesda, MD) in Nov 2019", "Interview Descriptions": "Multi Stage interview, first a overview of the company from an HR Recruiter. Next a Technical Interview with a Senior Team Member. Then followed by a more formal introduction with Team manager and Team Lead. Last is a meeting with CIO as a formality.", "Interview Questions": "Technical Question were based on the Computers in General I worked on.\r\nWhat is the purpose of Exchange.\r\nWhat are some of the basic ports.\r\nHow would you troubleshoot a given scenario. etc. "}, {"date": "17 May 2019", "title": "Special Events Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Cystic Fibrosis Foundation (Pittsburgh, PA)", "Interview Descriptions": "I was interviewed by one person in person. I had to travel to an event site because they were setting up for an event. My interviewer was very nice and they were very understanding and flexible around my schedule.", "Interview Questions": "Why do you want this role?"}, {"date": "16 May 2019", "title": "CYS Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Cystic Fibrosis Foundation", "Interview Descriptions": "It was very simple and the process was fairly easy. You wouldn’t have trouble getting this job. I would recommend going on USA jobs to review your responsibilities of the job and to find out your pay.", "Interview Questions": "Do you like to work with kids"}, {"date": "19 Apr 2018", "title": "Development Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 4 weeks. I interviewed at Cystic Fibrosis Foundation", "Interview Descriptions": "Very positive - all employees I spoke with were passionate and excited about the work they are doing. The interview process moved very quickly and the entire team moved schedules to accommodate mine. Overall, was a very pleasant experience and I would definitely apply again.", "Interview Questions": "How do I plan to get volunteers and fundraisers on board?"}, {"date": "11 Dec 2017", "title": "Program Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Cystic Fibrosis Foundation in Aug 2017", "Interview Descriptions": "Phone interview started off with the pushy hr person. Her first question is what my current  salary was. I politely declined to share. She then said that we would not be able to continue the process unless I told her.  I told her again that I wasn't comfortable disclosing that,  but perhaps if she gave me a range I could see if that was within reason. She declined again and said I had to tell her first. This was getting ridiculous so I told her generally what I made (50s). She said the position paid 37k (ridiculously low!!) and have a nice day. For what they were asking that position should have paid at least 50.", "Interview Questions": "How much do you make?"}, {"date": "30 May 2017", "title": "Research Associate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied through college or university. The process took 3 months. I interviewed at Cystic Fibrosis Foundation (Lexington, MA)", "Interview Descriptions": "I was contacted after sending in my resume to a college job board. They asked me to come in for a cursory interview, after which they asked me to come in for a secondary. After my secondary, they said they would be in touch in about a week. A week soon became a month, and I was only informed I was not being considered after I inquired. \r\n\r\nAt that point, however, I was offered to interview with another lab. I went to my third interview, after which they said I would know shortly. Again, I only found out after repeatedly contacting HR that I was not being considered. This was after the PI I spoke with told me he would always respond to emails and \"would not BS me\" (did not respond to my emails). \r\n\r\nThe CF foundation sounds like it does good work, but I was treated rudely throughout the process, and was dangled around for so long instead of just getting clear communication. The whole process was a nightmare, considering I was still in school and each interview required a total of 4 hours of driving to location (for which they did not offer reimbursement).", "Interview Questions": "Research experience, future goals, standard research associate stuff. "}], [{"date": "20 Apr 2017", "title": "Operations Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Cystic Fibrosis Foundation (Portland, OR) in Apr 2017", "Interview Descriptions": "Within a week of submitting my application, I received an email from a recruiter at the national headquarters to set up a phone interview. She gave an overview of the foundation and the job and then asked some basic screening questions about skills and experience. The next day or so I was offered an in person interview with the Executive Director of my local office. The interview lasted about 1.5 hours and was more like a conversation than an interview.", "Interview Questions": "Tell me about yourself."}, {"date": "28 Feb 2017", "title": "Event Support Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Cystic Fibrosis Foundation", "Interview Descriptions": "I was contacted for a phone interview and immediately set it up for the end of the week. This did not work for the interviewer so we decided on the end of the following week.The day of the interview, I waited for 2 hours after our scheduled time and never heard anything. I called the office and was told the HR rep I was supposed to speak to was not even in that day. She had not notified me at all that our interview would be rescheduled. After the weekend, she emailed me and asked to reschedule for the next day. 2 hours later she emails me again and tells me that they decided to hire someone else that they interviewed the week before, when I was supposed to have my interview. This was all very frustrating and honestly, incredibly unfair to me.", "Interview Questions": "N/A"}, {"date": "23 Sept 2016", "title": "Development Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Cystic Fibrosis Foundation in Jul 2016", "Interview Descriptions": "Within about a week of submitting I got an email to schedule a phone screen from a national office HR recruiter. Brief phone screen with basic questions and was told I'd hear back in a couple of weeks. Within a week or so I got a call that they would connect me with the local chapter for an in person interview. Went in for in person and it was a panel interview with the 3 staff currently in the office. It was a pretty simple and casual interview with few questions and just lots of chatting. Lasted about an hour.", "Interview Questions": "How would you handle the # of walkers and sites you'll be managing?"}, {"date": "10 Nov 2016", "title": "Development Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Cystic Fibrosis Foundation (Rockville, MD) in Jul 2016", "Interview Descriptions": "I was initially contacted for a phone screen. The call was pretty typical, however it seemed that he had not actually reviewed my resume prior to the call. This is frustrating as an interviewee because I feel like we are wasting each other's time. The interviewer was not able to answer a few of what I thought were pretty basic questions about the organization. Also, the interviewer insisted on asking my salary history more than 3 times even though I declined to disclose even citing my reasons why (personal, private info, basing salary on salary history is unethical, illegal in some states, etc). I was happy to give my salary requirements or confirm that they were within there budget, but he refused to share that information with me. Ultimately, I was certain that I did not want to continue in the interview process for the posiiton.", "Interview Questions": "What is you salary history? 3x"}, {"date": "22 Sept 2016", "title": "Event Support Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Cystic Fibrosis Foundation (New York, NY) in Feb 2016", "Interview Descriptions": "I submitted my online application then was contacted by Human Resource. Spoke with him on the phone, was very nice and talked about the history of the organization and asked me some basic questions. Then followed up with the chapter and they hosted me in a Skype interview. Asked me some of the same questions as well as some questions to get to know about me.", "Interview Questions": "Greatest Skills and weaknesses. "}, {"date": "12 Nov 2015", "title": "Finance Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Cystic Fibrosis Foundation", "Interview Descriptions": "Easy and casual, beautiful headquarters. Very friendly staff.", "Interview Questions": "About past experience "}, {"date": "16 Dec 2015", "title": "Senior Scientist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Cystic Fibrosis Foundation (Cambridge, MA) in Nov 2015", "Interview Descriptions": "Applied through the online application portal. Was secondarily contacted by a recruiter through LinkedIn that helped my application through (possibly).  HR set up a phone interview with the hiring manager, who was polite and honest about what background he was looking for in a candidate.  It was clear to both of us that I wasn't the perfect fit.", "Interview Questions": "Questions were about my own research experience and how it applies to the position there."}, {"date": "18 Jun 2015", "title": "Logistics Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Cystic Fibrosis Foundation (Milwaukee, WI) in Apr 2015", "Interview Descriptions": "phone interview first which went good. Only lasted about 15 minutes and was with an hr recruiter. Went in for first in person interview with the executive director. This interview lasted about 45 mins . Was asked in a couple days if I could back for a 2nd interview with all the employees for a group interview.", "Interview Questions": "how could you help us in achieving our mission"}, {"date": "6 Apr 2015", "title": "Director of Development Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Cystic Fibrosis Foundation (Saint Louis, MO) in Mar 2015", "Interview Descriptions": "Met with Executive director and the other development directors.  Very friendly people and were open to answering the questions that I had.  Seem to work long hours and lots of weekends.", "Interview Questions": "Non-profit Fundraising Experience"}, {"date": "20 Jan 2015", "title": "Administrative Logistics Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Cystic Fibrosis Foundation", "Interview Descriptions": "Got an e-mail response two days after sending in application, and set up a phone interview with HR for the following day. There weren't really any serious questions, the most significant was if I was aware that it was a part time position. When I asked about future opportunities for advancement, the representative became inordinately hostile and combative. She told me that this position would only ever be part time, and they couldn't risk hiring and training anyone who would leave after a few months. So, innocent ambition to move forward is NOT tolerated. She concluded the interview by saying that she would send my materials to the local office, but I get the feeling it went into the trash.", "Interview Questions": "Are you aware this is a part-time position? "}], [{"date": "26 Aug 2015", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at Cystic Fibrosis Foundation (Baltimore, MD) in Dec 2014", "Interview Descriptions": "I applied through my college, and they emailed me asking to come in for an interview about a week later. When I arrived, the woman showed me around the office, introduced me to everyone, and then asked me when I could start. She barely asked me any questions. It seemed like they already knew they were going to offer me the internship before I even got there. It was very relaxed.", "Interview Questions": "Why do you want to work for CFF?"}, {"date": "4 May 2015", "title": "Communications and Outreach Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Cystic Fibrosis Foundation (Las Vegas, NV) in Aug 2014", "Interview Descriptions": "Random assignment from the hiring pool. No real or actual interview required since it was a service learning project in which one volunteers and gains hands on experience with real world situations.", "Interview Questions": "Are you comfortable talking to strangers?"}, {"date": "27 Mar 2014", "title": "Senior Director - Development Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied in-person. The process took 6 months. I interviewed at Cystic Fibrosis Foundation", "Interview Descriptions": "Not at all formal but hiring can take an incredibly long time.  The Executive Director likes to hire individuals that she has received strong recommendations from so networking is key.  The company puts a big priority on the referral process so getting to know someone else on the staff is a great way to get a foot in the door with this employer.", "Interview Questions": "What do you expect in terms of a work/life balance?"}, {"date": "1 May 2016", "title": "Events Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. The process took 1 day. I interviewed at Cystic Fibrosis Foundation (Chicago, IL) in Feb 2014", "Interview Descriptions": "This was a very easy interview process. It was only one round and I met with three different people very briefly. They offered me the position on the spot. After I accepted the offer the showed me around the company and introduced me to the employees. It's a pretty bare office filled with cubicles.", "Interview Questions": "What do you know about the Foundation?"}, {"date": "20 Jul 2013", "title": "Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Cystic Fibrosis Foundation (Bethesda, MD)", "Interview Descriptions": "Initial interview via phone with HR Recruiter.  In person interview with hiring manager and VP.", "Interview Questions": "How do you balance employee motivation and the need for termination?"}, {"date": "19 Dec 2012", "title": "Development Manager Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 3 months. I interviewed at Cystic Fibrosis Foundation", "Interview Descriptions": "Step #1 Phone interview with HR at National\r\nStep #2 In-office interview with Executive Director\r\nStep #3 Group interview with team", "Interview Questions": "Are you a dog or a cat person?"}, {"date": "11 Oct 2012", "title": "Logistics Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Cystic Fibrosis Foundation", "Interview Descriptions": "The hiring process was seamless and professional.", "Interview Questions": "Interview questions were typical and professional"}, {"date": "10 Sept 2012", "title": "National Position Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Cystic Fibrosis Foundation", "Interview Descriptions": "Seemed to be disorganized. Interview only focused on experience from 4 years ago. After several interviews which had narrowed down candidates, I had to follow up to find out that I hadn't gotten the position.  I was surprised that I after I had put in significant time and energy, many times shifting my schedule last minute interviews, they did not extend the courtesy to let me know I had not gotten the position.", "Interview Questions": "Focused on experience from 4 years ago when my current experience is more relevant."}, {"date": "7 Aug 2012", "title": "Development Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Cystic Fibrosis Foundation", "Interview Descriptions": "Was contacted for phone interview. The interview was conducted by HR from the head office. A follow up in person was scheduled with the acting director at the local office. The interview was okay but I did not have a great feeling. It has been 3 weeks and I have had no follow up from them not thak  you no communication at all. This is very unprofessional! Even if you are not going to hire someone you need to thank them, they took time out to apply, and do two interviews and you don'thave the decency to send an email?", "Interview Questions": "N/A"}, {"date": "20 Aug 2012", "title": "Team Lead Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Cystic Fibrosis Foundation (Bethesda, MD) in Mar 2012", "Interview Descriptions": "The interview process was fairly standard. After phone interview met  F2F with the hiring manager,  also had a panel interview with the team I would have worked with. Most of the panel had cookie cutter behavioral questions and had never conducted an interview before.  They offered the job to someone else but continued to lead me on for 2 weeks with the recruiter calling weekly to ensure I was still interested. Seemed they were unsure if the other candidate would work out / accept.  Not impressed by the recruiter and hiring managers professionalism.", "Interview Questions": "How do you handle conflict "}], [{"date": "28 Dec 2011", "title": "Case Management Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 2 days. I interviewed at Cystic Fibrosis Foundation (Bethesda, MD) in Nov 2011", "Interview Descriptions": "Wonderful interviewing experience! I was contacted via email to go through a phone interview within a few days following. I was then contacted a day or two late (via email) to set up a face-to-face interview.  When I arrived on site, I was pleased to see that the staff is immediately warm and welcoming, and offered me the utmost courtesy.  I interviewed with the department manager and we discussed the position in detail.  I spent roughly 1.5 hours there total, and was told a decision would be made within 2 weeks. I received an email the next day to complete a background check and the next day I received an offer via telephone!  I was sent new hire paperwork after submitting my signed offer letter, which contained a wealth of information regarding the orientation, the training schedule, benefits, and various tax forms to complete. I am extremely impressed by this organization since they sent all the information ahead of time and gave great detail in the company's mission to train and invest in their employees.", "Interview Questions": "What is your experience working with insurances?"}, {"date": "14 Feb 2014", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Cystic Fibrosis Foundation (Pittsburgh, PA) in May 2011", "Interview Descriptions": "I found the internship on Craigslist. Only one in person interview.", "Interview Questions": "Why I would be good at the job? how flexible my schedule is? Nights and Weekends"}, {"date": "8 Oct 2010", "title": "Manager of Training & Development Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Cystic Fibrosis Foundation (Bethesda, MD) in Sept 2010", "Interview Descriptions": "Applied online. Received an e-mail from thier HR representative the next day to schedule a phone interview. The HR representative e-mailed me the night before requesting a reschedule. I accommadated the request. It was scheduled for the following week. The phone interview experience was fine. At the end of the phone interview the HR representative scheduled a 1:1 interview with the hiring manager for the position for the following week. The next day I received an e-mail (while I was traveling) requesting a phone interview with the hiring manager for the next day. I again accommadated the request. The next week I did in fact have the 1:1. The directions to the building were less than clear. Upon arrival the receptionist was preoccupied with the phones and some delivery people so it was a little crazed at the receptionist desk. Otherwise the interview was typical. A nonselection e-mail was sent nearly a month later and it appeared they didn't select anyone.", "Interview Questions": "How do you approach identifying/developing a training program from scratch?"}]]