[[{"date": "2 Jan 2023", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Lawrence General Hospital", "Interview Descriptions": "Friendly ,informative, straight to the position and duties. Fast passed environment, looks like a lot of availability in positions. A lot of open schedules mentioned plus shift bonuses, for picking up additional shifts. Geat hospital to work for if looking for per-diem schedule.", "Interview Questions": "What was I looking for in my next job."}, {"date": "19 Jul 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Lawrence General Hospital", "Interview Descriptions": "First you will be interviewed by Human Resources and then by the Nurse managers of the floor in which you applied. The Human Resources interview was less formal.  The nurse manager interview was more formal. Be prepared to answer questions about your history in dealing with patients and coworkers and to describe yourself.", "Interview Questions": "tell us about your weaknesses\r\n\r\nTell us a about your strengths\r\n\r\nTell us about a time you had to deal with a difficult patient  and how you handled it"}, {"date": "5 Nov 2021", "title": "Cerified Phlebotomist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Lawrence General Hospital", "Interview Descriptions": "Was not too bad. It was a bit hard to get into this lab. They are very picky with their selection process. Asked a couple of questions. Just make sure you let them know what shift you are willing to work.", "Interview Questions": "What shift do you want to work?"}, {"date": "4 Feb 2022", "title": "Meditech Data Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. The process took 3 weeks. I interviewed at Lawrence General Hospital in May 2021", "Interview Descriptions": "Interviewers made me feel at ease. Multiple Interviews but one of the interviewers focused on Tableau software.  Asked if I was afraid of working at the hospital. Kind of a strange question to ask.", "Interview Questions": "What is your experience with Tableau dashboards?"}, {"date": "17 Jan 2022", "title": "Certified Medical Coder Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Lawrence General Hospital (Lawrence, MA) in Oct 2019", "Interview Descriptions": "I was greeted by the director. She made me feel comfortable.  She described the position in full and asked about my prior experience. She asked what kind of EHR I was used to and told me about their system. We talked about the work environment and the other coders I would be working with. The training plan was also discussed.", "Interview Questions": "Do I have experience with the position I am applying for."}, {"date": "29 Dec 2018", "title": "Operations Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Lawrence General Hospital", "Interview Descriptions": "Process has taken more than 2+ werks. First was phone interview. Then was in person interview with directors. 2nd interview was scheduled with different directors and nursing managers. It was also during holidays so it was a longer process to coordinate interviews.", "Interview Questions": "Why would you be a good fit for this position? "}, {"date": "17 Feb 2019", "title": "Research Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at Lawrence General Hospital (Lawrence, MA) in Feb 2018", "Interview Descriptions": "the interview process was very smooth, easy questions and very friendly hiring managers. it was also very fast. just a phone call, 1;1 interview with two of the managers and then the job offer in a week due to my qualifications and experiences.", "Interview Questions": "Tell me about yourself "}, {"date": "10 Apr 2018", "title": "EMT Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Lawrence General Hospital (Lawrence, MA) in Feb 2018", "Interview Descriptions": "The interview was straightforward. We met in the office adjacent to the ambulance bay. It would have been a two interviewer situation, but one got called away to a patient.", "Interview Questions": "How do you handle difficult situations with nursing staff? "}, {"date": "3 Jan 2018", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Lawrence General Hospital (Lawrence, MA) in Aug 2017", "Interview Descriptions": "Applied on the Hospital Website, and received a follow up email the next morning and I was asked to come in for an interview with the hiring manager of the unit the following week.", "Interview Questions": "Where did I see myself in 5 Years?"}, {"date": "25 Jan 2018", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Lawrence General Hospital (Lawrence, MA) in Jun 2017", "Interview Descriptions": "Literally came in for 5 minutes and was hired. My references were not contacted. I sent in application on the website, was contacted a week later, came in for a 5 minute interview where I was asked why I want to work there and then I was told I was hired. I was told at the interview that there were “issues” with he staff on the unit getting along, but “not any more than is usual when women work together”. I should have heeded this warning", "Interview Questions": "Why do you want to work here"}], [{"date": "26 Feb 2017", "title": "Phlebotomy Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Lawrence General Hospital (Lawrence, MA) in Feb 2017", "Interview Descriptions": "After a week called to follow up.  Second week, called to follow up.  Left messages BOTH times.  After both calls, she didn't even have the courtesy to return my call.  Not sure if they're that callous or inconsiderate of employees?  Having second thoughts.", "Interview Questions": "Many questions and interview went well."}, {"date": "28 Oct 2020", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Lawrence General Hospital (Lawrence, MA) in Feb 2016", "Interview Descriptions": "Applied on indeed, I heard back for an interview within two weeks, hiring manager very approachable, was called within the same week with an offer. unable to negotiate offer as a nurse", "Interview Questions": "3 strengths/weakness, how do you deal with difficult people"}, {"date": "2 Jul 2015", "title": "Admissions Representative Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Lawrence General Hospital", "Interview Descriptions": "Two interview process.  First with HR department and second with department supervisor.  The interview process took approximately 3 weeks.  The training process took approximately another 4 weeks.", "Interview Questions": "Why do you want this job?"}, {"date": "9 Mar 2017", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I applied online. The process took 6 months. I interviewed at Lawrence General Hospital (Lawrence, MA) in Jan 2015", "Interview Descriptions": "An interview is a conversation where questions are asked and answers are given. In common parlance, the word \"interview\" refers to a one-on-one conversation with one person acting in the role of the interviewer and the other in the role of the interviewee. The interviewer asks questions, the interviewee responds, with participants taking turns talking. Interviews usually involve a transfer of information from interviewee to interviewer, which is usually the purpose of the interview, although information transfers can happen in both directions simultaneously. One can contrast an interview which involves bi-directional communication with a one-way flow of information, such as a speech or oration.", "Interview Questions": "Where do you see yourself in 5 years? "}, {"date": "17 May 2018", "title": "Hospitalist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 4 weeks. I interviewed at Lawrence General Hospital in Dec 2014", "Interview Descriptions": "Online application. Then I was contacted by a recruiter who asked me some initial screening questions about my experience. The recruiter then arranged a telephone interview with the medical director. Telephone interview followed by in -person interviews with several people within the organization", "Interview Questions": "The usual. What’s your greatest strength and weakness? They were very positive and welcoming and made the process very easy for me, although I heard that it was a lot more challenging for other applicants who were asked some clinical questions, which was not the case for me at all."}, {"date": "6 May 2014", "title": "Medical Transcriptionist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Lawrence General Hospital", "Interview Descriptions": "Hired over the phone to replace exiting transcriptionists.", "Interview Questions": "there was no difficult or unexpected question"}, {"date": "11 Aug 2015", "title": "Teachers Aid Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied in-person. I interviewed at Lawrence General Hospital (Lawrence, MA) in Jul 2013", "Interview Descriptions": "Great-required CPR certified - provided training -seminars on dealing with challenges of children in low income areas.. Volunteered to help out with cooking class.  Participated in community dinner to raise funds for the boating program for community children expecially from low income areas.", "Interview Questions": "What experience did I have with children.  Education, participation in school activtiies.  Did I have\r\nany experience working with children with challenges?"}, {"date": "24 Jul 2015", "title": "Unit Secretary Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Lawrence General Hospital (Lawrence, MA) in Nov 2012", "Interview Descriptions": "I applied online and was contacted to come in for an interview with nursing supervisor. She asked standard interview questions. Afterwards, about a week later, was called by HR to sign paperwork.", "Interview Questions": "Standard interview questions, asking strengths and weakness, not you handle stressful situations, etc."}, {"date": "29 Jun 2015", "title": "Outpatient Registar Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Lawrence General Hospital (Lawrence, MA) in Nov 2011", "Interview Descriptions": "Fast and got hired next day. Applied on line and next day received a call from HR department. Scheduled appointment for next day, and after interview with HR I met with the Director. She reviewed salaries, benefits and starting day.", "Interview Questions": "Please give an example of a difficult situation with a patient."}]]