[[{"date": "22 Jun 2023", "title": "Physician Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Emory Healthcare (Decatur, GA)", "Interview Descriptions": "Originally scheduled to have a group panel interview but this was cancelled and rescheduled several times. I ended up interviewing with each person individually due to the schedule conflicts. Everyone seems quite tired and overworked. One person missed an interview because they were the only person working. Interview felt awkwardly formal and repetitive. No one seem like they wanted to be doing it.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "24 Jun 2023", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Emory Healthcare in Jun 2023", "Interview Descriptions": "The process was smooth, it was virtually depending on who are interviewing with it was comfortable. Just making sure that you are your natural self is the most important thing.", "Interview Questions": "Why Im interested in the unit? What are my weakness"}, {"date": "10 May 2023", "title": "Patient Services Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Emory Healthcare (Atlanta, GA)", "Interview Descriptions": "They did a group interview initially, where the role and pay were described. We got to introduce ourselves and what we were looking for in the company. Subsequently there was a virtual interview with departments that were looking to fill the position and then they will let you know if you were matched within 2 weeks. If not matched, you repeat the interview process.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "29 Apr 2023", "title": "Certified Medical Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Emory Healthcare", "Interview Descriptions": "It was a pretty short interview lasting around 40 mins. It was not too bad and I was interviewed by 2 people. Mine was conducted online but could also be in person.", "Interview Questions": "About teamwork like how do I work in a team and provide examples"}, {"date": "30 Mar 2023", "title": "Volunteering Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Emory Healthcare (Decatur, GA)", "Interview Descriptions": "It was extremely easy and quick (finished within 30 mins) Everything was going good and they told me that I got accepted after the interview!!! And it was online. Overall just be prepared and answer the questions with the best ability you can.", "Interview Questions": "What is your biggest weakness and Why did you apply and some other easy questions"}, {"date": "15 Mar 2023", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Emory Healthcare", "Interview Descriptions": "It was in a room with a couple different leadership and you met many awesome people depending on location. It was was to the point and fast. I enjoyed the process.", "Interview Questions": "What would you do in a certain situation?"}, {"date": "14 Feb 2023", "title": "Project Manager Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Emory Healthcare", "Interview Descriptions": "I had to meet a lot of people for this interview, but they were able to bundle some of the interviews together to avoid me constantly coming back in. Typical behavioral interview questions; very well coordinated where I needed to go.", "Interview Questions": "Tell me about your biggest accomplishment. How would you deal with something you didn't necessarily agree with?"}, {"date": "3 Nov 2022", "title": "New Grad RN Residency Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Emory Healthcare", "Interview Descriptions": "After completing paperwork online, the RN Residency has two days of interviews where you can interview for up to three different units. The biggest problem is that there aren’t enough time slots so a lot of units fill up and you can’t interview for them! They’re also virtual, so there’s not much interaction and you don’t get to see the unit. Questions weren’t bad, but technology issues happened a lot and the only interviews were during the day so I had to leave class to do these interviews!", "Interview Questions": "Honestly I can’t remember any off the top of my head. This was a question I asked: “Why did you pick Emory”"}, {"date": "6 Jun 2023", "title": "Certified Diabetes Educator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Emory Healthcare (Atlanta, GA) in Nov 2022", "Interview Descriptions": "First interview was about an hour on zoom with the team I would be working with. Then the second round was with the doctors. Got an offer after the second interview.", "Interview Questions": "Difficult patient I dealt with and how I managed it"}, {"date": "21 Nov 2022", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Emory Healthcare (Atlanta, GA) in Nov 2022", "Interview Descriptions": "Got Contact from the recruiter and then had on-site interview for a week later But I didn’t get a result for three days And I don’t know when the results will be delivered the process was like comfortable and calming And then I felt They consider past experience my response and behavior from their past thing important", "Interview Questions": "Describe scenario football conflict between you and other team members"}], [{"date": "23 Oct 2022", "title": "Patient Representative Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Emory Healthcare (Atlanta, GA)", "Interview Descriptions": "Involved a fair where you sat down and met with 2 physicians and 1 manager. If you were approved at this process then you moved on to the next interview where you with the COO and another director and with 4 other candidates. They asked you the same questions and would sometimes switch the questions. Toughest interview I've ever had.", "Interview Questions": "What is your definition of servant leadership?"}, {"date": "21 Oct 2022", "title": "Certified Nursing Assistant CNA Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Emory Healthcare (Atlanta, GA)", "Interview Descriptions": "The interview was short they didn't really ask me any questions whatsoever pretended as though I were not invited for interview because I have a black face and it does not match my French first name and English last name I am Desiree trotman but on that day they treated me less than human and continue to do what they have been doing in our community for over 100 years, they hire everyone except for Black nurses to use their harder money to become educated. The only people they hire or Africans Asians and white Americans but not black Americans.", "Interview Questions": "Where do you come from? Sadly when I reply to this question the only thing they were concerned about is finding out if I were foreign, because they want to make sure that they never hire black Americans."}, {"date": "12 Oct 2022", "title": "Nurse Residency Program Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Emory Healthcare (Atlanta, GA) in Oct 2022", "Interview Descriptions": "Interview was not nerve wracking. Felt like a conversation. They started by asking me to tell them about myself and then they also did tell me about the unit in particular.", "Interview Questions": "Tell me about a time when you went out of your way for a customer, client, or patient."}, {"date": "13 Oct 2022", "title": "L&D Nurse Residency Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Emory Healthcare (Atlanta, GA) in Oct 2022", "Interview Descriptions": "The interview process was very simple easy setup. The interview was virtual with the director and unit educator both were very kind. It was an enjoyable process. They really communicated their support for new grads and the education that they provide on the unit which was really great to see.", "Interview Questions": "How do you deal with stress?"}, {"date": "13 Sept 2022", "title": "Nurse Practitioner Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Emory Healthcare", "Interview Descriptions": "Interviewed by 2 people, the director and lead NP.  It was conversational and went pretty smooth.  I had one interview and was told I had to shadow to see if I liked the job. ", "Interview Questions": "Interview questions are behavioral, tell me about a time you provided good customer service,  tell me about a time  an error occurred and how did you handle it, etc"}, {"date": "2 Jul 2022", "title": "Patient Access Representative Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Emory Healthcare", "Interview Descriptions": "The entire process was simple. I was nervous at first but the panel made me comfortable. It was two interviews which isn't bad. One over the phone and then one on zoom.", "Interview Questions": "What are your weaknesses and strengths in this field?"}, {"date": "9 Aug 2022", "title": "Medical Coder Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 1 day. I interviewed at Emory Healthcare (Atlanta, GA) in Jul 2022", "Interview Descriptions": "Hiring Event. Quick and fast paced, but has a casual feel in the interview. Helps the candidate feel comfortable and less pressured. Overall good experience. Would definitely interview with them again if given another opportunity.", "Interview Questions": "“Tell us about a time when you had to resolve an issue with an unhappy patient, customer, or co-worker…”"}, {"date": "28 Feb 2023", "title": "Data Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Emory Healthcare in Jul 2022", "Interview Descriptions": "I had two rounds of interviews and a fairly quick turnaround with the hiring decision and HR process. The follow-up interview was about 3 weeks after the initial and much more related to an environmental fit—the second interview left me with a sense that I was already being considered, not merely as a next step in an exhaustive process that may lead nowhere. Definitely more timely than other positions I applied for elsewhere.", "Interview Questions": "They asked me about my previous experience both directly and indirectly related to the position. They asked about my work ethic and style and the environments I thrive or shrink in."}, {"date": "4 Jun 2022", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Emory Healthcare", "Interview Descriptions": "The interview was virtual. It was a panel interview with the Unit Director , clinical manager, and charge nurse. It was a seamless process. The interview was about 20 minutes long.", "Interview Questions": "Why I was the best candidate for the position    "}, {"date": "13 Apr 2022", "title": "Medical Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Emory Healthcare", "Interview Descriptions": "The interview was easy for the most part it was very personable and they wanted to know more about you and what you love about patient care and then the last 15 minutes of the interview were related to your specific skill", "Interview Questions": "What can you contribute to our company what are your strengths what are your weaknesses are you a team player and how do you make tough choices"}], [{"date": "6 Apr 2022", "title": "Executive Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Emory Healthcare", "Interview Descriptions": "Interview with HR and subsequently with reporting executive.  Interviews seemed to go well and I received additional information via email. I emailed several times regarding my application and the status of position but got no response.  So disappointing as it seemed like a perfect fit.", "Interview Questions": "Tell us about your experience with diversity, equity and inclusion."}, {"date": "25 Jun 2023", "title": "Phlebotomist Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Emory Healthcare (Atlanta, GA) in Apr 2022", "Interview Descriptions": "The interview process for the phlebotomy lab is very laid back. If you’re truly a phlebotomist you will do well on an interview with them. It is about thirty minutes from start to finish. It is literally about six questions and a quick walk around to the areas you will service.", "Interview Questions": "How would you deal with a upset patient?"}, {"date": "22 Mar 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Emory Healthcare", "Interview Descriptions": "I did not do an interview. Came in and started work immediately. That was not good.  Guess they needed to fill the position immediately. I showed them my skilzzz and my skilzzz level. I did a wonderful job obviously. I was there for 3 years.", "Interview Questions": "Ready to work now or do you want to start next week?"}, {"date": "8 Jan 2022", "title": "Mobile Phlebotomist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Emory Healthcare in Jan 2022", "Interview Descriptions": "It was smooth easy general questions then performed a draw. Why do I want this job . A time I had a difficult draw what did I do that type of thing", "Interview Questions": "Order of draw and stuff "}, {"date": "6 Dec 2021", "title": "Unit Clerk Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Emory Healthcare", "Interview Descriptions": "Easy and zoom call that didn’t take long and just asked easy questions most about yourself. Also describing your experience and short term goals. Overall, easy process but the enrollment was alittle difficult because of the different emails", "Interview Questions": "Tell me about your self and work experience "}, {"date": "19 Mar 2022", "title": "Emergency Department Nurse Practitioner Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Emory Healthcare (Atlanta, GA) in Dec 2021", "Interview Descriptions": "I applied for this position October 2022. I was finally contacted December 2021 to interview for an NP position at Emory Main and Midtown in the ED. On the day of the interview, we met at a busy Starbucks near a mall. There was a lot of conversation and commotion happening around us, so that was a bit distracting. The interview lasted 20 minutes. They mostly asked about why did I choose to apply to the Emergency Department (ED nurse for years) and what type of patients I like to care for as a nurse. Eventually, the two interviewers ran out of questions and started asking about random topics; many moments of silence occurred. I tried to make the interview interesting by asking questions, but by the end of the interview, it was clear that the interviewers lacked interest. They informed me that I should hear back from them after the holidays.  As I left, I saw that other interviewees had been sitting at a table next to where I was interviewing; I guess it was  interview day at Starbucks.   I never heard back from either interviewer. I assumed I did not get a job at either facility, but I confirmed as such when my application status online stated \"No Longer Under Consideration\" in March 2022. This interview experience left a lot to be desired; I doubt I'll apply for a job at Emory in the future.", "Interview Questions": "Why did you choose the Emergency Department?\r\nWhat are your favorite patients to care for as a nurse?\r\nWhat hobbies do you have?\r\nWould you be willing to consider additional schooling?"}, {"date": "24 Nov 2021", "title": "Finance Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Emory Healthcare", "Interview Descriptions": "Moderate 3 panel interview. Asked to give examples of situations and how you handled the situation. Interview wasnt intimidating and was made to fee very comfortable. Interviewed with Director Manager and Supervisor.", "Interview Questions": "Name a time when  you"}, {"date": "13 Oct 2021", "title": "Physician Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Emory Healthcare", "Interview Descriptions": "I received a call from hr for an interview. Scheduled interview about a week later. I met with multiple doctors and surgeons on the team. It was pretty laid back and questions about myself and interests.", "Interview Questions": "Where do you see yourself in five years?"}, {"date": "11 Oct 2021", "title": "New Grad ICU Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Emory Healthcare", "Interview Descriptions": "The unit manager was very welcoming and attentive during the interview. Many questions were asked about the acuity of patients that I have previously cared for. I was also asked if I ever had a patient expire and how I handled it", "Interview Questions": "Have you had a patient expire? How did you respond?"}, {"date": "12 Oct 2021", "title": "Clinical Pharmacist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Emory Healthcare", "Interview Descriptions": "Midtown, one interview with manager- very informal and nice.  But if background,  a personality  type and a clinical question.  Next a clinical test to screen for clinical skills.  Next a full interview with management and then staff.  Several situational questions to ask about clinical experiences. Everyone was very nice and positive. After a break, the  interview was cut short after the management portions due to their judgement that I did not have enough clinical experience. Not sure what the purpose of the test (I got all answers correct) and first interview were. Unprofessional.  Best to be a PGY2 I suppose and do not put weight on  the first screening interview and test.", "Interview Questions": "Toughest patient/ clinical situation.\r\nWhen you had to make a difficult decision.\r\nA time when quality was compromised to get the job done.\r\nA time when short staffed.\r\n"}], [{"date": "15 Oct 2021", "title": "Site Operations Coordinator, EML Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Emory Healthcare (Atlanta, GA) in Oct 2021", "Interview Descriptions": "The interview process was fairly relaxed and similar to a standard interview. They asked about my background and took time to ask follow up  questions about specific jobs that aligned with the role I was applying for.  It was a group interview with 3 people. The second interview was more informal. It primarily served to acquaintance candidates with the facilities and actualize the description of the role.", "Interview Questions": " Describe a time you went above and beyond for a customer or someone in your field and what was the result."}, {"date": "26 Sept 2021", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Emory Healthcare", "Interview Descriptions": "I was interviewed by the manager and staff nurse on the unit.  The interview flow was natural and light  while at the same time being professional with appropriate and relevant questions for the role.", "Interview Questions": "What is your reason for leaving your current position?"}, {"date": "9 Sept 2021", "title": "Physical Therapist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Emory Healthcare", "Interview Descriptions": "Very conversational. Questions that require you to think on feet were asked. Know about teamwork, challenges and how to overcome in addition to your weaknesses. Not many clincial questions were asked.", "Interview Questions": "How will you overcome your weaknesses "}, {"date": "21 Aug 2021", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Emory Healthcare", "Interview Descriptions": "It went well. Very thorough, STAR method used. Managers were nice, not a scary experience. I wish all interviews were like the ones I had. Emory managers seemed like they supported their staff.", "Interview Questions": "Tell me about a time you had conflict with an employee."}, {"date": "12 Feb 2023", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Emory Healthcare in Aug 2021", "Interview Descriptions": "Easy, virtual/video interview. One interview with the three team managers that took about 30 minutes. Mostly told me about the position. Was offered the position about 1-2 days later and accepted the job.", "Interview Questions": "Tell us about your work history"}, {"date": "14 Jun 2022", "title": "Client Experience Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Emory Healthcare (Atlanta, GA) in Aug 2021", "Interview Descriptions": "I did three interviews, one with the Administrator, then the provider and lastly the Ops Manager.  Each interview was about an hour. The one with the provider was over zoom which was nice. They took me on a tour around the clinic. They was very straight forward with how the job is.", "Interview Questions": "Tell me a time where you had to handle a difficult patient and how did you resolve it. "}, {"date": "13 Jul 2021", "title": "Nurse Residency Program Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Emory Healthcare", "Interview Descriptions": "I received an email from the Talent Acquisition Specialist within 2-days from applying, to schedule an interview. I then interviewed virtually with the Speciality Director.  The Director asked 3-4 questions then told me I would hear back within the next week. I received an offer via email.", "Interview Questions": "Interview questions: \n-Tell me more about yourself \n-Tell me about a time you had a conflict with a patient and how did you handle the situation \n-Why are you the best candidate for this position?\n"}, {"date": "25 Jul 2021", "title": "Nurse Residency Program Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Emory Healthcare (Philadelphia, PA) in Jul 2021", "Interview Descriptions": "They interviewed me for 30 minutes and they were super friendly! I got to choose two different floors to interview for and I scheduled them back to back. Slots filled up fast though!", "Interview Questions": "Describe a conflict you had with a coworker"}, {"date": "19 Dec 2022", "title": "Operator Services Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Emory Healthcare (Atlanta, GA) in Jul 2021", "Interview Descriptions": "Interview process was virtual meeting with department manager via zoom asking questions regarding to job that will be performed 2nd interview was a call asking would u accept the job offer & salary", "Interview Questions": "What would you do if the emergency code line rings while you’re on a phone call?"}, {"date": "22 Jun 2022", "title": "Senior Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Emory Healthcare (Atlanta, GA) in Jun 2021", "Interview Descriptions": "The interview process is extremely exaggerated and disjointed.  I initially interviewed with recruiter, followed by a soft land pre-screen with an administrator, followed by a zoom panel interview with 5 leadership team members of the department.  I was then scheduled for a zoom panel interview with providers, followed by a scheduled on site interview with leadership team and providers that lasted 5hrs. I was then scheduled for an additional interview with administrator again who asked if I could make time to visit the campus a second time to meet with a provider who was not available during the first visit.  As a candidate who was employed, this was extremely taxing to my time.  The company would benefit from streamlining the interview process.  I was ready to walk away after the 3rd interview as it set that tone that there were challenges with decision making, loop closing and time consideration within the department. If they cant value a candidates time they certainly wouldn't value staff time.  I did join the company and my observation was spot on.", "Interview Questions": "Typical situational, behavioral and technical leadership questions.  You will be asked the same questions(s) by 8-11 people.  "}], [{"date": "8 Oct 2021", "title": "Occupational Therapist Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Emory Healthcare in May 2021", "Interview Descriptions": "Over zoom, a bit intense with like 7 people on it asking a lot of questions. They were friendly enough but definitely felt a bit overwhelming and like you were failing", "Interview Questions": "Experience, what would you do in a certain scenario, describing a time a coworker did something wrong and how you responded "}, {"date": "7 Apr 2021", "title": "Licensed Practical Nurse (LPN) Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Emory Healthcare (Atlanta, GA)", "Interview Descriptions": "Interview was a panel interview, everyone asked 3 questions each. It was a fairly easy interview. I was able to answer all questions. After the interview be sure to ask questions.", "Interview Questions": "Tell me a time you had a difficult patient or situation how did you handle it? "}, {"date": "3 Apr 2021", "title": "Public Safety Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Emory Healthcare", "Interview Descriptions": "The interview was very relaxed. The interviewers were very professional and cordial. They explained the job with a lot of detail and made sure nothing was excluded. As long as you show up on time and conduct yourself in a polite, honest, professional manner I believe you will succeed.", "Interview Questions": "What does Public Safety mean to you?"}, {"date": "1 Apr 2021", "title": "Staff RN Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Emory Healthcare", "Interview Descriptions": "Relatively easygoing with a lot of behavioral questions. Straightforward and wanted to know more about me as a person. Interviews vary location to location. Midtown was more forms and St. Joseph’s was more informal.", "Interview Questions": "What made you want to be a nurse?"}, {"date": "1 Apr 2021", "title": "Pharmacist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Emory Healthcare", "Interview Descriptions": "The interview was different from what I was used to at other institutions. I only interviewed with the department director. No other staff was involved, nor did I get an opportunity to interact with them on the day of the interview, which was only a couple of hours long as well.", "Interview Questions": "why are you interested in this postition?"}, {"date": "26 Jan 2023", "title": "Nurse Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Emory Healthcare (Atlanta, GA) in Apr 2021", "Interview Descriptions": "Week One: Submitting an application Week Two: The screening process Week Three: Scheduling an in-person interview Week Four: Attending the in-person interview Weeks Five and Six: Follow-up interview Week Seven: Meeting upper management", "Interview Questions": "How would you handle an emergency situation? How do you handle difficult patients? ."}, {"date": "4 Jun 2021", "title": "Nurse Practitioner Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Emory Healthcare in Apr 2021", "Interview Descriptions": "The interview process was very transparent and took about 3 months between the application and 2 rounds of interviews. Both interviews were similar and lasted about 45 minutes. All questions were straightforward and my interviewers were engaging and kind.", "Interview Questions": "Where do you see yourself in 5 years? "}, {"date": "28 Mar 2021", "title": "Patient Access Representative Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Emory Healthcare", "Interview Descriptions": "The interview was quick and easy. They asked questions related to customer service. I did enjoy that I was given a lot of information regarding the job. Please ask many questions related to training and the job.", "Interview Questions": "1. What do you consider good customer service?"}, {"date": "2 Mar 2021", "title": "Food and Nutrition Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Emory Healthcare", "Interview Descriptions": "I filled out an application and received  a call back within a few days. The man I spoke to was very polite and I previously declined the interview due to illness but I reached back out and he said I could come for an interview", "Interview Questions": "What is my work availability "}, {"date": "25 Mar 2021", "title": "Patient Services Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Emory Healthcare in Mar 2021", "Interview Descriptions": "The interview process was made up of several questionnaires and group interviews. I was told I would hear back within a week and a month later, still hadn’t heard anything.", "Interview Questions": "What was an example of something you made a mistake on and how did you fix it?"}], [{"date": "5 Feb 2021", "title": "Navigator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Emory Healthcare", "Interview Descriptions": "2 interview. First one was over the phone and very casual. 3 people on the line. 2nd one was in person. 5 people interviewed me. Most of the people were cool, but the main person was very straight faced. Was unsure after my interview.", "Interview Questions": "Name a time when you didn’t agree with a supervisor and how you handled it. "}, {"date": "4 Feb 2021", "title": "PCT - Unit Secretary Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Emory Healthcare", "Interview Descriptions": "It was a panel interview with managers from several floors who asked questions. Once completed I was given a tour and if I got a call back I started the on boarding  process that was tedious", "Interview Questions": "I had a panel interview I thought it would be more intimidating but it wasn’t "}, {"date": "11 Mar 2021", "title": "Nurse Residency Program Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Emory Healthcare (Atlanta, GA) in Feb 2021", "Interview Descriptions": "The process was easy to submit an application, received a couple of verbal offers. Still waiting to hear back! Interviewed with three units, but keeping my options open. Overall, heard good things about the company.", "Interview Questions": " Why did you choose nursing?"}, {"date": "21 Feb 2022", "title": "Clinic Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Emory Healthcare in Feb 2021", "Interview Descriptions": "Multiple interviews...to where the information and questions became quite repetitive.  It was evident that not all the interviewers wanted to be part of this process and seemed distracted at times.  However; it did give me an opportunity to ask a lot of questions about the job.", "Interview Questions": "Tell me about a time you worked with a difficult patient/person.  They ask a lot of scenario questions...so be ready to dive into the specifics of your past and weave in your skill set along the way."}, {"date": "19 Jan 2021", "title": "Nurse Extern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Emory Healthcare", "Interview Descriptions": "Was a very long process, took about 3 months from initially being contacted to actually receiving a job offer. However, the people I talked to were very laid back and made the conversation and interviews easy and relaxed, so overall the process was enjoyable.", "Interview Questions": "What unit I wanted to be on and why."}, {"date": "19 Jan 2021", "title": "Physician Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Emory Healthcare", "Interview Descriptions": "Good process. Very transparent throughout. I felt well communicated with the whole time. There was always someone to answer my questions whether it be senior staff or Human Resources team", "Interview Questions": "What sort of conflict resolution skills do you use with junior staff or senior mgmt"}, {"date": "17 Jan 2021", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Emory Healthcare", "Interview Descriptions": "The first round was just resume and cover letter.  The next round was a video you had to make of yourself.  The last round was a phone interview.  You also ranked different project you wanted to be on.", "Interview Questions": "Leadership experience in college or university"}, {"date": "11 Jan 2021", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Emory Healthcare", "Interview Descriptions": "Referred by a friend so got a call and interview quickly after submitting my application online. The interview included a tour of the hospital unit and then about 5 questions with the director and 3 other staff.", "Interview Questions": "Mostly behavioral questions about past experiences. For example one was.\n\"Describe a situation when you had to work closely with a difficult coworker. How did you handle the situation? "}, {"date": "2 Feb 2021", "title": "Infectious Disease RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Emory Healthcare (Atlanta, GA) in Jan 2021", "Interview Descriptions": "The manager was very encouraging and patient in listening. Very knowledgeable, courteous, attention to detail, and encouraging conversation. Gave me a virtual tour of the floor which made me feel confident.", "Interview Questions": "Handling difficult situations on a busy day. "}, {"date": "16 Feb 2023", "title": "Patient Care Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Emory Healthcare in Jan 2021", "Interview Descriptions": "Interview process was great. Ask a questions about office morale. Ask basic questions about customer service, coordinating multiple appointments between departments managing and adjusting the clinicals schedule. Ask questions when needed. I’m", "Interview Questions": "How would fix a complaint from patient in regards to staff ?"}], [{"date": "11 Nov 2020", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Emory Healthcare in Oct 2020", "Interview Descriptions": "The interviews are very different depending on which unit you are interviewing with. One of my interviews had more basic questions, while the other had more difficult situational based questions. All people I interviewed with were extremely nice!", "Interview Questions": "Why do you want to work for us?\nWhere do you see yourself in 5 years?\nMost difficult experience?"}, {"date": "20 Nov 2020", "title": "Registered Nurse Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Emory Healthcare in Oct 2020", "Interview Descriptions": "The interview is help on zoom and is one on one with the unit director. they ask you about yourself, your career goals, and why you want to be a nurse.", "Interview Questions": "Where did I see myself in 5 years, career-wise"}, {"date": "8 Mar 2023", "title": "Dietary Aide Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Emory Healthcare in Sept 2020", "Interview Descriptions": "Drug test and physical after being given an offer then an actual training for dietary diets. Once backgrounds check comes back orientation can begin and you start a week after your orientation", "Interview Questions": "Why this career and why this company"}, {"date": "30 Aug 2020", "title": "Physician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at Emory Healthcare", "Interview Descriptions": "Taken to site specific clinics, meeting operations managers / leaders / and staff when applicable. casual encounters, comfortable and able to engage with staff/other providers easily. difficulty of interview depends on site and providers, area, etc. it varies per clinic.", "Interview Questions": "what draws you to the area where the clinic is located?"}, {"date": "11 Aug 2020", "title": "Nurse Residency Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Emory Healthcare", "Interview Descriptions": "They were very nice and professional. Wanted to know why we chose them and why they should choose us. What made us go into nursing and where do we see ourselves in 5 years.", "Interview Questions": "Why do you want to work with us?"}, {"date": "4 Aug 2020", "title": "Speech Pathologist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Emory Healthcare", "Interview Descriptions": "I was contacted for a virtual interview, and then invited to an in-person interview. Turn around time for the final interview was within 3 days. Overall, it was very comfortable-- the faculty just wanted to get to know you.", "Interview Questions": "Tell me about your journey to becoming an SLP?"}, {"date": "9 Mar 2021", "title": "Nurse Extern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 1 day. I interviewed at Emory Healthcare in Aug 2020", "Interview Descriptions": "It was a 30 minute phone interview. It felt more like a conversation than anything. It was a very laid back interview.  She just seemed like she wanted to get to know me. They ended up hiring me on the spot. It was one person interview.", "Interview Questions": "Why did you choose Emory?"}, {"date": "22 Jul 2020", "title": "Summer Externship Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Emory Healthcare", "Interview Descriptions": "I had my interview through the phone and it was a one step simple process. I got it through connections so it might be longer and more complicated for other people.", "Interview Questions": "Why did you decide to become a nurse?"}, {"date": "13 Sept 2020", "title": "Medical Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Emory Healthcare in Jul 2020", "Interview Descriptions": "Long I spoke with 6 different people over zoom then 2 hours in in office meeting everyone and doing an office tour.Everyone seemed to be pretty much open minded and meshed well together", "Interview Questions": "Tell me something about you"}, {"date": "24 Jun 2020", "title": "Nurse Resident Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Emory Healthcare", "Interview Descriptions": "Interview process was fine. I was sent a link to sign up for two slots. I was given about 3 weeks to  prepare. Make sure you do research on the units, which the interviewers found impressive.", "Interview Questions": "Name a time that you worked with a team? How do you deal with diversity? Why should we hire you?"}], [{"date": "4 Jul 2020", "title": "Nurse Residency Program Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 2 months. I interviewed at Emory Healthcare (Atlanta, GA) in Jun 2020", "Interview Descriptions": "I was emailed saying I was granted an interview and that a sign up link will be sent in the next few days, I never received the email and didn't get a response until 4 days later after requesting the link.  I was unable to sign up for a unit that I wanted since I received the link late, it was first come first serve.  I applied to one of the units that was open and scheduled the interview. The day of the zoom interview, the manager was almost an hour late and I was not given any warning and just had to wait. The interview was easy. I was told I'd hear back in a few days with their decision but have not heard anything 2 weeks later.", "Interview Questions": "Give me an example that would show your compassion towards patients. "}, {"date": "7 Aug 2020", "title": "Nurse Resident Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Emory Healthcare in Jun 2020", "Interview Descriptions": "I got the unit that I wanted for interview. They said it would be w/2 people, ended up with 5. One lady had her Zoom screen off and didn't really talk. The interview went well however changed at the end which I still dont understand why. I never got a follow up email after.", "Interview Questions": "Describe a time you were on a team, how have you experienced/worked with diversity? Why Emory, why nursing?"}, {"date": "20 May 2020", "title": "ICU RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Emory Healthcare", "Interview Descriptions": "Discussion of roles and responsibilities, expected orientation process, review of previous experience with selected patient population, and discussion of overall team dynamics within the unit.  Any excess time was spent on personal questions.", "Interview Questions": "Describing a normal shift with the selected patient population."}, {"date": "7 May 2021", "title": "Technologist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Emory Healthcare (Atlanta, GA) in May 2020", "Interview Descriptions": "I did an over the phone interview with two different people and there were situational questions given. You had to answer them in a way where you gave a specific event that you experienced.", "Interview Questions": "Name a situation in which you did not agree with a supervisor, how did you handle it and what was the outcome? "}, {"date": "22 May 2020", "title": "Patient Care Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Emory Healthcare (Atlanta, GA) in May 2020", "Interview Descriptions": "Applied online. Recruiter had called me to set up a interview. Talked to the department manager. Since it was COVID 19 I had interviewed over the phone. Asked me a lot of questions. Then was called the next day.", "Interview Questions": "Tell me about yourself? \r\nTell me a difficult situation you have been in and how did you handle it? "}, {"date": "11 Mar 2020", "title": "RN Residency Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Emory Healthcare", "Interview Descriptions": "The interviews took place in a huge ballroom. They were only 30 minutes long. 50 other interviews were taking place at the same time, in the same room. It was almost impossible to sign up for an interview slot with the specialty units. Two leaders from each unit were at each table in the ballroom.", "Interview Questions": "Why nursing?"}, {"date": "6 Feb 2021", "title": "Registered Nurse Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Emory Healthcare (Atlanta, GA) in Jan 2020", "Interview Descriptions": "Quick and easy process. They were very responsive to any of my questions or concerns. Questions during the interview were simple to understand and answer. Enjoyed speaking with them. good experience", "Interview Questions": "what made you choose nursing?"}, {"date": "7 Feb 2020", "title": "Patient Experience Representative Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Emory Healthcare (Atlanta, GA) in Jan 2020", "Interview Descriptions": "It never happened. I was called to set up a phone interview and the day of I received a call saying there was an emergency with the interviewer. I was told it was uncertain of a day and time we could set up another phone interview. Days later, I wasn't under review any longer. Sad thing is, it's not the first time this happened. About 8 years ago, I was on the way to an interview and got a call that I wasn't scheduled. SO UNPROFESSIONAL!!!", "Interview Questions": "N/A"}, {"date": "14 Jul 2022", "title": "Sterile Processing Technician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Emory Healthcare (Atlanta, GA) in Jan 2020", "Interview Descriptions": "Asked regular interview questions. The person who interviewed me was nice especially since it was my first ever job interview! Asked a few questions about sterile processing and how it related to my experience.", "Interview Questions": "They asked basic interview questions. "}, {"date": "3 Dec 2019", "title": "Clinical Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Emory Healthcare", "Interview Descriptions": "Applied online. Followed by a phone interview with human resources. I was later called by the manager for an in-person interview. The  in person interview lasted approximately 30 minutes and was with the nurse managers and the nursing director of the unit.", "Interview Questions": "Describe a scenario where you showed leadership."}], [{"date": "9 Jun 2021", "title": "Patient Care Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Emory Healthcare in Nov 2019", "Interview Descriptions": "It was a long-drawn-out process even with an employee referral. Alert, when it is not a huge hiring spree they don't pull applications. Get a referral from someone even if seems like begging just to get in the door.", "Interview Questions": "Express how you found the new job and why it's a good fit for you and your goals"}, {"date": "9 Jan 2021", "title": "Imaging Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Emory Healthcare (Atlanta, GA) in Nov 2019", "Interview Descriptions": "Called for an interview, day and night manager gave interview. Then we walked around the area and took a tour of the department. They asked questions like job history and such.", "Interview Questions": "are you a team player?"}, {"date": "6 Oct 2019", "title": "RN Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Emory Healthcare", "Interview Descriptions": "One on one with the hiring manager. Overall an average RN interview process with no surprises or inconvenience.  Hiring manager personable and experienced-knew on the spot if I was going to be a good fit with the culture/company.", "Interview Questions": "Are you flexable"}, {"date": "29 Jan 2020", "title": "PSC Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Emory Healthcare in Oct 2019", "Interview Descriptions": "Received a call about the position, setup up interview, did interview, received a call weeks later from office manager, and then recruiter called back about details and next steps until orientation", "Interview Questions": "Tell us why we should hire you"}, {"date": "28 Sept 2019", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Emory Healthcare", "Interview Descriptions": "Pretty standard. APplied online, contacted for phone interview. then did on site. the whole process took a fews weeks. Very nice people No complaints. Easy questions. You'll do great if you just be yourself", "Interview Questions": "Describe a time you had a conflict with a supervisor?"}, {"date": "8 Sept 2019", "title": "Patient Service Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Emory Healthcare", "Interview Descriptions": "Apply online and monitor the application process. Manager calls for a face to face interview. Than you will interview with the department directors. The manager will call back for the next steps.", "Interview Questions": "What are your strengths and weaknesses?"}, {"date": "18 Jul 2019", "title": "Management Engineer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Emory Healthcare (Atlanta, GA) in Jul 2019", "Interview Descriptions": "The interview process was somewhat normal.  I had 2 one hour phone calls with two different people.  One was the hiring manager.  Both of them thought my qualifications might be a match and invited me to Atlanta to meet them in person along with the team, some clinicians, and a VP.  I was tired from my commute from California, but excited just the same because Atlanta had been one of the places I was looking to relocate to and was just so honored and happy to have been invited.  It was a full day and breakfast and lunch was included.  I was simply thrilled to be getting the chance to meet everyone and hear about their Lean Journey and the details of the role.  I believed I had much to contribute to the role and much to learn.  In addition, my conversations with most everyone I met were positive enough.   The following day one of my references called me to share that she had just received a phone call for a reference check.  I have often used this reference because we've known eachother professionally for some time and she has written a few of my performance evaluations since she was a previous boss of mine.  Anyway she called me because she was getting excited about the fact that I was getting a reference check from a healthcare system I admired and hoped to work for.  She even called me back (my reference) to share the example she used when we worked together.  My reference was as equally excited as me.  I mentioned to my other references to keep a look out should they get a call for a reference check.  A week went by and still nothing.  Another week and I finally decide to follow up with the hiring manager via email.  The response I got was, \"since you left we have decided to focus on rethinking our recruitment strategy and are pursuing other candidates.\"  I asked for feedback about what it was that made them think I was no longer a good fit and heard nothing back.  I have no hard feelings, it was simply a lot of effort to fly out from Cali get prepared for my 8 hour interview, only to hear in an email that they are rethinking their recruitment strategy.  I would imagine a little bit more feedback after going through such a rigorous process.  I almost passed up a couple other opportunities because this one seemed so promising and a great opportunity to grow and be challenged even more within the breadth and scope of work that was specific to this role.", "Interview Questions": "Why Emory, What can you bring to this role? "}], [{"date": "20 Aug 2019", "title": "Management Engineer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Emory Healthcare (Atlanta, GA) in Jun 2019", "Interview Descriptions": "The interview process was somewhat normal. I had 2 one hour phone calls with two different people. One was the hiring manager. Both of them thought my qualifications might be a match and invited me to Atlanta to meet them in person along with the team, some clinicians, and a VP. I was tired from my commute from California, but excited just the same because Atlanta had been one of the places I was looking to relocate to and was just so honored and happy to have been invited. It was a full day and breakfast and lunch was included. I was simply thrilled to be getting the chance to meet everyone and hear about their Lean Journey and the details of the role. I believed I had much to contribute to the role and much to learn. In addition, my conversations with most everyone I met were positive enough. The following day one of my references called me to share that she had just received a phone call for a reference check. I have often used this reference because we've known eachother professionally for some time and she has written a few of my performance evaluations since she was a previous boss of mine. Anyway she called me because she was getting excited about the fact that I was getting a reference check from a healthcare system I admired and hoped to work for. She even called me back (my reference) to share the example she used when we worked together. My reference was as equally excited as me. I mentioned to my other references to keep a look out should they get a call for a reference check. A week went by and still nothing. Another week and I finally decide to follow up with the hiring manager via email. The response I got was, \"since you left we have decided to focus on rethinking our recruitment strategy and are pursuing other candidates.\" I asked for feedback about what it was that made them think I was no longer a good fit and heard nothing back. I have no hard feelings, it was simply a lot of effort to fly out from Cali get prepared for my 8 hour interview, only to hear in an email that they are rethinking their recruitment strategy. I would imagine a little bit more feedback after going through such a rigorous process.  I mean I made it as far as them being interested enough in me to contact my some of my best references!  I almost passed up a couple other opportunities because this one seemed so promising and a great opportunity to grow and be challenged even more within the breadth and scope of work that was specific to this role.  Giving someone the cold shoulder after investing so much time and energy in them isn’t fitting at all.", "Interview Questions": "Why Emory? What can you bring?"}, {"date": "19 Apr 2019", "title": "Nuclear Medicine Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Emory Healthcare (Atlanta, GA) in Apr 2019", "Interview Descriptions": "It was a lot more informal than I thought it would be. The two supervisors/managers I interviewed with had the greatest personalities. I can't recall a moment that a smile left their face and I can confidently say we laughed during the entire interview. I was shown around the department and met the rest of the techs. I didn't meet one unwelcoming person. This allowed me to break out of my shell and get through the interview as me and not a dressed up doll that the past 2 years of school has trained me to be. Absolutely amazing.", "Interview Questions": "Tell me about yourself"}, {"date": "13 Mar 2021", "title": "ER Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Emory Healthcare in Mar 2019", "Interview Descriptions": "Very personable and engaging. My interviewers were also instrumental in me making choices for school that i could bridge from paramedicine to nursing. They focused on and was appreciative of my clinical knowledge and asked me why I chose to work in this field. They also gave me quite a few senario based questions that tested my level of critical thinking, common sense, emotional iq. Overall the interview didnt seem like an interrogation. Just a private get together with new friends that are interested in your future.", "Interview Questions": "What do you hope to gain from working in this field of work."}], [{"date": "18 Mar 2019", "title": "Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 7 months. I interviewed at Emory Healthcare (Atlanta, GA) in Jan 2019", "Interview Descriptions": "Very disappointed with the entire interview process.  After seven months of calls, waiting, interviews, waiting, more interviews, more waiting... the recruiter called to discuss salary and references.  Weeks later, she finally calls to say they're going in a \"different direction\".  I hope they treat their patients better than they treat their candidates.", "Interview Questions": "Strategic experience"}, {"date": "17 Nov 2021", "title": "Coder II Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Emory Healthcare (Atlanta, GA) in Jan 2019", "Interview Descriptions": "It was an okay process.  It was a total of two interviewers. One was the manager over revenue cycle and the other was the Lead coder for the position I applied for.", "Interview Questions": "Tell us about a time you had conflict within the office and how did you handle it?"}, {"date": "4 Oct 2019", "title": "Nurisng Residency Program Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Emory Healthcare (Atlanta, GA) in Jan 2019", "Interview Descriptions": "applied online, got an interview, was interviewed but the director of the unit and charge nurse. They gave me a tour of the unit. I took about 30 mins. they asked specific questions to the unit.", "Interview Questions": "why did you want to work here?\r\nGive an example of how you provided excellent customer care\r\nHow did you deal with a pt with a different culture from you"}, {"date": "14 Dec 2018", "title": "Patient Access Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Emory Healthcare (New York, NY) in Dec 2018", "Interview Descriptions": "Interview process was a panel interview. STAR interview questions basically sceniero based questions. Word of advice be confident. Outline why your an asset to the company. Smile. Try to be relatable.", "Interview Questions": "Tell me about a time you had to deal with a difficult patient or customer? What was the situtation and what was the outcome."}, {"date": "15 Nov 2018", "title": "Nurse Residency Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Emory Healthcare (Atlanta, GA) in Nov 2018", "Interview Descriptions": "It was a smooth process. I could not make the initial date and was rescheduled for a new date quickly and smoothly. \r\nThe interview lasted 1hr with a tour, questions and conversation", "Interview Questions": "“What do you know about us? “\r\n“We see here that you said ...... tell us more about that”\r\n“Why did you choose this unit?”\r\n“What are your career goals?”\r\n“How confident are you in your skills? Especially IV” \r\n“Most challenging clinical experience”"}, {"date": "18 Oct 2018", "title": "Patient Access Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Emory Healthcare in Oct 2018", "Interview Descriptions": "They ask typical interview questions, the situation, how you handled it, and what was the outcome. Why should we chose you? They told me about the position and they made me feel comfortable.", "Interview Questions": "What are your strengths and weaknesses?"}, {"date": "10 Dec 2019", "title": "Patient Access Representative I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Emory Healthcare (Atlanta, GA) in Oct 2018", "Interview Descriptions": "The process was pretty smooth it was a panel interview of 3, the process took pretty long though. My actual start date was about 1 month after interview. Once hired there is another month of training and then you are free to work. Depending on the department things can sometimes be hectic.", "Interview Questions": "What’s your plans for the future ? "}, {"date": "14 Sept 2018", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 1 week. I interviewed at Emory Healthcare in Aug 2018", "Interview Descriptions": "Call with HR just to briefly go over your resume and your area of interest as well as desired shift. Then they send your info to hiring managers to units you are interested in. If they like it they call you back for interview. I got lucky and had a few like my resume but that meant three managers interviewing me at the same time. Was very intimidating but they were all very nice and non judgmental.  There was no skills test or IQ testing", "Interview Questions": "Name a time you made a mistake and how did you fix it\r\nHow do you handle conflict with a patient or family member \r\nWhy do you want to work here \r\nTell me about yourself (first question) "}], [{"date": "25 Jun 2018", "title": "Data Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Emory Healthcare", "Interview Descriptions": "Brief, the HR talked about what Emory does and asked me to introduce myself. I talked about my projects and she was asking questions related to what i have done in the project.", "Interview Questions": "Questioned from my Resume?"}, {"date": "16 Jun 2018", "title": "Patient Care Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Emory Healthcare", "Interview Descriptions": "Panel Interview with mock questions. All staff in interview asked questions . Atmosphere was pleasant. Interview lasted about  15 to 20 min. Depending on questions and how long you take. Answer strictly to the point and what is asked of you.", "Interview Questions": "Where do you see yourself in 3 to 5 years?"}, {"date": "12 Jul 2018", "title": "Patient Care Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 8 months. I interviewed at Emory Healthcare (Atlanta, GA) in Jun 2018", "Interview Descriptions": "Getting an interview at Emory is a long process if you do not have any connections or employee referrals. I was contacted by recruiter a month after applying. Overall, the interview process is pretty average. Initial phone screen followed by panel interview a week later. Interview questions were the usual and pretty basic. I recommend being very personable in your interview. Practice your responses to interview questions but don't be a robot.", "Interview Questions": "Why do you want to work at Emory?"}, {"date": "29 Mar 2018", "title": "Genetics Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Emory Healthcare (Atlanta, GA)", "Interview Descriptions": "Wonderful! Supervisors took candidate to dinner the night before, provided lodging and arranged a ride to the interview in the morning. Interviewed with physicians, lead operations coordinator, and the genetic counseling team. Went from 9am-3:30pm", "Interview Questions": "Where do you see yourself in five years?"}, {"date": "17 Mar 2018", "title": "Leadership Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "The process took 2 months. I interviewed at Emory Healthcare", "Interview Descriptions": "The entire process needs to be revamped. You will apply for a position and can wait up to 180 to be contacted!!! That’s ridiculous and what does their talent acquisition do all day? On average it took a month to be contacted about the position I applied for.", "Interview Questions": "What’s your leadership style"}, {"date": "28 Feb 2018", "title": "Nurse Resident Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Emory Healthcare", "Interview Descriptions": "Semi-loud room with multiple interviewing at the same time for various positions. It was internal interview day so a group of people from the floor met with you individually. Some specialties offered on the spot jobs. These jobs gave you 2 business days to accept or decline.", "Interview Questions": "Tell me about a time where you had conflicting patient demands? how did you handle them? what was the result?"}, {"date": "19 Jan 2022", "title": "Accreditation Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Emory Healthcare (Atlanta, GA) in Mar 2018", "Interview Descriptions": "My interview was via Zoom and it began on time and the experience was wonderful.  My interviewer was nice she listened she asked me meaningful questions and made me feel very comfortable.", "Interview Questions": "What are your long-term goals?"}], [{"date": "20 Feb 2018", "title": "Patient Services Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 3 weeks. I interviewed at Emory Healthcare (Atlanta, GA) in Feb 2018", "Interview Descriptions": "I was recruited at a university career fair. I got an email to go to an interview. The interviewer was very friendly and nice. The questions were of average difficulty.  Just be prepared and you should be fine. They asked about problem-solving and other strengths and answered my questions. They were very detailed about the position and process and everything went really well!", "Interview Questions": "Why do you want to work for us?"}, {"date": "4 Jan 2018", "title": "Patient Access Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Emory Healthcare (Atlanta, GA)", "Interview Descriptions": "There are 3 interviews in total: phone interview, meeting with a supervisor, and a meeting with the head of the department. The first two interviews were individual interviews but the last one was a group interview with 2 other people. It wasn't bad at all, typical interview situational questions.", "Interview Questions": "N/A"}, {"date": "19 Aug 2018", "title": "Patient Access Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Emory Healthcare (Decatur, GA) in Jan 2018", "Interview Descriptions": "I applied online and receuved a call for an interview within the week. It was an average interview with a neutral experience. Very professional environment. It is best to stay om subject when asked a question and try your best not to be nervous. . It is best to stay om subject when asked a question and try your best not to be nervous.", "Interview Questions": "N/A"}, {"date": "23 Mar 2018", "title": "Technical Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at Emory Healthcare in Jan 2018", "Interview Descriptions": "very long waiting time  . hard to get response from the HR. very long waiting time\r\nvery long waiting time  . hard to get response from the HR. very long waiting time", "Interview Questions": "tell me about yourself ? why should we hire you , strength and weekness"}, {"date": "16 Jun 2018", "title": "Nurse Resident Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Emory Healthcare (Atlanta, GA) in Nov 2017", "Interview Descriptions": "I applied for the job on Indeed.com on a Friday, two days later (that Monday), I received an email to come for an interview the following Saturday.  I thought the interview was going to be one on one, however when I got to the interview it was a job fair. But it was not an open job fair where anyone could show up.  The unit I interviewed for only had one manager on the panel so I was not as anxious as I thought I would have been with 3 or 4  people to interview in front of.  My interview was about 30 minutes long. I was offered the position after the interview.", "Interview Questions": "Tell me a time where you had to deal with a difficult patient and how did you handle the situation."}, {"date": "28 Nov 2017", "title": "Patient Services Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Emory Healthcare (Atlanta, GA) in Nov 2017", "Interview Descriptions": "I submitted the application on a Wednesday and recieved a phone call thursday for a phone interview. Scheduled the group interview at the end of the call. They asked me like 4 questions over the phone. Monday had the group interview and it was 2 other ladies was in there with me. The manager asked the same questions over the phone. At the end of the group interview, if you are selected for the final round, you will recieve an email today. 3 hours later, I recieved an email that I made it to the final round. My final interview was wednesday. Had to wear a suit. I was in the interview with another young lady and the manager asked 3 questions and gave us a breakdown of the job. I recieved an email the following monday with references and a background check.  Wednesday came and I recieved a phone call with an offer! Yay!!!", "Interview Questions": "Name a time were you had a mistake and had to fix it?"}, {"date": "17 Jul 2018", "title": "Patient Services Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Emory Healthcare (Sandy Springs, Fulton, GA) in Oct 2017", "Interview Descriptions": "Applied online recieved a call couple weeks later. phone interview. in person interview a week later with a group.  then was called four days later with job offer. after that, through out training interviewed with multiple departments", "Interview Questions": "How do you handle a stressful situation"}, {"date": "7 Oct 2018", "title": "Nurse Resident Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Emory Healthcare (Atlanta, GA) in Oct 2017", "Interview Descriptions": "Very organized, wait only 15 min., very friendly and gave comfort, only two unit managers, asked questions that related my experiences. After that they asked me my preferred shift and offered me a job. They said they will call me an with offer next week.", "Interview Questions": "Tell me about yourself, why Emory, what is your previous work experience "}, {"date": "1 Jul 2017", "title": "PACU RN (Main Campus) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Emory Healthcare", "Interview Descriptions": "Typical interview questions. Nothing different besides the standard \"tell me about yourself.\" Emory does want applicants to be career driven & have goals. Good company to work for, and great benefits. Only drawback is parking in the University parking areas which requires shuttle to be taken to work (adds an extra 15-20 minutes).", "Interview Questions": "Tell me about yourself. What are your career goals."}, {"date": "24 Aug 2017", "title": "Physician Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Emory Healthcare (Atlanta, GA) in Jul 2017", "Interview Descriptions": "First interview consisted of meeting with the department manager where target selection questions were asked.   At the second interview, I met the actual physicians and staff in the department and was interviewed individually by each physician in the department.", "Interview Questions": "State an example of a creative solution to unexpected situations when your leadership skills were needed."}], [{"date": "16 Jul 2017", "title": "Patient Services Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Emory Healthcare (Atlanta, GA) in Jul 2017", "Interview Descriptions": "I applied online and got a phone call about two weeks later. It was a surprise call and I had a quick interview where I was asked questions such as \"Why this position?\", \"What is a time you did something without guidance?\", \"Describe a difficult customer service experience.\",  \"What are your short and long-term goals?\", \"What is one positive and one negative thing your previous employer would say about you?\", and \"Describe your best customer service experience.\" I was scheduled for an in-person interview at the end of the phone interview. \r\n\r\nThe in-person interview was a group interview with two other people and we were asked the same questions again. A week later, I got an email that I was chosen for a final round interview with executives from the company. I was called with an offer a few days later.", "Interview Questions": "Describe a difficult customer service experience."}, {"date": "30 Nov 2017", "title": "Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Emory Healthcare (Decatur, GA) in Jul 2017", "Interview Descriptions": "I interviewed with Emory over the span of 2 months. 1st Interview with the Recruiter, 2nd Interview with the VP of the department, 3rd Interview with the reports of the VP 6 hours (including the person currently Acting in the Role), 4th interview with leaders of adjacent departments 6 hours.", "Interview Questions": "What is your process of evaluation? How do you create solutions? How do you coach? How is your current role aligned organizationally? How do you measure success?"}, {"date": "13 Jun 2017", "title": "Patient Services Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at Emory Healthcare (Atlanta, GA)", "Interview Descriptions": "Very long, about 5 separate interviews with various people. It took a very long time to hear back from the hiring team. We met with the CFO which was pretty cool.", "Interview Questions": "Weaknesses"}, {"date": "11 Jul 2017", "title": "Patient Services Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Emory Healthcare (Atlanta, GA) in Jun 2017", "Interview Descriptions": "It was a group interview process, kind of intimidating at first but they are very nice and polite. You warm up pretty quickly after the first couple of questions but definitely prepare yourself beforehand!!", "Interview Questions": "What is a difficult policy you wanted to change and how did you handle it?"}, {"date": "3 Aug 2017", "title": "Patient Care Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Emory Healthcare in Jun 2017", "Interview Descriptions": "Recieved a call on a late friday to come in on Monday for an interview and the in person interview was a group interview. I didn't like it but the questions were similar to what most have posted, such as why did you leave your job. How do you handle conflict. I never received a call or even a thanks but no thanks. I just wish companies would close out the loop for time we spend.", "Interview Questions": "Why Emory and Why this position"}, {"date": "20 May 2017", "title": "Phlebotomist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Emory Healthcare (Atlanta, GA) in May 2017", "Interview Descriptions": "Very easy going and relaxing. Great energy for the individuals interviewing me. Lots of laughs and great conversation. Asked me briefly about my past drawing experiences, how I'd work with certain patients, and what skills I specifically possessed that made me a viable candidate for the job.", "Interview Questions": "My previous drawing experiences,  and how I'd handle certain situations with patients and & course-workers. "}, {"date": "16 May 2017", "title": "Patient Access Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Emory Healthcare (Decatur, GA) in Apr 2017", "Interview Descriptions": "I applied online. The process took about 1 month and some days. I went through 3 interviews.  First a phone interview then face to face then lastly  a group interview. Read up on the history and include the facts in your answers. Smile and dress professional. It's not a hard interview I just get really nervous. The phone interview was short to the point she asked mostly \"describe a time when\" questions. The face to face interview was a little more intense. I was given more questions and had to describe my work history as well as myself. The group interview was easy they explained it wasn't a competition. After the interview I received an email for 4 references. They won't make an offer until the references are completed. My interview process was quick I had a phone interview on Tuesday, The next day Wednesday I had my one on one interview then Thursday I had my group.  Then I received the job offer that following Tuesday.", "Interview Questions": "Why do you want to work for Emory Healthcare?"}, {"date": "30 Mar 2017", "title": "Patient Services Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Emory Healthcare (Atlanta, GA)", "Interview Descriptions": "Had a phone screening interview out of nowhere which threw me off. Questions were rapid fire. After I had two group interviews. First group interview started really late. Interview questions were a repeated in final interview. I was called when offered to the position.", "Interview Questions": "Talk about a difficult customer service experience."}, {"date": "24 Mar 2017", "title": "CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at Emory Healthcare", "Interview Descriptions": "The campus held a job fair with antipation to staff the new hospital on Main Campus. I attended and did a one on one interview at which they would call you back if you were selected to move forward. I recieved an email within two weeks for a second department based interview at which time i attended. It was a group interview. They asked basice questions abouy experience, why emory, about past employers, situational based questions give me a tine when you........ Two weeks after the interview i was offered the position from hr.", "Interview Questions": "Give me a time you went above and beyond for a patient?"}, {"date": "18 May 2017", "title": "Patient Services Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Emory Healthcare (Atlanta, GA) in Apr 2017", "Interview Descriptions": "There were two in person interviews and they were both group interviews with four applicants at a time.  Before the in person interview some applicants who had phone interviews. You were given an extension in an email, and when you arrived at the location you had to call the interviewer to let her know you were there. They asked everyone the same questions and went down the line for answers. After the interview we were told we would receive an email that afternoon if they wanted us to come in for a second interview which was scheduled for two days later.", "Interview Questions": "Has there been a time where you had to implement a  policy that you didn't agree with  and how did you handle it?"}], [{"date": "25 Jul 2018", "title": "Medical Secretary Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2+ months. I interviewed at Emory Healthcare (New York, NY) in Apr 2017", "Interview Descriptions": "Interviewed three times for theposition, met with the office manager for the initial interview ,the clinical staff for the secondary and the chief physician for the third and final interview. \n\nNeedless I swore to myself three interviews I had the position, however i never received an offer.", "Interview Questions": "Tell me about yourself?"}, {"date": "15 Mar 2017", "title": "New Grad RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Emory Healthcare (Atlanta, GA) in Mar 2017", "Interview Descriptions": "I applied online for the New Grad RN position and received an email about a week later saying that I was picked for an interview, but they only interview on one day. So you need to make sure you select the department and hospital you want as soon as you get the email. The interviews lasted about 30 minutes each (you can interview for a max of two departments). I received a phone call with an offer about a week and a half after the interview.", "Interview Questions": "Behavioral questions: tell me about a situation where you could have prioritized your patients better, tell me about a time when you knew you made a difference whether in a clinical setting or volunteer or work experience, tell me why you want to work for Emory. "}, {"date": "18 Mar 2017", "title": "New Grad Registered Nurse Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Emory Healthcare (Atlanta, GA) in Mar 2017", "Interview Descriptions": "The staff were welcoming. There were over 500 applicants, so they were running behind on interviews. Department managers were the ones conducting the interviews. Wish I could have scheduled with more than one department.", "Interview Questions": "Why do you want to work for Emory Healthcare?"}, {"date": "20 Sept 2017", "title": "Nurse Practitioner Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Emory Healthcare (Atlanta, GA) in Mar 2017", "Interview Descriptions": "It was done collectively by the director and other staff members with scenario type questions. Each person had a list of questions numbered from one to 10 and they took turns asking questions and jotting down my responses.", "Interview Questions": "What are my best attributes"}, {"date": "23 Jan 2017", "title": "Recruiter Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Emory Healthcare", "Interview Descriptions": "Was contacted by the TA Manager via phone and then she actually reached out to me via text since it was after hours. Set up a phone interview and thought the interview went very well but she obviously thought otherwise because I never heard from her again after several attempts to get a decision. It is unacceptable to personally reach out to a candidate and set up an interview with them and then not even do a standard decline. Being a seasoned Recruiter myself, I know all of us have time to decline every single candidate that applies and interviews.", "Interview Questions": "Standard questions; why are you looking, what are you looking for, what we are looking for, etc."}, {"date": "17 Feb 2017", "title": "Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Emory Healthcare (Atlanta, GA) in Jan 2017", "Interview Descriptions": "was short and sweet just behavioral questions. I thought it would be harder especially since this is a healthcare environment but the people were really nice and down to earth.", "Interview Questions": "What are your strengths and weaknesses."}, {"date": "18 Dec 2016", "title": "Patient Access Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at Emory Healthcare (Atlanta, GA) in Dec 2016", "Interview Descriptions": "Phone, Face to Face, Panel/group interview the phone interview was pretty easy, the face to face was easy still waiting to do the group/ panel interview with the CEO. You have to be prepared mainly on behavioral Questions dress for success and have a can do attitude.", "Interview Questions": "Why do you want to work for Emory?"}, {"date": "14 Nov 2016", "title": "Nurse Residency Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Emory Healthcare (Atlanta, GA) in Nov 2016", "Interview Descriptions": "I applied online for the nurse residency program and received an invitation within 2 weeks. The interview process was held on a Saturday where all of the hiring managers at most of the units for all of the Atlanta Emory Hospitals held interviews all day for potential Nurse Residency Candidates. When you first arrive, you are ushered in to an auditorium/waiting area where one of the nurse managers speaks to you basically to kill the nerves/time while you wait to be called back for the actual interview. When called back, I was seated in front of 3 nurse unit managers for the Oncology floor and began the interview process. They were extremely warm and friendly and set you at ease to make you comfortable. They asked several questions regarding tough situations you may have faced, why you are a good candidate, previous work history, why nursing, why this floor, and asked about specific things from my resume. Once I was finished they gave me their card and asked for me to contact them about setting up a potential tour of the unit within the next week. Within a day I received an email with a preliminary offer from one of the managers saying he would have HR send an offer early next week and would like for me to come tour the unit soon. Overall a great process.", "Interview Questions": "Q: Why did you pick this unit?"}, {"date": "18 Oct 2016", "title": "Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. I interviewed at Emory Healthcare", "Interview Descriptions": "Overall, the interview process was in-depth and intense. Questions ranged from my experience to education. Most of the emphasis was placed on critical thinking and communication skills associated with high-performing healthcare consulting work. Questions were both behavioral and technical. There were a total of three interviews, with each lasting 60 minutes.", "Interview Questions": "N/A"}, {"date": "12 Oct 2016", "title": "Patient Access Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Emory Healthcare (Decatur, GA)", "Interview Descriptions": "The interview process was very easy going. I did a phone interview first, then a face to face. The final interview was a grouo interview with the VP. A week later I got my offer. They do send an email for 4 references and also a consent form for a background check.", "Interview Questions": "Name a time you solved a problem"}], [{"date": "31 Dec 2017", "title": "Nurse Resident Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Emory Healthcare (Atlanta, GA) in Oct 2016", "Interview Descriptions": "Panel interview with 3-5 unit directors, they asked typical interview questions, what area of nursing are you interested in ? Clinical scenarios and how you would respond etc. Interview day was very organized. When scheduling your interview you can select up to 3 areas to interview with.", "Interview Questions": "Tell us about a time you had to deal with a difficult patient or family member?"}, {"date": "21 Oct 2016", "title": "Patient Services Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Emory Healthcare (Atlanta, GA) in Oct 2016", "Interview Descriptions": "First: phone screen. Second: individual interview with two people, they ask similar questions to the phone screen be prepared to elaborate and possibly come up with better answers for those questions. Focus a lot on customer service. \"Name a difficult customer you had to deal with\" \"Where have you had the best customer service\" \"What would your supervisor say you need to work on\" \"Name a time you saw something unethical and what you did\". The second interview is the easiest part. Group interview but each have designated time to talk so you don't have to worry about out shining the others. There are always open positions as well so you are not each other's competition. Basically just reiterate the same things but also focus on \"Why Emory, why now?\" Focus on your experience and how it will contribute to Emory's mission and values. Ask your recruiter questions!!!! They will give you an offer without giving you any information at all and give you no time to decide.", "Interview Questions": "Why Emory?"}, {"date": "3 Sept 2016", "title": "Patient Access Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Emory Healthcare (Decatur, GA) in Sept 2016", "Interview Descriptions": "2 week 3 step interview process. I got a phone interview on Monday, a face to face interview today and I have an interview with the VP & Director next week. The young lady that interview me was very nice. It seems like the interview process  is well organized..", "Interview Questions": "How are you able to deal with an irrational patient on the phone and take another call immediately after without being irritated?"}, {"date": "7 Aug 2016", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Emory Healthcare in Aug 2016", "Interview Descriptions": "I applied for the position online and that same day I received a phone call about an interview. I scheduled an interview and received a detailed email with all the paperwork and instructions needed for the interview. When arrived I was walked over to my interview in a very friendly and organized manner.", "Interview Questions": "Tell me about yourself?"}, {"date": "16 Aug 2016", "title": "Patient Service Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Emory Healthcare (Atlanta, GA) in Aug 2016", "Interview Descriptions": "The interview process is not as hard as located the place.  Upon arrival you sign in and wait for someone to escort you uostairs.  The security guard is a bit over zealous, but for the most part everyone else is nice.  The interview process was brief and to the point.  I was asked a total of three questions.", "Interview Questions": "Can you tell me a bit about yourself and your work history"}, {"date": "19 Sept 2016", "title": "Laboratory Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Emory Healthcare (Atlanta, GA) in Aug 2016", "Interview Descriptions": "I applied online through Emory's website on 8/7/16 and was called for a call screen a week later, during that time I was told they would like to schedule a face to face interview and I scheduled it for the next day. I was interviewed by 2 people and was asked questions and given a chance to interview them as well. I went on a tour of the department and the lab manager was incredibly friendly and easy to talk to. I received an offer 8 days after my interview.", "Interview Questions": "I was asked basic questions on solving problems in the workplace, dealing with conflict, and long-term career goals"}, {"date": "29 Sept 2016", "title": "Patient Service Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Emory Healthcare (Atlanta, GA) in Aug 2016", "Interview Descriptions": "I applied online. The process took about 2 weeks. I was sent an email for a phone interview. However, I did not get a call. A few days later I was emailed again to schedule another phone interview. It was pretty intense. The interviewer asked me questions back to back. I had to really think on my feet. A day later I was asked to come in for a second interview. The second interview was a lot more relaxed. I interviewed with the lady who interviewed me during my phone interview and the talent aquistision manager. It was more informational than a regular interview. Two days later I got an email from the talent aquistision manager asking to come in for a final interview. I interviewed with two other candidates. This time we would be interviewing with the VP of operations. This interview was pretty intense. However, I was well prepared and I was myself. On that Friday, I got a phone call offering me the position.", "Interview Questions": "Tell me about yourself."}, {"date": "9 Sept 2016", "title": "Patient Access Representative Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Emory Healthcare (Atlanta, GA) in Aug 2016", "Interview Descriptions": "Applied over a month ago, got called on a Thursday for a interview on Wednesday and I live out of state. Got a bland email that gave me no information or direction on to how to get to hospital. Arrived 30 minutes before and had to wait a additional 30 minutes for my interview. Two black women preformed the interview one who was dressed very unprofessional (she had on flip flops). The interview question weren't hard at all. Received a call for a phone interview on a Sunday and guy told me him and the other two women were defiantly interested and I would receive a call from HR. HR called me days later telling me I was over qualified for the position, don't know how when it the exactly same thing I do at my current job lol. Just think they didn't want to top my current salary from what I've read they like to give their employees little to nothing.", "Interview Questions": "Name a time when you had to deal with a technical issues."}, {"date": "19 Aug 2016", "title": "Patient Services Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Emory Healthcare (Atlanta, GA) in Aug 2016", "Interview Descriptions": "I received an email from Emory stating they wanted to do an over the phone interview, once I completed the phone interview I was invited to come in to interview with another person, the questions asked at the in person interview were the same as the ones asked over the phone. They asked questions like \"name a time...\" so I just elaborated on the answers I had given to them over the phone. I did my interview August 3rd and still have not heard anything regarding whether or not I received the position.", "Interview Questions": "Name a time you had to tell someone no."}, {"date": "25 Jul 2016", "title": "Medical Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Emory Healthcare in Jul 2016", "Interview Descriptions": "I have had only had one interview so far. It was very positive. Manager was easy to talk to. She explained to me the expectations of the job and of Emory Healthcare.", "Interview Questions": "If you were given a tool box. What tool will you compare yourself to?"}], [{"date": "9 Sept 2016", "title": "PSC I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Emory Healthcare (Atlanta, GA) in Jul 2016", "Interview Descriptions": "interviewing was easy. one phone screen interview asked basic questions. face to face with dept mgr 30 mins. last round of interview was a panel interview of three same questions from face to face interview.", "Interview Questions": "N/A"}, {"date": "21 Aug 2016", "title": "Patient Service Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Emory Healthcare (Atlanta, GA) in Jul 2016", "Interview Descriptions": "Their initial interview process is fairly quick. I had a phone screening on Thursday. The person then sent me an email the next day stating that she would like to interview with me face to face. The next Friday I interviewed with two individuals. and the interview was very relaxed, but informative. Then I received an email the next day after that and was informed that I would have my final interview with  the vice president of operations and two other executive members. I then was informed that their will be two other applicants interviewing with me as well. I completed the group interview on Thursday. I then was called on Monday being offered the position.", "Interview Questions": "why do you feel you would contribute to this position/organization?"}, {"date": "25 Jun 2018", "title": "Clinical Research Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Emory Healthcare in Jul 2016", "Interview Descriptions": "I met with the director of clinical trials for the department for a one-on-one interview, then met with the rest of the research team. The next day I was asked to come back to interview with one of the doctors in the department, one-on-one.", "Interview Questions": "Have you ever consented patients before?"}, {"date": "16 Jun 2016", "title": "Patient Access Associate Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Emory Healthcare (Decatur, GA)", "Interview Descriptions": "Takes forever to get an interview. You are screened by phone before you are offered a face to face. You interview twice for the position. The last interview is a group one.", "Interview Questions": "N/A"}, {"date": "21 Jun 2016", "title": "Pharmacy Technician II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Emory Healthcare", "Interview Descriptions": "Four Pharmacist, ask about background. Be sure to go over the STAR system behavioral questions. The staff is older and they are nice. Be sure to smile and show that you are a team player.", "Interview Questions": "How do you deal with conflict"}, {"date": "6 Aug 2017", "title": "Pct Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Emory Healthcare (Atlanta, GA) in Jun 2016", "Interview Descriptions": "The interview process was business casual. They wanted to know where i have been and where i saw myself in the future. They asked few personal questions. Wanted to get an idea of how i dealt with difficult situations", "Interview Questions": "What are my educational plans"}, {"date": "21 Jul 2016", "title": "Healthcare Provider Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Emory Healthcare in Jun 2016", "Interview Descriptions": "situation based interview, two people, very nice. Lasted about 45 minutes to 1 hour. They ask about 4 or 5 situation type questions. They also asked about resume and work history, and seem to prefer experience in the hiring process.", "Interview Questions": "How did you handle a rude coworker?"}, {"date": "27 Dec 2016", "title": "Cardiac Monitor Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Emory Healthcare (Atlanta, GA) in Jun 2016", "Interview Descriptions": "Met with Director and Charge nurse for a pretty laid back interview.  Basically asked questions about resume, plus some standard interview questions. Experience was a good one. Only took about 30 minutes and then was given a tour of environment and was introduced to staff.", "Interview Questions": "When did you offer great patient care/customer service?"}, {"date": "14 Jul 2016", "title": "Patient Access Associate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Emory Healthcare (Atlanta, GA) in May 2016", "Interview Descriptions": "1. Phone screening easy questions- tell you what the position is like and the training process\r\n2. In person interview one on one- Describe your self- why emory etc talk about your resume\r\n3 Group interview in admin office for 30 minutes, two head executives went around and as several questions", "Interview Questions": "Why do you want to work at emory?"}, {"date": "15 Dec 2018", "title": "Patient Access Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Emory Healthcare (Atlanta, GA) in May 2016", "Interview Descriptions": "You have three different interviews. Phone, one on one and then a group interview. The phone interview was to inform you of what the job is and determine if you are a good fit with a few  basic questions. The one on one was brief and more questions asked geared around customer care. The group panel showed how we worked as a team and gave the interviewers a to get to know your personality", "Interview Questions": "What does customer service mean to you"}], [{"date": "5 Jun 2016", "title": "Patient Access Associate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Emory Healthcare (Atlanta, GA) in May 2016", "Interview Descriptions": "I applied online but had an employee referral so I got an email two days later saying it was forwarded to hiring manager for further review. I then got a phone call on Friday but missed the call since I was at work. A voicemail was left and a number attached saying to return the call to set up phone screening. After repeated attempts to call back almost 20 minutes after the initial call I never got an answer. My friend told me to be patient but almost a week went by. I called several more times and left voice mails so finally my friend went over to the lady and asked her what was up and she said I didn't answer the phone so she figured i had moved on? How am i suppose to schedule my life for an out of the blue phone call if she had paid close attention to my resume it showed that i was currently working two jobs and still technically enrolled in college so the likelihood of me not doing something is slim. Finally after 2 weeks from the initial call she called me back and asked a bunch of Why do you want to work here and what would you offer questions; it lasted maybe 7 minutes and then i was set up for an in person interview. I got there and it was very informal and I easily was passed along to the third interview which is a group interview. I feel like I had the most non rehearsed answers, one girl answered with the companies values and mission and almost sounded as if she was reading from a script and the rest of them said um after every word. I was sure I got the job but i got the generic email two days later telling me how competitive the process was. I have applied for other positions at Emory with the same qualifications such as patient services coordinator and somehow can't seem to get another interview. I will go out on a limb and say Emory is sexist and only hires women for the patient access department. I am glad I didn't get the job at this point and will never work for this organization.", "Interview Questions": "Tell us about a time you provided customer service?"}, {"date": "1 Jun 2017", "title": "Biomed Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Emory Healthcare (Atlanta, GA) in May 2016", "Interview Descriptions": "The process was very typical. I met with the hiring manager, who had typical interview questions. I then met with the current team to learn about the day to day operation", "Interview Questions": "Have you been around patients with end of life illnesses"}, {"date": "30 Jun 2016", "title": "Case Management Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Emory Healthcare (Atlanta, GA) in Apr 2016", "Interview Descriptions": "It was fairly easy.  What has helped is that I came through Emory Temp. Services ( ETS).  The Staff at Emory ETS is a nice group of people.  You have to go on line and post your resume, they conduct a criminal background, Drug testing, you have to submit to having vaccination e.g., flu, TB, and they also submit it you an assessment test", "Interview Questions": "Basic questions . . . How soon are you willing to work?"}, {"date": "5 Apr 2016", "title": "Receptionist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Emory Healthcare (Atlanta, GA) in Mar 2016", "Interview Descriptions": "I interviewed with five people. The interview was about an hour and a half long and I had to interview with the heads of each department. I was called back about two days later with an offer of employment. I was really nervous at first , but everyone was very welcoming,", "Interview Questions": "Give me five words that you would use to describe yourself?"}, {"date": "28 Feb 2018", "title": "Patient Access Associate Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Emory Healthcare (Atlanta, GA) in Mar 2016", "Interview Descriptions": "The interview was very long and took many steps. I first had an initial phone screening, then I met with two members of the team. This was followed by a panel interview by the CEO and other members of the leadership team.", "Interview Questions": "How do you manage your stress?"}, {"date": "20 Jan 2016", "title": "Patient Service Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at Emory Healthcare", "Interview Descriptions": "The 1st interview is conducted with the talents acquisition manager. If you are able to pass that interview you will have a final interview conducted with 4 different people. They told me it would be with the COO of Emorty Heathcare, but he was not present at the interview. They also interviewed me side by side with another candidate.", "Interview Questions": "Tell me about a situation in which you handled an unruly or tough customer and how you addressed it."}, {"date": "4 Mar 2016", "title": "Patient Access Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Emory Healthcare (Decatur, GA) in Feb 2016", "Interview Descriptions": "I had a phone interview A week after I filled out the application. After my phone interview I got another phone call about 3 days later for an in person interview. The atmosphere of the office was really nice, she only asked about 2-3 questions and told me she was moving me to the last interview. We set up the next interview right then and there. My last interview was about 2 days later. Two people interviewed us(group interview). The next day I got a call from Emory extending an invite for the position.", "Interview Questions": "Tell me about a time you dealt with a difficult customer"}, {"date": "23 Mar 2016", "title": "Patient Service Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 3 months. I interviewed at Emory Healthcare (Atlanta, GA) in Feb 2016", "Interview Descriptions": "I went through two interviews over a two month period. It was a disappointing process. They told me I was \"overqualified\"- yet failed to contact me until months later. Did not respond to ANY emails/questions. The CEO was texting the entire time during the group interview. Not worth it unless you want a desk job at the bottom of the tier.", "Interview Questions": "How did you handle a difficult customer or situation? \r\nTell me about yourself...\r\nThey kept asking the same questions but worded them differently."}, {"date": "5 Oct 2016", "title": "Certified Pharmacy Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Emory Healthcare (Atlanta, GA) in Feb 2016", "Interview Descriptions": "Interview process went very well. It was not a standard ask you a bunch of nonsense questions. Felt more like a conversation. The director is extremely nice and doesn't come off scary or intimidating. Was hired the next day.", "Interview Questions": "I was asked my 5 year plan."}, {"date": "11 Apr 2016", "title": "Patient Service Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Emory Healthcare (Atlanta, GA) in Jan 2016", "Interview Descriptions": "Easy but there was a panel of 3 who asked a series of questions. Ideal interview, come prepared and you will be fine! Always look your best and be confident as well!", "Interview Questions": "What is your biggest weakness."}], [{"date": "14 Jun 2017", "title": "Nurse Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Emory Healthcare (Atlanta, GA) in Jan 2016", "Interview Descriptions": "It was a behavioral interview.  All answers had to be specific situations from past experiences. The hiring process took a few months from start to finish.  The recruiter and the manager didn't seem to always know what the other one was doing.", "Interview Questions": "N/A"}, {"date": "6 Jan 2016", "title": "Front Desk Coordinator Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at Emory Healthcare (Emory University Post Office, GA) in Dec 2015", "Interview Descriptions": "2 interviews. First one was informal and very easy. Relaxed and it's just and initial screening. Both people were very nice HR managers. Second was a panel with the COO. Kind of nervous going in, but they made it extremely friendly and easy if you're prepared.", "Interview Questions": "What is an example of customer experience that you have experienced?"}, {"date": "20 Dec 2017", "title": "Patient Services Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at Emory Healthcare (Atlanta, GA) in Dec 2015", "Interview Descriptions": "Multiple interviews. The first is a phone screen. Than an in-person interview with multiple people from HR. Then again in a group setting with an exec. Lastly you're interviewed again for a specific location.", "Interview Questions": "How were you able to manage an irate customer?"}, {"date": "26 Oct 2015", "title": "Patient Access Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Emory Healthcare (Atlanta, GA) in Oct 2015", "Interview Descriptions": "Haven't finished it yet. Currently will go to my last interview next Friday! Passed my phone interview and second interview process. Very easy customer service questions. Won't know until after my last interview for an offer", "Interview Questions": "Name a time where you led change at work? Was it successful? What will you do if you have to cancel an appointment?"}, {"date": "3 Sept 2015", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Emory Healthcare", "Interview Descriptions": "Met with recruiter and then hiring manager and was given tour of the floor and met other staff members and also was given instructions about training and orientation process. lots of detail", "Interview Questions": "Tell me about yourself"}, {"date": "23 Aug 2015", "title": "Business Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Emory Healthcare", "Interview Descriptions": "Was detailed. Environment was comfortable a 3 person panel. With situational questions. There were 3 managers equal opportunity. Emory was a great place at one time. Management styles have changed advancement is low", "Interview Questions": "Why do I want to work for Emory"}, {"date": "26 Aug 2015", "title": "Patient Service Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Emory Healthcare (Atlanta, GA) in Aug 2015", "Interview Descriptions": "First I received a call out of the blue and then she asked if I could interview face to face with three others including herself. Two of the interviewers were great but there was one who didn't seem like she wanted to be there. Do not ask \"Do you have any reservations about my candidacy\" because after they seemed pretty bothered by the question. It was kind of intimidating that other applicants were waiting in line there as well and they were all a lot older than me. Just do your research and don't let them scare you.", "Interview Questions": "Why do you want to work at Emory? What can you comtribute you the Emory community?"}, {"date": "2 Aug 2015", "title": "Patient Service Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 6 weeks. I interviewed at Emory Healthcare", "Interview Descriptions": "The process is quite long. Phone screening, meet and greet, final interview with executive members. All at different locations. The interviewers are nice and not too intimidating. They tell you what to be prepared to speak about.", "Interview Questions": "Basic interview questions. Do your research and be prepared and you'll be okay"}, {"date": "22 Oct 2018", "title": "Management Development Program Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 3 weeks. I interviewed at Emory Healthcare (Atlanta, GA) in Aug 2015", "Interview Descriptions": "There was first a phone interview.  Then, if you progress, there are several rounds of in-person interviews.  Your people skills are tested most of all.  You should come armed with a compelling story and the personality that they are looking for.", "Interview Questions": "Why Emory?; Why healthcare?; Long term career goals?"}, {"date": "12 Sept 2015", "title": "Patient Account Representative Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Emory Healthcare (Atlanta, GA) in Aug 2015", "Interview Descriptions": "I had a phone interview then in person the following week there were three people interviewing me and it was laid back but one lady seemed kind of serious the website status says I'm still being considered but I haven't heard anything", "Interview Questions": "Describe a time when u had to be analytical"}], [{"date": "31 May 2018", "title": "Patient Services Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Emory Healthcare (Atlanta, GA) in Jul 2015", "Interview Descriptions": "The hiring process seemed a little long. First I had an interview on the phone, I later had a one-one one interview, and then a group interview. The interviews were all located at different locations, which was a little stressful.", "Interview Questions": "What are your strengths and weaknesses"}, {"date": "11 Jun 2015", "title": "Patient Access Associate (Call Center) Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Emory Healthcare (Atlanta, GA) in Jun 2015", "Interview Descriptions": "Don't even waste your time! Emory Clinic has the worst interview process that I have ever seen and experienced. This healthcare organization leaves you completely in the dark about whether or not you will receive a job offer once you've interviewed with them. If you are seeking \"anxiety\" then this would be the right hospital you'd fit perfectly in with. \r\n\r\nYou can give it your best shot at the interview with the President and COO, have the perfect background and meet all of the qualifications to perform the job, and still not get a job offer. This organization is mostly seeking people already in a management position. \r\n\r\nI can see why anyone wouldn't want to merge with this hospital. It all starts with leadership. The President and COO does not exhibit the type of characteristics from people being in charge. They do not look or appear to be confident in who they are. How can they expect the same from the rest of the team or from people interviewing for a job?\r\n\r\nOn top of that, the talent acquisition associates (HR Department) definitely does not fit the job description of people that are actually qualified to work in the office and select/choose the right candidates for Emory, because they are not the right candidates themselves. Emory Healthcare (Clinic) will have you interviewing over and over again for the same positions in which you already have before, just because they have different assigned requisition numbers with the same job title, as this has happened to me numerous of times before. On top of that the pay($13/hr - $14.51/hr) is very disappointing for people with a college degree education. I am definitely not applying with this company again! It's just not worth all of the hassle they put you through.", "Interview Questions": "Why do you want to work for Emory? Why now? "}, {"date": "12 Jul 2015", "title": "Patient Access Associate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Emory Healthcare (Decatur, GA) in Jun 2015", "Interview Descriptions": "Applied online, got a call from a recruiter in about 4 weeks, scheduled an interview, came in for the interview and by the way...it was very difficult to find and no visual sign (parking is crazy) which almost makes you not want to accept the job because of parking. Interview went well..but as a previous interviewee stated THIS IS A WASTE OF TIME. They toy with candidates' emotions! Yes, toy with like kids. They gather all these fantastic potential employees, interview with them, hire one to none. It's just an experience to them. It's a shame that such a \"reputable\" company has such \"unreputable practices. This is a very young people type environment so maybe they don't know any better. Kids only hire who they know. Professional people GO ELSEWHERE where appreciated and you have a fair chance of actually getting hired!!!", "Interview Questions": "Why do you want to work for Emory?\r\nName a time when...\r\nMostly behavior questions."}, {"date": "24 Oct 2015", "title": "Patient Access Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Emory Healthcare (Atlanta, GA) in Jun 2015", "Interview Descriptions": "Three part interview, phone interview, meeting with Director of Patient Access, then meeting with Assistant director and CEO of Emory Clinic. They asked standard customer service based questions. If you make it to the second interview you will have to complete a typing test. The third interview is a group interview with 2-3 interviewers and 3-4 applicants.", "Interview Questions": "Tell me about a time where you went above and beyond your job role."}, {"date": "11 Mar 2017", "title": "Certified Pharmacy Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Emory Healthcare (Atlanta, GA) in Jun 2015", "Interview Descriptions": "Very general questions were asked during the interview process.  The interview was very relaxed and causal.  I went in after I submitted and application online and asked about interview.", "Interview Questions": "What are your strengths?"}, {"date": "4 Sept 2016", "title": "Nurse Clinician (RN) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Emory Healthcare (Atlanta, GA) in Jun 2015", "Interview Descriptions": "I applied online several days later I received a call from the recruitment office. They setup and interview and I can in the next day. Interviewed with 3 of the 5 floor managers for the hospital. I do want to say that there was confusion about the job I applied for. I applied for a specific floor but the recruiter had printed and stated a different unit. I brought this up but nothing was said. Anyways you interview with all the managers and who ever likes you or has a spot for you will over you a spot and you get to pick.", "Interview Questions": "Tell us about a time when you had a patient that had an unexpected outcome. How did you handle this? "}, {"date": "21 May 2015", "title": "Patient Access Associate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at Emory Healthcare (Decatur, AL) in May 2015", "Interview Descriptions": "I applied and got a phone interview the next day. Two days later I was called back to come in for a one on one interview the following Tuesday. It was difficult to find and I got there on time only because someone pointed me in the right direction after 20 minutes of looking! The woman interviewing me was very cold even after telling me how qualified I was! She never smiled and only asked me 3 questions completely unrelated to the job I was applying for. I knew I wouldn't get a call back when she said I should apply to other jobs in other healthcare places because I had more than enough experience. Everyone was nice but if I had to work under her I wouldn't do it. I never even got a call back saying if I was. Going on to the next phase. After a week and a half I knew my fate.", "Interview Questions": "How is the weather outside today? Do you have any questions for me?"}, {"date": "11 May 2016", "title": "Patient Care Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Emory Healthcare (Atlanta, GA) in May 2015", "Interview Descriptions": "The phone interview then in person interview. The pphone interview was preliminary basic situational type questions. Then I flew to Atlanta for an interview with the manager and a surgeon, I also had a separate interview the same day with a Physician Assistant. They asked pretty standard questions nothing that threw me off, more workplace situation type questions and questions about myself/qualities.", "Interview Questions": "Tell about a time you made a mistake and how did you handle it?"}, {"date": "8 Jun 2015", "title": "Patient Account Representative Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Emory Healthcare (Atlanta, GA) in May 2015", "Interview Descriptions": "i had to first do the application, then i had to take an assessment, i then had to do a in person first interview, i next did a personality assessment and skills assessment, the then had me to do adrug test and a second interview it was a scary but enlightening process", "Interview Questions": "what are my future career goals"}, {"date": "1 Jul 2015", "title": "Director Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 4 weeks. I interviewed at Emory Healthcare (Atlanta, GA) in May 2015", "Interview Descriptions": "lengthy process requiring multiple levels from the staff level to the senior leadership level. Pleasant and polite workers. Tight community, and team work was exhibited. Clean environment. New area, and people were friendly.", "Interview Questions": "skills, work history"}], [{"date": "16 Apr 2015", "title": "Patient Access Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Emory Healthcare (Atlanta, GA) in Apr 2015", "Interview Descriptions": "It was straight forward. Brief phone interview, in person with manager, skill test, then group interview with COO offer same day. They were very professional and nice. I actually missed my first interview and they called me back a week later to interview again. Easy questions about your experience and goals.", "Interview Questions": "Describe good customer service and 4 things you liked about it?\r\nName a time you made a process easier for your employer?\r\nDescribe yourself in 5 words?"}, {"date": "14 Mar 2018", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Emory Healthcare (Decatur, GA) in Apr 2015", "Interview Descriptions": "recruiter was very friendly and nice. Asked easy and simple questions that were easy to answer. Process only took 30 minutes, so not long at all.  offer was given to me after the interview and i accepted the offer. More information was provided to me later on via email.", "Interview Questions": "do you know anyone with cancer?"}, {"date": "17 Mar 2015", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 5 days. I interviewed at Emory Healthcare (Atlanta, GA) in Mar 2015", "Interview Descriptions": "The interview was the traditional interview with basic questions about your strengths and weaknesses.  The manager was extremely informative and took the time to share information about the company, unit and growth within the company.", "Interview Questions": "What makes you best suited for this position?"}, {"date": "17 Mar 2015", "title": "Nurse Tech Agency Float Pool Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Emory Healthcare (Atlanta, GA)", "Interview Descriptions": "The interview was with enterprise float pool through Emory. It was a mass hiring because they had just started the agency float pool. The interview was pretty easy they go through a couple questions asking about a time when, and what would you do kind of situational  questions. At first I hated this hospital because it was not as good as put say it is, but its starting to grow on me now that .I am starting to use the resources that the place offer.", "Interview Questions": "When was a time you had a difficult patient? how did you handle it ?"}, {"date": "16 Apr 2015", "title": "Patient Access Associate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Emory Healthcare (Decatur, GA) in Feb 2015", "Interview Descriptions": "The interview was 45 minutes and the questions were basic. It was a group interview and could be a bit difficult because you don't want to have the same response to the same question. We were told by recruiters that there were plenty of spots available so there was no competition. At the end of the day the position was never filled.", "Interview Questions": "What would be a class you would take over?"}, {"date": "11 Dec 2014", "title": "Patient Service Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Emory Healthcare (Decatur, GA)", "Interview Descriptions": "So I applied online and I received a phone call within two weeks.  They scheduled an interview. First off, I was not impressed with professionalism that was exhibited! Upon arrival, I proceeded to park in the parking garage where I was told to park once I arrived(the area was hard to find).  10 minutes later I found it only for the parking attendant to tell me that the parking garage was full.  I then went to another parking garage.\r\n\r\nFinally, seated in what I thought was the interview room I waited along with another young lady.  We waited in the conference room for 25 minutes(were looking at one another thinking what it really going on.  Finally, Caucasian recruiter comes down and gets us and apologizes for the parking issue.  Greeted by another recruiter African American, I sat down and the questioning begin.", "Interview Questions": "The questions weren't really hard but it was more so a meet and greet type thing. They asked general questions and really just wanted to get a fill for who you are. I will say the Caucasian gentlemen was very pleasant while the African American lady was very straightforward and not so nice; she came off kind of snobby.  During my interview, she says oh did I cover everything I'm not sure I've interviewed about 20 people. I thought that was not cool being that I was already nervous."}, {"date": "30 Nov 2017", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Emory Healthcare (Decatur, GA) in Dec 2014", "Interview Descriptions": "Director, clinical coordinator, and 2 charge nurses asked about 6 questions. Let me ask questions and took me on a tour of the unit. I was told immediately I would be offered a job and received an official offer via email from HR the same day.", "Interview Questions": "Describe a time where you had a conflict with a co-worker and how to resolved it."}, {"date": "18 Oct 2015", "title": "Medical Secretary Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Emory Healthcare (Atlanta, GA) in Dec 2014", "Interview Descriptions": "Manager called on weekend, and said hundreds of resumes had been sent for this position. I applied and got a response for medical secretary a month later.  Interview was pretty informal and laid back. It included the Clinical manager and Director. It was in office.", "Interview Questions": "How did I provide great Customer Service?"}, {"date": "15 Nov 2014", "title": "Patient Service Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 3 days. I interviewed at Emory Healthcare (Atlanta, GA)", "Interview Descriptions": "When I was hired it was under St. Joseph's Hospital of Atlanta.  Then I was interviewed by the Scheduling Supervisor,  I became the scheduling lead then interim Patient Acces Lead and finally the PAS Manager.  I was interviewed originally over the phone then in person.  Because of my experience I was hired right away.  The level of training was one on one with the supervisor, very thorough.", "Interview Questions": "What is your biggest pet peeve?"}], [{"date": "2 Apr 2015", "title": "Patient Account Representative Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Emory Healthcare (Decatur, GA) in Nov 2014", "Interview Descriptions": "It is supposed to be set up as stressful but once you get the job you sadly realize that it was all a sham. You meet w/the CEO of The Emory Clinic and at least 2 other supervisors who don't look very believable in their supervisory ability.", "Interview Questions": "Name one of the skills that you possess that'll help you in your role as a PAA?"}, {"date": "15 Sept 2014", "title": "Intern Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Emory Healthcare", "Interview Descriptions": "Cover Letter and Resume: Round 1\r\nPick top 3 project choices and write an essay on why you want those project choices: Round 2\r\nInterview across the board with different section administrators: Round 3\r\nGet an offer: Round 4", "Interview Questions": "If you had to work with another intern how would you manage them?"}, {"date": "17 Sept 2014", "title": "Nurse Practitioner Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Emory Healthcare in Aug 2014", "Interview Descriptions": "Relaxed environment. Behavioral questions were asked.  Questions not too difficult if you prepare. How did you handle a team member who was not performing well?  Discuss a difficult situation and how did you handle it?", "Interview Questions": "Have you ever went along with a policy even though you didn't agree with it?"}, {"date": "14 Aug 2014", "title": "Pharmacy Technician II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Emory Healthcare (Atlanta, GA) in Aug 2014", "Interview Descriptions": "I applied online and I received an email a week later saying that I was being considered for the position. A week later I was contact to schedule an interview. The interview consisted of two supervisors for the department. They read from a scripted paper and showed me around the lab and introduced me to some of the people I could possibly be working with. A few days after the interview I received an email saying that my information had been sent to the recruitment office and I was sent some \"pre-employment\" information. Two days later I was offered the job and sent more information about pre-employment requirements.", "Interview Questions": "The questions were very simple things about how you behave and handle certain situations. How do you handle things that are out of your control? Have you ever been a part of a team where someone isn't holding their own weight? Describe a time when you acted quickly? Describe a difficult situation and how you handled it? "}, {"date": "31 Aug 2014", "title": "Business Manager Interview", "results": "No Offer", "experience": "N/A", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Emory Healthcare (Atlanta, GA) in Aug 2014", "Interview Descriptions": "I applied online in June. There was a phone interview in July.  I was asked to come in for panel interview in August. There were the director, associate director, Sr Manager. They were looking for someone with a unique background.", "Interview Questions": "What is your definition of management and your definition of leadership?"}, {"date": "1 Aug 2014", "title": "Patient Service Coordinator Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Emory Healthcare in Jul 2014", "Interview Descriptions": "This process began with a job fair that felt much like a cattle call. I had an initial interview that day (Thurs) which lasted about 30 min. The man who interviewed me was very pleasant and thorough in his questions. They stated I would hear back the following Tuesday- I did not hear back until Wed or Thurs and it was nerve-wracking! Thankfully they extended a 2nd interview to me and it was for the final group interview with the President. I will say, the group interview made me anxious because I had never done that before. There were 4 other interviewees who joined me in the process. There were 3 recruiters and the President who asked us a variety of questions. The challenging aspect of doing a group interview was with reference to answering the questions: For ex, a recruiter would ask a question and pick a random person to answer. They then may go clockwise, counter clockwise or switch up the order of who answered next. That means you have to be on your toes with answers and also be prepared with other answers in the event your answer was given by another interviewee. It was intimidating to say the least!  \r\n\r\nI worked with two different recruiters. The male recruiter who followed up with me after the 2nd interview was professional and informative. Unfortunately, I was not as impressed with the other female recruiter who extended the offer letter and set up my original interview. She was curt, unhelpful, and borderline rude. She gave me a moment to pause when it came to accepting this position because she made me feel so unwelcome and uncomfortable. I found her attitude super unfortunate, especially for the role she is in as a recruiter where I would expect someone to be more customer service friendly and warm. Aside from her, everyone else I dealt with was lovely, professional, well spoken and kind!", "Interview Questions": "What is one undergrad class you would take again if you could? How would you summarize your resume in one line? Describe a quality/characteristic that a parent imparts to you that is the most important and how it relates to this role? "}, {"date": "17 Jul 2014", "title": "ER Patient Access Representative - Midtown Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Emory Healthcare (Atlanta, GA) in Jun 2014", "Interview Descriptions": "The hiring process was pretty easy. I applied online same day the job was posted and received a call from a recruiter the same day(Monday 6/23) inviting me to a interview for that Wednesday(6/25) I interviewed at midtown with the Admissions manager. She made me feel very comfortable, felt as if we already knew each other. The questions asked were behavioral questions and see how well I worked with a team. The interview only lasted about 30 mins. I was told that I would hear something by that Friday, if not call the following Monday to check my status with HR. I didn't  receive a call that Friday or Monday. Ugh! So I emailed Hr to check status she told me she hadn't receive any information about the interviews that were held and when she did she would follow up. About 2 weeks later (7/8/14)I received a call from her offering me the job. I then had to schedule a date for my hire health assessment which I took Tuesday 7/15. Now I am officially an Emory employee. My start date is 7/28.", "Interview Questions": "If your co worker had a problem with you, how would you address it? "}, {"date": "26 Sept 2016", "title": "Service Performance Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Emory Healthcare in May 2014", "Interview Descriptions": "Several interviews including phone screening, panel interviews with leadership and current team members. Emory usually takes a long time to fill a position unless an urgent need. Not the best communicators during the recruiting process. Emory is academic and can be sterile, but also feed on personality. Leadership needs to see professionalism and intelligence, team needs to know you'll be a good fit.", "Interview Questions": "How would you influence culture shift toward more patient-centric care. "}, {"date": "9 Mar 2014", "title": "Pct Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Emory Healthcare (Atlanta, GA)", "Interview Descriptions": "Called me", "Interview Questions": "Questions for them "}, {"date": "2 Apr 2015", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied through a recruiter. The process took 6 days. I interviewed at Emory Healthcare (Atlanta, GA) in Mar 2014", "Interview Descriptions": "It was behavioral interview process.  It was difficult.  I met with the manager, director, and even the medical director.  I met with the doctor I'd be working with.  I had a good indication of what the job would be like", "Interview Questions": "Name one time you made a huge mistake, and how did you handle that situation?"}], [{"date": "4 May 2016", "title": "Intern - Hourly Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Emory Healthcare in Mar 2014", "Interview Descriptions": "I had two rounds of interviews after the initial resume and application. Internships are super competitive so if you make it to the phone or Skype interview rounds, you're one of their top choices. The initial phone screen was with an Administrative Fellow, the second with the preceptor.", "Interview Questions": "General interview questions: Why Emory? What makes you a good candidate? What are you future career goals? What do you expect to gain from this internship experience?\r\n\r\nJust be knowledgeable about the organization ahead of time, have a strong resume/cover letter, and be able to recall why you initially applied for that position."}, {"date": "27 Aug 2015", "title": "Patient Service Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Emory Healthcare (Atlanta, GA) in Jan 2014", "Interview Descriptions": "First interview was with two Human Resources personnel. Second interview was a group interview with President of Emory Clinic, Donald Brunn and one other upper management employee. Received an offer a month later after agreeing to salary.", "Interview Questions": "Why do you want to work for Emory?"}, {"date": "1 Oct 2018", "title": "Pharmacy Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at Emory Healthcare (Atlanta, GA) in Jan 2014", "Interview Descriptions": "Called for a phone interview. Just asked general questions like \"what are you looking for,\" and \"what shifts can you work?\" Then came in for an interview with 2 managers.  Pretty standard interview process. They used the \"STAR\" method.", "Interview Questions": "Describe a time when you had to deal with a difficult coworker."}, {"date": "22 Oct 2013", "title": "Patient Service Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Emory Healthcare", "Interview Descriptions": "Crazy&Long......Started with a job fair on a Saturday. Depending on how well you did it was three different interviews  If you did well they said they would call. It took about a week for them to call back, then I had to come in for a group interview with about four others. Sat with the President and another administration for about an hour, that felt like three", "Interview Questions": "Super hard only because you have the answers and back up answers, but when you don't get asked first and others say what you have planned or something similar you really have to think really hard and breathe...\r\n\r\nWho has influenced you the most?\r\nWho do you think is influential?\r\nHow do  handle stress?\r\nHow do make each persons experience unique?\r\nIf you could go back to your last job what would you do differently?\r\nWhat is considered a good day?\r\nWhat are some strengths and weakness?\r\nHow would you describe yourself?\r\n\r\nAnd countless others!!!!!!!!"}, {"date": "29 Oct 2013", "title": "Clinic Operations Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Emory Healthcare", "Interview Descriptions": "I was asked to interview with the administrator, director, and executive director. In addition, I met with the supervisors and a few staff members. The interview was a behavior based interview which required the candidate to regurgitate the same story roughly 9 times because everyone chose the same question to ask.", "Interview Questions": "The questions were all behavior based so be prepared with specific stories regarding team work, tough decisions, and working with patients."}, {"date": "31 Oct 2016", "title": "Coordinator Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 1 day. I interviewed at Emory Healthcare (Atlanta, GA) in Oct 2013", "Interview Descriptions": "pleasant and they ask a lot of scenario questions. The interview is very cold and not very personable. They do give you a tour of the practice and are nice to the interviewee.", "Interview Questions": "education background and experience."}, {"date": "25 Apr 2016", "title": "Call Center Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Emory Healthcare (Atlanta, GA) in Sept 2013", "Interview Descriptions": "Met with the coordinator of the department.  Asked me to summarize my job history. Asked me a series of questions and answered the questions I asked.  Told me what my job description was and what would be expected of me when I started.  Very laid back and non-stressful process.  Make sure you are confident and try to be casual but not too friendly.", "Interview Questions": "Why do you want to work doe this company?\r\nWhat are your best characteristics?\r\nWhy would you hire yourself?\r\nhow would you react in center situations with a patient?"}, {"date": "10 Sept 2017", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. I interviewed at Emory Healthcare (Atlanta, GA) in Mar 2013", "Interview Descriptions": "The interview is a behavioral interview. So it's \"Tell me a time when...\" On my unit it's a panel of volunteer staff nurses, a couple of nurse managers and then the unit director.", "Interview Questions": "Tell me a mistake you've made and what steps you took to resolve it; and what was the outcome? "}, {"date": "8 Aug 2013", "title": "Nurse Practitioner Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 3 months. I interviewed at Emory Healthcare in Jan 2013", "Interview Descriptions": "Credentialing was a long, disjointed process taking over 2 months.", "Interview Questions": "Most questions were behavioral questions.  They would start with \" Tell me about a time when...and then give you a situation."}, {"date": "8 Jan 2016", "title": "Technical Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at Emory Healthcare (Atlanta, GA) in Oct 2012", "Interview Descriptions": "There were multiple levels of interviews in the process (HR, Boss, CoWorkers over a couple months), a little time consuming but seemed effective. Phone first then on site with staff on two different occasions. HR interview also Employee health was also on the list of places to go for drug testing. Started quickly after interview was over and offer extended.", "Interview Questions": "How do you deal with conflict with in your team?"}], [{"date": "8 Jan 2016", "title": "Pharmacy Technician Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 months. I interviewed at Emory Healthcare (Atlanta, GA) in Aug 2012", "Interview Descriptions": "Took me months to get hired.  Had to get another job while waiting for this one to come through.\r\nIt was hard to get ahold of anyone regarding my hiring status.  The HR employee who handled my hiring process ignored me numerous times and was incredibly unprofessional.  I had a panel interview, it was incredibly uncomfortable.  They asked the typical behavioral questions. \r\nThey should consider revamping their hiring process.  I was absolutely desperate for this job and that is the only reason why I accepted.", "Interview Questions": "Typical behavioral interview questions."}, {"date": "13 Jun 2016", "title": "Patient Service Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1+ week. I interviewed at Emory Healthcare (Atlanta, GA) in Jun 2012", "Interview Descriptions": "The process was okay, considering I knew someone that could help me and give pointers. This is always a plus. I think if you are confident about yourself, you will do great. don't stress to much, because it will come across that way.", "Interview Questions": "Tell me about a time you went over and beyond your job and duty?"}, {"date": "19 Sept 2012", "title": "Patient Service Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at Emory Healthcare (Atlanta, GA) in Apr 2012", "Interview Descriptions": "Long process! I had a total of four interviews: 1 basic resume review, 1 questions/answers interview, 1 panel interview, and 1 group interview.", "Interview Questions": "The scenarios questions were pretty difficult, especially since we did not expect them"}, {"date": "15 Feb 2014", "title": "Assistant Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at Emory Healthcare (Atlanta, GA) in Apr 2012", "Interview Descriptions": "Six interviews with various faculty, really no difficult questions, more of a recruitment session than hardball interview", "Interview Questions": "none really"}, {"date": "3 Sept 2013", "title": "Clinical Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Emory Healthcare in Mar 2012", "Interview Descriptions": "the interview process consisted of behavioral questions and background work experience", "Interview Questions": "N/A"}, {"date": "16 Jul 2015", "title": "Call Center Representative Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at Emory Healthcare (Atlanta, GA) in Nov 2011", "Interview Descriptions": "Emory uses an interview technique called Targeted Selection, and you can find lots of study guides for how to answer those questions online.  They want a STAR answer:  Situation (Set up the scene or background of your example), Task/Target (what you were supposed to do in the situation), Action (what you actually did), and Result (how the situation was resolved BECAUSE OF YOUR ACTION.)  If you can touch all of those points in your answer, you're gold.", "Interview Questions": "Describe a situation where you led change in your workplace? What initiatives did you take to implement change? Was it successful?"}, {"date": "18 Jun 2015", "title": "Patient Access Representative Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 3 weeks. I interviewed at Emory Healthcare (Atlanta, GA) in May 2011", "Interview Descriptions": "It was super easy! I met the recruiter at a job fair. She promised she was going to call me and never did. I had to hunt her down and call until she got sick of me. Once I got her on the phone, I was hooked up with the hiring manager for an interview.", "Interview Questions": "WHY EMORY HEALTHCARE?"}, {"date": "6 Oct 2011", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 1 day. I interviewed at Emory Healthcare (Decatur, GA) in Feb 2011", "Interview Descriptions": "Well the interview consisted of behavioral questions that allowed the person interviewing to really think and use their past experience to answer the questions to the best of their ability. The questions seemed to be be asked in a case study mode.", "Interview Questions": "N/A"}, {"date": "21 May 2012", "title": "Admissions Representative Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 5 days. I interviewed at Emory Healthcare (Atlanta, GA) in Jan 2011", "Interview Descriptions": "I was a contractor employee with R& B solutions, across the street at Childrens Healthcare Hospital & often went over & ate lunch at the Emory cafeteria.  I got to know the woman who worked in Human Resourses - so, when I found out our company was losing our contract, I called her & she got me an interview.  It was an easy process.  I declined to take the job, because it was a rotating shift job and I was not interested in that kind of job,", "Interview Questions": "Would you have a problem with seeing patients coming in bleeding, or having been in accidents, etc.?"}, {"date": "2 Oct 2012", "title": "Pharmacy Technician II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Emory Healthcare (Atlanta, GA) in Oct 2010", "Interview Descriptions": "The whole process of getting through HR processing takes a long time. Very simple procedure; applied online, sent in a resume. I don't think they ever contacted my references. They require a background check also. I came in for a short interview, about 30 minutes, which consisted of a meeting with 2 supervisors. They ask you a series of basic, stereotypical interview questions that really have nothing to do with the position (they write down all of your answers while you are talking so it helps to have more than 10 seconds worth of stuff to say). I remember being asked about a time when I worked in a team where someone wasn't pulling his weight, greatest strengths/weaknesses, a time when something didn't go as planned. A lot of questions seemed very similar so I felt like I was using similar stories for a lot of the questions but it didn't really seem to matter. Then they showed me around the pharmacy and introduced me to a few staff members that were nearby. Everybody was nice and laid back.", "Interview Questions": "Tell us about a time where you found a problem with a process and how you went about fixing it."}], [{"date": "9 Apr 2014", "title": "Director Practice Management Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Emory Healthcare in Oct 2010", "Interview Descriptions": "Multiple interviews/people/very professional and thorough", "Interview Questions": "What was the name of your supervisor in your second job."}, {"date": "23 Oct 2013", "title": "Patient Account Representative Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Emory Healthcare (Atlanta, GA) in Jul 2010", "Interview Descriptions": "well the initial hiring  took  a few moments there is an  online test that takes 2 hours that  was fine but it took a few weeks to  speak to  alive person  who  did a phone interview ... then a few days after that for  a face to  face .. which you had to  fill  out  application again  online after it  was done initially? the interview was fine except  for the low ball salary they  try  to  give you even though you  have letters of  recommandation  and years of experience", "Interview Questions": "how would you  improve  customer care ... basic question yes .until  you really   have a  work there you can  not truely  access properly/"}, {"date": "25 Jan 2012", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Emory Healthcare (Atlanta, GA) in Jun 2010", "Interview Descriptions": "Interview asked the same rediculous question \"What would you sayis your biggest weakness?\". How does anyone truly answer that? Another goodone : \"Have you ever made an error in caring for a patient?\". \r\n\r\nOverall, the process wasn't too bad.", "Interview Questions": "What is your biggest weakness as a nurse?"}, {"date": "15 Nov 2011", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Emory Healthcare (Atlanta, GA) in Oct 2009", "Interview Descriptions": "From the application to the initial contact went on very fast", "Interview Questions": "N/A"}, {"date": "14 Jan 2010", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Emory Healthcare (Atlanta, GA) in Jun 2009", "Interview Descriptions": "Human resources was unreliable.  Said they would call in a few days and waited weeks to return calls.  Apologized then didn't call again when they said they would.  Other areas were very professional except human resources.", "Interview Questions": "Tell me about a negative comment you received on an evaluation and how you responded and worked on it."}]]