[[{"date": "20 Apr 2023", "title": "Data Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Center for Family Services in Apr 2023", "Interview Descriptions": "Pretty bad. Interviewer arrived 20 minutes late, didn't seem to care. Tone was dry and unfriendly. They posted on the website it was remote but it was a lie because it was really a hybrid postion.", "Interview Questions": "Do you have Spanish speaking abilities?"}, {"date": "18 Aug 2022", "title": "Individual/ Family Counselor  Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Center for Family Services (Voorhees, NJ) in Jun 2022", "Interview Descriptions": "Virtual, easy questions pertaining to the job and your experience. Truly looked over your resume and asked fact finding questions and well as behavior based questions. Normal questions nothing outside of a normal interview. ", "Interview Questions": "Tell me about yourself? And why Family Services?"}, {"date": "1 May 2023", "title": "Supervisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Center for Family Services (Voorhees, NJ) in Jan 2022", "Interview Descriptions": "The interview process was thorough and all questions asked during the interview about company culture were addressed and answered authentically. It appears that the agency values transparency and team work.", "Interview Questions": "The interview was more of a conversation and as the prospective candidate, I had many questions. Each question was answered thoughtfully. I think this dynamic led to less questioning by the person interviewing."}, {"date": "30 Aug 2021", "title": "Program Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Center for Family Services", "Interview Descriptions": "A fairly easy interview process included 2 rounds with more personable and team-based questions. One was over the phone and the other was through a video call with a couple of members of the program. They were easy to talk to, made sure I was ok with the set-up, and were interested in my motivation to work at a nonprofit.", "Interview Questions": "What are important skills that can improve community relationships?"}, {"date": "20 Jan 2021", "title": "Case Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Center for Family Services", "Interview Descriptions": "I was interviewed through a hiring event through Indeed. The interview was online over video call. The interviewer was very personable and welcoming. They were warm and polite which serves as a wonderful representation of the organization.", "Interview Questions": "What makes you a good fit for this company?"}, {"date": "5 Jun 2019", "title": "Residential Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Center for Family Services (Laurel Springs, Camden, NJ)", "Interview Descriptions": "It was a very simple process to start, I applied through employee referral and filled out a paper application.  I was interviewed by the Program Director at the program and was hired on the spot. The longest part is everything after that. The motor vehicle, background check, and fingerprint check take weeks.", "Interview Questions": "Do you have any experience working with children or youth?"}, {"date": "4 Aug 2020", "title": "Program Supervisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Center for Family Services (Camden, NJ) in Jun 2019", "Interview Descriptions": "Applied online.  Had brief phone interview then in-person interview.  The interview seemed to go well but I never heard back from the interviewer.  I even reached out to the interviewer and she never replied.  I believe if someone takes the time to come to an interview (taking time from current job, arranging childcare, etc)  that the professional and courteous thing to do is to at least let them know they did not get the position.", "Interview Questions": "How do you handle conflict?"}, {"date": "21 Aug 2022", "title": "Residential Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Center for Family Services (Voorhees, NJ) in Jan 2019", "Interview Descriptions": "I was able to speak with 2 managers/ staff. Lots of experience questions and scenarios to go through.  They explained the job well and left time for a lot of questions.", "Interview Questions": "To tell me about my experience with youth"}, {"date": "8 Apr 2019", "title": "PR Administrative Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Center for Family Services in Dec 2018", "Interview Descriptions": "Applied in November and received an email back requesting a phone interview in early December.  After the phone interview, I was asked to come in for an in-person interview that same week.  About 2 weeks later I was asked to complete a writing test.", "Interview Questions": "Why do you want to work at Center for Family Services?\r\nWhat qualities do you bring that will enhance the CFS team?\r\nWhat are some of your strengths?\r\nWhat are your weaknesses? "}, {"date": "1 Sept 2014", "title": "Case Manager Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Center for Family Services", "Interview Descriptions": "Applied online, received phone call, came in for interview, met with two supervisors, shadowed case manager for a day, excessive reference-check, expressed continued interest, offered position, started the next week.  It all took about 2 weeks.", "Interview Questions": "There were no difficult questions; Laid-back, comfortable; Be honest"}], [{"date": "12 Oct 2012", "title": "Administrative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Center for Family Services", "Interview Descriptions": "Fist interview was great..normal process.  Second interview was conducted in a group setting with myself and three other employees, Director, admin. assist., and receptionist.  was nervous at first, but overall it went well!", "Interview Questions": "Please try to be as detailed as possible regarding the technical question, business case, etc."}, {"date": "31 Jan 2016", "title": "Supervisor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Center for Family Services (Williamstown, NJ) in Jun 2012", "Interview Descriptions": "The process was rather easy. I had two interviews, the second interview I was offered the position and I completed a bunch of paperwork.  I was told I would need to complete a drug screening and attend a new hire meeting before I began work.", "Interview Questions": "The interview questions were average."}]]