[[{"date": "10 Jun 2023", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Humane Society of the United States", "Interview Descriptions": "One interview; the questions were straightforward and there was nothing out of left field. Had two interviewers, both were very personable and made the interview a very positive experience . Heard back sooner than expected.", "Interview Questions": "What is one time you made a mistake and how did you learn from it?"}, {"date": "27 Jan 2023", "title": "Social Media Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at The Humane Society of the United States in Nov 2022", "Interview Descriptions": "Got an interview about 4 weeks after I applied, and received a second interview about 3 weeks after that. I was told I would hear back within 2 weeks and after following up multiple times over 4 weeks I was told I didn't get the job. If I didn't keep following up every week, I'm confident I never would've heard back. It's very unprofessional after devoting so much of my time to the interview process, to not even have the decency to send an email stating they moved forward with other candidates.", "Interview Questions": "Why do you think you are a great fit for this position?"}, {"date": "24 Oct 2022", "title": "Paid Media Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at The Humane Society of the United States in Oct 2022", "Interview Descriptions": "I've read other comments on here that it seems like ghosting is a common thing with HSUS. This happened to me as well. I went through two rounds of interviews (a phone screening with HR and then a hour-long video interview with two hiring managers), and was told I would get a follow-up with the HR manager regarding the status of where I would be in the hiring process. I never heard from then again. I followed up with HR twice over email, never got a response, and it's been over two weeks. How rude is that? After all the work I put into this and you don't have the decency to let me know I didn't get the job? And you can't even reply to my emails? I actually called the HR number too, just for the heck of it, to see if they answered. Nope, my call was ignored. This is the most unprofessional application/interviewing experience I have ever encountered. Also, I would like to mention, that the interview with the two hiring managers was very hardcore. They asked extremely hard questions not meant for an \"entry-level\" position. Whatever you do, I advise you to not even bother applying/interviewing here. Extremely unprofessional. And you know what - when companies do this kind of thing - it's really telling of who they REALLY are. And why would anyone want to work for a company like that anyways? A company that's \"so compassionate\" about all lives that walk this earth, yet they treat people that didn't make it to the next round of interviews like they don't deserve an answer back or any communication at all. Some great company you are, HSUS.", "Interview Questions": "Q: Why do you want to work here? Q: Explain your typical day of work in your current role. Q: What is your most inspirational advertisement you've ever seen and why? Q: What kind of ideas do you have that we could post for ads on our social media accounts? (this seems like a really odd question to ask in an interview, that's what the job is about, you want me to just think of an answer on the spot so you can take it and use it and then not hire me? I see companies do this all the time). Q: What was your best and worst campaign and why? Q: What is your current company's culture like? Q: What KPIs does your company focus on and what do you do if they aren't hitting the targets? Q: What kind of reporting do you do? Q: How do you manage digital ad budgets?"}, {"date": "15 Jun 2022", "title": "Marketing Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Humane Society of the United States", "Interview Descriptions": "It was your typical HR phone screening but a bit rushed.  A bit misleading...I was told my credentials matched what they were looking for and given a timeline for an interview... but it didn't happen.", "Interview Questions": "Why do you want to work for us"}, {"date": "8 Jun 2022", "title": "Project Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at The Humane Society of the United States in Jun 2022", "Interview Descriptions": "The screening process was very informative and pleasant.  The talent rep was very knowledgeable about the position and gave me all the information I needed to know about the position.", "Interview Questions": "If the scheduled worked for me."}, {"date": "16 Mar 2022", "title": "Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at The Humane Society of the United States", "Interview Descriptions": "A couple of weeks after applying, I had a screening call with the Human Resources specialist about my experience, to learn more about the position, and benefits at the organization.", "Interview Questions": "If I was comfortable with the salary range?  If I thought the job description was a good fit?"}, {"date": "10 Jan 2022", "title": "Regional Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at The Humane Society of the United States", "Interview Descriptions": "Interviewed by the Regional Director and senior members of the organization and other staff members.  Participated in regional meeting processes before joining the organization.  Interviewed by HR leadership and donors.", "Interview Questions": "Reason for joining the organization"}, {"date": "14 Jul 2021", "title": "Marketing Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at The Humane Society of the United States (Washington, DC) in May 2021", "Interview Descriptions": "HR phone screen, panel of two hiring managers and then a panel of 4 team members.  Roughly about a week between all of them.   The team panel was probably one of the worst I've experienced.  I was asked questions better suited for a Director, not a specialist.   One team member was 5 minutes late for the interview without so much as an apology and proceeded to go off camera several times during the interview which I found odd and disrespectful.\n\nAlso, despite asking twice if I got the job to HR and to the hiring managers, I haven't received any response - its been several weeks already so obviously I didn't get it.  After putting hours of work into a job application and interviews, I would have thought a formal response to my emails requesting job status was appropriate, but I guess HSUS doesn't care about candidates unless you've gotten the job.   \n\nI'd also note that the team members during my interview disclosed bullying at the leadership and peer level so I'd caution anyone interviewing here - you'll get ghosted and probably also face a toxic work environment.\n\nI've been interviewing a fair amount over the past several months and have to say HSUS is one of the most unprofessional organizations I've 'met'.....", "Interview Questions": "If your KPIs weren't meeting goals halfway through the fiscal year, how would you change your strategy?   "}, {"date": "17 Aug 2021", "title": "Toxicologist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at The Humane Society of the United States in May 2021", "Interview Descriptions": "Interviewed virtually, it was extremely laid back.\nThe interview went rather smoothly, despite the fact that one of the people who were supposed to be interviewing me were not present.\nSalary is low, but that is to be expected given that they are not for profit", "Interview Questions": "What are your three best qualities?\nWhat are your three worst qualities?\nHow do you handle competing priorities"}, {"date": "10 Mar 2022", "title": "Front Desk Receptionist Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at The Humane Society of the United States in Jan 2021", "Interview Descriptions": "easy peasy, it does not entail a lot of question, mostly friendly banter, just prepare and you will be okay, make sure to like animals, and you need to be shot records", "Interview Questions": "do you own an animal"}], [{"date": "22 Dec 2020", "title": "Internship Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at The Humane Society of the United States (Atlanta, GA) in Dec 2020", "Interview Descriptions": "The interview was very comfortable and the interviewers were very nice. I had a virtual interview.  It was a very straightforward interview.  I did a bit of interview prep, mainly looking over the job description and daily duties.", "Interview Questions": "They asked questions like how have my education and experiences prepared me for this position? What are you most excited about getting from this internship? and Do I have experience working from home, and how do I balance everything. "}, {"date": "9 Nov 2020", "title": "Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at The Humane Society of the United States", "Interview Descriptions": "Applied online and spoke on phone with HR two weeks after. Met with hiring manager through zoom the same week.  The people were very friendly and easy to talk to.", "Interview Questions": "Describe an accomplishment you are especially proud of"}, {"date": "25 Jan 2021", "title": "Director Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Humane Society of the United States (Gaithersburg, MD) in Nov 2020", "Interview Descriptions": "Prepare to be ghosted. It took 2 months from applying, screening, panel interview to final interview. HR never contacted me 2+ weeks after the final interview, I had to call THEM to check my status. This is how you lose enthusiastic qualified candidates, do better HSUS. I feel like my time was wasted and I was disrespected.", "Interview Questions": "What is your management style?"}, {"date": "10 Sept 2020", "title": "Public Relations Specialist Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at The Humane Society of the United States (Washington, DC)", "Interview Descriptions": "Very softball interview process. Both my supervisor and HR interviewed me and asked for writing samples. \r\n\r\nCompared to PR agencies, the questions were basic and easy. Questions included what you read, why you want to work at HSUS, previous experience, ability to navigate difficult situations. No curveballs were thrown.", "Interview Questions": "Why do you want to work here?\r\nWhat are your strengths and weaknesses?\r\nHow would you handle X situation?"}, {"date": "30 Apr 2021", "title": "Phone Donations Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at The Humane Society of the United States (Los Angeles, CA) in Jan 2020", "Interview Descriptions": "group interview with about 6 other people asking simple questions one by one. the questions were all very basic and easy to answer. the interviewer set a very chill and non stressful vibes.", "Interview Questions": "why join the humane society?"}, {"date": "2 Oct 2019", "title": "Intern Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at The Humane Society of the United States", "Interview Descriptions": "After a few emails and a quick phone call, there was a thirty minute in person interview at the MD office with basic questions about your interest, experience, availability, etc", "Interview Questions": "They asked generic questions such as where did you learn about the internship, what about the internship interests you, tell me about your relevant experience, what's your availability"}, {"date": "26 Sept 2019", "title": "Public Relations Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "The process took 4 weeks. I interviewed at The Humane Society of the United States (Alexandria, VA)", "Interview Descriptions": "Got an email saying they were interested in talking to me further. Talked with the HR rep who asked me three preliminary questions, nothing to do with experience. Had all the qualifications (and then some) and I never heard back.", "Interview Questions": "Salary expectation"}, {"date": "28 Feb 2019", "title": "Specialist, Entertainment & Celebrity Outreach Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at The Humane Society of the United States (Los Angeles, CA) in Feb 2019", "Interview Descriptions": "I was invited to take part in a phone screen with the junior recruiter. Once I found out the salary, it was far too low and had to decline moving forward. Honestly, I thought the girl was not prepared and quite rude. When she asked how much I would like to make, she flat out laughed at me. Then she went on to offend me by the interview questions she asked.  After reading all of the Glassdoor reviews, I had a feeling that this was not the right work environment for me, and  this junior recruiter definitely proved me right.", "Interview Questions": "Looking at your resume, you have been in a lot of Assistant and Coordinator roles, surely that is not what you want to do with your life, so what is your 5 year plan?"}, {"date": "26 Dec 2022", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at The Humane Society of the United States (New York, NY) in Jan 2019", "Interview Descriptions": "There was no interview process, per se. I was already connected to the volunteer network. There is a lengthy application that needs to be completed, and this included prior employers, volunteer experience, technical skills, etc. They're very thorough!", "Interview Questions": "Are you interested in helping animals?"}, {"date": "23 May 2018", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 3 weeks. I interviewed at The Humane Society of the United States", "Interview Descriptions": "I emailed asking about the program and submitted my resume. A week later I had a phone interview with them. They were really nice and it was the normal, basic interview.  Upon acceptance, they will do background check on you which takes a couple weeks.", "Interview Questions": "How did you hear about this position?"}], [{"date": "29 Apr 2019", "title": "Customer Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at The Humane Society of the United States (Toronto, ON) in May 2018", "Interview Descriptions": "Interview process was fairly quick...took overall about 2 weeks from resume submission to interview to job acceptance.  The hiring manager was really professional and timely.  They contacted me via email to set up an interview.", "Interview Questions": "What was a time that you were challenged in a job before?"}, {"date": "29 Apr 2018", "title": "Digital Marketing Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at The Humane Society of the United States (Gaithersburg, MD) in Mar 2018", "Interview Descriptions": "I sent my resume and cover letter via the website and got a call about a week later. She told me I had the preliminary qualifications and we did a \"phone interview.\"  A few days later I was invited to come in for an interview with my would-be supervisor. Spent about an hour and a half with the interviewer, provided me a lot of info about workplace and answered my questions.", "Interview Questions": "What was the most satisfying project you worked on and why?"}, {"date": "5 Mar 2018", "title": "Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at The Humane Society of the United States (Washington, DC) in Mar 2018", "Interview Descriptions": "Contacted for phone interview via email from HR recruiter a few weeks after applying.\r\nScheduled for in person interview same day at DC office with 2 hiring managers . 90 minute process", "Interview Questions": "What interested me about the position?\r\nSalary expectation?"}, {"date": "2 May 2018", "title": "Senior Field Organizer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at The Humane Society of the United States (Gaithersburg, MD) in Mar 2018", "Interview Descriptions": "I received an email from HR requesting to set up a phone screening. After we found an available time, I then had a 15 minute phone conversation with the HR representative to ensure I met all the qualifications. I then was contacted a few days later that I had made it through to the next round and that I would be speaking with my future supervisor. The HR rep was extremely helpful in the process, even with the outcome (they cancelled my interview twice and ended up not hiring anyone).", "Interview Questions": "What skills do you have that would be good for this job?"}, {"date": "24 Jan 2018", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 6 weeks. I interviewed at The Humane Society of the United States (New York, NY)", "Interview Descriptions": "Interview process started with a  telephone interview. If asked to move forward, you'd draft a press release on a specific topic. I was then offered the position. I applied early so had to wait a while for a response, the team was however very responsive", "Interview Questions": "What is an important way in which people communicate information?"}, {"date": "26 Mar 2018", "title": "Public Policy Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 4 months. I interviewed at The Humane Society of the United States (Greensboro, NC) in Nov 2017", "Interview Descriptions": "Very long, submitted application in September did interview in October, November and January.  They took a long time to call between interviews, and when they did call, they expected an immediate turn around.", "Interview Questions": "Why I was the best candidate for the position"}, {"date": "27 Mar 2018", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at The Humane Society of the United States (Gaithersburg, MD) in Mar 2017", "Interview Descriptions": "First round: Skype interview; second round: in-person at HQ (flew me out). It seemed HR was not involved in many parts, but should have been. 1:1 phone call with HR recruiter after I'd already talked with Director of Department.", "Interview Questions": "To talk more about a mentorship program I'd developed at my previous role."}, {"date": "3 Feb 2017", "title": "Veterinary Technician Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 5 weeks. I interviewed at The Humane Society of the United States in Nov 2016", "Interview Descriptions": "After submitting an application through the HSUS website I heard nothing back for about three weeks. I got an email from the HR department asking to set up a phone interview. During the phone interview basic questions were asked including salary, availability, why do want to work there etc. Only lasted 20 minutes. After that, an in person interview was arranged. The interview consisted of three administrators. One was very personable and willing to talk about the organization while the other one was very silent and the last was not paying any attention at all and was on his phone the entire time, clearly not engaged. The entire process from start to finish took about 5 weeks. Overall, communication was terrible. In between every correspondence with the organization, days would pass before they got back to me. The entire process was needlessly long and frustrating.", "Interview Questions": "What is the most negative quality you find in a coworker or boss?"}, {"date": "7 Aug 2016", "title": "Program Manager Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Humane Society of the United States", "Interview Descriptions": "The interview process took more than two months. I applied online and was contacted ~10 days afterward for a brief phone interview with HR. This was fairly straightforward-- mostly questions concerning background and fit. More than three weeks later I had a second interview with the position's supervisor, again via phone. The interviewer seemed circumspect in answering some questions about available resources for professional development. \r\n\r\nA week following the second interview, I was invited to interview a third time with a panel via video chat. The questions again had to do with my background and how my experiences fit the position. The interviewers seemed disorganized and a couple of times during the interview disagreed with one another about company policies and procedures, which was a red flag for me. While they answered many of my questions satisfactorily they skirted others entirely and seemed hesitant to discuss social cohesion among different divisions or opportunities for career advancement within the organization. More than a week after the third interview I was asked to fill out an employment application and submit to a background check, and my references were contacted. \r\n\r\nThe following week I was made an offer via HR, who wanted me to make a decision immediately. When I told them I had additional questions about the position as well as employee policies and benefits, they said they'd need an answer within no more than two business days. While I love this organization's mission statement, there were too many indications of poor business practice and communication issues during the hiring process for me to feel comfortable accepting the position.", "Interview Questions": "Is there anything in your personal ideology that would conflict with the Humane Society's mission and/or work? If so, how would you handle that conflict if hired for this position?"}, {"date": "30 Apr 2016", "title": "Science Communications Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at The Humane Society of the United States (Nottingham, England) in Mar 2016", "Interview Descriptions": "Phone interview with 2 people - 1 was in Canada and the other was in the USA. It was a really interesting and enjoyable interview, although it became clear I wasn't best suited to the job.", "Interview Questions": "Do you have experience of negotiating and speaking to a hostile audience?"}], [{"date": "8 Mar 2017", "title": "Marketing Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "The process took 5 months. I interviewed at The Humane Society of the United States in Feb 2016", "Interview Descriptions": "The interview and hiring process took too long--over 5 months.  After submitting the initial resume, I had an HR phone screen within 2 weeks.  The follow up phone interview with the hiring manager was scheduled 5 weeks later.  An in person interview with a 6-person team was scheduled 3 weeks later. I was notified 2 months later that an internal person had been hired for the position.", "Interview Questions": "The initial HR screen was pretty standard including if any of my beliefs were against the mission of the organization.  The hiring manager phone interview asked more specific questions regarding my experience and what I would bring to the position.  The team interview seemed awkward.  Most of those employees that were part of the interview, didn't contribute to the interview.  I asked them how this position would work with each of the members in the room and they didn't seem to know.  The hiring manager left a month after the position was offered to the internal candidate.  Seemed like a reorg at the company, but no one wanted to disclose it."}, {"date": "15 Mar 2016", "title": "Manager Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at The Humane Society of the United States in Feb 2016", "Interview Descriptions": "First interview was conducted by HR department. This interview was short and sweet, with pretty standard questions. The second interview was with a supervisor that I would be working with directly, and this one was longer and also had more detailed questions about my background and how my experiences would be applicable to the position.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "31 Dec 2015", "title": "Food Policy Outreach Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Humane Society of the United States", "Interview Descriptions": "I was called for a preliminary screening by the HR people. They never followed up with any job updates, even to tell me that the position had been filled. I emailed twice and no never got a definitive answer. I think that it's common courtesy to at least notify applicants who are screened that they didn't make it to the next round. \r\n\r\nFYI My understanding is the people who do make it to the next round are interviewed again by someone in the specific department that they applied to. Then if you make that cut you go for an in-person interview (if a remote position, sometimes you fly in, other times you do a Skype interview).", "Interview Questions": "How do your values align with those of the Humane Society?"}, {"date": "6 Jan 2016", "title": "Campaign Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at The Humane Society of the United States (Gaithersburg, MD)", "Interview Descriptions": "Over-the-phone interview with HR about 2 months after I applied. Easy to talk to, typical questions. I thought the interview went well, but I never heard from them again despite multiple follow-up emails.", "Interview Questions": "Asked what I expected to get for a salary."}, {"date": "20 Nov 2015", "title": "Legislative Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at The Humane Society of the United States in Nov 2015", "Interview Descriptions": "Basic questions about personality and passion. Phone interview / conference call with three members of the office. Asked what I would do if I had no specific project that needed to be worked on", "Interview Questions": "Why do you want to work here?"}, {"date": "9 Aug 2016", "title": "Legislative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at The Humane Society of the United States (Washington, DC) in Nov 2015", "Interview Descriptions": "We had a phone interview because I was in California while they are based in Washington, D.C. and Maryland.  We talked for about 30 minutes and had a really good conversation that was prompted and encouraged by good interview questions and a friendly disposition from the interviewer.  The conversation came very naturally, but she also asked very appropriate and sometimes difficult questions to answer off the top of your head.", "Interview Questions": "One question went something like, \"What would you do if you had a conflict with your supervisor?\""}, {"date": "17 Mar 2016", "title": "Policy Positions Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Humane Society of the United States (Gaithersburg, MD) in Oct 2015", "Interview Descriptions": "In the fall I was contacted to interview for the wildlife abuse campaign manager position. I set up and conducted the interview with an HR person. He told me it would be a few weeks until they got back to people about whether they would be bringing them in. Three weeks later, still nothing. I email to check in, ignored. HR couldn't be bothered to give a response.\r\n\r\nRecently I applied and set up a phone interview for a different policy position. Set up the interview through one HR person to be conducted by a different one. She promised a response within the next 2.5 weeks. It's now 3 weeks later and all emails have been ignored. Seems like it's pretty standard for them to just ignore you and never tell you they've moved on with other candidates based on my and other peoples' experiences.", "Interview Questions": "Why do you want to work here?"}, {"date": "1 Aug 2015", "title": "Database Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Humane Society of the United States", "Interview Descriptions": "Started with scheduling a 30-minute phone screening by email. A few weeks later, I was later contacted by phone to schedule an in-person interview, set up for the following week. This process was about 90 minutes with multiple people, which resulted of many repeated questions. I was notified of a decision the following week.", "Interview Questions": "Why are you interested in this position?"}, {"date": "27 May 2015", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Humane Society of the United States", "Interview Descriptions": "There was a fairly quick - maybe half hour or so - phone interview, and then a little while later a request of a writing sample. The phone interview was pleasant and they were very responsive to communication and my schedule, even when I had to reschedule my interview at the last minute because of illness.", "Interview Questions": "What are some projects this company is working on that interest you?"}], [{"date": "27 Aug 2015", "title": "Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at The Humane Society of the United States (Gaithersburg, MD) in May 2015", "Interview Descriptions": "Phone screen with HR then in person interview with hiring manager. Never heard from HSUS again, not even a \"thanks but no thanks\" email, nor any response to my follow up emails. Seems that if you take the time to come in for an interview then you are at least deserving of some sort of communication after the fact. Extremely unprofessional.", "Interview Questions": "Standard questions"}, {"date": "20 Jul 2015", "title": "Business Support Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at The Humane Society of the United States (Gaithersburg, MD) in Mar 2015", "Interview Descriptions": "The interview location was very secure.  I was not able to directly see the front desk person and had to be buzzed in to meet the interviewer.  Interview process was straight-forward.  I interviewed directly with the hiring manager and we discussed the standard topics (e.g. my background and experience, the job description, etc.).", "Interview Questions": "Describe my background and experience."}, {"date": "8 Mar 2016", "title": "Assistant Content Creator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at The Humane Society of the United States (Gaithersburg, MD) in Mar 2015", "Interview Descriptions": "In addition to applying via the online portal, I tracked down someone in the editorial department and emailed my materials directly. I corresponded briefly with that woman before being told someone in HR would reach out. I had a phone interview with HR that went very well, then took a writing test, then went down for an in-person interview. Ultimately, I was not offered the position. The whole process took 4-5 months. Everyone was very nice, personable, easy to talk to. The interview took about an hour.", "Interview Questions": "Why do I want to work for HSUS?"}, {"date": "7 Jan 2016", "title": "Faith Outreach Strategist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Humane Society of the United States (Oakland, CA) in Sept 2014", "Interview Descriptions": "Skype interview. Well done. Questions were appropriate and on topic. Interviewer was the former Lt. Governor of a southern State. There was lots of room for me to expand my ideas regarding the strategies that might help the Faith Outreach program.  There were the typical questions of how one's experience and skill base fits with the requirements of the position.", "Interview Questions": "What ideas do you have for Faith Outreach as a Strategist?"}, {"date": "9 Mar 2014", "title": "Manager Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. The process took 3 days. I interviewed at The Humane Society of the United States", "Interview Descriptions": "Initial interview sat down with ED.  Basic interview questions.  Easy because I was qualified for the position,", "Interview Questions": "Ability to know details of duties required."}, {"date": "30 Oct 2015", "title": "Online Marketing Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. The process took 1+ week. I interviewed at The Humane Society of the United States (Gaithersburg, MD) in Jan 2014", "Interview Descriptions": "A few questions about personality and skills. Why would you work there and info about work history. Very quick, easy and straight to the point. They hired on the spot.", "Interview Questions": "N/A"}, {"date": "17 Jun 2012", "title": "Media Relations Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "The process took 2 months. I interviewed at The Humane Society of the United States in Apr 2012", "Interview Descriptions": "HSUS strung me along for two and a half months with an interview process that included several phone and in-person interviews and an incredibly long writing test. the interviews were random and interviewers were clearly unprepared. Despite making several comments that led me to believe I was their ideal candidate, they chose someone else for the position, and failed to inform me despite all of the time and energy invested in the process. They ignored several attempts to follow up by email and telephone. When I finally managed to get in touch with the hiring manager, she bitched me out for calling while still not telling me the position had been filled. Completely bizarre and unprofessional behavior all the way around.", "Interview Questions": "Interview questions were highly irrelevant and bizarre."}, {"date": "17 Jul 2016", "title": "Program Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at The Humane Society of the United States (Gaithersburg, MD) in Apr 2012", "Interview Descriptions": "Interviews with department heads, repeat interview with Human Resources staff person after meeting with program leads, which seemed redundant; aside from that, the process was not unlike other employers' processes.", "Interview Questions": "Prior employment history"}, {"date": "4 Dec 2010", "title": "Intern Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "The process took 1 day. I interviewed at The Humane Society of the United States (New York, NY) in Jun 2010", "Interview Descriptions": "It was very informal. They called, asked a few behavioral questions, and then pretty much offered me the job, assuming that my background check went ok. I think they more focus on your resume than anything else", "Interview Questions": "Why do you want this internship?"}, {"date": "5 Jan 2014", "title": "Communications Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at The Humane Society of the United States (Washington, DC) in May 2010", "Interview Descriptions": "When I was hired I simply interviewed (twice) with the hiring manager.  These days, HR is much more involved in pre-selecting candidates and managers only get pre-qualified applicants to choose from.  This is mostly good, although sometimes you may be missing out on some candidates due to HR's pre-interview which, from what other newer employees have said, includes very random questions that don't necessarily relate to the position you're applying for.", "Interview Questions": "I've heard about some bosses asking such random questions as \"How does a bill become a law?\"  This is definitely an odd question, although being that our organization does advocacy work for animals it seems this is why that question is asked.  Otherwise, it really depends on who's interviewing you and what their experience is with interviewing candidates as some managers ask high-level -- and, to me, worthless -- questions such as, \"Where do you see yourself in five years?\", whereas other managers really base their questions on the candidate's resume and experience.  In my interview, the hiring manager had a pre-selected list of questions -- to me, a waste since you should really be talking to the candidate and trying to figure them out as a person and an employee.  But, I know many managers feel more comfortable having a pre-set list of questions to go off of."}], [{"date": "4 Nov 2011", "title": "Employee Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 4 weeks. I interviewed at The Humane Society of the United States (Washington, DC) in Mar 2010", "Interview Descriptions": "I found the job on their website and applied online. I was brought in for 2 interviews and also had a phone interview. They did a background check.", "Interview Questions": "Why do you want to work for The HSUS?"}, {"date": "17 Feb 2010", "title": "Executive Director Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at The Humane Society of the United States in Nov 2009", "Interview Descriptions": "Phone interview with several people on speaker phone at the other end. The questions were about 50% related to the job description and 50% out of the blue. Turns out they were using members of the Board of Directors to conduct the interview. A couple of whom had no idea what the job entailed. They tended to talk over each other and not identify who was talking. Hard to focus and answer with relevant information. Offered a job one level beneath the one we were talking about because that recently filled position was open again. Did not get a good feeling about the stability and direction of the organization.", "Interview Questions": "Describe a time when you had to dicipline an employee over a rules infraction."}]]