[[{"date": "22 Mar 2023", "title": "Assistant Athletic Director Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of New Hampshire", "Interview Descriptions": "Moved quickly and they were transparent about the process. On campus was informative, got to meet several people across multiple departments. Ultimately went with another candidate with more relevant experience. No issues with it at all.", "Interview Questions": "Tell us about your managerial experience."}, {"date": "20 Sept 2022", "title": "Marketing Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of New Hampshire", "Interview Descriptions": "Had three rounds of interviews with the last being an all day interview to meet with different people the role would be interacting with. I had some one on one meetings and others were larger groups. I also had lunch with a group of people. ", "Interview Questions": "Describe a time when marketing efforts failed and how you dealt with the situation."}, {"date": "11 Aug 2022", "title": "Compensation Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of New Hampshire", "Interview Descriptions": "Lots of communication along the way and the recruiter was very easy to get ahold of when needed. A very smooth hiring and interview process and didn't feel long and drawn out.", "Interview Questions": "Tell us about your background."}, {"date": "5 Oct 2022", "title": "Admin Assistant II Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of New Hampshire (Durham, NH) in Aug 2022", "Interview Descriptions": "Hour-long zoom screening with hiring manager to familiarize candidate with overall responsibilities and introduce candidate with larger projects throughout the year and determine overall fit before an additional screening with unit director.", "Interview Questions": "How would you expand the functions of this position?"}, {"date": "6 May 2022", "title": "Lifeguard Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of New Hampshire", "Interview Descriptions": "Very professional and helpful to start the processes for bigger interviews once graduated. Organized and thoughtful questions. Was a very good experience to have and would recommend it for other students looking for a job on campus", "Interview Questions": "How would you describe a difficult situation that you were able to overcome? "}, {"date": "16 Mar 2022", "title": "Resident Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of New Hampshire", "Interview Descriptions": "The process was like any other on campus employment interview in general. They asked lots of situational questions. I showed up to the interview with business casual attire. The interview went for almost 30 minutes.", "Interview Questions": "Q: Describe your roles in a student organization if you have any"}, {"date": "16 Sept 2022", "title": "Resident Advisor (RA) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at University of New Hampshire (Durham, NH) in Mar 2022", "Interview Descriptions": "I was interviewed by a Resident Hall Director, where I answered questions regarding my efforts to foster inclusivity and a safe living environment for residents.  I also expressed my abilities to meet with residents and help become involved with their UNH community but also balance their academics with extracurricular activities.", "Interview Questions": "What were some ways you fostered inclusivity with your residents on your floor?"}, {"date": "12 Jul 2021", "title": "Student Library Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at University of New Hampshire", "Interview Descriptions": "It was a pretty seamless interview. This was just for a student position, so it was pretty chill and easy. They asked a mix of questions regarding work history, personality, and strengths.", "Interview Questions": "What is a weakness of yours?"}, {"date": "16 Jun 2021", "title": "Unh Phonathon Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at University of New Hampshire", "Interview Descriptions": "Easy interview process with the manager. High speed call volume and training program good. Good job for college students. Must work a weekend shift which is the only downfall with not much flexibility", "Interview Questions": "Are you able to work a weekend shift "}, {"date": "11 May 2021", "title": "Sustainability Fellowship Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of New Hampshire", "Interview Descriptions": "Was invited to one interview with (1) UNH staff/faculty, and (1-2) partner organization representatives. The interview was an hour long. I applied to 3 internships with them, and I was invited to 3 separate interviews which each followed the same format. Decisions were made in April.", "Interview Questions": "Can you talk about your time management skills with working remotely?"}], [{"date": "30 Mar 2021", "title": "Program Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at University of New Hampshire", "Interview Descriptions": "A few phone calls, very easy.   Each call had more relevant players on the team.  The head of the department joined as well as a few leads from other organizations involved with the project.", "Interview Questions": "More of a conversation than an interview"}, {"date": "3 Oct 2022", "title": "AVP-IT Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of New Hampshire (Hastings-on-Hudson, NY) in Jan 2021", "Interview Descriptions": "Interview was fairly typical in terms of submission process. Required excessive up front questions to be submitted in writing prior to interview, and several of the questions had coded language that was difficult to assess unless you were an insider. The prep work and writing was laborious.", "Interview Questions": "How would you navigate challenging or difficult community members."}, {"date": "26 Sept 2020", "title": "MUB Information Desk Staff Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at University of New Hampshire", "Interview Descriptions": "Interview was 1 round. Spoke with some team members and boss. Was simply about work ethic. I then got a tour of the building with the team to see if I would be a good fit.", "Interview Questions": "Why are you a good fit for this job?"}, {"date": "20 Mar 2021", "title": "Lecturer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of New Hampshire (Manchester, NH) in May 2020", "Interview Descriptions": "Two Phone interviews, One screening and the other was presentation.  I did answer all the question and have a relevant presentation.  I noticed the chair of the committee intentionally called me different name than my own name, which was an indication to me that the job was given some else, after several weeks I get an email saying the job was cancelled.", "Interview Questions": "What is the difference between traditional engineering programs and engineering technology programs?"}, {"date": "25 Jan 2020", "title": "Crew Member Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 5 days. I interviewed at University of New Hampshire", "Interview Descriptions": "Very easy. Spoke to at the recruiter at the career fair about my interests and how it matched the company. Followed up in an email and later got asked to shadow. Soon after I began working there", "Interview Questions": "Interest?"}, {"date": "9 Jun 2022", "title": "Associate Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 3 weeks. I interviewed at University of New Hampshire (Durham, NH) in Jan 2020", "Interview Descriptions": "Emailed with the aquatics director. Then, met them for about a 30min interview regarding my experience since I was also hoping to teach lessons, which is a little more competitive since you need to work with them for a while to do so.", "Interview Questions": "What would I do in certain situations (had specific scenarios) most were specific to kids, or the older people who come in the morning. \n\nAlso asked about other emergency situations like an active shooter. "}, {"date": "11 Oct 2019", "title": "Office Assistant Annual Giving Office Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of New Hampshire", "Interview Descriptions": "Submitted my resume and had one interview. It was really easy because it was a work study and if you're applying to a real position please don't give this any credibility.", "Interview Questions": "What's your favorite movie?"}, {"date": "14 Jan 2019", "title": "Prospect Research Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of New Hampshire", "Interview Descriptions": "It was a telephone interview with a representative from Human Resources, and two people from the department who held similar positions; one of them was the acting director. This was not a Skype interview.", "Interview Questions": "\"Think about a time when your team didn't buy into something you thought was a good idea - how did you get your team to buy in?\" "}, {"date": "17 Jul 2020", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at University of New Hampshire (Durham, NH) in Aug 2018", "Interview Descriptions": "I just hand in job application online, simply explain my grade for this class and my passion for helping other students who are struggling for financial accounting course. And mention my available time for this job.", "Interview Questions": "why do you think you are suitable for this position"}, {"date": "4 Jun 2019", "title": "Program Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of New Hampshire in Jul 2018", "Interview Descriptions": "Applied online and several weeks later was asked to take part in a large panel interview via internet conferencing.  There were about eight interviewers present and they went around the table asking questions, some were staff and others were volunteers involved in the program.  It went well and everyone was pleasant but when I asked how many other applicants would require relocation to take the position, they dodged.  Seemed like a fairly standard question since I would be coming from out of state and wanted to get a sense of what the competition was like.  No relocation assistance provided and new hires start at the bottom of the salary range, regardless of education level or experience.  A deal breaker and totally out of step with reality.", "Interview Questions": "Can you tell us how you managed a similar program in the past?"}], [{"date": "24 Feb 2018", "title": "Educational Program Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of New Hampshire", "Interview Descriptions": "Good. Was contacted within three weeks of submitting my application. Had two interviews that asked behavioral based questions like how I worked on a team and my knowledge of adult learning.  Was a positive experience.", "Interview Questions": "Understanding of and experience in Adult Learning best practices"}, {"date": "9 Feb 2018", "title": "Lecturer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I applied online. The process took 1 day. I interviewed at University of New Hampshire", "Interview Descriptions": "Skype: very general standard questions, with warning about low salary which was 31,00 5 years ago until we lecturers brought in a union to improve conditions.  Nothing really stands out.", "Interview Questions": "N/A"}, {"date": "21 Sept 2017", "title": "Lead Teacher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of New Hampshire (Durham, NH)", "Interview Descriptions": "Phone call, group interview with parents, teachers, and admin. There was also a lunch interview where teachers could stop by and ask questions casually. After the initial interview I called back for a sample lesson as well.", "Interview Questions": "How do you support families of various backgrounds?"}, {"date": "22 Dec 2017", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at University of New Hampshire (Durham, NH) in Sept 2017", "Interview Descriptions": "The interview was very pleasant and well structured. There were a lot of people that I had to talk to and each one made it very easy. I would recommend to anyone that applies.", "Interview Questions": "The questions were great. You can tell they take the position seriously. There were a lot of people that I had to talk to and each one made it very easy. I would recommend to anyone that applies. "}, {"date": "3 Oct 2017", "title": "Web/Graphic Designer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of New Hampshire in Aug 2017", "Interview Descriptions": "Phone interview then a scheduled face to face interview with over 10 people for 3 hours. Scheduling was done last minute and interview process was lengthy and included people who were defensive in body language. Manager with arms crossed during the entire interview, little to no eye contact. Other people brought in to ask questions did not seem to know what they were looking for or what the role would entail as far as responsibilities were concerned. There were very few questions asked, considering that there were three different meetings with roughly 10 different people, nobody could paint a clear picture on role responsibilities or what they were truly looking for. The entire process felt like a unproductive use of everyone's time. The role is now listed with different requirements which leads me to believe there was never a job opening in the first place.", "Interview Questions": "Do you use Mac or Pc"}, {"date": "9 Oct 2018", "title": "Undergraduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 1 day. I interviewed at University of New Hampshire (Durham, NH) in May 2017", "Interview Descriptions": "Varies from professor to professor. Generally the professor will ask you what your goals are and what you hope to get out of the research you want to conduct with them. They may also ask you about your technical background such as coding languages and previous coursework.", "Interview Questions": "Why are you interested in this area of study?"}, {"date": "30 Nov 2016", "title": "Registration Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at University of New Hampshire (New York, NY)", "Interview Descriptions": "Applied to job by emailing hiring manager after I heard that they were looking for a new employee at this position. Got a call for an interview and came in right away. Casual interview with the two people who I would be reporting to.", "Interview Questions": "How have you managed time effectively when there was a lot for you to do?"}, {"date": "27 Mar 2017", "title": "GPA Recalculation Team Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at University of New Hampshire (Durham, NH) in Oct 2016", "Interview Descriptions": "Brief interview that mostly went over roles and responsibilities at my former jobs. Strong emphasis on the applicants GPA, interviewer will take a hard look at your grades. Interviewed with assistant director of admissions.", "Interview Questions": "Have you ever held a leadership position? "}, {"date": "9 Nov 2016", "title": "Data Entry Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 1 day. I interviewed at University of New Hampshire in Sept 2016", "Interview Descriptions": "The interview process was just a phone call because they were looking to hire someone quickly. After I had a phone interview, I was offered the position. It took almost a week to get my background check officially done and then I started the next Monday", "Interview Questions": "background, experience, competency"}, {"date": "29 Oct 2019", "title": "Office Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at University of New Hampshire (Durham, NH) in Sept 2016", "Interview Descriptions": "One on One with the senior office Administrator and suite manager. Very casual and asked common interview questions. I was only 1 round of interviews and then was offered the job within a couple days", "Interview Questions": "what would you be a good fit for this position "}], [{"date": "24 Aug 2016", "title": "Project Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 7 weeks. I interviewed at University of New Hampshire (Durham, NH) in Apr 2016", "Interview Descriptions": "Was contacted via email by the hiring manager about one month after applying regarding the two dates they were conducting onsite interviews. It threw me as the position title has changed.   Onsite interview was scheduled for two weeks later onsite with a group of 4 people, lunch with hiring manager, and another group panel where only 1 showed up. Fairly easy. Nice group of people!\n\nWas told I would hear by end of week. Followed up by email the following week after not hearing anything, where I found out they had offered it to someone else.", "Interview Questions": "How would you handle someone who didn't want to upgrade their systems?"}, {"date": "15 Oct 2016", "title": "Building Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 3 weeks. I interviewed at University of New Hampshire (Durham, NH) in Mar 2016", "Interview Descriptions": "For this interview, I sent my boos my resume and said why I wanted to be promoted. Next, I had a one-on-one interview which lasted about a half hour. I then heard back about the position about a week or so later.", "Interview Questions": "Describe a situation where you had to display leadership in your previous role at Campus Rec."}, {"date": "9 Apr 2016", "title": "Technical Data Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at University of New Hampshire (New Durham, NH) in Mar 2016", "Interview Descriptions": "Phone interview with the HR person first. The questions from the HR person were not so difficult to handle and then a second interview with a technical person. The second stage was to test ones analytical ability and aptitude. But overall it was not a process too difficult to handle.", "Interview Questions": "Which roles are you not interested in?"}, {"date": "11 Apr 2016", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at University of New Hampshire (Durham, NH) in Nov 2015", "Interview Descriptions": "I was a student in a graduate program at the University of New Hampshire. The program coordinator for the program contacted me, and asked if I would like to work as an administrative assistant. I said that I would and pretty much had no interview questions after that", "Interview Questions": "My previous experience with social media"}, {"date": "7 Sept 2016", "title": "Assessment Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of New Hampshire in Nov 2015", "Interview Descriptions": "It was very informal and laid back. Three people from the department were involved, plus a executive VP of the whole group.  We met in an office, no board room table or formal presentation was required, they wanted to know about me, why I was looking to make a move and where I saw myself in 5 years.  The people here are very down to earth and realistic.", "Interview Questions": "Why do you want this job, what do you wish to contribute?"}, {"date": "11 Sept 2017", "title": "CFAR Adacemic Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of New Hampshire (Durham, NH) in Oct 2015", "Interview Descriptions": "After being recommended by a professor to apply, I emailed the Tutor Coordinator and received an application which I filled out and sent back, and was invited to interview. It was a group interview with myself and one other applicant, with each of us answering all questions.", "Interview Questions": "Why do you want to be a tutor?"}, {"date": "9 Jun 2015", "title": "Lab Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 5 days. I interviewed at University of New Hampshire", "Interview Descriptions": "Direct interview with the one of lead scientists for the project. Explained the work that I would be doing and asked why I was applying when I did. Took a brief tour of the lab space and brief overview of the equipment.", "Interview Questions": "How much experience did I have the various lab equipment."}, {"date": "19 Jul 2017", "title": "Student Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at University of New Hampshire in Jun 2015", "Interview Descriptions": "Hired through my teacher, he selected a couple of students who were performing well in the class and asked if they were interested in part-time employment. Described temporary assignment (part-time). Easy interview process. Accepted.", "Interview Questions": "Wage requirements. Level of interest in assignment. "}, {"date": "21 Jan 2017", "title": "Bus Operator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at University of New Hampshire (Durham, NH) in Apr 2015", "Interview Descriptions": "It was a short interview, I was asked basic questions about my driving experience, how I heard about the job, and I basically already had the job by the time I was at the interview.", "Interview Questions": "How long have you been driving?"}, {"date": "29 Aug 2016", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at University of New Hampshire (Durham, NH) in Apr 2015", "Interview Descriptions": "It was a friendly interview. They were interested in why i wanted to be part of the team and what made me \"tick\". I was a undergraduate student at the University of new Hampshire looking to get credits and experience. This was a great opportunity to work while taking classes.", "Interview Questions": "What is personality trait do you believe is best when working with a team."}], [{"date": "1 Mar 2016", "title": "Clinical Assistant Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at University of New Hampshire in Mar 2015", "Interview Descriptions": "Interview process was thorough yet welcoming. Everyone involved in the process was truly interested in finding the best candidate and getting to know my skill set. Faulty took time to meet me and for me to get to know their work as well.", "Interview Questions": "What I can bring to the University"}, {"date": "10 Dec 2014", "title": "Lecturer Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of New Hampshire", "Interview Descriptions": "I was referred by my supervisor from my previous job. It took them a long time to respond, but the person who interviewed me was the decision maker. It saved a lot of time, or say, no one from the department cared much about it. There was even a senior/half-employee kind of graduate student showing me around and attending the lunch. I honestly felt it was unpleasant and uncomfortable to have those two persons who interviewed me hit it off so well, chatting about their own campus life.", "Interview Questions": "The first question is slightly insulting and unnecessary. He asked me why you didn't find a tenure-track job this year. Sure I have a good reason--family relocation. And it was true. But why would he even ask that? Say I got a AP job at MIT, why would I apply this position and travel one extra hour from my home near MIT to meet him? The other questions are just about knowledge set and teaching philosophy. Nothing unexpected. "}, {"date": "17 Oct 2014", "title": "Resident Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at University of New Hampshire", "Interview Descriptions": "Class during Fall semester during which you are with a hall director or a member of reslife and you go through some leadership training. You learn great skills and work with amazing people, and through that and a couple of one on ones, they decide whether to hire you or not.", "Interview Questions": "How will you improve the social justice awareness of your community?"}, {"date": "1 Oct 2014", "title": "TA Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at University of New Hampshire", "Interview Descriptions": "Apply to graduate school. after acceptance, you may get an offer from department. otherwise contact department faculty to see if they have positions available. and then you should meet with them and discuss the research.", "Interview Questions": "Why this department? why unh?"}, {"date": "6 Feb 2016", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 3 months. I interviewed at University of New Hampshire (Durham, NH) in Oct 2014", "Interview Descriptions": "You talk to a professor who would like you to work for them in research and to teach. They sponsor you at the decision meetings and you get the job.", "Interview Questions": "Are you interested in doing this research?"}, {"date": "28 Jul 2015", "title": "Work Study - Registrar's Office Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at University of New Hampshire (Durham, NH) in Sept 2014", "Interview Descriptions": "The interviewing process was simple and smooth. I sent in my resume through the UNH jobs website and sent a follow up email. They got back to me the next week and set up an interview time. It was fast and efficient, they started training the next week. They had little binders for the work - study's to reference up front at the desks.", "Interview Questions": "Why should we hire you?\r\nWhat skills do you already have that you can bring to the table?\r\nWhat sets you apart from all the other applicants?"}, {"date": "22 Oct 2015", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at University of New Hampshire (Durham, NH) in Aug 2014", "Interview Descriptions": "Teaching assistantships are generally provided along with admission to the University. Each professor has a certain number of assistantships to offer their potential students, and the interview is essentially tied to your graduate school interview with your advisor. If he/she wants you to attend UNH and be apart of their lab, they will generally provide you with one of the TA spots they have available.", "Interview Questions": "There really wasn't an interview process associated with this job. The interview for this job was more or less contingent on your interview with your potential advisor."}, {"date": "11 May 2014", "title": "Basketball Coach Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at University of New Hampshire (Durham, NH)", "Interview Descriptions": "Very casual interview process taking a relatively short 3 weeks.  I was interviewed because of the mutual contacts and my recruiting network.  I spoke with HR and they gauged my interest in the position.  After I cleared that hurdle, I spoke with the assistant coaches who eventually backed me for the job.  Finally, I spoke with the HC who asked more recruiting questions than anything else.", "Interview Questions": "Do you want to be a head coach at UNH?"}, {"date": "11 Mar 2017", "title": "Librarian Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at University of New Hampshire in Mar 2013", "Interview Descriptions": "I did a Skype panel interview (about 5 people, direct supervisor and future coworkers) that lasted about an hour, most likely since they did not have budget to fly me in to interview.  There were a few technical difficulties, like I couldn't hear some of the panel members questions.", "Interview Questions": "How would you handle processing a box of random documents, where would you start?"}, {"date": "24 Oct 2017", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at University of New Hampshire (Durham, NH) in Feb 2013", "Interview Descriptions": "The interview went pretty smoothly. I interviewed with my current adviser who was pretty clam. The interview happened through Skype, and I was in a foreign country at the time. He asked me some basic questions about my background and interests.", "Interview Questions": "Are you interested in the are of my research and what is your current knowledge on that?"}], [{"date": "10 Apr 2015", "title": "Electrical Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of New Hampshire in May 2012", "Interview Descriptions": "It was very good. I learned a lot about what I was expected to do at UNH. It was straite forward. I was nervous but it went very well. I really enjoyed my job working at the University of New hampshire.", "Interview Questions": "How much engineering do tiy hace EE?"}, {"date": "13 Apr 2015", "title": "Librarian Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of New Hampshire in Apr 2012", "Interview Descriptions": "I was emailed about a month after submitting my application for a phone interview.  Had a Skype interview with a hiring committee of about five people, librarians and professors.  The interview lasted about forty minutes.  Was contacted within about two weeks and offered the position.", "Interview Questions": "If you were given a box of unknown archival documents, how would you go about processing them?"}, {"date": "4 Jun 2014", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at University of New Hampshire (Durham, NH) in Feb 2012", "Interview Descriptions": "I was accepted as a graduate student and one of the requirements was that I do research there was no other hiring or interview process. the graduate school application was the only sort of process that I had to go through", "Interview Questions": "N/A"}, {"date": "24 Aug 2015", "title": "Information Support Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at University of New Hampshire in Sept 2011", "Interview Descriptions": "Technical questions, structured......how would you fix this, tell me a time when. Sat down, chatted about myself, brought some of my certs. Just tried to impress people. It was easy", "Interview Questions": "Tell me a time when.....how do you fix x.......why do you wanna work here....."}, {"date": "9 Mar 2013", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 3 months. I interviewed at University of New Hampshire in May 2011", "Interview Descriptions": "got an email ; spoke over skype about my experience and projects.", "Interview Questions": "N/A"}, {"date": "4 Feb 2011", "title": "Executive Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 days. I interviewed at University of New Hampshire (Durham, NH) in Jul 2010", "Interview Descriptions": "The recruiter used was awful. After two phone interviews, he said he would take the candidacy further only if I submitted by most recent performance evaluations. I know this is common practice in certain professions, but it is not the case in advancement. I told the recruiter this and he said that his background was HR, and this is how he preferred to do things. I withdrew.", "Interview Questions": "N/A"}]]