[[{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 0, "Culture & Values": 4, "Diversity and Inclusion": 3, "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 3, "review_title": "So much potential!", "rating": "3.0", "reviewer_affiliation": "Former Intern, more than 1 year", "job_date": "2 Sept 2021", "job_title": "Intern in Long Beach, CA", "duration": "N/A", "pros": "LiNK's heart is 100% in the right place. If you are looking for dedicated teammates, look no further. Focus on the North Korean people and honest and earnest engagement with the public is in their DNA. Also, using technology efficiently to have a broad impact is inspiring and what so many other small nonprofits need.", "cons": "Organizational maturity is unfortunately still lacking even after many attempts to improve. I think it has nothing to do with care and everything to do with foresight and context.\r\n\r\nLiNK started out scrappy but unfortunately in many ways it has stayed that way. It is very common to hear \"this is the ways we do it\" when employees are being overworked without extra pay or encouraged to give a bit more. I understand at times this is necessary but unfortunately it doesn't have to always be this way.\r\n\r\nAfter my time at LiNK I've gone on to work for several organizations who challenged this idea and were good examples of not expecting too much of their staff. You really can have that passion and heart and get paid well and love your impact in the world. You can have it all!"}, {"Recommended": "N/A", "CEO Approval": "Yes", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 4, "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": 5, "review_title": "Great Place", "rating": "5.0", "reviewer_affiliation": "Former Intern, less than 1 year", "job_date": "26 Oct 2021", "job_title": "Anonymous Intern", "duration": "N/A", "pros": "Really making a difference here", "cons": "Expensive area to work as an intern"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "north korea", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "22 Dec 2021", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "everything is amazing i love it", "cons": "there are no cons to this company"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Internship? Yes Career? No", "rating": "2.0", "reviewer_affiliation": "Former Employee", "job_date": "21 Aug 2016", "job_title": "Graphic Design Intern", "duration": "N/A", "pros": "- Lasting friendships \r\n- Opportunities are there if you are self motivated\r\n- Inspires young people to always choose empathy and compassion \r\n- Positive work culture outside of upper management", "cons": "If you’re looking for your first internship, this is the place for you! If you’re looking for a well rounded career, this is not the place for you!\r\n\r\n- Distant and blissfully ignorant Vice President. \r\n- Disorganized and lack of accountability. I went to urgent care due to LiNK's inattentiveness, and had to pay.\r\n- Heavily relies on interns as their main source of labor. Interns expected to work overtime with no compensation. Constant turnover of interns and burnt out staff. All leads to an unsustainable structure. \r\n- No career path. No strategy to draw new talent and retain existing talent.\r\n- No pay. No stipend. \r\n- Constantly guilted and pressured to run errands (both during and outside of working hours) that were irrelevant, unethical, and counterproductive to internship goals because of the cause. Priorities vary among interns- I did not take out student loans to be fetching and driving people from the airport. It's called Uber. A service that you pay for."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Great Internship Program", "rating": "5.0", "reviewer_affiliation": "Former Intern, less than 1 year", "job_date": "19 Sept 2015", "job_title": "Donor Impact in Torrance, CA", "duration": "N/A", "pros": "Really view internship as a program that is meant to develop skills and not just help with small tasks. A lot of the work you do is just as important as full-time staff members. First few days of internship are very carefully planned to train all interns on LiNK history and the North Korean issue. Throughout internship they try to plan fun activities with interns.", "cons": "Still a growing organization so not all processes are fully in place. However, for their size they are still pretty well organized.\r\n\r\nLiving conditions are currently not optimal. It is nice that housing is provided, but the current house has 7 rooms and 4 bathrooms for 15-30 people. This is something they are working on though."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Great place to work", "rating": "4.0", "reviewer_affiliation": "Current Intern, less than 1 year", "job_date": "21 Jun 2018", "job_title": "Intern in Long Beach, CA", "duration": "N/A", "pros": "Amazing internship were you are valued as part of the staff. You get as much out of it as you put into it. Your manager also acts as a personal and professional mentor. They want to help you grow professionally and will have weekly check-ins with you to make sure you are meeting your work, personal, and career goals. Tons of networking opportunities. The office environment is fun and passionate. Everyone works hard because each person clearly understands how important their work is to the organization, interns included. Great work-life balance. The office encourages you to explore the city and try new things outside of work.  Honestly, if you want to learn about the North Korean issue, have an tangible impact making a difference at a nonprofit,  and hone your professional skills this is the internship for you.", "cons": "Knowing that there may not be a hiring opportunity at the end of your internship with the company."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Interning For a Great Cause", "rating": "4.0", "reviewer_affiliation": "Former Intern", "job_date": "16 Nov 2017", "job_title": "Anonymous Intern", "duration": "N/A", "pros": "Awesome work culture, engaging staff, a friendly environment.\r\nProvided housing and transportation\r\nLots of bonding events and excursions \r\nEducational and very thorough with up-to-date knowledge with a lot of resources around the world", "cons": "One full-time employee was known to be under a lot of pressure and prone to outbursts and treating other co-workers rudely - not sure if he's still there though\r\nUnpaid internship (but there were benefits)"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Grassroots Engagement Intern", "rating": "5.0", "reviewer_affiliation": "Former Intern", "job_date": "23 Apr 2018", "job_title": "Anonymous Intern", "duration": "N/A", "pros": "As a GE engagement intern, I was able to connect with Rescue Team leaders from all around the world to set goals and develop their teams to reach those goals. It never felt like typical intern \"busy work\", but work that was actually really important to the organization and their strategy. I felt like I had a lot of opportunities to learn from the staff and ask for career advice. I had a great relationship with my supervisor where I could easily ask her for help with my work, and when I asked her if I could sit in on staff meetings she happily obliged. I learned a lot about the situation in North Korea and the interns were given opportunities to learn in other settings, like attending panel discussions and exhibits on refugees. I really enjoyed my internship!", "cons": "I had a lot of work and became overwhelmed at times. However, my supervisor took that into consideration and hired more interns for the next term"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Management needs to clean its act up", "rating": "2.0", "reviewer_affiliation": "Former Employee", "job_date": "20 Aug 2016", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Good vacation policy, good work culture outside of management, you make friends there, work parties", "cons": "Non-competitive pay, management, frequent threatening of budget issues (layoffs, nonpayment, etc), often management is working on outside projects during company time"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 5, "review_title": "Some of the best 4 months of my life", "rating": "5.0", "reviewer_affiliation": "Former Intern, less than 1 year", "job_date": "3 Jan 2019", "job_title": "Intern", "duration": "N/A", "pros": "- Very worthwhile work - very rarely did mundane work, and even on the rare occasions that I had to do some less exciting tasks, I knew why I was doing it and why it mattered, which kept me well motivated.\r\n- Great work-life balance.\r\n- Continuing to grow, and it’s an exciting time to join the team.\r\n- Great collegiate atmosphere, and a young, vibrant team - former colleagues now close personal friends that I still meet up with regularly.\r\n- Felt very invested in as a colleague and individual - their motto is ‘people over politics’ and this human-focused approach applies internally to the staffers/interns/volunteers just as it does with their external partners.\r\n- Respects the resettled North Koreans and interacts with them as equals, as people with potential, not as those who are ‘less fortunate’ and so they have to ‘help’.\r\n- Amazing office facilities in Seoul", "cons": "- Internship too short! Wish I could have stayed for longer."}], [{"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Best job I've had so far", "rating": "5.0", "reviewer_affiliation": "Former Intern, less than 1 year", "job_date": "26 Sept 2015", "job_title": "Human Resources & Recruitment in Torrance, CA", "duration": "N/A", "pros": "This place has the most passionate, and driven people I've ever worked with. Working with them really made me realize what it means to be fulfilled by your job, rather than it being something just to make ends meet. I was allowed to work on several amazing projects, adding to my pool of experiences and got great, honest feedback. It was an incredible 4 months.", "cons": "Working at a small Non-profit, you have to be willing to take on multiple roles. Also, if you prefer a highly structured hierarchical work environment, the culture here may throw you off."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Best Job I Ever Had", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "12 Jan 2016", "job_title": "Regional Manager in Torrance, CA", "duration": "N/A", "pros": "I got to work with the most passionate, driven individuals that valued humanity every day. You were given the creative freedom to really grow your position and your department. Management always did a good job of supporting me if I did not know how to navigate certain parts of my job in the first few months. The organization embraces taking risks and understands that no great good can come out of doing the same things over and over again. I went into work every day, thrilled to be working, and I honestly have never felt that way about a 9 to 5 before.", "cons": "None that I can think of - I loved working here!"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "JUST APPLY ALREADY", "rating": "5.0", "reviewer_affiliation": "Current Intern", "job_date": "11 Dec 2017", "job_title": "Grassroots Engagement", "duration": "N/A", "pros": "Interning at LiNK is more than just an internship that will stand out on your resume. It is a whole experience. \r\nThe best part of working for LiNK is that everyday, you get to be a part of a movement that changes the world, in such a fun and cool way. \r\nI got to learn how to better engage with people, communicate with them in a more convincing way, and I was able to meet amazing people that I would have never been able to meet if it wasn't for this internship. \r\nYour life will never be the same after working for LiNK.", "cons": "LiNK spoils you so that you can't work for any other company anymore."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Great Internship", "rating": "5.0", "reviewer_affiliation": "Former Intern", "job_date": "25 Aug 2015", "job_title": "Intern", "duration": "N/A", "pros": "You will meet some of the most awesome people from all over the world. There's free housing and you'll be close to LA. The staff are also really great people as well. And you'll learn more about North Korea here than anywhere else.", "cons": "Unpaid internship unless you're a nomad where you'll receive a small stipend."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Amazing Opportunity", "rating": "5.0", "reviewer_affiliation": "Former Intern", "job_date": "10 Jan 2018", "job_title": "Anonymous Intern", "duration": "N/A", "pros": "My experience at LiNK is something that I'll be taking wherever I go.  Through the work that you do and the people you meet, you can't help but become super passionate about LiNK and the North Korean people. If you're on the fence about interning at LiNK, I would say JUST DO IT. You won't regret it!", "cons": "After interning at LiNK, it's hard to imagine myself working in a more traditional office setting."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 3, "Senior Management": 5, "review_title": "Great mission and culture", "rating": "5.0", "reviewer_affiliation": "Former Intern, less than 1 year", "job_date": "4 May 2016", "job_title": "Intern in Seoul", "duration": "N/A", "pros": "People are young, bright, kind, and passionate. \r\nMany of the benefits (flexible work hours, working off-site, unlimited day off, etc) for staff are also applicable to interns. \r\nMany great training opportunities. \r\nInterns get to be part of real projects that have important, lasting impact to the mission.", "cons": "It is an NGO, so don't expect the monetary compensation to match that of for profit organizations."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 1, "Senior Management": 5, "review_title": "Great cause; good food perks", "rating": "5.0", "reviewer_affiliation": "Current Intern", "job_date": "13 Dec 2018", "job_title": "Anonymous Intern", "duration": "N/A", "pros": "Open space concept; family oriented; celebration of every rescue missions; family/pet-friendly workspace; free breakfast from time to time", "cons": "salary is too low; interns are unpaid and yet overworked (minimally 40h/week)"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 5, "review_title": "4-5 Months Intern", "rating": "5.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "12 Feb 2016", "job_title": "Intern in Los Angeles, CA", "duration": "N/A", "pros": "Healthy, awesome work culture. My supervisor was like a mentor to me, gave honest and constructive feedbacks, respected my views, and taught me a lot. Feel valued working there and the people are a joy to be around. The office dogs are adorable.", "cons": "Could do with a little more structure, and paid internships."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Great people doing consistent work", "rating": "4.0", "reviewer_affiliation": "Former Intern", "job_date": "16 Jan 2019", "job_title": "Anonymous Intern", "duration": "N/A", "pros": "They take good care of the interns and make sure everyone gets involved. You will learn a lot while helping them bring about change. It's a good internship if you want to figure out whether nonprofit is right for you. Great open work environment.", "cons": "Unpaid but worth it for the experience."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Best Internship Ever", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "9 Jan 2018", "job_title": "Intern", "duration": "N/A", "pros": "The atmosphere is nice, even as an intern you feel like you're doing something important, open/laid-back environment, meet a lot of cool people", "cons": "If you're an intern, the intern house can get pretty packed/dirty depending on how many are in your intern class - but its free!"}], [{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 5, "review_title": "Amazing Internship", "rating": "5.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "2 Jul 2019", "job_title": "Intern in Long Beach, CA", "duration": "N/A", "pros": "Was wonderful knowing the work you were doing was for a great cause\r\nSmall team and everyone is very nice\r\nFree housing", "cons": "Its not paid but you get free housing and transportation so you just have to worry about food and personal care. Not too big of a con"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "LiNK", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "Great work culture. The non-profit cause they work for truly makes a difference in the world", "cons": "None that I can currently think of"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Development Internship", "rating": "5.0", "reviewer_affiliation": "Former Intern", "job_date": "21 Oct 2018", "job_title": "Anonymous Intern", "duration": "N/A", "pros": "Loved working here, thought that the environment was very supportive and loved being able to work with amazing and passionate people", "cons": "Sometimes felt like I could've been more useful and given more responsibilities"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Best Place Ever", "rating": "5.0", "reviewer_affiliation": "Former Intern, less than 1 year", "job_date": "5 Dec 2017", "job_title": "Intern in Long Beach, CA", "duration": "N/A", "pros": "Open work environment\r\nInterns valued like full time staff\r\nWorking for a great cause!\r\nFree housing and transport while interning :D", "cons": "House is kinda far from things to do outside of work"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Intern", "rating": "4.0", "reviewer_affiliation": "Former Intern", "job_date": "24 May 2016", "job_title": "Anonymous Intern", "duration": "N/A", "pros": "- Great vibe!\r\n- Supervisors care a lot about what interns learn\r\n- Office dogs\r\n- Free house, vans\r\n- Flexible work hours", "cons": "- Still young organization, so supervisors don't have that much experience.\r\n- Unpaid"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Awesome place to work at!", "rating": "4.0", "reviewer_affiliation": "Former Intern", "job_date": "6 Nov 2017", "job_title": "Anonymous Intern", "duration": "N/A", "pros": "highly motivated staff, working closely with the Director and CEO, entrepreneurial and vibrant work atmosphere", "cons": "sometimes had to work overtime, unpaid"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "BEST INTERNSHIP EVER!", "rating": "5.0", "reviewer_affiliation": "Former Intern, less than 1 year", "job_date": "26 Jun 2019", "job_title": "Marketing and Communications Intern in Long Beach, CA", "duration": "N/A", "pros": "You have the opportunity to work with passionate people on an incredibly meaningful movement.", "cons": "There aren't any  cons I can think of."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Internship", "rating": "4.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "2 Nov 2015", "job_title": " in Queens Village, NY", "duration": "N/A", "pros": "Great people to work with.", "cons": "Could be a pro: still a growing (small org), so things are not as stable and set."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 5, "review_title": "Nomad/Intern", "rating": "5.0", "reviewer_affiliation": "Former Intern, more than 1 year", "job_date": "20 Sept 2016", "job_title": "Anonymous Intern", "duration": "N/A", "pros": "Great cause, inspirational people, and fun growing environment", "cons": "Not enough available positions to move up and may work lots of overtime"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Overall good experience", "rating": "2.0", "reviewer_affiliation": "Former Employee", "job_date": "15 Jan 2016", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "direct responsibility and chance to learn from day one", "cons": "lack of employee development and support"}], [{"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 0, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 5, "review_title": "i t ' s o k", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "12 Jan 2017", "job_title": "Manager in Seoul", "duration": "N/A", "pros": "free food, free housing, great coworkers", "cons": "not allowed any contact with the outside world"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Good company to work for", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "10 Oct 2015", "job_title": "SRA in Bengaluru", "duration": "N/A", "pros": "work culture and amnesties in the company", "cons": "work load and peer pressure from the company"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Loved interning at LiNK!", "rating": "5.0", "reviewer_affiliation": "Former Intern, less than 1 year", "job_date": "21 Jan 2020", "job_title": "Intern in Long Beach, CA", "duration": "N/A", "pros": "Great people, great culture.", "cons": "Day-day operations can get mundane."}]]