[[{"date": "24 Jan 2023", "title": "Social Worker Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Tucson Medical Center", "Interview Descriptions": "Group panel interview with potential coworkers and director. Very friendly multidisciplinary group of folks including nurse case managers and social workers. Interview was held in an office just inside one of the entrances of the hospital itself.", "Interview Questions": "I was asked a lot of situational questions on how I would handle evolving cases and scenarios."}, {"date": "10 Aug 2022", "title": "Perioperative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Tucson Medical Center (Tucson, AZ) in Aug 2022", "Interview Descriptions": "The interview process was extremely easy and everyone was so friendly and welcoming.  One of the best interview process I’ve had to go through.  The staff was willing to answer any questions I had and were very open to the abundance of experience and opportunities within.", "Interview Questions": "Was I willing to take on an overnight shift?"}, {"date": "29 Apr 2022", "title": "Human Resources Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Tucson Medical Center", "Interview Descriptions": "HR contacted me and scheduled a phone interview.  At the scheduled time, no call was received.  Followed up with an email to see if something had come up and to see if they wanted to reschedule.  Still have not heard back from them", "Interview Questions": "None as they never called"}, {"date": "24 Jan 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Tucson Medical Center", "Interview Descriptions": "The interview process used a lot of experience based and situational questions, the manager gave plenty of time to ask any questions, tour of the unit was provided, met many different staff memebers throughout the process", "Interview Questions": "Why do you think makes you a good fit for this job? "}, {"date": "11 Oct 2022", "title": "Patient Care Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Tucson Medical Center (Tucson, AZ) in Jan 2022", "Interview Descriptions": "Met the manager of the unit, sat and talked about prior work. Manager asked what if situations and how I would work in certain environments. Then interviewed with a Tech I would be working with.", "Interview Questions": "What would you do if you had a disagreement with a patient? What would you do with a fall risk patient?"}, {"date": "27 Aug 2021", "title": "Food Service Associate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Tucson Medical Center (Tucson, AZ) in Jul 2021", "Interview Descriptions": "The interview was a video call I was asked if I had any relevant experience, and whether I would like to work in food preparation, or delivering meals to patients. I was told I would hear back from TMC on a day or two, but I never heard back from them.", "Interview Questions": "Do you have any relevant experience?"}, {"date": "25 Feb 2020", "title": "Human Resources Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Tucson Medical Center (Tucson, AZ) in Feb 2020", "Interview Descriptions": "You start with a phone interview. If they like you move along to in person interview. You meet with a panel then the manager. I got a call later that day to be hired and start the background check.", "Interview Questions": "Behavioral and situational questions."}, {"date": "3 Jul 2018", "title": "Clinical Nurse Lead Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Tucson Medical Center (Tucson, AZ)", "Interview Descriptions": "It was a 3 stage process.  I group interview with staff, 1 with management, and one with physicians.  It was very disorganized and they were scrammbling to find people to sit in on the interview on the day.  It was pretty unprofessional.", "Interview Questions": "If I felt that my disibility would interfere with my ability to do the job. (Seriously)"}, {"date": "14 Jul 2019", "title": "Patient Care Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 days. I interviewed at Tucson Medical Center (Tucson, AZ) in May 2018", "Interview Descriptions": "The interview process includes a brief summary of yourself and your accomplishments from the manager, followed by a peer interview by a nurse and a patient care tech in the unit you apply to.", "Interview Questions": "What would you do if you see a staff member or group member not doing their assigned task, how would you approach them, and what would you do to ensure that the task is completed?"}, {"date": "23 Aug 2017", "title": "New Grad Extern Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Tucson Medical Center (Phoenix, AZ) in Aug 2017", "Interview Descriptions": "Phone interview went well for first contact. Waiting for 2nd phone interview. Woman was very nice over the phone. The process is not finished for me yet. Fingers crossed. I'm trying to get into the surgical department.", "Interview Questions": "How have I handled past patients with difficult cases?"}], [{"date": "26 May 2017", "title": "Security Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Tucson Medical Center (Tucson, AZ) in May 2016", "Interview Descriptions": "I went for an interview at Tucson Medical Center one year ago and the person conducting the interview showed up late and he did not apologize for being late. During the interview he did not look like he was interested in the process. He was about 25 minutes late. When he did show up, I could tell just by the way he was behaving that I was not going to get the job. His attitude was really bad.", "Interview Questions": "Why are you applying for this job?"}, {"date": "15 Mar 2018", "title": "Emergency Department RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Tucson Medical Center (Tucson, AZ) in Apr 2016", "Interview Descriptions": "Skype interview with about 5 nurse managers from different departments in the hospital.  I was from out of town so they allowed me to interview via Skype. They were in a conference room and took turns going around asking questions. I specifically wanted the Emergency Department so I was sure to gear some questions specifically toward the nurse manager for the ED.", "Interview Questions": "Describe a time when you were faced with a difficult situation and how did you handle it?"}, {"date": "20 Oct 2017", "title": "EFDA- Dental Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Tucson Medical Center (Tucson, AZ) in Apr 2016", "Interview Descriptions": "The process was easygoing and lax. They were mostly testing reaction to situations and assessing if my personality would be a good fit for the group. The practical skills required are knowledge about DEXIS, WPM typing, and ambition", "Interview Questions": "Why do you want to work here? \r\nWhat do you see yourself doing 5 years from now? \r\nTell me a joke. "}, {"date": "29 Dec 2015", "title": "Monitor Technician Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Tucson Medical Center (Tucson, AZ) in Dec 2015", "Interview Descriptions": "Initial phone call was to set up in person interview. In person interview lasted 20 minutes. The questions very very simple. Job description only calls for a HS diploma or GED with no prior experience required. On the job description they require a Basic Life Support (BLS) certification, so either get that on your own before or call HR to make sure your app doesn't get denied for not having it. I hear it is easy to obtain if need be.", "Interview Questions": "What interests you about central monitoring?"}, {"date": "9 Mar 2016", "title": "Patient Care Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Tucson Medical Center (Tucson, AZ) in Feb 2015", "Interview Descriptions": "Quick, straight forward. The hiring manager was very nice and didn't make it feel too formal.  If you have the experience and are a friendly person than you will be fine. It was just a few questions that were very basic and none that tricked you.", "Interview Questions": "What experience do you have taking care of sick individuals?"}, {"date": "29 Apr 2015", "title": "IT Project Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at Tucson Medical Center (Tucson, AZ) in Nov 2014", "Interview Descriptions": "The interview process was a quick and pleasant process for a project coordination contract job. I conducted the interview with two Directors within the Information Systems department. Questions were pretty straightforward, a few of them were behavioral and some were asked to inquire more about my technical and business knowledge.", "Interview Questions": "A vast majority of our customers / colleagues are Subject Matter Experts within the Health Care industry. What approach will you take when working with these people in terms of gathering requirements, providing solutions, etc.?"}, {"date": "29 Aug 2016", "title": "Pediatric Occupational Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Tucson Medical Center (Tucson, AZ) in Feb 2014", "Interview Descriptions": "First you interview with the manager alone, then you come in for a group interview with the occupational therapy team. Everyone is very nice and inviting, however I recommend you do your research and be specific with your answers. Typically, the manager would call your back within 2 weeks to tell you if you are being offered the job or not.", "Interview Questions": "What are your interests in the field of pediatric OT?"}, {"date": "6 Oct 2017", "title": "Patient Relations Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. I interviewed at Tucson Medical Center (Tucson, AZ) in Jun 2013", "Interview Descriptions": "Met with Manager and another patient relations staff member from that department in the managers office. The manager had a series of questions and then the co-worker also had his set of questions, which I answered. It took about 30 minutes.", "Interview Questions": "Have you ever worked in Patient Relations"}, {"date": "20 Jun 2017", "title": "Patient Care Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Tucson Medical Center (Tucson, AZ) in Feb 2013", "Interview Descriptions": "The interview process was easy. I interviewed in person with the department manager, there were typical interview questions, nothing too crazy. We went over my resume, and went over the job requirements and at the end I received a job off.", "Interview Questions": "Why do you want to work in emergency medicine?"}, {"date": "13 Jun 2014", "title": "Business Systems Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Tucson Medical Center in Feb 2012", "Interview Descriptions": "Very easy hiring process.  Got a call from recruiter to see when i could come in for an interview.  I was called by a gentleman from HR within the next few days to give me my offer.  Do not be afraid to renegotiate the initial crappy salary offer.  TMC makes a great deal of money, they can afford to pay you more.  Orientation process is very typical as far as hospitals go.", "Interview Questions": "What is your biggest flaw?"}], [{"date": "7 Nov 2012", "title": "Nuclear Medicine Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Tucson Medical Center (Tucson, AZ) in Aug 2011", "Interview Descriptions": "I found this position at a job fair. I submitted my CV and was contacted 48 hours later. I went in for an interview...the Manager was in a bind, very rushed to find a replacement. His favorite tech (nepotism!!!) was going on vacation. the interview was rushed and strange in that i had to be interviewed by the 5 other techs...to see that I \"fit in\". this was obviously very judgmental and not based on my clinical abilities. Based on my responses and appearance, i was hired on the spot.", "Interview Questions": "The fact that I needed to be interviewed by staff peers as well as physician and manager was a surprise. In my long clinical career this has not aoccurred anywhere. generally it's up to the manager and or physician director to make a hiring decision."}]]