[[{"date": "12 Mar 2023", "title": "Patient Care Assistant (PCA) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at University Health System", "Interview Descriptions": "Interview process was straightforward they didn't ask unnecessary awkward questions which is nice. They get back to you in a timely manner. After you pass the interview portion of it you must go through drug testing and vaccine check there at their employee clinic. And then you go through a week of orientation", "Interview Questions": "What do you bring to our unit if you are offered the position"}, {"date": "2 Sept 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University Health System", "Interview Descriptions": "very friendly and patient. it was a two person interview and they were very welcoming. I liked how they made it very conversational. after the interview I shadowed a nurse for about an hour.  it was a great experience.", "Interview Questions": "how do you react to stressful situations"}, {"date": "26 May 2022", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at University Health System (San Antonio, TX) in Mar 2022", "Interview Descriptions": "Very slow interviewing process after initial interview and never follow up with potential employees. It would be much easier to let them be aware if there no longer in consideration than ghosting them.", "Interview Questions": "What is your biggest weakness"}, {"date": "14 Feb 2022", "title": "Registered Nurse Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at University Health System (San Antonio, TX)", "Interview Descriptions": "Overall the process was long and inefficient. You apply through HR, then go in person to interview with floor directors, after which you have to conduct a peer interview/shadow. Almost 1.5-2 months later you receive an offer if you are lucky to answer the HR phone call. Should you miss the phone call with an offer you’d realistically be waiting 3-4 months.", "Interview Questions": "Strengths, weaknesses, interest about the floor of choice, ways you overcome difficult patients or families, how others will describe you etc. "}, {"date": "7 Nov 2021", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 1 day. I interviewed at University Health System (San Antonio, TX) in Nov 2021", "Interview Descriptions": "Interviewed at a Job Fair. And they still treated you like you were the only one there. Very delightful experience. Got a job offer right away when I was done with the interview !", "Interview Questions": "What type of experience do you have?"}, {"date": "20 Jan 2022", "title": "Certified Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University Health System (San Antonio, TX) in Oct 2021", "Interview Descriptions": "Easy but hr took a very very long time, I when and shadowed a surgical tech to see what all my duties would be and they all were very nice and they really liked me", "Interview Questions": "When can you work?\r\nHow old are you?"}, {"date": "29 Jul 2021", "title": "Master Social Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University Health System", "Interview Descriptions": "It is a panel interview with the Mental Health director, Social Work Director, and Mental Health Coordinator.  They discuss the role and ask you about your experiences. They also ask about how well you work as a team member.", "Interview Questions": "How do you handle crisis?"}, {"date": "12 Jul 2021", "title": "Licensed Practical Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at University Health System (San Antonio, TX) in Apr 2021", "Interview Descriptions": "Interview was quick. They basically just talked about the position and asked if you had any questions. Nice and simple. They went over benefits as well. Best interview I ever had.", "Interview Questions": "What shift I would be interested in?"}, {"date": "22 Apr 2021", "title": "Administrative Associate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at University Health System (San Antonio, TX) in Sept 2020", "Interview Descriptions": "The interview process was new to me. I had a conference-style phone interview for about 45 minutes. This was the 1st round of interviews and it was with two individuals, the director, and their supervisor.", "Interview Questions": "Are you able to adapt to learning new technology?"}, {"date": "11 Aug 2020", "title": "Supply Chain Senior Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "The process took 4 weeks. I interviewed at University Health System (San Antonio, TX)", "Interview Descriptions": "Got an email from for a panel interview, there 2 material supervisors, the supply chain manager. The interview started went over my resume asked couple questions then the procurement director joined us which he was just wanted to be there so I was cut off from my interview to just have him set with us than I was answering the hiring manager question but he cut me while I was answering to joke about one of his colleague who wasn’t in the interview by saying “you don’t wanna be in his kingdom” hahah I was paused, shocked and lost my thoughts! I knew at that time there weren’t taking this interview seriously. They interviewed me for supply chain senior role but when they sent me the email to confirm my interview they put it as none senior which I found out that they created the new role to hire someone who would get paid less but doing the senior role. This was one of the awkward interview I have ever been.", "Interview Questions": "How many contract have you executed on your current role? How many contract have you executed in your whole career? How many contract have you executed yearly ?"}], [{"date": "26 Jan 2023", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at University Health System (San Antonio, TX) in Mar 2020", "Interview Descriptions": "Telephone call was conducted first, then Personal one on one interview was conducted, both parties had an opportunity to ask the questions. This happen during the job fair and multiple departments had their booths there.", "Interview Questions": "What was My previous work experience"}, {"date": "7 Sept 2021", "title": "Senior Administrative Assistant Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at University Health System (San Antonio, TX) in Dec 2019", "Interview Descriptions": "The call to get the interview was quick however I was called back about 2/3 months after my interview and I had taken a position within my company.  HR is difficult to get in touch with no one called me back after 3 times of reaching out to them to let them know I would be staying where I was.", "Interview Questions": "Pretty standard. Talking about previous positions and experience. Nothing out of the usual."}, {"date": "3 Oct 2019", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at University Health System (San Antonio, TX) in Sept 2019", "Interview Descriptions": "i saw on their website that they will have a job fair this September. I registered online and went. The interview is one on one and they told me that they will call back next week for the next interview.I got a call after 4 days to schedule for  the next interview. The next interview is 3 leaders in the room,they just ask about my previous job experience and then they let me wait outside the room.", "Interview Questions": "how you handle conflict with coworker"}, {"date": "21 Jun 2019", "title": "Medical Laboratory Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at University Health System (San Antonio, TX) in Jun 2019", "Interview Descriptions": "It was done in front of a panel of 4 people. They explained the job duties, and what was expected of me to do the job. They also showed me around the lab.", "Interview Questions": "Have you ever been in a situation where they were implementing a new policy?"}, {"date": "17 Mar 2019", "title": "Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at University Health System", "Interview Descriptions": "I received an email to schedule an interview. After I followed up three times an interview was scheduled. I showed up 15 minutes early, and the hiring manager had just left for another appointment. I followed up twice after that but never heard back. I was ghosted. It appears their hiring process in broken.", "Interview Questions": "I was ghosted, so I never got the opportunity to answer a question. "}, {"date": "5 Sept 2019", "title": "Patient Care Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University Health System (San Antonio, TX) in Feb 2019", "Interview Descriptions": "The interview process was average.  The interviewer made the interview relaxing and easy-going. The hiring process took a little longer than expected, but in the end, HR was helpful in guiding throughout the process.", "Interview Questions": "Where do you see yourself in five years?"}, {"date": "17 Dec 2018", "title": "Medical Technologist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at University Health System (San Antonio, TX)", "Interview Descriptions": "Panel-ish interview style with supervisor and two other employees. Interview started off normally, then the questions started getting...well...interesting. I don’t know if these questions were illegal to ask, but they made me uncomfortable and I’m rather glad I wasn’t chosen for the position. I guess the clinic was more concerned with hiring extroverts, but that’s just my opinion.", "Interview Questions": "Have you ever been late or have missed work because of child care issues?"}, {"date": "13 Dec 2018", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at University Health System (San Antonio, TX) in Dec 2018", "Interview Descriptions": "Basic questions, probably because its for a new grad or new nurse position but it’s good to always be prepared. Always smile and let them feel you’re going to be a good team member", "Interview Questions": "Basic questions, probably because its for a new grad nurse position."}, {"date": "27 Jul 2018", "title": "Coding Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at University Health System (San Antonio, TX) in Jul 2018", "Interview Descriptions": "I was given a coding test with 2 charts and access to resources to complete it.  Then I was in an informal interview with supervisor and coding educator.  It was very laid back and they were very nice.", "Interview Questions": " Is there anything that would prevent you from being here for the 3 month probationary period?"}, {"date": "14 Oct 2021", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University Health System in Apr 2018", "Interview Descriptions": "don't let anyone intimidate you or  tell you what you can or can not handle., no matter what they describe the work load or how the environment may be.  It was fast, the departments that need you most will defiantly contact you sooner than later. Thank you letters as well as cover letters help you make you look good even without the interview so highly recommend sending those in even if it isn't recommended.", "Interview Questions": "what was the reason you wanted to be in this field of work ?"}], [{"date": "31 Oct 2017", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University Health System (San Antonio, TX) in Oct 2017", "Interview Descriptions": "I applied online in August and got called for an interview October. The interview was that following week and by the next business day I received a call to offer me the available position.", "Interview Questions": "Tell me about yourself, something I wouldn’t know based on your resume. "}, {"date": "24 Jun 2017", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at University Health System", "Interview Descriptions": "The hiring process took about 3 weeks and it was a very smooth process. The interview was intimidating. It lasted about 3 1/2 hours. The group panel members were  easy to follow through though.", "Interview Questions": "How would you handle a difficult patient? Tell me about a time you have gone above and beyond your job description? What would you do if you encountered a difficult family member? Tell me about your experience."}, {"date": "21 Feb 2020", "title": "Staff RN CVICU Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at University Health System (San Antonio, TX) in May 2017", "Interview Descriptions": "You filled a behavior questions, they ask base on answer. Some pre determine questions and some common sense, \r\nProvide an example of when you have conflict with a physician.\r\nHow do you deal with difficult patient", "Interview Questions": "Team work, why university, what do you know about magnet hospital. PCC is direct manager who hires."}, {"date": "30 Jun 2017", "title": "Director of IT Infrastructure Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University Health System (San Antonio, TX) in Apr 2017", "Interview Descriptions": "Phone screen and then an in-person interview with all the IT directors at the San Antonio office.  It took several weeks to setup the interview and I was very flexible.  \r\n\r\nI showed up at the in-person interview after a 2-hour drive and taking 1/2 day off my current job.  I was greeted in the lobby by the admin telling me the directors were called away and could not meet.  No warning or advanced notice or even one of the directors to greet me in person.  She said they would schedule another interview and I have never heard back from them.\r\n\r\nI guess that process told me all I needed to know about the company as I expected much more from a community based health organization.  I hope they do not treat patients the same way.", "Interview Questions": "Phone screen was basic.  Just a review of background and experience.  "}, {"date": "29 Dec 2017", "title": "LVN Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University Health System (San Antonio, TX) in Jan 2017", "Interview Descriptions": "The interview was in two sections. A meet and greet at a job fair in the main hospital campus and then a tour around the jail. Then received a call with an offer about a week later.", "Interview Questions": "What made you choose corrections. "}, {"date": "22 Jul 2017", "title": "Field Engineer Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University Health System (San Antonio, TX) in May 2016", "Interview Descriptions": "This is a panel interview. Manager and five leads conduct the interview. Easy going environment, they take turns asking questions and taking notes. You'll know whether or not they like your answers.", "Interview Questions": "Why isn't this computer connected to the internet?"}, {"date": "10 Dec 2018", "title": "Phlebotomy Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at University Health System (San Antonio, TX) in Apr 2016", "Interview Descriptions": "Very simple. It took a while to hear back from HR after my interview. It was about 3 to 4 weeks total. I was given a tour the day of my interview and introduced to staff. I wasn't aware of the titles of the interviewers but it was simple and not stressful at all. Getting the badge was a little gracious once I was hired on but the call for the offer went well and HR staff I was very informative.", "Interview Questions": "Explain with scenario how you worked through a tough situation. "}, {"date": "12 Mar 2018", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at University Health System (San Antonio, TX) in Jan 2016", "Interview Descriptions": "Interview with panel of nurse manager/PCC and a few peers.  They ask you basic interview questions and questions prompted by a personality quiz you have to take.  Some clinical questions are asked depending on experience level and area you are applying to work in.", "Interview Questions": "Describe a time you gave excellent customer service."}, {"date": "17 Nov 2015", "title": "Accounts Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University Health System", "Interview Descriptions": "The first interview was with 2 people and they went over just a few questions and the assessment you must complete when applying. The second interview was a panel of interviewers about 5 people", "Interview Questions": "What are your long term and short term goals"}, {"date": "8 Dec 2015", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at University Health System (Parma, OH) in Nov 2015", "Interview Descriptions": "The whole process for applying, getting a phone interview and face-to-face interview was super quick. Everyone I came in contact with was extremely professional and friendly. The process was smooth and concise. They explained what to expect and there were no surprises. I love this place and cannot wait to begin working here.", "Interview Questions": "Why do you want to work here?"}], [{"date": "30 Sept 2015", "title": "Instrument Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 5 days. I interviewed at University Health System (San Antonio, TX) in Feb 2015", "Interview Descriptions": "Great, wonderful and positive. The Lord was on my side and everything was a piece of cake. It was a really easy going interview, and there wasn't much to it. This was one of the most great interviews I've ever had.", "Interview Questions": "Do you have experience?"}, {"date": "15 Oct 2015", "title": "ROI Specialist Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at University Health System (San Antonio, TX) in Feb 2015", "Interview Descriptions": "Once you are interview, it can take up to 20 days before they do a background check and you get all your labs done/results. The process can be long and you wish they can speed the process.", "Interview Questions": "No real questions asked outside the norm"}, {"date": "30 Oct 2015", "title": "Medical Records Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at University Health System (Newark, NJ) in Oct 2014", "Interview Descriptions": "The interview process was fine except for the length of time it took to receive the results of a background check. I was told it took longer because it was \"out of state\". I didn't understand that, but felt perhaps the manager used an out-of-state checking system. It was almost a month before I was able to begin work. I was told I would be working with patient charts, scheduling appointments on medical computer software, and confirming follow-up appointments via phone. This all sounded interesting.", "Interview Questions": "I was asked if I had any physical limitations since I would be reaching, bending, and lifting. "}, {"date": "3 Oct 2016", "title": "Systems Administrator Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at University Health System (San Antonio, TX) in Jun 2014", "Interview Descriptions": "I received a phone call about the interview, I was scheduled to meet and conducted an interview with the Director and two others of the Business Team. They asked multiple questions about my IT experience and asked some friendly question about my education and future.", "Interview Questions": "How long have I worked in IT?"}, {"date": "27 Jun 2014", "title": "Outpatient Customer Service Representative Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at University Health System (San Antonio, TX) in Jun 2014", "Interview Descriptions": "put in multiple applications over a 2 month period...finally got a call for a interview...was interviewed by 2 managers,,,lots of questions...said I would be notified in 2 wks if i got the job smh", "Interview Questions": "how would  you handle a difficult co worker"}, {"date": "14 Jun 2015", "title": "Data Security Administrator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University Health System (San Antonio, TX) in May 2014", "Interview Descriptions": "HR scheduled the first interview, which was with the department director. It lasted about an hour, and questions were general and seemed to be geared toward finding my personality. \r\nThe second interview was with the entire department, and consisted of two parts. The first part was personality/behavioral questions, while the second part was more technical IT security questions.", "Interview Questions": "What are some reasons that are acceptable for being late to work?"}, {"date": "16 Jan 2014", "title": "Staff Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at University Health System", "Interview Descriptions": "After submitting dozens of applications, initial communication from this organization came after a friend, who was just hired, recommended me to the manager. Interview process was very simple and generic, no surprising questions.", "Interview Questions": "There were no real unexpected or difficult questions, just very generic interview questions like  \"tell me about a difficult situation and how you handled it.\""}, {"date": "21 Dec 2017", "title": "Certified Pharmacy Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at University Health System (San Antonio, TX) in Jan 2014", "Interview Descriptions": "the interview process was very slow. i applied and with a month a received a callback. i had a interview within the same week. after the interview. it took about 2 months to finally start working.", "Interview Questions": "How long were you at your last job?"}, {"date": "7 Jun 2013", "title": "Nurse Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at University Health System", "Interview Descriptions": "Nothing unusal", "Interview Questions": "standard explain resume questions"}, {"date": "4 Nov 2015", "title": "Biomedical Equipment Technician Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 6 months. I interviewed at University Health System (San Antonio, TX) in May 2013", "Interview Descriptions": "Just a very brief phone interview asking me to verify that I had applied for the position and the hourly pay. It took a very long time for them to get back to me after I had submitted the application. Several times the position closed and reopened, so I had to apply for it multiple times.", "Interview Questions": "Basic interview questions like: Tell me about yourself."}], [{"date": "25 Mar 2013", "title": "Cath Lab Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. I interviewed at University Health System", "Interview Descriptions": "The Hiring and interview process is a joke. They put you through several different interviews and at the end of all the interviews if the Supervisor doesn't like you she will not hire you. She's a joke.", "Interview Questions": "N/A"}, {"date": "15 Jan 2013", "title": "IT Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at University Health System", "Interview Descriptions": "They used me to get their internal candidate promoted.  They never had any intention of hiring me.  Sounds like sour grapes, I know.  But after I met with their group, they posted a job opening for a lower internal job demonstrating that they promoted that person and were now backfilling it.  Sneaky government practices.", "Interview Questions": "They were most concerned about whether I would show up to work or be absent a lot.  Really?"}, {"date": "8 Aug 2015", "title": "Help Desk Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at University Health System (San Antonio, TX) in Jun 2012", "Interview Descriptions": "First interview is usually with the manager and maybe someone from computer training.\r\n\r\nThere is a second interview where you will be tested with a real phone call with a real question.  The people you speak to will be employee's at the help desk however.\r\n\r\nNothing to hard just be yourself and it will go okay.", "Interview Questions": "You will be asked basic questions about how you handle stress and angry employee's.  Prepare answers accordingly"}, {"date": "20 Dec 2015", "title": "Systems Administrator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University Health System (San Antonio, TX) in Mar 2011", "Interview Descriptions": "Department manager does not interview.  Senior admins interview.  They pick and tell the boss I live . I am currently managing my own IT business and attending college. I have been married 20 years. WE have 5 kids. WE have had pets for years. I worked in a pet store in high school. I am trustworthy and caring. I will love your furry friends while you are away - #FACT!", "Interview Questions": "What was your biggest challenge at your last job?"}]]