[[{"date": "17 Sept 2021", "title": "Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at One Degree (San Francisco, CA) in Aug 2021", "Interview Descriptions": "My experience is neutral simply because of the outcome. This interview was definitely very long and thorough. I believe all the right questions were asked in regards to them finding their ideal candidate. I know every question they asked I answered with intention and authenticity. I made it to their final final rounds, where I met with 5 individuals and they were all very very kind and great!! \r\n\r\nAs part of my values is transparency, I brought up a personal matter and shared what my start date might be due to this matter. I understood and knew that might throw them through the loop as the agency itself is going through transition YET they were kind and told me I’d hear back. \r\n\r\nI heard back and it was that I didn’t get the job. Felt a bit of frustration yet grateful for the opportunity and again understand it was just not the right timing. \r\n\r\nGreat org working on improving their culture and honestly great individuals.", "Interview Questions": "Lots of racial equality questions. \r\n\r\n"}, {"date": "9 Mar 2021", "title": "Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at One Degree", "Interview Descriptions": "The interviewing team was very thorough, and asked thoughtful questions. There was ample opportunity to ask questions of the team to assess fit.  Overall, I appreciated the way the interviewing team approached the interview process.", "Interview Questions": "There were several questions to assess mission alignment"}, {"date": "4 Mar 2021", "title": "Marketing Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at One Degree", "Interview Descriptions": "Phone Interview was standard get-to-know-you questions. A marketing assignment with examples. You then had to present your findings of the assignment. You didn't have much information to go on from, so you had to make a lot of assumptions (but then were dinged if your assumptions didn't make sense to them).", "Interview Questions": "Have you worked for non-profits in this capacity?"}, {"date": "17 Jul 2017", "title": "Marketing Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at One Degree", "Interview Descriptions": "The role was open at one point and I applied but never heard anything. 3 months later, they reopened the role and I applied again.  They reopened the role with exactly the old job listing (with the old dates)\r\n\r\nI had a nice chat with the head of marketing and we seemed to have a nice rapport. If anything, she seemed worried I was overqualified. It would have been a slight pay decrease but I was excited to contribute to something more meaningful that your average software startup.\r\n\r\nDidn't hear much from them, then out of nowhere, they wanted me to come in for an interview. That time didn't work. It sounded like we were going to chat the following week. Then I never heard from them again.\r\n\r\nI get the sense they are a very well meaning bunch of people but that overall organization is very poor there. I would advise caution to anyone applying there.", "Interview Questions": "Do you have google adwords experience?"}, {"date": "13 Feb 2017", "title": "Software Engineer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at One Degree (San Francisco, CA)", "Interview Descriptions": "I was contacted a month after applying and got a phone interview. I got a first interview which was over the phone. It was very basic and felt like a CS101 final exam where I was asked a lot of programming vocabulary questions. There was a coding challenge at the end where I had to write the HTML, CSS, and Javascript to create a page where a button that had a certain look and certain behaviors (it had to replicate itself). Ultimately since I have very little front-end experience and this was sort of a stretch job, I didn't get offered a second interview. Regardless of the outcome, I found the interview experience unpleasant because of its triviality.", "Interview Questions": "What does DRY stand for and what does it mean?"}, {"date": "24 Jan 2017", "title": "Senior Software Engineer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at One Degree in Jan 2017", "Interview Descriptions": "I cold-applied through their website because they had an application deadline, so I didn't try to find a connection for a referral. The highlight of the process was quick responses and communication at all points.\r\n\r\nI was scheduled for a 30 minute phone conversation, and expected a typical discussion about the role, the organization, and my experience and interests, with perhaps a few technical questions. What I got was over 20 rapid fire technical questions ranging from CSS to SQL, trivia to philosophical, and coding in a google doc. We went over time and I did not have a chance to ask questions about the organization.\r\n\r\nThe questions were not particularly hard, if somewhat outside what I could answer off the top of my head. But the attitude towards hiring displayed by this interview turned me off from continuing to consider this company or recommend it to friends.", "Interview Questions": "What's the difference between LEFT OUTER JOIN and INNER JOIN?"}], [], [], [], [], []]