[[{"date": "28 Jan 2020", "title": "Community Based Protection Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at UNHCR in Apr 2019", "Interview Descriptions": "Some Questions around the competencies mentioned in the job TOR which was 4 or 5 and general question about personal experiences which they asked a lot of details about the techniques and approaches used and they request details about implementation and challenges", "Interview Questions": "Elaborate about your field work experience "}, {"date": "19 Dec 2018", "title": "Senior RSD Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at UNHCR", "Interview Descriptions": "Panel competence based interview, with HR representative and 2 supervisors, they conducted the interview one week after I was shortlisted and passed the exam assessment.\r\nThe process took about one month after the deadline of the vacancy till the interview process.", "Interview Questions": "Describe a situation when you have criticized and what did you do?\r\nDescribe a situation when you have to deal with tight deadlines?\r\nHow's your qualifications and experience is relevant to this position?"}, {"date": "24 Jan 2021", "title": "Senior RSD Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at UNHCR in Dec 2018", "Interview Descriptions": "You apply through the website and then called for a written test which is mostly a case which requires eligibility examination and then afterwards was sent an email with the interview date and time and then the interview is for thirty minutes of five questions", "Interview Questions": "5 questions, one on background, two situational and two technical questions"}, {"date": "28 Sept 2018", "title": "Protection Assistante Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UNHCR", "Interview Descriptions": "I applied online with p11 form and a motivational letter and after a month i was invited to a written test, it took around two weeks to be invited to an interview", "Interview Questions": "the test was 4 questions mainly about the Unhcr mandate"}, {"date": "11 May 2016", "title": "Community Service Associate Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at UNHCR", "Interview Descriptions": "I applied online for Communication Service Associate position in UNHCR, I got an email telling me I was shortlisted after 4 weeks and to prepare myself for a written test in 1 week, I am waiting the exam,so I read the reviews to have an idea about what to expect and I am looking for materials to read", "Interview Questions": "Of my point of view, I think it will be an overview of the UNHCR work in my country and the challenges they are facing"}, {"date": "20 Jan 2016", "title": "Senior Protection Associate Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through a staffing agency. The process took 7 weeks. I interviewed at UNHCR (Cairo, Cairo Governorate) in Jan 2016", "Interview Descriptions": "I have been attended the interview it was 6 questions most of them need someone who is working in the position to be  able to answer the questions properly ,read more about the  natural of UNHCR role in Egypt", "Interview Questions": "What is the challenges of UNHCR working in Egypt? And what is my view to overall ?"}, {"date": "24 Jan 2017", "title": "Protection Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at UNHCR (Cairo, Cairo Governorate) in Jul 2015", "Interview Descriptions": "You apply through online site. If you are shortlisted you shall pass a written technical exam and then an interview with a panel of at least 3 persons including 1 HR staff. It takes long time, 2 to 6 months sometimes. It takes 45 minutes. People are usually kind  and this doesn't mean that they like you or will definitely choose you. The interview is usually composed of competency questions however it may include technical questions (direct or in scenario form).", "Interview Questions": "Written test:\r\n- What are the persons of interest concerns?\r\n- What is SGBV (definition and forms)?\r\n- Speak about tools of SGBV prevention and response?\r\nInterview questions are competency questions:\r\n- Where do you see yourself in 5 years?\r\n- Why you see yourself the best candidate for this post?\r\n- Tell us about a situation when you completely failed to finalize your task. \r\n- Scenario questions as:  what if you had to choose between serving an applicant (with a serious concern) or go to a meeting with the representative?"}, {"date": "19 Oct 2017", "title": "Senior Resettlement Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at UNHCR (Cairo, Cairo Governorate) in Jul 2015", "Interview Descriptions": "First I applied online with a P11 Form and a cover letter. Then I received an invitation for a written test (technical test). Finally the was an in-person interview (mostly personality quistions).", "Interview Questions": "Why do you think you're a great fit for this post?"}, {"date": "10 Mar 2015", "title": "Senior Protection Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UNHCR", "Interview Descriptions": "Received a phone call told me that the test date ,the test was five questions , it was editorial Test contain how to perform the requirements of the position , easy questions for anyone who know what he will do if works in this field , of course the answer in this test was in English", "Interview Questions": "What are the rules of the organization's work in Egypt?"}, {"date": "24 Mar 2011", "title": "Protection Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at UNHCR (Giza) in Aug 2010", "Interview Descriptions": "It was a good experience, I had a a panel interview followed by one hour written exam which was very difficult. One of the exam questions was as follows:\r\n\r\nIn your own words and according to your understanding, can you briefly explain the following terms:\r\nRefugee and Asylum Seeker, Unaccompanied Minor, Sex and Gender Based Violence and Durable Solutions", "Interview Questions": "In your own words and according to your understanding, can you briefly explain the following terms:\r\nRefugee and Asylum Seeker and Unaccompanied Minor"}]]