[[{"date": "30 Oct 2022", "title": "Resident Assistant (RA) Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Marshall University", "Interview Descriptions": "Both interviews were conducted via zoom, with the first being an individual interview with a panel of individuals and the second being a group interview. For the individual interview, the group asked questions in the form of \"tell me about a time when you...\". In the group interview, a moderator would ask some trivial question and ask the group to discuss them.", "Interview Questions": "Tell me about a time when you were wrong about something and fixed it. What were you wrong about, and what did you do to fix it?"}, {"date": "3 Mar 2018", "title": "Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Marshall University (Huntington, WV) in Aug 2017", "Interview Descriptions": "Normal Interview process. First fill the application form online and then  Go and directly meet the Employer for interview schedules. All the GA's are very helpful and they help me to get the employer.", "Interview Questions": "1. Tell me something about yourself?\r\n2. Why you interested in teaching?\r\n3. Which subjects you like to teach and why?\r\n"}, {"date": "6 Apr 2019", "title": "Resident Advisor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Marshall University (Huntington, WV) in Mar 2017", "Interview Descriptions": "3 step interview. One on one interview with an RA. Panel interview where RAs watch you respond to an issue with a group of applicants. One role play scenario where you respond as if you were the RA.", "Interview Questions": "What is your definition of diversity?"}, {"date": "14 Jun 2017", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Marshall University (Huntington, WV) in Nov 2016", "Interview Descriptions": "I was selected to this job based on my communication skills and Academic GPA. While I was searching to find a job on-campus I walked into the dean's office where I had met my employer, and handed over my resume and spoke well about my abilities to do a job like this. And my employer got impressed and had sent a request to one of my professors for an opinion, and upon a positive reply from him about my capabilities, they got me hired for this job.", "Interview Questions": "Why should we hire you?"}, {"date": "30 Jun 2019", "title": "Recruiter Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Marshall University (Huntington, WV) in May 2016", "Interview Descriptions": "I submitted a resume and transcripts online and completed a review with a staff member. Later they scheduled  a one-on-one interview with the director of the department who went over my credential and relevant experience. The interviewer was pleasant and attentive and got right to the heart of the matter.", "Interview Questions": "What makes you most qualified for this job?"}, {"date": "2 May 2018", "title": "GA of Facility Operations Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Marshall University (Huntington, WV) in Apr 2016", "Interview Descriptions": "It was a fairly quick process. We first had a phone interview, after that I moved on to the skype interview, after that  I was invited to campus for an in-person interview.", "Interview Questions": "Why do you feel like you're prepared to work this position?"}, {"date": "3 May 2016", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Marshall University (Huntington, WV) in Feb 2015", "Interview Descriptions": "Very relaxing environment. Two supervisors asked friendly and easily answered questions. Supervisors made me very comfortable when interviewing and understood that I was nervous. Felt as though I was speaking to a friend.", "Interview Questions": "Where do you see yourself in about three years?"}, {"date": "28 Apr 2014", "title": "Professor Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 months. I interviewed at Marshall University", "Interview Descriptions": "I had graduate from the department where I interviewed.  I taught a class that was attended by most of the current professors.  I then interviewed with all the staff members individually and/or in small groups.  I was interviewed in October, but didn't get an offer until right before Christmas break for the university.  I was supposed to start at the beginning  of January for the Spring semester.  In the offer letter, I was given a limited number of days to respond, all of which the Dean's office was closed. The chair of the department assured me that I would be able to start on time, but it was a very frustrating time.", "Interview Questions": "The questions were in line with what would be expected for this type of interview.\r\n"}, {"date": "6 Dec 2013", "title": "Front Desk Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Marshall University", "Interview Descriptions": "Temporary employee so did a 1/2 day trial.", "Interview Questions": "N/A"}, {"date": "20 Aug 2014", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 3 days. I interviewed at Marshall University (Huntington, WV) in May 2013", "Interview Descriptions": "Very easy process. I sent my application and I was called the day after for an in-person interview. The process was very easy and the interview was actually more a conversation than an actual and formal interview.", "Interview Questions": "Tell me about your experience in the field"}], [{"date": "7 Dec 2014", "title": "Resident Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Marshall University (Huntington, WV) in Nov 2012", "Interview Descriptions": "Easy application. Segmented Interview process. You're put into a room with other applicants and split into groups. You will have a Large group interview, small group, and individual. Large group is problem solving, small group is more problem solving, and individual is like a traditional interview. You are asked questions about your experience, reactions to certain issues, and gauged on your energy and commitments.", "Interview Questions": "What does diversity mean to you?\r\nWhat is leadership to you?\r\nWhat would you consider your major weakness?"}, {"date": "19 Nov 2015", "title": "Locksmith Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Marshall University (Huntington, WV) in Apr 2012", "Interview Descriptions": "You're interviewed by at least eight other people. Each takes a turn asking a question. Most of the interviews are very casual. Each level of management is represented. All questions asked are based on the job that is applied for. After interview is done they have the person fill out paperwork and tell them they will call with news.", "Interview Questions": "How do you address workplace confrontations"}, {"date": "19 Sept 2015", "title": "Associate Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. The process took 3 days. I interviewed at Marshall University (Huntington, WV) in Apr 2011", "Interview Descriptions": "Submission of currioculum vitae.  Telephone interview.  Travel to University to meet with faculty and management. Tours of campus, classroom facilities, and city.  Education and teaching experience.  Collegial situations and outcomes.", "Interview Questions": "Competencies"}]]