[[{"date": "18 May 2023", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at ChristianaCare (Newark, DE)", "Interview Descriptions": "2 part interview process. It was fine. Required interview with other manager colleagues. Then had to return for interview with manager that I would report to. I got the job.", "Interview Questions": "Typical behavioral interview questions requiring examples"}, {"date": "11 May 2023", "title": "PCT Patient Care Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at ChristianaCare (Newark, DE) in May 2023", "Interview Descriptions": "Very nice location short interview beautiful campus. Not sure why instructed to wear a suit being in nursing...but great description of the position and nice nurse manager! Excited to see what is to come", "Interview Questions": "Tell me about yourself please"}, {"date": "26 Apr 2023", "title": "Project Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at ChristianaCare", "Interview Descriptions": "They called me to ask about my interest. Then they emailed me asking the same question. Then they ghosted me. When I followed up, they asked me the same question for a third time before getting a standard rejection email from the same person.", "Interview Questions": "Are you still interested in this role?"}, {"date": "25 Apr 2023", "title": "Senior Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at ChristianaCare", "Interview Descriptions": "The first interview was on-demand, recorded virtual q&a session. The program was easy to use. The second round was a traditional interview (done virtually) with the hiring manager. I did not progress past this round, but based on discussions it sounded like there would be additional interviews and a case / consulting project.", "Interview Questions": "Why do you want to work at ChristianaCare?"}, {"date": "7 Feb 2023", "title": "Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at ChristianaCare", "Interview Descriptions": "Process went smoothly. HR communicated clearly and quickly. Interviewers and staff were very professional. An offer came once all steps were completed. Post interview follow up with HR and interviewers went well.", "Interview Questions": "What are your strengths and weaknesses"}, {"date": "16 Aug 2022", "title": "Certified Nursing Assistant CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at ChristianaCare", "Interview Descriptions": "Started reaching out by emails..great customer service and follow ups..let me know I never left a phone number lol was very understanding. I'm really ready to start my career with Christian care", "Interview Questions": "Why did I choose a career in medical field "}, {"date": "22 Jun 2022", "title": "Certified Nursing Assistant CNA Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at ChristianaCare (Newark, DE) in May 2022", "Interview Descriptions": "It was calm . The person that was interviewing me was very nice and was asking me simple questions I could answer. The interview process lasted about 30 to 45 min., yes it was nerve racking but you gotta show how confident you are while you are being interviewed", "Interview Questions": "Why did you pick this career choice? How would you describe yourself ? "}, {"date": "1 Apr 2022", "title": "Human Resources Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at ChristianaCare (Newark, DE) in Apr 2022", "Interview Descriptions": "Applied for position two weeks later received an email from recruiter requesting a phone screening. Phone screening was basic question. Getting to know your work history, your salary expectations, computer skills. Then it is provided to hiring manager. If manager is interested your informed of an interview.", "Interview Questions": "Why did you choose to apply for this position? Why would you want to work for hospital? What are your strengths?"}, {"date": "22 Jun 2022", "title": "Sr. Research Associate Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at ChristianaCare (Wilmington, DE) in Apr 2022", "Interview Descriptions": "Process: I applied for the position in Feb 2022 and had a brief HR phone meeting  in March followed by a zoom meeting in April. I received final notification at the end of May (I had already accepted a different position elsewhere so their decision had no impact) \n\nThe HR screening went well- questions included my experience working with multiple populations, public health interventions, evaluation experience, my interest in the position and in CC in particular. Whether I would be willing to relocate. I was also asked about my years of research experience and education before they inquired about my desired salary (these were  among the first questions- I asked them for their range instead of giving a number first). I was asked to email my CV and writing samples after the meeting with HR. They provided the benefit information by email before scheduling the zoom meeting with the team. \n\nThe 60 min zoom meeting included three team members and I was asked to present a study I had conducted in 10 min. The meeting felt rushed and uncomfortable with team members interrupting each other. It was also awkward with the team not seemingly having answers to basic questions about the position I was interviewing for and explaining concepts for which I have degrees in. The team seemed disinterested in my presentation and to be honest, at that point, I knew I would not want to work there even if offered the position. Other questions included my education, work experience, experiences working with diverse populations, research and evaluation experience. I was told I would hear from them in a few weeks and I forgot to withdraw my application.", "Interview Questions": "What are your salary expectations? \n\nWhat experience do you have working with diverse populations? \n\nWhy Christiana Care? "}, {"date": "2 May 2022", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at ChristianaCare in Mar 2022", "Interview Descriptions": "Interview process was easy. Applied online through their website, submitted recommendations, received an email for interviews that were virtual videos, submitted my floors of interest, received my next email regarding availability for interviews with the nurse managers on the available floors", "Interview Questions": "Why did you choose to interview on this unit?"}], [{"date": "8 Feb 2022", "title": "Nurse Residency Program Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at ChristianaCare", "Interview Descriptions": "Video interview first via Hirevue which consisted of recording answers to 6 pre-selected questions. Easy questions but make sure you have a script ready just in case. You can re-record your answers as many times as you want.", "Interview Questions": "Why do you want to be a nurse?"}, {"date": "9 Dec 2021", "title": "Nurse Residency Program Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at ChristianaCare (Newark, DE) in Nov 2021", "Interview Descriptions": "Online application\nSelf-recorded initial interview - about 3 minute answer period for question prompts, ability to re-record if you are unhappy with your answers.  \nLive, online follow-up interview lasting about 45 minutes with members of the unit(s) who are considering your application", "Interview Questions": "Are you available to work all shifts, especially overnights?"}, {"date": "20 Nov 2021", "title": "Human Resources Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at ChristianaCare (Wilmington, DE) in Oct 2021", "Interview Descriptions": "It wasn’t difficult but there was not a lot of communication. I was asked twice to let them know if I got another offer during the process. I did and sent them a message, and they never responded. I was surprised to be ghosted after three interviews. Very unprofessional.", "Interview Questions": "What are your strengths and weaknesses?"}, {"date": "2 Nov 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at ChristianaCare in Aug 2021", "Interview Descriptions": "Interview with the Director of my department. Had one phone interview and then main interview was on Teams. The majority of the questions were directly related to the position I was interviewing for. There were also questions about relating my current position to the future position I now hold. My interviewer was very easy to talk to and alleviated any anxiety right away.", "Interview Questions": "Why I was interested in making a change after 20 years at the bedside with ChristianaCare"}, {"date": "10 Dec 2021", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at ChristianaCare in Jun 2021", "Interview Descriptions": "Video recording interview with some written responses. For recording responses, you can record again if the first response did not work out. Don't panic just try one more time. Total of 30 minutes. Then, I had an interview with the department head. The whole process is very friendly and casual.", "Interview Questions": "Tell me about yourself.\nWhy do you want to work at ChristianaCare?\n"}, {"date": "8 May 2021", "title": "Nurse Residency Program Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at ChristianaCare", "Interview Descriptions": "Application process was simple. They didn't require anything 'unusual'. You do have to upload your transcript and have 3 people complete references for you. After application, invited for a pre-recorded. If selected by a specific unit, interview and zoom interview with selected department.", "Interview Questions": "- Why did you choose nursing as a career path?\n- What causes you to be interested in the Christiana Care Health System Nurse Residency programs?\n- We all have had a time when we just couldn't get everything done on time. Tell me about a time when this happened to you?\n- Tell me about a time when you entered into a room to complete an assessment and the patient/family wasn't helpful? (No eye contact, non-verbal, ect.)\n- Often at work, as in school, you will need to work as a team to meet the needs of our patients. Please describe a time where teamwork was lacking and what you did to address it?\n- At CCHS, our Professional Practice Model adopts the philosophy of relationship based care. Relationship-based care centers on promoting a healthy and healing environment. Share with us how you could contribute to creating a healing environment for your patients."}, {"date": "18 May 2021", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at ChristianaCare", "Interview Descriptions": "Had to interview with several people for Per Diem RN. Had to F/U when I didn't hear back promptly. Glad I followed up. Misrepresentation on the electronic former employee referrals. CCHS allowed me to clarify.", "Interview Questions": "How did I feel about Magnet hospitals"}, {"date": "13 May 2021", "title": "Registered Nurse Resident Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at ChristianaCare", "Interview Descriptions": "-virtual interview where you record your answers\n-interview with nurse manager if you are still being considered - 3 members of the unit (nurse manager and clinical leaders/assistant managers), situational questions, questions about you, description of program", "Interview Questions": "Q: why did you become a nurse"}, {"date": "13 Feb 2021", "title": "Human Resources Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at ChristianaCare", "Interview Descriptions": "The talent recruiting staff was very professional. The entire process was well organized. My point of contact  kept open communication. Treated with respect at every step. Impressive introduction to an outstanding organization.", "Interview Questions": "Followed a behavior based interview process. "}, {"date": "5 Nov 2020", "title": "Data ENTRY (REMOTE) Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at ChristianaCare (Chicago, IL) in Nov 2020", "Interview Descriptions": "I applied online and Was scheduled for an interview. \r\nIt was conducted Entirely by text. Interviewed by an attorney who was experienced based on my linked in search. But who knows for sure when you only do a text interview.", "Interview Questions": "Why I would be a fit\r\nWhether I could perform duties\r\nStrengths\r\nHow friend would describe me"}], [{"date": "28 Jun 2023", "title": "PCT/CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. I interviewed at ChristianaCare in Nov 2020", "Interview Descriptions": "Hard and competitive and difficult questions that make you think twice before you respond. Questions make you feel the need to answer with multiple answers to ensure you'll have the means to perform the job duties", "Interview Questions": "What can you do to make christiana a better hospital Why do you feel like you'll make a good employee How will you ensure you show the ability to perform your job duties all while Promoting christianacares motto which is serving with \")ove and excellence\" in all of your job duties to your co workers, patients, and family members. How will you promote that in your days work if hired at christana care"}, {"date": "26 Aug 2020", "title": "Nurse Residency Program Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at ChristianaCare in Jul 2020", "Interview Descriptions": "I first had a series of 12 virtual, video-based questions that were pretty generic and related to Christiana's core values. About a month later I interviewed with a nurse manager.", "Interview Questions": "Describe how your clinical, volunteer, and professional experiences have prepared you for this position"}, {"date": "6 Apr 2021", "title": "Food Service Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. I interviewed at ChristianaCare (Wilmington, DE) in Jun 2020", "Interview Descriptions": "Didn’t apply through the company, applied through a temp agency & got hired on 3 months later. No interview required. Job agency is Aerotek. Nice job with beautiful spirits around.", "Interview Questions": "How well do I work with others?"}, {"date": "13 Mar 2020", "title": "Registered Nurse Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at ChristianaCare", "Interview Descriptions": "Recorded interview questions and submitted. A few weeks later had a face to face interview. Very positive experience. Not an intimidating interview. Asked normal interview questions and answered any questions I had without hesitation.", "Interview Questions": "Why did you choose nursing"}, {"date": "23 Sept 2020", "title": "Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at ChristianaCare (Newark, DE) in Mar 2020", "Interview Descriptions": "The interview was nice and friendly. Both times I was for sure I was a good fit but unfortunately never heard back.  I wish the company would do some sort of follow up even if you don’t get the position instead of leaving candidates wondering.", "Interview Questions": "Tell me why you want to work for this company? "}, {"date": "5 Feb 2020", "title": "Exercise Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at ChristianaCare (Wilmington, DE) in Jan 2020", "Interview Descriptions": "After applying to the position online, I was contacted through email the following day to set up a teleconference with someone from HR. The phone conference was scheduled for the following week and lasted about 20 minutes. She asked me about my clinical experience, scenario-based questions, about my availability, and allowed me to ask any questions that I had about the position. At the end of the phone call, she informed me that I should be contacted by the end of the following week to schedule an in-person visit to the clinic. The phone call took place on a Friday.\r\n\r\nThe following Monday, I received an email from the clinic director asking me to set up a time to visit the clinic and meet the staff. I was available Tuesday morning, so I went in the next day. The clinic director gave me a tour of the clinic, introduced me to all of the therapists and other technician, then went to his office for an interview. He asked additional questions that went in depth about my past clinical experience, asked what I love most about the job, my future plans, why I want to work for the company, and what sets me apart as a candidate. I finished up the visit by shadowing the therapists and technician on the treatment floor for about 30 minutes.\r\n\r\nFrom there, the clinic director said that he would reach out when he came to a decision.", "Interview Questions": "Tell me about a time you were about to help a patient or contribute to their care in a positive way that left you feeling proud."}, {"date": "15 Nov 2019", "title": "Nurse Resident - ER Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at ChristianaCare", "Interview Descriptions": "The interview was short, however the questions asked were very beneficial! They asked many questions about previous experiences. Definitely important to bring multiple copies of your resume because you will be meeting with multiple people", "Interview Questions": "Why did you pick the Emergency Department?"}, {"date": "28 Oct 2019", "title": "Research Assistant Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at ChristianaCare in Aug 2019", "Interview Descriptions": "I had two interviews. One phone screen by an HR representative and one in-person interview with the main boss/future coworkers. Simple enough and quick in response time for setting up the interview.", "Interview Questions": "Why Christiana Care? "}, {"date": "29 Apr 2019", "title": "Patient Care Technician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at ChristianaCare", "Interview Descriptions": "Applied online, had to answer questions online via video then was called to schedule an in person interview.  Via video you would have about 30 seconds to read a question then you had to record your answer, you could record for up to about two minutes. You did not have much time to think.", "Interview Questions": "Why do you want to work at Christina Care "}, {"date": "9 Mar 2020", "title": "Process Engineer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 3 months. I interviewed at ChristianaCare (Newark, DE) in Nov 2018", "Interview Descriptions": "It is pretty straight forward. Starting with the HR and then a phone interview with the department. You might be invited to a visit after if they are interested. They probably will ask you to have a presentation and meet a couple of people. After that, you can expect an offer.", "Interview Questions": "Previous work experience, examples of previous projects. Expectations, how do you see yourself in the next couple of years. "}], [{"date": "2 May 2022", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at ChristianaCare (Newark, DE) in Oct 2018", "Interview Descriptions": "They asked standard and generic questions including tell me about yourself, what are your strengths and weaknesses, why did you apply for this job and what makes you a qualified candidate for this role", "Interview Questions": "They asked tell me about yourself"}, {"date": "13 Sept 2018", "title": "New Grad RN Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at ChristianaCare", "Interview Descriptions": "There was a video interview  and a phone interview.  The video interview was not live. It was recorded. There were practice questions like what makes you a good fit for Christiana Care and what was the most difficult situation you ever had to deal with and descrive how you dealt with a difficult patient?", "Interview Questions": "Describe an incident of conflict or tension with a coworker and how you resolved it."}, {"date": "3 Nov 2019", "title": "Marketing Director Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at ChristianaCare (Christiana, DE) in Sept 2018", "Interview Descriptions": "Initial phone interview request by recruiter/HR who asked some general questions to further qualify  candidacy for the position. This was  followed by second phone interview with direct manager and immediate co-workers.", "Interview Questions": "Describe one of your successes"}, {"date": "12 Jul 2018", "title": "RN Residency Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at ChristianaCare", "Interview Descriptions": "Contact through HR. Interview process included one in person interview with a panel of four interviewers.  Interview was about an hour long, and included multiple expected nursing related interview questions. Questions were of average difficulty, interviewers were nice.", "Interview Questions": "Strengths/Weaknesses "}, {"date": "25 Jun 2018", "title": "Anonymous Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at ChristianaCare", "Interview Descriptions": "Submitted application; contacted by HR 3-4 weeks later. Completed 30 minute phone screen during which I was asked about my resume experiences. About 1.5 weeks later, completed an in-person interview consisting of a panel that lasted just over an hour. Was told I should hear from HR within 2-3 weeks but I didn't hear anything after the interview.", "Interview Questions": "Describe a time you had a difficult patient"}, {"date": "12 Sept 2021", "title": "Nurse Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at ChristianaCare (Wilmington, DE) in May 2018", "Interview Descriptions": "Over the phone interview, got the job within minutes.very easy and out going questions. The application part took the longest. They will send\r\nyou multiple emails during the hiring process so be on the lookout. For potential emails", "Interview Questions": "How many years of home care experience do you have ?"}, {"date": "24 Apr 2018", "title": "Pharmacist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at ChristianaCare", "Interview Descriptions": "I had a phone interview with somebody from HR. They asked me many of the same questions that were on the online application that I filled out and submitted. I never heard back from them after the phone interview.", "Interview Questions": "Are you currently interviewing with any other companies?"}, {"date": "13 Apr 2018", "title": "Critical Care Nurse Residency Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at ChristianaCare", "Interview Descriptions": "The online video interview was the most stressful part in my opinion. Says there will be 11 or 12 questions but there ended up only being 5 that required a video response. The in person interview was a panel with the nurse educator and 2 RNs.  All questions we're behavioral based questions", "Interview Questions": "Name a time you had a conflict / how did you deal with it (doesn't have to be nursing related)"}, {"date": "10 Apr 2018", "title": "Nurse Resident Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at ChristianaCare (Newark, DE) in Apr 2018", "Interview Descriptions": "It was a panel of three people and a series of questions. It was relaxed and more of an open conversation. It was about 45 minutes. Very quick with getting interviews done and letting you know where you stand.", "Interview Questions": "Why did I become a nurse?\r\nClinical scenario questions"}, {"date": "7 Mar 2019", "title": "Student Nurse Extern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at ChristianaCare (Newark, DE) in Mar 2018", "Interview Descriptions": "This process spanned about a month. \nIt started off with uploading the requirements online. A couple of days later I got an email about getting references to fill out an online survey on my performance (so have your clinical references ready before applying, at least 2). \nAfter the references, I did an automated online interview that had 7 video questions and like 5 written questions. The video questions ranged from \"Tell me about your clinical experiences\" to \"Why Christiana?\" to \"Tell me about a time you dealt with a difficult patient\". \nAfter completing this online interview, I received an email to schedule an in-person interview at the Newark hospital. The interview lasted a solid 45 min- 1 hour. The interviewers were both nurses, very kind and encouraging. \nMake sure to get their business cards/emails so you can contact them afterwards thanking them for the opportunity. \nAlso, wear something professional, but also something that stands out! (Oh I remember her, she wore that yellow dress) \nAlso, relax. Trust in the process. Go over your answers and give them the old' Excellence and Love razzle dazzle!", "Interview Questions": "Why Christiana? "}], [{"date": "6 Jun 2018", "title": "Staff Accountant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at ChristianaCare in Mar 2018", "Interview Descriptions": "Very friendly recruiter. She is very patient. The entire interview is relaxed. There was no tough question, just normal interview question, such as your past experience and your educational background.", "Interview Questions": "Describe one of your experience of teamwork"}, {"date": "8 Oct 2022", "title": "Construction Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at ChristianaCare (Wilmington, DE) in Feb 2018", "Interview Descriptions": "Informal interview with director of facilities. The interview was very informal, not a lot of technical questions. The dress code for executives and managers is very formal. The culture seems very cut throat and challenging.", "Interview Questions": "Why do you want this job? Describe your past experience"}, {"date": "15 Nov 2017", "title": "Home Health Supervisor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at ChristianaCare in Nov 2017", "Interview Descriptions": "Applied online and completed the assessment. Got an email within a week for a recruiter interview. Interview went very well, and she quoted salary and benefits. She told me to expect a call from the manager for a face to face interview. I got a rejection letter 2 business days later. Needless to say, I am confused. I’ve done hiring myself, and you never tell someone to expect another step in the interview process unless you mean it. She was very nice and professional.  I emailed about my confusion, but I have gotten no response. It’s disappointing.", "Interview Questions": "Situational questions about past experiences"}, {"date": "31 Dec 2018", "title": "Licensed Practical Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at ChristianaCare (Newark, DE) in Oct 2017", "Interview Descriptions": "Phone interview & panel interview with 1 nurse,1 manger, 1 supervisor & 1 doctor in the room. It was easy - they asked about my experience, my expectations, why I wanted to work there. It was a good experience.", "Interview Questions": "List your scope of work \r\nChallenges you dealt with "}, {"date": "6 Oct 2017", "title": "RN Residency Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "The process took 7 weeks. I interviewed at ChristianaCare in Sept 2017", "Interview Descriptions": "Applied and got an email saying I was selected for a web virtual interview about a week later. Did that and got a call within a few days to set up an interview in person the following week. After interview I didn't hear back for over a month. I know I was more qualified to get the job than most applicants but I believe they hire lots of UD and del tech grads. The in person interview was quick and a bit dry. I didn't feel good coming out of it and a bit uninterested in the job to be honest. Maybe they sensed it? It was my first interview so it was nice experience.", "Interview Questions": "What are some things you saw in the ED?"}, {"date": "16 Aug 2017", "title": "Unit Clerk Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at ChristianaCare (Newark, DE) in Jul 2017", "Interview Descriptions": "The hiring process was very efficient. The staff seemed to care about the future employees right from the beginning. I did have to wait longer than expected for a face to face interview but it was wirth the wait.", "Interview Questions": "Describe a time you had to solve a problem at your previous job."}, {"date": "8 May 2017", "title": "Program Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at ChristianaCare (Newark, DE) in Apr 2017", "Interview Descriptions": "Process took about 4 weeks. Talked to HR recruiter, then in-person interview with hiring manager/future supervisor. During the interview, talked about why I want to work at Christiana Care, future endeavors and went over resume to highlight relevant experience. Pleasant interview process. Formal but casual environment.", "Interview Questions": "Go over resume and past experiences. "}, {"date": "22 Feb 2017", "title": "Administrative Role Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "The process took 5 days. I interviewed at ChristianaCare", "Interview Descriptions": "I was contacted by an HR Coordinator by email and asked about my relevant experience. Once I responded, the rep was very excited and I was sent an assessment and told to complete it.  Before starting the assessment, another HR rep viewed my profile on LinkedIn. It's private, so all you see is my current title (relevant) and my photo.  I never heard from the organization again despite attempts to contact them. Obviously, this is quite disconcerting.", "Interview Questions": "Do you have at least five years of relevant experience?"}, {"date": "24 Jul 2017", "title": "Service Assistant I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at ChristianaCare (Newark, DE) in Dec 2016", "Interview Descriptions": "The interview process is very smooth. The manager is very nice and asks the typical interview questions. Provides a description of the job but does leave some vital information out.", "Interview Questions": "Why do you want to work for christiana care?"}, {"date": "15 Apr 2017", "title": "Intern Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at ChristianaCare (Newark, DE) in Dec 2016", "Interview Descriptions": "Spoke with different members of the department, interviewed with 2 to 3 employees. Relatively short interview with direct questions. Big hospital so be sure to leave plenty of time to park and find a spot. It takes a decent amount of time to walk within the hospital's campus. Be sure to bring copies of your resume for all members of the panel.", "Interview Questions": "Where do you see yourself in 10 years?"}], [{"date": "12 Apr 2017", "title": "Recruiter Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. The process took 2 weeks. I interviewed at ChristianaCare (Newark, DE) in Sept 2016", "Interview Descriptions": "Phone interview with agency, face to face interview at agency, and interview with hiring manager.  I was essentially offered the position on the spot, pending successful completion of background check.", "Interview Questions": "Interview was straightforward questions about experience.  No situational or behavioral questions. "}, {"date": "15 Nov 2016", "title": "Patient Care Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at ChristianaCare (Newark, DE) in Aug 2016", "Interview Descriptions": "The interview process was pretty easy. They called and scheduled a phone interview with the HR department. Once the phone interview was complete (after about 5 days or so) I received a call from HR saying they wanted to schedule and interview with the Nursing managers from the unit I applied to. I interviewed with my Nursing manager and Assistant Nurse manager, it was about 20 minutes long. They asked me the basic questions, why do you want this job etc. I was offered the job a few days later via phone call.", "Interview Questions": "Why do you want to work for Christiana Care?"}, {"date": "29 Apr 2016", "title": "Nurse Resident Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at ChristianaCare (Wilmington, DE) in Apr 2016", "Interview Descriptions": "I had one phone interview followed by an in-person interview. It was a little intimidating with 6 people questioning me at once. The questions were expected questions, nothing too difficult or unforseeable. They did ask nursing-related questions though (with patient scenarios). I also was able to get a tour of the unit.", "Interview Questions": "Tell us about a time where you showed your ability to multitask"}, {"date": "29 Oct 2016", "title": "Office Assistant/Medial Receptionist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. The process took 3 days. I interviewed at ChristianaCare (Newark, DE) in Apr 2016", "Interview Descriptions": "Atmosphere was very comfortable which made me feel right at ease. Interviewers were very nice and understanding of my nervousness. The panel was professional but also it was so comfortable and relaxing, we could throw in a little humor. I felt as if I had the job on the spot because the interview was on a Friday and they asked me if I was available on Monday. Of course I had to wait for the temp agency t contact me.", "Interview Questions": "How do I deal with irate customers."}, {"date": "17 Feb 2016", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at ChristianaCare (Wilmington, DE) in Feb 2016", "Interview Descriptions": "I apply to every single opening that fits for my experience as a new grad. Eventually i received a email to do a assessment. The assesment had the general very much agree/disagree format with a ton of math. It was timed.\r\n\r\nThen i had a recruiter call me and transcribe a interview.\r\n\r\nThen i had another recruiter interview me for a specific job.\r\n\r\nThen i had another call from a secretary of a nurse manager to set up an face to face interview.\r\n\r\nthe face to face interview consisted of nurse manager, charge nurse and assistant manager. \r\n\r\nInterview lasted an hour with a tour of the floor to finish it off. i was one of twenty applicants. i was told the decision would be by the end of the week and i would recieve a call. two weeks later and nothing.", "Interview Questions": "What was the most diffult patient you have had to deal with"}, {"date": "15 Oct 2015", "title": "Staff RN Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at ChristianaCare", "Interview Descriptions": "The interviewer asked several different questions: how do you handle difficult patients, give an example; why do want to work for Christiana Care, any questions for the interviewer, your best and worst traits, etc.", "Interview Questions": "What is your best and worst trait?"}, {"date": "18 Jul 2015", "title": "IT Applications Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 days. I interviewed at ChristianaCare", "Interview Descriptions": "Recruited externally...phone interview.  Went on-site, spent about 20 minutes with 5 IT employees.  Went to HR, filled out an application, talked to an HR rep.\r\n\r\nThe IT team were all cordial and straightforward.  The HR person seemed to hate life and allegedly is the one who DQ'd me for a comment about how I had problems finding the interviewer as it was before the typical workday.", "Interview Questions": "Explain a time where you've had a deadline and how you handled it."}, {"date": "17 May 2015", "title": "RN Staff Nurse Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at ChristianaCare", "Interview Descriptions": "easy and quick. Very friendly managers and recruiters. Everything is done in a timely manner. Make you feel comfortable during the enterview. Plenty of opportunities for questions. Called back the same day after the enterview.", "Interview Questions": "Why do you want to work at Christiana care"}, {"date": "25 Jun 2016", "title": "Chaplain Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at ChristianaCare (Newark, DE) in May 2015", "Interview Descriptions": "People are very easy to interview. I had interned for the organization. Being a chaplain is all about relationship, forming connections with people and being able to listen to people. They want people who are authentic to who they are and willing to learn and do the work.", "Interview Questions": "Why do you want this position? How do you engage with people?"}, {"date": "5 Jun 2015", "title": "Student Research Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at ChristianaCare (Newark, DE) in May 2015", "Interview Descriptions": "Overall, it is very informal.  I met with three groups of people. Mostly talked about the different aspects of this internship; technical skills, past experience, and teamwork experience. After meeting with the team, I had a phone interview with the HR to discuss compensation, and schedule. The lady was very nice and professional. The pay was not as well as I expected.", "Interview Questions": "Why Christiana Care, why healthcare. Why did I leave my last position."}], [{"date": "28 Jun 2016", "title": "Patient/Physician Access Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at ChristianaCare (Newark, DE) in Sept 2014", "Interview Descriptions": "I had a phone interview first. Then I interviewed with the assistant director. I also had to fill out a three page document that had questions about your personality and also spelling questions. The interview lasted around a half hour. The basic questions about why you are qualified and your experience were asked.", "Interview Questions": "Why would you be a good fit for this position?"}, {"date": "6 Nov 2018", "title": "Pct Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at ChristianaCare (Wilmington, DE) in Sept 2014", "Interview Descriptions": "short unprofessional , manager kept answering her phone act as though she didn’t want to be there. She brag how she got the job because of her connection. christiana care is very clicky", "Interview Questions": "Why you want work here?"}, {"date": "13 Jun 2014", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at ChristianaCare", "Interview Descriptions": "Everyone on staff was very kind to me. Setting up my interview was easy, and the interviewees were very nice. I've only had one interview prior to this so I do not have much to compare it to, but it was very relaxed. They read off a list of questions.", "Interview Questions": "Describe a situation where you disagreed with another worker and how you resolved it."}, {"date": "4 Aug 2017", "title": "Patient Care Technician Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at ChristianaCare (Newark, DE) in Jun 2014", "Interview Descriptions": "Panel interview with nursing staff on the floor. Went to managers office. Was a bit crowded. Each person was given the opportunity to ask questions in regards to my skills and ability to accomplish tasks", "Interview Questions": "Tell me about yourself"}, {"date": "10 Jun 2014", "title": "Patient Care Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at ChristianaCare (Wilmington, DE) in Apr 2014", "Interview Descriptions": "Got a phone call about recieving an interview, was called onto the unit and had the interview with the floor nursing manager & also the scheduling manager sat in. Went very well- basic \"why do you want to be a nurse, and what experience do you have so far:\" \"Why do you want to work on this type of floor\" etc. \r\n\r\nFollowed up with a background check online & a phone call from HR with another interview with basically scenario questions basic nursing drill. They offered me the position over the phone with hourly rate and scheduling. \r\n\r\nVery great experience", "Interview Questions": "5 good qualities about myself (always hard for me to give myself the credit i deserve) "}, {"date": "8 Sept 2014", "title": "Staff RN/E Care Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at ChristianaCare (Newark, DE) in May 2013", "Interview Descriptions": "I met with the manager who did not ask me one question regarding my experience or job history. Less than 5 minutes were spent in the interview process and then I was taken to observe the working staff and permitted to ask questions. I was given the impression that the interview was merely a formality and that I would be offered the position as I was highly qualified.", "Interview Questions": "N/A"}, {"date": "1 Nov 2017", "title": "Material Handler Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at ChristianaCare (Newark, DE) in May 2013", "Interview Descriptions": "A Human Resources employee will contact you first, there will be a phone interview then a face-to-face interview with the area supervisor.  If you are not offered the job, you will get an email.", "Interview Questions": "Where I want to be in 5 years"}, {"date": "3 Feb 2016", "title": "Ultrasound Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 2 weeks. I interviewed at ChristianaCare (Newark, DE) in Mar 2013", "Interview Descriptions": "Interviewed with section supervisor and met with HR after for job offer. We went over expecations of job requirements and limitations, was asked to scan to prove compitent, and later met with HR to discuss further paper work to be completed along with the job offer listed in writing for me to sign. Great experience", "Interview Questions": "How do you feel that you would benefit as a team member"}, {"date": "22 Feb 2013", "title": "Senior HRIS Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at ChristianaCare (Wilmington, DE)", "Interview Descriptions": "I have been called by a manager and scheduled phone round interview. And phone round went around 40 minutes. All are behavioral questions..like\r\n1. What is the innovative idea that you have given?\r\n2. When is the time you have learnt something new for your job?\r\n3. What is the most you like in your current job?", "Interview Questions": "Nothing was unexpected...I was able answer almost all of them. But after 2 days, I got an email that I am not short listed for further process."}, {"date": "29 May 2015", "title": "IT Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at ChristianaCare in Jan 2013", "Interview Descriptions": "If you receive an interview in IT, be prepared to wait a while as they have to coordinate schedules. So you may be waiting a while just to get in. \r\n\r\nIf you do your research, you'll see that there are a lot of IT folks that have been there for quite a while. Also one thing to note is to watch the job postings as they \"renew\" them. So you may see a spot come and go, but that job positing has been there for months. I got the feeling that they are very picky, so look at the job requirements, and the more you fit, the better your chances.", "Interview Questions": "The interviews vary between departments, but be prepared to discuss your current/past duties. You will most likely have a long detailed and lengthy interview process that is tailored to your current skills set. "}], [{"date": "4 Aug 2012", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at ChristianaCare (Wilmington, DE)", "Interview Descriptions": "Took a month to get the interview after submitting online application then over 2 weeks for the offer and another 2 weeks before orientation started; met with HR first then the assistant Nurse Manager", "Interview Questions": "Can't recall any difficulty during the interview process for a staff position "}, {"date": "18 Jun 2013", "title": "Senior Analyst Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 2 months. I interviewed at ChristianaCare (New Castle, DE) in Jul 2012", "Interview Descriptions": "Was behind the scenes of HR.  Didn't get hired the normal route.", "Interview Questions": "N/A"}, {"date": "30 Jul 2016", "title": "Program Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at ChristianaCare (Wilmington, DE) in May 2012", "Interview Descriptions": "Applied to the position and was contacted by HR manager within 2 weeks. Interview was very straightforward, but standard and somewhat generic. Two people (one senior manager, one person from department who was pulled in to fill a spot and had nothing to do with position) asked me questions off of a list that they went through. Generic strengths/weaknesses, behavioral-based experience questions. Not a ton of feedback during interview, but I was offered the position.", "Interview Questions": "Tell me about a time in the recent past that you had an ethical dilemma and how did you handle it?"}, {"date": "1 Jul 2011", "title": "Biomedical Equipment Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 days. I interviewed at ChristianaCare (Newark, DE) in Oct 2009", "Interview Descriptions": "I interviewed first with HR, and one on one interview, then I interviewed with the Director, and Supervisor.  All in all, both interviews lasted about 3.5 hours. I left the interview feeling as though I did not get the job, but the next day they called and gave me an offer. I accepted and started one month later.", "Interview Questions": "Where do you see yourself 5 years from now."}]]