[[{"date": "19 Dec 2022", "title": "Control Desk Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Worcester Polytech", "Interview Descriptions": "No interview was required for this position. This may be different for different people and if a lot of students are interested in the job. Interest does fluctuate throughout the year.", "Interview Questions": "N/A"}, {"date": "26 Jan 2023", "title": "Chemical Engineer Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Worcester Polytech (Worcester, MA) in Nov 2022", "Interview Descriptions": "The interview was for a student internship. It was very gentle and respectful. I did not feel that I was being asked questions that put my on the spot. I felt that I could guide the interview and I was asked what I would like to do or contribute.", "Interview Questions": "Our lab does __, ___, and ____. Which of these do you find most interesting or do you have your own ideas for research?"}, {"date": "24 Oct 2022", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Worcester Polytech in Apr 2022", "Interview Descriptions": "Simple process; interviewed with Principal Investigator. straight forward questions and not too difficult. PI was very nice to speak with; be able to speak about your experience and why you would be a good fit", "Interview Questions": "Tell me about your experience and why you would be a good fit."}, {"date": "16 Jul 2022", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 days. I interviewed at Worcester Polytech (Worcester, MA) in Mar 2022", "Interview Descriptions": "They ask normally about your skills, why you will fit for the position, how you could help them. Also, the professor are very intelligent and could detect if you are not a perfect fit and your skills doesn't match what you wrote in resume", "Interview Questions": "How can you help in project I am working on ? "}, {"date": "28 Jan 2022", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Worcester Polytech", "Interview Descriptions": "First I reached out to a professor/lab manager expressing my interest in the work they do and possibly joining the team, arranging a meeting/call as an informal interview to see your fit for the role, subsequent position acceptance/declination", "Interview Questions": "What interests you about this research lab?"}, {"date": "3 May 2021", "title": "Social Media Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Worcester Polytech", "Interview Descriptions": "Had call with HR. HR set up interviews. Met with several people at once at the offices and then individually with hiring manager.  Several month long application and  interview process.", "Interview Questions": "What do you look forward to bringing to the role?"}, {"date": "21 Apr 2021", "title": "Student Tour Guide Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Worcester Polytech", "Interview Descriptions": "a very informal and comfortable process with the executive board of the organization asking different scenarios and further questioning based on responses. met with multiple different members of exec to get to the next round", "Interview Questions": "What would you do if someone asked if you only got into WPI because you are a woman and they are trying to even out the ratio?"}, {"date": "2 May 2021", "title": "Academic Advisor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Worcester Polytech in Mar 2021", "Interview Descriptions": "There were 2 rounds for the interview. The first one was with a few other academic advisors (including the hiring manager/director). That lasted an hour. The 2nd interview was much longer and consisted of 3 parts. For the first part, candidates needed to prepare an 8-10 minute presentation. Second part was an interview with the entire advising staff. The final (third) part was an interview with \"campus partners\" (residential life, student services, etc.) and that was an hour long. Total time for the 2nd interview was 2 hours and everything was done over Zoom (likely due to COVID).", "Interview Questions": "When do you feel frustrated?\nQuestions about student scenarios (situations about how to handle an anxious parent, student engaging in concerning behaviors, etc.)"}, {"date": "9 Dec 2020", "title": "Registrar Services Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Worcester Polytech", "Interview Descriptions": "The interview process took about 4-5 weeks. It was very simple. I applied online, heard back in a week, and then had my first interview the following week. Second interview was held through Zoom due to Covid-19.", "Interview Questions": "Are you good with time management?\nHow do you handle stress?\nWhat do you define as your weaknesses?\nWhat experience do you have with customer service?"}, {"date": "23 Dec 2021", "title": "Undergraduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at Worcester Polytech (Worcester, MA) in Dec 2020", "Interview Descriptions": "The process was great, you  need to prepare for the interview and acquire a decent amount of knowledge in the specified area while having a handsome face to get the job", "Interview Questions": "Do you have any experience with IBM SPSS"}], [{"date": "17 Sept 2020", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Worcester Polytech", "Interview Descriptions": "First application is resume with experience mentioned. then the resume sorting step is there after that a face to face interview and then panel discussion for final result. the over all process took 7 days and then the job started", "Interview Questions": "Questions about the subject and course work"}, {"date": "14 Sept 2020", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. I interviewed at Worcester Polytech (Worcester, MA)", "Interview Descriptions": "It was a very straightforward interview where I met with the head of the processing lab and was given a general idea of what the summer internship was going to look like.", "Interview Questions": "Do I have experience in working on research before? "}, {"date": "25 Apr 2021", "title": "Admissions Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Worcester Polytech (Worcester, MA) in Oct 2019", "Interview Descriptions": "First and second Interview was conducted over the phone.  The interviewer talked a lot and asked a few questions.   Both interviews took about an hour to complete.   It was a standard interview.", "Interview Questions": "What experience do you have in admissions?"}, {"date": "22 Oct 2019", "title": "Assistant Director of Systems Support and Training Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Worcester Polytech (Worcester, MA) in Aug 2019", "Interview Descriptions": "First interview: phone interview with the hiring manager\r\n\r\nSecond interview: video interview with team and hiring manager (1 week, 2 days after first interview). Basic interview.\r\n\r\nThird interview: in person interview with same team members as second interview, then another interview with people I'd tangentially work with (24 days after second interview). The first interview was the exact same as the video interview, but it had been so long, I don't think anyone realized they asked the same questions. I was told that they would have a decision by either the end of the next week, or the week after at the latest.\r\n\r\nFinal decision was 55 days after the first interview, 22 days after third interview, and 4 days after the stretch date for their final decision.\r\n\r\nThe people and team were nice enough but it's extremely disrespectful to applicants' time to expect them to wait 55 days between the phone screen and the final selection.", "Interview Questions": "When would you use a join rather than a subquery?"}, {"date": "13 May 2020", "title": "GA Position - QA Tester Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Worcester Polytech (Worcester, MA) in Aug 2018", "Interview Descriptions": "The application/interview process was pretty easy.  I applied to a few different GA positions on WPI's website. Within a week, one of the professors was impressed by my cover letter and resume, so she asked me to come in for an interview.  \r\n\r\nThe interview was pretty relaxed, with the focus mostly just being on getting to know each other.  It felt more like a conversation than an interview.  She offered me the job on the spot.", "Interview Questions": "I don't remember any specific questions because, again, it felt more like a conversation than an interview.  One thing I can say is she liked that I talked about UX in my cover letter."}, {"date": "13 Jul 2018", "title": "Assistant Director Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Worcester Polytech", "Interview Descriptions": "It was an all day interview and different people from different offices meet and interview you throughout the day. You get to meet students and  tour the campus. It's helpful because you get a general feel for what the campus is like.", "Interview Questions": "Why do you want to work at WPI?\r\nWhat do you consider are your strengths?"}, {"date": "1 Jul 2018", "title": "Director of Infrastructure Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Worcester Polytech (Worcester, MA) in May 2018", "Interview Descriptions": "HR filter call was 20-30 min on day one. Day two was 45 min interview with CIO. CIO asked pre-noted questions and typed in her notes as spoke. I was able to get a few reads from the interview. Read one, I sensed the disinterest rather quickly from CIO. Read two, the CIO was new and was bringing a whole new approach. I sensed the new approach was going to be aggressive by the way the CIO referred to their current culture. Read three, the CIO is not going to be easy to work for.", "Interview Questions": "What is your management style. "}, {"date": "27 Mar 2018", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Worcester Polytech (Worcester, MA) in Mar 2018", "Interview Descriptions": "I applied online through their career portal and received a call from the department director (hiring manager) about 2~3 weeks later. He did an initial phone interview but it was quite brief and felt pretty relaxing, it was more like chatting and getting to know me. Then a couple days later, he emailed me to schedule an interview (he gave me a date and a time) and of course I was excited to accept. \r\n\r\nThe interview went well, it was like a panel interview with the director and 4 other team members of the department. They were very nice and showed genuine interest in me throughout the whole process. \r\n\r\nA few days later, the director called me on the phone and offered me the position. The salary range was pre-determined and was declared on the job listing, which is standard for staff positions in higher education setting.", "Interview Questions": "Why are you interested in this position?"}, {"date": "13 Jul 2018", "title": "Developer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Worcester Polytech in Mar 2018", "Interview Descriptions": "Was good and fast process. Easy questions.Qns asked were easy. Not very lengthy. was very fast and was not at all tough.could have been faster. i liked interviewer.was at their office. not at location. and very very easy", "Interview Questions": "gneral qns"}, {"date": "29 Oct 2017", "title": "Financial Analyst Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at Worcester Polytech", "Interview Descriptions": "phone interview and the technical recruiter interview with technique question. then the group make the interview for the team based the behavior management  and do the source. make sure you handle all the questions", "Interview Questions": "N/A"}], [{"date": "29 Oct 2017", "title": "Student Success Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Worcester Polytech (Worcester, MA) in Oct 2017", "Interview Descriptions": "Standard phone interview with 2 people, then an on-campus interview a week later meeting with 3 people, then a week after that another on-campus with 3 different panel interviews, back to back, each an hour long. Then an hour long lunch with some of the team and then a half hour with HR on benefits. The process was fairly grueling for a mid-level individual contributor job, but the people were nice and I felt things went well. I mark it as a negative experience only because of the way they delivered the news that they went with someone else. They originally told me to expect a call that afternoon. Then they emailed and said it would be the following Monday. Then on Monday they emailed and said it would be Tuesday. Then on Tuesday they just emailed me that they went with someone else and when I requested some feedback they responded politely but never really gave any feedback. It was frustrating as they had requested so much of my time during a week that was already very challenging for me. I felt a phone call would have been more professional.", "Interview Questions": "How would you deliver bad news to people?"}, {"date": "30 Mar 2020", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at Worcester Polytech (Worcester, MA) in Mar 2017", "Interview Descriptions": "The interview was good overall. Yet, we didn't speak about which topic to study in detail. Because of this, I had a problem with my adviser on planning my PhD study plan and thesis topic. Therefore, I thought the program is not a good fit for me and I left it just after completing my first year.", "Interview Questions": "Why are you interested to study at our PhD program?"}, {"date": "23 Jan 2017", "title": "Advancement Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Worcester Polytech (Worcester, MA) in Dec 2016", "Interview Descriptions": "I was selected for an interview and met within a weeks time. Originally I was told I was to meet with 4 people at 2 different times, I ended up meeting with 3 people at one time. I had thanked the interviewers and followed up numerous times. I eventually found out they hired someone else when I researched the department online. They never informed me they chose another candidate. It would have been professional to follow up with me and let me know, just be honest.", "Interview Questions": "Name one time I was in a position where I manages a project? Describe that project..."}, {"date": "7 Jul 2016", "title": "Instructional Designer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Worcester Polytech (Worcester, MA) in Jun 2016", "Interview Descriptions": "The first interview was done through Skype and felt much more of a \"get to know you\" situation.  As much as they interviewed me, I was able to interview the core team and really get a sense as to whether they would be a good fit for me as a professional.  The second interview involved spending 3 hours on campus. Prior to coming to campus, I was asked to send a portfolio with examples of my design work. First I met with the Associate Director and she debriefed me a bit.  The next part involved having a variety of staff - tech team members, faculty, and others - at a table shooting questions at me from all angles for over an hour.  It was incredibly stressful at points, but the core team that I had Skype'd with originally were very supportive and acted as buffers.  Following the interview, I was given a tour of the campus and was able to ask questions as they cropped up, as well as meet some of the team members outside of an interview setting.  The day was wrapped up by going over benefits with an HR representative.", "Interview Questions": "What do you think the most important aspect of working with a subject matter expert is?"}, {"date": "22 Sept 2015", "title": "Mail Clerk Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Worcester Polytech (Worcester, MA)", "Interview Descriptions": "Simple quick and easy. It was not a hard position to apply for, but in the end it has been very fruitful. It has met my needs as a student while also being very flexible on time regarding meetings and other academic requirements.", "Interview Questions": "How flexible with different kinds of work are you?"}, {"date": "19 Sept 2015", "title": "Math Department PLA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Worcester Polytech", "Interview Descriptions": "they just have you teach a math problem to them as if you are a student, then you talk about your performance in your previous math courses and if you seem like you can communicate well and teach well then they'll give you a shot. the math problem they ask you to teach is selected from a short list of problems they provide beforehand, so it's not a big surprise or anything", "Interview Questions": "\"pretend to teach me how to do this math problem\""}, {"date": "15 Dec 2015", "title": "Librarian Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Worcester Polytech (Worcester, MA) in Jun 2015", "Interview Descriptions": "The process was the same intense dog and pony show that is typical of institutions this size and reputation. I got some bad vibes during the interview and had pretty much decided I wasn't going to take the job if it was offered (which it wasn't), but the call I got felt unnecessarily harsh. It felt like they were rubbing it in that I wasn't being offered the job. I was told \"your qualifications don't match our needs\" and I wanted to response \"then why did you bring me to campus?\" but I didn't. Also, it took forever to get reimbursed for my travel expenses.", "Interview Questions": "Tell us some conclusions to the article you're still writing."}, {"date": "30 Dec 2014", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 3 days. I interviewed at Worcester Polytech", "Interview Descriptions": "good i liked it. it was good overall. professor themselves takes an interview to select.good i liked it. one round of personal interview was done to select from the process.", "Interview Questions": "N/A"}, {"date": "28 Mar 2015", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 5 days. I interviewed at Worcester Polytech (Worcester, MA) in Nov 2014", "Interview Descriptions": "I applied the interview online through the school official website. Then a receive a mail regarding the phone call. The interview went smooth. nothing too technical but mainly the previous experience regarding VB and access control.", "Interview Questions": "experience regarding VB and access control"}, {"date": "7 Apr 2014", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Worcester Polytech", "Interview Descriptions": "There was en email exchange about the job position. It was fairly simple and laid-back.", "Interview Questions": "The questions were fairly simple."}], [{"date": "6 Mar 2014", "title": "Lab Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Worcester Polytech", "Interview Descriptions": "went to the job fair where I talked with the lab manager who told me about the job. I then submitted the required paperwork and started working imediatly", "Interview Questions": "N/A"}, {"date": "4 Mar 2013", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied in-person. I interviewed at Worcester Polytech", "Interview Descriptions": "I just mailed the Director, telling him of my intentions to join a robotics lab as a graduate student, but having not having any real experience with robotics. He said i should apply for an SA position and get involved with the undergraduate students...and that was it!", "Interview Questions": "N/A"}, {"date": "18 Apr 2013", "title": "Peer Advisor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Worcester Polytech (Worcester, MA) in Mar 2013", "Interview Descriptions": "BEING INTERVIEWED by the CDC ill have to admit it was very intimidating. had some questions regarding my previous experiences with images blogs and qhet the CDC has to ofeer. went really good but dont know yet if i have the job", "Interview Questions": "What will you bring to the CDC"}, {"date": "9 Dec 2013", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Worcester Polytech (Toledo, OH) in Mar 2013", "Interview Descriptions": "one phone group interview", "Interview Questions": "how do you value this program"}, {"date": "27 Mar 2014", "title": "Teaching Assistant and Researcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Worcester Polytech (Worcester, MA) in Aug 2012", "Interview Descriptions": "One interview.  I just had to present on a calculus topic of my choosing.", "Interview Questions": "Was asked to determine the position of a projectile as a function of time."}, {"date": "2 Nov 2015", "title": "Assistant Director Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 months. I interviewed at Worcester Polytech (Worcester, MA) in Jan 2012", "Interview Descriptions": "It was long and drawn out. Thankfully, I was looking at many different places at the time so it wasn't a big deal that it took so many months. I interviewed in a group setting, which was great because it helped make the time on campus worthwhile. However, after interviewing it took many check-ins to determine the next steps in the process. Leadership had a hard time moving forward with selection in a timely manner. It took almost 3 months before they made an offer.", "Interview Questions": "What could I bring to the team"}, {"date": "3 Apr 2014", "title": "Resident Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Worcester Polytech (Worcester, MA) in Jan 2012", "Interview Descriptions": "Group interview, round-robin interview, and individual interview", "Interview Questions": "If you could be any household appliance, what would you be?"}, {"date": "9 Dec 2015", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Worcester Polytech (Worcester, MA) in Jul 2011", "Interview Descriptions": "I interviewed first with department. Second interview was with future boss and his boss. Was asked the normal questions. I was given an Excel report to make changes to in advance of the second meeting.", "Interview Questions": "I was given a report to prepare in advance of the interview."}, {"date": "7 Oct 2014", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Worcester Polytech (Worcester, MA) in Jan 2011", "Interview Descriptions": "As a Teaching Assistance at this school, there is no difficulties at all to approach any professors to get hired as a Research Assistance. It is just the matter of which topic you choose and what your background is. I emailed a professor that I was interested in and wrote my intention and my background. Later on he relied and asked to meet. Then we met for about 1 hour and half discussing my previous research experiences and future projects. We were both satisfied after the meeting then I became a Research Assistance.", "Interview Questions": "No unexpected questions. The whole conversation with the interviewer (later became my advisor) focused on previous research experiences"}, {"date": "7 Mar 2014", "title": "Teaching Assistant/Graduate Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Worcester Polytech in Mar 2010", "Interview Descriptions": "I sent an application for graduate school which resulted a phone interview.  I was then invited for two days where I was shown around the school and building I potentially would be working in and meet several Professors who told me about their work.  A few weeks latter I received an official letter of acceptance as well as my Teaching Assistant scholarship award letter.", "Interview Questions": "They didn't really have a hard interview process, nothing really stands out.  I think at that point I was basically accepted in the school."}], [{"date": "8 Jun 2012", "title": "Graduate TA Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 2 days. I interviewed at Worcester Polytech (Worcester, MA) in Aug 2009", "Interview Descriptions": "Pretty informal.  Advisor went over his research and I asked questions.  I had to dedicate to his lab in order to get accepted, so at first I wasn't too thrilled since it left me with no other options to explore.  But overall, the interview process was not difficult.  TA is assigned by department but you can switch with someone if they agree with it.  Workload for TAs is pretty high.", "Interview Questions": "Tell me about your background in the field."}, {"date": "20 Jan 2010", "title": "Senior Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Worcester Polytech (Worcester, MA) in Apr 2009", "Interview Descriptions": "I sent in their application, and a few weeks later was contacted for a short interview. The interview was just a little time reviewing the application, and then a series of open ended questions about past experience with this sort of tutoring work, a few \"What would you do if...\" questions about some of the more extreme potential scenarios of the job, and asking me which courses I felt comfortable teaching. I got the feeling that past course performance and ability to answer questions reasonable were about equally important to getting the job.", "Interview Questions": "A student comes to your office hours asking for help with the latest homework assignment. Shortly after you begin talking, she bursts into tears - her mother just died, and she's clearly pretty distraught. What do you do?"}, {"date": "21 Jan 2011", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 months. I interviewed at Worcester Polytech (Worcester, MA) in Feb 2009", "Interview Descriptions": "Applied online and got it", "Interview Questions": "N/A"}, {"date": "29 Nov 2012", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 5 weeks. I interviewed at Worcester Polytech (Worcester, MA) in Nov 2008", "Interview Descriptions": "Hired me by email contact and one phone interview.\r\nVisited university to present my research work", "Interview Questions": "Need to present my work to two professors and ten grad students."}]]